{
  "video_id": "FDa1hBwjv10",
  "url": "https://www.youtube.com/watch?v=FDa1hBwjv10",
  "title": "Senate Day 27 of the 2025 PM Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 181,
  "summary": "Here is a structured markdown summary of the Georgia Senate Day 27 of the 2025 PM Session session:\n\n**Overview**\nThe session primarily focused on the passage of Senate Bill 4, which made several revisions to the roles and training requirements for local boards of education in Georgia. There was some debate around the scope of training content, which was addressed through an amendment.\n\n**Key Actions**\n**SB 124**: Introduced and referred to committee\n\n**Bills Introduced (First Reading)**\n- SB 124 by Senator Isakson (48th) and others - Relating to certain tax credits\n\n**Notable Moments**\n- Debate and amendment of SB 4 to clarify restrictions on training content related to pending/future legislation affecting public schools\n- Discussion between senators on addressing concerns of local boards of education\n\n**Votes**\n- Amendment #1 to SB 4 proposed by Senator Dolezal (27th) - Passed\n- SB 4 as amended - Passed 36-11\n\n**Attendance**\nA quorum was present for the session.\n\n**Adjournment**\nThe session was adjourned. The next session will convene on the following day.",
  "transcript": "Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Secretary Reed, Senate Bill 4. Senate Bill 4 by Senator Dolezal, the 27th and others, the Bill of Fame, Title 9th to amend Chapter 2, Title 20. The official got a Georgia annotated, related to elementary and secondary education, so as to revise provisions relating to the fundamental roles of local boards of education and local school superintendents, to revise requirements for the model code of ethics for local boards of education to be promulgated by the State Board of Education, derived from public complaint alleging ethics code violations by members of local boards of education, to revise for required and prohibited topics and training programs for local board and education members to revise for a sanctioned for noncompliance, to revise for an effective date, to revise for a lay to manage to repeal the conflicting laws and further purposes. This is the Senate Committee on Education and Youth recommends that this bill do pass by the Substitute, which is the Minutes Center, Paine, Vice Chairman. Mr. President, the Senate Committee on Education and Youth offers following substitute to Senate Bill 4, bill to be entitled and act to amend Chapter 2, Title 20, the official got a Georgia annotated, related to elementary and secondary education, so as to revise provisions relating to the fundamental roles of local boards of education and local school superintendents and for other purposes. Mr. President, Senator Dolezal, the 27th offers following amendment number 1 to amend the Senate Committee on Education and Youth Substitute to Senate Bill 4 by replacing lines 135 through 139 with the following. The General Assembly on the specific topic or V that are 4 are against current pending or passed or future legislation affecting public schools or local school systems. Mr. President, that completes the order. Mr. President, I would like to thank the President and the President for the second day of the Senate bill. Thank you, Mr. President. The Senate Bill 4 does five things. All of them relate to local boards of education. The first thing that Senate Bill 4 does is if you look on lines 20 through 24, we clarify the role of local boards of education. Currently, there's a line that was put in there about 15 years ago. The state of that the job of the local board of education was not to micromanage the super intended. Micromanage is completely undefined and that has created some confusion between local boards of education and the superintendents. And so we clarify here that the role of the board of education is to hold the local superintendant accountable for the performance of his or her duties. The second thing that the bill does on line, starting lines 43 through 51 is it requires the state model ethics code to create a pathway for citizens to file ethics complaints against sitting board of education members. Currently the state model code of ethics only allows one board of ed member to file an ethics complaint against another. And what we do here is we create a path for taxpayers above the age of 18 in a jurisdiction of that board of education to file an ethics complaint. The third thing that the board of ed that the bill does relates to board of education training, which is actually what the third, fourth and fifth thing relates to. Currently board of education members have annual training after their initial training. So when you get elected, you have 15 hours of training, nine hours of training every year after that. Lines 91 through 96 clarify that the continuing education is going to cease. So the nine hours of annual training goes away and we only keep the 15 hours of the year after an election in place. This aligns with the training that we have for county commissioners and mayors in the current code. And then the fourth thing that we do beginning on lines 97 is we clarify what should be a part of this training. And that includes things like code of ethics, facility planning, accreditation, flexibility models, local community relations, parliamentary procedures, roles of the boards of education. And then lastly, the fifth thing that the bill does starting online, 125 is it states things that the training cannot do, shall not do. And that is to state that local boards of education are encouraged or expected required to act unanimously. The local boards of education are not authorized to request information from local school administrators. And you can see the list of things there. We had a good discussion in committee, Senator from the 12th and the majority whip. I understand are working with the local board of education on some issues that this bill will directly address. We had some conversation, good dialogue with the senator from the 38th and the minority caucus chair. And that is what brings amendment one before you that I have presented, have on your desks here. So specifically, if you look at lines 135 through 139, the senator from the 38th expressed concern that I would agree with him that has currently written the lobbying language therein really narrowed the ability of a trainer to even say that you should have a pre-legislative breakfast, for example, or that you should have a dialogue between a board of education and your local delegation that certainly was not the intent. So we added it to specific topic because what has been happening in some of these trainings is you have the staff of say GSBA that will come in and provide some training. But then you have a superintendent that comes in. And oftentimes a superintendent will say oftentimes. It has happened. I can't say how often. We know that it has happened that the superintendent will come in and pontificate their personal agenda or their personal opinion on things that this assembly has done. And we don't want them to be, we don't want that to get conflated the opinion of a specific superintendent with the statewide mandated training that we have. So that's what line three in the amendment does. And then line four and five completely rewrite lines 136 to 139 and clarify that these trainings should not include expressions that are four or against current pending past or future legislation affecting public schools or local school systems, which was a cleanup that came from good feedback from the center from the 44th and happy to include that there. So with that Mr. President, that is what Senate Bill four does and I'm happy to answer any questions. If you have no questions, thank you. I'll be able to well. Does any other senator wish to speak for against the bill? Chair here is none. He has the objections to the previous question being ordered. Chair here is none of the previous questions. Ordered. Question. Question is on amendment number one, authored by the senator from the 27th. Is there objection? The objection amendment on one is adopted. Questions on the adoption of the committee? Substitute as amended. Is there objection to the adoption of the committee? Substitute as amended. Hearing none. The committee substitute as amended is adopted. Is there objection to agreeing to the party committee, which is favorable to the passes of the bill? Chair here is none. The party committee has agreed to. Is there objection to the main question being ordered? Chair here is none of the main question. Is ordered. Questions on the passes of the bill by substitute? All those in favour of vote? Yay. All opposed? Nay. Secretary and London machine. All opposed? All of the passes of the bill are 36. Nayes are 11. This bill has been received. The rest is constitutional majority. Is there for pass by substitute? Secretary Senate bill 124. Senate bill 124 by senator is still 48. Others are billed between 20 and 10 and 20. Mr. President, senator Taylor, the 19th and 48th Office of the decline in amendment number 1 to amend the Senate committee on education and youth substitute to Senate bill 124 by inserting to require the publication of certain information relating to federal guidance documents following families, online five. Board of policing lines 37 through 38 with the following c1 with 15 calendar days of receiving a guidance document and for other purposes. and Mr. President, Senator Tilley, 19th, offers to following amendment 1A to amend the amendment 1 to the Senate Committee of Substitute of Senate Bill 124 by striking lines 31 through 35 and inserting in its place E, the State School Superintendent shall report to the above to the General Assembly annually. Thank you, please do, Your Order, Mr. President. We're going to ask Senator from the 48th. Thank you, Mr. President. Good afternoon, colleagues. Let's get back to work on something less contentious that we can all agree on. School choice. Some of the most frequently repeated phrases that have been uttered in this well and in committees in the last week have been our most vulnerable, our most treasured, and parents need a choice. Those three phrases truly embody the 33,000 school age children of the approximately 65,000 active duty military in our state today. Most of these children live on or near base that's in your district. For example, Kings Bay Naval Station in Brunswick, Fort Stewart, Savannah, Fort Moore, and Columbus, Stobbins Air Force Base in Marietta, Moody, and Valdosta, Robbins Air Force Base in Warner Robbins, Fort Eisenhower, and Augusta. Those were our primary military bases. That's where the majority of our 65,000 active duty troops live, sailors, soldiers, Airmen. And according to the Department of Defense, in those view that have ties to the military know that the children of active duty military will move six to nine times between kindergarten and graduating high school. Let that sink in. That's moving every two to four years, usually mid-year, and they're constantly having to adjust. These kids truly are most vulnerable. They are treasured, and their parents absolutely need a choice about their educational needs. Senate Bill 124 addresses this by directing the state board of education to adopt the rules necessary for the state dollars to follow the federal portion as directed by the White House to the DOD. This means that a qualified student who is not already in one of the bottom 25% failing schools will be eligible for a promise scholarship account. We're not adding more dollars to the account. We are simply adding these kids to the list. Talking to a couple of you prior to presenting today, there are questions of DOD schools. There's a question about failing schools in some of these districts. So I'm going to go back to our list of bases, and I'm just going to give you a couple of numbers to look at this sink in. In Brunswick, we're doing great. We don't have any schools in the below 25 district. Well done, sir. Senator from the third. In Fort Stewart, in the surrounding counties, we have three, but no DOD schools. So we don't have DOD schools in Brunswick, we actually, I'm sorry, we do have three in the Savannah area, but majority of the kids go outside. But we have seven schools failing, but at Fort Moore and Columbus, we have 25 failing schools. We have four elementary, one middle, no high school for DOD. Dovons, we have no DOD, but also no failing schools. Valdausta, no failing schools, no DOD schools. Robins Air Force Base in the surrounding area, no DOD schools, one over a dozen failing schools, and Fort Stewart and Augusta, no DOD and 42 failing schools. So a lot of these kids are already falling into that bottom 25 percent, but this is just ensuring that for those 33,000 kids that qualify, that they will be on the list of eligible students to have that option for the Georgia Promises Scholarship. On your desks are two amendments, both presented by the Center for the Nineteenth. These are great amendments. I support them fully. I'll let the Center for the Nineteenth speak to it. But until then, I'm happy to address any questions regarding SB 124. You do have one question. Center for the 29th. Thank you, Mr. President. Senator Yeal. From a good friend for the 29th, absolutely. Senator, would you reiterate the numbers that you initially gave the Fort Moore numbers initially, were you talking about the failing? 25 failing schools in the surrounding area. Senator Stuyall, is it not true that the 25 failing schools in the surrounding area would be outside Fort Moore in the Muscogee County School District? They are, sir. Thank you. I'm going to ask Senator from the 44th. Thank you, Mr. President. Well, the gentleman Yeal. I do. Thank you, Senator. Can you, you mentioned this a little bit, but since I'm on the committee, I would be and was, you know, reading the original bill and committee. Can you please explain to me the difference between the language in the as file that we heard in committee regarding the federal, the U.S. Department of Education and the State Department of Education versus these amendments that we now have? So I'm going to let Senator from the 19th speak to the amendments, which are separate from what you're seeing. So if you're looking at one A, that's speaking to the amendment on one. And then what's going to be following from the center of the 19th, this is just regarding calendar days and documentation on that. What we discussed in committee was the term of federal agency and those was explained by President Lynn Riley is where we fall into that. So in terms of, so if you have a specific line number in the bill, I'm happy to get into that. Sure. Thank you. I was just looking myself. So our conversation in committee, you answered my question regarding the necessity of the state school superintendent and Georgia DOE following guidance from the U.S. Department of Education, including but not limited to directives, expanding educational freedom. Regarding that, you had indicated in committee in response to my question that directives from the U.S. Department of Education on educational freedom needed to be followed, but not other directives from the U.S. Department of Education. And I'm wondering if that's still your interpretation after the amendments. It is. So we still would selectively, we want our state Department of Education to selectively enforce what federal DOE is sending down. Well, are you speaking to the amendment now? Are you speaking to the bill? Well, I'm just I'm asking you to clarify for me, Senator. I'm not the center for the 19th speech of the clarification on his amendment and how it relates to that. I'll speak to the bill. So, but it is still your interpretation that they are DOE would only need to follow the ones about educational freedom and not their other work done by the U.S. DOE. Yes. All right. Thank you, Senator. Break it down to Senate from 31st. Thank you, Mr. Senator Yield. I do. Just a point of clarification. Are you familiar with the directive from Secretary of Defense, Pete Hedsteth, as of yesterday, March 3rd, sending four names, Moore's name back to four binning as of yesterday? I was unaware of the directive, but I'm glad to see it revert back. I don't think anybody was getting used to the name change. Thank you, Senator. Great bill. Let's vote green. Thank you, Senator. You have no more questions. Thank you, Mr. President. Ask you to please vote fairable and SB 124 and the two accompanying amendments. I'm sorry. Senator, did you have a question or you had a question? Yes, thank you, Mr. President. You mentioned earlier, and I was trying to find it in the document about that there would be more students but no additional funding. How they to be funded, then, is that local or federal dollars coming down to match the load or dictated by the federal government? No, Dean. It's simply saying that children of active duty military only are now eligible for the promise of scholarship. So they just go in line below those, they would be in line behind children below the poverty level. But they will be, how would that, if sent a year, I'm sorry. Of course. Is that federal dollars to pay for that additional load of students? It's not increasing the load. Once that cap is met, then it's met. I understand it's met. Thank you, Senator. Thank you, Mr. President, you're the one. We're going to send from 19 to the amendments. Thank you, Mr. President. Amendment 1 and 1A just helped move Senate Bill 22 that's just currently sitting in rules hasn't gotten out yet to the floor and get it on across to the house before crossover day. The bill 22 is not controversial, but it doesn't really have anybody screaming for it. So it's had a harder time getting out of rules. All it says is that all Senate Bill 22, which is now incorporated in some amendments, say, is that when the state school board, state school superintendent, gets guidance from the feds that they have to follow that the guidance must first be posted within 15 days of receipt. And then within 45 dates to receipt the state school board or the state school superintendent has to tell us how they intend to implement that guidance. And it gives a period of time for the legislature to respond and say, hey, we think that's appropriate or we think it's not amendment 1A is just procedural. You see when I drafted amendment 1, it's a little bit too long and it would cause the senator from the 48th to build a layover for one additional day. So we had to strike a few lines, striking those lines 31 through 35 that spend five lines saying that the school superintendent is going to give us a report. We were able to write that back on one line. So now it completes the Senate rule to not cause the bill to lie back and go to rules. That's all it does. I don't take any questions or way of you have no question, Senator. Thank you. Any other senator who would speak for against the measure. The question is on the adoption of amendment 1A authored by the Senate from the 19th is the objection. That objection, one A is accepted. Second amendment is amendment number one authored by the senator from the 19th is the objection. That objection amendment one is adopted. Questions on adoption of the committee substitute as amended is there objection to the adoption of the committee substitute as amended hearing none. The committee substitute as amended is adopted. Is there objection to agreeing to the board of committee which is favorable to the passes of the bill. Chair here is none in board of committee is agreed to. Is there objection to the main question being ordered. Chair here is none in the main question. Is the ordered questions on the passes of the bill by substitute all those in favor vote ye. All those opposed nay secretary and light them sheen. Chair here is none in the main question. On the passes of the bill the ye is r37 the nays r16 this bill haven't received directs and constitutional majority is therefore passed by substitute. Senator from the 26 to what do I owe this honor today for. I don't know if you go on or not parliamentary inquire. State inquire. When can a bill be reconsidered. You can serve notice for the re you can serve notice for reconsideration. Right. And then Thursday morning. Thursday morning. You can't do it now. According to the rules of motion for immediate reconsideration is not in order right now. Potemate anyway. I tell you why won't you come up here and we talk through it real quick. Secretary. Senator bill 124. Senate bill 9 by senator albert's the 56 and others bill to be in town act to amend part one of our call three of chapter 12 title 16 of the fish cut of Georgia annotated. Related to general provisions relative to obscurity and related offenses. Those who were repeal and replace code section 16-12-80 relating to obscene material distribution and penalty to amend article 1 of chapter 10 of title 17 of the official Georgia annotated. Related to procedure for sentencing in a position of punishment. So I survived for sentencing of defendants who utilize artificial intelligence in the commission of certain crimes derived for later matters to repeal conflicting laws and further purposes. Mr. President, Senate committee and judiciary recommends this bill do pass by substitute or softly submit it to Mr. Strickland chairman. Mr. President, Senate committee and judiciary offers the following substitute to Senate bill 9 to build a title act to amend part one of our call three of chapter 12 title 16 of the fish cut of Georgia annotated. Related to general provisions relative to obscurity and related offenses. Those who were repeal and replace code section 16-12-80 relating to obscene material distribution and penalty and for other purposes. Mr. President, that can place the order. All partners for达京都府對立實際上的冤枉局票pawn派出現現實實實實統和其他失敗 監管名字 Thank you, Mr. President. Senators, today I bring to you Senate Bill 9, the Ensuring Accountability for Illegal AI Activities Act. The Scrucial Peace of Legislation demonstrates our state's commitment to not only adapting to the rapid technological advancements of our age, but also ensuring the safety, security, and well-being of all Georgia citizens. As I mentioned to you yesterday, when we passed the Georgia Data Consumer Privacy Protection Act, this was yet another recommendation from the Senate's study committee on artificial intelligence, which met in 2024. In our digital age, we're witnessing a proliferation of artificial intelligence, or as we call it AI. While these technologies can revolutionize many aspects of our lives, they also pose significant risks of misuse. The Ensuring Accountability for Illegal AI Activities Act is a timely response to this emerging reality. This bill specifically addresses the issue of obscenity, fraud, and related events. As you can imagine, the tools of today are so much more powerful than the tools of yesterday.\n\nWith that, unfortunately, it has been used for harm specifically against young girls and fraud against everyday citizens and senior citizens. In fact, just over a month ago, right up in Gilmer County, someone who was working in the school used it to create illicit images of school girls. Thankfully that person is being held behind bars now while he awaits trial. This is critical to make sure we have properly added the right language into the legal code and sent this accordingly, people are using these powerful tools to commit these already illegal acts. But what does this mean for our average Georgians and why should you as their senators care about this bill? Well, firstly, it ensures that our laws are up to date with current technologies and landscape so they can continue to protect us and protect us from potential harm. And it adds an additional layer of protection for Georgians against this misuse. Secondary, it maintains integrity of our judicial system by ensuring that anyone who uses AI to commit a crime is held accountable. It's not just about punishment, it's about deterrence. It's by establishing clear consequences and letting people know what the law is to discourage potential offenders. Hopefully, reducing the likelihood that such crimes ever exist in the first place. And finally, this bill sends a powerful message to our state's commitment with upholding the rule of law while embracing rapid technological change. In conclusion, the ensuring accountability for a legal AI activities act is a forward-thinking piece of legislation that balances the need for technological advancement with our fundamental commitment to the rule of law. It's not just a response to the challenges we face today, but these are proactive measures to ensure safety and security for all Georgian citizens in the future. I'd ask your favorable consideration, Mr. President, if there are no questions, I would yield the will. You do have questions, Senator. Yes. Senator, from the 27th. Thank you, Mr. President. Chairman, do you yield? Of course I yield. Thank you for this bill. I understand what you're trying to do here. I do want to ask you, though, about Section 3, which is essentially a sentence enhancing element of the bill whereby the government can choose to ask for additional sentencing if AI was used in the Commission of the Crime. Is that accurate? That is correct, because it is such much, so much more of a powerful tool than in the past. It has been used to perpetuate further and more despicable crimes. Thank you. Do you further yield? I yield. I think I understand you're in 10. I'm wondering, and Craig, if I'm wrong here, because I very well could be. Let's take the offense of enticing a child for indecent purposes on line 71. Is there a scenario where a person could be given an enhanced sentence for using AI to simulate one of these acts versus the actual Commission of the Act? That would be my concern. I'm wondering if I'm either misunderstanding it or if that's where we would just rely on the difference of the Attorney General, sorry, of the district attorney at that point. It would be that certainly the district attorney's prerogative in that case, but this would be using those tools in order to entice the physical child to do that. But I see where I believe you're going is, if something is done to an individual, that in itself is a crime. But what if it's done just to simulate something to somebody who does not exist, which is a legitimate question to ask, who is the party that would be impacted by that? As an example, if somewhere to create horrible and rude images of a child in a way that would be wholly inappropriate and considered to be child pornography and other things, but it's not a real child as an example, well, it's society as a whole that is the detriment to that versus it being a single person itself. And that's why the bill is constructed in this way, also to be consistent with what other states are doing. Thank you, Chairman. Thank you. No, you have no further questions, Senator. Thank you, senators. I'd ask you, please support this very important piece of legislation to keep our citizens safe and secure. Does any of the Senator wish to speak for against the measure? Is there objection to the previous question being ordered? This can't hear his none. The previous question is ordered. Questions on the adoption of the Committee's substitute. Is there objection to the adoption of the Committee's substitute? Here you can now any substitute as adopted. Is there objection to agreeing to the Board of Committee, which is favorable to the passage of the bill? Chair here is none. The Committee has agreed to. Is there objection to the main question being ordered? Chair here is none of the main question is ordered. Questions on the passage of the bill by substitute. All those in favor of the bill will vote, yay, all opposed, nay, secretary, and a lot in the machine. All the passage of the bill, the yay, are 46, and the knees are nine. This bill haven't received the requisite constitution with jury, is therefore passed by substitute. Secretary Reed, Senate Bill 112. Senate Bill 112 by Senator Nixon, the 45th, and others. The bill has been touted and act to amend chapter 1 to title 10 of the Episcopal of Georgia annotated, related to selling and other trade practices to extend certain protections for consumers relative to warranties of HAC systems and components of such systems to provide required information for warranty and product registration cards and forms to provide an effective date for certain warranties of HAC systems and components of such systems to provide a definition to provide for an effective date and applicability to provide for related matters to repeal convocating laws and further purposes. Mr. President, Senate, me and the regulate industries and utilities recommends this bill to pass respectfully to the Senate, Councilor LaFoury, a district chairman that can be issued or mispresident. Recognize the Senator from the 45th. Everybody woke up in here, all of a sudden. Got loud all of a sudden in here. Mr. President, colleagues that bring Senate Bill 112 before you today at the Good Consumer Protection Bill. It has to do with HVAC warranties that are purchased by the manufacturer. Currently, if you buy an HVAC system and the new purchase and extended warranty, in many cases you have to register that warranty or that item with the manufacturer, which is a needless step because they already have your information from purchasing the HVAC system and the warranty from you or from them. This bill simply takes that step out. The registration part would not be necessary. The warranty would commence once the item is installed by a licensed contractor. It would also make the warranty transferable, doesn't matter how many times the house is sold as long as the stolen warranty that would transfer with the new property owner. With that, Mr. President, we have to answer any questions or I'll yield the well. Do you have one question, Senator? Recognize the Senator from 26th. General McGee, I do. As your questions, it sends you no other warranty from the HVAC. Would you be willing to do warranty for folks who sell people a motor, say, powertrain products, sells you a motor with a five-year unlimited mile warranty and the motor goes out at 89,000 miles. And then they tell you where the only way you can bring an action is in the court of New Jersey. Would you be willing to sign on to a bill like that to keep George's consumers from buying products which says they're the warranty then you get the right and the only way you can get an action is to go to the courts in New Jersey. And be happy to support a bill like that Senator if you brought it forward. Well, I'm getting really introduced to one. I'm kind of going to the court. Thank you, Mr. President. You'll do well. Any other Senator would speak for against a bill? Yeah, I'll in trouble now that the Senator on 26 is wide awake right now. Yeah, I'll in trouble now. Is there objection to previous question being ordered? Chair, here's an previous question is ordered. Is there objection to the green to the report committee which is favorable to the passage of the bill? Chair, here's an un-the board of committee is agreed to. Is there objection to the main question being ordered? Here's the main question is ordered. Questions on the passage of the bill? All those in favor? We vote ye. All opposed nay. Secretary, a lot of machine. Senator from 26 what purpose do you ask? I would ask the Senate to reconsider House of the ill four in giving it a constitution of the judge. Senate bill four? Senate bill four? That, right. Okay. All the passes of the bill, the ye is our 55. The nays are zero. This bill has received a constitutional majority. Therefore, pass. Secretary, Senate bill 144. Senate bill 144 by Senate Watson, 11th and others. Bill's being done. Act to amend Article 6 of Chapter 7. Title 2. The official got a Georgia annotated Roy T. liability for use of fertilizers. Plant growth regulators are pesticides. As to clarify that a manufacturer cannot be held liable for failing to warrant consumers of health risks beyond those required by the United States Environmental Protection Agency with respect to pesticides. It can provide for legislative findings, to provide for early demands, to provide for public ability, to appeal conflicting laws and for other purposes. Senate bill 144 by Senate Watson. Act to amend Article 6 of Chapter 7. The official got a Georgia annotated Roy T. liability for use of fertilizers. Plant growth regulators are pesticides. As to clarify, the manufacturer cannot be held liable for failing to warrant consumers of health risks above those required by the United States and the Animal Protection Agency with respect to pesticides to ride for legislative findings, ride for related matters, ride for applicability, to political-looking laws, and for other purposes. That can be the order, Mr. President. Thank you, Mr. President. Members, I've written before you Senate Bill 144. This is a labeling bill. When you talk about crop protection, tools, and plant protection products, the label is the law. The United States Environmental Protection Agency approves the label. They will not allow anyone to put anything on that label that they have not done all of their research and fact-based, science-based research on to allow anyone or any manufacturer to put anything on the label that they do not feel is true. So if it's not true or they can't verify it, they're not going to allow manufacturer to do that. It does not lessen any restrictions. It does not provide any immunity. It just clarifies that a manufacturer cannot be held liable for failing to warrant consumers of health risk above those required by the United States Environmental Protection Agency. That's what the bill does. We have on your desk several letters that I think you'll see just to mention some of those, our former governor and US Secretary of Agriculture, or Senate Purdue, has a letter that speaks to the EPA and how they manage these labels in the process. You'll also see a letter from about 10 of our ag commodity groups. You'll also see a letter from the Urban Ag Council, the Georgia Chamber and the US Chamber. But again, this is just a label bill clarifying that. We also have a friendly amendment that will be offered by the senator from the 50th that we think strengthens the bills to protect the farmers, to make sure that those bad actors are dealt with. And so that's what the bill does, Mr. President. And I'll be glad to take any questions if there are any. Do you have a couple questions? Right now, it's same for the 26th. Senator Yew. Yes, sir. Senator, with this labeling bill, we'll round up, be able to sell our products because they've been sued about labeling. And just a little research on it, I find out that there has been no scientific evidence that round up causes counsel. And round up, you can do it at the house. You can get your gallon bucket, take some more than salt, and cut up some salt, and mix it with it. And you got round up. Am I correct? You are correct, yes, sir. And so what we are talking about, in the truth, we are talking about not having to buy the product from China if we don't change it because round up with no longer exists because you won't be able to buy it in the United States. That's great. There's been one study that a lot of the opponents reference. And in their statements, they say that numerous studies suggest that glyphosate has issues. They also say probably carcinogenic. It doesn't say that it does or that it does cause this cancer or any other issue. That same study also references red meat. So maybe we should stop eating red meat. But you are correct, Senator. It is a, we call it a trait technology in the farming world. And we use these products to make sure that we have a safe food supply that our farmers livelihoods are protected. And that food prices remain low. Mr. President, if there are no other questions, I'll yield the will. There are no other questions, Senator. Thank you. I'd greatly appreciate your vote. Secretary, read the amendment. Mr. President, Senator Hatch of the 50th and others offered the following amendment. Number one, to amend the Senate Committee and I of Cultural Consumer Affairs Substitute to Senate Bill 144 by inserting after pesticides on line five, the following subject to an exception by replacing line 40 with the following to warn, provided, however, that the provisions of the subsection shall not apply when a determination has been made by the Environmental Protection Agency and a manufacturer knowingly withheld the concealment's represent under destroyed material information regarding the human health risks of such pesticide in order to obtain or maintain approval of its label by the Environmental Protection Agency, Mr. President, that completes the order. We're going to ask the Senator from the 50th. Nothing like a lawyer come to rescue Ag Bill. Tell you what, don't make it better. Thank you, Mr. President. And I do appreciate that comment. This was worked on with the Ag community and with the farmer in mind. One of the issues that we've seen across the country in the past is people push products without being fully transparent about the risk associated with those products. And the reason why I failure to warn claim is available to its citizens is because we think citizens should have autonomy in making a decision whether or not to expose themselves to something. So the Environmental Protection Agency has, apparently, according to the Senator from the eighth who has helped me with this, over 500 scientists that vet all these products. And they have to work with pesticide manufacturers and pesticide manufacturers have to tell the EPA what they've learned about the product, what the risk are. And there are a lot of really good companies out there. And this will protect those good companies. But what we're trying to do here is make sure the bad companies are still held responsible. And so what this amendment does says that if it's found if the EPA discovers that you withheld information, that you can sealed information that you misrepresented or destroyed material information regarding the human health risk of such pesticide in order to obtain or maintain approval of your label, then that failure to warn immunity. That's in here, failure to warn immunity. And apply to you. So this is going to hold all the bad actors that lie to the EPA responsible, which is good for the farmers, it's good for the people of Georgia. And we'll hopefully continue to help agriculture be the number one industry in the state of Georgia. I'm happy to answer any questions about this. No questions, Senator. Write it down, Senator, from the 19th. Thank you, Mr. President. Senator, do you, you? I do. Senator, this is legit question. We need to get to talk about it before I apologize. Does the environmental protection agency make determinations about information that's been knowingly withheld? So yes, they did. And when they find out that you have withheld information or they find out there's something wrong with their product, they can actually pull that label from you. Bring it as Senator from the 55th. Will the distinguished gentleman yield? Help me out here. There we go. I will. In line with the distinguished gentleman, chairman of appropriations, is it not true that the distinguished persons who are called trial lawyers are the only ones who hunt and find out these situations where there is knowingly withheld with the gentleman. The gentleman is it not true that the environmental protection agency, that's not their primary job to knowingly find out whether or not a manufacturer or knowingly withheld can seal the misrepresented and destroyed material information. Is that their job? Is it not true that that's not their primary job? I know the EPA does a lot. In North East Georgia, my constituents don't really trust the EPA, but we're going to make sure that the least manufacturers of these pesticide companies know that if they lie, they don't get the protections that we're affording the good companies. And I applaud that effort to the gentleman in the well. However, you have only piece of paper that was just provided to me, and I'm not on the committee that did this rule. And I am in agreement with the spirit of this legislation. However, on your line five, if it says, and I will state this, this subsection shall not apply when a determination has been made, that a manufacturer, knowingly withheld, concealed or misrepresented or destroyed material information. I simply ask with this, and I know this may throw a pebble into the pun, but if there is a determination by anyone, not just the environmental protection agency, if there is a determination by anyone that a manufacturer, knowingly withheld, concealed, misrepresented, or destroyed material information regarding the human health risks of such pesticide in order to obtain or maintain approval of its label by the environmental protection agency. In other words, would it not be fair that the judicial system is currently in place through discovery or otherwise determines that this material has been withheld, that liability should not be afforded to a manufacturer who does in fact withholds this information, whether it is determined by the EPA or not? So I understand the senator's concern. Thank you for that question. The issue here is that the EPA is the one that determines who gets a label and who is a product is approved and who is not and there is a rigorous process to go through. So if you do misrepresents something to the EPA and they give you the license or they let you continue to have, excuse me, they give you the label or let you to continue to use it, then it is them, ultimately that you've defrauded. And so that's all we decided to leave it with the EPA. With a gentleman per the yield. I will for one more. Is it not true, for example, in an area of a famous case by Johnson Baby Powder that was only discovered that they knew and withheld information that if that tal compiler was in the womb of a woman, that it remained there and caused cancer and that was without the discovery and the adversarial judicial system that we would never have found that out, let alone the environmental protection agency. And if that information were to be found out moving forward after this passage, that information would be able to be presented to the EPA and if they did find that they lied in order to get the label, then they wouldn't have the protection that were affording them. And I get the gentleman, but is the sentiment of the gentleman to only give immunity if the environmental protection agency, which is a federal agency, which has less staff now. In fact, four of the five people that are now currently employed at the EPA are into, it is my understanding that only one of those people out of four will be remaining at the EPA. Is that not true? That's information that I'm sure the center knows what he speaks, but I don't have that information. Well, and I will, I will, we'll lend gentlemen, if the gentleman further yield just another time here, is it not true that if there is any determination by a manufacturer knowingly withholding, concealing, misrepresenting a destroyed material that they should not enjoy immunity? That is, if you withheld information from the EPA and the EPA finds out about it, you shouldn't have immunity desperate. Well, the sentiment of this language is only if the EPA makes that determination. If what if a court of competent jurisdiction makes that determination that a manufacturer knowingly, withheld, concealed, misrepresented, a destroyed material information, which you agree that they should then not enjoy immunity? Based on that, I mean, based on your own question, I understand where you're going with this, but the EPA, if that, if that were the, the facts, the EPA would determine that they withheld information. There's very specific things that you have to show the EPA in order to get approval. And so if you don't show that to the EPA, they will determine that you withheld misrepresented or destroyed material information. Thank you. Thank you. Basically, if there was a legislation proposed that would clear this up to say that if there is a court of competent jurisdiction that did so fine that this manufacturer, normally, withheld, concealed, misrepresented or destroyed material information, that they should not in fact enjoy immunity? I think I've asked, I've answered the question a couple of times here, but essentially, if it is determined by the EPA that you withheld information in order to obtain or maintain a label, you will not get the protections that this bill seeks to afford. Thank you. I would ask that you support legislation that not only aborts the EPA that determination, but any court of competent jurisdiction. Thank you. Thank you. Mr. President. Yes, very well. You do. You do have a couple more questions. I'll go, I'll go, I'll go. I got to go with the who was there first and Senator from the 41st. Thank you, Mr. President. Senator, do you yield? I do. Thank you for bringing this friendly amendment. I just want to make sure that I'm understanding what's happening here. So are you saying that if a company, company X, is found to, at some point, have withheld information that no one hurt the public, then they would no longer be able to say that they were covered by the immunity of failure to warn. Is that what you're saying here? If it's determined by the EPA that they did, yes. And is it not true that your bill also allows that the EPA could determine that based on evidence from a court or law, like that court of law, some lawsuit could be brought to the EPA for them to make that determination. Is that correct? I believe that's correct.\n\nRight, yes. Yeah. And then finally, just for my own clarity, this is asking as a non-lawyer to a lawyer, if someone were to be harmed by one of these pesticides, is there another way for someone to sue that does not fall under the failure to warn posture? Like is there another way to get an alleges? There are several ways, yes. Deeper than you. For one more. Is it found on some of the ways that people might be able to be made whole even if they can't sue under failure to warn? I mean negligence, federal torque claims, other avenues. Thank you. Thank you. Mr. President, without a doubt, you'll be well. We're going to have a center for the 44th. Thank you, Mr. President. I know that the authors of this legislation are very well meaning. And I want to say very clearly at the outset that I support farmers and I support agriculture, Georgia's top industry. But it's my view that the bill is a misguided attempt to help farmers that actually, unfortunately, just provides immunity for a multinational manufacturing conglomerate when there are thousands and perhaps millions of people out there that may have gotten cancer from one of its products round up. So first about Bayer. Bayer bought Monsanto. Monsanto was the manufacturer of round up. So now Bayer owns round up. Bayer is comprised of 340 consolidated companies spanning 80 countries. It's headquartered in Germany. It is the definition of a huge international conglomerate. This is not some American mom and pop company. Now about round up. Bayer has been losing in court on lawsuits alleging that round up causes cancer and most recently lost in the 11th Circuit, our own appeals court, which is probably the direct impetus for the legislation we see today. Scientific studies are mixed on round up. Many global health organizations state that glyphosate, the key chemical ingredient in round up, is likely carcinogenic to humans. In fact, the EPA decreed this that glyphosate was a likely carcinogen all the way back in 1985. But after a pressure campaign by Monsanto, where Monsanto championed falsified data and attacked legitimate studies that revealed round up danger and led a prolonged campaign of misinformation to convince government agencies, farmers, and the general population that round up was safe, the EPA reversed course. So here's an example of a study. The initial test that EPA approved round up under was run on rats for two months and showed no correlation with cancer. But later studies run for two years, which is much more in line with the lifespan of a rat. 80% of the rats got cancer versus 30% of the rats in the control group. And moreover, the tumors in the glyphosate rats were up to 130% larger than the tumors in the control group. Monsanto then manipulated peer reviews about this study, that particular study, and actually hired the editor of the journal had the editor of the journal where it was published on their payroll. To grease the wheels to make sure that it would get retracted and that the EPA would then, and we're talking 40 years ago, go ahead and approve, and glyphosate and say there was no correlation with cancer. So now 40 years later, due to its repeated losses in mounting liability, Bayer is searching for a way to limit its exposure at the expense of regular folks. And believe me, a lot of those regular folks are farmers. A lot of those regular folks are farmers. Last year Bayer pushed for legislation in Missouri, Iowa, and Idaho. It lost in all three states. Probably partially because Iowa has the second highest cancer incidence of any state in the United States of America. And there were plenty of farmers showing up at the Iowa Capitol, asking them to not pass a liability immunity bill for a company that was lying about its product for 40 years. So because it lost in all the states it brought the bill last year, it shifted its messaging, I got to give it credit, it's very clever. Now it's all about protecting American businesses from China. And it didn't work last year to just say, please protect us, international conglomerate, headquartered in Germany from lawsuits from American farmers. Meanwhile as an indirect but important aside, there are weird health things going on with folks that none of us can yet ascertain the cause of or put our fingers on. They can't be directly isolated by scientific studies, at least not yet, but we should be aware of them. Are y'all aware that the global sperm count has been declining precipitously in the last few decades precipitously? In one French infertility clinic, more than 55% of sperm samples contained high levels of glyphosate. They also have a significant rise in autism over the past 20 or 30 years. And it's likely that environmental causes are behind it. Now that is not my opinion. I've talked to noted Georgia health experts about it. What exactly it is I couldn't tell you and I wouldn't pretend to say I can isolate one chemical or endocrine disruptor versus another. There are probably various chemicals, pollution and increasing overall saturation and soil of the air, ocean, etc. We don't know, but we can't just ignore the brightly flashing warning signs. Okay now to the actual heart of the problem with this bill. It pretends that the EPA is an appropriate regulator that always will act decisively in the best interests of the public. That is not the case. In fact, one of the top folks at the EPA right now just showed up there from running the American Chemistry Council, the exact industry agency, industry lobbying group that is lobbying for all these chemicals, including bills like this to make sure that chemical companies can't be held accountable if their products cause harm. Just a few years ago this particular woman who's now running the EPA was busy lobbying in DC and telling legislators that formaldehyde does not cause cancer and probably succeeding with it. I've got a personal story that shows how weak these regulators are that the American public should be able to rely on them, but we can't. So when I was first sworn into the house in 2011, I had a 10-month-old baby. So like anyone with a 10-month-old baby, I was a recent consumer of purchasing baby bottles. And when I'm out making my baby registry for friends and family, I couldn't help but notice that all the displays in all the stores on all the baby bottles and baby products said BPA-free. So I get down here and my friends got Hulkum who's still in the house, who also had young children. We talked about it. And we were like, you know what, let's file a bill to ban BPA in baby bottles here in Georgia. So we did. You can look it up. Representative Hulkum was the primary author and it was bipartisan. We had Republican co-signers. Well, the next thing that happened is that the Georgia chemistry council showed up to kill the bill and talk about how there's no evidence that BPA causes anything and certainly the Georgia House should not entertain that bill, which never got a hearing. Meanwhile, studies for a while had shown that BPA had an ability to mimic estrogen potentially impacting developments in infants, including brain function and reproductive health. Five months after the Georgia chemistry council managed to make sure that our bipartisan bill did not even get a hearing on BPA, the EPA banned BPA in baby bottles. But why? Because the American chemistry council asked them to. That's right. Five months after they were busy killing our bill, they asked the FDA to ban BPA in baby bottles. Why? Two reasons. Number one, no manufacturers were making bottles with BPA in them anymore because no one would buy them. The market for it had already completely disappeared and yet they were still down here fighting against the bill. After they submitted their petition because the market had completely deserted baby bottles with BPA, the FDA, I'm sorry, then went ahead and banned it. After the chemistry council asked them to. So the reason they did that, number one, no one was making them anymore. And number two, there was legislation pending in Congress that would have banned BPA in a larger group of customer plastics, right? And they wanted to ward that off. So this is the regulator we're now saying we want to put our faith in. Someone that did not ban BPA until the industry lobbying group asked them to when literally no one was even making it anymore because through lawsuits and through studies, the public had already wised up that they should not buy these things because they could be harmful to health. So to the sender from the 50th point, it is important that these lawsuits get brought. And I'm certainly not putting my faith in a regulator that did not ban BPA until the whole world, the whole world already had decided it was dangerous and they weren't going to buy it for their family. The reality is that the FDA, just like the EPA, is an imperfect and weak regulator that is neutered all the time by the lobbying and interference of companies like Bayer and like whoever was making the BPA plastics. Federal legislators respond to those interests and money. It's easy to confuse the public. Remember all the times we said that smoking didn't cost cancer? It went on for many decades, right? Many decades. Some lawsuits that finally forced that to end, those lies to end. The companies have money. They want to be able to sell their product and they can and do lie and twist the regulatory process to their advantage. The public should be able to be informed on these things. If a product is causing harm, we should not give it legal immunity at the outset and decide that debate. Because at the end of the day, multinational chemical companies like Bayer should be held accountable. I'm not necessarily telling you that Roundup or glyphosate should be banned. But we need to get real. If these companies are not willing to have a strong and effective regulator in the EPA or the FDA and they most certainly are not willing to have a strong and effective regulator, then we have to have lawsuits on the back end so that the public finds out what's being hidden. I don't believe we would need so many lawsuits if we had a more effective regulator. But because the companies interfere with the regulators, with lawsuits and right here in this capital and in the capital in DC, they want to own every step of the process and have no liability or regulation anywhere in the process that interferes with their ability to sell their product and make money. And they don't really care that much how many people have cancer. It is not the government's job to clean up Bayer's mess by siding with it over citizens and giving it a pass. So therefore, I will be voting no on this legislation. I understand it's well-intentioned, but when you really know what's going on here, I would say please beware because you're fed a lot of lies all the time that things are safe by our castrated regulators in Washington, DC. And I am happy to answer any questions or I will yield the well. Senator from 36. Thank you, Mr. President. As a senator, you? Yes, ma'am. Isn't it true that you have painted a compelling picture of the poisoning of the public by corporate behavior that's fueled by huge money influencing those who are supposed to be regulating and protecting the health of our people here in this country? I hope it's compelling and I think that there are many examples of it happening. You know, the senator from the 50th a few weeks ago referenced Aaron Brockovich, referenced this scandal with Teflon and DuPont behind the dark waters documentary. And there are many other examples. So yes, I think all of us remember the Punitive Damages associated with the Ford Pinto case all those years ago. They're there for a reason. And it's true we've had the, for example, of people coming up here from Juliet, Georgia, about what's in their water. Yes, ma'am. These are not fairy tales. Isn't that true? They're not things that people have dreamed up. These are examples of people seeing cancer all around them for their own loved ones and the people that live on their street in their subdivision or in their town. And repeatedly there are really, I would almost say countless examples of how people wake up and find out that they've been damaged in that true. That is true. That is a product of a powerful, well-funded corporation that is able to skew the regulatory process with their influence and their money. Isn't that true? That is true. And it's not just skewing the regulatory process. Understand, of course, that any scientific study to isolate anyone chemical is incredibly difficult, right? So they can use that to their advantage. I would be fine with Bayer, Monsanto, whoever, if they said, look, there are mixed studies on this. Some say that there's no, that it's not cancer-causing, but some do. So in the interest of, you know, letting the public know, they can then weigh the risks and decide to buy it if they want. But that is not what they do. They deny, deny, deny, and interfere all along the way with anyone's attempt to learn in the public. Further inquiry, I feel you, you'll... Yes, ma'am. Peafos. Peafos, I first learned about the Redful Outcomes from Exposure to Peafos that forever chemicals, I think, people have heard about it now here in Georgia. There are water systems there, and there are manufacturers. People have been exposed to PFAS, which are forever chemicals. And it's happening right here in our state, and it is yet another example when there is a belief that you can trust the manufacturer to fully disclose what's known about a product in that true. And we've had... I can call the names of the industries up there in North Georgia that have been dumping in the water, and their water systems that are compromised with PFAS. Isn't that true? And I believe we have some municipalities suing right now. That's exactly right. And there's other immunity bills that the industry is trying to ram through here. That's right. And I raised that in it true because it's buyer-beware. It's... It is. Don't assume that because something is out there and available means that it's safe. Not the contrary, in that case. And we could learn right here in Georgia, isn't it true, from the example of PFAS in the water, forever chemicals in our water, you know, from industries dumping. And people severely compromised or losing their lives as a result, is that not a compelling warning to... So, a way to look at this and understand, is it not true? This is a giant multinational corporation that is skewing the process and people's lives and health are at stake. And that I would contend is the thrust, is it not true, of the remarks that you brought with us today. That's right. And I think that PFAS is another one of those that's been linked to the conspicuously large decline in sperm counts nationwide. I'm sorry, internationally. And the real fallacy in this legislation is saying that the EPA and the FDA really will not let anything out there that isn't safe. Y'all, that's just a... Louita Kalmanair, I got to tell you. Thank you for providing a high warning here that would hope that our colleagues would eat. Thank you. I yield the well. As soon as you yield it. We're going to have a senator from the 14th. Thank you, Mr. President. So as to stave off any suspense I rise today in support of this legislation. And I want to talk about the echoes in my mind that I hear in a quiet space when I'm thinking about food security in the environment. And that echo in my mind is the voice of the senator from the 8th asking, do you like to eat? Eat, eat, eat, eat. Because the answers I do like to eat. And in my district, from Exit 2, Exit 10 on Georgia 400, they're not a lot of farms. I'm not sure if there's a single one. And if you grow up in a district like that, you might think Waffle House falls from the sky like rain. It does not. It comes from farmers. People in other parts of the state that I don't spend as much time in, whose day in day out job is to feed not 10 people some decades ago on average, but over 150 or more people. So a 10 fold increase in the amount of mouths that farmers must produce yield in order to feed. And if I drive, my Hyundai Sonata far enough outside of my district, down I 16 or to other parts of state down I 75, what I find is a larger state that exists in a community with the Metro Atlanta area in ways that must be recognized for us to legislate effectively at the capital. I was opposed to this legislation for a lot of the reasons that the center from the 44th mentioned. I'm generally skeptical of a large corporation going around to state houses and trying to broken immunity deal. I opposed the governor's tour reform package, at least half of it, the other half of voter for it. And so it's not an easy vote for me to step outside of my district, step outside the box of the way we traditionally do things and to listen to Georgia's farmers. But center from the eighth, other voices in the building, the letters on our desk have made it clear. Give a real food security issue. And if I can steal the center from the eighths thunders, what is it we always hear? The right is okay with corporate consolidation and the left, maybe likes regulation a little bit too much in the middle is the farmer. Farmers get squeezed. And if there is a real risk, which I buy that there is, that this chemical which has been used for decades might be pulled from the market if there is an increasing liability issue on this one specific cause of action to be clear, failure to warn, there are other lawsuits that might still be available. But I buy the argument that if the chemicals pulled off the market, we could have a real issue with yield and also with national security. It matters where our inputs for ag are coming from. If they are sourced from other countries, then we have less security as a country than if our input puts our source domestically. So here I am, unaturning from the Roswell Road area, Georgia 400, who hasn't spent much time with dirt on my hands, who is standing up here saying that for the good of the statewide community, for the good of our food security both in the state and nationally, I'm going to support this legislation today. And I hope that we can do this type of legislating when it comes to lawsuit reform, whatever in the future, which is targeted, which is justified by need, and is not the sort of blanket sweeping types of legislation that we have been doing. I'll yield for any questions or I'll yield well. You do have one question, Senator. I'm recognize Senator from the 47th. Thank you, Mr. President. Would you Senator Yeal? I will, Senator. What did you do with the Senator from the 14th? So we recently had him on as a guest for an episode of Trump Morning News and he had a terrible fall. And so I'm here in his place, but I appreciate you asking out. Hopefully he'll do better soon. With no other questions, Mr. President, I will yield well. Thank you. Senator Hesilded. I recognize Senator from the 41st. Thank you, Mr. President. I rise today as someone who grows food. The grows food for my community in Stone Mountain, Georgia, a small little farm that feeds half dozen, maybe a dozen families during the summer and provides eggs all year long. And I don't use these products. I have 90 blueberry bushes and we don't spray them with anything. But in a few minutes, I believe that the Senator from the 8th is going to show you a chart. And he will show you what happens to blueberries when they're not sprayed. And I can tell you from first hand that we lose at least probably a quarter to half of our crop to blueberries that have those diseases because we don't spray. Now because I'm not trying to make a living with those blueberries because I am clear about kind of the community that I'm serving, it's okay for me to lose a portion of my crop in order to not have to spray them with pesticides. But I am clear based on the number of blueberries that grow fungus on my own property based on the pounds and pounds of tomatoes that go to my goats because they have been infested. I'm clear that we cannot feed our country and our world without having help from pesticides, fungicides, and other agents. I know that organic farming matters. I do it myself and I do it so that I can feed my family. But we cannot feed the world in the ways that we need to without having some type of pet managed pest management. And so I say that as a person who's doing this, I hope the Senator from the 8th will speak here. But he's sending a video around where he's showing blackberries that have these little worms that come out of them. I've got those blackberries that have the little worms that come out of them because I don't spray them. We've chosen not to use pesticides. Again, that's a decision that we've made for ourselves, for our family because we know that we can grow enough to meet the needs of the people that we're trying to meet. But if you want to do this on a large scale, like the Senator from the 8th does, you just need to have some additional help. And so I stand here today in support of this bill. I stand here today in support of farmers who are trying to feed our nation and feed the world without I yield the will. Thank you, Senator. We're going to have a soon from the 8th. There it is. You know, colleagues, I have spent most of my adult life since I graduated from University of Georgia, Ag School, fighting for farmers. And I have said this everywhere that I go. I say the three biggest threats to the family farm in this country are corporate consolidation, over regulation and unfair trade. I say that to everyone that I talk to. I no longer believe that. After serving in this building, after the trips that I've taken to Washington, those aren't the greatest threats to the family farm. The greatest threats to the family farm are that the 2% of us that are feeding and clothing the country, the other 98% doesn't have a damn clue what it takes. That is the biggest threat. My grandmother was born in 1923. When she was a little girl, you know what they said, they formed her, when you lost your crop, she said they got the blot. That's all they could say. It got the blot. In 1923, the American farmer.\n\nfeed about 12 people a year. The average life expectancy was 53 years old. Today the American farmer feeds 169 people and the average life expectancy is 77 years old. Do we want to get rid of modern medicine and modern agriculture? When we talk about plant protection products, we would lose over 70% of our yields across the country if it were not for plant protection products. I brought that from my pack and shed. That shows you what without plant protection products, fungicides, herbicides and insecticides, we're talking about famine is what we would have. We have got to increase our food production by 70% by 2050 to be able to feed the world. The only way we go back to a world without plant protection products is let's go back to 1880 when 80% of the people lived on farms. That's the only way you're going to do it. Now I brought up somebody to meet with both caucuses. His name is Dr Stanley Co-pepper. Now listen don't let his unassuming ways and in the way he talks talks country like I do, the man is world renowned. He is the only person in extension across the country to ever serve three consecutive terms on the EPA advisory council under both Republican and Democratic administrations because he's respected on both sides of the aisle. He's written over 137 peer reviewed publications and he was awarded an award in the White House where he was given the award in the Oval Office in rural Georgia just because we talk slow, doesn't mean we think so. And so when we have a letter on your desk from Sonny Perdue who is a former secretary of agriculture, we bring these experts up. They're over 500 scientists that work at EPA and you look at the list, this study that this stuff comes from, I want you all to understand where I'm coming from. This is some of the things that they said could be possibly Carson Aginne, a Krillin Mide. You know what that is? That's a cooking mission that has formed naturally during high temp cooking processes, frying, baking and roasting. Hydrochloride, that's in your medications, your antibiotics, your antihistamines, your pain relievers, Advil. Ethyl carbonate that's in bread, soy sauce, beer, wine, distilled spirits. Red meat. Hot coffee. Non-arcinical and synthesized. You know what that is? That is bifenthrin. That's pyrethroids. That is the things when we talk about public health, think about the diseases, the diseases that mosquitoes and ticks for everybody living in these urban areas. Think about that. That's on the list. But by the way, guess what else is on the list? Night shift work is a possible carcinogen. And this is the last one, emissions from burning wood and a fireplace. That's on the list. So you have to ask yourself this. This is not about one company and it's not about one chemical because we all know that the things on this list when one gets dried up, you're going to move on to the other. And when you think about plant protection products and you think about what we have to feed the American people, you can listen to a few people that are out there that don't know what the heck they're talking about or you can follow the science. We feed our children the stuff that we grow. Think about that. We talk about following the science. Follow the science. But I can say this. I did. I sent that video out to everybody. Video of Blackbridge. We have a little fly that we have to do preventative sprays for. And the same thing that we use, some of those compounds that we have to use to treat for that little fly, it's called a spotted wing drosophila. You can google it. Little bit of miniature fly. And it lays a little bit of hole you can't hardly even see in a blue barrier or a black barrier or a shrill barrier. And it takes seven days it lays larvae. And it takes seven days for that larva to turn into a worm. So when mom or dad, they go to the public or the crow girl or whatever else and they buy, they buy that pretty clamshell, Georgia Grown Blueberries. They're beautiful. They got that bloom. They care at home and they put it in the refrigerator. Two days later mom opens up the refrigerator. Do you want to guess what you got? You got white worms crawling all over those blue berries. That's what you're going to have. So I'm just going to say this. Besides food security, if that's the world you want to live in, a world without plant protection products and vote against this bill. Mr. President, I yield the whale. Hey man. Somebody really want to follow that. You really want to follow that? Senator from seven. Thank you, Mr. President. I rise in opposition to Senate Bill 144. Today we are considering a bill that puts corporate profits ahead of public health. Senate Bill 144 is not about protecting farmers. It's not about strengthening agriculture. It's about giving chemical companies a free pass while stripping Georgians of their right to hold them accountable when their products cause harm. This bill would block lawsuits against pesticide manufacturers as long as their labels have been approved by the EPA. But let's be honest, EPA approval is not a gold standard. The agency doesn't even conduct its own independent safety testing. Instead, it relies on studies provided by the very companies selling these products. In history has shown us that some of these companies knew their chemicals were dangerous and worked to hide the risks. We've seen this before. Once on tow now owned by Bayer has already paid out billions in lawsuits because their roundup herbicide has been linked to cancer. And now they want to change the law so they never have to pay again. They want to make it impossible for farmers, land scapers and everyday Georgians to seek justice when they suffer from pesticide exposure. That's what this bill is really about. Let's talk about who this bill hurts. Farmers who get who trust these products and then get sick, families living near agriculture areas who expose to toxic chemicals, workers handling these pesticides every day without knowing the full risks. If they develop cancer or other illnesses, Senate Bill 144 would slam the courthouse door shut in their faces. And I keep hearing that the purpose of this bill is to continue to allow farmers to use these pesticides. These pesticides are not going anywhere. This bill is not about helping farmers. It's about silencing lawsuits because if companies were confident their products were safe, they wouldn't need legal immunity. I'm going to repeat that one more time. If companies, because if companies were confident their products were safe, they wouldn't need legal immunity. If this bill passes, Georgia would be shielding pesticide manufacturers from accountability and all the expense of public health. Colleagues were not elected to protect corporate polluters. We're here to, we're elected to protect the people of Georgia. And Senate Bill 144 takes away their right to seek justice. It prioritizes profits over people and it sends a clear message that if a product makes a company money, it doesn't matter if it makes people sick. I refuse to accept that. And if you select Georgia, be another testing ground for corporate immunity. And I urge every one of you to vote no on Senate Bill 144. I yield a vote. 6th area, read 1A, amendment 1A. Mr. President, Senator Tillery, the 19th Office of the Falling Amendment 1A to amend amendment 1 to the Senate Committee's substitute of the Senate Bill 144 by adding after agency on line 8, as long as the pesticide is available for retail or wholesale sales. So Georgia farmers, Mr. President, I can please do order. Senator, would you like to speak to 1A? Thank you. Thank you. I'm okay with the bills it is. I'm okay with no amendment passing. But the comments that we've heard here is, hey, there's 49 states that this is probably going to get banned in and they're where the only one that's going to waive a failure to warn. What I do hear that. And what makes me afraid there is that a large company, a large corporation, would then make the decision to heck. One state's not a big enough market for me. So I'm pulling it off the shelf anyway. What this amendment does is says, hey, Georgia farmers, we're going to give you an additional protection. If they pull that product off the shelf in Georgia, or the failure to warn that we likely are about to waive, goes away. It makes them want to stay in Georgia. If they're going to offer it at all, it doesn't put us in a position where we're the only state to waive the waiver and they still yank it off the shelves and 49 of the states are still in the form. That's all it does. Take any questions? Or I'll yield the wealth? Actually, I'll just yield. Senators yielded. Senator from the 11th, would you like to close the debate? Thank you, Mr. President. I think I mentioned when I started my comments that this bill was about the label, strictly about the label. And Bear has been mentioned, they have 50% or better of the market on glyphosate. This all started because of one study that the senator from the 8th has already mentioned, but the company was not allowed to put the warning on the label because of the EPA. They were not allowed to put it on the label. Therefore, it led to 170,000 lawsuits at a cost of $17 billion. And now my future and my family's future and many other farmers across this nation's future are in jeopardy. I know what it feels like to lose crop protection tools. Before I started growing vegetables, we lost methyl bromide because the best product we had for weed control, for insect control, for nebitodes. The product was gone because the EPA said that it destroys the ozone. Well, guess who's using it? Mexico, Argentina, all the countries around the world are using it. Well, guess who were buying vegetables from the day? Those same countries. The same goes for labor. The same goes for regulations. We're at an extreme disadvantage. This just piles it on to all of those disadvantages that the American farmer has. So we can not have this, not pass this, whatever, and we can depend on four countries who are going to use these products. China's using the products. We're going to buy it from China because that's going to be the only way that we can feed Georgians. It's to buy it from China. And that's what we're going to do because that's what we have to do to stay competitive and feed people. So it's about the label. If they want to do this, if they want to put something on the label, they can't unless the EPA says it's okay. So we're just saying that they control that, they oversee that, and we're clarifying that so that we don't have these problems and that the threat of losing this crop protection tool doesn't leave our state and the United States. As far as these amendments go, I really don't know. I got a lot of these last minute. And obviously just hard to process what some of the consequences of some of this will be. So I don't really want to speak to that. I've just tell everybody to do what you want to on those amendments. But this is an important bill. If we want food security, if we want to protect our farmers, the livelihood of our farmers and keep food prices low and know where your food comes from, that's another thing. We're able to go after people here in the United States. We're able to go after bear when there's a problem. Let's go after the Chinese when they put this product on the market or whatever else they do it. Who we go go after? How do you go after the foreign countries and the foreign manufacturers? So let's just get rid of all the domestic production of all these crop protection tools. And let's let China continue to put it on the marketplace and wing-byte for them because they wouldn't want to worry about it. It gets really complicated and I appreciate the comments from the from the eight. But just great to appreciate your support for this and I yield a will. Thank you Senator. We're going to have Senator from the 19th. Thank you, Mr. President. I need to withdraw one A. I put it in the wrong spot while drafting. Is there objection to that? That objection. One A is for moving. All right, we're going to take up Senator from the 11th has closed the debate now. We're going to take up amendment one, authored by the Senator from the 50th. Is there objection to amendment one? That objection. Amendment one is added. The next question. Question is on the adoption of the committee's substitute as amended. Is there objection to the adoption of the committee's substitute as amended? Here you know the committee's substitute as amended as adopted. Is there objection to agreeing to the 40 committee which is favorable to the passes of the bill? Chair here's none, 40 committee is agreed to. Is there objection of the main question being ordered? Chair here's none, the main question is ordered. Question is on the passes of the bill by substitute. All those in favor of the bill will vote yay. All opposed nay. Secretary, I'm not in the machine. On the passes of the bill the yays are 42 and the nays are 12. This bill hasn't received rights and constitution majority. Therefore pass by substitute. Good job senator from the 11th. Secretary, Senate bill 160. Senate bill 160 by senator Kirkpatrick, the 32nd and others bill is being tunneled to amend code section 40-6, just 390.1 of the fishcutter of Georgia annotated away to reckless stunt driving. So as to replace the forfeiture penalty of a motor vehicle involved in a second offense of reckless stunt driving with authority to order the installation of a device which limits the speed of such vehicle to ride for a definition to ride for procedures and conditions upon issuance of such orders. To ride from notification to the department of revenue to ride for a penalty to ride for related matters or vehicle fulfilling laws and for other purposes. Mr. President, the Senate committee and public safety recommends that this bill do pass or submit it to senator albors chairman that please see your order, Mr. President. We're going to send it from the 32nd. Thank you, Mr. President. Reckless stunt driving, including laying drags, is something that the general assembly has been addressing for several years. That's because the behavior is dangerous and ends up causing fatalities about 150 per year across the country. The senator from the 10th led on legislation on this previously and yet the behavior has continued in many parts of the state, especially the urban areas. This bill simply provides that if a person has convicted a second or subsequent time of reckless stunt driving, a court is authorized, not mandated, but authorized to order installation of an intelligent speed assistance device on the vehicle operated by the offender which limits the speed to no more than 70 miles an hour. ISAs is the acronym they've been used in Europe for many years and states are beginning to use this technology to control excessive speeding, including street racing and reckless stunt driving. There are multiple manufacturers of the equipment and the cost ranges from $200 to $1600 to be paid by the offender. The technology is similar to an ignition interlock device. The bill does not impound the vehicle so the person is still able to go to work and drive wherever they need to go. This bill provides a way to control dangerous speeding activities as a matter of public safety using proven technology and with that I'd be happy to answer any questions. Senator from the 10th you want to ask a question you want to come speak for the measure. You have no questions senator. Thank you. I recognize senator from the 10th. Thank you, Mr. President. I rise in support of Senate Bill 160 and I just want to thank the senator from the 30th second for the work that she's doing. I looked at this bill and she asked me to design it. I knew instantly that it would be a great way to add on to the work that his body has passed in this chamber for the last four years. It gives those offenders an opportunity to keep controlling their car but yet have these limited devices. So again I just want to thank the senator from the 30th second and encourage all of my members to join us in supporting this bill. 5600 will be nice on the board. Thank you and I year to well. Thank you senator. Does any other senator which speak for against the measure? Chair here is none. Is there objection in previous question being ordered? Chair here is none in previous question is ordered. Is there objections or agreeing to the 40 committee which is favorable to the passes of the bill? Chair here is none and the 40 committee is agreed to. Is there objections to the main question being ordered? Chair here is none in the main question. Is ordered? Questions on the passes of the bill? All those in favor of the bill will vote yay. Opposed nay, secretary, and lock the machine. All the passes of the bill, the yays are 53 in the days are one. This bill haven't received rexth constitution. The bill is there for pass. Secretary, senator bill 177. Senate bill 177. My senator Anna Vitarte, 31st and others, bill 2010 and act to amend chapter 5, the total 21 of the official court of Georgia annotated by the government transparency and campaign finance. So to provide for transparency and foreign foreign political activities within the state, to require agents of hostile foreign principles and foreign supportive political organizations to register with the state ethics commission to provide for registration requirements, for right for definitions, for right for legislative findings, for right for civil penalties, to authorize the attorney general to bring civil actions or criminal investigations for violations, for right for related matters, to repeal conflicting laws and for other purposes. Mr. President, is that an equity on ethics recommends that this bill do pass, which is directly submitted, Senator Watson, chairman, that can be seen or are Mr. President? We're going to have Senator from 31st. Thank you, Mr. President. I would be very brief. Senate bill 177, this bill addresses two issues. This is a bill we passed out of this chamber last year that was sent to the governor of Vitode, and we fixed the correction as it relates to the foreign countries of concern and how they were documented in the bill. This bill addresses two significant issues. One, transparency and reposition by lobbyists representing hostile foreign nations and individuals and entities, and second, the funding of protests and political activities by hostile foreign governments and their agents. Mr. President, all yield unless there's questions. You do have one question. Senator from 14. Thank you, Mr. President. Does the Senator yield? Yes, it's my friend from Georgia 400. Senator, I noticed that on line 43 of this bill, the bill defines hostile foreign country to include the Russian Federation. Was that the intent of the author? So, Senator, under this language, yes. Do you think the majority might want a friendly amendment to leave that determination to the discretion of the sitting president, Senator? You know, Senator, we heard they canceled your morning news, so I think that was the time to raise it, but I think basically this is basically referring back to what's in federal codes, so we're just going to leave it alone. Senator, I want to say I agree with the determination. I'm glad that the good majority party in the state of Georgia knows who our friends and our enemies are. Thank you very much, Senator. Thank you, McClar. You have no choice. Mr. President, how are you? Does any other Senator wish to be for against a measure? Chair, here's none. Is there objection to the previous question being ordered? Senator from the 22nd. I'm sorry. What'd you say? Senator from the 17th. Do you like to speak? Lower your. Thank you, Mr. President. Let's be honest about what Senate bill 177 is. It's a weapon. It's all designed to silence, dissent, intimidate advocacy groups, and make political participation in Georgia a risk rather than a right. This bill claims to protect us from hostile foreign influence, but in reality, it grants the state unchecked power to investigate, penalize, and even criminally charge organizations that challenge those in power. We already have federal laws like the Foreign Agents Registration Act that addresses foreign influence. So why are we duplicating efforts at the state level, creating a bureaucracy with no real oversight, no clear limits, and massive penalties that could crush grassroots organizations? Because this bill isn't about national security, it's about selective enforcement. This bill is so broadly defined, we don't know who's going to be next. Civil rights groups, labor unions, student organizations, Senate bill 177 gives the Attorney General a sweeping discretion to decide who gets investigated, who gets fined, and who gets prosecuted, and all it takes is an accusation. No due process, no clear safeguards, just a government crackdown on political opposition. And let's talk about these so-called disclosures. Under this bill, any organization received any funding, whether it's $1 or a million from a vaguely defined foreign source in the past five years must register and open their books to the state. That includes groups working on humanitarian causes, immigrant services, or international aid. The message is clear, if you're advocating for change, you are a target. And the penalties finds up to $200,000 with the Attorney General in power to initiate criminal investigations. That's not regulation, y'all, that's intimidation. We cannot allow this government overreach to stand. This bill is a direct attack on free speech, free association, and the right of the people to organize without fear of retaliation. Colleagues, we have a choice. We can either uphold the fundamental freedoms that make democracy work, or we can open the door to a system where political participation is met with fear and punishment. And I refuse to let our state go down that path, and I urge you to please vote no on Senate bill 177. Are you all the well? Senator Geildon, Senate from 22nd. He wave. Does any other Senator wish to speak for against a measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objections to agree into the board committee, which is favorable to the passes of the bill? Chair, here's none. The board committee has agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the passes of the bill? All those in favor vote, yay. All opposed, nay. Secretary, I'm not in the machine. On the pass to the bill, the a's are at 36 and the a's are at 18. This bill hasn't received directs the constitutional majority of their whole path. Moving on to Senate bill 241, Secretary. Senate bill 241, by Senator Williams, the 25th and others, Bill Tumonten, on act to amend chapter 18 at Title 43. They've issued good to George annotated, related to funeral directors and establishments in bombers and crematories. So, as to provide that the organic human reduction as a means of disposing of deceased human bodies to amend titles 10, 31 and 36 of the OCGA, related to commerce and trade, health and local government respectively. So, as to require a disposition permit for the organic human reduction of a dead human body or fetus, to provide for related matters, provide for an effective date to repeal conflicting laws and for other purposes. Mr. President, the Senate Committee on Regulate and Interestees and Utilities recommends that this bill do pass or is directly submitted, Senator Cowsard Chairman. That completes the order, Mr. President. The Senate. The Senate is the center for the 25th. The last man to ever let you down.\n\nLadies and gentlemen, I come before you today, the Senate bill 241. This is something serious. This is dealing with our loved ones. This is, I know there's a time for jokes and there's a time for laughing, but this is something that a lot of people take very serious and I do too. It's just taking care of our loved ones. You know, I've been in the funeral business all my life, my father was, my sons are, and this is something that we take very serious. But there's been some incidences that have happened. Noble Georgia Tri-State Crematory. This was because there were no laws regulating crematory as in Georgia and people could just do anything they wanted to do and that's what happened. There was people in Colorado just a few months ago had started a composting business of composting human remains. That state had no license requirements, no guardrails regulating that method of disposition. No one was inspecting them, no one was looking over their shoulder, no one was taking notice of what they were doing, they were just assuming they were doing the right thing. Once out they absconded and left town with all the money and left the building vacant, the power was shut off and it had over 118 decomposing human remains. Other people's loved ones that were being disregarded and neglected. This is the purpose of this bill is to make sure that Georgia has guardrails to prevent Colorado from happening, Noble Georgia Tri-State Crematory from happening. This is to make sure that our loved ones should we choose this method of disposition, that it would be guardrails placed in place to prevent this neglect from happening. Not now the methods of disposition in Georgia are burial, we even have green burials. We have a monastery and conures that offers green burials. You have cremation, alkaline hydrolysis, donation to medical schools and other research facilities. Even because of religious practices and even other customs of other people or countries or religions that imbalming and different types of burial are taking place. Mr. President, would that be glad to take any questions that there are any? You do have one question, Senator. Senator in 29th. Senator, is Senator Yill? I do. Senator, could you tell me the difference between this type of burial and a green burial? Green burial would be burial in a cemetery that the body is placed in a grave and there are no mechanical devices used. It would be lowered with ropes and even wrapped in a shroud or placed in a natural casket that could decompose. This type of disposition would be in a sterile facility designed exactly for this and it's much like a medical facility that the body is placed in an individual capsule and it is allowed to decompose and to go into this natural composting state and then the compost can be returned to the family if they wish it and that compost can be placed on their farm, on their property or donated to a land bank. Thank you. Thank you for the question. You have no questions, Senator. Thank you, Mr. Yill, the way I'll ask for your favorable consideration. Thank you. Does any other Senator wish to speak for against a measure? Is there objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to the Board of Committee, which is favourable to the passes of the bill? Chair, here's none. The Board of Committee has agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the passes of the bill? All those in favour will vote ye. All opposed? Opposed? Nay? Secretary-Unlocked Machine. I won the passes of the bill. The ye's are 52 in the nays or 1. This bill haven't received Brexit Constitution. Majority is 0-4 pass. Senator from the 41st floor, property is 2 rise. Thank you, Mr. President. I ask for unanimous consent to excuse the Senator from the 22nd. From the 22nd? Without objection, Senator from the 22nd is excused. Secretary Reed, Senate bill 180. Senate bill 180 by Senator Dexon of the 45th. And others, bill's main 10 and 9 to a manorical 7, Chapter 4, Title 20. The official good of Georgia annotated will be to hide the man-to-principation program. So it's to provide opportunities for apprenticeship sponsors to enter into a partnership program. Contracts with State Board of the Technical College System of Georgia to provide for completion awards to apprenticeship sponsors for the successful completion of six contracts. To provide for later matters for an effective date to repeal conflicting laws and further purposes. Mr. President, Senate Committee on Higher Education recommends that this bill do pass, respectfully submit its inter-burns, chairman. That can be seen under Mr. President. We're going to add Senator from the 45th. Thank you, Mr. President. Colleagues, I bring Senate bill 180. Before you today has to do with high demand apprenticeship programs, which was initially just created in Senate bill 379 in 2022. The purpose of this program was to incentivize apprenticeship sponsors to establish and grow existing registered apprenticeship programs in the state of Georgia. Last year, under the Senator from the Forest Leadership, the program was amended to make improvements to it. The 88 AP program has been successful and has been successfully supported by industries around the state. Encourage new apprenticeship programs and for those programs to grow. Given the demand in many industries such as construction, electrician and others, we need to support additional apprenticeship programs and providers throughout our state. We've come back to today to make one change to the bill from last year. And all it has to do with is providing more access under TSG. The apprenticeship sponsor is the one difference in the bill. Currently, you would have to apply with basically a company. The company would be your sponsor and then they would take those funds. They would receive those funds and then it would go to the high demand apprenticeship program. The way the bill changes is that the student could go directly to the apprenticeship program instead of to just the company that would sponsor them. The reason for this is just for access. Some students may not know many electrician contractors and the schools have a list of them. So it just kind of helps open that up. Will that Mr. President be happy to answer any questions? You have no questions, Senator. Thank you, Mr. President. I yield well. Does any other senator wish to speak for against measure? Chair, is there objections to previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to agree into the Board of Committee, which is February to the past of the bill? Chair, here's none. The Board of Committee is agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. All those in favour vote? Yeah, you opposed nay. You said you're not in the machine. On the past of the bill, the yeas are 53 and neys are one. biz bill having received direct institutional majority, is therefore past. Centuckle 63 by Senator Dixon, The 45th and others built forty two nine pounds to Menn nation 515 of article 6 of ஒ tahua tj and wth missram Gefusca, Georgia annotated vl to Mrs. louise provisions. Under the equality basic education access to that local school systems offer certain exams to home study students. Generated for notice requirements, there were a bit additional qualifications to provide a definition to provide related management for people conflicting laws and for other purposes. Mr. President, Senate, committee, and education youth recommends that this bill do pass or is five police minutes, Senator Hickman, Chairman. Mr. President, Senator Dickson of the 45th offers the following amendment. Number one, to amend Senate Bill 63, by replacing lines 23 to 26 with the following. C, no school system that offers the PSAT, NMSQT, SAT, pre-ACT, or ACT, or an advanced placement exam to students enrolled in such a local school system shall require home study students to pay fee, not required as students enrolled in such a local school system, or impose any requirement that can be fixed with or is in addition to the requirements of sub-sex and C of Code Section 20-2-690. That completes the order, Mr. President. We're going to have a serve from the 45th. Thank you, Mr. President. Colleagues, it brings Senate Bill 63 before you today. It has to do with home school students with their advanced placement testing for college. Currently, certain school systems have had about a dozen parents in my home county of Gwinnett, also heard from parents across the state, where home school students have been made very difficult for them to take those advanced placement tests. Sometimes they're given a location on the other side of the county, from where they live. They also have to pay for the tests. I heard from a mother today that lives in Albany, and she had to go, she had to travel to Columbus for the ACT test for her daughter, had to incur a hotel expense, and had to pay for the tests. Simply what this bill does is it would allow home school students to take those tests at their residency school. If there's no charge for those tests for those students, the home school students would not be charged. If there is a charge, they would pay that same charge as well. It's simply access to these tests. Those students, those parents are paying their taxes just like the rest of the students' parents are, and just give them access to these tests. The amendment, it just brings in the code section where home school, where that law was created. I'm just kind of clearing that up. Would that, Mr. President, be happy to answer any questions? You have no questions, sir. Thank you, Mr. President, you'll be well. He's all right, so he's a secure Jew of vote. We know this thing is all right then. Does any of the students wish to speak for against a measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Questions only doubt the amendment. authored by the Senate from the 45th. Is there objection to the amendment? That objection, the amendment one is added. Is there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill? Chair, here's none. The Board of Committee has agreed to. Is there objection to the main question being ordered? Chair, here's none. The main question is ordered. Question on the pass of the bill. All those in favor? For the bill, vote, yay. All those opposed, nay. Secretary-unquote, machine. All in the pass of the bill. The yay's are 53. The nays are zero. This bill hasn't received recceive constitution. Majority is therefore passed as amended. Senate bill 110, Secretary. Senate bill 110 by Senator Annapurte. The 31st and others. The bill is being handed to the amendment. Code section 15-11-2. The official going to judge entity here. Related to definitions relative to the juvenile code. Senate revised the definition of neglect and through who provide for new definitions to amend code section 16-5-60 of the official going to judge an entity related to reckless conduct causing harm or endangering the bodily safety of another and conduct by HIV-invicted person. So as to provide for an exception for two certain offenses of reckless conduct for legal custodians permitted to children to participate in independent activities under certain conditions to provide for later matters. To write for an effective date and applicability to repeal conflicting laws and for other purposes. Mr. President, the Senate Committee on Children and Families recommends that this bill do pass by subsequent minutes of a Kirkpatrick chairman. Mr. President, the Senate Committee on Children and Families offers to follow and substitute to Senate bill 110 to be entitled to amend code section 15-11-2 of the official code of Georgia and it's head of law to definitions relative to the juvenile code. So as to revise the definition of neglect and to write for new definitions and for other purposes that can be seen under Mr. President. We're going to send in from 31st. Thank you, Mr. President. Senate bill 110 makes Georgia's open-ended definition of neglect much more specific and fair giving families across the state notice that it is their right to let their children do a few things. Travel to and from school simple things we would think. Travel to and from school including walking, running, bicycling, engaging in outdoor play, being home for a reasonable amount of time, engaged in similar independent activity. Senate bill 110 allows parents to make these family decisions of determine when their child is of sufficient maturity, physical condition and mental abilities to avoid substantial risk or physical harm. The bill clarifies that neglect is the denial of quote unquote necessary care to a child creating an environment that is obviously interested to his or her welfare. This tightening of the definition of neglect comports with the public's understanding that the state should not intervene in family life unless the parents' actions or emissions cause a serious risk of harm to the child that is obvious to a reasonable parent. Current law allows authorities to label a parent a child neglector based on their own moral judgments without evidence of appearance and jandering a child or health safety. This bill is necessary so good caring families are not getting swept up in the criminal justice system or child welfare systems intervening with their kids, either by choice or necessity. This bill is about families having more freedom, independence, us not relying on the government to solve all our problems, whether that's defects, in many cases in some of our neighborhoods, enforcement, pretty much common sense. Mr. President, I'll yield if there's a question, too. Thank you, Mr. President. Does he have any other senator whisperer speak before against bill? Chair, here's the other objection to the previous question being ordered. Chair, here's the previous question is ordered. Is the adoption of the committee substitute? Is there objections to the adoption of the committee substitute? Here you're none, the committee substitute is adopted. Is there objections to the board of committee which is favourable to the passes of the bill? Chair, here's none. Board of committee has agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the passes of the bill by substitute. All those in favourable? Yeah, all opposed. No, you're secretary and not in the machine. Chair, if it's to you, the nays are won. This bill haven't received any rest of the constitution materials. Therefore pass by substitute. Secretary Reed, Senate bill 126. Senate bill 126 by Senate Bix, and the 45th, and others, the bill to maintain an act to amend. Code section 222, that's 2096.1 of the fishcutter, George Anatator. Only two definitions relative to the completion of special schools. Access to lower the age of eligibility from 18 to 16 for certain students to be enrolled in a completion special school to revise definitions to write for related matters for peer conflicting laws and further purposes. Mr. President, Senate committee, and education and youth recommends that this bill do pass or strictly submit it, Senator Hickman, Chairman, McVeasey, Order, Mr. President. I recognize Senator from the 45th. Thank you, Mr. President. Senator Hickman, I would like to thank the colleagues that bring Senate bill 126 before you today. It has to do with our completion schools here in the state, which would be referred to as mountain ed, foot hills and coastal plain. Essentially two years ago, there was a house bill 87. It changed a few different components to the completion schools. They were referred to as state charter schools before that, but it raised the dropout age from 16 to 18. And what that's done in the past two years is dropped enrollment rate by about 50% in these schools. And unfortunately, these kids that attend these schools, this school gives a very flexible option to the time of day that these kids can attend school. They can go here in the day. They can go at night. They can take classes online and they can do a combination of all those as well. A lot of these kids that go to these schools, I've been to several graduations, foot hills is in my district. A lot of these kids are at risk of not graduating at all, maybe getting a GED, whether they've started a family early, whether it's sickness within the family or they've just got to simply go to work to help support the family. This gives them that option. They also don't have to fit in that cohort of four years and a semester. It gives a lot of flexibility to these children. And if we lose these kids, in which, like I said, the enrollment rate has dropped by 50%. I would say the majority of these children are, I've actually just entered the workforce more than likely, most of them won't get a high school diploma at best, maybe a GED. And we all know that's not equivalent to a diploma. By dropping this age, I think it would bring it back in line and help and get the enrollment rates back up, but more importantly, get those kids diplomas in their hands. Would that Miss President be happy to yield for any questions? You have no question, Senator. Thank you, Miss President, I yield a well. Did you want to speak for the bill? Oh, I'm sorry, Senator. He wanted to ask you a question. It was the other button needed to match that, Senator. It's the other button, no, for a question, Senator. I do. Tell me what is the age to be required to stay in the being school? Is the age of six to 16 to be in school? Is the age of 16 in traditional schools, like your residency school, you could drop out at 16 or choose to go to the home school or go to any other type of like dual enrollment things of that nature? So if a child or student drops out at age 16 and then under a current bill, they cannot apply to come back to the police completion school until they're 18. That's correct. So they're directly out of school two years in before they come back, which probably means they won't ever come back. And I think that's why we've seen such a tremendous drop in enrollment. I mean, in coastal plains, I think we've actually saw a drop in enrollment about a thousand down in that area. So there's a thousand students that are not in school. A thousand students that are probably may not even get the GED, a thousand students that may be enrollment in the street. So the drop this age back to 16 really makes a lot more sense. Is that correct? Yes, sir. It does. Mr. Chairman, it makes a lot of sense. And yes, you take any child out of the school setting at the age of 16 for two years, the likelihood for them coming back and getting a diploma would be very low. And a lot of these kids, like I said, have been to several of these graduations. You get a lot of entrepreneurs, spirit children that are in these schools, but life has hit them at a very fast rate for whatever reason that may be. And to take them out of school for two years more than likely most of them will just enter the workforce. And the example I gave you about coastal plains is the same type of example for a food hill and mountain head. I mean, we're losing thousands of kids dropping out because the age is 18 instead of 16. That's correct. Thank you. Thank you, sir. Thank you. Now you have no question, Senator. Thank you, Mr. President. Does any of the Senator wish to speak before or against the measure? Chair, here's none. Is there objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill? Is there objection to the main question being ordered? Chair, here's none. The main question is ordered. Question is on the passes of the bill. All those in favor vote. Yeah, all opposed nay. Secretary, I'm not the machine. Thank you. All in the passes of the bill, yeas are 50. The nays are one. This bill has received requisite constitutional majority as their four pass. Secretary, Senate bill 154. Senate bill 154 by Senator Hatch. The 50th and others built to be turned in act to amend titles 2035 and 43. The official go to Georgia annotate related to education, law enforcement officers and agencies and professions and businesses respectively. So, it's a revised or removed references to the United States Department of Education from the official code to Georgia annotated to replace a reference to student aid reports with FAFSA. Submission summary to provide for related matters to a right for an effective date to repeal conflict and laws and further purposes. Mr. President, Senate Committee on Education and Youth recommends that this bill do pass to request minutes and her Hickman chairman and Mr. President and my no report to Senate bill 154 has been attached. Mr. President, Senator McLean of the 14th offers the following amendment number one to amend Senate bill 154 by replacing inserting or its successor after online 11 and inserting or its successor after.\n\nOnline 34 both with the word pile driving Mr. President I can please the order. Senator from the 50th. Thank you Mr. President. Rise to bring you Senate Bill 154. It's a short bill but it's an important bill moving forward in the state of Georgia. If and when the U.S. Department of Education is ever disbanded, I referenced our code section and in 25 different places we actually refer to the U.S. Department of Education. Of most importance it deals with licensing professionals and so in order to become a licensed professional in the state of Georgia you have to graduate or complete a certain school that is recognized by the U.S. Department of Education if that goes away technically. Peace officers, social workers, dentists, dental hygienists, dental assistants, massage therapists, optometrist, psychologist, speech language pathologist and audiologist. The list goes on they would not be able to be accredited or be licensed in the state of Georgia. So this bill what it says is wherever it refers to the U.S. Department of Education you put a comma after it and put or it's successor and I'm happy to answer any questions but ask for your favorable consideration. You have no question. Thank you Mr. President. I yield the one. Senator from the 14th would you like to speak to your amendment? Thank you Mr. President. Good afternoon colleagues. I bring to you amendment one to Senate Bill 154. The problem with this bill is if we're going to get rid of the Department of Education we need to go all the way but brother what needs to happen is you've got to eliminate it from the code entirely just putting or its successor implies the Department of Education is allowed to exist brother that's unacceptable okay we've got pro wrestling experts who we have put in place to pile drive the Department of Education so let's do the same thing in the code brother that's all this amendment does I'm counting on you to vote yes on amendment one so that we can bring the level of seriousness and expertise and skill to this discussion of the Department of Education that the moment in history requires I'll yield for any questions Mr. President. King Lee you have none thank you Mr. President. He's back. We were we were worried about you earlier. Mr. President Chairman I'm sure that the author of the bill, the Senator from the 50th, has the best of intentions and I'm not attempting to sell those. He's probably trying to prepare for the coming storm, if you will. I would suggest a better option would be to all sign a resolution resolved that the Georgia Senate opposes the dissolution of the Federal Department of Education. I think that would really handle this situation. It's disturbing and that's putting it very mildly. To see people that I know know better. You served on school boards, you sent your children to public schools, you live in communities where public schools are celebrated. You know a lot of teachers, you know a lot of educators, you know countless people who have committed their lives. Their entire career has been in the service of educating our future generations. And this notion that has cropped up and you hear it, you know one of the classic ways to swing public opinion, you're supposed to repeat the message. What is it said? It's 12 times. People start catching on and they say, well everybody's talking about it. Well I hear people saying, yeah we ought to close down that department. I'd love to hear any one of you make a convincing argument for how the Federal Department of Education should be closed down. And we've got the facts and the figures. And the reality is that having a Federal Department of Education plays a critical role in funding, in researching and in leading the way for good practices in education. And I mean I am just almost speechless at the thought that I'm looking into the faces of people who think we ought to shut down the Federal Department of Education because a certain person said that, again not someone who is an anyway experienced or even intelligent about the question of education, K through 12 or higher education. But it's become this clarion call and it's disturbing to see members of the Republican Party who know better chasing like limmings toward the cliff of, yeah we got to all get on board and shut down the Federal Department of Education. I mean we have college president, former college president in this body. We have school board members by gosh probably two dozen people here have served on school boards. How many of us have raised children and sent them to school? And what is the magic, Alex are here? What is this special potion of shutting down the Federal Department of Education? Many takers come to the well and explain to us why that's a good idea. Now I understand that the Senator from the 50th is attempting to prepare for the coming storm and change our language now in the state code so that we can proceed with education at the magic moment that the king up in Washington rules that that woman who runs the wrestling crowd that he's appointed, he's appointed her to be the head of education, Federal education and he's appointed for one reason to take it down. So I can understand the efforts of the Senator, the good Senator from the 50th who I know is a supporter of good public health policy, good medicine and good education. That's who he is and he's a great dad as well and a family man and I know his intentions are honorable. But could we not race like lemmings to the edge of the cliff and push each other out of the way to be the first in line to say, I embraced the concept of shutting down the Federal Department of Education. People we're at a moment here. We're at a moment. I mean if you really sat back and thought about it, it's a preposterous notion and making you know, trying to marginalize educators and attack the Department of Education that has done innumerable good and that plays a critical role in funding all sorts of educational initiatives for our state. It's just like we heard when the USAID the other day was shut down and children are now dying from that around the world and we heard an explanation of how bad the USAID is. It's been around for 60 years keeping malnourished children alive instead of burying them. Let's gather up our senses and act collectively on behalf of, you know, for the good of our people. You're going to go home and tell your school teachers and your principals and your school superintendents, yeah, we went down there and got ready for the coming storm. We changed all the parts of our code around education so that we'll be ready for when the Federal Department of Education is shut down by this woman from the wrestling world. Think about it people. You've got to look at the real world. Another attack on fundamental structures and infrastructure in our civil society that has been working for a long, long time. But, watch out. It will be next weekend or the one after that when you turn in your resignation. So we've got a lot of dangerousness and foolishness going on in Washington and will be well served to bring some common sense to the table and not race like a lemon to the edge of the cliff and fall over. I will yield for questions and if not, I'll yield the well. You do have no questions. Senator from 38. Thank you, Mr. President. Does the General Lady yield? Yes, to the Senator from the 38. Is it not true that the U.S. Department of Education was started by Georgia's only United States President, President Jimmy Carter? You are correct. The President Carter from the small town of Plains in the southwest portion of our state, who want to seat and serve as our President, honorably, launched the Federal Department of Education. Thank you. Is it not further true that in order for the U.S. Department of Education to be gone away, it would require congressional approval. Is that not true? Well, that is my understanding. I do also know that there are repetitive lawbreakers right now in Washington that are taking great pleasure in kicking over everything and knocking the props out from under our civil society and our government. So I'm not surprised that they might attempt to do it without congressional action, but they would be breaking the law. That's right. Is it not further true that on Friday, staffers were told by Elon Musk and his minions that they could get a 25,000 buyout if they quit by Monday? That's exactly right. That's what that must God did. Yeah. Thank you. Is it not further true that should the United States Department of Education go away, those responsibilities will fall upon the states. And therefore, we would actually be growing state government in order to implement the work that is done at the United States Department of Education. You make a great point. And it really underscores the lunacy of this approach that we're seeing coming from the current administration. Thank you. Thank you for your question. Bring it out of the center from the 53rd, but you can yield at any time. Thank you. I mean, there's another question from my friend from the mountains. Yes, Senator. We both have our roots in Tennessee. Senator, do you consider yourself well-educated? Well, I could answer that quite seriously. I always thought I knew a little bit, but when I stepped into the streets in 1964, in 1963 in the March on Washington, I learned so much that day that taught me I had been miseducated as a white southerner. So there's a couple of ways to answer that. I try to stay informed and up to date. And everybody, anybody can be wrong sometimes. You hope to be right most of the time. So Senator, are you indicating that you're not happy with your education? I'm sorry. Are you not happy with your education or your educational background? Well, the hour is late. I don't know how much rumination you want me to do about that, but I went to school in Virginia. They've got great schools there. But I was raised in the segregated south where white people were given a certain narrative. We were raised in a certain way with a certain set of beliefs being promoted in the white southern culture. So in that sense, I realized I had been seriously miseducated and undereducated about some very important things about this country's history and the dynamics and what people based on their race had been subjected to in this nation. Do you think if there had been a federal Department of Education when you graduated, you would have had a better education? The federal Department of Education. When I graduated, I was, let's see, that would have been prior to the formation of the federal Department of Education. We had a good education system in many significant ways in Virginia. I compared it favorably with what I found in Georgia when I got here. The further questions I'll yield the well. You've got one last question. Senator from 28. Senator from the 28th. I'm standing. You know that your district number was changed and I apologize for not recognizing. I'm still relearning these new district numbers. Is that a problem? Will you yield? I yield certainly. Isn't it true that the federal Department of Education is in charge of disseminating different grants and monies to all the state board of education? And I know you have, your family comes from a lifetime of professionals in the world of K through 12 education and that is correct. Also in the true that if it goes away, if it's abolished, that is going to trickle down different problems to all the state's school boards. I believe you're correct. I view it as a dangerous action that's being proposed in Washington. Absolutely. These are perilous times already in education we have so many problems. Isn't it true that we definitely need to keep all, it'll trickle down. So of course if we lose the national federal board of education, then it's going to come down to the states as well. I would agree. I would agree. And we're going to see in Georgia a heavy burden to continue the work of educating our next generation of leaders in the absence of the federal Department of Education. And folks, just hold up the idea that President Carter launched this laudable effort with the best of intentions of expanding and improving our educational systems not only in Georgia but across the country. Thank you very much. Thank you. I will yield the well. Thank you. Thank you, Senator. All right. Does any of the Senator would speak for against measure? And Senator from 50, do you wish to close? All right. Glory to yours. Thank you, Miss President. Where to begin with that? The purpose of this bill, which I clearly stated, was if and when the U.S. Department of Education is a span of Georgia, it needs to be able to move forward. We need to be able to graduate police officers. We need to be able to graduate nurses. We need to be able to graduate dentists. To the excellent point from the center from the 28th, we have federal grants that we rely on and we need to be prepared for that. I'm here to make sure that Georgia can move forward. But I understand this is a very political issue and people have pointed some fingers. The minority report, I'm going to have to disagree with the wording of it. But I will say this, on October 17, 1979, when Jimmy Carter established the U.S. Department of Education, the United States was ranked number one in the world in high school and college education. Now, I'm not up here advocating for Donald Trump to deal away with the U.S. Department of Education. I'm advocating for him to do what's best for our country. And in this room, we were elected to do what's best for this state. And what they do at the federal level trickles down to us and we need to be prepared. So if you want to do what's best for Georgia and prepare Georgia citizens, our children, and our schools for what could potentially come vote for this bill. If you don't, vote no. I'll yield the well. Thank you. Senator has closed the debate. This question is on the amendment I'm on authored by the senator from the 14th. Is there objection? Yes. Here's objection. All those in favor of the amendment will vote, yay, all opposed, nay, Secretary-Anne Lawton machine. All the adoption of amendment number one, the yeas are 21, the nays are 32, and this amendment has failed. Is there objection agreed to the board of the committee, which is favorable to the passes of the bill? Chair here is none. The report of the committee has agreed to. Is there objection to the main question being ordered? Chair is none. Any questions? Order questions on the passes of the bill. All those in favor of vote, yay, opposed, nay, Secretary-Anne Lawton machine. All in the pass of the bill, the yeas are 37, the nays are 17, this bill having received the correct constitution of the majority of the bill. Senator Walker, the 20th and others between 10 and act to amend code section 10-1-393. The official code of Georgia annotated really to unfair the subject practices and consumer transactions. Unlawful and examples are to provide increased consumer protection for homeowners entering into contracts with contractors following natural disasters, survivors that are in contract for requirements, survivors that are in notice language to amend code section 33-6-5. The official code of Georgia annotated only to unfair methods of competition and unfair or deceptive acts or practices, so to prohibit the assignment of benefits in certain circumstances for survivor definitions, survivor related matters, survivor legislative findings, or people conflicting laws and further purposes. Mr. President, Senate Committee on the Insurance and Labor recommends this bill do pass by committee substitute or submit it to Senator Walker, Chairman. Mr. President, Senate Committee on Insurance and Labor, I was following substitute to Senate bill 201, a bill between 10 and act to amend code section 10-1-393. The official code of Georgia annotated only to unfair or deceptive practices and consumer transactions, unlawful and examples, so as to provide increased consumer protection for homeowners entering into contracts with contractors following natural disasters and for other purposes that complete the order, Mr. President. I recognize Senator from the 20th. Mr. President, I think this is the bill many of us have been looking for today. Not only is it a good bill, which is one reason to look forward to it, but it's the last bill on the rules calendar for the day. So I know there's some excitement around that. Senate Decorum restrains me from explaining this bill in my best imitation of my favorite wrestler, the Nature Boy, Rick Flair. He's Stone Cold, Steve Austin, but seriously colleagues. We've had some acrimony in the chamber today. We've had some strong disagreements, strong opinions, one way or the other. I think this is a bill we can all get behind. I hope we'll have a unanimous yay vote on this. It adds to Georgia's Fair Business Practice Act, some protection for Georgia homeowners in their probably toughest time of need after a they suffered a natural disaster and had damage to their home. Sadly, what we have seen, we saw it after Hurricane Michael, we've seen it again after Hurricane Helene, some unscrupulous contractors will come in and try to take advantage of people when they're sort of at their most vulnerable moment and under a lot of pressure to get the roof fixed or their home fixed and they're nervous because they see all their neighbors property damaged and they think they better hurry up and sign a contract and get in line or they won't get their work done in a timely manner. So what this does, it adds section 36 to the Fair Business Practice Act to give protection in this event. So if a contract, it gives a homeowner the ability to get out of a contract that they may sign with a contractor within, if the contractor does not perform the services in a timely manner or in an appropriate manner and it also allows them if they if they file an insurance claim and let's say they have some roof damage and they believe that the insurance company is going to pay for the roof damage and they find out from the insurance company that the claim is only going to be partially covered or maybe the claim is not going to be covered at all. It gives them five days to get out of a contract for the roof repairs in that example and then lastly it prohibits insurance companies from assigning the insurance benefits to a contractor of a person that lives in a county that's been declared a national state of emergency and so for damage to their property due to a natural disaster. So good consumer protection measure to try to eliminate some of the shady practices we see after a big time storm or natural disaster. Mr. President, I'm happy to answer any questions. If not, I will yield that well and ask for everyone's favorable consideration. You do have one question. Senator from 19. Thank you, Mr. President. Senator, are you yield? Yes, sir. Senator, thank you for this bill. Is it not true that by putting this code section under the Georgia Fair Business Practices Act, you actually create a calls of action with a penalty of $150,000 per violation? That's not really my area of expertise but I'm sure that you know what you speak. Senator, will you yield for one more other question? Yes, sir. Is it not true that when you did your Ric Flair imitation earlier that your hair did not move at all? Thank you, Senator. All right, I yield the well. Does any other senator which speak for against the measure? Is there objections previous question being ordered? Chair, here's none. Revege questions ordered. Questions on the adoption of the Committee's substitute. Is there objection to the adoption of the Committee's substitute? Hearing none, the Committee's substitute is adopted. Is there objection to agreeing to the Board of Committee which is favorable to the passes of the bill? Is there objection to the main question being ordered? Chair, here's none of the main question is ordered. Questions on the passes of the bill? By substitute. All those in favor of the bill? Yeah, you oppose, Dave. Secretary and London Machine. All in the pass of the bill, the yeas are 53 and the nays are 1. This bill haven't received the right to constitute the majority. Therefore, pass by substitute. Congratulations, the nature boy.\n\nYou want another one? Reganise the senator from the 16th, let purpose your eyes. Okay. Sssss. Reganise the majority leader for motion. Mr. President, I move that the Senate standard-journ, according to Senate resolution number six until 10 a.m. on Thursday, March the six. Secretary, read the analysis. Mr. President, the regular industries and utilities committee meeting has been canceled and tomorrow at 12.45 p.m. the rules committee will meet in room 4.50 in the capital. That completes the order, Mr. President. Senator, floor is yours. For those that are on government oversight, we're going to meet tonight for the dinner at Fogo to Chow at six o'clock. And if you've not contacted the office, that's great. Come on in. We'll look for you at six o'clock. Thank you. Any other announcements? Any other announcements? All right. The majority leader has moved that Senate standard-journ until Thursday, March 6, 10 a.m. all those in favor. Signify by saying aye. All those opposed? No. I just clearly have it. Have a good evening.",
  "updated_at": "2026-02-13T15:29:17.252088+00:00"
}