{
  "video_id": "Fdn3jkO6OEw",
  "url": "https://www.youtube.com/watch?v=Fdn3jkO6OEw",
  "title": "Sen. Elena Parent Press Conference on Reproductive Rights | 2-28-2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 37,
  "summary": "Here is a summary of the key points from the Georgia Sen. Elena Parent press conference on reproductive rights:\n\n**Overview**\nSen. Elena Parent addressed growing concerns around restrictions on reproductive healthcare, including the potential overturning of the constitutional right to contraception. She introduced two bills to codify the rights to contraception and IVF in Georgia law.\n\n**Key Actions**\n- **Right to Contraception Act**: Codifies the right to choose when to start or expand a family through contraception.\n- **Right to IVF Act**: Establishes that human eggs or embryos outside the body are not considered children under state law.\n\n**Bills Introduced (First Reading)**\n- Right to Contraception Act\n- Right to IVF Act\n\n**Notable Moments**\n- Sen. Parent expressed concern that no Republican colleagues were willing to co-sponsor the bills, indicating partisan disagreement on these reproductive rights issues.\n- Rep. Marvin Lim, a Catholic, spoke in support of the right to contraception, noting its importance for family planning and public health.\n\n**Votes**\nNo votes were recorded in the summary.\n\n**Attendance**\nThe summary does not mention quorum or attendance.\n\n**Adjournment**\nThe press conference appears to have concluded, but no specific adjournment time is provided.",
  "transcript": "All right. Good morning. Good morning, everyone. And thank you for\nassembling with us this morning to discuss an issue that is weighing heavily on many Georgian's\nminds. I'm Senator Elena Parent and proud to represent the 42nd Senate District\nand serve as the Chairwoman of the Senate Democratic Caucus. Alarm bells are sounding around\nthe country right now and for very good reason. Time and again legislators and our courts are\nmandating that reproductive medical care conformed to certain religious views and not to long\nestablished medical standards of care. The DOBS decision we now see was really just the beginning,\nalthough what a beginning it was, landing with all the force of an earthquake around the United\nStates as women saw a right that they had held for 50 years evaporate with the stroke of Justice\nAlito's pen. Currently in Alabama, chaos is unfolding as the Alabama Supreme Court altered the\nthe medical landscape with a truly radical decision\nthat frozen embryos created outside of a human body\nare deemed to be human children under law\nthat cannot be discarded.\nContraception itself, the beginnings,\nthe foundation of family planning,\nis a target of an extremist right-wing agenda\nand this battle is unfolding on many fronts.\nHow do we know this?\nJustice Clarence Thomas voiced support\nin his concurrence in the Dobbs case overturning Roe v Wade.\nFor also overturning Griswald versus Connecticut,\nthe seminal 1965 decision that gave couples\na right to the use of contraception\nfor their family planning.\nIn the U.S. House of Representatives,\n195 members, 90% of them members of the Republican Party voted against the right to contraception\nact in July of 2022.\nThey would not take that vote to affirm the right to contraception.\nSenators Mike Braun of Indiana and Marsha Blackburn of Tennessee have both indicated publicly\nthat they believe that decisions about contraception\nshould be left to the states\nand no longer be a fundamental American right.\nThe majority of Americans are concerned\nabout these flashing warning signs\non further government intrusion\ninto their family planning.\nThe Heritage Foundation, an influential right wing think tank,\nhas called for a feminist movement against the pill.\nFor those that are not yet alarmed, one only need look at the certainty many felt\nthat the Supreme Court decision in Roe v Wade would always allow the right to abortion\nfor women across the country.\nOne only need look at that to realize that taking these things lightly is a huge mistake.\nSo yesterday I filed two bills to address reproductive health care.\nThe right to contraception act will codify our right to choose when we start or expand\na family.\nThe right to IVF act will codify that a human egg or fertilized human embryo outside\nof a human uterus is not considered a child or minor under state law for any purpose.\nAnd the truth is, I filed these bills not out of a sense of hysteria or to score political\npoints.\nOur neighboring state has taken radical action that have thrown the family planning efforts\nof thousands of couples in Alabama\nwho are desperately seeking the opportunity to be parents\ninto question, potentially crushing their dreams\nof being able to be moms, be able to be dads,\nto have children, to add to their family.\nWe need, Georgians need certainty to know\nthat that level of terror will not be inflicted upon them.\nGoing through the process of trying to expand your family through IVF is already physically\nand emotionally draining.\nFeeling like that opportunity could be ripped from you at any moment, especially when\nthere's great cost to undergoing that type of assisted reproductive technology is not\nthe type of emotional rollercoaster.\nI want Georgia couples, women, men to face or be afraid of.\nAnd right now, there are couples here in Georgia questioning whether they should spend\nthe money to embark on that journey, knowing that that ability could be ripped from them\nat any time.\nI am very concerned, though, that our Republican colleagues here in the State Senate simply\ndo not agree about what we view to be fundamental rights to family planning that are standard\nmedical care.\nI invited everyone in the Georgia State Senate to sign on to both of these bills yesterday.\nI saved spots for my Republican colleagues\nso that they could sign on in the top five\nto show their support, to demonstrate that these are bipartisan values.\nThese are things that the vast majority of Americans and Georgians agree on.\nI kept them at my desk for several hours waiting for Republican co-signatories\nand none were forthcoming.\nSo in the end, I filled in with other caucus members of mine\nwho democratic senators whose values are firmly aligned\nwith allowing Georgians reproductive freedom.\nSo that makes the warning size flash\neven more strongly to me,\nthat not one of my colleagues was willing to say,\nI support IVF, I support the right to contraception.\nHere's the deal,\nGeorgians have the right to healthcare,\nto reproductive healthcare,\nand to contraception and family planning tools.\nAnd any restriction on this access is dangerous\nbecause it prevents people from making choices\nthat affect their physical, mental, economic,\nhealth, and well-being.\nThese rights are sacred, and this should not\nbe a partisan issue that is used to play games\nwith constituents, lives, and the families\nthat they are hoping to build.\nSo with that, I would love, I have the honor\nof being able to bring up my good friends\nand a whipsmart lawyer, representative Marvin Lim.\nThank you senator parent so like a good lawyer I will start with with the law as she did.\nOne of the many far reaching implications of dobs is that the Supreme Court explicitly\ncalled into doubt the case that that my colleague senator parent named which was Griswald\nbe Connecticut, which came in 1965 before row, and that was almost 60 years ago now.\nThat did establish that there is a constitutional right to privacy that prevents any government\nfrom restricting access to contraception.\nBecause we have been taken back almost 60 years, and because, again, the threat to this\nright is not imaginary, but it is very real.\nSenator Parent mentioned what has happened at the U.S. Congressional level, and I should\nalso point out that several states have also passed or at least attempted to introduce\nbills that try to ban access to contraception.\nThat is why I stand here with my colleagues today as a proud sponsor of the Georgia Right\nto Contraceptum Act, which enshrines this law in our state law.\nI will say that as a Catholic, who is originally from the Philippines, I was taught and know\nquite well the stage, the Aquinian natural law teachings on this matter, yet even the\nPhilippines in 2014, I will note, one of two countries in the world besides the Vatican\nthat continued outlawed divorce, managed to pass a law, guaranteeing universal and free\naccess to modern contraception. Unfortunately, we in America seem to be moving in the opposite\ndirection. I cannot stress enough, we cannot stress enough how critical access to contraception\nis for all people, including men like myself, who must bear great responsibility in both family\nplanning and generally sexual and reproductive health.\nWe know for a fact that contraception reduces rates of unintended pregnancies, reduces\nthe need for abortions, which again is especially critical because of DOBS, reduces HIV transmission\nto newborns, promotes maternal and infant health, something we've been talking a lot about\nhere in the Georgia General Assembly, and reduces sexually transmitted infections.\nThese are all facts, period, born by evidence time and again.\nAnd these are things that, along with all people, again, including men, like myself, should\ncare about because of the responsibilities we bear.\nAnd to the extent that so many men, unfortunately, do see contraception as primarily a woman's\nresponsibility, it only underlines that any restriction will, accounting for the realities\nof human behavior, become that much more of a deterrent to access.\nWe also know that contraception is particularly critical in all respects to minority and\nlow-income communities, like my district, which is comprised of almost 50% immigrants\nlike myself and 25% of people in poverty. These communities are disproportionately burdened\nby sexual and reproductive health challenges, in part because of existing disparities with\ncontraceptive use and non-use, which extends to both education and access to these services\nand goods. So access to education, cultural influences, excuse me, other factors do account\nfor these existing disparities, yet regardless of the reasons, it is again clear that any\nrestriction at this stage will become exponentially more, exponentially more of a deterrent to\nthe critical access we need across races, across genders, and yes across political divides.\nAll of this is why we have introduced the Georgia Right to Contreception Act, which in\nthe House's House Bill 1424, the threat is too grave and too real not to act.\nAnd with that, I'm proud to turn it over to my co-sponsor, Representative Terry Inolvitz.\nThank you so much.\nThank you for being here today.\nI will never forget that night here in the General Assembly when House Bill 481, the\nso-called Heartbeat Bill, passed out of the chamber.\nI spoke against it along with many of my colleagues.\nWe fought hard.\nBut what sticks with me the most, what comes back to me when I think about that night,\nand I think about that night often, was being in the anteroom, listening to the discussion,\nand having Republican colleagues, I say colleagues, because it was more than one, say to me, you\nguys don't need to worry.\nI know you're upset about this, but we don't want to be primary if we vote against it,\nAnd don't you know that row will never be overturned?\nDon't you know that row will never be overturned?\nAnd I will tell you, so many of us believe that in our bones, that that right to control\nour bodies, that right to bodily autonomy was something that could never be taken away.\nBut, y'all, we were wrong.\nWe were wrong.\nWomen are suffering, families are suffering because so many people were wrong when we\nactually thought that that right was something that we would be able to keep.\nAnd now we have seen what's next, right?\nJustice Thomas has no illusions and he's not unique.\nSo many of these Republicans have no illusions.\nThis is about controlling women and one of the best ways you can control women is by controlling\ntheir bodily autonomy.\nYou control weather and when they are able to reproduce.\nAnd that is what we are saying.\nWe know that these rights are fragile, and I will tell you, don't be surprised to hear\nthat any Republican thought that Rome might never be overturned because they didn't want\nit to be overturned because most people, most Georgians poll after poll after poll, tells\nus that most Americans do support access to reproductive health care.\nThey have no problem with contraception because so many people know that contraception\nis health care, right?\nI take the pill right now, not because I'm trying not to have babies, that ship has long\nsince sailed.\nBut because I'm in Perry, Menopause, and ladies, it's awful, it's awful.\nSo if I can try to control some of the things my body is doing with contraception, I am going\nto take advantage of that opportunity because science is a miracle.\nAnd we know, that's probably the quote that will be run, we know that our reproductive\nrights. Our fragile, we know that IVF is on the chopping block and we know that it is just\na matter of time for contraception. It is not a question of if but when we know this. So being\nable to sponsor this legislation is something that is so important to me as a Georgian, as a woman,\nas a mother of a teenage girl who's dealing with her own, you know, learning about the joys of\nbeing a woman and all the things that come along with that. This is important. This is important\nfor Georgians. I also approached Republican colleagues to ask if they would be willing\nto sign on to this because we do know, right? The numbers tell us. The polls tell us that\nthis is an issue that has overwhelming support. And there's that quiet support, right? There's\nthat secret support. There are people who, where if this comes to a vote on the floor,\nthey might take a walk instead of voting no or instead of voting yes. We know that support\nis there and it was disappointing, but honestly not surprising that no Republicans have decided\nto sign on, even though I know that they are getting the same emails I am getting from\nwomen, from families in their district who are sharing their stories of why IVF is so\nimportant to them, of why contraception is so important to them, of why it is a critical\nhealthcare resource that we must ensure every Georgian has access to.\nAnd so I'm very happy to support this legislation.\nI'm glad we are doing this in Georgia.\nIt is an honor to be a part of this.\nAnd I'm not a lawyer, so I can't talk about the legal things.\nI can talk about some of the cultural things,\nso because I am also a Catholic.\nAnd I am a mother, and I am someone\nwho has made these own decisions for myself.\nAnd I tell you, there are no monoliths and politics.\nWe know this, right?\nAnd the majority of Catholics support access to contraception.\nI mean, these are just things that we know.\nThese aren't surprising statistics.\nThey're not new statistics.\nThese are things that we know that we continue to affirm\nwith new polling.\nSo now I want to actually introduce Alicia Stahlworth.\nThank you so much for being here with us\nbecause we have these advocates who have been fighting\nand working for this also.\nWe are going to be in the well speaking about this.\nWe'll be talking to our colleagues about this\nand we've got these armies of advocates\nwho are also ready to help us in this fight.\nThank you for being here today.\nThank you.\nHello, everyone. My name is Alicia Stahlworth. I am the Southeast\nCampaigns Director for Reproduct the Freedom for All, formerly known as\nNeyraw Pro Choice Georgia. I want to thank the sponsors of this legislation\nfor taking this stand alongside of us and really trying to codify the right\nto contraception because we know that our rights are at their risk. Like we've\nbeen wrangling this bill for over seven or eight years within our reproductive bubble.\nAnd we've been saying this for a long time that they are coming for all of our rights.\nSo it's an honor to speak to you all today alongside these champions.\nIt has been nearly two years since the Supreme Court handed down the decision Dops v. Jackson,\nWomen's Health Organization, and the Constitutional right to abortion.\nI really not only gave the green light to anti-abortionist\nremiss to begin enforcing bans, but it also\nsent a clear and terrifying message to Americans.\nOur freedom to determine if, when, and how\nto start a grow a family is on the line.\nAnd you've heard the legislators say this over and over\nagain, because ultimately, that's what's at stake.\nAnd his concurring opinion adopts decision,\njust in time, even when it's far to call on the court\nto overturn its precedent of farming the right\nto contraception.\nAnd for some reason, this was like a wow to most of the Americans.\nBut again, it's all intertwined.\nYou see, we know that those hostile to abortion\nnever attended to stop with ending role.\nThe same extremists working harder than ever\nto roll back abortion rights and assets\nare also targeting our other fundamental freedoms,\nincluding access to birth control.\nAnd as recent Alabama Supreme Court decision shows, IVF,\nthey don't care that American support\nreproductive freedom, including birth control.\nBrian Kim and the extremist Republicans like him\nwere never going to stop at abandon abortion.\nShortly after the adopt decision,\nGovernor Kim was caught saying he was open\nto banning birth control.\nPolling shows that the overwhelming majority\nprotecting legal access to contraception\nand those and that the voters are concerned\nabout states restricted it.\nWe did appalling in 2022, September of 2022\nthat showed 94% of Georgia's supported assets\nto birth control.\nAt the national level, Republicans in Congress\nhave nearly shone their hand by blocking efforts\nby Democrats to protect birth control.\n195 House Republicans voted against the right\nto contraception act and Senate Republicans\nultimately brought it after it passed the House.\nThe doubt of decision affirmed that these actions\nare unrelated.\nThey are not empty threats.\nThese are promises to an increasingly\nextreme minority that will continue to award them with power.\nThere's no time to waste.\nWe must agnow to protect access to contraception\nhere in Georgia.\nAnd we keep fighting freedom will prevail.\nThe people of Georgia are with us.\nTogether, all of us are the majority.\nAnd together, we can build a future we want to live in.\nThank you so much for having me here today.\nI'm passing it on to Dr. Lisa Zeman.\nThank you.\nMm-hmm.\nMm-hmm.\nMm-hmm.\nMm-hmm.\nMm-hmm.\nThanks.\nIt's an honor to stand with the legislators, the lawyers,\nthe advocates on representing healthcare professionals,\nand the women and couples I see every week,\nnavigating economic hardship and challenges\nto access medical care as is.\nWe don't want to burden them anymore.\nI am Dr. Mimi Zeman and OBGYN and co-author of 16\neditions of a medical guide called Managing Contreception.\nContreception is a critical cornerstone of public health,\neconomic stability, and individual freedom.\nWhen couples can plan their families, children\nand brought into the world have the best opportunity\nto thrive.\nThat's why we must pass the Georgia's\nright to contraceptive act.\nSurvey after survey show that over 90% of adults\nsupport the availability of contraception.\nThis overwhelming consensus underscores\nthe importance of contraception to people\non the right and the left.\nContraception is essential not only for family planning,\nbut also for managing various health conditions\nlike menstrual bleeding disorders.\nAs we've seen with abortion restrictions,\nThere were repercussions for the care of miscarriages.\nSimilarly, if contraceptive access is limited,\nthen treatment of all other gynecological conditions\nwill be affected.\nAnd for those people motivated to reduce the number\nof abortions, the most effective way to do that\nis increase access to contraception.\nIn a study conducted in St. Louis, when no cost IUDs\nand contraceptive implants were made widely available,\nabortion rates in the city plummeted\nto less than half the national rates.\nIn the state of Colorado, a family planning initiative\nthat made these same methods affordable\nresulted in a 50% drop in teen births and abortions\nsaving the state $70 million.\nSo wire contraceptives under a threat\nin the name of religious beliefs.\nYears ago, the Supreme Court cited religious freedom\nto allow a private company, Hobby Lobby,\nto deny insurance coverage for birth control.\nA later ruling broadened exemptions\nto include publicly traded companies, private institutions,\nnonprofits, universities, and other employers\nclaiming religious or moral objection to contraception.\nThese religious groups believe life\nstarts a conception when a sperm fertilizes an egg\nforming an embryo.\nLet's talk about embryos for a minute\nbecause they've been in the news.\nThey consider the failure of an embryo to implant\nas loss of life, or as was ruled in Alabama last week,\nthe loss of an unborn child.\nThey argue incorrectly that certain birth control methods\nprevent embryos from implanting, thereby increasing loss\nof life.\nNothing could be further from the truth.\nIn fact, the use of any birth control method\nprevents fertilization and therefore prevents\nloss of embryos.\nIt's when couples do not use contraception\nthat many more embryos are formed\nand then eliminated from the body\naround 60% of embryos formed or passed\nwhen no contraceptive method is used.\nTherefore, anyone holding religious beliefs\nabout embryos deserving protection\nshould actively support the use of all birth control methods.\nThey should support this bill\nand doing so would actually be more in accordance\nwith their values of protecting life.\nWomen will be the beneficiaries of greater health care\nask us access, not less.\nCouples will be able to plan their families\nand bring children into the world when they are ready.\nAs an OBGYN practicing in Georgia post-dobs,\nI've seen firsthand how people are suffering.\nThere's no place in our exam rooms for legislators\nto restrict access to essential health care.\nIt's our duty as citizens to protect and expand this access,\nensuring every Georgian can make personal health decisions\nin accordance with their own values\nand their own religious freedoms\nand without political interference\nor the imposition of someone else's religious beliefs.\nThank you.\nSenator Paren.\nThank you so much, Dr. Zeman,\nfor that first-hand account.\nWe are happy to take a few questions\nif anyone has any.\nFirst, there you are.\nObviously, across other days tomorrow.\nYes.\nI'm expecting you to get this done before this session\nor is it setting the stage for?\nWell, I did.\nI did a great question.\nI did have a conversation with the majority leader\nGooch about that yesterday.\nAnd he said, well, we wouldn't be able to move on that this year.\nAnd I noted that they have introduced\na number of immigration-related measures\nthat they are intending to move on this year.\nSo I pointed that out to him.\nSo anyway, so there is no obstacle\nto actually moving on that this year\nfor those that need the rest of it to be tied together.\nWhat is the next thing?\nSorry, rule is next, and then we'll get over to you.\nBringing you back to state law and Georgia law,\nwhat is it in Georgia law that you believe\nwould lead to an Alabama scenario?\nBecause the law is being different.\nWhat is it in Georgia law that's raising the concern specifically around IVF from the Alabama\nDistrict?\nI'll say something first, and then if anyone else wants to weigh in.\nI mean, from my perspective, our code is riddled with all kinds of places where there are\nquestion marks.\nAnd therefore, we need this strong, very clear, very simple statement that embryos outside\nof a uterus are not children.\nYou know, 481 is a bit confusing in that regard as some language that would seem to be\nprotective, but other language word, you know, we could start to have tax exemptions.\nAnd the thing is, you know, the Republicans have to confront, are they really going to\nmaintain this belief that life begins at conception and all of the implications for reproduction\nand science that that then threatens.\nDoes anyone else want to land on that?\nYeah.\nSo after George's abortion restrictions were passed,\nand even in the process of the hearings\nfor this legislation, right, we had doctors coming\nto the Capitol telling us, like, this was going\nto lead to a lot of confusion and potentially\na lot of very dangerous health care situations\nfor women, so many pregnancies wanted pregnancies,\nand tragically in the emergency room.\nAnd so many doctors told us that there was a real risk\nthat women would go to the emergency room,\nsay with the placental abruption,\nsay with a miscarriage happening.\nThey could be going into sepsis.\nThey could be bleeding out.\nBut if that fetus has a heartbeat,\nthese emergency physicians were very, very concerned\nabout what they might be able to do.\nI received an email from a constituent this week\nwho tragically lost a pregnancy at 17 weeks\nand was bleeding in an emergency room here in Metro Atlanta\nbecause the fetus still had a heartbeat\nand they were trying to figure out\nwhen her health was going to be on the precipice\nto the point where they felt like they could act\nwithout repercussion.\nNow the sponsors of this legislation\nand some of the folks in the majority party have said,\nno, no, no, the exceptions, they're clear.\nNo doctor should worry about this,\nbut we know the reality is that doctors are deeply concerned.\nAnd we have placed a barrier between the doctors\nand the patients and the life-saving care that women need.\nSo when we talk about the laws, yes,\nthere are exceptions that are written\ninto the current code in Georgia,\nbut we know that the reality is that\nthere is a lot of merciness for the actual medical professionals\nwho are on the ground in our emergency rooms\nand in our doctor's offices trying to help women\nand help frankly save their lives.\nI know that physicians right now are working on\ntrying to bring clarifying language to the General Assembly\nso that hopefully we can pass things\nthat do make it more clear.\nSo doctors have less doubt about how\nthey're able to care for their patients\nwithout risking their own freedom, right?\nEven if you've got a doctor at first, you know harm.\nThey're trying to protect their patients,\nbut they also don't want to risk being arrested\nand put into jail, right?\nI mean, this is a real thing.\nSo, yeah, there are exceptions and things\nthat are written in our law, but we know the reality\nis that there is a real murkiness and a real hesitation\namongst a lot of physicians.\nAnd that is life threatening for Georgia women.\nI will just add to that, without a clear statement of what your right is.\nYou're not only creating merciless for the physicians, but for people.\nThose that are trying to plan their families.\nThose who are lawyers, but also most people, the vast majority, which will not have time\nto read the code or the Constitution or case law on wrongful death, wrongful life, etc.\nThat is what Dobbs unfortunately has created is uncertainty, not only with respect to\nIt's created some certainties, unfortunately,\nbut it's created a lot of uncertainties\nthat impact not only the physicians,\nbut ultimately the patient and the people.\nSo I did wanna say that as well.\nGreat point.\nKenna, I have one footnote to this.\nThank you very much, Nan Orox State Senate 36 District.\nBelieve them when they tell you what they're gonna do.\nAnd that's what we're seeing.\nI remember years ago when the US Senator from Pennsylvania\nstated we have to block this, stop this contraception and it was jaw-dropping to hear that out\nof a mouth.\nBut the take-home lesson is, politicians and judges are not gynecologists, but they're\nbehaving as though they are.\nAnd years ago in the Health and Human Services Committee, there was an effort to block access\nto fertilization services of medical experts.\nAnd this capital was flooded.\nThis capital was flooded with families,\nbringing their children or their children's photographs\nthat are where a result of in vitro fertilization.\nAnd at that point in time, years ago,\n78,000 Georgia families had taken advantage\nof this medical option.\n78,000.\nThere's no telling how that number has grown at this point.\nSo I say to the GOP, if you want to make this move in Georgia\nbe prepared because you're going to be overwhelmed\nwith opposition from Georgians who know better,\nhow to control their access to medical services\nand reproductive choice.\nThank you very much.\nYeah.\nDo you get your question answered?\nI was just going to ask, what is the next\nitem you can find in the yesterday?\nWhat is the next item in this process?\nWell, what I would like is to, and I'll\nlet representatives and nullilates and LIM\nanswer us to the House.\nWhat I would like in the Senate is to,\nwe could have a hearing.\nThat's the first step is requesting a hearing.\nHowever, as stated previously, the best and most effective\nway to move the legislation is we'll look for other health care bills where this could\ncome through the process because under our rules there isn't time to have it move as a stand\nalone.\nBut we can move it as quickly as tomorrow on cross over day if Republicans want to join\nwith us in the state senate to reassure Georgians that they have access to family planning\ntools that have been the standard of care for decades and right and fundamental rights\nfor generations, they will hasten to do that tomorrow.\nI want to take you back to the roles that I know that in the hierarchy role, it references\nto persons that unborn children are persons, and I'm going to use that to get tax breaks.\nAnd I know that's kind of a gray area.\nI mean, could someone use that gray language to go to the notice screen, or what's like,\nwhat happened in Alabama?\nI think they absolutely could.\nDoes anyone else want to weigh in on that?\nI mean, that would be my perspective.\nI agree with what my colleagues said\nabout the merciness that exists,\nand it's on purpose, it's on purpose, right?\nMaking it confusing, making it sweeping,\nhaving conflicting clauses in there is all on purpose,\nbecause the true goal are the things\nthat we are raising up today to say be concerned about this.\nI will just echo that.\nYes, they absolutely could.\nWhile I, where I, the lawyer and the other side,\nwould make a variety of different arguments\nas to why they would be incorrect,\nthe problem starts in the fact\nthat you're creating that uncertainty at all.\nSo I think, again, even regardless,\nas important as the substantive right is\nand the binary that is this right protected or not,\nthe uncertainty is as much of the problem.\nThe fact that someone could even bring a case\nand not any of us in this room could 100% say\nthat claim would be denied,\nthat would be dismissed on a motion to dismiss\nsomething early in the process,\nand that would not cost the state,\nor whomever being sued the physician,\nthousands and thousands dollars in attorneys fees.\nThe fact that we can't answer that in this certainty,\nyes, now is the problem.\nI just wanna add that Georgians need to know\nthat OBGYNs are leaving states with restrictions.\nWe don't wanna practice this way.\nWe've taken oaths to take the best care of our patients\nto respect their autonomy and privacy.\nI was in that 481 room before it was passed\nand we warned that this would happen.\nNow we have data.\nOBGYNs don't want to practice this way.\nWe don't want to ask how sick enough is the patient\nfor us to intervene.\nWe want to do what we were trained to do.\nAnd we should be allowed to do that without this kind\nof interference.\nYou're here.\nYeah, and I'll just, and to what?\nThe doctor said, remember, we are already a state where more than half of our counties\ndo not have an OBGYN.\nAnd we are already a state with staggering, highly high maternal mortality rates.\nHave we tried to address that as a general assembly?\nYes, but we have not gone far enough.\nAnd the bottom line is if you are creating an environment where gynecologists are afraid,\nwhere obstetricians and gynecologists are afraid to practice their medicine in our\nstate that is harmful for women and we will never, never get rid of our very\nhigh maternal mortality rate and infant mortality rate if we are chasing doctors\nout of our state. We could take one more if anyone has any. You get everybody?\nI have any comment on what's happening in Alabama specifically the\nlegislation that they're putting out there is the idea of criminal and civil\nimmunity. Right, right. Yeah, that approach or any\ncomments. Well, I'll just quickly say that I have not read that legislation. So, but my impression\nis they are taking more of a tort reform approach, which then may give the doctors some certainty,\nwhich of course, as Dr. Zeman has testified just now, we know is a very important. But what I\nnotice is they are not friendly attacking. They do not want to have to say that a\nfrozen embryo is not a child. So they're trying what they can do to come up\nwith another way around it. And I think that's very telling. I have I'm aware\nof the legislation. I have not fully read it, but I will say the defense of\nsomething is not the same as protective affirmatively protecting a right. And\nand the defense will never be as good in addressing\nwhat rights exist and addressing any possible\ncertainty or uncertainty will never be as good\nas an affirmative statement as to the right.\nAnd again, this is why they're attacking it\nfrom a different angle.\nNo, we have not read the legislation,\nbut the fact that it's about an affirmative defense\nor a defense rather than an affirmative right\nis the problem.\nAnd meanwhile, women's lives are on the line, right?\nthe gears of justice, you know, regardless of whether\nyou have a defense in place,\nthe gears of justice grind slowly.\nAnd we know in Alabama right now,\nthere are women who had been going through the IVF process\nwho have now had to completely put that process on hold.\nNo regard from their general assembly,\nfrom their Supreme Court to what that means for their bodies.\nNo regard, I mean, physically for their bodies,\nwith the process of what they're having to do\nto prepare their wounds for that transfer, right?\nNo regard.\nSo, yeah, there can be litigation.\nAnd that litigation can ultimately result in those protections.\nBut meanwhile, women, real actual women are the ones who are going to pay the price potentially\nwith their lives.\nOh, thank you, everyone.\nThank you very much for your attendance, for shining a spotlight on these critical topics\nfor ladies of reproductive care.\nAppreciate you very much.\nMy head.\n",
  "updated_at": "2026-02-12T19:28:15.203957+00:00"
}