{
  "video_id": "fJt6AELQimI",
  "url": "https://www.youtube.com/watch?v=fJt6AELQimI",
  "title": "Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 50,
  "summary": "Here is a structured markdown summary of the Georgia Sen. McLaurin's Press Conference on Mario Guevara's ICE Detention | 7-22-2025 session:\n\n**Overview**\nThis press conference addressed the case of Mario Guevara, a journalist who has been detained by ICE for over a month despite having the charges against him dropped. The detention of a journalist exercising his First Amendment rights is seen as a troubling attack on press freedom.\n\n**Key Actions**\nNone detected\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Sen. Josh McLaren expressed concerns about the rapid expansion of ICE's budget and powers, which is creating fear in immigrant communities.\n- Jose Zamora from the Committee to Protect Journalists condemned Guevara's detention as retaliation for his journalism, making him the only journalist currently imprisoned in the U.S. for his reporting.\n- Lawyer Giovanni Diaz provided details on Guevara's case, including his legal status, the bond hearing, and efforts to secure his release.\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nNo adjournment details provided",
  "transcript": "Good morning everybody. My name is Senator Josh McLaren. I'm here today with a\ngroup of concerned journalists, activists, organizers about the case of Mario\nGuevara. Mario Guevara is a journalist who is being held in\nFolkston, Georgia, and ICE detention. We've been talking a lot about ICE\nrecently in this country. Trump just passed a budget bill that expanded ICE\nis funding by $75 billion, tripling its annual budget and making its annual budget larger\nthan that of the FBI and the federal prison system.\nICE is poised to become the largest domestic police force and most funded domestic police\nforce in the United States.\nAnd what this means for communities, particularly immigrant communities, is fear.\nhere that family or friends will be abducted, snatched up, disappeared, taken to remote\nfacilities, windowless rooms, with little contact in some cases with the outside world,\nwith no guarantee of due process and no accountability for, in some cases, the plain clothes officers\nwho come and abduct these folks off of our streets and our communities from businesses,\nfrom schools.\nMario Guevara is a journalist, and so his detention raises even bigger questions about civil\nrights, constitutional rights, the freedom of speech, the freedom of the press.\nAnd in this country, as we know with our tradition of the freedom of speech and press, it isn't\nabout whether you agree with someone's opinions, the substance of their reporting, it's about\ntheir right to collect information and disseminate that information, to communities who rely on\nto make deliberative and form decisions about their democracy.\nAnd Mario Guevara is a part of that esteemed\ncenturies-long tradition.\nIt's for that reason that we assemble here today\nin support of his due process.\nHis charges have been dropped in the jurisdictions\nwhere they were brought.\nHe has now been in ice detention for a month\nwithout recourse and without any guarantee\nthat his constitutional rights,\nrights, a legal resident of the United States will be protected.\nI'm honored now to invite one of several organizations here today, the organizations\nhere today include the ACLU of Georgia, the Georgia First Amendment Foundation, Asian\nAmericans Advancing Justice.\nBut this press conference is also sponsored by, brought to you by the Committee to Protect\nJournalists, a worldwide organization that has been at the forefront of protecting freedom\nof the press internationally.\ninternationally.\nIt's my honor to introduce from CPJ, the director of the Americas, Jose Zamora, who\ncan explain in a little more detail who you're going to hear from today and the type of message\nthat we're trying to get out.\nThank you, Jose.\nThank you.\nThank you, Senator McLaren.\nGood morning, everyone.\nMy name is Jose Zamora.\nI represent the Committee to Protect Journalists and Organization that promotes freedom of the\nthe press around the world and defense the right of journalists to report the news safely\nand without reprisal.\nIt is deeply troubling that we are here today in the United States holding a press conference\nabout an imprisoned journalist for doing his job.\nMario Guevara, a respected, Emmy award-winning reporter who has covered immigration issues\nfor over two decades was arrested while engaging\nin a constitutionally protected activity\nunder the First Amendment.\nThe charges were dropped, yet he remains detained by ICE.\nLet's be clear, Mario is being punished for his journalism.\nHe is now the only journalist in prison in the U.S.\nin direct retaliation for his reporting.\nSeamos claros, Mario está siendo castigado por su labor periodística.\nEs ahora el único periodista encarcelado en Estados Unidos\nen represalia directa por hacer su trabajo informativo.\nThis is a blatant attack on press freedom,\non the First Amendment, and on the right of communities,\nespecially immigrant communities, to be informed.\nThese communities rely on voices like Mario's\nto help make sense of the world around them.\nToday, we come together to express and announce these\nreviews.\nWe thank our partners, our speakers, and each one of you\nfor being here today, because defending press freedom\nanywhere, especially here at our home,\nis essential to defending democracy everywhere.\nMario should have never been arrested, he must be free and reunited with his family and\nhis community.\nTo begin, we will hear more about Mario's case from Giovanni Diaz, who is leading his\nlegal defense.\nThank you.\nGood morning.\nThank you all for being here.\nMy name is Giovanni Diaz, I'm one of the founding partners of the Law from Diaz and\nguide a law. My law partner Zachary Guietta is also here. We form kind of the\nspear of the legal team that's working hard to get Mario released. So just to\ngive you a little bit of background about Mario's case and I know you all have\nread a lot of articles and there's a lot of information out there and I'll\ntry to keep it as brief as possible. He was arrested on June 14th and because\nAlthough he's not a legal permanent resident, he is legally allowed to remain here in the\nUnited States and his authorization to work in a social security card and a driver's\nlicense, ice placed a hold on him.\nAnd unfortunately, nowadays, the administration has made it perfectly clear that anybody\nwho's not a legal permanent resident, at least, or a citizen, even if they've been given\ncertain protections, and they've been allowed to remain in the United States legally, and\nAnd the government has openly stated in court records that they're not looking to remove\nthat individual from the United States, ICE has decided that these people are targets\nas well, regardless of the crime they commit.\nSo even when minor traffic violations are anything that they're accused of, and just the\naccused of just being arrested is enough, ICE can place and didn't this case place an\nice hold on Mario.\nOnce the ice hold is placed, there's very little legally that you can do to remove an ice\nhold. And you just have to see how the jurisdictions play out. Now there's limits to the ice hold. Very\nquickly, we worked to get him a signature bomb. My law partner went to Magister Court a few times,\nand by the beginning of the week we were able to get him signature bonds. Those signature bonds\nwere signed and he was quickly taken to ice custody. It's very interesting the way he was\nwas routed to ICE custody.\nInstead of going directly to the 180 TED Turner office,\nthe main Atlanta field office,\nhe was escorted directly to the focus and detention center.\nObviously, a lot of people have been speculating\nas to why this is done.\nWe really don't know why.\nIt's unique.\nIt's unusual, but it was done.\nWe worked very quickly to contact,\nand we weren't the only ones.\nMany concerned members of the community, members\nof the media reached out to the Cab County.\nAnd I think the pressure the Cab County had,\nhow relentless Zach was,\nZach was in working with the Cab County\nand contacting them and visiting them.\nThey eventually decided to do the right thing.\nThe prosecutors decided to do the right thing\nand dismissed the charges.\nBut by that time, it was a bit late.\nBy that time, the ice hole was Haiti\nwho was already transferred to ICE custody.\nand we were already quickly working to prepare\nand file a bond motion.\nNow a bond motion is the first thing that one does\nin order to get somebody released.\nMario is clearly eligible for bond.\nMario has no criminal history in the United States.\nMario has been here for 20 plus years.\nMario is clearly eligible for adjustment of status\nthrough a petition filed from his immediate relative child.\nSo we were very, very confident with everything\nwe knew about Mario and the facts of the case\nthat we will get bond.\nOn July 1st, the bond hearing was set for July 4th.\nWe attended, his family attended.\nWe had a more contentious bond hearing\nthat we expected to have.\nBut the judge sided with us, and he granted Mario a bond,\na bond in the amount of 7,500.\nAnd in the immigration world, that's not too high of a bond.\nThat's kind of usual.\nThe bonds have incredible ranges, and there\nare so many factors that go into what the range or the amount\nof bond set by the judge.\nBut these judges have amazing and almost unfettered discretion\nin granting bond and whatever amount they see fit.\nBut we got the bond, family was happy,\nand we were about to go post it.\nSo up to that point, everything that we expected to happen\nhad happened.\nMario's family went to post the bond,\nand we began to see what things that we've seen before,\nwhich are sort of these obstructionist type tactics\nwhere maybe the bond posting didn't go through.\nThey cite administrative issues.\nWe tried to do it electronically.\nThe family tried to do it electronically.\nThe next step is going person.\nThey went in person.\nThey showed up in person, and they told them,\nwe're not going to accept the bond.\nI think the, I'm going to paraphrase\nwhat the ICE officer told my client's family,\nbut they stated that although a judge grants a bond,\nthey have the discretion to not allow it to be posted.\nInstead of explaining to the client that there was a stay\nthat had petitioned that had been filed with the BAA,\ninstead of explaining to them to what happened,\ninstead of correctly serving their attorneys,\nthat was a message that they gave.\nSo immediately that same day,\nour senior associate, Jessica Calms,\nwent straight up to the ICE office\nand told we need information.\nBy that time, they had already confirmed to us\nthat he was being transferred to Gwyneth.\nNow, for those of you that don't know,\nvery quickly after being detained from the cab,\nhe was hit with warrants from Gwyneth County.\nThis is unusual in that these warrants\nwere for traffic violations and incidences\nthat allegedly happened a month or more\nbefore the day the warrants were sworn out.\nThat in itself is very unique.\nThe timing of it is very concerning.\nThey hit on with these warrants\nafter he was detained by the cab.\nSo we had those warrants, so it isn't surprising,\nand we had prepared the family.\nThat because he had open warrants,\nthere was a possibility that Gwyneth would come\nand pick them up from his custody.\nWe've had cases in the past where clients win their cases,\nbut because they have open warrants,\nthose jurisdictions have the right\nand do pick up the individual.\nIt's sometimes they don't.\nBut in Mariel's case, they did.\nAnd they transferred him over to Gwyneth custody.\nOnce he got to go net custody, Zach, my law partner,\nand some of the other attorneys at my firm,\nwe worked pretty hard to reach out.\nThey weren't as responsive as the cab county\nto say the least, but luckily,\nI think with the pressure of the community\nand with Zach's pressure again,\nthose charges were ultimately dismissed.\nSo thankfully those were dismissed,\nand I think the statement from the prosecutors\nthat they couldn't prosecute that case,\njust to keep it as brief as possible.\nMario, we found out later through filings from the government that they did fall to stay.\nAnd they appealed the bond decision.\nNow appealing the bond decision isn't unusual.\nIce nowadays, all the discretion that attorneys generally have as prosecutors has been stripped\nfrom them and they basically aren't even allowed to agree with us of what they have the\nweek it is.\nSo what they do is they filed the appeal, again, we were prepared for that, but we didn't\nthink they'd filed a stay.\nThe stay was a surprise, and I think the stay was a very firm reminder and a confirmation\nto us that they wanted to treat Mario very differently than other detained individuals.\nSo we've responded, we've filed a motion to lift the stay.\nWe've obviously filed a response, a motion for summary of\nFirmance, and we're asking the Board of Immigration Appeals to do the right thing.\nWe're asking them to lift the stay, and we're confident.\nBased on the fact that the law is very much on our side, that we will ultimately get the\nstay lifted, and that we will ultimately win the appeal.\njust a brief, you know, lesson on the law.\nThe Board of Immigration Appeals traditionally\nhas given immigration judges a ton of discretion.\nI don't want to say unfettered,\nbut a lot of discretion in making bond decisions.\nAnd most decisions from the Board of Immigration Appeals\non bond, specifically on the issue of bond, are affirmed.\nSo we're confident, based on the overwhelming evidence\nthat favors my client, that Mario will be allowed\nto post this bond once we prevail\nat the Board of Immigration Appeals.\nWe've also consulted with partners,\nwe've consulted with the other attorneys in my office,\nand if the decision goes anywhere else,\nwe feel that the government is acting in bad faith\nand we will pursue litigation.\nThank you.\nWe'll go.\nThanks.\nNext, we'd like Mario's daughter to speak, Catherine.\nThank you so much for being here today and thank you for giving me a few minutes to speak.\nMy name is Katherine and I'm Mario Guevara's daughter.\nI'm here today as a daughter, yes, but also as someone who watched her dad spend his life\ntrying to help others.\nMy father is a reporter.\nHe chased stories that mattered,\nstories that told the truth about immigration,\nabout injustice, about people who usually go ignored.\nHe's always believed that journalism was a form of service.\nHe didn't do it for recognition.\nFor more than 20 years, I have witnessed\nhis unwavering dedication and selfless commitment\nto serving the Hispanic community.\nA lot of people he helped were just trying to survive\nin this country.\nHe not only informed the community,\nbut also gave them vital connections and a sense of hope.\nThat's the kind of journalist that he is,\nand that's the kind of person that he is.\nSince he's been detained,\nour family has felt an emptiness\nthat we cannot begin to fill.\nMy mom is exhausted.\nMy brothers and I feel like we're stuck in a nightmare.\nThis process has been extremely complicated and difficult every step of the way.\nWe don't know what to tell people when they ask where he is.\nWe don't know how to explain how something like this could happen.\nHow is this even possible?\nThere are many fears tied to the uncertainty of what lies ahead for my dad, but more\nthan fear I feel anger, because this should not be happening.\nMy dad did nothing wrong.\nHe was arrested while wearing a press badge.\nHe was live streaming.\nHe wasn't in the way.\nHe wasn't breaking any law.\nHe was doing his job.\nAnd now, with every day that passes, we're losing time we'll never get back.\nThe pain we feel is indescribable, though I know so many others in the same situation understand\nthey understand it all too well.\nI'm deeply disappointed with this country.\nThis is not just about one journalist.\nThis is about what kind of country we want to be.\nIf a government can punish a reporter for doing his job, what message does that send?\nprotections are left for the rest of us. To those listening, please don't let\nthis be forgotten. Don't let my dad become another name on the list. He's more\nthan that. He's the most hardworking man that I know.\nA man whose dedication and sacrifices have shaped not only my life, but the lives of everyone\naround him.\nHe belongs home with us, and we won't stop fighting until he is.\nThank you.\nGood morning, thank you for being here.\nMy name is Oscar and I'm Mario Guevara's son.\nI'm here today because my dad can't be you.\nI'm here because the person who has always been the strongest in our family, the one we\nlook to for answers, for calm, for strength, is not the one locked in a detention center.\nMy father is a journalist, but to me he's just my dad.\nHe's the guy who drove me to school, worked long hours, and still found time to ask how\nI was doing.\nHe's the one who made sacrifices most people never saw.\nHe worked evenings and weekends.\nHe missed holidays, sometimes to cover stories.\nBut he didn't because he believed that his work made a difference.\nWhen I was 17, I had to have brain surgery.\nMy dad was there by my side and would turn me up when I was feeling down.\nAs part of my recovery, he put a camera in my hands and helped me become a young photo\njournalist.\nHe has always known how to bring a smile to my face.\nGrowing up, I didn't always understand why my dad was so obsessed with his work.\nOr why'd he jump up and leave dinner to chase down the story.\nBut now I do.\nHe was trying to tell the truth.\nHe was trying to protect people, especially those without a voice.\nHis work wasn't just a job, it was a calling.\nAnd now he's being punished for answering that call.\nSince he's been locked up, we haven't been okay.\nMy family feels like we're living in limbo.\nAnd that has been a legal resident of the US for more than 20 years.\nHe pays taxes, he's followed the law, he raised a family here, and yet, despite having\nno charges against him, he's sitting in a cell as if he's a threat, all because he was\ndoing his job.\nWe were raised to believe that in this country, freedom of speech mattered, that journalism\nmattered. The hard work and honesty meant something, but none of that seems to matter right\nnow. I want to say to those in power, you are not just locking up a journalist. You are\nlocking up a father, a husband, a man who spent his life giving back. And we are here,\nfamily trying to make you see him. My sister and I could go on, could go on. These short remarks don't\nmy father justice, please let him go, let him go home.\nThank you.\nHello, everyone. Thank you so much for coming. You know, we're about 20 minutes in and you're\nall still here. So that's wonderful. I'm Nora Benavides and I, you know, I thought a lot\nabout how I was going to come here today, whether it's through my role with the Georgia\nFirst Amendment Foundation, where we protect open government and free speech in Georgia.\nI thought a little bit about coming here given my role with Free Press, which is a national\nnonprofit where we fight for free, equitable, and open connection online and offline.\nI thought about coming here as a Latina,\nwho has been deeply personally appalled by the indignity\nand the dehumanization over the last several months\nof people who look like me.\nOr, honestly, as a civil rights attorney,\nwho has known Mario Guevara for many years.\nI've appreciated his presence, shall we say,\nunique coverage at times in the community.\nBut the issues that bring me, and I believe,\nall of us here today in support of Mario Guevara,\nreally are us coming together in our most fundamental capacity,\ntroubled by where we are headed,\nand the way that Mario Guevara's case\nfeels emblematic of the disturbing path\nthat the United States is on.\nMario Guevara is not a threat to our society,\nas the government would have us believe,\njust like others throughout the country\nthat are being targeted for their speech\nand for their conduct,\nlike students from Columbia or Georgetown or Tufts,\nsome of whom, like Mahmoud Khalil,\nwere detained for over three months\nfor exercising their free speech rights,\ncondemning what is happening in Gaza.\nThese students were never threats to our society.\nJust like Lauren Tamasi, the journalist who was hit\nwith rubber bullets while she was covering protests\nin Los Angeles and other journalists\nthat were attacked with tear gas in Los Angeles,\njust for doing their job.\njust for exposing the facts, laying witness to dissent\nagainst an increasingly authoritarian administration.\nAgain, these journalists were never a threat\nto our society, and in fact, each of these examples\nshow us people exposing a narrative\nthat those in power do not want exposed.\nNone of these instances present a threat\nto the United States.\nThere are examples of the very reason\nwe have a First Amendment and a Constitution at all.\nBut if people like Mario Guevara are somehow cast as dangerous,\nI think that says more about the kind of nation\nwe are becoming than it does about who Mr. Guevara is.\nIt says that this country is turning its back\non core American principles.\nPrinciples are founders believed essential\nto prevent consolidation and abuse of power by a small few.\nThose founding fathers knew that freedom of the press\nare freedom to speak, listen, think, and assemble\nwould be essential bulwarks against overreach\nof government power.\nSo if the exercise of those rights is now penalized,\nlike it is with Mario Cuvara, simply\nbecause those empowered dislike the message or the messenger,\nthat means that our basic freedoms are not free.\nThey have become privileges, doled out for good behavior\nif those in power allow it.\nI feel like we're in this really weird moment,\nyou know, I think about what John Lewis would think\nif he were here with us,\nbecause I'm sure that he would be standing behind us.\nI think about this being the birthplace\nof Martin Luther King, Jr.,\nof the civil rights movement, no less,\na movement that clung to and succeeded in part\nbecause of people's expression in protest rights.\nSo let's be clear today,\nbecause it is an honor that you were all here.\nThank you to Senator McLaren for hosting this.\nWe are here today in diversity, politics,\nidentity, creed, belief, because we are calling\nfor the immediate release of Mario Guevara.\nHe has no criminal charges against him.\nHe's in this country legally.\nHe was arrested while doing a constitutionally\nprotected activity.\nBut that is one that the Trump administration dislikes.\nAnd this is the environment that the administration\nhas created.\nTrump himself has disallowed journalists\nfrom the White House when he dislikes their coverage.\nCongress has gutted millions and millions and millions\nof dollars for public media just last week,\nand instead is giving over $170 billion\nto law enforcement and border police.\nAnd even in our corporate media realm,\ncompanies like CBS are discontinuing programming\nlike the Stephen Colbert show,\nbecause he spoke critically of the way\nthat CBS capitulated to Donald Trump.\nWe're living in a climate of fear and retribution.\nAnd it is a step of courage, it is a sign of courage,\nwhen Mario Cuvara's children come forward,\nrisking themselves, their own safety,\nto describe what they have lived through.\nOur community ties are weakening.\nTruth is undermined as the bedrock of our democracy.\nAnd I believe that Mr. Cuvara's case\nis really just the tip of this fear.\nSo when pushing back today,\nwe are not just calling for Mr. Cuvara's immediate release.\nBecause the very circumstances under which we are here,\nmore than 38 days into his disturbing detention,\nthese are daily reminders of the ways\nthat other people may think twice\nabout filming the police.\nThey may think twice about protesting,\nand any one of you covering this today\nmight even think twice about reporting on ice.\nAnd that is the point.\nMario Gavara's detention sends a chilling message\nto anyone who might want to exercise their rights.\nAnd it is a rejection of the very premise\ncountry was founded on, to give people agency, dignity, autonomy and freedom to challenge\nthose in power. I look at the pattern, you know, of what is happening, people who are\ntargeted for their speech, then detained for their speech, and I worry that Mr. Guevara\nmay not be the last journalist that we see targeted like this. And so I think it makes\nit all the more important, probably essential, that all of us, everyday people, journalists,\nlawyers, lawmakers standing behind us,\nand other leaders stand up for something better.\nThis is beyond politics, it's beyond time period,\nit's beyond Atlanta, and if it's Mario Guevara's\ndetention today, it may be one of ours tomorrow.\nSo thank you all so much for giving coverage and airtime\nto this critical case and this critical issue.\nI'm now honored to introduce my colleague\nfrom the ACLU of Georgia, Andrés Lopez Delgado.\nThank you.\nMorning, everyone.\nMy name is Andres Lopez Delgado.\nAnd I'm a senior staff attorney at the ACLU of Georgia\nand the son of Puerto Rican migrants.\nI want to begin by thanking Senator McLaren,\nfree press, the committee to protect journalists,\nthe Georgia First Amendment Foundation,\nMario's legal team, and Mario's family\nfor the opportunity to speak today.\nThe ACLU of Georgia is an organization\nthat champions the right of all Georgians\nto exercise their constitutional rights.\nThose rights include the right to free speech,\nwhich is guaranteed under both the federal constitution\nand the constitution of the state of Georgia.\nWe have a long history of standing up for free speech even when that speech is unpopular\nand especially when it results in government retaliation.\nSo I want to take the opportunity today to reaffirm some basic principles of free speech\nbecause it feels like we're living in a time and in a place where those rights and principles\nvery much need affirming.\nFirst and foremost, I want to say that the protections of the First Amendment extend to everyone\nregardless of citizenship status.\nAnd those rights include the right to gather and publish information about government\nactivity, the right to record public officials doing their jobs in public places, the right\nto criticize government action and to dissent from government action.\nAnd the First Amendment safeguards us from government retaliation for engaging in protected\nfree speech and speech-related activities.\nFor the reasons described eloquently by the other speakers here today, which I will not\nrepeat in the interests of being brief, the ACLU of Georgia is deeply concerned about\nMadios case and what it means about where we're headed as a state and as a country.\nshould not have to be concerned that they will face deportation or other retaliation when\nthey are just trying to do their jobs reporting on matters of grave and deep public concern.\nGeorgians rely on a free press to know what is happening in our communities. We need to\nknow that journalists are protected when they are working to bring the public critical\ninformation and that nobody will be punished for shedding light on government action.\nThe ACLU of Georgia condemns this attack on the First Amendment and is committed to\nprotecting freedom of speech and freedom of the press in the state of Georgia.\nThank you.\nGood morning.\nMy name is Catherine Jacobson and I lead the US program at the Committee to Protect Journalists.\nI want to begin by acknowledging something that might seem obvious, but bears repeating.\nIt is deeply unsettling that we are gathered here today holding a press conference about\nthe ongoing imprisonment of a journalist in the United States, Mario Guevara.\nBut these are not normal times.\nI represent CPJ, a global nonprofit that depends, press freedom, and the rights of journalists\nworldwide.\nSince 1992, we have tracked case-by-case every journalist killed and imprisoned in retaliation\nfor their work around the world.\nFor most of that time, the United States was rarely mentioned.\nIt was the exception, not the rule, a country where, despite its flaws, journalists could\ngenerally do their jobs without fear of government reprisal.\nThis is no longer the case.\nWe've seen a steady rise in domestic threats to press freedom, legal harassment, physical\nattacks, relentless online abuse, and now Guvara's case stands as one of the clearest\nexamples of that erosion.\nMario Guevara remains the only journalist in the US\nwho was in prison following an arrest related\nto his reporting.\nIt bears repeating and thinking on that.\nYou've already heard the specifics from his family,\nhis attorney from lawyers and civil society organizations,\nand yes, the back and forth between jails,\nthe dismissed charges, the misdemeanors,\nthe ice custody, it can sound complicated,\nbut let us be clear.\nThe principles at the core of this case are straightforward.\nQuavaro was engaging and protected first amendment activity\nat the time of his arrest.\nHe had been legally in the United States for two decades,\nand now he has been behind bars for 38 days.\nThe initial charges against him, all misdemeanors,\nwere dropped.\nHe should be free.\nInstead, the government has argued that Quavaro\nwas a danger to society and should be denied bond\nbecause of his supporting activity, including live streaming,\nwhich I assume some of you are doing here today.\nThis line of reasoning, therefore,\nshould be caused for alarm.\nGuvara, like so many other reporters,\nhad regularly used live streaming as a way\nto tell the story of what was happening in his community.\nHis work covered everything, from daily issues\nto life altering immigration raids,\nand informed hundreds of thousands of people\nwho have subscribed to his programming\nacross social media platforms.\nHis absence has left a painful silence and coverage\nand for his family, and comes at a time when risks facing journalists in the United States\ncontinue to build.\nWhile we gathered here today in the Georgia State House, this case has resonance far beyond\nthe state capital.\nGuvara's ongoing detention sends a clear, chilling message to reporters, especially those\nin this country who are not U.S. citizens, that they too could very well find themselves\nat risk in the same way Mario has.\nthat can happen to Guevara, a respected journalist,\nagain, who legally resides here and has been\nfor the past 20 years, who could be next.\nIs vital that Guevara be released without delay?\nThank you.\nThat concludes our formal program.\nI just want to thank the committee\nto protect journalists and all the groups that are represented\nhere today along with my colleagues from the House\nand the Senate who have shown support political will\nat the state level to protect against this type of abuse\nin the future.\nAt this time, we will be open to any questions\nfrom the media.\nWell, I mean, we've been in contact with him often\nbetween me, my law partner, and his family.\nAnd he's doing well.\nFor those of you that know Mario and most of you do,\nyou know that he's an incredibly positive person.\nHe leans on his faith and his family,\nand he continues to do that well in detention.\nBut I think there's certain things that have been shaken\nto his core.\nHe's been shaken to his core because a country that\nhe continues to love, a country that he continues to believe\nin the institutions.\nHe's having a crisis of conscience, I guess.\nHe's dealing with that.\nAnd also, he's by himself.\nAnd for another long list of things\nthat are suspicious and concerning in this case,\nis that he's being detained essentially in isolation.\nNow, the reason that ICE has cited to us\nand to anybody else has asked is for safety.\nHe is a public figure.\nAs we all know, there were elements about his personality that were controversial, his\nstyle was controversial.\nSo I mean, there is a little bit of, it's plausible that that's the reason why they're doing it,\nbut they're doing it just about everywhere he goes, except one instance where they didn't\nand they put him in population.\nAnd that wears on you.\nThat wears on any individual.\non the actions from the government, from the beginning, the first statement that they\nmade where they lied about my client's immigration history and they continue to lie even\nin pleading that they filed to the Board of Immigration Appeals.\nIt's an easy assumption to make that they're doing this not only to protect him, but to\nalso retaliate against him and wear him down.\nHe's had multiple conversations with ICE officers,\nand they feel the need to remind him of multiple occasions\nthat he's going to be there for a while if he fights his case.\nSo I've argued asylum cases for 13 years.\nPeople who've been persecuted in their countries,\nthis is evidence of persecution, plain and simple.\nBut with all that said, he is still smiling.\nHe's in good spirits.\nAnd he's in it for the fight.\nAnd so are we.\nWell, there are several questions from these questions.\nPardon?\nThe question, which are the next steps?\nI think the next steps are, at the moment, we have two things pending in the short\nde la pelación. Tenemos el procedimiento de fianza y tenemos el procedimiento de su\nenaféo, verdad, el caso de deportación, el caso de la corte de inmigración, que se\ncerró en 2012, a mí que todavía está cerrado administrativamente, pero el gobierno\nya presentó una petición para reabrillo. Nosotros ya presentamos una petición que\nlo que queremos es que queremos que trasladen ese caso de la corte de la pelación de nuevo\nto the court to appeal its residence, because it is clearly qualified for the residence.\nThey are putting up a document that they are not in agreement with that, although\nit is simple and clearly the law, the law is with us, so for the moment, I think\nthe part that we are waiting for us, that we are waiting for the family, is that we have\nto give to the court of appeal that fortunately the opportunity to decide, we ask\nbecause they raise that state, that congelation,\nthe order of the West's finance.\nWe also ask that they determine or that they close\nor that they close completely the case of the Appalachian\nand that they give the opportunity to pay that finance\nthat they want.\nSo, for a moment, I think we have to give\nthe Appalachian court the opportunity to do the right thing.\nBut we are collecting evidence.\nIt is clear from the beginning of the case that the government has behaved in a fair way.\nThe beginning has increased and it does not matter to you to speak of the truth,\nnor to reveal the evidence of my own client.\nWhat surprised me is that the part that surprised me is that they are lawyers who I know,\nright?\nfiscals that I know for many years and the truth does not matter, they have decided\nthat they are going to put and they are going to put in a way to complicate the process.\nThe good thing is that there is a repeat, I think the law is with us, it is with Mario,\nMario clearly caliphates the finance that they gave him, Mario clearly caliphates\nthe residence and we are going to achieve that, unfortunately they are playing dirty and that\nis reality.\nLa otra cosa que tenemos ya preparado el listo por si acaso es la\nposibilidad de una demanda en la corte federal pero cada caso es único y lo que\ntenemos que testar seguro es que el caso está listo para eso porque no queremos\npresentar algo que que bien rápido pierde ok o desestiminan porque no le\nhemos dado a la corte de apelación la oportunidad de tomar esa decisión.\nYeah, so the original question I think was, how's Mario doing?\nMario's doing well.\nThe interesting thing about Mario, and I don't know if I said this in English, okay,\nlo quieres en español?\nLa primera parte, okay, Mario está bien, los que conocen a Mario saben que Mario se mantiene\npositive, constantly. It is a person of faith. He has his family that supports him a lot.\nAnd yes, he is maintaining positive with the same smile, the same person we know.\nBut yes, this is causing a trauma. This worries him, a country he loves and wants a lot.\nHe does not know how to feel. He is having a conflict with his conscience.\nAnd I think that any person who suffers from this kind of tension,\nfor so long, will suffer that.\nBut in general, all the conversations that we have with him,\nhe has declared to us and he says that he is ready for the fight\nand wants to keep fighting because he knows that he deserves what we are going to win.\nSo, fortunately, there is no any lawyer who has been estimating you for a long time.\nWhat we have in our favour is the finances, the relations of the finances,\nthey decide a little bit faster and when there is a ST,\nit's really that ampero, that congelation of the order in the West,\nthose appellations they decide a little bit faster.\nThe good thing is that we have already presented the petition\nto decide everything, and the short appellation sent us\nthe last legal written order.\nBut that, for me, shows that I think the short appellation\nand want to take a decision.\nThe problem is impossible to see the amount of time.\nThe amount of time is something that we will also analyze,\ntrue, in the future decision to present a federal demand.\nBut we have to give the short of the evaluation\nthe opportunity to take that decision.\nI have a question.\nYes.\nmm-hmm.\nIf they are violating the rights of Mario,\nmandating it to Foxton, they are violating the rights of thousands and thousands and thousands and thousands of immigrants who are detained in Foxton.\nFoxton is one of the main detention centers of immigration in the state of Georgia.\nWe have two of them.\nAlmost all people who have detained with immigration are going to Atlanta and then to Foxton and to Stewart.\nThis is not new.\nthese are very normal, all of our clients and all of our clients are the majority, not all,\nbecause now with the amount of people who are more than 60,000 people in the United States\nthey are looking for alternatives, right? We know that Mario sent it to Floyd County,\nthey sent it to the federal prison here in the center, where they extorted it.\nOk, and we had to communicate, and I had to communicate with one of them in charge of ICE, one of the lawyers and within a day I translated it again to a place that at least it felt a little more safe.\nOk, but yes, I think that is something that we have fought for years, right? Why send immigrants to these detention centers?\nAs you are a folks that this is a decision of the government and every time we ask\nyou why they send someone to these places because they are some because they are\ndetention centers of immigration and second they never give us reason they say that\nit is for space right and it is a decision logistics of the government the good thing\nthat if they give us access they give the family the ability of the lawyers to visit it we\nWe have talked about it with the poor video.\nWe have visited the family several times.\nThat's why the access to this experience of Mario,\nit is the experience that has had millions and millions and millions of immigrants\nthat have been detained by ICE.\nBut it is very common that he is detained in FOXTON\nbecause most of the people who are detained in this region\nyehana fokstin oyehana stewardet.\n¿Cristia es en el sentido de cienchro de interintedición\nhablar aproximadamente?\nNo.\nYo lo hago por video.\nY las razones con los sucios que ha jugado\nel gobierno hasta ahora, OK?\nNo hay ninguna garantía que si yo llego a ese edificio,\ncomo los representantes, como otras personas,\nverdad, que los van a dejar en trállito.\nMuchos años atrás, no tantos años atrás,\nganamos un grupo de abogados, ganaron una demanda,\nthe demand that we were making was to visit VTC for video,\nconfidential, and the reason is for the access to lawyers,\nbecause the federal court decided that they were not receiving the access,\nthey were not receiving access to lawyers,\nbecause it was very difficult to travel every day,\nsix hours to a center of attention in Foxten,\nthat we have access to these visits for video and that they are confidential because it was part of the agreement in the federal demand.\nWe can talk to the clients and it is a much more efficient process and we can talk to them more than one hour each visit we have.\nYeah, Zach, I think this week is going to file a motion to recover the cell phone because\nZach has basically been in contact with just about everybody who knows in the Sheriff's\nDepartment and also at the prosecutor's office and everybody saying we don't see a warrant\nin the system.\nSo one of two things happened.\nSome other agency that hasn't contacted us took it, US attorneys, I somebody else has\nit, or the phone was just playing stolen.\nSo we are in the process of trying to figure out exactly what happened to this phone.\nI think it's par for the course considering the government's conduct from the beginning\nof this case.\nBut we're doing this, at least initially, to see if we can get the phone back.\nBut again, if they don't give them the phone back, that's another reason to file a lawsuit\nin federal court.\nWe'd be suing ice, but, you know, there's a possibility of adding other defendants to it,\nmaybe the counties that detained him.\nThere's a lot of evidence of, you know, circumstantial evidence of all the things that have happened to him,\nlying about him from the beginning,\nnot sending him through the normal route\nof routing him through the Atlanta field office,\nescorting him directly to his detention centers,\nsending him to the federal prison\nwhere he was essentially extorted,\nand we had to transform him out.\nThe fact that in the pleadings,\nthey also continue to misstate the facts of my client's case,\nthe fact that they file a stay for someone\nwho clearly has no criminal history,\nand that's the first time we've ever seen that,\nespecially discretional state like this,\nthere's mounting evidence.\nThe problem is the government will always,\nthey have plausible deniability and say,\nhey, the things that we've done up to this point\nwere allowed to do.\nSo really the big legal question is,\nwhen is this case right to file the federal lawsuit?\nWe have partners that we're working with\nbecause we wanna make sure that it's right.\nThe middle district is not like every other district\nin the country, we're not talking about California Seattle.\nSo we need to be very, very careful and cautious\nabout how we draft this.\nAnd also, we do feel that we're going\nto prevail the Board of Immigration Appeals.\nAnd once he's released, it's going\nto be a little bit easier for us to prepare the next level\non this fight against these entities.\nThanks, Lee.\nOut of respect for everyone's time,\nwe're going to be available for some one-on-one interviews\nafterwards if there are further questions.\nI really want to thank all the press for being here today.\nI want to thank everybody who has assembled\nin support of Mario Gabara.\nThis is an important case,\nand we need to keep visibility up\nto protect our constitutional rights.\nThank you very much.\nThank you.\nThank you.\n",
  "updated_at": "2026-02-12T18:46:26.107563+00:00"
}