{
  "video_id": "foz1_B8PvUg",
  "url": "https://youtu.be/foz1_B8PvUg",
  "title": "Georgia House - Day 11 (2026-02-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": "2026-02-04",
  "duration_minutes": 67,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**:\nThe session focused on a prayer and scripture reading by the chaplain, Dr. Aaron Minnecoff, who reflected on the futility of human work and the importance of the gospel message of salvation through Jesus Christ.\n\n**Key Actions**: \nNo specific bills or legislative actions were detected in the transcript.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- The chaplain, Dr. Minnecoff, gave a thought-provoking sermon reflecting on the temporary nature of human accomplishments and the need for salvation through Jesus Christ.\n- Dr. Minnecoff shared personal anecdotes about his time working as a legislative aide and the sting of disappointment in politics and life.\n\n**Votes**:\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**:\nThe speaker called for all members to be present on the floor, indicating a quorum was expected.\n\n**Adjournment**:\nThe transcript does not include details on the adjournment or the next scheduled session.",
  "transcript": "The hour of convening, having arrived, all members of the house will please report to\nthe floor and take seats.\nAll members of this house will report to the floor and take your seats.\nMembers should flee from the anti-room and make their way onto the floor.\nMr. Clark, would you ring the bill?\nWe are going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nall members voted have all members voted if so the clerk will lock the machines door\nkeepers will please close the doors and keep them closed well good morning we are now\nNow in the beginning of the second quarter of the session, I don't know who's ahead,\nbut it's clicking along here.\nWe will begin our day today with scripture reading and prayer by the chaplain after which\nwe will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 52nd House District,\nthe Chair of the Mar-Talk Committee, Chairman Silcox.\nChairman Silcox.\nThank you, Mr. Speaker, and good morning.\nI'm delighted this morning to bring to you all\nthe Senior Pastor from Mount Vernon Baptist Church\nin Sanny Springs, Dr. Aaron Minnecoff.\nDr. Minnecoff came to Mount Vernon in June of 2008\nafter completing his Masters of Dvenity,\nin biblical and theological studies,\nas well as his PhD in American Church history\nfrom Southern seminary.\nPrior to pastoral ministry, Aaron worked as a legislative\nassistant to the late US Senator Mark O. Hatfield.\nAfter leaving his career in politics,\nhe went on staff and served as an elder\nat Capitol Hill Baptist Church in Washington, D.C.\nWhile in seminary, Aaron served as an elder and interim pastor\nat 3rd Avenue Baptist Church.\nAaron is the organizer and host of Feed My Sheet\nand annual conference for pastors and church leaders\nin the Atlanta area.\nHe also serves as the administrative team\nof the Greater Atlanta Baptist Network,\nwhere he leads a monthly pastors fellowship.\nIn addition to his pastoral ministry,\nAaron is a visiting lecturer at Reform Theological\nSeminary in here in Atlanta,\nand the author of Politics and Piety,\nBaptist Social Reform in America.\n1770 to 1860.\nWe are also joined this morning by his daughter Natalie,\nas well as his interns.\nAnd so please, we're delighted to hear from Dr. Minikoff.\nThank you, Speaker and Chairman.\nIt's so good to be here this morning.\nI've had the same key chain for 25 years.\nIt's a seal of the United States Senate\nwhere I did serve as a legislative assistant\nfor the late Mark Hatfield of Oregon.\nI enjoyed my job and I enjoyed being in politics.\nI felt like I was at the center of something big and important.\nAnd sometimes when I hold that seal,\nI think about the bill that I worked on,\nseemingly night and day, S-88,\nthe local Empowerment and Flexibility Act.\nIt gave local governments a little more control over federal funds.\nIt never became a law, and I'm not here to lie before it this morning.\nThe senator must have known I'd be a little disappointed after the bill died because he\ncame to my desk to comfort me.\nThe chairman of the Senate Appropriations Committee, comforting me, a young staffer.\nHe knew I probably felt like I wasted a whole year of my life that I failed.\nOur work often seems futile.\nMore than one of you have lost a campaign.\nAll that time talking to voters, sharing ideas, raising money, only to fall a few votes\nshort.\nThere are bills that you've tried to pass, only to be blocked, or bills that you've tried\nto block only to be unsuccessful.\nYou have felt the sting of disappointment and it's not just politics, it's all of work.\nThe plumber whose two-hour job takes all day.\nThe lawyer slapped down by a judge's verdict.\nThe single mom working two jobs who misses her daughter's basketball game again.\nAnd it's not just work that seems futile, it's life.\nI recently attended Friendship Baptist\nfor the funeral of Matthew Francis,\nthe son of my dear friend Wallace Francis,\none of the best receivers the Falcons ever had.\nAnd a faithful Christian.\nWallace and Cheryl were good parents,\nare good parents, but tragedy struck.\nAnd I think there's nothing worse,\nnothing that feels more futile than bearing your adult child.\nListen to the opening words from Ecclesiastes, vanity of vanities, all is vanity.\nWhat is man gained by all the toil at which he toils under the sun?\nA generation goes and a generation comes, but the earth remains forever.\nThis legislative session will come to an end.\nmakes them important decisions. Some of you will be in the news. Some of you then will retire.\nSome won't be reelected. Someone else will eventually sit in your chair. You'll wonder what you did.\nYour legacy will probably seem to you small. The same is true for me. I preach weekend and\nweek out I do my best to teach and shepherd a local church. I work hard and\nsomeday someone else will stand in my place and I'll be a footnote on the church\nhistory page at Mount Vernon's website if they have a church history page and\nthey probably won't. A generation goes and a generation comes life can\nseem futile to all of us. Well I stand before you as a Christian minister but\nBut even secular scholars agree that the life and ministry of Jesus Christ appeared futile\ntoo.\nJesus didn't have a good relationship with his brothers.\nThey wanted more from him.\nJesus never wrote a book or founded a nonprofit, and he had, at the time of his death, only\na few followers.\nAfter his arrest, Jesus did not muster up his own defense.\nHe remained silent while they cooked up charges against him.\nIn his final hours, those he loved the most turned their back on him while he walked\nto Calvary, bloodied and bruised by leather whips and hammered to a Roman cross.\nHanging there, Jesus knew that his life looked like a failure in the eyes of the world.\nHe knew his whole ministry appeared futile, and perhaps the words of Ecclesiastes crossed\nhis mind.\nA generation goes and a generation comes.\nlooked like an end turned into a beginning,\nJesus upended failure.\nThe cross was no accident, no unfortunate turn of events\nand no surprise to God the Father.\nThere's nothing futile about Jesus' work, about the cross.\nAs sure as your work, at least for this 40 days,\nis legislating, and my work is pastoring,\nAs Big Bethel AME tells us, Jesus' work is saving.\nJesus saves.\nThat's His work, and He does it perfectly.\nThe Bible teaches that you and I are rebels\nagainst a holy God, that we were born that way.\nEach of us comes out of the womb\ncaring more about ourselves than others,\nliving life for our own glory,\nand making decisions that are opposed\nto his standards.\nAnd the Bible has a word for that.\nAnd it's not a fashionable word to say in our day.\nThe word is sin.\nIt's from the Greek that means to miss the mark.\nWe all miss the mark.\nGod's mark.\nAnd missing the mark isn't a small matter in God's eye.\nIt's a big deal because God is holy.\nOur sin against Him is therefore infinitely terrible.\nAnd because of our sin, we deserve death and eternal punishment.\nOur work won't save us.\nYour good laws won't save you and my so-so preaching won't save me.\nJesus saves.\nYou need the work of Jesus Christ.\nYou need Christ to suffer in your place, to bear the punishment.\ndeserve for your rebellion against our holy God. Jesus died for sinners like you\nand like me. He rose from the dead to prove it. And this is the gospel that's\nbeen preached for two thousand years. No gospel, no Christianity, no gospel, no\nhope. Occasionally when I rub that key chain in my pocket I recall how I once\nsomeone saw myself at the center of something big and important, and if I'm honest, sometimes\nwhen I'm talking and people are listening, I'm kind of tempted to think I'm kind of\na big deal.\nAnd then I see the cross, and I remember Jesus says, and I realize a fresh that I am nothing\nbut a miserable center who deserves hell, and he is everything.\nThe Lord of the universe who took on flesh and walked through dirt and went to a cross\nfor individuals who frankly make a mess of the world every day, he is amazing.\nAnd I pray, Son, I'm an Aaron boy, he's the boss.\nSo I pray that the Christians in your life are the humblest people that you know.\nI pray if you're a Christian, the people around you would know you to be extraordinarily humble.\nIt doesn't mean you give in on your convictions not at all, but it does mean that you are marked\nby something of the humility that can only come from recognizing that your God is big\nand important and you are not.\nAnd when your work seems futile, or when you think you're a big deal, or when you feel\ncrushed by the sin in your own heart, I pray that you would run to that cross and remember\nJesus says, His work is never futile and is always perfect.\nWould you stand as we pray?\nWhen they father you are Creator and Redeemer, the giver of every good thing, including\ndeliberative bodies like this one.\nGive these legislators wisdom to manage the affairs of this great state.\nMay they see you and your work as bigger and even more important than anything.\nAnd may they trust in you, in Jesus' name.\nAmen.\nLet's pledge allegiance to the flag of the United States of America and to the Republic\nfor which it stands one nation under God, indivisible with liberty and true straw.\nDoorkeepers will unlock the doors.\nYou\nYou\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nThank you Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct.\nChairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal? The chair here is not and the journal is confirmed.\nForkory, the resolution establishing the order of business for the day.\nMr. Burns, on a 59th booth's final, we establishes the order of business during the first\npart of the period unanimous consent, introduction of bills and resolutions, first reading and\nreference of house bills and resolutions, second reading of bills and resolutions, report\nof standing committees, first reading and reference of senate bills and resolutions, morning\norders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day?\nThe chair here is none and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse bill 871 by Rep. Holmes, the 129th Bill being titled next to create the Jasper County\nPublic Facilities Authority, the Answer Governmental Coordination, House bill 872 by Rep.\nAnd now the 77th, the 75th Scott of the 76th,\nStomall of the 74th in Scofield of the 60th.\nBill B. Todd and Nack to authorize\nthe magistrate of Clayton County.\nThe Intergovernmental Accordination.\nHouse bill 873 by Representative Holmes\nof the 129th, the Welsh of the 110th.\nBill B. Todd and Nack to amend the Nack to create\na joint county municipal board of elections.\nThe Intergovernmental Accordination.\nHouse bill 874 by Representative Holmes\nof the 29th, the Welsh of the 110th.\nBill B. Todd and Nack to authorize\ngoverning authority of Butts County,\na levy and excise tax.\nThe Ants for Governmental Coordination.\nHouse bill A75, I wrote that\nof next to 69th Collins,\nthe 68th cook of the 18th building,\nTalon Act to amend the act\nto create the Carroll County Water Authority.\nThe Ants for Governmental Coordination.\nHouse bill A76, my represent,\nit grows to the 120th building,\nTalon Act to create an act,\ncreate the Green County Airport Authority.\nThe Ants for Governmental Coordination.\nHouse bill A77, my represent,\nhoping to the 179 Jones honors 67th Mathis of the 144th and dollar of the 45th\nbuilt a tunnel act to amend Title 40.\nFisher go to Georgia annotated relating motor vehicles and traffic motor vehicles\nhouse bill 878 by groups in a fri the 118th Hutchison on 177th McLearn of the 51st\nKendrick on 93rd Alexander the 66 and others built me a title and act to amend\nTitle 16 35 36th.\nFisher go to Georgia annotated relating to crimes and offenses judiciary non\nCivil House bill 879 by refs of Harold the hundred and six car from the fourth pile of thirty-second Stevens London 64th fry the hundred and eighteen\nThan others they'll be taught on act to amend article one of chapter three title three the fish go to Georgia annotated relating the provisions regarding the regulation of alcoholic beverages\nRegulated industries house bill 880 by refs and client in the 75th podium the 62nd tribal 130 second Beverly the hundred and forty-third\ncurrently in the 136th.\nThey'll be taught an act to a men chapter two,\na title 20 that fish go to Georgia and a theater\nrelating to elementary and secondary education.\nEducation.\nHouse Bill 881,\nBarbara Jackson Cooper,\nthe 43rd silk ox,\nthe 52nd rich and the 97th jacks and the 128th\nand religion 100 and the 9th.\nThey'll be taught an act to men,\ntitle 19 that fish go to Georgia and a theater\nrelating to domestic relations.\nHealth and human services.\nHouse Bill 882, Barbara,\nsome House of the 170th rich\n97th Corb of the 7th, 74th, green to the 151st,\nChocos 138th.\nHe'll be top of the act of men,\narticle on the chapter 8 of Title 4080.\nFish go to Georgia, Anitander,\nrelaying the general provisions regarding\nthe state sales and use tax.\nWays and mains.\nHospital 883, Vargas.\nGillier to the 160-second Hitchens,\n116-1st, and Prince 117th.\nHe'll be top of the act of men,\nTitle 49 in the fish go to Georgia, Anitander,\nrelating to social services.\nPublic safety and homeland security.\nHouse Resolution in 1036 by resident of Beasley T. of the 65th\npodium, 62nd Glanton of the 75th, and Scofield of the 60th.\nResolution compensating Robert Charles-Dukes.\nAppropriations.\nHouse Resolution 1037 by representation of 104th Parsons,\n44th Jones of the 47th McLaren of the 51st Carson,\nthe 46th and others.\nResolution proposing amendment to the Constitution\nof the State of Georgia.\nGovernmental affairs.\nHouse Resolution 1038 by Representative Gordon 163rd,\nGilear to Home 62nd, Stevens Home 64th, Williams Home 68th,\nPetrie of the 166th and others,\na resolution compensating Eric Gardner.\nAppropriations, House Resolution 1039 by Representative Gordon,\n163rd, Gilear to Home 62nd, Stevens Home 64th,\nWilliams Home 68th, Petrie of the 166th and others,\na resolution compensating Dominic Luci.\nAppropriations House Resolution 1040 by reps and a Williams on 68th,\nBeverly on 43rd, Tramble on 32nd,\nBennett on the 94th, Hugley on the 136th and others,\nresolution of apologizing for slavery and Jim Crow.\nJudiciary House Resolution 1041 by reps and a Gordon on the\n63rd, Gillier on the 62nd,\nStevens on the 64th, Williams on the 68th,\nPetrie the 166th and others,\nResolution compensating a Mark Jason Jones.\nAppropriations.\nSenate Bill 296 by Senator Heath in the 31st.\nBill B. Donald Mack to amend chapter 18 to title 43.\nThe Bishop of Georgia and it did relating\nto funeral directors and establishments.\nRegulated industries that completes first readers.\nSecond reading of bills and resolutions, a clerk or read.\nHouse bill 749 by Representative McLaren of the 51st\nto bill relating to local government.\nHouse Bill 865 by Representative Scalgons of the 14th,\nRichard the 97th, Fleming of the 121st Stillcock,\nto the 52nd, dryer of the 59th,\na bill relating to Will's trust and administration\nof the state's House Bill 866 by Representative Hogan\nof the 179th, Zanes of the 180th,\nWilliams of the 148th,\nMathis of the 144th, Gailier of the 162nd,\na bill relating to county police,\nHouse Bill 867 by Representative Martin of the 49th,\ndollar of the 45th, Jones of the 47th,\na bill relating to limitation on annexation\nof areas, furnished services,\nor included in comprehensive zoning plan\nby certain counties. House bill 868 by Redstone Martin of the 49th\nCarpenter of the 4th and Powell of the 32nd. A bill relating to sales and use taxes. House\nbill 869 by Redstone Blanson of the 75th. By now the 77th base more of the 63rd. Scofield\nof the 60th. Douglas of the 78th and others. A bill to amend and act creating Clayton County\nWater Authority. House bill 870 by Redstone Martin of the 5th. Carpenter of the 174th.\nPridley of the 6th. Kelly of the 16th and Skoggins of the 14th. A bill relating to horns, exhaust\nsystems, mirrors, windshields, tires, safety belts, and energy absorption systems.\nSenate Bill 304 by Senator Goethe to the 51st to create a board of elections in registration\nfor White County, Senate Bill 328 by Senator Jones of the 25th, a bill to authorize the\ngoverning authority of the City of Jackson to Levy and X-size tax, three-second beaters.\nReports of standing committees, the clerk will read.\nRepresentative Mark Newton of the 23rd District Chairman and the Committee on Access to Quality Healthcare submitted the following report to speak to your committee on\nSpecial Committee on Access to Quality Healthcare and Senator consideration\nFollowing bills to the House and instructor me to report the same back to the House following recommendations\nHouse bill 789 do pass by committee substitute\nrespectively submitted representative Mark Newton on the 23rd District\nchairman\nThat completes the reading the reports of standing committees\nto morning orders. We are about to go\non to morning orders. Okay, here's the\ndeal, chairs going to a lot one\nminute each for morning orders, but\nbecause of the number of people who\nhave signed up, that will, that must\nbe strictly enforced today or someone\nwill have to come back tomorrow and\ndo one. What that means is you better be ready. We're going to put you on the\nclock when we call out your name. Chair recognizes representative Houston\nGaines for a morning order.\nThank you, Mr. Speaker and good morning. Today we recognize X and Y chromosome\nawareness day. Today we're recognizing the genetic condition and individuals with either\nless than or more than two X or Y chromosomes and individuals genetic code. As common as\nthis condition is occurring in 1 in 400 males and 1 in 1000 females, fewer than 10% of cases\nare ever properly diagnosed. The frequent misdiagnosis and these disorders can be a detrimental\nto the societal, behavioral, and physical development of those affected. And yet for many\nyears there were few to no resources available to those who needed them.\nThen in 2016, Dr. Amy Talboy and Dr. Sharon Close at Emory University offered hope to\nthese individuals through their work opening the extraordinary clinic.\nAs we celebrate the great strides made by these citizens, let us also take time to reflect\non how we can be supporters of those struggling.\nToday is the day we bring much needed awareness to this condition across our state and we're\nhonored to have families and doctors in the gallery here with us today.\nThank y'all for being here, and thank you, Mr. Speaker.\nChair recognizes Chairman Ballinger for a morning order.\nThank you, Mr. Speaker. I'll ask other domestic violence advocates that serve with me in the House to join me.\nI mean, today has stopped violence against women day.\nAs a house, we have passed significant measures to make it\nto add its triangulation to the aggravated assault statute,\nallowed domestic violence victims to break a lease,\nand many other measures that have made it safer for Georgians.\nAnd I would like all of my domestic violence advocates\nin the house, in the gallery, please stand,\nand we will welcome you.\nThank you, Mr. Speaker.\nChair recognizes Chairman Hitchens for a morning order.\nGood morning, colleagues.\nToday, we gather in this house to celebrate the 48th annual Fireman's Day.\nAnd Georgia, there are probably 30,000 firements,\n70% of which are volunteers who do this job\nfor our society without any monetary compensation.\nThere are 900 local fire departments across this state.\nThey put the well-being of society\nbefore their own personal health.\nI worked together with them in my 43 years in state government.\nThey do a great job.\nAnd at 2 o'clock, we're going to have an official ceremony\nthe south steps and I believe the governor is going to attend and we'll have a lot of\nany firemen here, if any firemen are here, I guess they have it arrived yet, but let's\nalso give a round of applause for the firemen who worked day in and day out, 360 days a year,\n24 hours a day to protect us. Thank you.\nChair recognizes Chairman Gerald Green for a morning order.\nThank you, Mr. Chairman, to continue the Southwest Georgia\nrecognition of famous individuals.\nAnd as part of Black History Month,\nI come this morning to talk about Rosie Greer,\nwho was born in Cuthbert, Georgia,\nis an American actor, singer, Christian minister,\nand former professional American football player.\nHe was a notable college football player\nPennsylvania State University, who earned a respective place in the National Collegiate\nAthletic Association.\nAnd Rosie is just one of those individuals that has come out of my region in Southwest\nGeorgia, and it is certainly with great pleasure this morning to recognize Rosie Greer from\nThank you, Mr. Speaker.\nChair recognizes representative Bowdie for a morning order.\nThank you, Mr. Speaker.\nIt is a pleasure to rise this morning to welcome the women\nof Junior Leads of Georgia on their 2020 Capitol Day.\nThe Junior League of Georgia stands strong with 13\nleagues statewide and 10,000 members.\nThe State Public Affairs Committee monitors state\nand federal legislation and advocates\nor in their focus on areas of aid and protection,\neducation and health care.\nThey support and promote civic engagement through\nprogramming and partnership in their local communities.\nThe Junior League of Georgia invites their legislators\nto join them today for lunch and count 125 at noon.\nJoin me in welcoming to the People's House\nthe Junior League of Georgia.\nThank you, Mr. Speaker.\nChair recognizes representative Rick Williams for a morning order.\nThank you, Mr. Speaker.\nHave leadership Baldwin up here in the gallery if y'all would stand up and be recognized.\nLeadership students from Baldwin County.\nThank y'all very much.\nThank you, Mr. Speaker.\nChair recognizes Representative Kendrick\nfor a morning order.\nThank you, Mr. Speaker and good morning, colleagues.\nSo we are welcoming a special group today,\nGeorge's citizens with third tick for all day of action.\nAnd we had a great discussion on cybersecurity\nthis morning throughout our state.\nAnd many of these citizens are going to be calling you\nto the ropes to speak with you today.\nSo if you are a participant in this morning's day of action,\nif you could please stand so that we could give you\na round of applause.\nThank you, Mr. Speaker.\nChair recognizes Chairman Belton for a morning order.\nThank you, Mr. Speaker.\nTwo decades ago, back in 2002, Georgia ranked near the very bottom on the SAT.\nHow many of you remember that?\nRaise your hands.\nA newspaper article and a prominent paper in Atlanta report that we were number 50.\nThat's right ladies and gentlemen, dead lasts on the most important measure of a student's\nability to enter college.\nBehind Alabama, behind South Carolina, behind Louisiana, behind Mississippi.\nBut something happened at the end of that year.\nThe Republican governor, Sonny Perdue, was elected, and Republicans went to work restoring\nlocal control, listening to our teachers, and returning authority back to the classroom.\nThen Republicans started the very long and difficult process that was completed under\nRepublican Governor Nathan Diel and continued by Republican Brian Kemp and this General\nAssembly of fully funding education for the very first time in recent history.\nWhat are the results for the first time ever, Georgia beats a nation for four years in\nthe road on the ACT. We had the 13th best score on the NAP last year, the nation's report\ncard for the K-12 schools. We had recently with the 13th best AP scores in the nation,\nand for two years in a row, not one, but two years in a row, we're above the national\naverage on the SAT. This terrific success of Georgia's children is due to the hard work\nof our amazing Georgia teachers and Republican leadership.\nThank you, Mr. Speaker.\nThank you, Mr. Speaker.\nChair recognizes Chairman Fleming for a morning order.\nThank you, Mr. Speaker.\nOn the day that I welcome youth leadership,\nColumbia County, who's been the balcony with us today,\nit's quite appropriate that I also mentioned something\nto you about Augusta University,\nwhere some of these kids may go to school.\nAugusta University is educating the next generation\nof cyber professionals in inspiring future generations.\nThe Georgia Cyber Center represents a unique public-private\npartnership that includes Augusta University,\nAugusta Technical School, the Georgia GBI,\nthe Georgia Department of Defense,\nand several other federal agencies that work together\nto meet the workforce demand for cyber security\nin our state.\nIn 2019, a gust of university signed a memorandum\nof understanding with the US Army Cyber Center of Excellence\nto share resources and help develop a cyber-trained\nworkforce through education, innovation, research,\nand outreach.\nFor the past two summers, the university\nhas hosted the JIN Cyber Camps for high school students\nteachers. The camps were sponsored by grants from the National Security Agency and the National\nScience Center Foundation. Let's all congratulate the Georgia Cyber Center for the work they are\ndoing to help keep our Internet safe on this National Safer Internet Day. Thank you, Ms. Speaker.\nChair recognizes Representative Hutchinson for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday I'd like to introduce you to Brian.\nBrian is a sweet shy boy who loves to spend time with others.\nHe likes to hear the voices of his friends at school and on the school bus,\nwhich he enjoys riding.\nBrian regularly has friends from church and school come over to play the piano for him.\nBrian enjoyed listening to all types of music.\nToday I introduce you to Brian to highlight the plate of medically fragile children who are available for adoption in Georgia.\nWith these children requiring extra care, they give back an extra love and love is bipartisan.\nThank you, Mr. Speaker.\nChair recognizes Representative Kinnerd for a morning order.\nThank you, Mr. Speaker. Most of us in this room will not use anything we learned in school\nfrom algebra class, geometry, calculus, nor will there be any functional application today\nfor most of us from the information gleaned from physics class, chemistry, or biology.\nBut what we will use today and every day of our life is social studies. Sociology, US\nhistory, world history, civics, ethics, all assist our ability to understand the world\nwe live in, enhance our perspective and cultural understanding, it expands our empathy.\nResearch proves that students who receive effective social studies instructions are more\nlikely to be civically engaged or more likely to vote, to volunteer and work on community\nissues.\nSocial studies has been marginalized in recent years as math and science have been elevated\nand I would argue that as a direct result we are seeing more turmoil and conflict in\nour world, increases in bigotry and hate.\nThe A.J.C. reported this morning that social studies could be taking another hit as we\nare proposing reducing testing.\nSocial studies teachers and advocates are very concerned as they understand why gets\ntested, gets taught.\nMy friend Debbie Daniels was the department leader of the social studies in Gwyneth County\nfor many years.\nShe says social studies is what we do for the rest of our life.\nI agree.\nI yield the will.\nChair recognizes Chairman Abstration for a morning order.\nMs. Speaker, today in Gwinnett County, the Board of Elections Office will be dedicated\nfor Beauty P. Baldwin, who is a constituent that I represent.\nThis Baldwin has served a distinguished career as an educator and as a member of the Gwinnett\nCounty Elections Board.\nBecause of committee meetings, I'm unable to go to the dedication today at 4 p.m. but\nI want to congratulate Beauty Baldwin on the well-deserved recognition and join with\nof the members of the WANET delegation\nin applauding her outstanding service.\nThank you, Ms. Speaker.\nChair recognizes representative McLeod\nfor a morning order.\nThank you, Mr. Speaker.\nBig up to my colleagues.\nReflecting on the journey of Africans\nto the Western Hemisphere is not the beginning\nof our history or is it the end?\nAlthough the exact numbers will never be known,\nThe transatlantic slave trade is believed to have forcibly displaced 12.5 million Africans\nthroughout the 17th and the 19th centuries.\nSome 10.6 million survived the infamous middle passage across the Atlantic.\nI ask for a moment of silent for the atrocities committed against these human beings.\nhistory 366 days I yield a well. Chair recognizes representative Chocus for a\nmorning order. Thank you Mr. Speaker. It is indeed an honor and a privilege for\nme to recognize members of the Sumter County Fire and Rescue Officers and\nfine rescue service. They're in the gallery. Please stand up, guys. I'm going to\nread their names. Jerry Harmon is the chief, AB Lewis, Clint Bowley, Rick Bell,\nDavid Baldwin, John Carroll, Mark Griggs, Hope Griggs, Chris Thoms, Piggy Lentoms,\nCharles Horn, Chad Brown, Sabrina Ruta, Jameson Tyler, Heather Tyler, and\nMichael Drewberry. And the thing that I want to point out about our firefighters\nat home is the fact that we've got so many women in the fire department, so I would dare\nto say that we've got the best-looking firefighters in the state of Georgia. We just had a fire\nin my district of which several fire departments came out and helped out and lost two buildings\nin Buonavista, so I want you all to join me in congratulating the firefighters from the\nAmerica's Rescue Service. Thank you. Thank you Mr.\nRepresentative Carter for a morning order. Good morning. Thank you\nSpeaker Austin. Ladies and gentlemen know the House and our guests. Our moment in\nblack history. Did you know that Atlanta the city too busy to hate was once\nmust decide of a racist massacre that lasted four days when mobs of thousands attacked\nand beat and slaughtered any black person they saw on Atlanta downtown street destroying\nbusinesses homes at will.\nIt's true, even most Atlanta's, like myself, weren't aware that when they walked down\nPeace Street, enter the five points marty station,\na go to class at Georgia State University.\nThey are in an area where 100 years ago,\nas many as 10,000 white men were involved\nin a violent rampage killing black people.\nToday, the tens of thousands of people\nwho passed the Statue of Henry Grady\nlocated at Marietta Street just blocks\nfrom the CNN Center are probably oblivious to the fact\nthat the bodies of three black men were heaped in a bloody pile\nat the base of the monument, which is dedicated\nto a famous editor.\n1906, Atlanta was a bustling city,\nand September 26, 1906, through September 24,\nwhere the days of the massacres.\nThe official Dev Toe was 11 or 12.\nThe unofficial Dev Toe reached in the hundreds.\nLet us never forget, let us never go back.\nLet us remember that we are all worthy of wealth.\nThis is your moment in black history.\nChair recognizes representative Mathy Ack\nand representative Pullen for a morning order.\nThank you, Mr. Speaker.\nThis morning, Representative Matthew Ackin,\nI'd like to welcome the Marine Baptist Church\nto the state capital today.\nThey're appearing at the top left-hand corner.\nAnd they have brought members from Pike County,\nat Spaldon County and Henry County.\nSo I appreciate you guys coming up\nand please come back and visit with us again.\nIt looks like our doctor of the day is going to require two members to introduce her.\nIs that accurate?\nChair recognizes Representative Gardner and Chairman Perish to introduce the doctor of\nthe day.\nThank you very much, Mr. Speaker.\nIt is my great pleasure to introduce to you, Dr. Cheryl Grabham, who is currently surgeon\nin chief at Emory and in the Grady Health System.\nShe completed her medical training at Georgetown University, surgical residency at Washington\nhospital center and received her MBA from the University of Connecticut School of Business.\nNow normally we think about surgeons as people who just cut and sew.\nBut Dr. Graham does a lot of interesting things in our community.\nHer current research focuses on decreasing disparities of breast cancer care through\na community education outreach program, and providing high quality care for breast cancer\npatients at Grady Health System. We are very lucky to have Dr. Graham in our community,\nand I welcome her here today.\nThank you, Representatives Gardner and Parrish. It is quite an honor to spend a day at the\nI would like to read a quote from the American anthropologist William Ward that reminds me of the skills that each of you have and the work all of you perform every day on behalf of the citizens of Georgia.\nBefore you speak, listen, before you write, think, before you spend, earn, before you invest,\ninvestigate, before you criticize, wait, before you pray, forgive, before you quit, try,\nbefore you retire, save, before you die, give.\nMy most sincere gratitude for the many hours all of you generously give in your roles\nas representatives for the state of Georgia.\nThank you.\nThank you.\nThank you.\nThank you.\nThe House will continue to be at order because we are about to recognize a very distinguished\nguest and the clerk will read the caption to house resolution 1013. House\nresolution 1013 by resident Taylor the hundred and seventy third green and\nhundred fifty first parish the hundred fifty eighth Smith the hundred thirty\nfourth gains the hundred seventeenth and others a resolution recognizing\nFebruary 4th 2020 as community health centers day and commending the Georgia\nprimary care association and for the purposes. Chair recognizes chairman\nand Darlene Taylor for an invite resolution.\nThank you, Mr. Speaker, members of the House.\nToday I share with you the mission of the Community Health Center System is to improve access\nto comprehensive primary health care services.\nCommunity Health Centers are known as federally qualified health centers because they receive\ngrant dollars to assist in providing health care to the uninsured and the underinsured.\nCounty Health Centers in Georgia began their work over 50 years ago, partnering with communities\nto bring access to health care and areas that are medically underserved. Currently, there\nare 34 health center organizations, all non-profit 501C3s, governed by local boards that are\nmade up of community leaders and patients. Collectively, these 34 organizations have\nof 229 clinic sites and 120 of Georgia's communities.\nMany of these clinics are in rural communities.\nIn 2019, over 600,000 patients were served\nat health centers.\nOn your desk is a map showing where health centers\nare located in your districts.\nAs we strive to increase access to healthcare\nin rural communities, health centers do their part\nby providing for pregnant care for women\nand pediatric care all across the state.\nBy working together, Southwest Georgia Primary Care\nin Thomasville and my local obstetricians\nwere instrumental in keeping our vital OB services\navailable in South Georgia.\nIn the gallery are the community health centers\nfrom all across the state and their staff.\nThank you for what you do.\nNow please join me in welcoming Sarah Lang,\nPresident of the Association.\nMr. Speaker, thank you and members of the House.\nI'm Sarah Langs, CEO of Valley Healthcare in Columbus, Georgia.\nI thank you for this opportunity to speak before you this morning.\nI and colleagues from across the state met with a few of you last evening and this morning.\nAnd there were themes that ran throughout the conversations that we had.\nSome of those included comprehensive, patient-centered, community organizers, patient involvement\nand engagement, and pharmacy services that were provided for members that didn't have\nthe opportunity and being able to provide services without consideration of the ability\nto pay all of these just combined to define the community health center program throughout\nthe state. And we thank you for this day of recognizing community health centers as\nC.H.C. Day here at the Capitol.\nAnd as servant leaders, we also work with you\nto make sure that the residents, the citizens of this state\nreceive the highest quality of care that we can provide,\nand we welcome you, and thank you.\nThank you.\nThank you.\nYou're going to take a picture.\nSo you're going to come over here.\nYeah, you step forward, okay.\nCan we all get in there?\nYou\nReception to House Resolution 914.\nHouse Resolution 914, members of Kendrick of the 93rd Cecil of the 35th, more than 95th Colville,\nthe 20th Allen of the 40th and others.\nA resolution commending Roy E. Hadley, Jr., and for other purposes.\nChair recognizes Representative Darshan Kendrick for an invite resolution.\nThank you, Mr. Speaker, Mr. Roy Hanley.\nGood morning.\nSpeaker Austin, leadership representative Kendrick, my fellow Bulldogs in the Chambers.\nMy name is Roy Hanley and I am a Cybersecurity Lawyer Professional here in the state of\nGeorgia.\nI'm joined here this morning by Erica Moore with the Community Foundation of Georgia, of Atlanta\ngreat Atlanta and Erica was a Facebook thank you for taking time this morning and letting\nus speak to you for a brief moment during the time that I speak to you a cyber attack\nwill occur every thirty nine seconds seventy five personal records will be stolen every\nEvery second that I speak to you, those records contain the personal information of you,\nyour family, your friends, your colleagues, your constituents.\nThe State of Georgia has a very robust technology community, FinTech community, medical care\ncommunity, all of which contain personal identifiable and very sensitive information.\nMy challenge to you today is to help us the tens of thousands of cybersecurity professionals\nin the state of Georgia to keep this information safe and secure.\nWhat can you do to help us? Five things I'll ask of you this morning.\nFirst, state and local governments are at the crosshairs of these types of attacks.\nI worked with the city of Atlanta in its ransomware response and recovery.\nEvery community in the state is at risk.\nYou can provide two kits. You can provide resources to help these communities.\nSecondly, you can provide rapid response and recovery teams and resources to help communities\nthat have been affected to respond.\nThird, you can help educate and provide the resources for our state and local universities,\nparticularly rural areas to have and robust cyber security programs.\nThese programs will allow those students to go into the workforce and provide jobs to\nGeorgians, which are sorely needed.\nFourth, you can provide and pass comprehensive privacy and cybersecurity legislation.\nAnd lastly, you can enable information sharing amongst the resources in Georgia.\nThis is a problem that affects each and every one of you, each and every one of us,\nwe need your help. Thank you.\nYou\nClerk will read the caption to House Resolution 1043.\nHouse Resolution 1046 by room 7, Dempsey the 13th, Cooper the 43rd, Tramble the 32nd, Newton\nthe 23rd, and housed another 170th.\nA resolution, recognizing February 4, 2020, as a BCD care awareness day in Georgia and\nfor other purposes.\nChair recognizes Chairman Dempsey for an invite resolution.\nThank you, Mr. Speaker.\nThis morning, we are joined by officers of the Georgia\nSociety of the American College of Surgeons and Members\nof the Georgia Chapter of the American Society of Metabolic\nand Bariatric Surgery across the state, particularly\nI'm joined here by Dr. Renee Hilton and Dr. Aaron Bullduck from the Medical College of\nGeorgia and Augusta, Dr. Whipple from Memorial in Savannah, Dr. Jamil Stetler from Emory\nin Atlanta, and Dr. Danny Vaughn from Navison and Macon and others that are with us here\nin the gallery.\nToday we recognize Obesity Care Awareness Day in Georgia.\nRecognizing that the disease of obesity is a major public health concern, which continues\nto grow, it has increased more than 20 percent over the last 30 years in Georgia.\nResearchers agree that this is a complex disease, greatly increasing the risk of developing\nmany other health-related conditions that are life-affecting and very expensive.\nPrevention is important and it is also imperative that individuals and families and all affected\nby this disease have access to and receive comprehensive care and treatment. Treatment\nshown without bias or stigma from general society and health care professionals. We as policymakers\nhave the opportunity to regard obesity with the same level of seriousness with which we\nregard all other chronic diseases.\nMr. Speaker, I'd like to allow Dr. Renee Hilton also to speak.\nThank you, Mr. Speaker.\nThank you, Representative Dempsey.\nThank you to the House for having us here today.\nSo we are here today to spread awareness about obesity, a disease that we all know\ntoo well, as it affects people across not only the country, the world, but has a profound\nimpact right here at home in our state of Georgia.\nIt is currently affecting one out of three adults in the state of Georgia and one out of\nfive adolescents.\nObesity is not all about the weight, though.\nAs Representative Dempsey has already said, it's also about the numerous medical problems\nassociated with it.\nThings like hypertension, diabetes, heart disease, and cancer, just to name a few.\nRight now we have a treatment.\nWe have a cure and we have a preventative measure that we are not taking full effect of in\nthe state of Georgia.\nRight now, Georgia is one of six states in the entire country not providing very atric\nsurgery access to our state employees.\nThat is something that we aim to change with your help.\nProviding this benefit will not only make our state a better workforce and a healthier\nworkforce, but it is also financially responsible.\nIt will save our state money.\nWe can look to recuperate the full investment of surgery within 25 months.\nPlease come join us on the second floor as we tell you more about this disease in the\nprocess.\nAnd we've also brought our surgical robot so we would love to see how many of you fare\nat the operating room table.\nWe'll walk you through your first case.\nThank you.\n.\n.\n.\n.\nClerk will read the caption to a group of privileged resolutions honoring the life and memory\nof Gwendolyn Roberts and Johnson.\nCommending the Georgia Rural Health Association to recognize in February 20th, 26th, 2020\nas Rural Health Day at the State Capitol, congratulating the Dublin and fighting Irish for\nwinning the 2019 2020 G.H.S.A. class AA State Football Championship. Recognizing\ncommending the Kennesaw State University Black Alumni Society. Commending\nSam X. White, the Southern Sky Center for diverse arts and culture and its\nvillage community garden of Sylvester, Georgia. Congratulating commending\nHarvey Levoid, Causie, Jr. Commending with the voyage of the Mayflower to\nthis great nation, recognizing commending, in the\nregard through Jarrett.\nRecognizing February 7th, 2020, is National Wear Red Day,\nin recognition of the importance of the ongoing fight\nagainst heart disease and stroke and women.\nAnd for other purposes, that completes the reading\nof the Privilege Resolutions.\nIs there any objection to adopting the privileged resolutions the chair here's none in the resolutions\nare adopted. Okay, we're going on now to announcements. If you have signed up for an announcement,\nmake your way to the front of the chamber. Chair recognizes the chair of the majority\ncaucus, Chairman Hatchett, for an announcement. Thank you, Mr. Speaker. The majority caucus\nThis will be meeting today at noon in room 403 at the Capitol, today at noon, 403.\nChair recognizes the chairman of the House Rules Committee, Chairman Smith for an announcement.\nI think Mr. Speaker, rules committee will meet tomorrow morning at 9 o'clock.\nThey recognize this representative bonner for an announcement.\nThank you, Mr. Speaker.\nI would just like to invite everyone to the weekly legislative fellowship tomorrow morning\nat 7 a.m. in room 107.\nIt is free donut day, so I expect to see everyone there.\nThank you.\nChair recognizes Chairman Ron Stevens for an announcement.\nMs. Speaker, ladies and gentlemen, the House Economic Development and Tourism Committee will meet today on adjournment, today on adjournment in 341. Thank you.\nChair recognizes Chairman Lumsden for an announcement.\nGood morning. There will be a meeting of the Insurance Committee House Insurance Committee in the morning at 8 o'clock, CLOB 606, three items on the agenda.\nChair recognizes representative Dickerson for an announcement.\nThank you, Mr. Speaker.\nThe women's legislative caucus will be meeting in room 514 upon the German.\nLunch will be served in room 514.\nThank you.\nChair recognizes Chairman Beverly for an announcement.\nThank you, Speaker.\nThe census, we will have an expert in room 514 today talking about the census at 2 o'clock,\n514 from 2 to 4 in room 514.\nIf you want to hear more about the census, please come out today.\nThank you.\nChair recognizes Chairman Parsons for an announcement.\nThank you, Speaker.\nEnergy, utilities and telecommunications committee will meet today at 3 o'clock.\n4.03 of the capital. I don't think that the notice shows legislation, but we do have legislation to take up today. Thank you.\nChair recognizes chairman dollar for an announcement.\nHouse entertainment working group will work meet today at 2 o'clock in 4.03. Thank you.\nOkay, we've got pages that are waiting up here for their representative for their photographs.\nIf you have a page here today, you need to be up here with them or it's going to be forever\ntoo late.\nChair recognizes representative Evans for an announcement.\nThank you, Mr. Speaker.\nThe DeCab delegation will meet in room 216 upon adjournment.\nThank you so much.\nBye-bye.\nYou\nall right listen up now chair recognizes the majority leader of the house for a\nmotion thank you miss speaker miss speaker I moved to this house stand adjourned\nuntil 10 a.m. Wednesday February the 5th 2020 the majority leader has moved that\nthis house be adjourned until Wednesday, February 5th. In the year 2020 at 10 a.m., all those\nin favor of the motion will say aye. Those opposed will say no and the eyes have it. This house\nwill be adjourned until Wednesday, February the 5th at 10 a.m.\n",
  "updated_at": "2026-02-12T15:38:09.345338+00:00"
}