{
  "video_id": "FSYeoA6Dt1E",
  "url": "https://www.youtube.com/watch?v=FSYeoA6Dt1E",
  "title": "11/28/23 Senate Study Committee on Occupational Licensing",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 64,
  "summary": "Here is a structured markdown summary of the Georgia 11/28/23 Senate Study Committee on Occupational Licensing session:\n\n**Overview**\nThe Senate Study Committee on Occupational Licensing held its fourth meeting, hearing testimony from various stakeholders on occupational licensing requirements in Georgia that may be inhibiting economic mobility, limiting job prospects, and hindering small businesses. The committee discussed common themes of frustration around the bureaucratic and burdensome licensing process.\n\n**Key Actions**\nNone noted.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- The committee heard from representatives of the Georgia Forestry Association, who requested that the Board of Registrations be moved from the Secretary of State's Office to the Georgia Forestry Commission.\n- The committee reviewed an email from a constituent expressing frustration with occupational licensing requirements for their medical practice.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nThe committee had 4 of 5 members present, establishing a quorum.\n\n**Adjournment**\nThe meeting details and next session date were not provided in the transcript summary.",
  "transcript": "I hope everybody had a great Thanksgiving break and now it's time to get back to work.\nWe all been kind of scrambling, trying to play catch up after long weekends, I'm sure,\nbut we're getting there and then the fun will begin in earnest tomorrow, I guess.\nBut we, I hope we'll have shortly Jason and Vitality joining us via Zoom, see on yet.\nI spoke to him 45 minutes ago and he's planning to join us.\nAnd I think Senator Halperen is in a committee meeting, another committee meeting.\nMaybe she'll be able to join us before we finish.\nWe don't have any presenters today.\nI'm just going to kind of recap what we've worked on and then we'll talk about recommendations.\nIf anybody wants, we probably need to let us sign up sheets. If anybody wants to speak after we\ngo through all the recommendations, pro or con, to anything we discuss they can, but just get my\nattention, I guess. We'll do that. As is customary, I'd like us to open with a word of prayer and I\nI haven't asked anybody so I'm going to put somebody on the spot and I guess it's going\nto be Chairman Strickland.\nWhat is your number six?\nSix.\nThank you, Mr. Chairman, Y'all, about with me.\nGod, thank you so much for the day that you've given us, Lord, and thank you for giving\nus a chance to do this work at the State Capitol, Lord.\nPlease guide us and lead us and help us to make the right decisions for all of George\nand Lord.\nsafe over the next week as we dive into deeper issues as well here that affects everybody in this\nstate lord and Jesus name I pray amen thank you chairman I've already gone through the the\nwelcome and the roll call again we've got three members present this is a five member committee\nso we do have a quorum and we expect to have Senator Anna Rotardi joining us\nHopefully shortly and possibly Senator Jason thank you senator avatar. Welcome. Okay, so now we've got we've got it for here. That's good.\nAll right, I just want to kind of we've we've got a draft report that is in your file.\nlooks like this and we'll just kind of go through hit the highlights of that if you don't mind\nI'll just walk us through that so we've had three meetings prior to this one this is our fourth meeting\nwe met on August 10th and making it the office of the secretary of state licensed division\nwe met September 27th here at the state capital and October 31st here at the state capital\nThis study committee was created by Senate Resolution 85 during the 2023 session and the object\nof it is to look at what others tell us are onerous occupational licensing requirements in\nGeorgia that can inhibit economic mobility, limit job prospects and hinder small businesses\nand I would add to it a kind of stifle entrepreneurship. So we want Georgia to continue to be a robust\nplace for business, number one in the nation for business. And these license, the occupational\nlicenses can be a hindrance to a good business environment and good economic development. We heard\nfrom folks that more than one group told us that the occupational licensing, licensing\nrequirements that we have really disproportionately impact lower income occupations, the time it\ntakes, the cost to get the license and all of that is a disproportionate burden on some\nof our best citizens that are out there working hard. August 10th we heard from Daniela Perry,\nthe Vice President of the Georgia Chamber Foundation. We heard from our very own Sarah\nClinton and Assistant Legislative Council. He's here with us today. We heard from Mr. Gabriel\nSterling the Chief Operating Officer of the Secretary of State. That was a good\nmeeting we had that day and the meeting to here at the Capitol. We heard from\nMark Hayden, the Director of State Governor Affairs for R Street Institute.\nAnd you see his testimony in here on page five.\nWe heard from Austin Bannon, Employment Policy Fellow\nwith Americans for Prosperity.\nWe heard from Dr. Pierre Luigi Mancini,\nthe President and Chief Executive Officer\nof Multicultural Development Institute.\nGo on over to page seven.\nWe heard from Ms. Darlene Lynch, head of external relations\nfor the Center for Victims of Torture.\nAnd she basically really, her job title did\nsort of as misleading as far as what she talked about.\nWhat and about torture is about physicians\nthat are licensed in other countries\nin trying to eliminate barriers for allowing them to practice\nhere in Georgia is what her topic was.\nAnd then also Pauline McKinney and Leslie Kelly\nwith voices for Georgia's children and Belisa\nare beanie with Sarah Family spoke on that really\nthat same topic.\nAnd then changing gears we heard from Jay Gayler and Sarah Boyer\nwith the Georgia's chapter of the American Study of Landscape\narchitects meeting three, October 31st.\nWe heard from Miss Shay Rawls and Mr. Jamal Lofton\nwith Kaiser Permanente, Georgia.\nAnd I did not include this in my one-pager of recommendations,\nbut I do want us to, this reminds me,\nI want to circle back to talk about this,\nbut Virginia has got a successful program\nthat Kaiser Permanente is taking advantage of where people trained in the military as a\ncorpsman or a medic in the military are given an expedited license and I guess other medical\nfields with military training and Kaiser is hiring a lot of these people with great success\nand of course we've heard over and over about the workforce shortage and health care,\nthe health care workforce shortage in Georgia. In fact, we have a separate study committee\nsolely dedicated to that topic, but it's real and it's pretty severe and the demographics of the\nmedical folks that we have, I mean, they're aging out and it's only going to get worse. So we've got\nwe've got we can't keep doing the same thing and and solve that problem. Then we\nheard from Robin Pinchton and Elizabeth Harrison with the Georgia Nursing\nLeadership Coalition and Jamie Kavanaugh and Megan Ford Forbes with Institute\nfor justice. And then lastly we heard from let's see Spencer Johnson and Trenton Turk and Mark\nChastain with the Survey and Mapping Society of Georgia and Gail Mackie or Mackie probably\nwith the Georgia License Professional Counseling Association, Rusty Royston with the Soul Science Society\nof Georgia. So we had a lot of testimony. We heard from a lot of different varied fields. We did not\nanywhere close to talking that we weren't able to talk to everybody. We have, as a reminder, over\n40 occupational licenses just under the Secretary of State's office. And then there are other licenses\nelsewhere in other agencies. So we just kind of hit the tip of the iceberg, frankly. I\ndon't, I didn't see in this report, but we did hear from a lady that was a makeup artist.\nIs that in here somewhere? Who wrote this? Okay. Okay. No, that's, that's fine.\nWe also had material submitted and written form to the committee, and I probably need to get with you to make sure we include that in our report, I would think.\nBut so lots of good information.\nThere was, you know, kind of a common theme throughout it all, I think, where people were wanting to go to work,\ndelayed for me and able to go to work, prohibited from going to work because of the\nour license requirements and a pretty high level of frustration with the process,\nhow aggravating and bureaucratic and burdensome it is, and how long it takes.\nSo that seemed to be kind of a recurring thing.\nI want to draw your attention to other material we have in our folder today we've got a letter\nfrom the Georgia Forestry Association and a flyer from them where they are requesting\nthat they have their Board of Registrations moved from the Secretary's State's Office\nover to the Georgia Forestry Commission.\nis a existing bill alive to do that. It's House Bill 53 that was introduced in 2023.\nSo that's in there for your consideration. I have a recent, so let's look at this email\nand it's kind of redacted so it reveal any personal information. But as recently as\nend of October. My office received an email. I'm going to read it to you for the record.\nI own an occupational medicine practice in Bonair, Georgia. That's my district. I'm trying to hire\na PRN nurse practitioner who is a military spouse. She has been trying for months to get her\nNPE nurse practitioner license transferred from Ohio to Georgia, but has not been successful.\nI've heard you speak at eggs and issues and other events about the frustration around the transfer of license from another state\nThe Canada is beyond frustrated and feels as if the state is giving her the runaround as to what is needed to complete the process\nIf you have any guidance, it would be appreciated\nSo we're working with this constituent to try to get that issue resolved\nBut I get this type of request\nYou know, probably about every other month.\nSometimes more than one month,\nthis kind of a common request,\nand I'm sure the other senators do this, do likewise.\nJust to kind of finish going through what's in the folder today.\nRepresentative Chuck Martin,\nI hate to brag on the House member in the House bill,\nbill and especially, but he passed House Bill 155 in the 2023 session. It's really good\npiece of legislation. I've got an idea of how we can maybe make it even better. That's\nwhat the Senate is here for to make house legislation better. So we'll talk about that.\nAnd then lastly, I thought this memo from FGA, and I forget what acronym stands for, honestly.\nBut foundation for government accountability, foundation for government accountability is\nprobably right there.\nAnyway, I think this cap capsulates, if that's the right word, Counselor correct me if I get\na lot of what I hope we can achieve legislatively from the study committee, some of it is maybe a\na little beyond what we want to maybe tackle at least today, but the number one recommendation\nthey had, the foundation for government accountability, very prominent national organization that\nI'm very familiar with, obviously, they suggest we recognize out-of-state licenses and\nReally House Bill 155 actually goes a long way to do that.\nI think that we did good work when we passed that.\nRecognize out-of-state work experience,\nreduce licensing fees is another idea\nthat I think makes sense, sunset licensing boards.\nI think the the recognize out of state work experience number two also to me ought to apply to recognize military credentialing and military work experience.\nBut that's\nThe information we've included for you today\nDo I have any questions or comments from the committee members at this point? I've done a lot of talking\nSenator Ann Brittar you have anything you want to add? Yeah, it's just\nCan you hear me, Mr. Chairman?\nWe'll hear you very well.\nThank you.\nWell, first I just want to thank you in the committee for I think doing all this work.\nI think there's a lot of important information here and I think beyond the importance of the information.\nI think it's the intentionality that we find ways to support small business owners entrepreneurs.\nBut for me I think personally the biggest takeaway is that with the workforce crisis and the constant increase in costs of doing business in Georgia because of the national global economy and inflation.\nHopefully we'll see some legislation and some policy work and maybe even some rule changes with some of our state agencies to help.\nI think some of the folks that we've engaged with heard from and talked to, I think this\nis an opportunity to give those, you said this in the beginning of your comments, you\nknow, an opportunity for those that are in poverty or blue collar workers and others\nthat are working hard to, you know, make ends meet, put foot on the table, take care of\ntheir families, I think an opportunity for us to kind of lead and provide opportunity\nby eliminating unnecessary licenses or, you know, fees or taxes or other things that may\nget it in the way or even just the approval process for some of these industries that go\nthrough.\nAnd I think whatever we can also do to support, honorably discharged veterans are being\nlooking for new careers and wanting to do new things outside of the world that they\nare accustomed to having maybe served in\nand worked in here in America or abroad.\nI think this topic of occupational licenses impacts\nthose group of citizens and families across Georgia\nmore than we think, and Senator Dugan understands that\nand others, so I just wanna say thanks\nand hopefully out of this we'll see some positives\nthat we can do to impact many of the citizens in Georgia\nin the weeks and months to come.\nThank you, Mr. Chairman.\nThank you.\nAll right, regarding the report\nbefore we get to the recommendations,\nwhich will be included in the report,\ndoes there any of the committee members?\nAnd I know this really in very fair\nbecause you just got it, but the else,\ny'all see anything you need to add, delete anything like that.\nEarly captain. Um, I think you might want to have a speed of\nthis stuff that was also provided. Um, right. And I'll do that\nif y'all are okay with me doing it after the fact. I do think\nwe're going to be required to vote on this report today. Our\ndeadline is December 1st. So you can. And I'm pretty sure\non this, you can do this like attachment one, attachment two, but you don't have to\npre-live it all and you can just say, and it goes in patchments and then it's a good idea, is that?\nWe didn't make like a nothing that small of that information. That'd be awesome. Good idea. Thank you.\nSo the only thing I guess on page 10, and this is just a, you know, just me, I guess, but\nmost of these things have a heading, it seems like I was just that last committee, I guess\nthat's under the practical strategy. So maybe that fits like that.\nI think that would read a little easier maybe.\nWell, I guess what I was talking about is that very last paragraph on page 10 may be put,\nyou know, request a recommendation from Samsung as a heading.\nis the survey and mapping society of Georgia just so it just gets kind of lost to me and\nthat you're okay with that just keep me straight on this okay but I'll do if you're okay\nwith that will do it. Well, I just, y'all help me say the right stuff when we go to vote on this\nbecause I guess we're going to amend it with some recommendations anyway. Try it. Okay, so let's get\nto the recommendations. I'm sorry. Okay, we're going to modify this thing. The distributor error,\nbut we're not going to modify it. You've got a page nine. You look up on the end of the\nthat burden the character on to get down to the boards\nthat have collapsed were in the home of Fort Lawn.\nI think that should be the key in there.\nRight, I've got to come out of it.\nIf that were down again, I wouldn't know something about it.\nBows, but yeah.\nSo you have to agree through this time.\nAnd you read fast.\nyou read fast. So we got that, you found that, okay. Recommendations and these again are\nmy ideas and it's open for discussion, debate, amendment, whatever. And we had a scrivener's\nhere two on number three. Number one, it's past Senate Bill 157, and I'd like Senator\nStrickland to remind us what that is and where the past year is on that.\nYes, so that bill passed the Senate, I believe it was 55 to zero. This past session and still\nsits in the house, it made it out of the house. Just here, he committee did not make out a rules\non the last day for a floor of it. But that bill is the one that deals with how criminal records\nare treated when it comes to occupational licensing boards. And one of the big things we heard going\nback to the theme of all this is the idea that sometimes what I would also say not just sometimes\nare lower paid workers, but your most vulnerable people that are sometimes in bad circumstances\nthat then have to deal with navigating a process that even if it's not overly burdensome,\ncan seem so burdensome that sometimes they even try to work in certain areas and 157 deals with\nhow your past criminal history is treated by awards and we had the committee go through,\nwe had the bill go through the committee process last year, the best testimony we had was\nindividuals who had previous mistakes they made and they're trying so hard to now move past that\nand bring their really bring generational change to their families by not just being a product\nthe criminal justice system, yet they get this wall. And many times they don't even know how\nsomething I did 10 years ago will impact me. So Wago get trained, why invest money to become an\nelectrician, whatever it is. And if I'm going to be told no because mistake I made 10 years ago.\nAnd so that bill makes it where every board is only going to consider certain offenses that are\ndirectly related to the certain industry and the public safety, for example, someone that\nthat had a past U.I. might still be an electrician,\nbut someone that has a history of stealing from people\nprobably shouldn't be working in nursing home.\nAnd so it creates a standard we're really gonna make sure\nthat we know that the criminal offense\nis directly connected to the industry\nthat someone wants to work in.\nAnd maybe that's a great part of the bill.\nMaybe the best part of the bill is that now\nevery board's gonna publish which offenses\nkeep you from working in certain areas\nand individual can get what we call a pre-clearance\nwhere you can go in a plough before you get training\nto a board to see how your criminal history\nwill impact you when it comes time to get a license.\nSo again, that bill passed a Senate\nand I think we've got support in the house.\nIt just got wrapped up and like a lot of our bills\nand day 40, all the back and forth\nthat kind of got lost and shuffled.\nSo hopefully we'll get that done quickly this next year.\nSo will that go back to the house judiciary or?\nI believe so, who about to the committee\nthat it came from?\nI believe that's still the process.\nOkay.\nSo back in the house, just sharing committee.\nIt's not 10 degrees and disagree.\nNo, it didn't get that far, OK.\nThank you.\nNumber two, implement changes requested\nby the Survey and Mapping Society of Georgia,\nalso known as SAMHSAG, and supported\nby the Georgia State Water Registration\nfor professional engineers and land surveyors.\nI don't remember exactly all the details\nof their testimony, but basically, they took the initiative\nto come forward with a proposal to streamline the experience.\nFirst of all, to allow testing, change the timeframe\nwhen people can do the test test, which is,\nthey can do the test right after they finish their education\nand don't have to wait for all the field experience\nto then take the test after maybe they're a little fuzzy\non some of the education piece.\nAnd the other was to reduce the number of years\nthat they had to have field experience.\nAnd it was like a kind of a matrix based on\nwhether they had a high school diploma\nand a social degree or a four year college bachelor's degree.\nbachelor's degree. And this is the industry itself, including the board, the licensing board,\nproposing a solution because they see such a problem with getting people to come into their\nfield and stay and such a workforce shortage. So to me, that's an easy thing that we can do to\ntry to accommodate this industry. There may be some interest once we start this from the\nprofessional engineers to do something similar, so I'm so I'm told. So we may end up\nwon't include them in some legislation. Any discussion of that or questions?\nI'm just reading the background of what they're proposing here.\nWe're on survey and mapping.\nI think you're looking at Georgia forward.\nI'm good with that one.\nI think the survey mappings, non-controversial and sort of almost an internal issue that, you know, I don't see any pushback there.\nBut I've been surprised sometimes the full four.\nI'm sure I will be again probably here.\nMoving on, number three,\nthis is the one on the Georgia Forestry.\nAnd there's a letter and a flyer in the folder.\nThere was a bill introduced in the house.\nThing is, house bill 53, it's still in the house.\nI of course represent a lot of forestry area\nand I would like to accommodate their request.\nI think it makes a whole lot of sense.\nI mean, the Georgia Forestry Commission\nis amenable or agreeable to doing this.\nSo I've talked to director Laumour about it.\nAnd he said as long as the funding,\nthe license fees come to his agency\nwhere he can administer this.\nHe's happy to do it.\nHe's appointed by the governor.\nI assume he's talked to the governor about it.\nBut he has testified, you know, not in front of us, but in front of a committee that he's\nwilling to take this on.\nHe's not lobbying to take it on, but he's willing to take it on.\nI think it's a hacker characterization.\nSo I think there's a lot more synergy having them under the Georgia Forestry Commission\nthat where he's dealing with people that understand what\nforsters do and what forstries about.\nSo I would make that recommendation.\nYou all can.\nWithout having 53 in front of us, as long as they're not doing away with the board,\nthey're just moving where the board is housed.\nI don't think they'll have as much of an issue.\nWhen I first read it, it looked like they were doing away with the governor's appointed board.\nBut that responsibility now is like,\nand that's not going to go over well.\nBut if it's just moving the board.\nJust moving the board is understanding.\nAnd I say you worded your recommendation\nto you didn't mention the house bill even, sir.\nAnd again, that may not be anything that we would act on\nin the Senate until, you know,\nwe see what happens with house bill 53.\nBut I think it makes sense they're frustrated\nor they're at, frankly.\nNumber four, this is sort of just real broad.\nBut it gets to the crux of a lot of what we've heard\nin the testimony and what we've discussed.\nWe have a good many licenses on our books\nthat almost no other states require, we have a several that maybe say three or four states\nother than Georgia requires. To me, when you're an outlier like that, you should give you\npause to look at why are we doing it different than everybody else. And so this is just sort of a\nbased on the Supreme Court case on the lactation consultants that Jackson\nversus Raffin's burger where they said the government bears the burden of\nproviding a legitimate interest or reason for a license under the Georgia\nConstitution. I think we ought to just as a sort of a kind of guiding principle\nsay that we like to sunset licensing requirements where the license is not proven necessary to protect the public health.\nPublic safety or public welfare, you know, consumer protection, safety, that kind of thing.\nAnd then I gave some examples of types of licenses that at least I have in mind,\nthat might fit that category. That would be up for discussion and debate and more\ncommittee hearings and more testimony, but a low-voltage contractor\ninstalls phone systems, security systems. I mean, you know more about this than I do.\nI think only three or four states license that why we do, I really don't know.\nWe heard Tesla money from the lady saying all she wanted to do was open up a shop to do makeup.\nShe wasn't going to cut hair or, you know, color hair or anything like that.\nShe has to go through the whole cosmetology licensing process.\n1500 hours of experience.\nLots of money to go to school. I mean, I think lots of money.\nmoney, $20,000, $30,000, and we have people doing that at\ndealers or maces that aren't licensed, and people do it at home\nthat aren't licensed, and people can do it on a movie set\nwithout a license. That's just some examples.\nAny heartburn with that? Questions? Concerns?\nAll right. Number five. Early on, the first meeting we heard from Gabriel Sterling\nwith the Secretary of State's office, he talked to us about their modernization initiative where\nthey have implemented new software and a new system to more efficiently manage the\nlicensing process. He talked about some funding needs there and I think there are you can make a\nlegitimate argument that they don't have the financial resources to properly do what they\nare required to do. Our state now is almost 11 million people. A lot more people applying for\nlicenses or new in licenses and we haven't kept up with the times financially or with technology.\nSo that's my attempt to indicate that I would be supportive anyway of hearing what their\nbudget needs are to and seeing what kind of return with the state would get if we were to\nappropriate that. Anything there? Number six, that's really the sort of the same thing.\nJulie Annas here, she represents some of the nursing groups, but I've heard for years and years\nthat the nursing board is understaffed. The people they have are they can't retain\nemployees because they are not paid market adequately and that's part of the backlog on the nursing\nlicensing. So I think we need to, from an appropriation standpoint, look at that and be open-minded\nto allocating more resources to that same thing on number seven.\nNumber eight, and this gets kind of to the email I received from a constituent\nand problems we hear over and over, and I may call on Juliana to speak to this,\nbut nurses are licensed by the nursing board if they're an advanced nurse which\nmeans they have an advanced degree like they're a CRNA or they're what else\nJulianna, sorry.\nSo these advanced educated nurses with advanced degrees were under a protocol agreement with a licensed physician and do they are able to do more than a nurse that doesn't have the advanced degrees, because they're working under the supervision of the physician.\nwell I get the license with the nursing board and then they've got to get their protocol agreement\napproved from the composite medical board and it can sit there literally all for six months, a year\nand a lot of times they have trouble getting a status of what's going on with it or that you know\nthey finally get somebody and they say well you missed you didn't fill out this rider that and it\njust goes back and forth. It just seems real, real problematic to me. My idea for a solution\nto this, and again, there probably is a better idea than this, but this is mine now. I'd like\nto have some robust discussion and debate on this topic, and I'd like it to be in our recommendations\nto generate that, but I think after they submit a fully completed, totally completed application\nto the composite medical board, they ought to be deemed after 30 days they ought to be deemed\napproved and be able to go to work. They're already licensed and they have oversight from the\nthe nursing board already, the physician is already licensed and has oversight from the\ncomposite medical board. I don't understand really why the protocol agreement even has\nto be approved at all, but this would at least give the composite medical board 30 days\nto respond if there's an issue. Otherwise, they should be able to get a word. They could\ndo it as a provisional license if they wanted to.\nI mean, I don't have all the details in my mind\nworking out, but yes, sir.\nTwo questions, Chairman, from me.\nOne, I thought Gabe said something about\nthey were going to an online application process\nthat was being phased in.\nI think he did say that.\nWhich should speed up that process.\nThat was a phone call.\nThat was it for the 8th floor, and once you get that.\nJilliana, would you mind to go to the podium and?\nI'm Julie Anna McConnell, and I represent United APRNs, and I will also\nrepresent it for the Dean's and Directors Association and Georgia nursing\nleadership coalition. Yet what the Secretary of State\nsince the APRNs, right now they receive an authorization to practice.\nYou know, we had legislation that would, that would instead of an\nauthorization, they would get a license where only one of 11 states do not\nissue an APR in license. There was some concern with the governor's legal\ncouncil that there was not adequate implementation moving from that\nauthorization to a license or license. So the author of the bill, Senator\nHustler asked the bill that the governor vetoed the bill. So we're working on\nthat right now and working with the Secretary of State's office. But what\nbut they're talking about the Senator Diven,\nthat would be the APRN license,\nonce we get a license,\nare even right now the authorization to practice.\nBut when they, that's for them to get their APRN,\nbut then if they must have a protocol agreement\nwith a position,\nand that if they're going to get that also enables them\nto get like a DEA number,\nso that they can write prescriptions.\nOkay, that protocol agreement is the one\nthat must be approved by the composite medical board.\nAnd you are correct, we have backlogs.\nWe have examples of going from six, seven plus months\nbefore that particular, the protocol agreement\nbetween the APRAN and the physician.\nAnd so that's where a center walker is referring to\nwhat's that APRAN and that physician wants\nthey prepare their protocol agreement.\nAnd in that protocol agreement,\nthat enables the physician,\nthey give that APRAN, for example,\nthe ability to write radiographic imaging orders,\nthe authorization to write prescriptions.\nSo they can only do that if it's included\nin that agreement between that physician and that APRAN.\nAnd the majority of the time too,\nthey must pay a minimum monthly amount to that position for that, for that protocol agreement.\nAnd that is the, and so you got, they're, they're getting an approval from the Board of\nMedicine and they're also getting their, their approval to as a advanced practice nurse\nthrough the nursing board. So they're really working with two different boards. So where\nwe're trying to, I think Senator Walker was saying once that, that position in that APR\nin that if they come together and they approved the protocol agreement then to allow them\nto not that they could be filed with the board of medicine, I think is what he was recommending.\nBut right now it must be approved by the board of medicine.\nSo is there any other questions?\nYeah.\nI didn't have as many questions as I have now.\nI'm sorry.\nDid you just tell me the APRs have to pay to do their job?\nIt's for a protocol agreement with a position\nif it's in certain situations.\nThey yes, they can have to pay up to like,\nI've heard them $1,000 or more per month\nwith that position.\nTo have the physician agree to let them do their job.\nYeah, and with the position with that protocol agreement,\nthey authorize them because they're working\nunder the supervision of that position that the physician is then required to review and sign off\non 10% of their medical charge. So in a month's time if they see however many patients that AP\nare in does see in a month and they must approve 10% of that position must approve 10% of them.\nThey don't actually see in most of the times they do not see that patient but they sign off on the\nthe 10% of their records.\nOkay.\nAnd it's a little confusion because we have in the statute there and that's also another\nthing we're trying to, you know, eventually look at an examine because you have an APRN\nlike for example, my husband had several years ago, he had a kidney stone.\nSo we went to a clinic in Biford, Georgia, okay.\nand there was, like the APO in there.\nNow, there was not a position,\nit was late Friday afternoon.\nOkay, that nurse practitioner could write the order\nfor him to have a CT scan.\nYes, you've got a kidney stone.\nOkay, he's in terrible pain.\nIt's that he's probably gonna be in a lot of pain,\nbut he'll probably dissolve by Monday.\nBut I can't even give you one prescription\nbecause I can't write schedule two.\nNow, he could write like an antibiotic,\nbut not schedule two, like a hydrocodone\nor whatever, some kind of pain medicine.\nSo we had to leave Beaufort and drive all the way\nto the immigrant clinic at Blowery Branch,\nI mean, not Blower Branch,\nand about 20 miles, 30 miles away,\nand spend the night in the emergency room.\nNow, when you have the nurse practitioner or APA\nand the hospital, they could,\nbecause the physician is there\nand they're working under the oversight\nof that position in the hospital,\nand that falls on a different code section.\nThen they did not, they immediately started him\non a pain medication.\nThat, at that time it was the PAs and the APORians\nhave comparable scopes, right?\nAnd comparable barriers.\nThat's the reason we were working jointly with them.\nBut because that PAs was in the hospital,\nimmediately started him on medication on pain meds,\nand then we spent the night.\nSo we had to spend 30, 45 minutes getting there\nand paying for another CT scan,\nI'd not in the emergency room\nbecause that PA could not write a schedule two\nthat was in the clinic with a physician.\nAnd that's kind of a side note\non just the kind of barriers that we're facing right now.\nBut right now we're talking about even getting started\nan APRAN and we have right now have a legislator\nI'm working with that has a daughter\nthat just graduated, okay, they got their APRN,\nthey met all the requirements,\ngraduated to become an APRN,\ntook them six weeks to get their license\nat the Board of Nursing.\nBut then they have to, once they get their license,\nif they're gonna be working in certain situations\nand they need a protocol agreement with the physician,\nthen they have to get that approved\nby the composite medical board.\nAnd that's where right now it can take,\nWe've actually had, we've got a stack of issues coming from AP audience with a lost jobs\nbecause it took them six months to get that protocol agreement approved by the composite\nmedical board.\nSo, that's the reason we need to look at something to where we can make that shorter.\nAnd if the protocol, if your protocol agreement is with Dr. Smith and Dr. Smith retires and\nthe nurse goes to work with Dr. Jones, they got to go through it again. And so she can't\nshe can't work or to work to her full scope while she's waiting again for that protocol agreement\nto be approved. I have one. I don't know. We don't go too far down this road. I guess here, but\none question I would have is what is the composite medical board? What are they looking at?\nwhether or not they accept or reject protocol agreement. What's the standard they're looking at?\nWell, one of the problems I understand they're having right now because it's going from like a very\nshort form. Now it's like a multi-page very complicated form actually complete. So I think we've\nheard that when they complete these forms only about 25% of them are completed correctly the first\ntime because, and you're talking about nurse, APRMs who have master's degree, some of them\neven doctorate degrees, that the form is so unerous and so complicated to complete that only 25%\nI'm completed the first time. Then I've got to come back and correct the completion of it.\nThere have been some issues also with the protocol agreement that if you are a nurse practitioner,\nlike if you're, you've got to have also supervision in the area of what you're, what you're trying to work in in your area of expertise.\nSo sometimes that is a reason that they may come back and say, no, this protocol agreement, this physician is cannot be your supervisor, you cannot have a supervisor.\nbut it's just and I think it's just also just the maybe the resources there that just it's just\njust like the Board of Nursing it's not that complicated process with the Board of Nursing\nhopefully now too once this is automated it's going to expedite the process but right now it's\non average taking four or five and six weeks just to get that APRN either new license or renewal\ncompleted and it's no, the people that we work with at the Board of Nursing are excellent\nand they do a great job. There's executive directors doing a phenomenal job. It's just they don't\nhave the resources available to meet those numbers and getting those licensed, either renewed\nor new license administer. So it sounds like there is a benefit to having the\ncomposite medical board review these agreements. It's just a matter of how long it's taking to get\ndone right now and is that you're not advocating that we no longer have them reviewed because\nsounds like you said about 25% of them at least have issues with how they're done not done correctly\nand so it's I mean I don't think nobody's advocating necessarily give her that process are we?\nWell I think like central Walker said I think this is something we really need to\nto really sit down and take a look at it that and because it why is it though\nif there's an agreement when you have a medical physician, okay, a doctor, and you have an\nAPorian who has a master's and doctor degree. Why they can't also look at the look at the form\nitself. Sure. It should be it should be able to complete a form between these two professional\nindividuals and then where maybe like he said with a 30 day just in case there's an issue doing\nI don't know, background check or whatever, but it should be able to that position and\nthat nurse practitioner be able to come to fill out a form and a supervisor form together.\nI don't want to run this too far down the rabbit hole, but my understanding is these are all\nhard copy documents that are sent to the composite medical board.\nIt's stuff on a form that is on paper that is sent as a packet.\nIs that true or not?\nI will have that was my understanding, but I cannot for a fact tell you that it that is not automated. That's why I'm back to what I was talking about a little while ago, but doing it online, you know, when you're on your daily Amazon purchase.\nAnd you leave something out of a column. It says stop. You can't go ahead.\nAnd so I'm thinking is even that would help speed up the process so it's not that you miss checking a box on a piece of paper.\nIt's a required spot in the online tile that won't let you proceed unless you do that.\nTo me, I agree that would be extremely helpful and speed the process, but to me it's not a dig and this is not unlike the study committee I served on with you when I first got elected where we were.\nlooking at DBHDD and a DCH and all the duplicative oversight and all the confusion and calls that\ncalls. To me, you've got a license nurse that has already had a background check or she\nwouldn't have been able to get her license. You've got a license position that's already\nhad a background check. He wouldn't be licensed, hopefully if he had done something wrong.\nreally it's a private agreement essentially\nbetween the doctor and employment agreement\nbetween the doctor and the advanced nurse.\nAnd I don't know where the state's role is\nin improving that employment agreement\nas long as they are acting within their scope\nand practice and their license.\nTo me, it's like the composite medical board,\nI can see why they wanna have it on file\nin case an issue arose with a physician or nurse\nto say, who all is this person working with?\nBut I don't, the approval process,\nI don't see a whole lot of value in it.\nIf a doctor is not, doesn't match up right\nwith the skill set of the nurse,\nI mean, to me, that's a,\nthey're setting themselves up for a big time lawsuit,\nprobably. I don't know. I don't see a lot of value in it. And I think it needs to be. But I do think\nthis is an issue we could have a several committee meetings on and bring the composite medical board\nback in and really has this thing out. This may not be the right way to put it on our radar, but\nI'd like it to be a topic. There's something I'm very interested in trying to improve,\nand I agree with you. On the surface to a layman, it doesn't make sense to me.\nBut I would like to see why they've been doing it. And if we're going to actually fund it by\ndoing away with it, then we just adequately funded it right there because they no longer exist.\nSo, well, I'm not suggesting doing away with the composite medical board, just the responsibility.\nThis would make something.\nJust that one, just that one outside.\nThey've still got all the positions to look after.\nLet's put it on there.\nWe will, we will be fully informed by the conversation started.\nThe number nine might be too ambiguous and too far-reaching or so ambiguous that it could\nbe far-reaching, but I just put it on there because I like the terminology universal\nrecognition.\nI guess.\nYou're talking about like composite bullets or what do you call them, the articulation\nagreements with other states that, uh,\nreciprocal, the second compacts.\nLet's start with the same.\nYes. That's a part of what I'm.\nYes, sir. Uh, there's one way to do it.\nOkay. So number 10, number 10. Uh,\nI think what I wanted to talk about on this one is we heard\ntestimony, so House Bill 155 goes a long way to allow for requiring expedited licenses\nfor military, military spouses, and then licenses by endorsement for everybody else that moves\ninto Georgia and has a very similar license in another state, but it gives them 90 days\nto issue their license. I would like to see us go to 30 days after 30 days once all the requirements\nare completed because to me even 90 days is too long and I have to wait to be able to go to work.\nThe biggest pushback I think I heard when we were in Macon was what we're having to wait on\ncriminal background checks and it's we got to go through a federal some sort of bureau\nthen it's taken you know 45, 60, 90 days to get it. My solution to that or my suggestion to that\nis have the person on the application include a sworn affidavit in front of a notary saying that\nthey have no criminal record and if the background check comes back otherwise they can revoke\ntheir license. But I think there's a pretty straightforward, you know, if you falsify something\nunder a sworn affidavit, you could be, you know, held criminally global for that seems like to me.\nSo that would be how I would address that issue.\nJump in, man.\nYeah, I mean, we're not getting it done in seven months now.\nAnd you're wanting to take it for three months to a month.\nYeah, it sounds good.\nI just don't know how you're going to get from point A to point B.\nAnd we've said consistently that if it's not for the help\nand safety of the Georgia citizens and review it,\nI'm looking at that headline in the paper\nwhere new practitioner under the guidance of a new Georgia\nlaw passed by so and so,\nwent to work after falsifying their comments on a,\nI mean, they're both made a criminal act saying that they didn't have a criminal background,\nwhich I can see where those two could possibly happen hoping that they don't get caught\nand then something bad happened.\nSo I want to, I would rather give them a hard stop 90 day deadline on this thing and say,\nlook, you got 90 days.\nWe are going to fund you.\nwe're going to give you the resources, do it,\nbut you've got 90 days.\nAnd after that, it's on you to see how they go that way.\nBut I've just taken it from seven months to a month.\nOK, so what I am in number 10, what I'm talking about,\nso you have a copy of this in your folder, HB 155.\nAnd if you look, I highlighted on page three, the 90 days on line 67, but if we move up\nto line 49, it excludes firefighters, I don't really know why firefighters exactly,\nbut it excludes firefighters, healthcare providers, and low enforcement officers.\nSo this is talking about occupational licenses other than firefighters, health care providers\nor law enforcement officers and health care providers is defined on line 19.\nAnd it includes physicians, optometrist pharmacists, counselors, social worker, registered\nnurse, advanced nurse, EMTs, all of that.\nSo we're talking about licenses other than health care\nand law enforcement.\nAnd it have to have a license in another state that's\ncurrent and being a good standing as well.\nBecause I understand what you're saying.\nI do think we minimize that risk by splitting people working\nin health care and law enforcement on our providers too.\nWe also minimize that risk with having a current license\nin other state, but there is still the concern.\nI think that that you've had the state background check,\nI remember around this, but then the federal\nis the fingerprint base running a run that's federal\nthat would catch everything.\nAnd that's a concern is not having that available yet.\nBut she bragged about their average turnaround time\nwas 14 days or something like that.\nBut that's not what we hear from constituents.\nSo I don't know, I'm a 14, I'd have been in the number,\nbut it is way less than 30.\nOur fighters are cousin of the CDL license.\nIt's a three past four years ago.\nChange there, send it.\nOkay, I'm all about million forward.\nI just don't wanna pass a law that's a\nunattainable. And think you're being realistic and pragmatic. That would be the first time for me, but the, but I also understand that we're not passing this bill on the floor today. Right. We're putting together a framework for further more detailed discussion by broader body to look at.\nlook at. Yes. So it's not one of the things I'm going to jump up downside. Now I'm going to\nsupport that. I agree. Okay. Well, thank you. And I added an 11 as we were going through the report.\nAnd again, this is really just something I kind of want to look into. It doesn't even have to be\nin the recommendations because I can do it as a senator anyway. But I think what they're doing in\nVirginia, what Kaiser Permanente they talked to us about is worth exploring to see if we\nwant to have a version of that. In Georgia, it's called the Military Medic and\nCorp. Program MMAC Program. So my number 11 I guess would be consider adoption of a VA-type model\nof the Military Medic and Corp. Program.\nThat was in here, it's in the packet.\nYes, sir.\nSenator Amertari, you sleep.\nMake him turn his camera on.\nYeah.\nAre we going to go to the floor of the Senate debate all this?\nYou have a motion. I have a motion in due path to adopt the report whenever the chairman is ready\nAll right, I have a motion. I'm wide awake\nI have a second. I'll second. I have a second any further discussion\nThank you all y'all been excellent to work with so now we're both\nAll in favor, sitting by by saying hi.\nHi.\nHi.\nAny opposed likes on.\nAll right. Thank you very much.\nWe got it done.\nI enjoyed working.\nGreat job.\nThank you.\nAll right.\nSo the now we'll adjourn the meeting.\nHe'll be turned this camera.\nYou\nYou\n",
  "updated_at": "2026-02-12T01:49:54.447939+00:00"
}