{
  "video_id": "fwOdIcpH-NM",
  "url": "https://youtu.be/fwOdIcpH-NM",
  "title": "Georgia House - Day 9 (2026-01-31)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-01-31",
  "duration_minutes": 40,
  "summary": "Here is a summary of the Georgia House session on 2026-01-31:\n\n**Overview:** This was a routine legislative session with the House conducting standard business, including bill introductions, committee reports, and procedural matters. No substantive legislation was highlighted in the transcript.\n\n**Key Actions:** No major bills were passed or referred.\n\n**Bills Introduced (First Reading):**\n- **HB 853:** Relating to motor vehicles and the retaining of personalized license plates\n- **HB 854:** Relating to general provisions for applicable counties and municipal corporations \n- **HB 855:** Relating to educational programs in Georgia\n- **HB 856:** Relating to establishing a state charter school commission\n\n**Notable Moments:**\n- The session opened with a prayer and Pledge of Allegiance led by a guest chaplain, Rev. Larry Glover, who was introduced by Rep. Rick Williams.\n- Rev. Glover's prayer emphasized the importance of wisdom, justice, and moderation in governance.\n\n**Votes:** No recorded votes were mentioned in the transcript.\n\n**Attendance:** The transcript indicates a quorum was present, with all members reporting to the chamber.\n\n**Adjournment:** The transcript does not provide an explicit adjournment time. The next session date is not mentioned.",
  "transcript": "You\nThey are convening having arrived, all members of this House will please report to the floor\nand take seats, all members.\nto the floor of the house.\nAll members of this House will please report to the floor, Mr. Clerk ring the bell.\nWe are now going to have the morning roll call. All members present will please vote green\nto signify their presence in the chamber and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the machines\ndoorkypers will please close the doors and keep them closed. Well, good morning. Happy Friday.\nWe made it till Friday, Super Bowl weekend coming up.\nI hope the Lord lets me live long enough to see the Falcons and it one more time, but\nI don't know.\nWe will begin our day with Scripture reading in prayer by the Chaplain after which we will\npledge allegiance to the flag of our country.\nchaplain this morning will be introduced by the gentleman from the 145th House District\nRepresentative Rick Williams, Representative Williams.\nThank you, Mr. Speaker. Good morning. Gives me great pleasure to not only bring a pastor\nto you this morning, but also a friend, more like a brother. Reverend Larry Glover walked\nhim my office in 1976 and said, I'm here to help you run Amlitt's service. I had just\n24 years old and got the contract to run Amlitt's service for Baldwin County. He was a student\nat Georgia College. We were both kids. Didn't have a clue what we were doing. But we worked\nseven days a week, 24 hours a day. Larry, not a stranger to the Capitol. His father\nThere was Jim Glover, who was a warehouse manager for Tom Erwin when he was over the Department\nof Agriculture.\nHis niece Shannon Wallace is a district attorney over in Cherokee County and Larry and I\ncould probably write a book and make a couple of movies over the ambulance calls that we\nhave run together in CPR and wrecks and drunks and even had a few died from lead poisoning\nand he wasn't drinking lead, it was a shooting lead.\nBut anyway, I'm just honored to present him this morning.\nThank you all for being here.\nThank you, Mr. Speaker.\nI'm supposed to say, Representative Williams, but I'm not.\nI'm going to say Rick because he is my brother.\nAnd thank you to the mums of the house for allowing me to be here today.\nWhen I was a boy, my father's office was across the street in agriculture building.\nThere was a guy named Mr. Forward that was with the building authority.\nAnd if Mr. Forward found out that Dad was bringing my brother and I to Atlanta, he came\ngot us and he brought us over to the Capitol.\nI was able to walk in when you were not in session in this room and never had any idea that\nI would be able to come and speak before you today.\nNow on one of those trips I went into an office here.\nThe gentleman was in a wheelchair, and he was our secretary of state.\nHis name was Mr. Ben Forson, and since I was only about 40 pions then, Mr. Ben picked\nme up, set me on his lap, and pointed to a lover sofa as I remember being in his office,\nand he said, let me tell you about the day that Georgia had two governors.\nHe said, I slept right there on that sofa and slept on the state seals so no business\ncould be taken care of.\nHe pointed out the features of that state seal and there are three words in there, I want\nto bring to your attention today, wisdom, justice, and moderation.\nSome ladies, I've got good news for you.\nYou've got someone you can depend on.\nHis name is God.\nFirst of all, wisdom is knowing the right way, knowing what to do.\nWhen Rick was first elected, I saw him trying to learn the ropes.\nHe asked a lot of questions.\nHe's made a lot of friends and I've got to stop and say that I am very proud of him.\nAnd our work together over the years has been one thing that we've tried to do, look to\nthe Lord, do it right, do what He would have us do.\nJustice is not only knowing the right thing, but doing the right thing.\nThere's no gray areas.\nIt is said of King David in Scripture, and David reigned over all of Israel, and David\nexecuted judgment and justice to all people. Doing the right thing. God gave us a\nstandard. It's real simple. The laws that you passed today are based on the laws\nthat God gave us. It's found in Exodus 20. Ten little verses is called the Ten\nCommandments. Do wash right. And then the last word today in our state motto that\nis guided this nation to greatness, to be a shining light in the United States of America\nas to what a state should be is moderation.\nI like to say that moderation is living the right way.\nWhen my father brought me to the Capitol and in his whole life, he always tried to teach\njust now look. There's somebody watching it. He would try to teach us, now son, your\nword is your bond. He taught us that there is one way to live, and that's the right way.\nI walked in the door this morning, and I could hear His voice. I walked in the door this\nmorning and I had so many memories of so many things that's going on in Georgia and I've\ngot to say that this house of representatives is one of the strongest that I've ever seen\nand I'm proud of you.\nLet's continue to live our lives in such a way that when our grandchildren, our great-grandchildren,\nAnd when history says that you have done a good job and you have done the right thing,\nlet's pray.\nLord God, we come before you today to ask for your strength, your wisdom, your guidance,\nAt everything we accomplish this day, we will bring glory and honor to you, blessings\nto this state, our nation, and the people that have sent us here.\nProtect us, O Lord, provide for us, and keep us in your will, for we pray in Jesus' name,\namen.\nI pledge allegiance to the flag of the United States of America and to the republic for which\nit stands, one nation under God, indivisible, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nAnd as is Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct.\nChairman Hogan, the Chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is not and the journal is confirmed.\nThe clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, on the 59th, who is following me, establishes the order of business during\nthe first part of the period unanimous consensus, introduction of bills and resolutions, first\nreading and reference of House bills and resolutions, second reading of bills and resolutions, report\nof standing committees. Morning orders. Is there any objection to the adoption of the\nresolution establishing the order of business for the day? The chair here is\nnone in the resolution is adopted. First reading of bills and resolutions, the\nclerk will read. House bill 853, by represent 9 to the\nhundred thirtieth quarter of them. Summary fourth, purple, a hundred fifty-fifth,\nmeets them in 78th and rose learned 20th.\nHe'll be taught in active men article three.\nChapter two, total 40, the fish go to Georgia.\nAnd attend a relaying of prestige license plates.\nMotor vehicles.\nHospital A54, by the center of Routledge,\n109, followed 30-second petrily, the 160-60,\neven zone 64th of Clark, 147th.\nHe'll be taught in active men chapter 60,\na total 36th of the fish go to Georgia.\nAnd it's related to general provisions\nof applicable counties and municipal corporations.\nGovernmental affairs.\nHospital A55, by the way,\nWe now are 119 chaspers.\nThey 11th gains and 117th McCollough,\n33rd reads and 34th and others.\nThey'll be tunnel act to amend part three\nof Article six of chapter two,\nTitle 20.\nThe official go to Georgia,\nAnitator relating to educational programs.\nEducation.\nHouse bill 856 by representative Sharper,\nthe 177th,\nthey'll be in tunnel act to amend\nand act to establish a system of public schools\nwith City of Al Dosta.\nIntergovernmental co-ordination.\nHouse bill 857.\nReps and Apollo 32nd, call 33rd, Jasper City 11th.\nIt will be Todd on active men, Chapter 9 and Todd on 12th.\nThe Fisher go to Georgia and Interior, we're relating to prevention and control of air pollution.\nNational resources and environment.\nHouse bill 858.\nReps and the Clark on the 51st.\nWilson on the 80th and Silcox on the 52nd.\nIt will be Todd on active men and Code Section 17554.\nthe fish go to Georgia annotated relating to definitions and disposition of personal property.\nJudiciary non-civil.\nHouse Bill 859 by reference and purple the 155th quarter, 174th Saints to the 180th and\nHatch to the 150th.\nBill N. Todd on active men code section 4873.1 of the fish go to Georgia annotated relating\nthe tinting of windows and windshields.\nPublic safety and homeland security.\n860 by revs on a Williams, 145th and Rose, 120th.\nHe'll be in town on act to provide for non-binding advisory\nreferendum for the purpose of ascertaining\none of the electors of Putnam County,\nthis art of Putnam County Board of Commissioners to Levy.\nIntergovernmental coordination.\nHouse Bill 861 by revs on a wheat hour,\nthe 119 Jones to the 47th,\nprobably the 67th Gaines to the 117th,\nthe Department of the 5th,\nand others, so he'll be in town on act to amend chapter 1,\nTitle 40 the fiscal to Georgia annotated relaying identification and regulation of motor vehicles\nMotor vehicles\nHouse bill 862 by rips of Kendrick of the 93rd call well the 20th more than 95th Jones the 25th\nAnd Allen the 40th and others will be taught on that to a bench after three title 35 the fiscal to Georgia annotated relating the Georgia Bureau of investigation\nPublic safety and homeland security\n30.\nHouse bill 863.\nVarvips, I'm a turner than 21st to build the entitled act to amend Code Section 333,\n21.1.\nAnd the fiscal to Georgia annotator relating the submission of reports.\nInsurance.\nHouse bill 864.\nVarvips, I'm a richer than 97th green in the 151st silcox to the 52nd.\nCooper the 43rd.\nStevens the 164th and others.\nBuild the entitled act to amend chapter 11 of Title 48.\nThe fiscal to Georgia annotator relating the taxes on tobacco products.\nproducts. Ways and means House Resolution 2008 by\nReps on the green and 151st Jackson 128 next to the 69\ntailored 173rd and Smith in the 70th resolution\nhurting the State Board of Partens and Fools issue of\nPosthumus pardon for Susan Eberhart. Public safety and\nHomeland Security House Resolution 1023 by\nPresident Welch of the 110th Station 104th Fleming\nYou know, 121st, Tramble, 132nd, Kelly, the 16th and others.\nA resolution for closing.\nAnd the amendment to the Constitution\nis to provide that the people of state\nmay petition the judiciary.\nJudiciary, that completes first readers.\nSecond reading of bills and resolutions, the clerk queried.\nHouse Bill 742, by represent Tramble\non the 130th second, clerk with the 98th and singleton\nof the 71st to bill relating to vacation of office.\nHouse Bill 839 by Representative Jones of the 25th,\nwork eyes are the 157th part of the 101st Hill,\nthe 3rd Holly of the 111th and others,\nare bill relating to employment security.\nHouse Bill 840 by Representative Whedower\nof the 119th Gaines of the 117th,\nKelly of the 16th,\nSains of the 180th and Jones of the 47th,\nare bill relating to non-public post-secondary\neducational institutions.\nHouse Bill 841 by Representative Skaggins of the 14th,\nGamble of the 15th and Kelly of the 16th,\nare billed to amend and act to provide a homestead exemption\nfrom certain Bartow County at Lorm Taxes.\nHouse Bill 842 by Representative Williams\nof the hundred and 45th Jackson of the hundred and 28th.\nMathets of the hundred and 44th gravely\nof the 67th Powell of the 32nd and others\navailable relating to general provisions regarding health.\nHouse Bill 843 by Representative Douglas of the 78th.\nTramble of the hundred and 32nd,\nfive of the hundred and 18th Hockens of the 27th.\nWell, let's give the 79th and others\navailable relating to miscellaneous provisions\nunder the Quality Basic Education Act.\nHouse Bill 844 by Representative Gellat of the 19th\nnight of the 130th, yarte out of the 150th second,\nair heart of the 36th,\nMathis of the 144th and others,\na bill related to general provisions\nregarding Adelora and taxation of property,\nHouse Bill 845,\nby Representative Lanson of the 75th,\nNix of the 69th,\nStovall of the 74th,\nand Belton of the 112th,\na bill relating to conditions\nof employment,\nnail entry, and secondary education.\nHouse Bill 846,\nByron of the Corbin of the 174th,\nHarold of the 106th,\nCarson of the 46th,\nKelly of the 16th,\nWilliamson of the 115th,\na bill relating to revenue and taxation,\nHouse Bill 847 by Representative Corbett of the 174th,\nMcCall of the 33rd Dickey of the 140th fruit of the 149th\nGailier to the 160th second,\na bill relating to hemp farming.\nHouse Bill 848 by Representative Blackwood of the 146th\nWilliams of the 145th,\nthumbs of the 12th,\nTaylor of the 173rd,\nShannon of the 84th and others,\na bill relating to disposition of surplus property.\nHouse Bill 849 by Representative Douglas of the 78th,\nCramel of the 132nd Hawkins of the 27th,\nPowell of the 32nd Howard of the 124th and others,\nthe bill relating to care and protection\nof indigent and elderly patients.\nHouse Bill 850 by reps of Ridley of the six,\nHarold the 106, Jasper's of the 11th,\nTarvan of the second,\ngravely of the 67th and others,\nthe bill relating to the sales and use taxes,\nHouse Bill 851 by reps of the reads of the 34th,\nthe no limits of the 42nd set,\nso the 35th, Williams of the 37th dollar,\nthe 45th and others,\nthe bill to amend and act creating\nthe state court of Cobb County.\nHouse Bill 852 by reps of Glanson of the 75th,\nThe bill relating to lands acquired owned lease control they're occupied by local governance deemed for public purposes and in fact at Valoran taxation House Resolution 874 by remnant of 132nd and Clark with the 98th resolution proposing amendment to the Constitutions of the state of Georgia so as to provide for the suspension of the salary of certain suspended public officials, 3 second readers.\nReports of Standing Committees, the clerk agreed.\nRepresentative Barry Fleming on the 21st District Chairman on the Committee on Judiciary submitted\nthe following report and the Speaker of Committee on Judiciary is on the consideration\nfollowing bill of the House.\nThis is struck to me to report the same back-to-last filing recommendation House Bill 538 do pass,\nrespectfully submitted, Representative Barry Fleming on the 21st District Chairman.\nI present in a demonstration of the 104th District Chairman of the Committee on Judiciary\nNon-Sills submitted the following report to speak your committee on Judiciary Non-Sivil\nas that under consideration the following bill of the House has instructed me to report\nthe same back to the House with the following recommendation, House Bill 759-Dupas, respectfully\nsubmitted Representative Abstration of the 104th District and Chairman.\nRepresentative Ballinger, the 23rd District Chairman of the Committee on Juvenile Justice\nsubmitted the following report.\nFor speaking, your committee on juvenile justice\nis added in consideration to following Bill's house.\nIt's instructing me to report the same back to the house\nfor following recommendation.\nHouse Bill 555, due passed by a substitute,\nrespectfully submitted, represented,\nvalid under the 23rd district chairman.\nRepresentative Kevin Tanner, the ninth district chairman\non committee on transportation,\nsubmitted the following report.\nAnd speaking to your committee on transportation,\nis added in consideration to following Bill\nin resolution in the House, an instructed me to report the same back to the House of the\nfollowing recommendation, House of Resolution 935 do pass, House Bill 820 do pass, respectfully\nsubmitted Representative Kevin Tanner of the 9th District Chairman.\nThat completes the board's standing committees.\nWe're going out now to morning orders.\nGoing on to morning orders.\nChair is going to limit morning orders this morning to one minute each, one minute each.\nChair recognizes representative Wayne Howard for a morning order.\nGood morning.\nmy first time to the world this year, this session, so I think it's for a good reason.\nI have spent 34 of my years with a young lady that has supported me when I wasn't able to support myself.\nAnd I want to acknowledge her and wish her happy anniversary tomorrow, my wife, the love of my life.\nChair recognizes Chairman Darlene Taylor for a morning order.\nThank you, Mr. Speaker.\nToday we celebrate the birthday of a world-class athlete,\na World War II veteran, and a generous Georgian.\nJack Roosevelt Robinson, known as Jackie Robinson,\nhe was born in Cairo, Georgia, in 1919\nto a family of sharecroppers and grew up\nto be the first baseball player to break Major League\nbaseball's color barrier that segregated the sport\nfor more than 50 years.\nHis jersey number, number 42, is regarded\nis one of the most famous numbers in baseball history.\nIn 10 seasons, he had a high batting average of 311,\nand his on-base percentage was 409.\nHe led the Dodgers to six world series\nand one world series championship in a 10-year span.\nHe was elected to the Hall of Fame in 1962,\nhis first year of eligibility, and is an NAACP prestigious\nspring guard, a medalist.\nAlthough he was a great baseball player,\nHis character and willingness to stand up for change\nis what he is best known for.\nWe are proud in Cairo that our boys and girls club\ncarries his name and where his ideals are carried on.\nJackie Robinson is hailed as one of the best baseball players\nof all time and American civil rights hero.\nLet us all take this day to celebrate\nthis extraordinary Georgian's accomplishments in life.\nHappy birthday, Jackie Robinson.\nChair recognizes representative McCloud for a morning order.\nOkay, members need to be on the floor if they have signed up for a morning order.\nChair recognizes Representative Dorian Carter for a morning order.\nThey recognize his representative Hutchinson for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday, I'd like to introduce you to Jonathan.\nJonathan is a sweet 15-year-old boy.\nHe is honest, loving, and he loves playing and watching football.\nHis favorite team is the Georgia Bulldogs.\nJonathan also enjoys riding his bike,\nplaying video games using his tablet,\nlistening to rap music, playing monopoly\nand watching action movies.\nJonathan is one of the over 2,000 children\nwho are available for adoption today in Georgia.\nLet's say hello to Jonathan.\nThank you, and I yield a well.\nChair recognizes representative Glanton for a morning order.\nGood morning, Mr. Speaker, ladies and gentlemen of the House and Happy Friday.\nTomorrow, Mr. Speaker, the official start of Black History Month begins.\nand so I am happy to join with you today in what will go down in history as the\ngreatest demonstration for freedom and justice in the history of our nation to\nTo fling my arms wide, in some place of the sun, to dance and to whirl until that bright\nday is done, then to rest a cool evening beneath a tall slim tree, while night comes on gently,\ndog like me. This is my hope. This is my dream, to fling my arms wide in some place of\nthe sun, to dance, to world, to world, until the bright day is done. Then, to rest, a\ncool evening beneath a tall slim tree, while night comes on gently, black like me. I\ntwo-seeing America.\nI am the darker brother.\nThey send me to eat in the kitchen when company comes,\nbut I love, haha, and I eat well, and I grow strong.\nTomorrow, brother Al, they won't dare send me\nto the kitchen when company comes.\nBesides, they'll see how beautiful I am\nand be ashamed.\nI, too, am America.\nThank you, Mr. Speaker, and I yield the well.\nChair recognizes Chairman Newton for a morning order.\nThank you, Mr. Speaker.\nColleagues, disappointing facts,\nwas determined during our study committee on maternal mortality.\nWell, one of the intriguing things,\nThat's where Georgia ranks very high in that.\nOne of the intriguing things, though,\nis 60% of the pregnancy-related deaths\nare potentially preventable.\nThat was one of the highlights that we determined.\nAnd the 41% of Georgians and many of our African-American\ncitizens are especially high risk for maternal mortality.\nYou all know that study committees\nduring our off-season provide an opportunity for us\nto learn, for us to study what's going on in our state.\nThey also provide a spotlight on all\ndifferent organizations that are working. I will tell you, our multiple meetings we had on\nmaternal mortality did shine a spotlight on some great people and organizations that are working\nacross Georgia to improve our standing in maternal mortality. Some of these like our people at the\nDepartment of Public Health, our maternal mortality review committee that's been working for several\nyears established by our speaker in this body. One of the others is Healthy Mother's Healthy Babies,\none that I'm especially proud of as I co-chaired the committee with who healthy mothers healthy babies\nas determined was their advocate of the year for 2019 and that was Chairman Sharon Cooper.\nWe heard from providers all over the state who gave us great suggestions on how we can improve\noutcomes for these mothers in every zip code in our state. I want to encourage us to continue\nto work as legislators as fellow legislators to ensure we prioritize the health of mothers\ntheir children and ensure that all Georgians are educated on their health care options available to\nthem and that they each have the access to quality health care that they deserve. Thank you, Mr. Speaker.\nChair recognizes representative McCloud.\nIn this budget, we will be contributing to mass incarceration by decreasing the budget\nto the departments that will provide resources for employment and rehabilitation by almost\n$57 million at this time in the United States of America that leads in prison population\neven though it accounts for less than 5% of the world's population.\nWith this budget, we are supposed to face our constituents and tell them that this budget\nis a reflection of what we value, I think not.\nIn this year, in this session, in this room, we can create a budget that benefits the people\nwho we serve, our employers, the people of the state of Georgia, they deserve a return\non their investment, I yield the well.\nChair recognizes representative Carter for a morning order, going once, twice, all right,\nChair recognizes representative Wynn to introduce the doctor of the day.\nThank you, Mr. Speaker.\nToday we have with us Dr. Florence Lacra, Dr. Lacra was an anesthesiologist for 33 years\nand continues to practice at Northside Riverdale\noutpatient imaging center.\nIn 2014, she returned to academics\nin the field of health economics.\nShe is an adjunct professor at the Andrew Young School\nof Policy Studies at Georgia State, my alma mater.\nAnd her research focus is medical liability,\npatient safety, infecision burnout.\nSo maybe she can give us some tips on lawmaker burnout.\nYes.\nDr. Lacan is a member of the American Medical Association,\nthe Medical Association of Georgia,\nand the Medical Association of Atlanta,\nwhere she serves on the Board of Directors.\nYeah.\nThank you so much.\nI am an anesthesiologist.\nI am very fortunate to have Julia Mack\nan experienced nurse.\nJulia, wave your hand.\nOkay, helping me today.\nMy expertise is in getting you safely\nthrough the surgical procedure.\nIf any of you are having, or are loved one,\nare having surgery in the next several months,\nfeel free to come by me.\nI will tell you the new recommendations\nfrom the American Society of Anesthesiologists\nand the American College of Surgeons\nthat you can do to help you decrease your risk\nof surgical complications and heal faster.\nI am honored to serve you today,\nespecially because you do so much\nto help the people of our state.\nThank you for all you do.\nGood to see you too.\nClerk will read the caption to a group of privileged resolutions.\nRecognizing commending the Georgia High School fencing league in its member teams, honoring\nthe life and memory of Dr. James C. Metz, Jr., commemorating the Keep Georgia Beautiful Foundation\nand more than 70 local keep American beautiful affiliates\nacross the state,\ncommending the Dacula High School Lady Falcons soccer team\nfor winning the 2019 6A State Championship.\nCongratulations, Hebrew Christian Academy's volleyball team\nfor winning the 2019 2020 GHA SA class,\na private state volleyball championship,\nRecognizing Commending Habitat for Humanity,\nRecognizing Commending International Women of Hope.\nRecognizing April 2020 as Celebrate Diversity Month,\nRecognizing and Commending Georgia Supreme Court\nJustice Robert Benham upon the grand occasion\nof his retirement.\nRecognizing the week of February 3rd\nas Jewish Genetic Screening Awareness Week in Georgia,\nhonoring the life and memory of Bishop Quincy Lavelle\ncar as well. Commending the city of College Park in Recognizing February 6, 2020 is College\nPark Day at the State Capitol and for other purposes that completes the reading of the\nprivilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here's none in the resolutions are adopted.\nWe have one birthday between now and when we're back on Monday, Representative Kevin Cook\ncelebrating a birthday tomorrow.\nWe have one announcement, Chair's going to remind members if you have pages here today,\nyou need to report up to the rostrum right now because we're not going to go looking for\nyou.\nIf you want you to have your picture made with your page, Chair recognizes Representative\nAbel, Mabel, Thomas for an announcement.\nThank you, Mr. Speaker.\nI rise today as a vice chair of the civil and a delegation.\nWhat I want to remind people is that on today, we are, we will be meeting after\nafter adjournment, about 11.30, we say 11.30 in room 307 of the L.O.B., it would be members\nof the City of Atlanta delegation as well as members of the Ford and County delegation\nas well. We mean together today at 11.30, 307 L.O.B., thank you, Mr. Speaker.\nI think that's all of our announcements that you might want to listen to this motion.\nChair recognizes the majority leader of the House for a motion.\nspeaker, I moved that this house stand adjourned until 1 p.m. Monday, February\nthe 3rd, 2020. I wish you'd let me make that motion as popular as it was. The\nmajority leader has moved that this house be adjourned until Monday, February\n23rd, 2020 at 1 o'clock p.m., 1 p.m., all those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it in this house will be adjourned until Monday, February 3rd at 1 o'clock p.m.\n",
  "updated_at": "2026-02-12T15:53:32.717475+00:00"
}