{
  "video_id": "FYE4F8sxvrk",
  "url": "https://youtu.be/FYE4F8sxvrk",
  "title": "Georgia House - Day 10 (2026-02-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-02-03",
  "duration_minutes": 59,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 10 (2026-02-03)\n\n## Overview\nThe session included a scripture reading and prayer by Reverend Abraham Mosley, a notable pastor celebrating his 45th anniversary. The session featured reflections on the importance of love and statesmanship in lawmaking.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Reverend Mosley delivered an inspiring speech emphasizing the importance of love, justice, and compassion in governing.\n- Representative Houston Gaines introduced Reverend Mosley and recognized Athens Mayor Nancy Denson, who was in attendance celebrating her 80th birthday.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nThe session began with a roll call to confirm members' presence in the chamber.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "The hour of convening, having arrived, all members of this house will please report\nto the floor and take your seats.\nAll members of the House will please report to the floor and take your seats.\nMr. Clark, would you ring the bell?\nAll members will report to the floor of the house.\nWe're going to have the, I guess it's the afternoon roll call.\nmember's president will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nWell, good afternoon. Happy Monday. What a beautiful day, huh? Full of promise and just it's a\ngreat day. Great day to be in Georgia. We will begin our day with a scripture reading in prayer\nby the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this\nmorning will be introduced by the gentleman from the 117th House District, representative Houston\nGames, Representative Games.\nThank you, Mr. Speaker.\nToday I'm honored to introduce my friend and a great Athenian Reverend Abraham Mosley\na Mount Pleasant Baptist Church.\nReverend Mosley just celebrated his 45th pastoral anniversary at Mount Pleasant.\nFirst name pastor of his church in 1974.\nMoses began preaching in August of 1968, giving his first sermon at Israel Baptist Church\nafter being called to ministry upon the death of Martin Luther King Jr. While preaching\nand teaching the Word of God, Reverend Moses has grown the church's congregation significantly\nover the last 45 years, built a larger sanctuary and renovated the church's facilities and\namenities. Today, we're also honored to have several members of the church here with\nthis the congregation up in the gallery.\nWe're honored to have you and several deacons of the church\nwith us this afternoon as well.\nThank you all for being here.\nI'll never forget the first time I visit Reverend\nMosley's church.\nThe occasion was his 40th pastoral anniversary,\nand I was working for Athens Mayor Nancy Denson,\nwho were also honored to have here with us today.\nShe just celebrated her 80th birthday last week,\nso we're honored to have Mayor Denson with us as well.\nBut the service began around 10 a.m. and I was running a little late myself, so I decided\nto hold off on food and coffee until after the service.\nWell, I'll never forget about four hours later that I was very hungry, and so I learned\nto make sure I eat before church.\nAnd yesterday I saw Reverend Mosley at our good friend Reverend Robert Finch's installation\nservices at Phillips Grove Church, and I reiterated to Reverend Mosley five minutes, five minutes\ntoday.\nSo, but after Super Bowl Sunday, we look forward to your words of wisdom and getting this\nhouse back up and moving.\nPlease join me in welcoming Reverend Abraham Mosley.\nGood afternoon.\nTo the Honourable House Speaker, Speaker Austin, House Majority Leader Burns, House Minority\nleader, Trunel, and all members of this distinguished legislative bodies, and\nrepresentative Houston Gaines extended the imitation to offer words of\nencouragement or inspiration. I didn't know whether to thank God or ask him why\nme. I didn't know whether to rejoice or sink my head in the locks of my\nmy shoulder. One thing I didn't know, and one thing that I was sure of, that I needed\nto pray. For the rare and unused opportunity to address this honorable and renowned body,\nI am very grateful.\nLawmakers have an awesome responsibility.\nLaws that are enacted do not only affect the present affairs\nof the state of Georgia, but they also\nhave binding implication for the future as well.\nTherefore, in our state house, we need more\nstatesman and few politician. Statesman makes decision with the next generation in mind,\nwhile politician makes decision with the next election in mind. Thus, the statesman makes\nThis decision based on character while the politician usually makes the decision based\non convenience.\nFirst Caribbean 13, Paul talks about love.\nLove is the greatest thing in the world and the highest virtue one can possess.\nIndeed love is the prevailing theme in the Bible.\nlove embrace both God's grace and God's mercy and his manifests are revealed in\nunseffish, lawyer and benevolent concern for the well-being of others. And the\nNew Testament idea, love is the fulfilment of the Old Testament law. Jesus stated\nthat the greatest commandment is the love of our neighbors. As we love our\nsays, Jesus further declared that his disciple would be known by the love they have for\nothers. In essence, love is displayed and what we do for others. This ethical dimension\nof love is expressed as gestures. An Old Testament gesture, you see, they will benefit\nhow justly and equally the resources of the earth are\ndistributed, advantage of social life or shared, and\nopportunity for educational, vocational and economic\nattainment are available, and liberty for participation\nin the fullness of life are open to all.\nThe chapter in love follows Paul teaching on spiritual\ngive. Paul caution us that our various gift, talent, skills,\nand ability to mean live unless the motive of our service is\nlive. I, as a minister of the gospel, you as an elected official,\nhave the Austin, Austin challenging and responsibility to help\nusher in the beloved community by using our position of power\nprestige and privilege to execute justice by correcting existing matters of\nabuse, condemning oppression, legislating laws that meets the needs of all the\npeople, rich and poor, city and rule, laws that ensure adequate ways to\nsafe environment and an aquatic standard of living for all. Love says, I won't\nfor you. The same good are best that I won't for myself. Paul said love is the\nmost excellent way. Let us pray.\nEternal God, we acknowledge that you are the creator of the universe, that you\nbecause you sustain all that was created,\nfor the privilege to call upon your name and prayer,\nfor the blessing to be admitted\nand to your divine and holy present,\nfor hearing us as we pray orderly and silently, we thank you.\nWe pray that you will continue to bless the leaders\nof Iowa State government,\nthat they will work together with a cooperative spirit,\nBless them with health, a body, mind, and soul.\nBless them with courage and the willingness\nto make the decision that are needed to make Georgia\na great state.\nA state that the citizens will continue to be proud on,\nthat heaven will continue to be pleased with\nand smile favorably up on.\nBless the leadership and the membership\nof this government body.\nAnd bless all who contribute to the proper function\nof government and all who are the recipient of the benefit of the government.\nWe pray, O Lord, through us, reach the hungry and the homeless, through us, consider those\nin prison, through us, have compassion for the sick and the bereaved, through us, clean\nup our neighborhood, for your goodness and kindness, to us, we pledge to renew our love\nfor you, and to pledge to continue to exercise our faith in you.\nIt is in your precious name.\nWe pray, amen.\nCongratulations to the Father of the United States of America.\nAnd we're going to be covered for which it stands.\nOne will make you come and God will deliver you.\nAnd we will deliver you in fact to the Father.\nDoorkeepers will unlock the doors.\nYou\nYou\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the Journalists of the Previous Legislative\nDay and found it to be correct.\nIs there anything in the journal, Chairman Hogan, about your whereabouts this past weekend?\nI couldn't afford a ticket and I couldn't find anybody that would loan me into money.\nOkay, I'll accept that.\nIs there any objection or Chairman Hogan, the chair of the Commission on Information\nand audit reports that the journal of the previous legislative day has been read and found\nto be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burnt on the 59th Moose following me establishes the order of business term, the first\npart of the period unanimous concerns, introduction of bills and resolutions.\nFirst reading and reference of House bills and resolutions, second reading of bills and resolutions,\nreports of standing committees, third reading and passage of uncontested local bills and resolutions,\nfirst reading and reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day the chair hears none and the resolution is adopted first\nreading of bills and resolutions the clerk will read House will 749 I'm a\nrepresentative McLaren of the 51st Bill being titled an act to amend title 36\nthe fish go to Georgia, annotated relating to local government.\nGot mental affairs.\nHouse bill 865 by Ripson of Skoggins in the 14th rich in 97th,\nplumbing in the 121st, so Cox, the 52nd and drier, the 59th.\nWill be taught on that to a men title 53, the fish go to Georgia, annotated,\nrelating to Will's trust and administration of the states.\nCode revision.\nHouse bill 866 by Ripson of Hogan in the 179th,\nSaints of the 180th, Williams on 448th.\nMathis on 44th, Gilear to 160 second.\nIt'll be Todd O'Nack to men, chapter eight,\na total 36th district of Georgia,\nannotated relating to county police.\nGod, mental affairs.\nHouse Bill 867, my resident of Martin,\nthe 49th dollar of the 45th, Jones the 47th.\nIt'll be Todd O'Nack to men,\nArmy of five, chapter 36, a total 36th district\nof Georgia, annotated relating to limitation\non annexations.\nGod, mental affairs.\nHouse Bill 868, my resident of Martin,\nthe 49th Carpenter, the 4th, Paul 32nd.\nThere'll be a ton of the active men, chapter eight,\na ton of 48.\nThey just wrote Georgia annotator relating the sales\nand use taxes.\nWays and names.\nHouse bill 869 by resident Glanton,\nthe 75th for now, the 77th face more than 63rd.\nLet's go feel the 60th, Douglas the 78th and others.\nThere'll be a ton of active men\nand not creating the Clayton County Water Authority.\nThe intro governmental coordination.\nHouse bill 870 by resident.\nin the fifth quarter to the 174th.\nRidley, the sixth Kelly, the 16th,\nand Skoggins in the 14th.\nBill B. Toddl, an act to men,\npart four of article one of chapter eight,\na title 40.\nIf you should go to Georgia,\nannotated, relaying the horns,\nexhaust systems and mirrors.\nMotor vehicles.\nSenate bill 304 by Senator Gooch,\nthe 51st of Bill B. Toddl,\nan act to create a board of elections\nin a registration for White County.\nThe Intergovernmental Coordination.\nSenate bill 328 by Senator Jones,\nthe 25th.\nwill be titled back to authorize the governing authority, the City of Jackson, the Levian\nX-size tax.\nAnswer governmental coordination.\nThat completes first readers.\nBefore we go on to second readings, Chair wants to recognize on the floor of the house\nThe representative elect from the 171st House District Representative elect Joe Campbell.\nRepresentative elect Campbell is waiting upon certification of the results of his election\nand then we'll be sworn in.\nWe hope maybe by the end of the week he will be able to join us.\nSecond reading of bills and resolutions.\nThe clerk will read.\nHouse Bill 853 by reps of night in the 130th,\ncorporate of the 174th,\npurple the 150th,\nmeek of the 178th and roads of the 120th,\na bill relating to prestige license plates\nand special plates for certain persons in vehicles.\nHouse Bill 854 by reps of retledge of the 109th,\nPowell of the 32nd,\nPetrie of the 166th, Stevens of the 164th,\nClark of the 147th,\nthe bill relating to general provisions\napplicable to counties and municipal corporations.\nHouse Bill 855 by reps of,\nhour of the 119th, Jasper's of the 11th, Gaines of the 117th, McCall of the 33rd,\nReeves of the 34th and others, a bill relating to educational programs, House Bill A56 by\nRep. Sharper of the 177th, the bill to amend and act to establish a system of public schools\nfor the city of Valdosta. House Bill A57 by Rep. Powell of the 32nd, McCall of the 33rd,\nJasper's of the 11th, bill relating to prevention and control of air pollution, House\nbill A58 by Representative McLaren of the 51st Wilson of the 80th still cocks to the 52nd\nof bill relating to definitions and disposition of personal property and custody of law enforcement\nagencies House bill A59 by Representative Parkle of the 155th Corporate of the 174th\nSains of the 180th and hatchet of the 150th of bill relating to tenting windows or wind\nshields House bill A60 by Representative Williams of the 145th and\nbridge of the 120th of bill to provide for non-binding advisory referendum for the purpose\nof ascertaining whether the electors of Putnam County, Desire Putnam County, Board of\nCommissioners for Levin at the Lauren tax to the purpose of retirement of debt incurred by the Putnam County Hospital authority\nHouse Bill 861 by remissor with hour of the 119th Jones of the 47th gravely of the 67th gains of the 117th\nPart of the 5th and others a bill relating to identification and regulation of motor vehicles\nHouse bill 862 by remissor Kendrick of the 93rd call well the 20th more of the 95th Jones of the 25th\nAll under the 40th and others a bill relating to the Georgia Bureau of investigation\nHouse Bill 863 by resident turner of the 21st to build relating to submission of reports\nproperty and casualty and insurance types of insurance to which requirement applies contents or\nreport and public inspections. House Bill 864 by resident of Richard the 97th green of the\n151st silk acts of their 52nd Cooper the 43rd Stevens of the 164th and others to build relating\nto taxes on tobacco products House resolution 108 right represent green of the 101st Jackson of\nthe 128th mix of the 69th Taylor the 173rd Smith of the 70th resolution urging the\nstate work for the pardons and pearls to issue a posthumous pardon for Susan Eberhardt\nHouse Resolution 1023 by RSA Welch of the 110th, Eftration of the 104th, Fleming of the\n121st, Cramel of the 130th, Kelly of the 16th, and others.\nThe Resolution proposed to be a member to the Constitution, so as to provide that the\npeople of the state may petition the judiciary for declaratory relief from certain acts of\nthe state or certain local governments or officers or employees, they are out to violate\nlaws or Constitution of this state or the Constitution of the United States through\nsecond readers.\nReports of Standing Committees, the clerk will read.\nI'm Senator John Takerson, and I'm 60th district chairman of the Committee Intergovernmental\nCoordination Locals submitted to the following report.\nMr. Speaker, your committee on the Intergovernmental Coordination Local is at a consideration following\nbills of the House.\nMr. Strockton, the Committee reports saying back to the House that the following recommendations\nHouse bill 822 do pass, House bill 825 do pass, House bill 831 do pass, House bill 841 do pass, House bill 841 do pass, respectively submitted representative\nTinkersley, the 160th district chairman.\nThat completes the reading of the reports\nof Standing Committees.\nWe're about to go home to the local calendar.\nWe are about to go to the local calendar.\nThird reading and passage of\nuncontested local bills.\nOne bill on the local calendar\nrelates to homestead exemption and\nrequires a recorded two-thirds\nroll call vote for passage.\nIf there is no objection, we will\nvote on the local calendar as a\nwhole with a recorded vote.\nIt is so ordered the clerk will read the local calendar.\nHospital 822 by Rochelle Gamble, the 15th Bartow County.\nHospital 825 by Rochelle Vingland, the 116th Barrow County.\nHospital 831 by Rochelle House, the 170th Cook County.\nHospital 851 by Rochelle Reaves the 34th Cobb County.\nHospital 841 by Rochelle Skoggins, the 14th Bartow County.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee which was favorable\nto the passage of the bills?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall these bills now pass all those in favor of the passage of the bills on the local\ncalendar will vote aye. Those opposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of the bills on the local calendar.\nThe eyes are 167.\nThe nays are zero.\nThese bills having received the requisite constitutional majority.\ntherefore passed. We are now going on to morning orders. Chair is going to ask\nthat all members please take your seats. If you need to have conversations take\nthem to the any rooms and but give attention and respect to the members in the\nwell. Chair recognizes for a morning order the whip of the majority caucus\nwhip Kelly representative Gamble and representative Skoggins. Thank you\nMr. Speaker. Late Thursday evening the community is both Pope and Bartow\nCounty suffered a great loss. Sarah Beth Barnes a young 32-year-old police\nofficer for the Carter'sville City Police Department, lost her life in the\ntragic automobile accident. Mrs. Barnes was a two-year veteran of the\nCarter'sville Police Department. She was also a veteran, a mother, a five, and a\nloving wife. Our community mourns the loss of Mrs. Barnes and we ask you today\nwhile they have the service at four. We also want to take him on in this house\nto take a moment of silence and\nremember her family.\nThank you.\nAll other morning orders will be\nlimited to one minute each chair\nrecognizes for a morning order\nrepresentative Ridley.\nThank you, Mr. Baker.\nChris Colle had one saying it's our duty to serve those who serve us and\nthat's exactly what he lived by. Yesterday was seven years since he answered\nto Colle to do that. One mother called him to ask the son who was having trouble\nsince returning from back season and it was he had unknowns to him who's\ngonna cost him his life. On February 2, 2013 America lost a hero legend and his\nfamily lost a daddy and a husband. But more than that, my friend Wayne and Debbie\nKyle lost a son and his brother Jeff lost a mentor. Wayne and Debbie never let\nthis slow him down. Along with Jeff, they carry on his legacy through the American\nFowler Foundation that helps military personnel and first responders and\ntheir families. On behalf of the Georgia State Legislature, I just like tell\nMr. Wein and Mr. Debbie, they even hear a word touch about what your family's done.\nThank you.\nMr. Frick.\nChair recognizes Representative Bennett for a morning order.\nThank you so kindly, Mr. Speaker.\nGood morning, colleagues of the House.\nToday I rise on behalf of the Georgia Legislative Black Caucus\nwith just a moment in Black history.\nBlack history month was started as a Black history week\nby none other than Carter G. Woodson in 1875\nto recognize the attributes and contributions\nof African-Americans and people of the Black diaspora.\nToday I stand to remember the original 33,\nwho were the first 33 African-Americans\nof the Georgia General Assembly.\nThey were elected to office in 1868 during reconstruction.\nThey were among the first African-American state legislators\nin the United States,\n24 of the members were ministers.\nThe members were expelled in September 1868.\nThe legislators petitioned the federal government\nand state courts.\nToday I stand to remember the 33 legislators who\nsat in the seats where you said today.\nThank you, Mr. Speaker.\nChair recognizes Representative Larickia for a morning order.\nThank you, Mr. Speaker.\nToday we'd like to welcome and recognize the members of the Okifinoki Risa from down\nin my neck of the woods, both the superintendents and the executive director up in the gallon\nif you please stand.\nThank you for coming.\nThank you for what you do back home.\nThank you, Ms. Picker.\nChair recognizes representative Stovall for a morning order.\nThank you, Mr. Speaker and members of the House.\nI come to express my concerns with a decrease in the access for 19th and 10th graders with\nthe dual enrollment student who are dual enrollment students.\nFor some, the rules may need to change to ensure fairness.\nThen let's focus on that part.\nIf the concerns are limited to funding\nfor the future of the program, let's look at other cost savings.\nThe benefit of the program, outweighs the expected outcome.\nOne cost saving needs to change the funding allotment\nso that online and on-site would not be the same amount.\nWhy is there a difference in the cost for a student\nwho takes a dual enrollment at the school versus online?\nOnly 19th and 10th graders can also do online with dual enrollment.\nThe second saving is to revise the double payout\nto the school systems with dual enrollment students.\nIt's my understanding that the FTE for each student\nand then allotment is split between the school systems\nand the colleges.\nWhile the school system's being funded twice\nand how much additional savings could be made,\nwhat programs would be in place at the schools\nfor those students who are not never gonna be eligible\nfor dual enrollment since there be eliminated\nfrom the dual enrollment program.\nThank you, Mr. Speaker.\n.\nrecognizes Representative Mathy Ack for a morning order.\nThank you, Mr. Speaker, and great afternoon.\nToday is National Women Physicians Day, Dr. Louise Taylor Ellison, MCG class of 1950,\na clinician, researcher, educator and administrator\nwho's 75-year-plus affiliation with medical college\nof Georgia left a lasting legacy on the institution\nand on health care in general.\nShe was one of only four females in a class of 78 students\nand she enrolled in MCG in 1943.\nIn 74, she was named as MCG's associate dean\nfor Curriculum in a year later was named the University Provost\nSecond in line to the President,\nmaking her the highest ranking female in U.S. medical schools.\nEllison retired as Professor Emeritus,\nProvost Emeritus in 2000,\nand stayed at MCG's medical historian residency\nin the University's history.\nThank you so much and I hope you'll celebrate women in the medical world.\nChair, you know, I watched the Super Bowl, but I didn't see you, Chairman Hogan.\nI'm good enough for that either, okay?\nChair recognizes for a morning order,\nChairman Hogan and Chairman Austin.\nThank you.\nThank you, Mr. Speaker and colleagues.\nAlthough our Falcons weren't in the Super Bowl last night,\nwe'd like to take the moment\nto recognize some homegrown talent.\nChief wide receiver,\nMcCold Hardman from the University of Georgia,\nChiefs Kicker, Harrison Buckner from Georgia Tech and Chief\nwide receiver, Tyree Hill, who graduated from\nCoffee County High School. All played a prominent role\nin last night's game, and we're proud that their Georgia grown.\nIn addition to the players, Georgia was also responsible for\nof growing the grass used at the Super Bowl last night.\nTiff Way 419, also it's known, was developed\nas a science program for within the University of Georgia\nand six of the seven years Mark Pollock\nand Richard Witt to find folks at Pro Tiff\nin a lapahole where I'm from.\nAnd also it was grown.\nThis is the representative's territory here.\nand I just phased in a little bit,\nbut I'd like to heard say something too.\nIt was grown in Enigma,\nand the former Senator Bobby Rowan called\nthe representative today to let her know\nthat it was grown in Enigma.\nAnd I'm proud to be from the community of a Lapa Hall\nand support this business that plays an integral role\nin the biggest game of sports.\nThank you very much.\nAnd thank you.\nAnd if you get a chance through the Wall Street Journal,\nAnd it tells you about how that grass was developed in a Nigma, Georgia, and planted.\nIt's really interesting, the process they went through to plant it.\nAnd this is just another example how research and extension brings money to Georgia.\nThank you.\nThank you.\nChair recognizes representatives Glanton and Burnow for a morning order.\nThank you, Mr. Speaker.\nWe rise today to recognize Clayton County Chamber of Commerce Day at the Capitol.\nCity in the gallery today is our President of our Chamber of Bank Casey, Commissioner\nFelicia Franklin Warner, Lake City Councilman West Craven, City Manager Chris Letti, representatives\nfrom Clayton County Public Schools,\nand most importantly, members of our business community.\nWould you please stand?\nThank you, Mr. Speaker.\nChair recognizes representative Hutchinson\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning, good afternoon colleagues.\nToday, I'd like to introduce you to Caleb.\nCaleb is seven years old.\nHe is a happy and loving boy who enjoys watching cartoons\nand Disney movies. Caleb needs a loving and patient\nadoptive family who will give him one-on-one attention as well as\nmeeting his needs both now and in the future.\nThis is Caleb. Caleb is the one of over 2,000 children\nthat's available for adoption today in Georgia.\nThank you, and I yield the will.\nChair recognizes Representative Hutchinson to introduce the Doctor of the Day.\nGood afternoon again colleagues. Today I'd like to introduce our doctor of the day. Dr.\nLatifa Watford serves as chief of behavioral health at Kaiser Permanente of Georgia. She received\nher medical degree from the Morehouse School of Medicine and completed residency training\nfellowships in pediatrics and general psychology psychiatry as well as a\nfellowship in child natalescent in Indiana at Indiana University. She also\ncompleted a forensic psychiatry fellowship at Emory. As a child general a\nchild adolescent general and forensic psychiatrist she works diligently to\nensure her patients receive the care that they need. Ladies and gentlemen\nDr. Wofford.\nThank you so much.\nThank you to Speaker.\nThank you this afternoon and thank you so much for the warm welcome.\nThis is actually my second year of being a doctor of the day and I am truly\nhumbled and honored to pay a part in this great tradition.\nI'm also privileged and honored to serve the people of Georgia as a\na member of the Southeast Permanente Medical Group.\nFor those who are not familiar with our practice,\nwe are the largest physician-owned and physician-led medical group,\nmulti-specialty medical group here in Atlanta.\nI, along with the other 800 members of my group,\nwork with you, not an insurance company,\nto make sure your medical care needs are met\nand assist you with making any important clinical medical decisions.\nThis has been our model for over 70 years.\nAnd today, I am proud to say that I am a continuing part\nof that tradition.\nI practice at the Kaiser Permanente Guinect Location\nin Duluth, all of Steve Reynolds, I am a psychiatrist.\nSo if you need me, I'm there.\nDuluth is but thank you, Representative Williams.\nDuluth is but one of our 26 medical office buildings\nlocated in the Metro Atlanta area\nto serve the needs of our Georgia Kaiser Permanente members.\nI'm one of, as I mentioned, I'm a psychiatrist,\nwhich is only one of the 40 specialties\nwe represent here in Atlanta, Georgia,\nto serve the members of our,\nover 300,000 members of Kaiser Permanente,\nof which 40,000 are state of Georgia employees\nand their dependents,\nand we are also honored to care for now\nalmost 2,000 of our military retirees\nand their family independence.\nAlthough I wasn't born and raised here in Georgia,\nI did get married here.\nI got my medical degree here.\nI have birthed my youngest child here.\nSo I think that now gives me the right\nto say I'm a proud Georgian.\nAnd I want to, as one proud Georgian to a roomful of us,\nI want to express my extreme gratitude\nfor everything you guys do and come to do here\nin these honor chambers every day.\nThank you.\nThank you very much.\nThank you.\nYou\nHouse will be at order. We are about to recognize some very special Georgians. The clerk will read the caption to House Resolution 990, House Resolution 991, and House Resolution 992.\nHouse Resolution 990 by Rep. Martin of the 49th of Blackman of the 146th, a resolution\nrecognizing and commending Heather Williamson. House Resolution 991 by Rep. Martin of the 49th and\nnext to the 69th, a resolution recognizing commending Simone Crane. House Resolution 992 by\na resident of Martin of the 49th and Dempsey of the 13th, a resolution recognizing and\ncommending, linear, archetta, and for other purposes.\nThe chair recognizes the chair of the House Higher Education Committee, Chairman Martin,\nfor an invite resolution.\nThank you, Mr. Speaker, members.\nIt is truly my honor today to stand before you and ask you to help me welcome three special\nguest from the technical college system of Georgia. In each case, these individuals have\njust brought distinction by being the best in the state in their respective categories.\nChair Katie Dempsey and I would like to recognize Lainer Regatta. Mr. Regatta is an instructor\nat Georgia Northwestern Technical College where he teaches management and supervisory development.\nHe was a recipient of the 2019 Rick Perkins Award given to the top instructor in the\nthe technical college system.\nChairman Randy Knicks and I would like to recognize\nMs. Simone Crane from West Georgia Technical College.\nMs. Crane distinguished herself among her peers\nand was selected as the 2019 Eagle Award winner.\nThe Eagle Award stands for exceptional adult\nGeorgian in literacy education\nand is awarded to the adult education student of the year.\nLast and certainly not least,\nChairman Shaw Blackman and I would like to welcome\nand recognize Heather Williamson\nfrom the Central Georgia Technical College.\nMiss Williamson is a graduate of Central\nGeorgia Technical College and Warner Robbins,\nand is the 2019 State Gold,\nGeorgia Occupational Award of Leadership winner.\nThis award is the highest honor in technical education\nthe student can receive.\nAfter she earned an associate's degree\nin early childhood care and education,\nshe became a paraprofessional\nin the elementary school classroom\nand Houston County school system,\nplease join me in recognizing these three individuals\nand each would like to address the body\nif the speaker's so allowed.\nJoin me in welcoming and recognizing these three individuals.\nThank you, I'm Simone Crane.\nWhat education has done for me is I am a 37 year right now I'm recovering addict of\n37 years.\nI have graduated the GED and Douglas County Drug Court both February 2018 so it was important\nto my journey where I'm going now, I'm in psychology at West Georgia Tech, I want to be a\ndrug and alcohol counselor. Thank you for the opportunity.\nMr. Speaker, members of the House, it is an honor to be here today. Thank you for making\nthe choice to fund technical education in our wonderful peach state. I will forever be thankful\nthat the Technical College System of Georgia made my dreams come true by earning my early\nchildhood education degree. I was very fortunate enough to graduate debt-free thanks to the\namazing scholarships I received while in college. I am now working in a local elementary school\nkindergarten classroom and will be pursuing further degrees in education soon. Thank you\nfor believing in people like myself and creating a way for us to create a better life for ourselves\nand our families.\nThank you.\nThank you, Mrs. Speaker and House members.\nIt is a privilege to be here with you,\nand I want to thank you all for all you do for us.\nIt's an honor to serve as the instructor of the year.\nI want to thank you for giving me an opportunity\nto share with you a dream job that I have,\na job to be able to impact our students\nand continue the growth of Georgia.\nThank you for your time.\nThank you very much.\nThank you very much.\nWhat purpose does Chairman Hatchett rise?\nThank you, Mr. Speaker.\nI rise to make a motion.\nState your motion.\nto move House Bill 701 from Ways and Means to Appropriations,\nboth chairman and agree.\nGentlemen has moved that House Bill 701 be moved\nfrom the Ways and Means Committee\nto the Appropriations Committee,\nthe clerk will read the caption.\nHouse Bill 701 by resident of hatchet 150th,\nwe title an act to amend Code Section 22, 164,\nthe fiscal to Georgia and intending to relay\nthe local five mill share of funds.\nOn the gentleman's motion, that House Bill 701 be moved from the Ways and Means Committee\nto the Appropriations Committee, is their objection.\nIs their objection, the chair here is none, and it is so ordered.\nClark will read the caption to a group of privileged resolutions.\nCommending a congratulating Dr. Tsai in-win upon her election of the 15th President of\nTaiwan, recognizing February 11, 2020 as NAACP Day at the State Capitol.\nCommending Taiwan for its relations with the United States, recognizing February 25, 2020\nas Georgia Life Sciences Day at the State Capitol, recognizing the Commending the Georgia\nNational Fairgrounds and Agricultural Center, recognizing Commending Marlene Taylor Crawford,\nrecognizing February 12, 2020 as Albany Dardy County Day at the State Capitol, recognizing\nand commending Tracy Nancy Pendley for her earning the prestigious 2020 Georgia Teacher\nof the Year Award, recognizing February 10th, 2020 as Alzheimer's Awareness Day in Georgia.\nRecognizing February 18th, 2020 as he will fuel you of Georgia Day at the State Capitol.\nRecognizing March 16th, 2020 as Georgia Hearing Day at the State Capitol.\nRecognizing February 10th, 2020 as Alpha Capital, Alpha Sorority Inc. Day at the State Capitol.\nin commending the Lights of Love event at the Children's Healthcare of Atlanta,\nrecognizing February 4, 2020 as obesity care awareness day in Georgia.\nCommending the University of Georgia Augusta University of Georgia Institute of Technology,\nand Georgia State University for the contributions to higher education,\nhonoring the life and memory of Don Alfred.\nHonoring the Life and Memory of Mayor Rebecca Becky Chambers,\nhonoring the life and memory of James Harold Schupper, Jr., co-founder and chairman of the Board\nof Directors of the Schupper Center, and for the purposes that completes the reading\nof the privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here's none in the resolutions are adopted.\nAll right, we're going on now to announcements.\nIf you have signed up for an announcement, be making your way to the front of the chamber,\nChair recognizes Chairman Taravan for an announcement.\nThank you, Mr. Speaker.\nInterstate cooperation will meet in 515,\nCLOB, 515 upon the adjournment.\nUpon the adjournment, 515.\nChair recognizes representative Kendrick\nfor an announcement.\nGood afternoon, colleagues.\nThis is a reminder that Facebook will be here for a training and\nfeeding us lunch tomorrow in room 310 of the CLOB from 12 to 1 o'clock.\nIt's legislators only, but please come by in February 4th, which is tomorrow at 8 a.m.\nWe're going to have a breakfast as well to talk about cyber security.\nSo if you can make one of those two events, I would greatly appreciate it.\nThank you.\nChair recognizes Chairman Corbett for an announcement.\nThank you, Mr. Speaker.\nThe Motor Vehicles Committee will meet at 8 a.m. in the morning, 515 C.L.O.B.\nThank you.\nChair recognizes the chairman of the House Rules Committee, Chairman Smith, for an announcement.\nMr. Speaker, the Rules Committee will meet tomorrow morning at 9 o'clock.\nMs. Penny, please be there.\nChair recognizes Chairman Sam Watson for an announcement.\nThank you, Mr. Speaker.\nAppropriations of General Government Subcommittee will meet in room 341 upon adjournment.\n341, thank you.\nMr. Speaker, on behalf of Georgia Wand, women's action in a new direction, I would like to invite\nto a legislative T in suites this afternoon at 3 o'clock from 3 to 5. Please join us if you can.\nChair recognizes Chairman Hitchens for an announcement.\nThe Public Safety and Homeland Security Committee will meet in CLOB 606 upon a German.\nChair recognizes Chairman Pruitt for an announcement.\nThank you Mr. Speaker, State, Planning, Commute, Affairs, and Meet today upon adjournment\nin 403 and please be there, very important legislation, we'll be discussing today.\nChair recognizes Chairman Newton for an announcement.\nThank you, Mr. Speaker.\nThe Committee on Access to Quality Healthcare will be meeting immediately upon a German\nin 406 CLOB.\nWe will have a bill being presented and voted on today.\nThank you.\nThat completes our announcements.\nThat completes our announcements.\nThe Chair recognizes the majority leader of the House for a motion.\nMr. Speaker, I move that this house stand adjourned until 10 a.m. Tuesday, February 4, 2020.\nThe majority leader has moved that this house be adjourned until Tuesday, February 4, at\n10 a.m., all those in favor of the motion will say aye. Those opposed will say no.\nthe eyes have it, this house will be adjourned until Tuesday, February 4 at 10 a.m.\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T15:45:00.070701+00:00"
}