{
  "video_id": "FZ2JB2xOoBs",
  "url": "https://www.youtube.com/watch?v=FZ2JB2xOoBs",
  "title": "HBCU Press Conference 3/20/23",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 26,
  "summary": "Overview:\n- This Georgia HBCU Press Conference featured remarks from various state leaders and HBCU presidents, highlighting the importance and contributions of Georgia's historically Black colleges and universities.\n\nKey Actions:\n- No specific bills or legislative actions were mentioned.\n\nBills Introduced (First Reading):\n- None detected.\n\nNotable Moments:\n- Christian Holmes, a graduating senior at White Atlantic University, opened the event by singing \"Lift Every Voice and Sing.\"\n- Senator Sonya Halpern called for the creation of a state-level HBCU initiative and a Senate HBCU internship program.\n- HBCU presidents, including the presidents of Clark Atlanta University, Fort Valley State University, and others, were recognized and spoke about the significance of Georgia's HBCUs.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The event was attended by state leaders, including Governor Kemp, the First Lady, the Lieutenant Governor, and legislators, as well as HBCU presidents and students.\n\nAdjournment:\n- No specific adjournment time was mentioned. The event appeared to be a press conference or program rather than a legislative session.",
  "transcript": "Hello, everyone. I am Christian Holmes. I am a proud graduating senior at the\nillustrious White Atlantic University. So if you guys do not mind standing on your\nfeet with me, I'm going to sing a lift, every voice, and sing.\nLift every voice and sing Till earth and heaven ring\nRing with the hall, my knees of liberty\nLet I reach your sing, raise high as the link, sneak skies, let it resound, loud as the\nSing a song full of the beat that the dark past is taught us.\nSing a song full of the hope that the present has brought us.\nFacing the rising sea of the new day, be guide.\nLet us march on till victory.\nLet us march on till victory.\nLet us march on till the tree is wide.\nThank you.\nGood morning.\nThank you, Christiane Holmes.\nThank you for blessing us with your incredible voice and for being part of today's program.\nThank you as always to Governor Kim and First Lady Kim, our Lieutenant Governor,\nBert Jones, legislators of the Georgia General Assembly, to the presidents and leaders of our\nHBCU colleges in Georgia represented here today, and to the many students and graduates of Georgia's\nHBCUs. My name is Senator Somia Halper, and I am honored to welcome you to the beautiful\nGeorgia State Capitol as we convene for our third annual HBCU Heritage Day. Thank you\nagain Governor Kemp and First Lady Kemp for joining us here today and once again presenting\nthis celebration in partnership with my office. Thank you. So today we salute Georgia's\n10 historically black colleges and universities, better known as HBCUs. Our University System\nof Georgia institutions, Albany State University,\nPort Valley State University, and Savannah State University,\nand our private institutions, Clark Atlanta University,\nthe Inter-Denominational Theological Center,\nMorehouse College, Morehouse School of Medicine,\nMorris Brown College, Pain College, and Spellman College.\nI said the names out loud because they represent\nthe best of our countries, 103 HBCUs.\nAs the 8th largest state in the country and home to 10 HBCUs, Georgia is the model state\nfor higher education excellence and has the opportunity to set the bar forever on the\nnational stage.\nToday, I am calling for us to create and launch the first state-level version of a White\nHouse HBCU initiative.\nI'm a proposing an HBCU Georgia HBCU initiative led out of this building to create sustainable\npublic-private and philanthropic partnerships as well as private sector initiatives to\npromote centers of academic research and program excellence at Georgia's HBCUs.\nI call also on my colleagues to create the first-ever Senate HBCU internship program.\nThat's host an annual meeting with the HBCU Alumni Associations for all HBCUs with\nchapters here in Georgia, the more the better when it comes to excellence.\nThese esteemed institutions have shaped and graduated young people who become leaders\nin academia, business, sports, arts, civic, and faith community.\nAnd let's not forget that here in Georgia, they've also contributed over $1.3 billion to\nGeorgia's economy annually.\nWe are in a better place because of the heritage of Georgia's 10 HBCUs, thank you for coming\nand now we will just have a quick prayer.\nY'all called us, she said quick because I'm Baptist so I won't be before you long.\nLet us bow in prayer.\nMost precious Lord in heaven, hallowed be thy name.\nWe come to you this sacred hour now that our lives might be changed and we thank you\nfor your grace that keeps us day by day.\nLord, it is our prayer that you would just simply have your way.\nFather, we thank you that our leadership of this state,\nour governor, our First Lady, our Lieutenant Governor,\nand all those presidents of the HBCUs have assembled here on today.\nGod, would you just continue to guide the leadership of this state\nthat they may have a hand on our HBCUs\nso that they may grow and continue to prosper.\nWe ask all of these things and your most wonderful\nprecious name we do pray and everyone's sat together. Amen.\nNow have the awesome distinct privilege to introduce our next speaker and that is President\nFrinch. In 2019, George T. Frinch, Jr. became the fifth president of Clark Atlanta University,\nthe largest United Negro College fund member institution in the country and the largest\nprivate HBCU within the state of Georgia. Prior to his appointment, Frinch served for 14\nyears as the president of mouse college making him one of the longest serving university\npresidents in the nation and nationally recognized leader and influencer in higher education and\neducational policy.\nFrench has served three secondaries of education under the United States presidents as a congressional\npointee to the National Advisory Committee on Institutional Quality and Integrity.\nLadies and gentlemen, would you please join me in a warm welcome as we receive George\nSteve French, Jr., President of Clark Atlanta University, and also the President of AUC.\nThank you so much, Senator, for that introduction.\nMost certainly to the Governor, Governor Kim, First Lady, Marty, to our Lieutenant Governor,\nGovernor Jones, First Lady of Clark Atlanta University, Dr. Bacon French, to the Secretary\nstate to Senator Sonia Halpern, to all constitutional officers here, to my colleague presidents,\nthose presidents, that the Senator named, those schools, the hardest working university\npresidents in the nation right here in Georgia, give it up for my colleagues again.\nYou all stand up, we want to recognize you all again.\nMy colleagues, thank you all so much.\nto have my colleague from Albany State University,\nfrom Pain College, from Fort Valley State University,\nfrom Morris Brown College, from the ITC,\nfrom Fort Valley State, Savannah State University,\nand representing Morehouse College.\nThank you, colleagues, for being here.\nAnd most certainly, we have found ourselves here.\nAppreciate it, Governor Kim, for your courage as being the only Republican that visited\nClark Atlanta University, and we took good care of you.\nThank you.\nIt is my distinct pleasure to stand very quickly before you today to thank the state of Georgia\nbecause Senator Halpern is correct.\nWe have an opportunity to leave the nation in displaying partnerships in how a state can\nsupport HBCUs economically and socially.\nWhy?\nBecause we are 20,000 strong, 20,000 of the best and brightest students that you will find\nin the nation, 20,000 students that come here from all over the world.\nThey meet their mates, they find searchers, they find synodogs, and they remain in\ncontribute to our economy. The Senator was right. $1.3 billion is what we contribute annually.\nWe are unapologetically black excellence. That's who we are and that's what we do.\nSo thank you, Senator, for leading the effort on the bipartisan committee and we look forward\nto establishing the first replication of the White House\ninitiative on HBCUs right here in Georgia,\nbecause believe it or not, because of Trockett Lanter,\nbecause of Morehouse, because of Savannah,\nbecause of Fort Valley State, because of Morris Brown,\nbecause of ITC, because of Pain, because of Albany State,\neverybody in this country is saying that Georgia is on my mind.\nGood morning, I'm State Representative Sandra G. Scott and I serve District 76 out of Clayton\nCounty and as you can see I am a graduate of Florida AMM University.\nDr. Paul A. Jones.\nDr. Jones was appointed to serve as the 10th president\nof Fort Valley State University in December 2015.\nBefore joining Fort Valley State University,\nDr. Jones served two years as the interim president\nat Dartmouth State College in Albina, Georgia.\nDr. Jones served in numerous senior leadership roles\nat Georgia College and State University.\nHe also was a professor of education\nadministration of Georgia College.\nDr. Jones is also a member of several boards to include,\nthe Medical Center of Peach County Board of Directors,\nNavier Health Board, Fort Valley State University Foundation\nBoard of Governors, and Dr. Jones in his life\nwas named 2012 alumni of the year at Utah State University.\nPlease welcome Dr. Jones.\nGood morning, Governor Lieutenant Governor Senators.\nIt's really a pleasure to be here this morning with you\nand appreciate the opportunity to speak on behalf of the public HBCUs in Georgia representing\nAlbany State with President Mary Frederick and President Kimberly Ballet, Washington\nof Savannah State University.\nWe appreciate you allowing us to be here today on this very special day, and we also want\nto welcome all of our students that are here to date from across the state.\nHBCUs have had and continued to play a vital role in our country and beyond.\nIn a recent U.S. University System of Georgia Economic Impact Study,\nGeorgia's public HBCUs had a statewide economic impact of $540 million,\nand an economic employment impact of more than 5,100 jobs.\nGeorgia's public HBCUs represent nearly 12,000 students,\nconferred annually roughly 2,500 degrees,\nand importantly, nearly 80% of its students are palgrant recipients\nand many more our first generation students.\nThis means that from a social mobility perspective,\nwe have an awesome task of helping students\nto climb the important social ladder of success,\nwhich not only changes their lives,\nbut it changes the lives of generations to come.\nThese state-supported institutions are diverse\nand are vital to the state's economy,\nlocated in Middle, Coastal, and South Georgia,\nthese institutions play a pivotal role in Georgia's healthcare,\nmarine science, and agricultural economies,\nand so much more.\nWe're also proud of the number of STEM graduates\nthat we produce each year,\nwhich is important to our state's economy.\nAn investment in these institutions\nhas a direct correlation to the overall impact\nof the state's economy.\nAs Georgia's public institutions,\nwe rely much more so than our private counterparts\non the federal, state, and local funding.\nSo now is the time.\nThe time is now for reinvestment, not divestment.\nLet's continue to uplift these institutions\nthat are so important to our state's economy.\nThank you again for having us here today\nto celebrate and recognize the contributions\nthat we make to Georgia's economy.\nThank you very much.\nMy name is Jason Antivatar and I have the opportunity to serve as the chairman of the majority\ncaucus in the Senate and also represent almost 200,000 residents in West George including\nPaulton County, Georgia where I live.\nI want to thank Senator Halpern for bringing us here this morning as she always does and\nwas an honor to serve on the HBCU's study committee that she also chaired.\nAs we look to find ways to advance the mission of all the HBCUs in Georgia through her work.\nAnd hopefully one day we'll be passing an HBCU bill in the Senate and the House will pass it in the governor will sign it.\nIt's my distinct honor to introduce to you the 13th Lieutenant Governor of Georgia.\nHe's a former colleague of mine in the Senate from middle Georgia.\na small business owner, he has run businesses,\nstarted businesses.\nHe's played football at a university\nthat I won't talk about since I went to Georgia Tech.\nHe'll get me later, but I'm very proud of this gentleman\nfor the work that he's done to advance in the lives\nof Georgians in the higher education, K-12,\nbut most importantly, to my heart,\nis moving those that live in poverty,\nto get them jobs and employment,\nand seeing prosperity in our state\nfor the many decades and decades to come for my kids\nand their grandkids down the road.\nSo without further ado,\nthe 13th Lieutenant Governor, Georgia, Bert Jones.\nApplause.\nGood morning, it is good to be with you all this morning.\nI appreciate everybody coming down to the Capitol today.\nI'm looking forward to the lunch I'm having later on\nwith the presidents of our historically blank colleges\nIn universities here in the state of Georgia, there's no question that the 10 public and\nprivate institutions are, it is a long and proud and rich tradition that we have here\nin the state of Georgia.\nAnd I want you to know the state of Georgia is proud of that rich tradition.\nAnd I appreciate Senator Hal Hopperen for all of her hard work.\nI'm going to tell you, I have been down here 10 years and I've served with many colleagues\nsuit. Maybe had one college in mind, they might have had Fort Valley mine or Savannah State\nmine or whatever, but Senator, the good senator from Atlanta here has made sure you should\ngive her a round of applause. She has made a strong effort in making sure that we are\npartners with our colleges and universities and we want to try to do that. So I'm looking\nforward to continuing the work that the senator has done and want to be a\npartner with her in those initiatives that we have and it is a good day to be\nin Georgia and I'm just proud to be with the governor and the first lady here\nand I think you'll see that he and I are on the same page when it comes to this\nissue as well so without further hesitation I'd like to introduce the senator\nThis made it all happen today center house\nOkay, I I'm just gonna quickly introduce a man who really needs no introduction our governor Brian camp\nHe of course is a husband a father a businessman a public servant entrepreneur and he built his first business\nCam development and construction company and understands what hard work is\nand always keeps the minds of Georgians to the forefront every day when he thinks about\nthe needs of this state and the direction that we need to move.\nSo 30 something years later, he sits as our 83rd Governor and has brought much economic\nsuccess to this state, to communities across the state of Georgia, championing us as the\nnumber one place to do business in the country.\nSo with that, ladies and gentlemen, our governor, Mr. Bryant-Jackson.\nThank you very much.\nWell, thank you all very much.\nThank you, Senator Halvin, for that.\nAnd good morning, everyone.\nOn behalf of our great First Lady Marty Kempley,\nwe are honored to be here today.\nAnd I certainly want to thank the great leaders that we have\nfrom our HBCU for spending time with us today.\nI also want to thank Lieutenant Governor Bart Jones for his steadfast support of HBCUs,\nthe rest of the legislators that are here this morning, particularly just want to thank\nDr. French for his leadership and also Dr. Jones for his comments earlier.\nI want to also thank the members of the General Assembly that have had awards for us this\nthis morning, Representative Mallow and Senator Anna Vartarte, and also Representative Scott.\nI appreciate somebody from Florida, A&M, being here to celebrate Georgia's HBCUs.\nThat says a lot about us.\nBut we're just so grateful for opportunities like this and are so grateful that you all\nare in the capital with us today on what you can see as a very busy day and what will\nbe a busy couple of weeks. Some of the nation's most noted leaders graduated from our historic\nBlack colleges and universities right here in the great state of Georgia, both public\nand private. And many of the guests here today are distinguished alumni. We are proud to\nbe home to some of the most renowned HBCUs in the country that have produced major figures\nlike Dr. Martin Luther King, Rosalyn Brewer, one of only two black female CEOs of Fortune\n500 companies, legendary singer and band leader, Cab Callaway, Ralph Abernathy, whose name\nis prominent throughout our capital city.\nThe civil rights leader James Weldon and Johnson, who famously wrote the lyrics to lift\nevery voice and sing.\nKeisha Knight-Polium, who of course charmed all Americans as Rudy Huckstable and her other\nroles in many, many more.\nThe students who have walked these campuses of this proud history have broken barriers\nin science and engineering, in art and culture, in the very course of events of our state and\nour nation.\nIt is important that we continue to build on that valued legacy.\nIn many cases, HBCUs opened the door for educational opportunity that did not exist before\nas Dr. Jones just alluded to.\nThat is why we have made and will continue to make key investments to further the good\nwork of our HBCUs and other institutions.\nLast year we allocated $230 million to eliminate the Special Institution fee at our public universities\nand colleges, including our three HBCUs here in Georgia.\nAnd this year I proposed an additional $61.2 million to fully fund the HOPE Scholarship\nand grant awards at 100% of tuition for all public higher education in the state.\nI will continue to advocate for that increase\nas the budget moves forward in the process,\nbecause it would save an average of $444\nfor all full-time students each year\non top of savings from no longer having to pay\nthe institution fee.\nBut even more so, fully funding hope\nrepresents what we're talking about today,\nconnecting opportunity to learners\nfrom literally all communities.\nAs we all know, having the right teacher\ncan also make a world of difference.\nAnd that's why as part of my office's teacher pipeline\npackage that passed a couple of years ago,\nwe included a provision that requires\na professional standards commission to work closely\nwith HBCUs to track greater numbers\nof minority teachers into the field.\nStudents from all backgrounds should be able to see\nthemselves in their teachers.\nAnd that's what this measure does.\nWe also appreciate and need your students\nin Georgia's workforce.\nAs was mentioned,\nGeorgia's the number one state in the country for business.\nAnd the students that you are pumping out\nin arts, entertainment, engineering,\nmedicine, business, and more\nare vital to our future in the state.\nAnd by working together with the leaders and students\nto HBCUs represented here today and by working with local and state officials and with other\neducational leaders, we will continue to celebrate and support our HBCUs because they are\nimportant part of why Georgia remains the best place to live, work and raise a family.\nSo thank you again for your partnership in these efforts and also for what you're doing\nto prepare the next generation of leaders in our state.\nCongratulations on another successful year\nand for your steadfast work.\nGod bless.\nWell, we have come to the end of our program, but I want to remind us that it is incumbent upon\nus to make sure that the legacy of HBCUs continues so that these institutions for higher\neducation can continue to not only make an impact on African Americans, but also on\nour communities, our state, and our nation.\nI do have a resolution marking today as HBCU Heritage Day,\nwhich I will get to each of our presidents.\nAnd separately, I have a resolution actually honoring\neach of you for your leadership, your steadfast guidance,\nand direction that you give these important schools\nevery single day.\nThank you for everything you do.\nTo our Governor and First Lady, Lieutenant Governor,\nGeneral Assembly colleagues, and of course, again,\nour HBCU presidents and their institutions.\nThank you for what you do and what you mean\nto historically black colleges and universities here in Georgia.\nI want to thank each and every single one of you\nfor attending today's HBCU period of day 2023.\nSo let's give a final round of applause\nto all of our honorees, Albany State University,\nClark Atlanta University, Fort Valley State University,\nthe Interdenominational Theological Seminary,\nMorehouse School of Medicine, Morehouse College,\nMorris Brown College, Pain College,\nand Savannah State College.\nThank you to each of you for what you're doing.\nThank you for celebrating with us again today.\nI can never talk about HBCUs without just saying\nthat though I did not go to one myself,\nI am the beneficiary of an HBCU education,\nhaving parents who both grew up in the 1940s\nAnd Jim Crow, Mississippi, on farms,\nwho found their way to an HBCU and created a life\nthat they never could have dreamed for themselves\nand my sister and I.\nSo keep doing the work that you're doing.\nAnd thank you again.\nThank you, everybody.\nHope you're doing well.\n",
  "updated_at": "2026-02-12T10:37:03.646646+00:00"
}