{
  "video_id": "G89KSkUUlDM",
  "url": "https://www.youtube.com/watch?v=G89KSkUUlDM",
  "title": "3/20/23 - Committee on Government Oversight",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Here is a summary of the Georgia 3/20/23 - Committee on Government Oversight session:\n\n**Overview**\nThis was a routine committee session focused on passing a single bill, HB 269, which allows local workforce development boards to conduct meetings via teleconference.\n\n**Key Actions**\n**HB 269**: Allows local workforce development boards to conduct meetings via teleconference, with a requirement that the meetings be recorded.\n\n**Bills Introduced (First Reading)**\nNone.\n\n**Notable Moments**\n- The session opened with a prayer led by Senator Robertson.\n- There was some lighthearted banter between the chair and Representative Blackman when introducing the bill.\n- The committee unanimously passed HB 269.\n\n**Votes**\n- HB 269 passed the committee unanimously.\n\n**Attendance**\nNo specific quorum notes, but the session appears to have had full attendance.\n\n**Adjournment**\nThe committee adjourned after passing HB 269. No specific date for the next session was provided.",
  "transcript": "I know that they are very sad about that, but that's okay, we're getting down to the last\nLast, okay, okay, gonna crown that one, okay, I'm doing that.\nSenator Robertson, why don't you, if you will,\ngive us a hard word and pray for us this morning.\nI will, those who are comfortable doing so,\nif you'll buy your head with me.\nGood afternoon, Heavenly Father.\nWe thank you, Lord Jesus, for the wonderful day.\nYou gave us, Lord God, the crisp weather this morning\nand the feeling, Lord God, that we know we're here to serve you.\nWe ask God during this hearing today\nthat we keep our hearts and our minds open\nas the individuals bring legislation and ideas\nbefore us Lord God that will impact the lives\nof every single citizen that lives in this state.\nKeep your hand on those we serve Lord God\nand please keep us faced in the correct direction.\nWe ask all these things in the name of your precious son,\nour Lord and Savior, Jesus Christ, amen.\nThank you, sir.\nI brought my gavel so we can bring us into order\nIn case Senator Blackman needs help.\nWe're going to be looking at HB 269 working from LC 472466S.\nPublic comment, excuse me, 472466S, is that what I said?\nOkay, and public comment, if there's a sign-up sheet here,\nif you'd like to speak on it, Senator Blackman,\nWe're, have you come up right now and present the bill?\nAnd we?\nOh, I'm sorry.\nRepresentative, I'm sorry.\nPromotion.\nI don't want to promote you too soon.\nThough we have some great guys that have come from the house\nthat are here with us right now.\nSo this is what you can be when you grow up, who knows?\nWell, I, you know, I love my Senator, he's a dear friend,\nSo I'm glad he's there.\nAnd as a matter of fact, bringing before you,\nMr. Chairman, House Bill 269, members of the committee,\nhe and I have actually been approached\nby a constituent and a good friend, Steve Williams,\nwho is on our local workforce development board.\nAnd once you get into more rural parts of Georgia,\nthe areas that they cover geographically\nare quite expansive.\nI think we have an 11 county service delivery area\nAnd so he has asked that we allow those boards to meet via teleconference.\nAnd I think you have amended the bill to require that it is recorded,\nsuch as any open meeting would be.\nAnd that's really the basis of the bill.\nAnd I'll be happy to try to answer any questions if there aren't any, Mr. Chairman.\nOkay.\nAny questions, comments on the bill?\nPretty simple.\nHave one.\nWhat number?\nnumber four. Yes. It's not a question. It's a comment. Is it not true that\nCOVID has taught us that we can do a lot of things now rather than just\nbeing in person? Is that not a statement of that? I think the lady knows which\nspeaks. Thank you, Mr. Chairman. All right. Any other comments? Questions?\nThat's right time. Right time. Right time. Right time. Right time. Right time.\nPress. Press. Press. Press. Right now. At the right time, Mr. Chairman, I\nMake a motion, do pass.\nThat's a second.\nWe have a second.\nOkay.\nAny other comments, questions?\nNone.\nOkay.\nAll in favor.\nRaise your right hand.\nAll opposed.\nI'll get you to use your left hand.\nOkay.\nOkay.\nIt still counts.\nOkay.\nWe're represented black when I think you can go forth.\nYou just have to go to rules.\nAnd we're done there.\nThank you, Mr. Chairman, members of the committee.\nThank you very much. Go forth. Okay, and we had a vote unanimously and let's say we've got anything on that\nIt's just the passage of hb269 lc472466 s\nAll right, and members of the committee. Thank you for your time. Thank you for your commitment and\nWorking with us. It's been fun and\nWe we appreciate it and with that we're gonna dismiss us and we're gone\nBye-bye!\n",
  "updated_at": "2026-02-12T10:39:44.358531+00:00"
}