{
  "video_id": "gAKXj83ivOY",
  "url": "https://youtu.be/gAKXj83ivOY?t=1155",
  "title": "Georgia House - Day 25 (2026-03-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": "2026-03-08",
  "duration_minutes": 172,
  "summary": "Here is a structured markdown summary of the Georgia House session:\n\n**Overview**\nThe session began with a prayer and scripture reading by the chaplain, Pastor Ward Law. His message focused on the importance of unity and working together, drawing parallels between the Georgia legislators and his own family's experience of staying united.\n\n**Key Actions**\nNo notable bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Pastor Ward Law, the guest chaplain, gave a speech emphasizing the need for unity and cooperation among the legislators, despite their different backgrounds and political affiliations. He encouraged them to put aside partisan divides and work together for the greater good.\n- Representative Lisa Hagen introduced Pastor Ward Law and provided some background on his involvement in the community.\n\n**Votes**\nNo recorded votes were taken.\n\n**Attendance**\nThe session maintained a quorum, with legislators present to conduct business.\n\n**Adjournment**\nThe session was adjourned. The next session date was not provided in the transcript.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I'm to a point. I don't know about you. I cannot almost can't watch the video of the children anymore. If that's not a war crime, I don't know what amounts to one. But after that cherry note, we will begin our day with scripture reading and prayer by the chaplain. After which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 156th House District Representative Lisa Hagen, representative Hagen. Thank you, Mr. Speaker. Good morning, colleagues. I hope you had a wonderful weekend. Is my honor to introduce our chaplain of the day today. Well, first of all, I'm going to start by introducing his wife, Stephanie. I know we're so excited to have guests of our chaplains back in the chamber. So I want to recognize Stephanie Ward Law. She teaches business education at J.R. Trip Middle School. J.R. Trip Middle School in Vydalia, Georgia. They are the parents of Mark and Carly. So Pastor Ward Law is the pastor of Green Grove Missionary Baptist Church in Dublin. He is the son of Reverend Dr. Car award law junior and sister Mary Ward Law. Like most of the good people in this room, he is a UGA grad. Yes, good dogs. And I could have asked him to come and speak to us this morning because he is the host of the very popular weekly radio show called Community Matters on Y 101 in Lies, Georgia. And I could have asked him to come and speak to us this morning because he is a member of the National Award-winning Gospel Group, the Ward Law Brothers. But that's not why I asked him to come this morning. I asked him to be here this morning because I know that he, as we've gotten to know each other over the past few months, is a strong brother in Christ who loves the Lord and the scripture. And I felt like he would be a great person to come and share that good news with us this morning as we start our week. So thank you, Pastor Ward Law, for being here with us today. Good morning. It's good to be here. It's an honor to be here with you on today. To speak of Ralston, to my own representative, Lisa Hagen, and to all of you, our elected officials and representatives, again, it is an honor to be here. This is my first time at our state's capital. Took me almost 49 years to get here. As I walked up, Speaker Ralston told me that as a Baptist, I would have extra time. As I come to address you on this morning, or civic servant leaders, I do greet you as the pastor of the Green Grove Missionary Baptist Church in Dublin, Georgia. At Green Grove, our motto is, we can get there if we work together. In line with this God-given understanding, my message to all of you on today is to be unified and work together. Be unified and work together. I grew up in a little city called Lions, Georgia, and the oldest of six children, five boys and one girl. Though my parents were married as teenagers, they brought my brothers and sisters and me up, training us in the wisdom of being unified and working together. They taught us that even though we were different, we're different personalities, different characteristics, different needs, different abilities, that it was okay because it was our differences that made us strong together. In our home, we were taught to love each other. When one had, we all had. When one of us was in need, we all rallied together to tend to their needs. And even though I was the oldest and the smartest and the best looking, except for my sister, of course, our parents treated us all the same. In our house, there was no big guys or little use. When we sat around the dinner table, if our individual ideals and actions did not benefit the whole family, our parents quickly at Monash dust and reinforced their instructions that as a family, we are to be unified and work together. This year, my parents will celebrate 50 years of marriage. And what a blessing it is that after half a century, my siblings and I with married with our own children, we are still unified and working together. My parents believe in God. They trust God and His will. And I thank God that they taught us to do the same. And I know now that it is God Himself who said in Genesis the 11th chapter in the 6th verse, that when humans are on one accord and work together, there is nothing that will be impossible for them. As I look around this room, I see people of differing shapes, sizes, and colors. And when I consider the mixed population of our state, I am certain that not only do you represent people of varying cultures and ethnicities with different values and opinions, and some who even have opposing beliefs. But I am aware that you also have come here with your own individual viewpoints and political stances. So then, as I stand here, I feel it almost in vain. To ask you to be unified and work together, when I know that there already exist lines in the sand that have been drawn that many of you have given a vow not to cross. I stand here and I feel it almost in vain to ask you to be unified and\n\nwork together. When I know that there exists boundaries, goals, and agendas that have already been set to which many of you have given pledges of your allegiance. Yet, here I stand, not with pessimism, but I stand here happy. In fact, I stand here before you and I'm filled with joy because while it may seem that you're being unified and working together are unimaginable to some, I'm so grateful and thankful that I know that we serve a God and that with him all things are possible. And I thank God that from the time of the great division of the people due to their rebellion and disobedience way back in Genesis chapter 11, God ignited his plan to restore obedient unity to all mankind. Through 42 generations, beginning with a man named Abraham, in the 12th chapter of Genesis, God sent his only begotten Son, Christ Jesus, into this world so that we will and that we all might appropriately work together for God's purposes and not our own. It is through His Son Jesus that God provides for us the only way, the only truth, and the only life. There is no other way to God's great and perfect utopia of existence except through Jesus Christ our Lord. You need to know that Jesus gave up his life and he died for all mankind so that we all might be unified under his shed blood. He was buried in a borrowed grave so that we all might choose to bury the vices that divide us. And then early one Sunday morning, God raised Jesus up and gave him all power and authority, all power in heaven and in earth. And with all power, I stand here today to tell you that Jesus is above all partisanship. With all power, Jesus is beyond all politics. With all power, Jesus is neither conservative nor liberal. With all power, Jesus is neither Democrat nor Republican. But He is independently God. And He commands that we all work for His glory and not our own. And if I was at Green Grove Missionary Baptist Church, it is at this moment that I would say let the church say, amen. Will you please stand with me and let us have a word of prayer. Let us pray. Dear God, our Father, as I come on this morning, I pray for these our elected officials today that as they are here representing their constituents throughout this beautiful state of Georgia. And as they have come to legislate on behalf of us all, let it not be their wheels or the wheels of others. But God help them to be courageous enough to let your will be done. I pray that each one of these will allow your love for all people to be the compass by which they navigate their decisions. I pray that collectively this body will be your example for the world and the rest of these United States of America, always providing a picture of your peace, your harmony, and your unity. Father, I do not pray only for these you have chosen to represent us. But I pray for every citizen of this great state of Georgia. I pray for this great nation. And yes, God, I take a moment to also pray for those who are suffering in Ukraine. I pray that regardless of our race, color, or creed, that you will keep us all and help us all be unified together as one in you. Keep us so God and protect us always from the evil one. For yours is the kingdom and the power and the glory forever in Jesus' name, let every heart say amen. Ziarchy, person, unlock the doors. Members may greet the chaplain in the south Annie room. Chair recognizes Chairman Hogan, the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of a previous legislative day and found it to be correct. And furthermore, Mr. Speaker, one day you're a peacock and the next day you're a feather duster. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on a 59th moves, the following will be established as the order of business and the first part of the period unanimous consent. Introduction to bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. Third reading and passage of uncontested local bills and resolutions. First reading and reference of Senate bills and resolutions. Second reading orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions. The clerk will read. House bill 1521, Representative Montaughan of the 17th, clerk of the 147th, corporate of the 174th, next to the 16th, Smith, the 133rd, and others. Will be titled an act to amend Code Section 27231 and the fiscal to Georgia and TATA relating to wildlife control permits. Game, Fish and Park. House bill 1522, Representative Ridley, the 6th, will be titled an act to amend Code Section 101831. Will be fiscal to Georgia and TATA relating to required information from operators of beauty cuts. Agriculture and consumer affairs. House bill 1523, Representative Loud of the 120 second, Cooper, the 43rd, Jones of the 25th, Powell of the 32nd, corporate of the 174th. Will be titled an act to amend Title 33, the fiscal to Georgia and TATA relating to insurance. Ways and means. House bill 1524 by Representative Howard of the 120 fourth, for Frazier, the 126th, Prince of the Lone and 27th, Nelson Lone, 25th, Newton Lone, 23rd. Will be titled an act to amend Chapter 8, and Title 48, the fiscal to Georgia and TATA relating to sales and use taxes. Ways and means. House bill 1525, Representative Ridley, the 6th, Powell of the 32nd, Washburn, the 141st, will be titled an act to amend Title 43, the fiscal to Georgia and TATA relating to professions and business. Regulated industry. House bill 1526 by Representative Wilson of the 80th, the bill being titled an act to amend Chapter 4, Title 49, the fiscal to Georgia and TATA relating to public assistance. House bill 1527 by Representative Matthew Act of the 73rd, Powell of the 72nd, color of the 8th camp, the 131st, Jenkins, the 32nd and others. Will be titled an act to amend Article 6, Chapter 10, the Title 15, the fiscal to Georgia and TATA relating to constables, clerks and other court person. Judiciary. House bill 1528 by Representative Mopton, the 17th, the 5th, Corbin of the 174th, Park of the 150th. Chocus, the 138th and others. Will be titled an act to amend Article 14 of Chapter 1, the title 10, the fiscal to Georgia and TATA relating to secondary mental recycling. House bill 1529 by Representative Williams, the 168th, Steven's the 164th, P3 166, the Lodge of the 167th and Workheyser, the 157th. Will be titled an act to amend the act to provide for supplement for the compensation, expense, and for the office. Judiciary. House bill 1532 by Representative Ridley, the 6th, gravity, the 67th, grows the 120th and Corbin of the 174th. Will be titled an act to amend Chapter 23, the title 2, the fiscal to Georgia and TATA relating to hemp farming. Agriculture and consumer affairs. House bill 1533 by Representative Newton of the 123rd, Cooper the 43rd, Friday the 118th, Dempsey the 13th and all of it's the 42nd. Will be titled an act to amend Chapter 1, the title 43, the fiscal to Georgia and TATA relating to general provisions relative to professions and businesses. Special committee on access to quality health care. House bill 1534 by Representative Holcomb of the 81st. Will be titled an act to amend Article 4, Chapter 5, the title 17, the fiscal to Georgia and TATA relating to investigating sexual assault. Judiciary non-civil. House resolutions 915 by Representative more than 90th, Cantrell, the 22nd, Mitchell, the 88th and Thomas the 65th. The resolution for proposing and amendment of the Constitution says provide that members the general assembly elected in 2024 and thereafter shall serve for year terms of law rules. House resolution 916 by Representative Dutz the 154th, Williams the 168th, Thomas the 65th Wilkerson, the 38th and Jackson the 128th and others. The resolution creating the Joint Study Committee for the expansion and national competitiveness of Georgia agriculture. Agriculture and consumer affairs. House resolution 917 by Representative Howard the 124th, Alexander the 66th and Evans the 83rd. The resolution creating the House Study Committee to assess two young to suspect. Education. House resolution 918 by Representative Hustration 104th, the resolution honoring the life of Judge Ramone Elvardo and dedicating a bridge in his memory. Transportation. House resolution 919 by Representative Williams the 145th, Gilear the 162nd, Hitchens on the 61st, Powell the 32nd, Campbell the 171st and others. The resolution urging the Federal Railroad Administration to follow through. Transportation. House resolution 931 by Representative Carson the 46th, the resolution honoring the life of Mr. Edward Kip William Klein in dedicating an intersection of his memory. Transportation. Senate Bill 382 by Senator Robertson the 29th, Albus the 56th, Guch the 51st, Couser the 46th, Walker of the 20th and others, Abilbe Tadon, Acto Men Code Section 1664. The Fiscal to Georgia, Antietta, Religate the Child Malin, Station and Aggravated Child Malin Station. Judiciary non-civil. Senate Bill 486 by Senator Harper the 7th, Walker the 20th, Anderson the 24th, Simmons the 12th, Goodman the 8th and others. Abilbe Tadon, Acto Men Article 6, Chapter 8 and Title 2, the Fiscal to Georgia, Antietta Religate and Aggricultural Community Commission. Agriculture and Consumer Affairs. Senate Bill 493 by Senator Mullis the 53rd, Guch the 51st, Bill of the Tadon, Acto Men Part 7, R, P5, Chapter 3, Title 44. The Fiscal to Georgia, Antietta Religate and Miss Alainey's provisions regarding time share projects. Judiciary. Senate Bill 529 by Senator Guch the 51st, Albus the 56th, Berkeley the 11th. Harveston the 15th, Mullis the 53rd and others, Bill of the Tadon, Acto Men Chapter 76, the Fiscal to Georgia, Antietta Religate and Expedited, Franchise. Energy, Utilities and Telecommunications. That completes First Readers. Second reading of Bills and Resolutions, the Clark-Married. House Bill 1488 by Rebson Campbell the 171st, the Bill to amend and act to provide a new charter for the City of Palombe. House Bill 1489 by Rebson Moptan of the 17th, Gallup of the 19th, Crabley of the 67th and Gallup of the 16th. Bill to amend and act to create board of commissioners of Paul Dink County, House Bill 1490 by Rebson Hagen of the 156th, which of the 97th Jones of the 47th, Limit of the 99th, Workhies of the 157th, the Bill relating to elections of primaries. House Bill 1491 by Rebson Moptan of the 17th, Powell of the 32nd, Stevens of the 164th, Gallup of the 19th, Ripley of the 6th and others. Bill relating to generation distribution of electricity. House Bill 1492 by Rebson Jones of the 47th, Cantrell of the 22nd, the Bill to amend and act to incorporating the City of Milton. House Bill 1493 by Rebson Jones of the 47th, Cantrell of the 22nd, the Bill to amend and act to incorporating the City of Milton. House Bill 1494 by Rebson Gull of the 19th, Martin of the 49th, Anderson of the 10th, Moptan of the 17th, Gamble of the 15th, Bill relating to electrical service. House Bill 1495 by Rebson Duke, so 154th, the Bill to amend and act to create a board of commissioners of Seminole County. House Bill 1496 by Rebson Gull of the 19th, Richard of the 97th, Anderson of the 10th, Dickey of the 140th, Gaines of the 117th and others. Bill relating to livestock running at large. House Bill 1497 by Rebson Jones of the 47th, Cantrell of the 22nd, the Bill to amend and act to incorporating the City of Milton. House Bill 1498 by Rebson Halkham in the 81st, a Bill relating to requirements as to extraordinary motions for new trial. House Bill 1499 by Rebson Park of the 101st, abstraction of the 104th, Clark of the 13th, the Bill of the 18th, Richard of the 97th, proclaiming the 100th and others, a bill to amend and act continue to recreate the State Court of Quinnett County. House Bill 1500 by Rebson Washburn of the 111st, Burns of the 159th, Watson of the 172nd, Powell of the 32nd, Williams of the 115th, the Bill relating to professions and businesses. House Bill 1501 by Rebson, Leopard of the 33rd, Williams of the 115th, hatched of the 150th, the Bill relating to regulation of employment of minors. House Bill 1502 by Rebson gains of the 117th, with our 119th Collins of the 68th, empty of the 13th Williams of the 115th and others. Bill of the 182th, serious traffic evidences, House Bill 1503 by Rebson Evans of the 83rd, all over the 82nd, Drener of the 85th Park of the 101st, Clark of the 180th and others, the Bill relating to the General jurisdiction, powers and duties. The Public Service Commission House Bill 1504 by Rebson Clark of the 51st, Scofield of the 60th, Beverly of the 143rd, Mitchell of the 106th, Kenner of the 102nd and others. Bill relating to state government, House Bill 1505 by Rebson Smith of the 18th, Dundra of the 8th, Schoggins of the 14th, Fleming of the 121st, a Bill relating to impersonating a public officer or employee, House Bill 1506 by Rebson, Morin of the 96th and Park of the 101st, Win of the 89th, a Bill relating to holidays and insurances, House Bill 1507 by Rebson of the 17th, Gallaud of the 19th, Bradley of the 67th, Kelly of the 16th, Ailey Sandler of the 66th and others, a Bill relating to an act to amend a former local constitutional amendment, House Bill 1508 by Rebson of the 119th, Guntran of the 8th, Bradley of the 67th, Gaines of the 117th, Airehart of the 36th, a Bill relating to the juvenile code, House Bill 1509 by Rebson, Gellier of the 162nd, Stevens of the 164th, Jackson of the 165th, Hitchens of the 161st, Mallow of the 163rd, and others, a Bill to amend an act completely revising the laws, Relator to the governing authority of Chatham County, House Bill 1510 by Rebson, Gellier of the 160th, Stevens of the 164th, Jackson of the 165th, Hitchens of the 161st, Mallow of the 163rd, and others, a Bill to amend an act relating to the school system of the city of Savannah and Chatham County, House Bill 1511 by Rebson Smith of the 18th, Green of the 151st, Mathes of the 144th, Jenkins of the 132nd, Evans of the 57th, a Bill relating to the Georgia Comprehensive Solid Waste Management Act, House Bill 1512 by Rebson of the 32nd, Benson of the 31st, Tarvon of the 2nd, a Bill to relating to the State Flag, Seal, and other symbols, House Bill 1513 by Rebson Maynard of the 56th, Limit of the 199th, the Bill relating to Elementary and Secondary Education, House Bill 1514 by Rebson Maynard of the 56th, and Bennett of the 94th, the Bill relating to Physical Therapists, House Bill 1515 by Rebson Bentley of the 139th, Martin of the 49th, Dempty of the 13th, Jackson of the 128th, Pall of the 32nd, others, the Bill relating to definitions regarding tuition, equalization, grants, and private colleges and universities, House Bill 1516 by Rebson, Gating to the 170th, with hour of the 119th, Friday of the 118th, the Bill relating to the Georgia Music Hall of Fame Authority, House Bill 1518 by Rebson of the 142nd, Hutchinson of the 17th, Beverly of the 143rd, Davis of the 87th, Scofield of the 60th, the Bill relating to Health, House Bill 1519 by Rebson of the 193rd, Newton of the 123rd, Jasper of the 11th, Hawkins of the 27th, Hutchinson of the 150th, a Bill relating to Insurance, House Bill 1520 by Rebson of the 27th, Jasper of the 11th, Cooper of the 43rd, Bentley of the 139th, Dems of the 13th, another, a Bill relating to Health, House Bill 1530 by Rebson of the 174th, Nick of the 169th, Hogan of the 179th, Evans of the 15th, Campbell of the 15th, another, a Bill relating to Education, House Bill 1531 by Rebson of the 30th, 175th, Petri of the 166th, Newton of the 123rd, the 122nd, Williams of the 148th, a Bill relating to Regulation of House Bill, related institutions, House Resolution 896 by Rebson of the Hitchens of the 166th, Clark of the 147th, Bonner of the 72nd, Prince of the 127th, Williams of the 168th, Resolution Creating the House Study Committee on Alternative Post-Traumatic Stress Disorder Treatment Resources for Veterans, House Resolution 897, Rebson of the Hitchens of the 161st, the Workhides of the 157th, Resolution Onering Life of Sheriff Quentin Rush, dedicating a road in his memory, House Resolution 898, Rebson of the 155th, a Resolution Recognizing Commemoring Threats and Violence against Historically Black Colleges in the Universities, Reaffirming Support for HBCUs and their students, House Resolution 8908 by Rebson of the 166th, Pevelaib the 143rd, Boady of the 62nd, Scott of the 76th, McLean of the 100th, Resolution Proposing a Memor to the Constitution, so as to create the Family and Medical Leave Insurance Fund, House Resolution 920 by Rebson of the 7th, Jones of the 47th, Burns of the 159th, Pevelaib the 143rd, Smith of the 134th, and others, Resolution Condemning the Invasion of the Ukraine by the Russian Federation, Senate Bill 403 by Senate Erwatsen of the 1st, Albers of the 156th, Cousin of the 46th, Roberts of the 29th, Carpathic of the 32nd, others, the Bill relating to Mental Health, Senate Resolution 504 by Senate Ermoles of the 53rd, Hatch of the 50th, Anderson of the 24th, Future of the 51st, a Resolution creating, recognizing the significant role of that Native tribes have played in Georgia and dedicating a tree on the state capital grounds in their honor, for your second readers. with his Hatch of the 60th the 20rd and 31th of January 61th. on the 19th of Janoday in Florida. With С innovates in Le Girith dust a controversial event called a The committee is the clerk will read. President Janet Haggerstead, the 160th district chairman of the committee on intergovernmental coordination local submit to the following report. Mr. Speaker, committee on intergovernmental coordination locals had on consideration following bills of the House and senators instructing me to report the same back to the House following recommendations. House Bill 1475, Duke Pass House Bill 1476, Duke Pass Senate Bill 554, Duke Pass Senate Bill 555, Duke Pass respectfully submitted. Representative Tanker, the 160th district chairman. Representative Abstration of the 104th district chairman of committee on judiciary submitted the following report. Mr. Speaker, committee on judiciary is that on consideration following bills of the House and instructing me to report the same back to the House and following recommendations. House Bill 1350, Duke Pass by substitute. House Bill 1499, Duke Pass respectfully submitted. Representative Abstration of the 104th district chairman. Representative James Barchett of the 176th district chairman of the committee on judiciary noncivil submitted the following report. Mr. Speaker, committee on judiciary noncivilist. Has that on consideration following bills of the House instructing me to report the same back to the House and following recommendations. House Bill 689, Duke Pass House Bill 1354, Duke Pass by committee substitute. House Bill 1391, Duke Pass House Bill 1433, Duke Pass House Bill 1452, Duke Pass respectfully submitted. Representative James Barchett of the 176th district chairman. Representative Richard Smith, the 134th district chairman of committee on rules submitted. The following report, Mr. Speaker, your committee on rules is that on consideration the following resolution of the House. As the start to meet the report the same back to the House and following recommendations. House resolution 920, Duke Pass respectfully submitted. Representative Richard Smith, the 134th district chairman. That completes the reading of the report to standing committees. We're about to go on to the local calendar. Third reading and passage of uncontested local bills. If there is no objection we will vote on the local calendar as a whole with a recorded vote. Hearing none it is so ordered to clerk will read the local calendar. House Bill 1475, I'm representing the member of the 33rd Albert County. House Bill 1476 by the represent of the member of the 33rd City of Colbert. Senate Bill 554 by Senator Matullary, the 19th Trutland County. Senate Bill 555 by Senator Matullary, the 19th Trutland County. Is there any objection? Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. We have all members voted. If so, the clerk will lock the machine on the passage of the bills on the local calendar. The eyes are 100 and 51. The nays are four. These bills having received the requisite constitutional majority are therefore passed. All right, we have a couple of motions to take up. I want to listen up here. On Friday, March 4, the House passed House Bill 1. The lady from the 58th District served notice of a motion to reconsider the action of the House in giving House Bill 1 the requisite majority. Now is the time for the lady to pursue the motion if she so desires. She desires. On the lady's motion that this House reconsider its action in giving House Bill 1 a requisite majority, all those in favor of reconsideration will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the lady's motion for reconsideration on House Bill 1. The eyes are 70. The nays are 89 and the motion has failed. On Friday, March 4, this House passed House Bill 1084. The lady from the 58th House District served notice of a motion to reconsider the action of the House in giving House Bill 1084 the requisite majority. Now is the time for the lady to pursue the motion if she so desires. She does desire. On the lady's motion that this House reconsider its action in giving House Bill 1084 a requisite majority, all those in favor of reconsideration will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members now voted? If so, the clerk will lock the machine on the lady's motion for reconsideration on the\n\n71 the nasa 92 and the motion has failed We're going on now to morning orders going on to morning orders Two minutes each on morning orders today the chair recognizes Representative Ken Trail for a morning order Thank you mr. Speaker Colleagues I stood before you on Friday and we had a really nice bipartisan moment as we all agreed that We should ban the import of Russian oil and am I correct We did have a nice moment didn't we? I'm hoping that we're going to have another nice bipartisan moment here A few years ago I stood in this very spot and I took up for a certain soft drink company who has their corporate headquarters here in Georgia The week of the Super Bowl This same company has no problem speaking out publicly about political issues However, they have remained strangely silent when it comes to the issue of Russia's invasion of Ukraine We've not heard a word from them now to their to their credit They did give a nice contribution to help the refugees who are leaving Ukraine, but to that contribution I say Bless your heart bless your heart. There's so much more you can do So I hope we can all join together and urge this certain soft drink company That resides just a few miles from here To cease and assist any business transactions with the company with the country of Russia. Can we agree on that? And furthermore, mr. Speaker I would call on any Georgia company To cease and assist any business relationships with the country of Russia. It's time for the real thing To keep it real by doing the right thing and doing it now. Thank you, mr. Speaker chair recognizes representative Alexander for a morning order Thank you Thank you, mr. Speaker this morning we held the seventh annual nicotine round-dose servant leadership awards sponsored by the Georgia women's legislative caucus We recognize and celebrate it 27 women serving in their communities our theme Courage Commitment and community Congratulations to all of the honorees for your outstanding services It is appropriate to have this event today because we also celebrate international women's day on today Also march is women's history month Thank you, mr. Speaker You All right, we're gonna go into the rules calendar Going on to the rules calendar The clerk will read the caption to house bill 1042 House bill 1042 by represent jasperous the eleventh and others to be titled back to men chapter 34 title 50 the physical to Georgia Really no one Georgia authority act So it's to provide for a grant program to establish primary care medical facilities in health professional shortage areas This bill I'm referring to committee on health and human services that committee recommends a dis bill do pass chair recognizes chairman rick jasperous to present the bill Thank you, mr. Speaker and members House bill 1042 Authorizes the one Georgia authority to create a grant of up to 200,000 dollars for a primary care Medical facility in a high-need area It's a recommendation from the real development council to promote primary care in rural areas The placement of these physicians offices would be determined by review of primary care shortage in the reason and must Have the commitment of the local development authority and other parties It must be consistent with local health care objectives of readiness and feasibility The grant would need the final approval of the governor and the Department of Community Health It's hope that this will give rural Communities another tool the toolbox To improve health care in their communities So my bill for speaker I'd be glad to answer any questions The You'll for questions yes, sir chair recognizes representative jasmine Clark To your left for a question. Thank you, mr. Speaker does the gentleman yield. Yes, ma'am So I'm very curious um in this grant program. We are going to Allow physicians to open practices in these rural areas how are we going to make sure that these physicians are able to Stay open if the people in those areas do not have access to health insurance Well, what this bill actually does is allows a local development authority with other partners in the community To provide a space for a physician to move if they choose to And I'm sure the communities in doing that will make it so the physician can be successful And that's what this bill does Does the gentleman further you sure would not Expansion of Medicaid at least help Make sure that these physicians are going to be compensated for the care that they will deliver to these communities that they will move into Well, thank you for your Com yet, but I think most Everyone knows that if physicians office is the economic development positive in the community And this will help all these communities that do take advantage of this doing that Thank you And look forward to Do you really use the will? Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection? To agreeing to the report of the committee which was favorable to the passage of the bill The chair here's none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of the bill will vote aye Those opposed will vote no and the clerk will unlock the machines Have all members voted If so the clerk will lock the machines on the passage of House bill 1042 the eyes are 162 the nasors zero This bill having received the requisite constitutional majority is therefore passed You Clerk will read clerk will read the caption House bill 1304 House bill 1304 borrowers and have hawkins the 27th and others to be entitled act to amend title 31 of the physical to Georgia Antidelaid and health so as to create the Georgia caregivers act To provide for definitions to require hospitals to provide patients the opportunity to identify the lay caregivers Is bill ever further committee on health and human services that committee recommends a dispelled do pass My committee substitute Chair recognizes representative hawkins to present the bill. Thank you madam speaker I bring before you today has bill 1304 is the Georgia caregiver's act You know some point in our life We give care to our loved ones whether it be our spouse or our children grain children and they do the same for us What this bill addresses is the care that's given Post hospital care and it calls for the hospitals to allow a patient to identify their caregiver and then upon dismissal that caregiver is contacted by the hospital and before the patient is dismissed The cares reviewed with that caretaker will caregiver not caretaker Um, we got enough caretakers in this room. I think anyway don't we But the caregiver at that point realizes what's involved And they may elect at that time for the patient to go to an extended care facility for a while And that's the best for the patient What this bill is about is what's best for the patient best for Georgians So with that being said madam speaker I will yield the wealth there are no questions there are no questions The gentleman is yielded the well. Is there any objection to the previous question being ordered the chair here is none the previous question is ordered Is there any objection to adopting the committee substitute the chair here is none the committee substitute is adopted Is there any objection to a green to the report of the committee which was favorable to the passage of the bill the chair Here's none the report of the committee's agreed to shall this bill now pass all in favor of the passage of the bill will vote Yes, all those opposed will vote no and the clerk will unlock the machine weave All members voted If all members voted, if so, the clerk will lock the machine on the passage of the bill, the A's were 164, the NA's were zero. Bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 1013. House Bill 1013. House Bill 1013. I'm going to roll from the seventh and others to be entitled an act to amend titles 1520, 31, 33, 37, 45, and 49 in the Fisherbook of Georgia and Tato relaying the Court's education health insurance. Mental health, public officers and employees, social services, respect. So to implement the recommendations of the Georgia Behavioral Health Reform and Innovation Commission, this bill I'm referring to the Committee on Health and Human Services that committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Jones to present the bill. Good morning colleagues. I've had the privilege of serving with you for nearly six sessions. I typically come to the floor with as much prayerness as possible, but today I'll be frank with you. I am slightly at a loss of words. This is one of those profound times that I'm sure when each of you thought about running for office, you said to yourself, I want to make a difference. I want to make a real difference in a certain subject matter. And for some of you, I know it's health care. For others, I know it's education. For my seatmate, it's school choice. But for me, it's mental health and substance abuse. When the speaker asked me to co-pilot this with Chairman Oliver, one of the things of wisdom that he said to me was, Todd, it's going to take more than passion. It's going to take a lot of hard work to put something together that will truly impact the lives of Georgians. Well, I hope through my presentation, which I promise you will be Ted Talklike and Chairman Oliver's presentations and the other speakers, I hope what you'll find is that there was a lot of hard work and that we are actually going to make a true difference. One of the people I respect immensely in this chamber said to me today, we need to give help to the people who need it most, who don't know where the light at the end of the tunnel is. Don't know where the green light is versus the red light. And I will tell you right now, as someone who has gone through the system, 30 some odd times with my older son, I can tell you there is no start here button. There is no website, there is no app. There is no holy grail of how do you solve this? There is no way for you to know where to start, where to end, because this is something that unlike, I'll say, a physical ailment that thank God most of the time, there is a start, a middle and an end. When it comes to mental health and substance abuse, quite frankly, it's a lifelong struggle. So where did we start? I think we must acknowledge that we started by acknowledging we had a problem and by no means do I mean any pun by that. But ultimately when the commission was formed a little over two years ago and Kevin Tanner, my former colleague in Forsyth County and chairman Tanner was appointed to head the commission, I think at the end of the day we knew that we had such a profound problem. That we needed to make sure that this commission was not like any other commission that the state has ever put together at least in recent times. So many times when our constituents here task force committees, commissions, study groups, you name it, they shrugged their shoulders and assume it's just a bunch of bureaucrats just trying to shuffle paper, they need a job and they need to put out a report that looks like a McKinsey report. In fact, I would say to you that chairman Tanner and all the groups that supported him, Judge Amaro, Justice Boggs, Commissioner Fitzgerald and there's so many others I won't even try to name them, that the path that they took for us truly got us to here. It was nearly two years in the making during some of the most difficult times the state has ever faced with COVID and the pandemic and frankly with mental health and substance abuse disorder skyrocketing. We know all the statistics suicide rates up 200% 300% 400% opioid consumption up 100 200 300% fentanyl deaths really trending towards number one reason for death in this state mental health. A colleague of all of ours, my predecessor lost his son to suicide. I argue that was one of the first COVID deaths in Forsyth County, Georgia because he felt as if there was no, I'll say, light at the end of the tunnel. He felt his days at UGA, his days with his girlfriends, his friends, his colleagues were quote over. We have the ability, we have the ability to at least make a material change and possibly a true solution. I'm sure the speaker will speak to you about today this being the first big step. I think it would be folly to assume that a system that has been together for nearly a century that is so broken that we could suddenly change it even with 80 pages. Completely, but we know that this is the first step that must be taken and we feel as if what we're hitting today and knock on wood after we meet with our senate colleagues and hopefully find common ground that we're going to make a material impact starting in 2022 and hopefully you see a significant amount of rocket fuel in the ship so that we can launch in 23 and 24 and 25 where we need to go. Our challenge today should not be can we cure mental illness can we cure substance abuse rather our challenges can we at least start can we give them a start here button can we at least give them hope because I can assure you going through this 31 times with my son there were many times my wife and I didn't even think we had hope. Multiple states multiple admissions you name it and never once did we ever feel you know what I think he's going to make it. Six years of psychosis and he's finally out of it and I thank God for that. But I just wonder sometimes if we had passed this bill six seven years ago before I was even here. Would my son have been six years in psychosis. I don't think so but I know this. Let's give ourselves a chance so that the next Justin Jones. And I'm sure there's many of you here who have Justin in your family. It's a daughter it's a son it's a niece is a nephew it's an aunt it's a grandma. And maybe mental health or substance abuse may be dual diagnosis whatever it may be. Let's make sure if they're a Georgia citizen they know we're here to lift them up. And to that end the question has to be how are we going to do that. And for that I want to let Mary Margaret or excuse me chairman Oliver I apologize. I want to let her come in and she's going to give you what I think's an excellent review of the bill. Before I introduce her a couple of things. Our hunches you have questions if you didn't we would be surprised it is 80 pages it's dense. This is stuff that you just don't do every day. At least I hope not. So we understand of those questions we're happy to take them from here we're actually happy to take them also offline if that helps. I think the second thing is I'd like to thank the speaker because I couldn't have felt of a better co pilot to take 10-13 at least this far. And I'm looking forward to working with you through the Senate and knock on wood with the speaker and you to knock on wood get this across the line. So I'd like to say thank you to the chamber. I appreciate your time we're going to hold Q&A until after chairman Oliver speaks. Thank you very much. The gentleman is yielded the well the chair recognizes chairman Oliver to speak to the bill. Thank you Madam Speaker. We're 10.6 million people in Georgia and there are 180 of us. So we do have the privilege every single day to help people and we particularly have the privilege today to help the families in crisis who know they have a lifetime commitment to a loved one and who know that mental illness is a deadly disease. 10.6 million people they are fewer than 10 percent but close to 10 percent that have a diagnosis of mental illness mild or moderate or severe. And of that 10 percent there's probably close to 1 percent who have a severe psychotic crisis episode repeatedly in their lives. I think our mental health system serves most of the Georgians that have mental health systems. I have not only a personal connection to this issue but a professional connection to this issue. I serve as conservator pointed by the court to manage property and assets of mental health citizens. Almost all of whom are able to live independently with support and with money supports and with a loving family or if no family is there with a case worker who is competent and professional. Most of those folks want what we want a home, a family and something to do that's meaningful and they're successful living in the community. It is the 1 percent who come in and out of our hospitals, in and out of our jails, in and out of our emergency rooms who are taxing the system every single day. And for whom I hope that this bill will provide the most meaningful relief. In my professional capacity as conservator for mental incapacitated mental ill and substance abuse. I've worked with many veterans, many folks who had brain injuries, many folks who had a lifetime of serious mental illness. And they are more often victims of crime. My job is to protect their money, their assets from people who want to take their advantage. That's my job a lot of day. They rarely commit crimes. One of my wards of veteran was murdered by his caregiver. There was a jury trial in Clayton County. I had to testify just a couple years ago. So for most of the state employees out there that work every single day to assist families, my congratulations and thanks are offered to you. But let us move forward for those who are truly in crisis on an hourly basis, families with lifetimes of challenges and for whom the system is failing them. This bill is very dense and the behavioral health commission which I was privileged to serve on with Representative Chair Hogan, chaired by Kevin Tanner, who is with us today, was a collection of experts in various fields. There were only Representative Hogan and I legislators on it. The work was carried forward by experts. And in 2021, two bills recommended by the commission file. One chaired authored by Chairman Sharon Cooper on telemedicine and the other offered by Representative Hogan on authorities of family counselors. The rest of the commission reports, Kevin Tanner picked up in May of 2021 and came forward with the bill in the fall which we met with many different agencies about their responsibilities in this bill. I'd like to go through it with you in a little bit of detail and again offer any of my time to you that would like to discuss specifics of it. Parity is the most important principle that we have been discussing nationally for over 20 years. In the Bush administration recommendations that mental health illnesses be treated the same as physical illnesses that came part of the national discussion. In 2008, there was a federal parity bill that required all insurance companies to offer mental health services. It would accelerate the discussion. But House Bill 1013 requires that mental health services be offered and requires in section one that it be offered in the same way that physical illness is paid for by our insurance carriers. Whether they be private, state, Medicaid, Medicare, all health care providers are now obligated. And how do we enforce that for the first time? At the end of the 2020, in the Trump administration, there was a new federal set of redirektives that came forward that insurance commissioners across the country are required to collect data in a specific way and required to end the year. And required to analyze that data in a specific way so to accomplish the enforcement of parity among our discussions. Kevin Tanner and I met with the insurance commissioner as we've met with other agency heads and talked about his responsibilities and his willingness to step forward. The commissioner of insurance has offered some amendments to this bill, has others, and we've adopted each of his recommendations because he is the will be the person that will be required under section one to data driven investigative reports to tell us if parity is being enforced. And the second one relates to workforce. I don't need to tell you that workforce is an issue of our state, particularly in health care. We are assigning new duties to the medical workforce agency to deliver cancelable loans for those delivering mental health services and underserved areas. The cost of that program will be extensive, but we as we have evaluated the cost of any of the reforms offered in this bill, we have worked continuously through the governor's office and the office of budget and with agency heads on the cost. We're requiring folks that we are eligible for their education loans to deliver mental services to actually say whether they're going to collect, they're going to accept Medicaid and Medicare and Peach Care. We are expanding the opportunity for mental health services to be delivered in rural and underserved areas in a meaningful way. Section 3 sets forth the assisted outpaste treatment program. Justice Michael Boggs, who formerly served on this house floor, has been leading first through criminal justice reform and now through courts and mental health, along with Judge Amaro from Henry County, extensive significant drill downs on the folks who come in and out of jail, in and out of our court system in a wasteful way. And the assisted outpatient treatment program, which is detailed in Section 3 offers mental health courts on steroids, we've called it several times, so that we know that the folks coming into the mental health system are not going to be cycling through our emergency rooms. Section 4 deals with other parts of the mental health system, which specifically relate on page 48 to the authority of the police or a crisis unit to take somebody into care to remove them from their life of civil liberties and take them into care for evaluation against their will. There's a national discussion about this issue, a national discussion, which we're changing and consistent with the national discussion to give more clarity and less obstacles, fewer obstacles for law enforcement to take somebody in for an evaluation. We know that right now under the current law, which we're changing, the police officer has to witness a felony in order to take somebody into care when they are endangering the...\n\nourselves, and we're shifting in a significant way, but a very careful way, consistent with constitutional protections, the way in which that process is accomplished. And it is supported by law enforcement, and it is requested by law enforcement. Another part of the details of this bill deal with how you transport the person who is in a mental illness crisis. The subsequent transport obligation that belongs to the sheriff is really accomplished throughout Georgia in many different ways. And as we move forward into Section 5 in the criminal justice coordinating council, and the duties that are set forth in that council for federal funding relief, we're creating some additional opportunities for grants to be extended to provide assistance for these transport issues. The police officer that has to take somebody to an emergency room or a crisis unit does here she have to wait there for several days, if the person is in the ER for several days, which unfortunately is a reality based on the failure of our system, or can we do better and more options for delivery to subsequent transports when we know that a person can be placed in an appropriate mental health facilities. This bill is very dense and it talks about funding calculations and funding obligations that we already have as our obligation. The federal law says that CMOs, for instance, care management organizations that we contract with to deliver Medicaid services are required to spend 85% of their premium dollars or the contract dollars directly on mental health services. Georgia is an outlier on how we calculate that. I was an English major, can't talk to you a lot about these calculations, but I will tell you that a significant part of this bill relates to the calculation, appropriate calculation of medical loss ratio, which Dr. Newton more appropriately calls medical spending ratio. It is a big deal. And I am very confident that the Senate will agree with us that issues of parity, issues of medical loss ratio spending must be enforced in Georgia. Throughout this bill, we are addressing the issues of councils and commissions that previously have been created. You, we have created these councils previously. And there are duplications in those efforts. Let me give you an example which we are fixing in this bill. Department of Community Health, DCH, the Behavioral Health Council, and the insurance commissioner all have obligations to draft a prescription formulary. That is a creation where insurance agencies, excuse me, insurance providers are required to develop a consistent list of prescriptions that may be payable, instead of requiring the patient to go 14 different places as insurance carries. There is no reason for that duty to be assigned in three different ways. And with consultation with the governor, we have increased the authority of the Office of Health Strategy and Coordination to create the obligation there and the obligation to create a medicine formulary will be accomplished by January 2023. Ladies and gentlemen, there are many, many different aspects of this bill that I am very proud to ask for your support. I do want us to remember though, this is about families out there who are in crisis. Ladies for the system is not working and that middle illness is a deadly disease. Thank you Madam Speaker. We will answer questions if they are any. There are a few questions. The chair recognizes representative Williams of the 168th for a question. Take a minute Speaker with a lady yield. Yes sir. Is it not true I have lived long enough to see the horrors of central state in Melachville with all of the corruption political payoffs to this day where it appears as though we will make a giant step toward fixing the mental health problem in Georgia. Is that not so? Yes sir. We have all looked at the history here of Georgia's mental health system. In the 50s, Melachville was the largest asylum that was the word of the day, hospital on the planet earth. Today we are at the end of an investigation by the federal government on hospitalization of development disabled and one of the supports that we are obligated to provide into that settlement is supportive housing in the community. We are making progress ladies and gentlemen. The chair recognizes representative McLeod for a question. That's a gentle lady yield. Let me say representative Jones you are very passionate about your son and I'm glad that he's out of psychosis. Anybody who is a parent can definitely relate to that. And I thank you guys for working on this bill. It's an excellent bill. And the only thing that I am concerned with is folks that don't have insurance, lower income and they need help too. And I definitely want to see this bill go forward and codify and give some structure to address the mental health. And the other thing that I want to say is also law enforcement. One of the things that when it counties done is brought, having a person in the health field going out with law enforcement. So I just wanted to ask what exactly does this bill will do for somebody with low income and are no insurance at all. You mentioned the co responder program which has existed in Gwinnett County longer than any other county. It exists newly in my district in Brookhaven and all of Forsyth County has a co responder. We're increasing the opportunity for the criminal justice coordinating council chaired by Jay Neal to do grants to assist co responders. Our biggest mental health delivery system is our jails. And that's where unfortunately too many of our severely mental ill people get who are uninsured, who get care. That's my hope that strengthening the crisis units, strengthening the delivery of crisis relief for families, whether they have insurance or not. They're eligible for that assistance will bring relief to those in Georgia who don't have insurance. Thank you, Chairman Oliver. Representative McLeod, the two things I would add to Chairman Oliver is first and foremost is the parity that Chairman Oliver discussed that is across both public and private insurance. So that includes, for instance, Medicaid, that includes peach care, etc. The second thing I would add is the medical loss ratio or as Dr. Newton calls it the medical spend ratio. That would also apply in terms of us, in terms of the state getting what I'm going to call is significant value out of our medical spend around our managed care operations and Medicaid. So thank you. Chair recognizes Representative Shannon for a question. Thank you, Madam Chair. Is the representative you'll? Yes, ma'am. Just a quick question. Overriding somebody's civil liberties is a very big deal. Can you talk more specifically about, I understand you said you removed the old standard and what the new standard would be in this bill to have someone involuntarily committed by a police? It's a very big deal. I've been in those courtrooms when that decision is being made and I had a long discussions with Representative Neal about her life as a law enforcement officer making those decisions to take somebody into custody, means taking their freedom away. If you move to page 48 on the bill, you will see that the previous standard is immediate harm to self. Immediate harm to self. This is the example I use that we ask the law enforcement to make. The homeless person is not properly dressed and certainly has no cover and he's sleeping outside and it's 26 degrees. Can we agree that that's an immediate danger to self? What if the temperature is 44? What if the temperature is 50? You can still die of hypothermia but I don't think the homeless population is picked up when the temperature is 40 or 50. Are they in danger of dying? Yes. We imply too many restrictions on them and the language that we're inserting on page 48 about reasonable expectations is consistent with the national language that is being vetted through our court system. It is a very big deal to take somebody's slot rights and liberties away from them and our court system has given us the guidance under the Douglas case of the United States Supreme Court in a variety of ways and I feel confident that this new way we're structuring this standard will be acceptable to the courts. Thank you. Just to clarify a little more. So are you saying and I'm just trying to understand the way that this would work, you're saying that this would just be solely the opinion of the police officer that comes in contact with the person? The police officer has to take the person in for an evaluation what's called a 10-13 evaluation and then a psych, a properly-drich old person allowed by the law will make a determination whether or not that person can be held for 48 hours. So there's a step process here. The police officer is authorized directed and the crisis unit. Sometimes that's a mental health professor crisis unit that's out about again the co-responder unit now is participating in these evaluations. Our mental health system is moving, thankfully, away from a criminal justice application of taxpayer dollars to more a mental health delivery system of taxpayer dollars. And I think these decisions whether it's a mental health crisis person or a police officer with training and a co-responder mental health are going to be made with more expertise. But there is a time here when they, if the person is non-compliant, refuses to go, is endangering himself herself. Then the police officer can be authorized, now under law for immediate harm and now on their reasonable expectation and the person has fused to comply and the person is not in any way responsive to a rational direction. The person can, the police officer of the crisis unit can take them in for a 10-13 evaluation which then gives the authority for 48 hour hold. So just one final question just to make sure that we're on the same page. So you're saying it's still similar to what we have now which is you have to be, it has to be perceived that you are a danger to yourself or to others. Yes. Okay. Thank you. Can I say one more thing about the money? At each time we have, because money is important whether we, at each step of this, through all our hearings and all our amendments and all of our discussion with agency heads, we've talked what will this cost? Coincidentally, the opioid settlement of one of the opioid abuse cases against the pharmaceutical company is going to result in $600 million for Georgia for substance abuse of opioids. That's a large amount of money. Coincidentally, Georgia is part of another lawsuit against Centine, a CMO that is going to result in a settlement that's ongoing in tens of millions of dollars. So this will cost money. It will save money. It will save lives. And the private providers out there based on their obligations under contracts and determinations by the court are going to help pay for this. The chair recognizes representative Wade for a question. Thank you very much and does General A.D. You? Yes, sir. It's true that you and I had a deep discussion about one of the communities that's near and near to me that I represent. Yes, sir. And that that community currently has the highest rate of suicide per capita and that one of my high schools has one of the highest percentage of students that have committed suicide over the last five year period. Yes, sir. Can you give me and the community that I serve some assurances that this will be the best next step to help address the crisis that we're dealing with in my community? I feel strongly that these reforms are timely. We'll be paid for and we'll address crisis. You know, all of us have been to funerals of suicides. That was it one last month. A colleague with professional success, a loving family, respected by everybody. At the end of the funeral, the widow said to the politicians there, please pass mental health reform. This is a good time to do it. Thank you. I yield the well. The lady has yielded the well. For what purpose does Representative for no rise? I had a question. The lady is yielded the well. Do you have a parliamentary inquiry? Yes, a parliamentary inquiry. Stay true inquiry. Thank them for bringing the bill because you don't know that you need someone in the mental health field until it happens to your family. When it happens to your family, that's when you find out the state of Georgia has very few resources. Thank you. Is that not true? Is the lady so states for what purpose does Representative Cannon rise? Parliamentary inquiry. Stay true inquiry. Is it not true that I'm really thrilled that we're passing this bipartisan piece of policy today as a young lawmaker talking about mental health has been a part of the platform of many other millennial lawmakers around the country. Is it not true that we believe that the hero model within the Georgia Department of Transportation is where we can be looking next as we expand our co-responder model across the state. Is it not true? If the lady so states for what purpose does Representative Bayes more rise? Thank you Madam Speaker. Is it not true? I'm sorry, Parliamentary inquiry. Is it not true that my family and I suffered with my oldest sister for over 30 years that she suffered with mental health and her children and the whole family suffered along with her. And I am so appreciative that this bill has been brought. I know the lady knows what she speaks. We're going to move to the next speaker if there are more questions. Chair recognizes Representative Singleton to speak to the bill. Thank you Madam Speaker. This is a difficult bill and a serious topic. I first want to say I greatly appreciate the bill presenters, especially the primary bill presenter. I know to be a great man of character and someone that I personally respect and admire very much. That's just one reason why I find it particularly difficult to speak to you all today about this measure. I rise with a heavy heart and a genuine sadness at the state of our state. Let me first start by saying that my family, like many of yours, has been touched by mental health. The personal details aren't important. But I know firsthand the devastation and the pain that can be caused and the emotion that's attached to this topic. This is not some intangible subject that can be debated without empathy and compassion. There is no question that mental health crisis is real. According to one CDC report which surveyed adults across the US and late June of 2020, 31% of respondents reported symptoms of anxiety or depression. 13 reported having started their increased substance use. 26 reported stress related symptoms and 11% reported having had serious thoughts of suicide in the past 30 days. These numbers are nearly double the rates which would have been expected prior to the pandemic. These numbers have only gotten worse. With the everyday stress that Americans are feeling at the gas pump and in the grocery store, add onto that the uncertainty and anxiety of the rising Ukrainian crisis and the cumulative effect of the totalitarian policies perpetrated on the American people in response to the pandemic. People are hurting and everybody knows it. I would like everyone to please take one moment to consider the painful irony of us in this body working to find a government solution that implements greater government control in order to solve a problem that is largely the result of government control and policies. Before we ask how we can solve the problem we must ask ourselves should we as a government body solve this problem? Is this the proper role of government? This should be about good governance not just the emotions attached. I want to also address the political elephant in the room. I'm not naive or oblivious to the political trajectory of this bill. It's not unintentional this bill comes the floor during qualification week and I know all too well the political forces that are being brought to bear on you my colleagues to make sure this bill passes with ease. All of the political incentives are aligned to not ask questions or dig into the weeds in this measure. I ask please just consider three concerns I have about this legislation just consider them. First, I want to remind everyone in this room especially the plurality of the Republican colleagues of mine who were serving in the legislature when the Affordable Care Act was passed. You remember watching as the insurance premiums of Georgians more than doubled in the first four years and many of you spoke out against this government manipulation of the private insurance market. Respectfully, this bill should be called the Affordable Mental Health Care Act of Georgia and that both form and function will have the same measurable impact on the people of the state. With the currently soaring prices of food, gas and so many other essentials putting the squeeze on family budgets, how much with this bill increased the health care premiums of all Georgians due to the coverage mandates and how do you expect them to pay for it? This is the wrong time to be put in this burden on Georgia's working families. My second point, the last two years have woken up millions of Americans to the dangers and political motivations of the medical bureaucratic class in this country. This distrust reared its bipartisan head as the inconsistencies and misinformation along with the populations who were swayed by or skeptical of the quote science shifted from one administration to the other. The end result was that overwhelmingly and statistics in polling have verified this, the result is that overwhelmingly the American people do not trust the bureaucrats to make medical decisions for their families. This bill would require insurance companies to cover quote, and mental health condition or substance use disorder included under any of the diagnostic categories listed in quote. And the most recent diagnostic and statistical manual mental disorders, the DSM-5 that's been previously mentioned, published by the American Psychological Association and the World Health Organizations in National Classification of Diseases. Under this language treatment for things such as gender dysphoria and pedophilia are automatically included and would therefore be required to be covered, the cost of which will be spread out amongst all Georgians. It is also notable that this bill provides no provisions to exempt for religious organizations or other groups that would not want to pay for these kinds of treatments. Just like the little sisters of the poor didn't want to pay for abortions, churches should not be forced to pay for this. We as a body should not pass a law that we know will be overturned by the Supreme Court as was previously mentioned case. We should not as a matter of statute, see this level of control or authority to a federal entity, and we certainly should never do it in a way that traps our citizens into a contract that they can't get out of. As a side note to this point, if you have been paying attention as I have to the rhetoric and behavior of many world leaders such as in Canada and Australia as well as President Biden, you would know that this is not gaslighting or hyperbole to say that to many on the left conservatism is already viewed as a mental condition. In an academic environment that seeks to label and identify every aspect of the human condition, it will not be long before this condition is codified by the World Health Organization and the APA. In fact, it's already been suggested and is already in the works. You will see in my next point why this is caused for concern. My third and final port is both the simplest and yet the greatest cause for concern. I personally believe that our criminal justice system needs to transition from a punitive model based system to a rehabilitative one and that we as a state have felt firsthand over the last few years the tremendous amount of distrust and tension that exists in our nation. I believe our law enforcement officers have earned our respect and know that they selflessly put their lives in the line every day to defend our nation of laws. This bill however changes the requirement that someone be an imminent threat to themselves or to others for involuntary and patient treatment to simply require a reasonable expectation that someone could pose a threat and that this threat does not have to be imminent as it applies to anything in the near future. In fact, anyone who has ever had a mental health issue before, some would say can always be reasonably believed to be at risk of deteriorating again and this bill essentially allows the state to lock them up at will for the rest of their life over and over again as the state seems fit. As one law enforcement officer who testified in committee stated, quote, with this bill, police can take someone into custody before they commit a crime. This was this primary reason for supporting the bill. This is a gross violation of due process and a fundamental affront to the values of liberty that our nation and state hold dear. I also believe that this provision opens a door that can never be closed for the state to take it upon itself to put the greater good of the political regime that is its power to deem its political opponents a threat to the public good. Under this legislation, the state can take those crazy leftists or those nut job right-wing activists and can find them without due process. This is not the type of legislation that makes our country better. It doesn't make us more free and it doesn't make us more prosperous. I urge you to ask that these problems be addressed and that this bill be reconsidered before voting on. Thank you for your time and I yield the well. The chairman is yielded the well. The chair recognizes representative Smirrey to speak to the bill. I'm having a speaker and ladies and gentlemen of the house. I want to just come for a minute and just say a word or two about House Bill 1013. I've shared a lot of conversation with Representative Jones and Representative Mayor Marvin Oliver. I called him and asked him could I sign this bill. I want to thank the speaker for carrying this measure and bringing it thus far. My former colleague Kevin Tanner, I had some conversation with him about mental health and the issues that we have before today. In my opinion and I've seen a lot of bills come through this chamber but this bill is a game changer. It's transformative and I've talked to a lot of people in our mental health community and our disability community. In fact, I was on the phone the day with two and I shared this story with Representative Jones and I shared with Representative Hugo Lee. One day I was at a town hall meeting in Columbus and we were able to talk about crime and ironically there's a correlation in the relationship. When we started talking about mental health and the resources thereof. In my conversation with Representative Mayor Marvin Oliver, I shared some of those and we shared and exchanged stories as well. I later walked up to me and introduced myself and told me about her family and her son. I took it and I came back and I called Representative Dempsey and talked to her about it and said this is something that we ought to take a look at and how these families are going through what they go through. How can we help as a general assembly? I called Speaker Austin and I said you know these families need so much help. There's so much to stay can do but I think we need to address this issue and I remember talking to Representative Chair of the Appropriations Committee and the funds were in the family support system if you recall. We had cut the money, did them with family support and the money was restored and to me that was a start of what I think I'm saying today is that that's a given attention to those that in our community that need these families that need to help and need assistance and that money restored and it's not often that we get calls of thank yous in this general assembly. You don't get many thank yous when you pass legislation but on that one piece of legislation on that budgetary amount I was just in a data with calls of thanks and thank you for hearing us and I think that we vote in this bill that's going to be a loud thank you for hearing us because I think this touches more families than we can ever even imagine and you've heard some of the people allude to that. So I just want to come and say that this is a great piece of legislation it deals with the MPI, the communication and social and action of various families and while I have not had it in my own family I have the empathy and to know that a lot of my friends\n\nand families that I do know it has touched them immensely. And I think it's something that we need to do. We need to elevate. We need to elevate the discourse in mental health in our state. And we all address it in a very, very professional manner and look at it in a legislative manner. And the only people in America who sent public policy are elected officials. And public policy determines how the people of the state of Georgia live. So we ought to be about setting good public policy. And mental health is one of those areas in which we ought to be giving grave attention to. So I'm happy. I'm happy. I'm happy. Come down here and say, we need to pass this bill. And I want to, I can't commend those that have a work with. I can't commend Kevin Tanan enough. I have worked with him on many, many issues. And I've seen his resolve. And I know what he's made of. And I just want to congratulate you. And thank you, bringing us to this point, in this state, where we can give to the least of these and help those that need help the most. And that's people in our mental health arena. Those families that are out there needing our assistance. And we ought not to give a death ear to it. We ought to stand up. And nobody can break your back unless you've been to it. So it's time for us as legislators to pass this bill. And I'm really torn about this because I know this will help a lot of people. And I've had a lot of conversation with you. And I care about it. I care about your family. And I'm going to display it when I vote to let you know. And that the people of the state of Georgia know that this is an important issue to the members of this general's syndrome. So with that, Ms. Speaker, I just want to say that I'm looking forward to having further dialogue on this issue. And I want to thank those that have brought us to this point and to this day that we were going to send a loud message from this House of Representatives that we support of the Mental Health and the Mental Health Parity Act. And I'm looking forward to voting for House Bill 1013. With that, Madam Speaker, I yield the well. Gentlemen, as yielded the well, the chair recognizes Speaker David Rolston to speak to the bill. Thank you, Madam Speaker, members of the House. No matter how long you stay here, few will remember most of the votes that we put up there or the issues that we worked on. But on rare occasions, you will be called to vote on a defining issue, an issue bigger than you, bigger than me. I submit to you that this is such an issue. It will be a vote that will touch the lives of many Georgians. These are our neighbors, our friends, our family members. These are Georgians who are hurting because the Mental Health Care System has failed them and hopelessness is winning the battle for their future. In a few minutes, you will have the opportunity to cast one of those votes. House Bill 1013 will make our great state a good state. It will lift up families and let them know that we haven't forgotten them. Before I say a few words about the bill, I want to give some credit where it is due. The path to today is at least three years long. Those who contributed to the effort are really too numerous to name, but I must mention a few. When we started this journey, I laid out some principles which I believed had to guide our work. Any reform bill had to be big and bold. Couldn't just put a bandaid on a big problem. It had to look at new ideas because it was evident to all, or most all, that doing what we had been doing was failing our citizens. And it had to be bipartisan. I asked two of the finest members of this House to come sponsor this measure. Chairman Todd Jones and Chairman Mary Margaret Oliver brought passion, intellect, and knowledge of this issue that could not be rivaled into both of them for ever gratitude. Chairman Sharon Cooper convened her committee for many hours to hear testimony, ask questions, and consider suggestions to make the bill better. I am convinced that no one has a bigger heart for those experiencing problems with the health care system than does Chairman Cooper. She's a great leader and even greater advocate. Two years ago, we created the Georgia Behavioral Health Reform and Innovation Commission. It was the Commission's recommendations which formed the basis of House Bill 1013. And I want to thank the two House appointees, Chairman Mary Margaret Oliver and Chairman Don Hogan for their amazing work. But I have to say a special word about the chairman of that commission, a former member of this body, former state representative Kevin Tanner. A huge reason we stand here today is the result of representative Tanner's passion, his persistence, and his attention to every detail. No one believed in this mission more than Kevin Tanner. And on a personal level, it was his encouragement which helped convince me to get involved. But not just to get involved, but to believe. Like many of you and like many, many Georgians, I have grown frustrated and disillusioned years ago with our mental health care system. But I believed that to fix it the right way was just too hard and would be just awfully lonely work. Kevin Tanner helped me see that this could be done and that nothing was more important to do. And I am so honored and happy that he is here with us today. I want to thank Governor Camp and Commissioner King for their early support and their continuing work with us. They have both been champions for this reform effort. House Bill 1013 is built on a number of realities. First among these is the fact that mental health touches almost every family in Georgia. It is also built on a recognition that it is draining productivity from our economy, that our law enforcement professionals and resources are being overwhelmed by this crisis. Last and certainly not least at an increasing rate, we are losing the battle for the future to hopelessness and despair. Chairman Jones and Chairman Oliver have done a great job discussing the provisions of the bill with you. There is no need for me to plow that ground again. This is an ambitious bill. It is basic message is that the number one state in the nation in which to do business should find it completely unacceptable to have a mental health care system ranked at the bottom. In addition to the legislative piece that you have before you today, you will have before you in the coming days a proposed fiscal year 23 budget. In that budget and in the amended budget, we have already approved in this house $29 million as proposed to fund the provisions of this bill. That would be on top of $58 million in new dollars for mental health approved in last year's budget. House bill 1013 and the budget items demonstrate our commitment to raising the standard of our system to a level worthy of a big growing dynamic, diverse and forward looking state. And above all else, this bill will give Georgia's families hope. If you approve this bill, they will go over to the Senate. You know, before long, we will engage in our annual late session, give and take of trade-offs and deal-making with our colleagues across the hall. And I want to talk to them for just a moment. The give and take process is healthy. I enjoyed as well as anybody. And while every measure is on the table, I hope they will appreciate that much is at stake with House Bill 1013. Lives are at stake with this bill. And I hope they will think twice before nitpicking or trying to take apart the work that has been done by this commission. When we started this process, some people ask why would put myself in the crosshairs and you know, get shot at yet again over something. Why would I spend the political capital? Let me tell you why, because if this is not worth the political capital, I'm not sure what will ever be. Earlier when I recognized those who made special contributions to this initiative, I intentionally left one out. A person with a heart full of goodness and empathy, she goes looking for people to help. But her heart has for years wrestled with her frustrations with this system. The lady with political radar way better than any consultant, I know. But one who has reached the limits of her patients with their mental health care system. And a lady that challenges me, I mean, she asks questions that are just hard to answer. Like why don't you all do something important without worrying about the next election? I can't answer that question. She says, why don't you tell some of the people I talk to, the crisis center and the places that she volunteers, that for a season, you had the opportunity to make this system better and you failed to act. I'm of course talking about Sheree Ralston, the most amazing person I know and one who's loved I'm blessed to have. Late last year Sheree and I got to know a lady, we will call her Cynthia. Cynthia lives in the mountains of Fannie and County. And she came in one day as long as in December. A plain, honest lady had an incredible work ethic just been her time living life because life has been hard for Cynthia. This March, one year ago, she and her husband lost their 15-year-old son to a self-inflicted gunshot word. What Cynthia did not know in the period after that was that her husband was having a much tougher time and insurmountable time accepting what had happened to the son in late October. He died of a self-inflicted gunshot word. She's paid a price. Now when she came to see me, she had little idea about what it is we do here and no idea about this reform effort that she does now. She's watching us today to see what we do with this season of opportunity. At the end of the day, this is not about political party. It's not about geography, income level, race, gender or all the things that supposedly divide us. This is about our regard for what most of us have been taught, all our lives and what is foundational to most of us in our view of our place as it relates to our fellow men. Words are found in the 25th chapter of Matthew, verses 35 through 40, for I was hungry and you gave me meat. I was thirsty and you gave me drink. I was a stranger and you took me in. I was naked and you clothe me. I was sick and you visited me. I was in prison and you came unto me. Those are the words of Jesus Christ who went on with a few verses later to say, in as much, in as much. I see some of you finishing that. As you have done it unto the least of these, my brethren, you have done it unto me. They let us listen to the voices which call out and let us touch the hurt and pain of Georgians and try to make a difference. I ask for your favorable vote on House Bill 1013, Madam Chair, and I yield the will. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Chair hears none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair hears none. The report of the committee has agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? No. For what purpose does Representative McLeod rise? Parliamentary inquiry. State's are inquiry. Isn't it true that mental health has always been a problem and that the pandemic only amplified the problem? If the lady so states, for what purpose does Representative Sharper rise? Quarry. State's are inquiry. Is it true that we heard several hours of testimony and remarks and input in several days of it and also is it father-true that even though I have some concerns about certain areas of this bill, we worked on it and we are sure that the things are going to be working out with this bill and I'm happy with this bill. Is it father-true that if we do in the future expand Medicaid, not only will we give Georgia's hope in this bill, but we will also make that a reality in the state of Georgia, but I do support this bill. Thank you. For what purpose does Representative Bird rise? Parliamentary inquiry. State's are inquiry. Is it not true this bill will mandate me to pay for someone's gender reassignment, change their biological sex because I have an insurance policy? I believe the lady believes that to be true. I'll take one more parliamentary inquiry and then we'll finish this vote. For what purpose does Representative Belton rise? Parliamentary inquiry. State's are inquiry. Is it not sad but true that because of a lack of mental health resources America loses a veteran every single hour and therefore a vote for house bill, 1013 is a vote for military veterans. Chair believes that to be true. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 169. The A's were 3. The bill having received the requisite constitution majority is therefore passed. Clerk will read the caption, House Bill 1039. House Bill 1039 by the Roads of Jackson, 128th and others being taught on act to amend code section 487, 40.34. The official code of Georgia annotated relating tax credit for class 3 railroads and reporting. So, as to extend the income tax credit for expenditures on the maintenance of railroad track owned or leased by class 3 railroads. Justice bill haven't heard of the committee on ways and means that committee recommends that this bill do pass by committee substitute. The House will come to order. The House will come to order. The chair recognizes Representative Jackson to present the bill. Thank you, Madam Speaker. Today I rise to bring to you House Bill 1039. This is a tax credit that was originally created as a recommendation from the Rule Economic Development Commission in 2018 by House Bill 735 and it was sponsored by Representative Patty Bentley. I want to thank Speaker Ralston for his vision for the Rule Development Council. This bill extends the sunset for the short line tax credit from 2026 to 2028. These short line railroads tend to be smaller companies that operate in the rural areas of our state. As you can see, there's a picture of the Nancy Hanks up there. The Nancy Hanks used to run through one of my small communities called Tunnel Georgia. Now, M.Track has contacted the mayor of the city of Tunnel when they started talking about a study for high speed rail about a possible stop in Tunnel again. I want to recognize, help rural communities and I'll ask for your favor or consideration on this bill. There are no questions. Thank you, Madam Speaker. I yield a will. The gentleman has yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the Committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 164. The nays were four. The bill having received the requisite constitutional majority is therefore passed. The clerk agreed to the caption to House Bill 1344. House Bill 1344. House Bill 1344, the clerk of the 147th and others to be entitled to amend Code Section 4529 of the Fish Goat of Georgia and Teter Related State agencies, not to discriminate in employment against servicemen's wives. So, sir, we're required for updated language regarding spouses of armed forces service members. This bill I refer to the Committee on Defense and Veteran Affairs, that committee recommends that this bill do pass. Chair recognizes Chairman Clark to present the bill. Thank you, Madam Speaker, Colleagues. I have probably the most simple bill I've ever presented before you. Please come from the National Guard and all this bill does is it updates the language regarding employment discrimination from military wife to spouse. That's all of the bill does and I'll yield for any questions. There are no questions. I yield the well and ask for your favorable consideration. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none of the previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The chair here is none of the report of the Committee. Is agreed to, shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. For what purpose does Representative Cannon rise? Parliamentary inquiry. Statue of inquiry. Is it not true that this bill is a step forward for those in the LGBTQ community as it is a gender neutral way to discuss those who serve beside those who are in the armed forces as family members? The letty says states on the passage of the, have all members voted if so the clerk will lock the machine, have all members voted? Well, lock the machine I guess not. You better have. On the passage of the bill theyes are 170. The nays are zero. The bill having received the requisite Constitution majority is therefore passed. Clerk will read the caption to House Bill 1040. House Bill 1040 by the way, the 139th and others to be in the act to amend chapter 8 to the act of 49. The official go to Georgia and tentative related and economic rehabilitation services. Those require community action agencies to submit audit reports and IRS forms to the Department of Audits and the Councils before any contracts with the Department of Human Services or later offered. This bill having been signed to the Budget and Fiscal Affairs Oversight Committee. That committee recommends that this bill do pass by committee substitute. Chair recognizes Representative Bentley to present the bill. Thank you, Mr. Speaker and good afternoon colleagues. I proudly bring to you House Bill 1040 which is a bill relating to community action agencies. There are 20 community action agencies across the state that serve our constituents with programs such as weatherization, LIHEAP which is the low income energy assistance program. And so many more and they do such great work in their communities serving our constituents. House Bill 1040 is a recommendation of the Rule Development Council and supported by the Georgia Department of Human Services as well as the Association of Community Action Agency. This bill pretty much just makes it for the community action agencies to be in line with local governments as we require local governments to be up to date and compliant with their audit reporting to the Georgia Department of Audits. This bill will require the same for community action agencies for them to in order to receive a contract from the Georgia Department of Human Services that they must be current with their reporting to the Georgia Department of Audits as well as current with their 990 reporting to the Internal Revenue. This is a good bill I believe and I ask you for your favorable consideration and I will pause Mr. Speaker if there's any questions. You do have a few questions if you care to yield. Yes sir I do yield. Chair recognizes Chairman Dickie do you ride for a question? Does it allow you yield? Yes sir I do. Thank you for bringing this bill. I know it's been a concern of yours for a number of years of these community action agencies and thank you for your concern and\n\nYes, Bill. Do you further yield? Yes, sir. I do to my friend. With this having any effect on the Strawberry Festival? It will make the Strawberry Festival great, because all of you in this room have committed to attending this year's Strawberry Festival down in my district. So yes, it will have a great impact on the Strawberry Festival. Thank you. I further yield. Chair recognizes representative Eric Atomas to your left for a question. That's the General Lady Yield. Yes, ma'am, I do. I just have a question, because one of my seatmates is not back here, and I just want to ask a question for her. Does this have anything to do with the funeral home business? I think that's what's known as a proxy question. Depends on what size hat I wear will make a big determination for those of you who know that joke. Thank you for the question, Bill. Thank you. No further questions. Well, thank you, Mr. Speaker, and thank you, colleagues, for your consideration of House Bill 1040, which is, I believe, is a good accountability and transparency in government bill. Thank you. Is there any objection to the previous question being ordered, the Chair here is none? The previous question is ordered. Is there any objection to adopting the Committee substitute, the Chair here is none? The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill, the Chair here is none? The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no in the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1040. The eyes are 173. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1194. House Bill 1194 by the Rums of Crow, the 110th and others to be entitled and act to amend the Code Section 41-8 of the fiscal to Georgia and Tate of the League, the safe operations of motor carriers, commercial motor vehicles, and drivers and safe transportation of hazardous materials. So, to update the reference state to federal regulations, this bill I'm referring to the Committee on Motor Vehicles, that Committee recommends that this bill do pass. Chair recognizes Representative Crow to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. It's bill 1194. This is a bill for the Motor Carrier Compliance Division of the Department of Public Safety. And all it does is it updates the definition of present regulations as they pertain to motor carriers and commercial motor vehicles to match those. And 49 CFR effective January 1st, 2022. It changes the date from 2021 to 2022. And that's it. I'll yield for any questions if there are any. New yield for questions. I do. Chair recognizes Representative Holly. Up in the gallery for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir, I do. It's not true that I tend to ask very lengthy parliamentary inquiries. I believe that to be true, yes, sir. And is it not further true that I thank you for bringing this measure and really thankful for the fact that you felt enough to come here and still do your job and carry this bill and that I can probably speak on behalf of all of our colleagues. We wish that God be with you through this time. Thank you very much. I appreciate that. No further questions. Thank you, Mr. Speaker. Are you the will? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Those voted have all members voted. If so, the clerk will lock the machine on the passage of House Bill 1194. The eyes are 173. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1319. House Bill 1319, everyone. It will work eyes with 157 to be entitled to enact two amend. Part three of Article 7, Chapter 3, Title 20, the fiscal to Georgia and Tadda relating to the general. Georgia Student Finance Authority, so it's to provide for the Georgia Leo Scholarship grant. This bill ever referred to the committee on higher education. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Warkhizer to present the bill. Thank you, Miss Speaker. Before I do, I've got to thank four people who made this happen. And first of all, the Speaker and his office who worked with Terry England and his two bosses, Martha and Christine, our former colleague, Lynn Riley, who's president of the Georgia Student Finance Commission and fourthly, GBI Director of Vick Reynolds. House Bill 1319 creates two service council loans. The first is the Georgia Law Enforcement Council loan. It provides a $2,000 per year for eligible Georgia peace officers to pursue. An associate or bachelor's degree in criminal justice or related social science field. Eligible participants will be able to get $2,000 per year up to four years. And then the second one is for a loan forgiveness program for medical examiners who are employed by the GBI as the next step in creating a compensation package to attract and retain talent in a nationally competitive environment. This bill authorizes the Georgia Student Finance Authority to provide for the repayment of loans of medical examiners as well as law enforcement. And the medical examiner is $20,000 per year up to $120,000 and that's the bill. Do you have any other questions? Do you yield for questions? Yes, sir. Chair recognizes representative Bentley to your left for a question. Does the gentleman yield? Absolutely. Is it not true that the question about to ask is a serious question? Okay. Is it not further true that this, I believe this is a good bill for many reasons, but particularly because of the medical examiner portion of this bill, because the more medical examiners that we have in this state, better it will help families across the state of Georgia get death certificates that they need maybe in a faster manner, because without death certificates, families can't take care of very important business upon the passing of their loved ones. Is that not true, Mr. Representative? It is absolutely true, and I appreciate your work on the committee that this came out of that without your help, this bill is struggling. Do you further yield? Yes, sir. One more. Chair recognizes representative Cannon to your left for a question. Thank you, Mr. Speaker. Do you yield? Yes, ma'am. Does the GBI currently employ any medical examiners who deal with the maternal mortality crisis? They all do. Thank you. Do you further yield? Yes, ma'am. Can you expound on that a little bit, because as we see the 516 maternal deaths that have happened over the last reporting of the years have shown that some of these deaths were preventable, and it really takes for some other providers to look at the full year of the person's death in order to understand that. So would this bill be helpful to those students who are pursuing their degrees to better understand how the maternal mortality crisis is happening? Yes, and I believe it's where, if you'll notice in the last two years, this body has brought a lot of attention to the maternal mortality rate, and we're doing some great things, both in the Health and Human Services Committee and as well as this. So as long as we're bringing attention to it, then I think we're going to be helping with that. Thank you. Do you yield for one further question? Sure. How did we come up with the $8,000 cap on the possible educational funds? How much do those courses run? Why $8,000? I don't know. Hey, I don't know how much the courses are in B. Like most things, this arbitrary cap, there was discussion and during the committee, the cap was actually raised on the medical examiners, and by discussing with the GVI how much debt they were entering the field with, and this would cover about half of it. Mr. Speaker, I'm going to yield the well, and ask for your favorable consideration on the House Bill 1319. Thank you. Gentlemen, as you yielded the well, Chair recognizes Representative Park to speak to the bill. Thank you, Mr. Speaker. I rise in support of House Bill 1319, and I'd like to encourage all members in this chamber to vote yes. I'd like to thank Chairman Warkhizer for carrying this bill, and I'd like to thank the majority party. Yes, I'd like to thank the majority party for moving forward with a recommendation from the President's Task Force on 21st Century Policing to increase access to higher education for law enforcement officers, to reduce crime, and build better relations between police and the communities they serve. Researchers have found that police officers who graduated from college are almost 40% less likely to use force, almost 30% less likely to fire their weapons in the line of duty, and that officers with at least a two-year degree were 40% less likely to lose their job due to misconduct. While we have disagreed and fought over many issues this session, I think all of us can agree that we want safe communities here in the state of Georgia. I also agree with the assertion that it is a false choice between public safety and criminal justice reform. Our state has a great bipartisan legacy of criminal justice reform, which we must continue to ensure the public safety of all Georgians. This bill is a step in the right direction. So I hope that we can come together as Georgians to support the good public policy in this bill, and our urge members again in this body to favorably vote yes to House Bill 1319. Thank you, Mr Speaker, I yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1319. The eyes are 172. The nays are won. This bill having received the requisite constitutional majority is therefore passed House Bill 1351 will be postponed until the next legislative day. The clerk will read the caption to a group of privileged resolutions. The clerk will read the caption to a group of privileged resolutions. The clerk will read the caption to a group of privileged resolutions. The clerk will read the caption to a group of cultural, virtual celebration in Georgia on April 30, 2022. The clerk will recognize Calvin W. Moss, the clerk will recognize the clerk on the passage of the bill. The clerk will recognize the clerk on the passage of the bill. The clerk will recognize the clerk on the passage of the bill. Is there any objection to adopting the privileged resolutions? The chair here is not in the resolutions are adopted. Going on now to announcements, if you have signed up for an announcement, make your way to the front of the chamber. Chair recognizes Chairman Parsons for an announcement. Thank you, Speaker. A reminder that the Energy Utilities and Telecommunications Committee will meet this afternoon at 3 o'clock and room 403 here in the Capitol. We have a couple of important proposals. Look forward to seeing you there. Thank you. Chair recognizes Representative Alexander for an announcement. Women legislative luncheon in room 514 C. L. O. B. Thank you. Chair recognizes Representative Cannon for an announcement. Thank you, Mr. Speaker. Good afternoon, members. I wanted to bring to your attention the note that's on your desk about ending maternal mortality. Of course, this is a big issue for us. The time magazine actually just named Jenny Joseph, one of the women of the year, who is the first black midwife to open a practice in the United States. That's a midwifery school. There will be thank you cards out on the left hand side for all legislators who have worked on this issue. Thank you very much. Chair recognizes Chairman Rich for an announcement. The majority caucus will meet upon adjournment in room 403 and lunch will be served. Chair recognizes Chairman Newton for an announcement. Thank you, Mr. Speaker. All Health and Human Services members, we have a time change 230 today in 606 Health and Human Services 230 in 606. Thank you. Chair recognizes Chairman Ballinger. Thank you, Mr. Speaker. This is just a reminder that your juvenile justice committee will meet today at 230. That's placed back just a little bit, but to allow for the majority caucus meetings and everything, we're just pushing it back to 230. It will be in room 341. Thank you. Chair recognizes Chairman Dickie for an announcement. Thank you, Mr. Speaker. Reminder, we have a high culture and consumer affairs committee meeting today in 430 CLOB. Hope you'll be there. Chair recognizes Chairman Noel Williams for an announcement. Thank you, Mr. Speaker. Just want to call the members of banks and banking will have a meeting in the morning at 8 o'clock and 506 CLOB. Look forward to seeing each and everyone over there. Chair recognizes Chairman Petri for an announcement. Thank you, Mr. Speaker. Members, we have a human relations and aging committee meeting to all of our members in CLOB 415 at 2 o'clock today. We have four bills we'll be looking at today. Thank you. Chair recognizes Chairman Collins for an announcement. The House Public Safety Committee will meet at 2 o'clock today. Maybe just a little late because of the majority caucus meeting. It's in 406 CLOB. We've got two bills. We'll get in and out very quickly. One of them is a chairman's bill. So please be there. Chair recognizes Chairman Lomston for an announcement. In the morning at 8 a.m. there will be a full insurance committee meeting CLOB 606 in the morning at 8 a.m. That completes our announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House which stand adjourned until 10 a.m. Wednesday, March the 9th, 2022. The majority leader has moved that this House be adjourned until Wednesday, March 9 at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Wednesday, March 9 at 10 a.m. The House will be adjourned until Wednesday, March 9 at 10 a.m. All those opposed will say no. The House will be adjourned until Wednesday, March 9 at 10 a.m.",
  "updated_at": "2026-02-13T09:19:41.409138+00:00"
}