{
  "video_id": "gAtw0Askd0o",
  "url": "https://www.youtube.com/watch?v=gAtw0Askd0o",
  "title": "Georgia Senate Page Program Video",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 3,
  "summary": "Overview:\nThe video provides an overview of the Georgia Senate Page Program, outlining the process for becoming a page, the duties and expectations during the legislative day, and the benefits of participating in the program.\n\nKey Actions:\nNo specific bills or legislative actions were mentioned in this informational video.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The video highlights the importance of professionalism and appropriate attire for pages, emphasizing that they are representing their school, neighborhood, and the Senate page program.\n- It also mentions the opportunity for pages to have their photo taken with the Lieutenant Governor and their sponsoring senator.\n\nVotes:\nNo votes were recorded in this session.\n\nAttendance:\nThe video does not provide any information about quorum or attendance.\n\nAdjournment:\nThe video does not mention the adjournment of the legislative session or the date of the next session.",
  "transcript": "Hello and welcome to the Georgia Senate Page Program. If you're interested in serving as a page\nbut don't know where to start, welcome. My name is Skye. I'm 13 years old and I am thrilled to\ntell you about what you can expect from your day under the Gold Dome.\nTo serve as a Senate Page for a day, the first step is a contactor seized senator\nand let them know you're interested in participating. The state senator, the\nrepresents your county, city or neighborhood will be your sponsor for today. If you don't know\nWho your state senator is, click the pop-up in the corner to learn.\nAfter that, you can go to the Georgia General Assembly website,\nclick the Senate Members page and find our contact information,\ncomplete the page, interest form, and send it to your senator's administrative assistant.\nThe Georgia Senate welcomes those of disabilities to serve as pages.\nPlease notify your sponsoring senator's office if you require any special accommodations during\nyour time at the capital. For a written breakdown of the sign-up process, check out the page Welcome Packet\nhere. Be sure to check the convening time of the floor session by visiting the Senate schedule the\nnight before you page. You should plan to arrive an hour and a half before the start time for that day.\nWhen you arrive, report to the page director at this desk on the third floor of the capital\nbuilding directly across from the senate chamber.\nOnly a handful of people can enter the senate chamber, senators, senate staff, credentialed\npress, and pages.\nYour job is a page where we deliver messages from constituents outside the chamber to the\nsenators inside the chamber.\nNot just your sponsoring senator, but any of the 56 senators.\nWhen you enter the Senate Chamber, you'll deliver the message that the Senator listed\non the yellow slip of paper.\nYou'll use this map to find the Senator and the Senate Chamber.\nWhen delivering your message, do not walk down the center aisle.\nThat is meant for Senators only.\nInstead you'll use the side aisles, locate your Senator, and place the message under desk.\nFor any reason you cannot find the Senator,\nthen please return your sub-paper back to the page director.\nThe use of any kind of cell phones,\ntablets, or other electronic devices\nis prohibited while paging.\nRemember, professionalism is key.\nYou're representing your school, your neighborhood,\nas well as the Senate page program.\nSpeaking of professionalism is important to dress\nfor the occasion, business or business casual.\nJust sure it's dress pants or kneeling skirts are appropriate.\nIf you think something may not be appropriate, it probably isn't.\nFinally, be sure to wear comfortable shoes as you'll be walking around quite a bit.\nYou will also have the opportunity to have your photo taken with the lieutenant governor\nand your sponsoring senator at some point during the legislative day.\nThe page director will give you instructions on when the picture will be taken,\nbut generally, this happens right before lunchtime,\nso make sure you check in with your page directors before you leave the eat.\nWhen the Legislative Day is ended, you will report to the page desk to receive your certificate, payment, and letter excusing you from school.\nThank you so much for your service to the Georgia Senate. We hope this experience has inspired you to Monday pursue a role in public service.\nOn behalf of the City of Georgia and the Georgia State Senate, thank you so much for your role in the lawmaking process.\n",
  "updated_at": "2026-02-12T01:40:03.472391+00:00"
}