{
  "video_id": "GaWkcY70SQ0",
  "url": "https://www.youtube.com/watch?v=GaWkcY70SQ0",
  "title": "Georgia Senator Breaks Down What’s Failing in Foster Care and How to Fix It",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a summary of the Georgia legislature session on \"Georgia Senator Breaks Down What's Failing in Foster Care and How to Fix It\":\n\n**Overview**:\nThe session focused on issues in Georgia's foster care system and efforts to address them, including challenges with school enrollment for foster children, the high rates of autism among foster children, and the rising costs of the foster care system.\n\n**Key Actions**:\n- **HB 431**: A bill to ensure that foster children are immediately enrolled in school when changing placements, even if records are not immediately available.\n- **SR 622**: A resolution to create a joint study committee to examine the rising costs of the foster care system in Georgia.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- The committee heard testimony from a former foster child, Reginald Holloway, who provided valuable insights from his lived experiences in the system.\n- The senator discussed the importance of prevention and early intervention for issues like autism among foster children.\n- The state is facing an $85 million funding deficit in the foster care system, in part due to delays in federal funding during the government shutdown.\n\n**Votes**:\nNo specific votes mentioned, but HB 431 and SR 622 were discussed and are expected to move forward.\n\n**Attendance**: No quorum issues noted.\n\n**Adjournment**: No specific adjournment time or next session date provided.",
  "transcript": "We're going to focus now on Georgia's\nfoster care system and how to improve\nit, some possibilities. Joining us is\nRepublican Senator K. Kirkpatre of\nMarietta. She's a former physician.\nShe's chair of the Senate Children and\nFamilies Committee and vice chair of\nHealth and Human Services. Welcome to\nLawmakers. We got a lot to discuss here\nbecause we really is a crisis in the\nfoster care system, isn't it? There's\nalways been a crisis and it's\ncontinuing, but we are working hard on\nmaking progress and we have been for the\nlast few years since the Children and\nFamilies Committee was created in 2023.\nUh, Lieutenant Governor Jones was behind\nthat and I'm honored to be the chair of\nthat committee. We've also had three\nstudy committees already and we've got\nanother one coming up.\n>> There's so much to look into. I talked\nto you in November about the work on the\nbipartisan Senate study committee that\nchair that you chaired that reviewed\nresources for children who age out of\nfoster care. And one of those gaps you\nfound is with enrolling them in school\nwhen they were young. Talk about that\none.\n>> Um it's not so much when they were\nyoung, it's anytime they change their\nplacement and change their school,\nthey're supposed to be immediately\nenrolled.\nAnd as a sort of an unintended\nconsequence of the school safety bill\nthat we passed, sometimes those\nenrollments are delayed while the\nreceiving school waits for records, some\nof which are not even eligible to be\nreleased. And so, um, we've got a bill\nthat is coming up that will actually\ninsist that the school districts enroll\nthem right away. And uh I think that\nbill is much needed because we heard\ntestimony from some of the kids. Some\nkids lost credits. Their credits didn't\ntransfer in a timely way. They had to\nrepeat classes. We even had one young\nlady who had to repeat a year because of\nthe delay. So we just want our school\ndistricts to understand that foster kids\nare facing challenges that other kids\ndon't have. And that was one of the many\nthings that we covered in that\ncommittee.\n>> Yeah. Now, I know you were focusing on\nthe aging out, but you found that\ntalking to them, there were things that\nhappened when they were young that\naffected how they aged out of the\nsystem.\n>> That's exactly right. In fact, um, one\nof the things that we don't do a lot of\nin the legislature is prevention work.\nAnd as a physician, that's important to\nme. And we turned up some information\nthat kids who are in the foster system\nare six times more likely to have\nautism.\nAnd\n>> wow,\n>> if we know that if you diagnose and\ntreat those kids early, they do much\nbetter. They have better outcomes. And\nif the diagnosis are made late, and it\nit's sort of a vicious cycle. It's uh\nthe kids have a diagnosis that hasn't\nbeen made and they haven't had treatment\nfor. They then have trouble staying in\nfoster homes or being adopted. And\nsometimes they are these kids who end up\nin hotels. And so we've got a bill, it's\nnot my bill, Senator Tiller's bill to\ntry to expand a pilot that we did on\nthat last year and Dr. Michelle Zena is\nbehind that and is doing great work. So,\nwe're trying to gradually expand that to\nall the regions in the state.\n>> Explain to people who don't understand\nwhat it means to for these kids to go\ninto a hotel. It's because you can't\nfind a foster home for them.\n>> It's frequently older kids that are hard\nto place. They can't go back home\nbecause the parents can't handle them.\nThe foster parents can't handle them.\nAnd some of them are full-grown\nphysically and have behavioral issues\nthat make it very difficult. And so they\nh were ending up in hotels and on the\nfloor defects offices and would require\nmultiple people to be with each one of\nthem because of the behavioral issues.\nAnd uh Commissioner Bro worked hard on\nthat when she first got into office and\nuncovered this problem. And uh for a\nbrief time we were down from like 75\nkids in hotels to zero kids in hotels.\nSo we're working hard to find other ways\nto manage that and diagnosing and\ntreating those kids early that have any\nkind of challenges particularly autism\nis very important. Well, I know\nyesterday it was your committee that you\nhad to talk about HB431 you just talked\nabout and then you also discussed SR 622\nbecause you need another committee\nbecause it's specifically uh you really\nwant to look into the rising costs of\nfoster care. Um we know the Department\nof Human Services is projecting a\nfunding deficit of $85 million.\n>> Yes. and that um was already a problem.\nAnd then the government shutdown just\nmade delayed money coming in from the\nfeds that really made the issue very\nacute and resulted because we balance\nour budget at the state level and don't\nspend money that we don't have. We ended\nup um having to cut programs. I don't\nsay I'm saying we but it's the agency\nthat had to do it\n>> and um there are multiple reasons why\nthat happened. Some of the people with\ncomplex needs um and then there's also a\nproblem with getting the medical care in\na timely way that some of the kids need.\nSo, we decided that it needed a deeper\ndive and we're going to spend a lot of\ntime this summer figuring out not just\nhow we got here, but what are solutions?\nHow can we fix it?\n>> Yeah. And I know when you say deeper\ndive, you really get into it. Uh, among\nthe people who spoke yesterday was\nsomeone who uh was spent for nearly 17\nyears in foster care and requested that\nsomeone like him should be on the\ncommittee. So, let's hear from him. If\nGeorgia is serious about understanding\nthe true cost of foster care, then we\nmust also be intentional about listening\nto the people who live those cost every\nday. So, full disclosure on that, I've\nknown Reginald Holloway since he was a\nteenager living in foster care when I\nwas volunteering at a place where he was\nin foster care. So, how important is it\nto hear from someone like Regginald\nHolloway?\n>> I I told him before our committee met\nyesterday that he's making change. he's\ngoing to result in a law change from the\nstories that he told our foster\ncommittee. He wasn't the only one with\nlived experience that came and spoke to\nus. But it is very important to hear\nfrom people who've actually been through\nexperiences that uh some of which we\nreally don't want to hear about because\nthey're so awful. But um he's a very\nsuccessful young man and I'm very proud\nof him. And uh yeah, the I what I spoke\nto him about is it's a joint study\ncommittee with the House, so the bills\nhave to exactly match and so we're going\nto work with the House on how to make\nthat happen.\n>> Yeah, he he really is a success story.\nHe graduated from West Georgia College\nmainly um couch surfing like didn't have\na place to go. So Exactly. We really we\nreally are proud of him and thank you so\nmuch for what you're doing on this in\nthis area of foster care.\n>> There's so much more work to be done.\nOkay. You've got a bill tomorrow on the\nfloor.\n>> I do.\n>> Okay.\n>> I have a bill tomorrow that has to do\nwith unclaimed property.\n>> Okay. All right. Tell tell me briefly\nabout it.\n>> It uh we know that the state has over $3\nbillion of Georgia citizens money that\nthey're holding in the Department of\nRevenue.\n>> Wow.\n>> And there are all kinds of problems with\ngetting that money back to the people\nthat it belongs to. So, this bill is\ngoing to clean that up. And there will\nbe a lot of interest in it. I can tell.\n>> I'm pretty sure their website's gonna\nblow up.\n>> Yeah, it will.",
  "updated_at": "2026-02-14T14:41:33.552141+00:00"
}