{
  "video_id": "GCCYU4E27ao",
  "url": "https://www.youtube.com/watch?v=GCCYU4E27ao",
  "title": "07-24-2024 Sen. Nikki Merritt Press Conference on AP African American Studies in Georgia schools",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 56,
  "summary": "Overview:\nThis press conference was held by Georgia State Senator Nikki Merritt and other legislators to condemn the decision to remove the AP African American Studies course from the state's curriculum. They argue that this course is essential for teaching the full history of the United States and providing opportunities for students, especially Black students, to engage with their heritage.\n\nKey Actions:\n- No specific bills were discussed, but the legislators mentioned HB 1084 and SB 226 as part of a \"regressive agenda\" to attack culturally-relevant education.\n\nBills Introduced (First Reading):\n- None mentioned.\n\nNotable Moments:\n- Senator Merritt and Representative Adena passionately defended the importance of teaching Black history and called for the superintendent to reinstate the AP African American Studies course.\n- A speaker from the Gwinnett County Board of Education expressed her personal views, stating that culturally-relevant education is crucial for student success and that attempts to suppress Black stories are unacceptable.\n- The speakers emphasized that Black history is American history and that removing this course deprives all students of a full understanding of the nation's past.\n\nVotes:\n- None detected.\n\nAttendance:\n- No specific quorum notes, but the press conference appeared to have a sizable audience of supporters.\n\nAdjournment:\n- No formal adjournment, as this was a press conference rather than a legislative session.",
  "transcript": "Everyone, how's everybody today?\nI am so excited by the energy that I'm seeing today.\nAnd we're, as we're on the cusp of very significant change\nin our nation.\nAnd this is a critical topic.\nI want to thank the media for being here.\nI want to thank my colleagues for being here.\nI want to thank everybody that's on the steps today\ncome out to stand with us in support. And we gather here today in solidarity, standing\nfirm with our students and teachers who have been blindsided by the abrupt decision to\nremove AP African American studies course from our state's curriculum. This decision\nstrips away vital opportunities for our students to engage with and understand a significant\npart of our shared history. What's most troubling is the complete lack of\nexplanation for this decision. This course is the only AP course removed and we're\nleft wondering why. I can tell you it's not about funding. The legislature\napproved a 1.4 billion increase for school funding, ensuring that financial resources are\navailable to support comprehensive education for all students.\nAnd it's not good enough for the superintendent's office to respond by saying, oh, local districts\ncan just choose to pay for their African-American studies course for the AP course.\nThey can use local funds.\nThis is not good enough because we're not putting that requirement on all AP courses.\nExplain to me why this course is being singled out and is no longer eligible for state funds.\nBlack history is American history.\nIt's essential to our educational system because it reflects truth.\nGeorgia is home to the second largest population of African Americans in the nation.\nWhen that county, my district, is one of the most diverse counties in the country.\nWe are home to great leaders that have shaped our history, great African-American leaders\nthat are a part of our history.\nOur beloved John Lewis, Martin Luther King, Hartzville, all these names.\nWe could ramble off the names and probably many people will lame off.\nBut here we are in the state where we have significant black leaders and we're choosing\nto rip away black history.\nIt seems that the foundation of Project 2025 has found a foothold in Georgia.\nAnd the repercussions of this Republicans' travesty of a bill, HB 1085, 1084 sorry, 1084\nis materializing.\nBoth initiatives are orchestrated by the same right wing think tank, think tank, working\nto tear our nation apart.\nAnd as a community, we must reject this regressive agenda.\nNow I want to believe it is not superintendents'\nwoods intent to use this divisive policy as a blueprint\nfor governing our schools.\nAnd I do find it shameful that shoot superintendents\nwoods and educator himself would even\nconsider adopting such a harmful divisive policy.\nWe must call for the superintendent\nto reconsider this harmful decision.\nNow, y'all didn't come to just hear about me today.\nHere for me today, we have so many others\nthat want to voice their concerns in the community.\nAnd that was the point of us gathering everyone here today.\nSo I'm gonna let some of my other speakers speak.\nThey're gonna talk to you directly\nabout the impacts of this decision.\nAnd let's make our voices be heard, reach out to the superintendent, and demand that the\ncourse be reinstated.\nThank you.\nGood morning.\nGood morning.\nI am Representative Shagun Adena, House District 110.\nAnd this morning, I'd like us to imagine a world where\nriches of our collective past is reduced\nto a single narrative, where countless voices are silenced,\nand pivotal moments in history are raised from our consciousness.\nToday, I stand before you to advocate\nagainst the removal of AP African-American history,\nblack history, in our educational system.\nFor its essential part of our nation's identity,\na pillar of justice and a beacon for the future of this state on our country.\nBlack history is not a separate chapter in American history.\nIt is interwoven into the fabric of this nation story.\nFrom the fight for independence to civil rights movement, black Americans have been instrumental\nin shaping our country.\nLearning about Black History provides role models for Black students, fostering a sense\nof pride and possibility that also teaches all students about resilience, innovation and\nleadership.\nComprehensive history, education that includes Black History helps break down racial prejudices\nand forces a more inclusive and empathetic society.\nEven this course deprives all our students of full understanding of the world and their\nplace in it.\nI ask that the decision of the superintendent be rescinded immediately and reinstate\nAP African American history.\nLet us commit to a future where every story is told, every voice is heard, and black history\nremains a vital part of our educational curriculum.\nfor being here today, we have to make voices heard, and I'm going to turn this over to the next speaker.\nThank you.\nMaya Angelou said, the more you know your history, the more liberated you are.\nI speak before you today as a black woman, as a parent, as an advocate, activist, as a wife, and as an educator.\nI speak before you today, not on behalf of Gwinnett County Board of Education.\nI speak on behalf of myself as an individual.\nTo share with you my feelings around the AP African-American studies, and this goes beyond\nAP African-American studies.\nThis is just part of the bigger picture, part of the bigger struggle.\nWe have legislation, we have SB226, we have HB-1084, we have legislation that has constantly\nchallenged and attacked the education system\nand supporting culturally relevant studies for our students.\nAfrican American history is part of American history.\nJames Baldwin said,\nif you know whence you come,\nthere is really no limit to where you can go.\nSo understanding the past helps our students know who they are\nand it prepares them for their future.\nOur youth will help to build a dynamic world\nand a better place where we can all experience freedom and joy.\nMy hope is for our elected officials, educational leaders,\nteachers, educational supports specialists\nto have the cultural humility and agility\nto learn as much as they can to ensure\nthat our students have what they need to be successful.\nCulturally relevant teaching as a unique course\nand integrated in our curriculums\nare important for our students' self-concept, social emotional success, academic achievement,\nand positive life outcomes. Attempting to suppress black stories, experiences, books, and\ncultures will not change our history, which is known throughout the world, but rather\nproclaims to all the prevailing viewpoint held in the South since time immoral. Black people\nand Black experience have no value in American society worth of teaching and doing so,\nenables and justifies past harms that continue to permeate in the veins of American society.\nCulturally specific learning has proved to impact educational and social outcomes\nthat ultimately drive economic value. Intentionally engaging in ethnic studies\nhelps us to see the world from different perspectives and unites us to build a better future for all people,\nnot just black people, not just Asians, Native Americans, white people, Hispanic, Latinx people,\nbut all of us. I call today on the people to unite. The power of the people is so important.\nSo I stand before you and say, yes, sin communication to the superintendent, state Mr. Woods,\nDepartment of Education to our legislators, but I go beyond that.\nThis is so much bigger than just AP courses.\nWe have challenges in our literacy learning rates.\nWe have challenges in our class sizes.\nWe have overall challenges around academic success\nthat disproportionately impacts black and brown students.\nI stand before you today authentically,\ncourageously, and unapologetically.\nI say to you that Black Lives Matter,\nBlack Lives Matter in education, Black Lives Matter in our society, Black Lives Matter in\nhealth care. And when we address the most fundamental issues around Black Lives, and we couragefully\nstand for that, and we say no to the status quo, no to the standard way of operating. I call\non the people today listening out here watching, standing out here, let's the unite. Join\nWe are an organization developing a coalition of leaders, of educators, of teachers, of\nyouth leaders, working together, multicultural, intersectional people, advocating for change.\nWe are gathering a movement, not just this moment of AP history, it's bigger than this.\nWe have to fight and unite now.\nI call for you to please sign our petition.\nWe have a petition that we're asking you to sign.\nIf you go to Gwyneth Progressives on Facebook,\nyou can look up the petition, sign the petition.\nThis petition is a message.\nIt's a voice for the people saying, no,\nwe do not support the direction in which\nthe Department of Education in Georgia is going.\nThis is a movement, not a moment.\nWe are fighting together, united as a people.\nThank you.\ngood afternoon good morning I stand before you today as a former Gwinnett County public\nschool teacher and a Gwinnett County school board member elect I am also a certified educator\ntrained to teach history and social studies at the high school level with a\nbachelor of science degree in history education from Tacoma Falls College. My\nname is Rachel Stone and I am here to urge the state superintendent to\nreconsider removing the African-American Advanced Placement course from our\nstate's curriculum. After graduating from Emory Law School in 2018 I served as a\nhigh school special education teacher in Gwinnett County Public Schools and\nand here's what I learned.\nIn piloting, co-building, and teaching\na culturally relevant course at the high school level,\nI saw firsthand the demand for such a course\nfrom parents, students, and teachers.\nMany of my 12th grade students expressed,\ntherefore the first time,\nthey saw themselves represented in content.\nI taught students who were born in various countries,\nincluding Ghana and Nigeria,\nFor many, it was in our class that they experienced\nfor the very first time, independently reading a novel\nfrom cover to cover.\nIn our year, piling the course, we increased students'\nacademic achievement outcomes by 65%.\nGwyneth County Public Schools is the largest school district\nin Georgia, with over 182,000 students from 191 countries.\nBlack students represent the second largest percentage\nof Gwinnett County Public School students\nwith Hispanic students representing the largest group.\nStudies show that when students see themselves\nrepresented in the curriculum,\nthey are more likely to connect with the content.\nCulturally relevant courses, not only teach students\nabout shared, unique experiences,\nbut also challenges them to think critically\nabout the world around them.\nThis is a critical skill for the 21st century.\nSo I urge the State Superintendent to number one,\nconsider the unique needs of our students.\nNumber two, consider input from our students' teachers\nand staff.\nAnd number three, to trust our certified trained teachers\nto meet these needs in a fair manner,\nbefore making any final decisions.\nAs I take on the role of school board member in January,\nI believe we can work together to support all of our students\nand make Georgia a model state for education,\nwe have an opportunity to create an educational system\nthat reflects and celebrates the rich tapestry\nof our student body.\nWe can ensure every student feels seen, valued,\nand empowered to achieve their fullest potential.\nThank you.\nThe afternoon.\nMy name is Bryce Barry and I come to you today not as just a nominee against another\nanti-education Republican, but also as a public school teacher myself, who goes to school\nevery single day and wakes up every single day and goes to sleep every single night, think\nabout the burdens that my students carry.\nI think about the student that I had that last year went home, got to school bus and was\na victim from her own home.\nI think about when I came back from winter break last year\nand my roof had fallen in in my classroom\nbecause of a water pipe breaking in my classroom.\nI think about these things and I see that we have\nmuch larger issues in our state than one singular class.\nAnd why is it just this class that has been targeted\nthat we have asked over again?\nWhy is it just this class that we're targeting?\nWhy is it that besides the other surmounting issues\nfacing our teachers and our students\nthat we have every single day,\nthe superintendent seeks to restrict our access\nto this class and this class only.\nSo let's call it what it is.\nThis is not, this is an assault on our history.\nWe talked about black history is American history\nand black history enriches American history.\nBlack culture enriches American culture.\nWithout it, there would be not the foundation\nthat we have today.\nThis is also an assault on the freedom of choice\nfor our students who worked so hard every single day.\nI know I was in high school seven years ago.\nI'm sorry for my other representatives.\nI'll be joining soon.\nAnd I was in high school seven years ago.\nThere was prerequisites to be to take.\nWe worked hard to be able to take AP courses.\nAnd you worked so hard over a course of your four years\nin high school, only be told no.\nAnd that's not right.\nThe state should not have the right to say,\na child cannot explore, should not be able to learn,\nshould have the freedom to grow and be inspired\nby culturally relevant materials.\nAnd so that's why we're here today.\nWe're calling on all of us to call your state schools\nto pretend them and ask them,\nwhy did he choose this course?\nAmongst the plethora of other AP courses,\nwhy this course was taking our schools?\nBut then after that, ask them why he's continuing\nto be an inhibitor on the freedom of choice for our students.\nWhy is it going to be an inhibitor on letting teachers teach?\nTeachers just want to teach, students just want to learn,\nand we need to create a Georgia that cultivates learning\nand cultivates productive, aggressive teaching.\nAnd that's why we're here today.\nSo thank you all so much, and continue\nto ask these questions of our state's course to repent now.\nThank you.\nGood afternoon, everyone.\nMy name is Dante Carter, first vice president of the Atlanta NAACP.\nI'm here with members of the Georgia State Conference of the NAACP on behalf of the Georgia\nState Conference of the NAACP, the Atlanta NAACP and its president, Gerald Griggs.\nWe had a training earlier this year, and one of the things that the educator talked about\nwas the fact that after the emancipation proclamation was codified, the first thing that was\nattacked was voting rights and then education.\nAnd he said, if we don't get this right, right now, it's going to take us another hundred\nyears before we get these rights restored.\nI want you all to know, the NAACP is nonpartisan, but we are political as hell.\nBut right now there's an attack on blackness.\nEverything from voting rights to our children still being shut down like dogs in the street\nby the police.\nAnd it's time for it to stop.\nEverybody wants to know what the ask is, what my ask is, to our allies.\nIt's to vote different.\nWe already know what the outcomes are going to be before we even see the results.\nIt's time for us to vote different.\nIn 2020, there was a whole lot of we support you, we stand with you, but you know what?\nWe didn't see any legislative change, and I got a problem with that.\nI got a little girl over there that I bring here intentionally, so that she understands\nwhat this fight is.\nMake no mistake about it.\nThere is a fight.\nThere's a fight for us to breathe, a fight for us to think, and a fight for who we want\nto be as a community, and it's time for us to make those decisions on our own.\nYou don't need anybody else's help.\nIt's time for us to do that.\nAnd so on behalf of the NAACP, I'm Dante Carter.\nThank you all for your time.\nApplause.\nHello, I'm Mallory Fanon, and I am a current teacher\nwith Gwinnett County Public Schools.\nToday, I speak with a sense of profound disappointment\nand concern over the recent decision made by State Superintendent Richard Woods.\nHis abrupt withdrawal of funding and support for AP African American Studies just a week\nbefore the school year commences has left a deep impact on me and my students.\nAs an educator who has dedicated years to teaching in Title I schools, primarily serving\nminority communities, the importance of representation and inclusivity in our curriculum resonates\ndeeply with me.\nAs educators, we were eagerly preparing to introduce a new diverse AP offering that\nwould enrich our curriculum and provide students with a deeper understanding of African-American\nhistory, culture, and societal contributions.\nMany of us invested time and resources, including attending professional development sessions\nlike the College Board AP Institute, specifically geared towards implementing this course.\nTo have these efforts render useless, days before the school term begins is just not a disappointment\nbut a gross mismanagement of educational resources.\nRepresentation matters for students from minority backgrounds,\nseeing themselves reflected in the curriculum is empowering.\nIt validates their experiences and fosters a sense of belonging\nand pride in their heritage.\nAP African American Studies was poised to provide my students\nwith a broader understanding of history,\none that goes beyond traditional narratives,\nand acknowledges the full scope of African American contributions\nin our society.\nIt is a fundamental component of American history,\none that expands our collective knowledge\nbeyond the confines of enslavement\nand the civil rights movement.\nFor the state superintendent to disregard the significance\nof providing diverse course offerings in our school\nis deeply troubling.\nEducation is not just about teaching facts.\nIt is about fostering understanding, empathy,\nand respect for diverse perspectives.\nBy canceling this course without adequate notice\nor explanation, Superintendent Woods has not only disrupted our educational plans, but\nhas also undermined the principles of transparency and respect that should govern educational\npolicy.\nAnd closing our urge Superintendent Woods to reconsider his decision and reinstate funding and support\nfor AP African American studies.\nOur students deserve access to a curriculum that reflects the rich tapestry of American\nhistory and prepares them to be informed global citizens. As educators it is our duty to advocate\nfor educational equity and assure that every student has the opportunity to learn and grow\nin an inclusive environment. Thank you, thank you for your attention and your ongoing commitment\nto education and the well-being of our students.\nWe wear the mask that grins and lies. It hides our cheeks and shades our eyes. This debt\nwe pay to human God, we're torn in bleeding hearts. We smile. And mild with myriad subtleties.\nWhy should the world be overwise and counting all of our tears and cries? Nate, let them\nonly see us while we wear the mask.\nI am Rashad Brown, hailing from Tallahassee, Florida,\na graduate of Florida, and an university.\nAnd I come here as an AP African American studies consultant\nwho works with College Board to teach different school\ndistricts across various states around this beautiful country,\nhow to implement this course.\nI am also fortunate enough to be a current AP African American\nstudies teacher with the wonderful school district\nand Atlanta public schools.\nAnd the ask is very simple.\nOur public servants are here to serve the people of Georgia.\nAnd if the superintendent of Georgia is unwilling to act\nin the best interests of our students,\nwe are happy to lead a coalition\nto identify a replacement.\nThat's right.\nThat's right.\nBlack history is American history.\nAnd anyone who doesn't understand that is not fit\nto serve our scholars and our students in this beloved state.\nAs Georgians, we pay taxes into this system,\njust like everything else.\nAnd let me make this very clear.\nCollege Board current classes are adopted in the state\nof Georgia and curing European studies,\nJapanese studies, German studies, British literature.\nWe have multiple courses that are approved\nand adopted currently in the state of Georgia.\nAnd I hear the question often asked,\nWell, why?\nWell, why African-American studies?\nOur students actually did a dive into this.\nWhat is the reason why?\nThey looked up anti-literacy laws,\nand I would encourage everyone here to do the same thing.\nGeorgia and the 1820s had an anti-literacy law.\nThe anti-literacy law made it a crime\nto teach newly freed slaves and Negroes\nhow to read and why, and the students wanted to know why.\nAnd what was their conclusion that they drew?\nUnderstanding how to read and write, and how to understand the law, and how to advocate\nfor yourself represents a dangerous threat.\nSo the ask is very simple and conclusion.\nWe humbly and respectfully ask for the governor and the superintendent to take immediate action\non this to reinstate state funds for this course and to make sure all of our students are\ntreated fairly and equally under the law.\nOtherwise, we need to go ahead and mobilize to find a suitable replacement who can serve\nall Georgia.\nWell, good afternoon, I know I might be a familiar face to many, but it bears repeating\nthat I am a public school student and I am proud of it and the Gwinnett County Public\nschool system. Thank you Senator Merritt, leader butler, and representative Dr. Jasmine Clark\nfor organizing this much-needed press conference. My name is Tyler Lee, and I am a current senior\nat Peaceree Ridge High School in Gwinnett County, and I was supposed to take AP African-American\nstudies this fall. Many people know me for my work in the community organizing for causes\nsuch as gun safety and voter registration. A large part of my organizing work in Gwinnett\nCounty is embedded in community relationships with black leaders who have stepped up to\nrun and represent us at all levels of government.\nI am proud of Gwinnett County Public Schools for being the first school district to alert\nparents, teachers, and students about the sudden change taking place in our curriculum.\nThank you, Dr. Therese and Member-elect Stone for being at the forefront of this issue\nin Gwinnett County Public Schools.\nStudents and teachers are being caught in a political game right now, being played by\nstate leaders that want to silently suppress accurate and comprehensive education in Georgia\nby cutting off support for advanced placement African-American studies.\nIt should be understood that this class is an elective.\nA class students are able to opt into.\nOne man remains responsible for this, and we are calling on him to reverse this decision\nright now.\nAnd one community hurts all of us hurt.\nI can firmly say that the Asian-American community understands that this is an attack on all\nefforts to provide cultural history.\nAnd I can proudly say that the Asian-American community stands with the Black community.\nIn this fight, as we strive for basic and comprehensive education all over the state\nof Georgia, Gwyneth is a beautiful mosaic of different ethnicities and cultures and\nis home to the largest school district in this state, a county and school system where\npeople from all over the globe can be found building community and supporting one another.\nSuperintendent Richard Woods is denying educational opportunities to students in Gwinnett County\nand across Georgia. State Superintendent Woods, I would like to remind you that you retain\nyour seat because of the voters in this state. If you fail to change your ways, we will\nchange you out. Hello, everyone. My name is Nate Whipple. I am a student at\nLaster High School in Cobb County, Georgia, and I'm the chair of the Georgia\nHigh School Democrats. I want to thank you all for being here covering this\nstory, and I want to thank Representative Clark and her colleagues for inviting\nme to speak today. Today, I want to tell you a story. A story about my friend Jason.\nJason is in my grade at Lasseter.\nHe's incredibly involved in his community.\nHe's the president of the NSAC chapter of Jack and Jill of America.\nHe's one of the best track sprinters in the state\nand was just recently elected alongside myself\nto lead our senior class in our student government.\nJason loves his family, friends,\nand most notably his culture.\nHe's the president of our school's chapter of Black Student Alliance,\ndedicated to raising awareness and educating students about African American culture.\nAfrican American culture.\nLate last year, Jason approached me asking for help\nand getting AP African American studies\nin our school's options for classes.\nWe got to work.\nSoon after, we had a petition with over 500 signatures,\nnumerous students committing to taking the class,\nmultiple teacher signatures, a teacher agreeing\nto teach the class in the fall,\nand eventually administrative approval\nto allow AP African American studies to be taught.\nWith Jason's work and leadership,\nhe was able to spearhead a transformative effort\nto change our school for the better,\nby providing an outlet for students to get a detailed\nand in-depth education about African-American history\nand culture.\nSoon after, we learned that our school district\nhad struck down this effort.\nWe were given reasoning of it being off curriculum\nand containing divisive content.\nNow, just recently, we wake up to the news\nthat this course has been effectively banned statewide.\nThis is an extremely misguided decision.\nPreventing this class from being offered in peds on the ability for students to dive deeper\ninto African American history and move beyond the often surface level education that we\nalready get through elementary, middle, and high school.\nBecky Pringle, president of the National Education Association, describes this course as\nquote, a big step in the right direction towards ensuring students, especially students\nof color have access to advanced courses that reflect the diversity that is America.\nThe removal of this course highlights a trend growing across the country, with numerous\nexamples of politically charged suppression of classes like AP psychology and the censoring\nof certain information and others.\nThese are frequently based on political fallacies of critical race theory being taught in public\nschools and some sort of left-wing indoctrination scheme.\nThese bans ultimately attack our freedom to learn.\nMy message to Superintendent Woods, the State Board of Education, state legislators,\nand school and county officials across the state is as simple as this.\nTake a look at who really wants classes like these to be offered.\nIt's not political operatives.\nnot Democrats. It's not lobbyists. It's students. Students, we want to learn. We\nwant to feel empowered. We want to have access to any information available,\nespecially that of such historical significance. We are not interested in\nin your political games.\nIn the end, it's about our future,\nand our right to a comprehensive education\nthat respects and reflects the true diversity\nof our history and society.\nUntil then, we'll keep fighting.\nSo that students like Jason can see themselves reflected\nin our curriculum, and every student's story is valued\nand heard.\nThank you very much.\nThank you all for being here today.\nThe press for being able to amplify this important issue and so making sure that people all\nacross our state know what is going on and what the superintendent is doing.\nI want to take a moment.\nCan we give a round of applause to all of the educators, students and legislators that serve\nas allies to education, because there are a lot of people in Georgia that are not allies\nto education. Thank you all. I'm so glad to stand with you here today. My name is Parker\nShort. I'm the chairman of the Young Democrats of Georgia. I'm a graduate of the cab county\npublic schools, and I recently got my degree in public policy from the University of Michigan.\nDon't blame me, I'm sorry.\nYou know, hey, maybe if we funded our education a little bit better and invested in the\nhope scholarship, we would allow for more students to go and get an education without that.\nSo I'm going to tell you a little story about my school.\nI went to Dunwoody High School, I think y'all might know it.\nIt's a little suburban town, right, outside the perimeter.\nAnd you know, I like where I grew up, but I can't say I'm proud of Dunwoody.\nI'm going to tell you something, my teacher from high school, Angela Peakinin, Ms. Peakinin.\nMs. Peakinin had 100 students sign up to take AP African American history with her this\nyear.\nAnd as we said, we were about to start.\nAnd I know my teacher has been spending all summer, my teacher from years and years ago,\nwho's still there, spending all summer preparing her lessons, plans, looking at books, reviewing\nthe college board materials as the educators here have been.\nAnd I know all of those students have been excited about the coursework, excited about\nthe opportunity to learn.\nBut that is not a reality, because the superintendent doesn't believe that that is worth funding.\nAnd now let me tell you why it is worth funding, because I'm going to tell you something about\nDunwoody that nobody will ever tell you.\nThey're not going to teach you this in the Dunwoody history class or APUS history, any history.\nThen what he is named after Confederate Major Charles Archibald III.\nThat is a history that we should understand.\nAnd every time I say the name of the city I'm from, the high school that I went to, I have\nto sit with the weight that we are a white, white city, and we're apparently still living\nin those values because we're unwilling to educate our students, not just in the cab,\nbut statewide.\nAnd as I will say, as many speakers have said, this is an elected position.\nAnd he is up in two years.\nI hope people listen to us, but you know, a lot of the high schoolers here, they can register\nat 17 and a half.\nYou know?\nAnd they're going to remember that their state superintendent took a course away from\nthem.\nInstead of providing more education, the leader of our state education system took a class\naway from our students.\nSo I'm going to tell you about one more to Cab County School, right, before I close.\nBecause again, I will say, don't waste name it after Charles Archibald, don't waste\nthird, a Confederate major. We don't know the history of our town. The Confederate hospital\nthat was there, the names of our streets. The fact is that the stone in this building\nwas mine from Stone Mountain and we are on the road that is named Memorial Drive and it\nis not a memorial of something worth memorializing. It is a memorial of the Confederacy and this\nis what is being upheld by the superintendent when he says we can't teach this history\nBecause Stone Mountain has a road straight to the Capitol,\nbecause it's symbolic that the world's largest Confederate\nmonument is in my county, Representative Mitchell's\ncounty, many of these people's county,\nan overwhelmingly African-American county.\nAnd you know what, 98% of the students that Stone Mountain\nHigh School are minorities, 98% of the students that\nlive in the shadow of that giant mountain filled with names\nof streets of Confederate majors.\nBut that's who we choose to have reflected\non our history? That's what we have to live with. We're not going to talk about the nasty\nhistory that is Dunwoody and the Confederate cemeteries hidden everywhere, the white\nflight tax policy, the way that your money isn't actually spent to take care of education.\nBut you know what? Thank you all for being here. Thank you all for taking action because\nwe need to take action. We need to take action. I encourage you to call the state superintendent\nBecause our students deserve more classes, not less, our school deserves more funding,\nnot less.\nThere you go.\nYou deserve the opportunity to cut that class.\nThank you all.\nGood afternoon.\nMy name is Dr. Jamar Harrison Bryant, I'm the pastor of Newburve Cathedral in Stone\nChrist Georgia. I want to give a high commendation to our elected officials who are standing on\ntoday. I represent the faith community to say, squarely, to our superintendent, how that\nthe faith community is conscientious objectors to what it is that you are attempting to do.\nI wanted to salute these elected officials because at the exact moment that we stand\nin this place. Congressional leaders are walking out of our U.S. Capitol because Netanyahu\nis about to speak. And they do not want to be seen or supporting somebody who is committing\nterrorism against Palestinians in Gaza.\nI want to suggest that what it is that Superintendent Woods is endeavoring to do is nothing short\nof intellectual terrorism because it is in fact handicapping our students from being\nable to compete on a global stage to extract African American history out of the minds\nand out of the palette of Georgia students will, in fact, rewrite history.\nAfrican Appropriate says that a lion's history is always written by the hunters.\nIt was Angela Davis that said the ones who create the murders are the ones who write\nthe reports.\nIt's a critical moment for us to consider why it is that this is such a, why it is such\na distraction to who our community and what our culture is.\nIf we extract African American history out of Georgia,\nthen it would suggest why it is that as a teenager,\nMartin Luther King, Jr., could go to Morehouse,\nbut could not go to Georgia State.\nIt would suggest to us why it is that\nManor Jackson was the very first African American mayor\nand why there could not be a black mayor in a city\nthat was predominantly black.\nTo suggest that African-American history is not taught,\nI would take away the emerging prowess of Julian Bond\nand why it is that he orchestrated sit-ins for students\nin the Atlanta University Center.\nTo take away the Atlanta University Center\nis to suggest that more house,\nSpelman, Clark, Morris Brown were unnecessary\nand were just in asterisk in time.\nTo not talk about Georgia's history,\nWe will talk about how it is that Mount Luther King Jr. won the Nobel Peace Prize, but while\nliving on Auburn Avenue could not go into Buckhead because of a sundown law.\nIt would suggest why it is that we don't even talk about why Savannah is really the\nepicenter of black consciousness for the world and why the very first black Baptist church\nwas sat there.\nIt does not want to talk about how black men were castrated in Rome, Georgia, how they\nwere hung in Columbus, Georgia, how it is that black women could only get servant jobs\nin Athens, Georgia.\nWe stand today, like Langston Hughes, to say that I too sing America.\nLangston Hughes was thinking about Georgia when he said I too sing America.\nThey asked me to eat in the kitchen when company comes, but I just laugh and eat well and\ngrow strong for I-2M America unless you are a student in Georgia.\nOn Saturday, a new birth missionary Baptist Church is opening up its doors.\nWe're doing something that no other community is doing all over the state over the next\ncouple of days.\nYou're going to hear about back to school programs.\nFor three years, we gave out to 5,000 pairs of shoes to young people who were going\nback to classrooms.\nthis year we decided to do something different because so many people were\ngoing to give out backpacks and give out book bags and give out iPads and all\nof them are sorely needed but this year we are not giving it to students I\nneed you to hear this we're doing back to school for teachers because so many\nteachers so many teachers are having to spend out of pocket in order to\ndecorate their classrooms and to get all of the supplies that are needed and\nnecessary. Before the pandemic, thousands of us in Georgia used to go to the\nmovies. Now we just watch Netflix and chill. But in the movie theater, before the\nmovie comes on, there's always the preview. And I am afraid, Georgia, this is a\ncautionary tale. Because what Superintendent Woods is endeavoring to do is a\npreview of Project 2025, and unless it is, unless it is, we go to sleep at the wheel, we're\ngoing to choke on the popcorn.\nThis is a picture of DEI, delusion equity inclusion, because it does not show us for\nwho it is that we are, and so our responsibility is to share that the threat is in fact\nweekend if we don't understand power conceives nothing without a demand. And so we are not\npassively suggesting we're actively demanding. These AP courses are installed and they are\ninstalled immediately, not because you are Democrat or Republican, but do it if you believe\nin the future of Georgia and the future is in our children.\nThank you so very much.\nMy name is Eric Richardson, I'm the president of the Coalition of Black Trade Unionist.\nI'm also the executive director of Atlanta North Georgia Labor Council, and we represent\nworkers.\nmany times we have to go and defend workers on the job because they lack education. They\nlack the skills. And educated workforce is what you need. You're bringing in business\nand saying this is the best place to do business, but you won't educate the workers. So how\nHow can they sustain themselves with this foolishness?\nLet me read something to you, because this is really my concern, and I got to go to Lord\non this.\nYou say I'm allowed to do anything, but not everything is good for you.\nAnd even though I am allowed to do anything, I must not become a slave to anything.\nCorinthians 612. Still on that, Mr. Woods.\nYou know, many times I come last in the program. And I come last because they call me the\ncloser. But let me tell you there is nothing to close about this issue. Until the\nsuperintendent comes back to the table with these speakers with these\nstudents and get this issue settled. We know he has not done a good job and I'm\nwith you. If you want to switch them out, I'm with you. And I want to thank all of you\nfor joining us this afternoon to discuss this horrible decision by the state superintendent.\nI want people to understand one thing about the superintendent's decision. This is not\nsome one-off special event. This decision is the latest attack in a long-running GOP war\non Georgia's public education. Just over the last year, Republicans ripped masses of\nof funding out of our public schools to pay for wealthy families private school tuition.\nRepublicans in Cobb County fired a teacher for reading a book that Republicans didn't like\nand said it Republicans tried forcing through a massive bill that would have criminalized\nkeeping certain books on school library shelves\nand made teaching a comprehensive sex education class\nimpossible.\nThat's just the last year.\nWe go back a few more years, and we\nget the Republicans' divisive concept law,\nwhich banned teachers from talking about certain ideas\nabout race. When I was first elected 26 years ago, I came to this building with a simple\nbelief that all of us, Democrats and Republicans, wanted to give Georgia's kids the best public\nschools we could possibly give. Boy, was I wrong. But publicans do not want the best public\nschools we can offer. They want our public school starved of money. Our teachers fired\nif they don't tell the Republican line and our curriculum to reflect a Republican view\nof history. How do I know? Because for 20 years that's what they've done and that's\nThat's why we are going to keep on keeping on.\nLook at their own agenda.\nWe are all heard about the project 2025 in the last few weeks.\nWhat we are talking about today fits right in with that stuff.\nDefund Title I schools.\nI.D.A. funding for disabled students and to a voucher program eliminate the Department\nof Education and teaching race in a way that aligns with the Republican political agenda.\nI bet a lot of Georgians had the same thought I did when I first heard about Project 2025.\nsounds familiar? Because here in Georgia they've been running Project 2003. That's\nthe year the Republicans took over. And that's the stuff they've been trying to do\nto our schools every since. Our students deserve better. Our students deserve a\nworld class education that allows them to expand their critical thinking\nskills and learn new perspectives on their state and country. Think of the\npossibilities of AP African American studies courses offers. Black Americans have\nmade incredible contributions to American science, medicine, politics,\nbusiness, sports, and the arts.\nThis course was covered nearly every subject the state\nis required to teach.\nBut instead, we're telling our students, no.\nNo, you don't have that because Republicans\nconsider a class on the African American experience\ntoo divisive for our students.\nI trust our students and teachers far more than I do\nthese Project 2025 Republicans.\nI urge our urge the superintendent to reconsider his decision\nas I set up top, get to the table with these speakers\nand these students, and make a different decision.\nAnd I urge him to work towards building\nthe best public school system in the country,\nnot building a public school design\nto serve the political entrance of the Republican Party.\nThank you all again for being here.\nAnd I appreciate you being here to hear all of these remarks.\nI think they all deserve a round.\nThank you all for being here today, we are about to wrap up and we will take questions.\nBut before we do that, I want to be clear to Governor Brian Kemp, to state school superintendent\nRichard Woods, to the State Board of Education,\ndo right by our students.\nRe-in-state AP, African-American studies,\nimmediately, do right by our teachers who\nhave spent time preparing to teach this class.\nDo right by the students of Georgia,\nBecause yes, black history is not just slave history.\nBlack history is not just a history of us being\nstrange fruit hanging on trees.\nBlack history is not just about us being shut out\nand cast aside.\nOur history is rich and diverse, and it starts\nway before the transatlantic slave trade.\nAnd our students deserve to see that reflected\nin their curriculum.\nDo the right things, Superintendent Woods.\nDo the right thing, Governor Kim.\nI don't know if you're in your office.\nIf you can hear us or not, do the right thing.\nDo the right thing for our state\nand do the right thing for our students.\nThank you all and we'll take questions.\nI would just say that what districts could teach this content using a code for the state\nAfrican American Studies Elected.\nIf districts could teach this portion get state money, is that acceptable outcome?\nWe should be an option.\nAbsolutely not.\nfor any other AP course, why don't we singling out AP, African American studies, stop targeting\nus, we deserve to have the same type of funding other AP course has and to do that, to even\nsuggest that, suggest that our course is somehow less than and that's not okay.\nWe can't be any more clear.\nWe're asking for the AP course to be put back on the listings of AP courses that will\nbe staying funded.\nWe're not, this is non-negotiable and if we're going to go there, take all the AP classes\noff and make them locally fun all of them.\nAnd just also, may I just please say as an educator and a consultant with College Board,\nDoing such a thing is going to make our students less competitive, because they will not be\nable to receive the AP credit.\nOur students don't need to take a generic course and not receive the AP credit, because\nwhat will happen is their GPA will suffer, but they will not be able to have the same type\nof rigor.\nAnd that is unfair to our students.\nIf you're not going to give our students the AP credit, nobody should have AP credit in\nany of the courses.\nWe're going to go ahead and wrap up, we're going to wrap up on that thank you.\nThank you all for joining us today.\nPlease write superintendent woods, reach out to your governor.\nI ask my students to get involved.\nAll the young people are educators and teachers, this is going to take a movement from all\nof us.\nThank you all for coming today.\nYou all did a fantastic job.\nThank you.\nThank you.\nThank you.\nFabulous.\nYep, there you go.\nIt's amazing.\nYeah, it's amazing.\nYeah, it's amazing.\n",
  "updated_at": "2026-02-12T19:14:27.932286+00:00"
}