{
  "video_id": "gfbb1QqRxwQ",
  "url": "https://www.youtube.com/watch?v=gfbb1QqRxwQ",
  "title": "Georgia Appropriations Subcommittee 2026 - Day 7 PM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 7,
  "video_date": null,
  "duration_minutes": 126,
  "summary": "Here is a structured summary of the Georgia Appropriations Subcommittee 2026 - Day 7 PM Session:\n\n**Overview:** The session focused on updates from the Georgia Department of Agriculture, including the ongoing response to avian influenza outbreaks, the state's hemp program, and the department's emergency management capabilities.\n\n**Key Actions:** No bills were passed or referred.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Commissioner of Agriculture Tyler Harper provided an update on the Department of Agriculture's operations, including the integration of the Rural Center under the department and efforts around the farm recovery block grant.\n- Harper highlighted the department's multi-agency coordination during the recent winter storm, with the Department of Agriculture working closely with the Georgia Forestry Commission and other agencies.\n- Harper discussed the department's focus on building out its emergency management capabilities to respond to issues impacting farms and consumers, such as avian influenza, the yellow-legged hornet, and weather events.\n- Harper provided an update on the state's hemp program, noting it generated over $2 million in revenue last year.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum was present, with several members arriving late from caucus meetings.\n\n**Adjournment:** The session was adjourned. The next meeting date was not specified.",
  "transcript": "All right. Good afternoon. We'll go ahead and call to order the subcommittee on\neconomic development preparation subcommittee to order. We are awaiting\nseveral other members coming from the caucus meetings, but we'll go ahead and\nget started. So we've got a tight afternoon and a lot of meetings piling up this\nafternoon, but we're going to start with we're in a prayer from brother Mac Jackson.\nAmen.\nAmen.\nFather, in the name of Jesus, as we come before you, we ask for your wisdom, your guidance,\nas we do the business of this great state of Georgia.\nWe thank you for the privilege, Lord, of being here today in Jesus' name, amen.\nThank you, sir, amen.\nAll right.\nWe're going to start with Commissioner of Agriculture, Tyler Harper, if you'll come on with\nCommissioner.\nI'm right here.\nYou already there.\nYes, sir.\nI know I don't have my stool so you couldn't have saw me I apologize again it's\nstill in the middle you move quick commissioner there\nI'll turn it over you commission thank you for being here today yes sir thank\nyou mr. Chairman appreciate the members of the committee and appreciate your\nour work together as we do the work of the people of our great state especially\nwhen it comes to our state's number one industry which is agriculture and the\nworking with you to ensure that we have the resources to do the job that our\nteam does every single day. So I'm just going to dive right on into this really\nquick and just go over a few things. As always some of this we went over\nduring the Joint Appropriations Committee meeting but number one industry but a\nlot goes on with agriculture and there's a lot of indirect industries that are\ntied to what we do every single day and what our agency does to ensure that\nthat industry successful, as I always say, if the agency that oversees the number one industry\nisn't doesn't have the resources to do the job it does, it's hard to ensure the number\none industry successful every single day. So that's what our team works to do. And we do that\nwith 22 different divisions over 70 different licenses that we issued 88,000 license entities\nthroughout the state. We have about 80-20 split on our funding, as y'all know, and there\nare a number of agencies and entities that are administratively attached to the department,\nas y'all know that that funding passes through us to those, and you'll hear from some of them\nlater today. Y'all heard me talk about the rural center at the joint meeting, but everything\nis going well here. They are completely integrated under the Department of Agriculture now. They are\nutilizing facilities in our tifton location. We also have the LAJ office in\nNorth Georgia and we are hitting the ground running with that and look\nforward to the work that we're going to be able to do through that. In relation\nto the block grant honestly unfortunately there's really no update since we\nspoke last week. The only update I can really give you is everything is in USDA's\nhands. We're waiting on them and matter of fact the last two meetings we had\nscheduled with them. We're canceled by them. So we're still waiting on them to get back\nwith us on finalizing our block grant so we can get those dollars out to our farm families.\nBut on our side, when it comes to the Department of Agriculture, we're ready to go. We got\nthe website up and running farmrecovery.com. We have the applications ready to go live.\nWe're just waiting on that final thumbs up from USDA and ready to go to work to get\nthat $531 million out the door.\nSo we talked about the Farmland Conservation Fund the other day\nas well.\nWe actually have a follow-up meeting\non the application tomorrow afternoon to finalize that\nso we can get those applications out the door\nto start protecting Farmland in our great state.\nAnd we look forward to doing that.\nAs a follow-up to what we talked about the other day\nAs many of you know, we have a second confirmed case\nof high path even influenza.\nSince we met last in Walker County also,\nanother broader reader operation of Broler Farm.\nAnd so that is the second confirmed case\nin our state in the last less than two weeks.\nOur team is currently deployed up there\nand have been since that first outbreak in Walker County\nand been working overtime to get that done.\nThat said, the winter storm, winter storm firm,\nobviously halted some of those operations.\nWe pulled our team out for safety purposes,\nbut they were redeployed early this morning\nto continue working on getting that addressed.\nWe have it, as I said the other day,\nit's completely contained.\nWe're just finalizing C&D on the site\nand hope to be wrapping that up very soon there\nin Walker County.\nIn relation to the winter storm really quick,\nI just wanna say specifically that this storm\nwas the first time where we had a multi-agency partnership.\nI wanna publicly thank Director Johnny Sabo\nas well as Commissioner Walter Raven.\nOur three agencies worked in conjunction with each other.\nHad a multi-agency unified command\nbased out of the Georgia Forestry Commission office\nand making during the entire winter storm event.\nAnd our three agencies partnered together\nto address the issues that Georgians were facing\nduring the storm and helping ensure\nthat that was taken care of.\nAnd I think this is a perfect example\nof how our entities work together\nto ensure that we're doing the job\nthat Georgians ask us to do\nand protecting Georgians when they need it,\nespecially in tough times like this.\nAnd so it was an awesome example of how\nour agencies work together\nunder the unification of the State Operation Center\nand GEMA and the work that they do.\nAnd at the Department of Agriculture,\nwe're proud to play a part in that\nESF 11 lead through the State Operation Center and our work that we do through emergency\nmanagement.\nAnd part of the reason is we've talked about the focus we have had at the agency on\nfocusing on our efforts to build out our emergency management capability to respond to those\nissues and events that affect our farm families and consumers of this state, high path even\ninfluenza, be an example.\nThe yellow-legged hornet, be an another example.\nThe cotton jasset, the spider lantern fly, a winter storm, a hurricane, a tornado,\nAnd so we continue to focus our efforts to ensure that we're addressing those issues.\nI meant to mention this the other day when we hit on the yellow legged hornet really quick,\nevery one of those dots that you see on that screen and there's a lot of them are traps.\nThose are traps that we have deployed as an agency to ensure that we're monitoring where\nthat hornet is and ensuring that we're catching it.\nAs you can see, we have on the west side there is a line of traps and that basically is\nthat border to ensure that nothing is moving out of that Savannah region as we\ncontinue to work through that. Our HIP program, as I discussed the other day, we\nhave over the last year we have really ramped up our efforts. You know, October\n24 is when the law went into effect and we have really been working to\naddress this issue. We have done over 1100 inspections over 1200 violations.\nThe most significant violation that we find as I mentioned the other day is no\nCOAs, but we also find issues related to warning labels and food and candy\nresemblance among other things. Every one of those dots on the right side that\nyou see, and if you zoomed in there would be more dots that will populate\nobviously, but that is a licensed entity through the Department of Agriculture\nto sell product in our state. And those are the entities that our inspectors\nare going in every day to address the issues related to this program.\nObviously thanks to your help we've been able to get some of that funding about a little\nover a million dollars is what we get for our hemp program.\nThis past year it brought in a little over two million dollars to the state.\nWe get about half of that around the program.\nWe have five inspectors, those five inspectors, civilian inspectors are the ones that did\nthough over 1,100 inspections.\nWe have two license coordinators that work to address the licensing side to ensure that\nthat we're bringing in that money.\nAnd we have, as I mentioned the other day,\nwe have of the almost 1200 inspections,\n81 of those were transferred to law enforcement\nfor criminal investigation.\n27 of those 81 were related to issues related\nto under 21 sales.\nAnd in some of those cases,\nwe have actually either executed search warrants\nor taken proper action and taken people to jail\nif they deserved it.\nSo depending upon the outcome of that particular case.\nIn relation to the farmer's markets,\nyou have or should have or will have.\nI know we offered copies of these,\nthe Georgia Agricultural Trust Fund report.\nIf you walk through that report,\nI'm not going to walk through it.\nI'm just going to talk about it real briefly\nand say this, that report will give you insight\ninto what's going on in our farmer's markets.\nThe work that we're doing is an agency to invest in those in addition to the funding\nthat you allow us to have allowed us to operate with and thanks to the help of the governor.\nThe last couple of years to invest specifically in infrastructure here in Atlanta.\nBut our team done a really good job of putting this report together and I just encourage\nyou to look through that report and give you some insights specifically into our farmers\nmarkets and the work that we're doing there to ensure that we're maintaining them.\nBut that said, obviously with the funding that we get including the funding that we get\nthrough the trust fund, it's not enough to keep up with the ongoing maintenance issues\nthat we have at our farmers markets across the state.\nBut the funding that you have given us, we have invested wisely and we'll continue to\ndo that to ensure that those markets are accessible to our producers.\ninto the specific budget line items in the governor's budget and I appreciate the governor\nand their work with us and OPB and others and their staff and obviously in the work that\nwe've done with them and laying out the issues that we have as an agency and them funding\nthose needs.\nThey have included funding for new software for our food safety division.\nThey've included a little over a million dollars related to some funding issues that we\nhave brought up to them related to obviously retention of the positions, but also to offset\nsome of those costs that we have incurred, re-alignment for colas that we have asked for\nto help address the issue where we were not made whole on those in prior years.\nAnd then the one-time salary supplement that the governor is funding for all agencies\nin that $2,000 fund.\nAnd additionally, in the administration budget, the governor included our asks for the\n$450,000 for laptop replacement agency-wide, as well as our cost of living adjustments\nand then the $2,000 in additional funding.\nAnd in relation to marketing and promotion, as y'all know last year, you included $200,000\nfor a Georgia Grown program for specifically to push and highlight Georgia Grown Wood.\nThis has been a remarkable partnership again between us and the Georgia Forestry Commission\nand Director Sabo and his team as well as others that have collaborated together to promote\nGeorgia Grown Wood products and the governor has increased this from 200 to 660.\nWe're proud of that increase and think this is an awesome opportunity to highlight one\nof our proud commodities here in our state, which is our forestry industry, where the\nnumber one forestry state in the nation.\nAnd I think this is a perfect time for us to promote this specifically to help us bring\nin new businesses, a new opportunity for our forestry industry as the number one forestry\nstate in the nation.\nAnd so we appreciate that and support that ad.\nin other adjustments for COLA's, the $2,000 increase and then same thing for the center\nfor rural prosperity and innovation or the rural center, the $2,000 one-time ad.\nThat said, Mr. Chairman, in relation to what our asks are, we appreciate everything from\nthe governor and their help with OPB but this lays out our asks number two and\nthree we'll talk about in FY27 that was the governor included some funding\nfor both of those and in FY27 so we'll forego discussing those but\nobviously we'll have deeper conversation about that when we get to the big\nbudget but in relation to the little budget we have some ongoing and one time\nneed some of this was funded in the governor's budget and we are significantly appreciative of it.\nBut we wanted to bring forward the other one time and continuing asks that we have because\nof reduction in funding that we have seen as we discussed in the joint appropriations committee\nmeeting the other day. The shortfalls in the colas and also our software needs that we have\nas an agency. You know every so often we have to upgrade that software or we have to renew\nthat software and those things cost money to do so and we don't have any ongoing funding\nto provide to do that with and so our ask is to receive that funding for those particular\nprograms and those are laid out on that sheet that each of you should have that one\npager as well as here on the slideshow related to the different divisions that need that\nadditional funding and the reasons for the cola and the deficit that we have seen in our,\nespecially in our meat inspection program but also in food safety and meat\ninspection as well in the federal shortfall as well as the federal cut that we\nreceived in those particular programs. In relation to our department as I said\nearlier we have over 88,000 licensed entities now that is a 33% increase since\nI walked in the door and we've only increased our employment by about 12% in\nin that same time period.\nThis is a, so if you do in the math,\nthat's about a 15% increase in workload\non our employees agency-wide.\nThis is just a snapshot.\nAs I said, we have over 22 different divisions.\nWhen you add in our programs,\nit gets to over 50 different programs\nthat we as an agency oversee.\nThis is just a snapshot of four of those\nand kind of the issues that we see there\nwith vacancies and the federal cuts\nand other things that have impacted us as an agency,\nspecifically in food safety and meat inspections.\nThose were actually cuts that were happened\nin the last year of the Biden administration\nthat hit us to the tune of almost a million dollars.\nBut when you look at that, our fuel team, 41 folks,\nit takes the 41 folks to check about 117,000 pumps.\nWe have almost 200,000 in the state\nand they're adding new ones every day among other things.\nAnd as I mentioned the other day in our meet inspection program,\ndue to lack of staffing, we've had to, unfortunately,\ndecline the ability to open up new establishments\nin our state because of that.\nThat said, Mr. Chairman, you asked specifically\nabout turnover rate in our last meeting.\nAnd so as an agency, when you look at our consumer protection\ndivision alone, it's about right after I walked in the door\nreally after the first six months.\nthis is starting in FY 24, our turnover rate in FY 24 was 22% for our consumer protection\ndivision, 21% as an agency.\nFY 25, thanks to y'all's help and the work that we've done together and increasing salaries\nand that investment that y'all have made.\nWe went from that to a 13% turnover rate to FY 26.\nnow at a little over 11% turnover rate agency wide, 12% in consumer protection, but even\nwith that, Mr. Chairman, we still have issues because we're still having to decline licenses\nfor entities.\nWe still lose meat inspectors to federal agencies.\nIt takes us 18 months to train a meat inspector.\nWe lose food safety inspectors to other state agencies.\nSo it is a continual battle that we have as an agency, but definitely something that\nwe have with your help.\nWe have helped slow the bleed, so to speak, and we appreciate y'all's help in helping\nus do that.\nBut our continued work together can help us ensure that we have the resources we need to\ndo the job that we do every single day.\nAnd so that is the ask for the Department of Agriculture for Amended Fiscal Year 26,\nMr. Chairman, if there are, I do have one thing to add,\nbut from one of our attached agencies,\nI can pause on that or go right into that\nif you would like me to.\nWell, go ahead, go ahead, go ahead, go ahead.\nIt is really quick.\nAs you can imagine, with the ongoing HPA outbreak,\nDr. Zavala and our team at the Georgia poultry lab\nare working overtime, and due to the winter storm,\nthey have been completely inundated\nwith a lot of samples.\nAnd so she was not able to be here today\nand asked if I would mention their ask,\nwhich is the 293,000 for a lab information management system.\nThat was the, I believe that was what was included.\nThe range that was quoted for them was 300 to 500,000.\nAnd obviously, if you have any other specific questions\nfor that, I'm sure Dr. Zavala would be more than happy\nto answer those.\nbut I told her that we would mention that\nsince she was not able to be here to present that in person.\nSo, with that, Mr. Chairman,\nI'd be happy to answer any questions that y'all may have\nand discuss any issues, concerns,\nor anything related to our specific ask for AFY26.\nThank you, Commissioner.\nAnd thank you for the great work the department does.\nWe understand that obviously you cover the largest industry\nstate of Georgia very important and on a work has to be done and more work is to be done.\nTwo questions for you, somewhat similarly related, on the federal shortfall, 1.1 million,\ndo we have any idea of what USDA's anticipation is and actually reimbursing the state for that?\nSo I will say this, the Trump administration has been working to increase the reimbursement\nback to the states or increase the funding to the states specifically for some of those\nprograms like meat inspection.\nHowever, we haven't got any specifics on that as of yet, and we're waiting to get that\ninformation.\nBut regardless, those specific shortfalls have definitely been something that we as an\nagency that's been made it difficult for us to operate and it cuts into our state funding\nand other areas that we would be able to utilize those funds to continue to bring on additional\nemployees and things such as that.\nThe other thing that I'll mention, Mr. Chairman, that we've talked about before as well is\nthe last couple of years.\nWe appreciate the pay raise, but as you know, the state, our meeting inspectors are 50-50,\nour EPA-funded employees are 75-25 or 80-20 food safety is in that 75-25 or 80-20 range\ndepending upon the position.\nSo we only get 50% of the funds, put it, put in our budget to fund those pay raises for\nthose employees.\nWell, as you can imagine, as a state agency, I'm not going to give an employee that's\nstanding side by side with another employee, a different pay raise.\nWe're going to treat them the same, and so that eats into our budget significantly.\nWe continually ask the federal government for that increase in our reimbursement rate\nto ensure that we can cover that pay raise,\nbut unfortunately, in my three years,\nwe have yet to get that reimbursement.\nWe ask every year.\nWe constantly have that communication with USDA,\nbut we've yet to get that funding.\nAnd so every year, we're still shorted any of those dollars\nto cover those additional pay raises\nthat we're currently covering, or trying to cover,\nwithin our own budget, which creates budgetary issues\nfrom us as an agency-wide in being strategic\nand how we address the issues that we face every single day,\nespecially when it comes to hiring more staff\nand ensuring that we're able to meet the mission\nthat we've been asked to do.\nThank you for that.\nAny questions from members of the committee?\nMr. Jackson.\nThank you, Commissioner, for the great work that you do\nfor this great state of Georgia.\nYou mentioned the Center for Rule Innovation and Prosperity being under AG now and Dean Green\nand I chaired the Rule Development Council and we worked closely with Dr. Bridges and\non Scott Blunt.\nI didn't hear what was in the budget this year for the Rule Innovation Center.\nSo the budget for the Center for Rule Prosperity and Innovation was last year, the legislature\nincluded a little over $2 million in our budget.\nThat is a continuation in our budget this year.\nIt's a little over $2 million.\nIt's included for the rural center budget\nthat the rural center will utilize to operate.\nAnd the new executive director is Charlie Fivash.\nHe's hit the ground running.\nAnd the remainder of the staff has stayed the same.\nBut obviously to you, to y'all, to the co-chairman,\nanything that we as an agent seeker do\nor director Fivash can do,\nWe want to be a resource and please lean on him\nas you have the rural center in years past.\nBut the funding for the rural center\nis a continuation from last year.\nWith the exception of the $2,000 supplement\nfor the state employees.\nThank you.\nRepresentative Giljard.\nThank you, Mr. Chairman.\nWell, you know, I didn't attend the Wildhawk supper,\nbut you've got a big plate of food here, Commissioner.\nThank you for your service and your great leadership.\nWhen you were going over the repairs for the farmer's market,\nit was near and dear to my heart as a freshman.\nWhen we came up with the legislation for the farmers,\noversight committee, the House and the Senate came back\nand we had someone do a study about the farmer's market.\nYour hands are full because you're trying to renovate,\noutdated and antiquated property.\nI just want to make a recommendation\nthat moving forward in the future, we give you what you need either to take those farmers\nmarkets to the next level or to do something different.\nIf something is not working, then we've got to try something else.\nBut to keep having you have to bandage those outdated, antiquated buildings, we've got\nto do something different.\nSo I want to thank you for your leadership and I just hope that we can move forward to\nthis issue in that manner.\nThank you, Representative Gillard.\nI appreciate that, and I would agree with those comments.\nThank you, Representative Guillard.\nCommissioner, we talked just briefly about it,\nand you mentioned in your comments\nthe number of facilities that you have not\nbeen able to issue a license for because the lack of an inspector\nto inspect.\nCan you talk a little bit more about that\nin which where we need to go, likely in the 27 budget,\nto make sure that we are covering all areas\nof agriculture that need covering.\nSo I will speak to that kind of in two ways, Mr. Chairman.\nOne, there are some entities and licensed entities\nthat we as an agency are currently taking\na real serious look at.\nAnd seeing is there a way that we can bring in\nand utilize technology to help us do the job\nthat we're asked to do every single day\nto be more efficient, more effective,\nand be able to still execute the mission that we've been asked to do.\nThat said, there are certain jobs, though,\nthat you cannot do that with.\nIt requires a person, it requires an individual,\nand in most cases, it requires a person\nwith a specific level of knowledge and understanding\nof that particular subject area to do that job.\nObviously, meat inspection is a perfect example of that.\nThat takes a physical individual.\nFor us as an agency, it gets into ensuring\nthat we're able to work to recruit and hire the best\nwhen it comes to that, and even at some cases to retain,\nas we'll talk about in FY27, you know, every year,\nwe've talked about needing vehicles.\nWell, for my employees, that is their office.\nAnd whenever they have a vehicle that has 200,000 miles\non it, among other things and has other maintenance issues,\nthat becomes a morale problem for staff.\nSo it's a little, I think in the long term,\nMr. Chairman, it's ensuring that we have the funding\nand the resources to hire the right people\nwhen it comes to salaries,\nensure that we have the resources to equip them appropriately every single day when they\ngo out and do their job and at the same time when it comes to those stresses we have\nwhen it comes to federal funding. If we could have a serious conversation about look at\nthe end of the day, if we can get reimbursed from the feds, if we could be covered until\nwe get that reimbursement back from the feds, that would help us have more flexibility as\nan agency to ensure that we're able to hire the best, retain the best, and at the same\ntime equip the best to do the job that we ask them to do every single day.\nThank you, Commissioner, and I look forward to continuing that conversation as we get into\nthe 27th budget.\nSo thank you for the great work that you and your team do.\nAny other questions from members of the committee?\nOne last thing, Mr. Chairman, the third sheet you have is Hurricane Helene.\nI'm going to mention this a second ago.\nIt is a list.\nIt is a map of the counties that are eligible to apply for that block grant.\nAnd as I said earlier, farmrecovery.com is where you can find out more information about\nwhat all is covered under the block grant.\nBut thank you, Mr. Chairman, appreciate this committee and look forward to our continued\nwork together.\nAnd just on that note, Commissioner, that map very much mirrors USDA's federal declaration\nmap.\nThat is correct.\nYes, sir.\nThose are the counties that were declared by the federal government as to be the counties\nthat were under the disaster, yes sir.\nThat is a reflection of the same maps that were used for other coverages for other disaster\nprograms.\nThank you Commissioner.\nThank you Mr. Chairman.\nWe're going to deviate from the agenda just for a moment.\nGeorgia Humanities, Ms. Mary, if you'll come on forward.\nI know you had a special guest with you\nthat we were, that was here earlier.\nFirst lady of this house, Ms. Dale Barnes,\nand she stepped out for a moment,\nbut wanted to acknowledge that and turn it over to you.\nThank you so much, Chairman Meeks\nand members of the House Appropriations Subcommittee\non Economic Development.\nThank you so much for your time.\nMy name is Mary Warren,\nand I serve as president of Georgia Humanities.\nI'm very grateful to OPB and Governor Brian Kemp\nfor his budget recommendation supporting Georgia Humanities\nAmerica 250 programming.\nGeorgia Humanities is now in its 55th year of service\nto the people of Georgia.\nFor more than half a century,\nour mission has been to bring history, culture,\ncivic learning, and civil dialogue directly to communities\nand their citizens across the state.\nWe have a statewide mission,\nand particularly those that do not always have access\nto large cultural institutions.\nThroughout that history, we have been careful stewards of public funds, consistently leveraging\nstate investment through matching funds, partnerships, and private support to ensure\nevery dollar goes as far as possible for Georgians.\nAnd in this past year, as we lost federal funding, we really stepped up our fundraising.\nIn year over year, we brought in 10 times the funding through philanthropy.\nAs our nation approaches America's 250th anniversary,\nGeorgia Humanities is uniquely positioned to help ensure\nthis moment is not only commemorated,\nbut meaningfully experienced, especially in rural\nand small communities.\nWe're agile, fiscally disciplined,\nand experienced, and creatively deploying partnerships.\nWe had over 200 partnerships and 300 volunteers\nin the last year, allowing us to move resources\nefficiently into communities so they can host their own\nAmerica 250 celebrations, grounded in local history and local voices.\nSo some of the things that the appropriations would fund should we receive them specifically\nfor America 250.\nFirst, community-based America 250 grants.\nWe are deeply grateful for the state's long-term investment in Georgia Humanities grant programs,\nwhich have proven to be one of the most effective ways to strengthen local capacity.\nFor a time, every dollar, every state dollar invested through a grants program has been\nmatched three to four times depending on the year locally, multiplying the impact of\npublic funds while empowering communities to take ownership of their own programming.\nSecond, the Georgia Circuit, and I'm very excited that this is a legacy program for America\n250.\nI remember 1976, and I was very excited to take part of that in many of the tiny little\nhistorical societies that exist across Georgia and across the nation were founded in 1976\nand Georgia Humanities wants a legacy program similar to that that will go beyond America\n250. So the Georgia Circuit is a new statewide America 250 program that brings Georgia-centric\npublic programs on the American Revolution and on our state's history, culture, and civic\nspirit over the last 250 years directly into communities across Georgia, connecting residents\nwith industry program, which brings professionally curated, traveling museum exhibits to small\nand rural communities, which might not otherwise have access to this level of cultural programming.\nOur upcoming exhibition, Voices and Votes Democracy in America, offers a historical exploration\nof America's great experiment with democracy, beginning with a revolutionary era, and tracing\nhow democratic ideas and institutions have developed and endured since 1776.\nWhile we're proud to bring high quality, nationally developed exhibits to rural Georgia,\nwe're even prouder of the capacity building that surrounds them.\nWe support local scholars, encourage constructive civic dialogue, and help communities tell their\nown democratic stories, so they are stronger long after the exhibit departs.\nThis is not simply cultural programming, it is community development and civic infrastructure.\nWe also integrate America 250 into our year-long educational work through National History\nDay Georgia, and we're a model across the country for this program that is across all\nof the states. It reaches in our state about 15,000 Georgia students annually and something\nlike 1,000 to 1,500 teachers annually so we teach the teachers. This year's theme, revolution,\nreaction, reform and history invites students to engage America 250 not as a single moment\nbut as an ongoing civic experiment that continues to shape their lives today. So America 250\nis a once in a generation opportunity.\nAnd although we anticipate we're going to get our federal funding restored at some level,\nwe don't know how much and we're pretty sure it won't be on time to support these events.\nWith the governor's recommended investment, Georgia can ensure a statewide, locally grounded,\nand fiscally responsible approach to commemoration, one that reaches every corner of Georgia\nand leaves a lasting legacy of civic learning and community engagement.\nGeorgia Humanity stands ready to deliver this work with the same care, accountability, and statewide reach that has defined our service for more than five decades.\nThank you so much for your time. I respectfully request your support of the governor's recommendation, and I would be happy to answer any questions.\nThank you, Mary, for being here today. And again, your guest that was with you, Miss Dale Burns, was in attendance to support Miss Mary in the comments that she was making. Any questions from members of the committee?\nSeeing none, thank you very much for being here today, appreciate it.\nMr. Steven Schimp, Georgia Ag Expo Authority.\nAnd ladies and gentlemen, if any of you are staying on the back wall,\nwould like to come and have a seat, please do so.\nThank you for being here today.\nThank you, Mr. Chair.\nmembers of the committee. We're happy to be here. I have with me Lori Dowd or CFO. We'll\ngo through a short presentation if you have any questions afterwards. We'd love to\nhang around and answer them. Great to report you today. The Georgia National Fairgrounds\nand Agro Center is operating at full speed. We weren't affected by the storms. Thank goodness,\nwhere we're at full throttle.\nOur calendar is very busy in book.\nAnd I want to start off just sharing a little bit\nof the points of our mission, what we do.\nBasically, we would build this board agriculture\nto get young people involved in agriculture,\nto boost the state's economy, and to host the state fair.\nAnd as we go through this presentation,\nI think we're checking all those marks.\nGood news.\nThe Georgia National Fair, 2000 and the 36th was 612,000 visitors\ncame to see us of most importance.\n47,756 corn dogs were sold during the Georgia National Fair.\nThere were, we had a lot of people there.\nIt was a great event.\ninside the gates during the Georgia National Fair,\n1.5 million in sales tax was generated.\nAgain, that doesn't include fuel means to get there\nand he's spending that went on outside of our gates.\nSo, very, very successful fair.\nActive projects that we currently have,\nour facility is 36 years old,\nso we've been heavily involved\nwith lighting upgrades, entry doors, HVAC, anything that you can expect from a facility\nthat's 36 years old and is heavily used.\nSeveral new projects coming on and we're just about through with the GAE-21 MRR money.\nWe've held on to that money for a long time, trouble getting vendors, and also price increases.\nSo we've been dealing with that as we move forward, sometimes putting some of our operations\nmoney into that to get those deals done, but our staff is doing a very good job in getting\nthe whole facility upgraded.\nBrand new coming in February of 2027 is that we'll be the new small species barn and arena.\nWe had probably 2,000 pigs this past two weekends ago at the Georgia National Fairgrounds.\nThey were piled on top of each other.\nThis new barn in arena will give a chance to spread out and hopefully have a much more\nenjoyable experience at a livestock show for the exhibitors and visitors as well.\nSo we're looking forward to that.\nFY 2026, we received $1.15 million, Reeves Arena, Heritage Hall for upgrades to boilers\nand HVAC.\nWe've got those under contract and they're underway.\nFY 26, I want to thank you all for the $900,000 appropriation that's given to us.\nOf course, you know, it offsets that $2.6 million cost to host all the youth events, youth\nagriculture events, and equine events in the state of Georgia.\nThis year's ask currently what was put into the governor's budget is another $2.5, approximately\n$2.5 million for HVAC replacements, again, 36 year old units that were taken out until\nwhat we're doing. The 2.5 made it into the governor's budget. We're very grateful working\nwith OPB. There were additional, we were asked to put this in priority. We do have some\npaving and ceiling issues that we'd like to deal with as well as equipment and some\nupgrades to some other buildings. But this list puts everything in priority. Our impact,\nour economic impact throughout the years,\nabout $133 million.\nThat's goods and services that are sold\nin the state of Georgia because of our operation.\nWe're very proud of that.\nWe didn't just come up with that number.\nThat's the Call of Institution.\nThey came in and did that study for us.\nAll right, the fun thing,\nand I wish the humanities lady was still here.\nAmerica 250.\nWe're gonna celebrate it in a big way.\nWe've got two specific events that we've pulled out.\nFirst of all, the Georgia National Fair.\nI already think that we are the most patriotic\nfair in the country.\nWe're gonna go above and beyond.\nWe do have the Smithsonian's Museum\non Main Street Voices and Votes.\nIt will be there all 11 days of the Georgia National Fair.\nWe're looking forward to that.\nWe're partnering with the Department of Agriculture\nThis year's theme will be Georgia Grown, America 250.\nEverything we coordinated with Robin's Air Force Base for a C-130 flyover last year to kick off America 250.\nThe government shut down right before that happened, so we were out of luck, but we're looking forward to a big year.\nIt's kind of a new show that we're doing to celebrate America 250.\nCurrently we have the, what we call the Georgia National,\nGeorgia National Antique Ag Show,\nwhich demonstrates the last,\nwell probably the first 50 to 100 years of agriculture.\nFor America 250, we're building this show\nas mules to microchips,\nthe partnering with the Department of Agriculture,\nthe UGA, University of Georgia,\nand the Grand Farm that is currently across the street\nfrom the fairgrounds,\nAnd the mission is to demonstrate\na mule plowing next to an autonomous tractor\nthat can plow twice as much.\nSo we're doing everything we can\nto keep this event free to the public.\nWe'd like, we see it as an educational opportunity\nto demonstrate just how far agriculture\nin the American farmer have come in the last 250 years.\nWith that, Mr. Chairman,\nIt includes my presentation available for any questions.\nThank you, sir.\nAny questions from members of the committee?\nDean Green.\nThank you.\nThank you for the ideas surrounding the 250th anniversary.\nBut keep in mind, Georgia was one of the 13 signers there.\nAnd Georgia needs to be emphasized.\nEvery time you do that, 250th.\nYes, sir.\nAbsolutely.\nI appreciate you being here today and all the work that the Expo Authority does in promoting\nagriculture and youth leadership with our students coming in.\nThanks for what you do.\nMr. Mitch, out of the way, do you order solar and water conservation commission?\nwelcome sir. Thank you Mr. Chairman and members of the committee I\nappreciate the the invite and opportunity to give some updates on Georgia\nsolar water and quickly go over what's in our small budget for this year.\nStart on the updates in our conservation department these are our five\nregional offices across the state that work closely with the 40 local\nsolar and water conservation districts across the state.\nThis fiscal year, we started doing something new with them\ndue to staffing and workload.\nUsually, the overviews where we work\nwith the local municipalities about their erosion\nand septic control department has been done\nwith that EMS department.\nWe've spread that out to them, and I'm happy to report.\nThey hit the ground running and have conducted\n20 of those so far this fiscal year,\nalong with conducting 50, almost 60 outreach events\nthat are mainly focused on ag agriculture,\nconservation efforts, and work with the youth.\nSo they, we get Neil Madeleine early age,\nand they start to understand the importance\nof conservation and the state's natural resources.\nWe've kicked off local issue and authority.\nThese are your local municipalities,\nfocused training events.\nwe hold one big erosion day in Athens every year\nwhere we have over 300 people,\nbut we also thought that we might be better served\nas far as educational purposes.\nIf we get these personnel that are at the local level\nthat are in charge to carry out state rules and regulations,\nif we can get them in a room of 10, 15, maybe 20 people\nat the max, they're more up to ask questions\nand understand what we're trying to push cross\nas a state agency, make sure they're understanding that.\nStarted the first one of those a couple of weeks ago\nand have about half a dozen more on the books\nthroughout the summer, look forward to those.\nThese staff members are also managing\na little over $2.5 million to assist private landowners\nwith conservation efforts on their property.\nOne of the unique ones that we have going on,\nand I think I might have touched on this last time\nI had the opportunity to get in front of the committee\nis a Farrahog effort where we are using different types\nof fencing, defense out ag, ag fills to see if that we can add\nthat to another tool, to the tool box for these ag producers\nwith their Farrahog issues.\nSo far, we have worked with 22 ag producers in Southwest Georgia\nhave installed almost 250,000 feet of fence.\nSo look forward to see the results we have\nas planning season is coming up quickly in those areas\nand we'll hopefully see some positive results on that.\nWatershed dams.\nLast year, Mr. Chairman, the committee saw the need\nto, for the first time ever,\nhave us some maintenance funds for these dams as a line item.\nThat was $150,000.\nAt that time, I was reporting.\nI thought we could hit maybe 60 to 65 dams with that money.\nHappy to report that we found a way to work\nwith our federal partners at USDA to expand that.\nWe've increased that through their funding by $200,000\nand increased the amount of dams that we were able to\naffect by about 20.\nSo appreciate your effort on that committee\nand look forward to continuing that.\nOne last thing I'd like to mention in that area is\nwe have four dams that are in the planning and design phase.\nThat's the last steps before we get to construction.\nOne of those is in Cherokee County,\nthe other three are in Forsyth County.\nWe're not ready yet to have a dollar amount\nfor a bond request on those projects,\nbut this time next year we feel that we will be.\njust want to bring that up to the committee's attention.\nAnd lastly, our Erosion and Central Control Department.\nAs you know, we run the certification program\nwhere individuals in that industry\nhave to have certain certifications,\ndependent on the work that they're doing.\nWe're at a little over 12, almost 13,000 certifications\nissued this year, which is about our average.\nAnd for the plan reviews last fiscal year,\nwe reviewed over 4,200 plans this year so far,\nwe reviewed 2,000, which puts us,\nI think we're targeted about 4,000\nby the end of the fiscal year.\nLast time I had the opportunity to be in front of the committee,\nI believe the question was asked about the amount of plans\nthat are an acre or less.\nSo I ran some of those numbers and 10% of those\nare less than one acre.\nSo we don't have a lot of plans that are less than one acre,\nBut what I found was interesting when I increased that search\nto up to 10 acres, 75% of our plans are 10 acres or less.\nAnd moving forward, the next time I'm\nfrom this committee, I'll have it broken down\nby three to five acres as well.\nSo we can kind of see that.\nThis is more of a big budget FY27 topic,\nbut I wanted to go ahead and just throw it out there\nas it's a big need for the agency.\nYou just heard me talk about the plan reviews.\nI haven't asked for currently a little over $100,000.\nThis would provide an additional reviewer\nand raises for current positions.\nThe reason for the addition is we're understaffed\nfor the volume of plans.\nThe raises would hopefully help address\nthe over 140% turnover rate we've seen\nin that department in the last three years.\nAnd those employees are leaving us\nwith about an 18-month average tenure.\nIt takes six to nine months to have somebody\nfully trained to review these plans.\nSo basically, we're getting nine months\nout of an employee before they're moving on.\nTo touch on our small budget edition,\nwe can be found on page 16 of your tracking document,\n13.8.1.\nAnd in there, you'll find the $2,000 supplement\nour staff that we are very appreciated up.\nThank you, Mr. Chairman.\nThat's all I have to be happy to take any questions.\nThank you for those comments.\nAnd again, just wanna reiterate what you had already mentioned\nin terms of your turnover rate,\nobviously 142% and the significant work\nthat you guys do with reviewing these plans\nand the need to try to work on that.\nSo as we move forward with the 27 budget,\nlook forward to working with you to try to address\nthat need in some way.\nThank you, Mr. Chairman.\nYou know, there's a lot of the good work\nthat many agencies in here do.\nGeorge has been a desirable place to come move to,\nto live work in place.\nWe just want to make sure we can do our part\nto keep it that way.\nWe thank you for that.\nAny questions from members of the committee?\nSeeing none, thank you for being here today.\nAll right.\nThe Public Service Commission, Mr. Reese McAllister.\nCome on down.\nGood afternoon, Mr. Chairman.\nGood to see you again.\nI can't believe it's been two months since we did this,\nbut time flies by.\nSo I want to thank you for allowing us input in the budget process today on behalf of the entire public service commission staff.\nWe want to thank you for what you put in our budget for FY26 to help with retention for many of our employees.\nAnd we'd like to thank you and the governor as well for the one time salary supplements that have been proposed as well.\nSo as you know, the PSC has a complex mission of energy regulation.\nFinding and retaining skilled staff is an ongoing challenge and your work with our budget\ngoes a long way in helping us fulfill our role for the citizens of Georgia.\nAs we shared back in November, Georgia, like many states, has seen an unprecedented\nload growth on the power grid.\nAs recently as 2022 in our previous RRP, Georgia powers predicting load growth of 400\nnew megawatts, only 400 megawatts over seven years, but the most recent predictions show\nlow growth in a range of 10,000 megawatts. To put that in perspective, Georgia Power currently\ndeploys about 22,000 megawatts statewide today, and Georgia Power is effectively seeing\na 45 percent growth increase from that number. So this new low growth, it brings challenges\nand opportunities. In December, to meet that need, the PSC approved a generational investment\nin our energy infrastructure. We approved this in a way that will protect existing rate\npayers from the needs of new large load customers, specifically data centers, the word that\nis very popular today here on the hill and in the media. So in our hearing room has become\nground zero, it seems like for the data center issue. But I like to state clearly, the\nPSE does not approve or certify data centers. It has no say in the approval of site selection\nfor data centers, nor does it monitor data center construction. The PSE's mission is to\nto ensure that Georgia Power can meet the needs of its customer base and prevent calls\nshifting from one customer to another.\nThis mission is critical to the economic development of the state and our decision in December\nfalls directly in line with this mission.\nI have with me today our utility director thank goodness Mr. Bond, Tom Bond's here so\nif you have any questions regarding low growth or our efforts to prevent calls shifting\nMr. Bond will handle those questions thankfully not me.\nAs far as the amended FY 26 budget, the PSE requests help for the construction monitoring\nprocess for this new Georgia power and low growth infrastructure.\nThe annual state appropriation for the PSE is relatively small compared to other state\nagencies, but the decisions of the commission impact the entire state.\nAnd the governor's proposed AFY 2026 budget, the PSE would receive about 13.3 million in\nstate funds.\nBecause we're a small agency, even small changes in the energy sector can place large burdens\non our staff.\nAnd as we said previously, it's a 45% increase in just the energy load, alone in this massive\nincrease in energy load, caused by data centers is going out of significant workload for\nthe PSC.\nSpecifically the PSC must monitor new construction as Georgia powers infrastructure expands.\nRight now we have three new units that are under construction at Plant Yates in Newton.\nWe also have expansion at three other plants that will begin this year as well with five\nadditional units to help generate the needed energy low growth.\nThe PSC is charged with ensuring that Georgia Power spends money prudently when constructing\nthis new infrastructure, ensuring prudent spending on construction directly corresponds\nto lower rates charged by Georgia Power for their rate payers.\nThe PSC is already short-handed on staff for construction monitoring.\nWe have one person.\nbut that's pretty short staff.\nAnd on construction monitoring and qualified construction\nmonitors can take time to train.\nTo meet the workload, we plan to promote from within\nour own staff and begin cross-training immediately\nbecause of the need.\nWe then plan to backfill the existing positions\nthat we've opened up for this purpose.\nTo adequately monitor Georgia powers upcoming\nconstruction projects, the PSC needs one engineer\nAt a salary of 85,000, 144,500 after it's been\ntrue to up for fringe benefits.\nAnd a new financial analyst at a salary of 75,000\nor 127,500 after true up for fringe benefits.\nFor a total of 272,000 to fully fund both positions.\nAs we met with OPB last October, and as we met with you\nin November, we mentioned that we might have a request\ncoming.\nWe didn't know at that time we were in hearings,\nand those hearings have been concluded.\nSo this is why this need exists.\nAs construction moves forward on other projects,\nthe PSC is likely to ask for more construction monetaries,\nbut those are monetaries,\nbut those additional ask and wait,\nat least until another budget cycle.\nAnd our conclusion is always the Public Service Commission\nand PSC staff work hard to remain good stewards\nof the people's money.\nWe welcome any questions or comments\non funds that have been appropriated\non our request for future funding\non PSC construction monitoring\nand also on infrastructure expansion.\nSo any questions?\nThank you for that presentation of a couple of things.\nCan you update us on the pipeline inspectors that we've put in the budget over the last\ncouple of years and how that's working?\nYes, sir.\nWe've been able to fill all those positions as we've stated prior, it's hard to find\nqualified people.\nMany times when we get them trained, the industry comes and takes advantage of our training\nthat we've invested in harsam away.\nSo right now of all the positions you've approved their field and we're examining right now the possibility of needing more but our most recent audit from the feds got us a much better score.\nSo we're very satisfied there and still working to improve that program.\nGreat work there. Are you in a position to talk about whether or not the current salary for those positions is enough to retain those positions rather than getting them hired trained and losing them to somebody else?\nI think Mr. Bond would agree we've set up we've put in place a structure based on training because every time they they get a level of training\nWe increased their salary which has helped with retention for those individuals. We were always open to increasing that but for right now\nI think Mr. Bond is the utility director would be satisfied with that with that salary structure. Okay. Thank you, sir\nand then on the requests for the\namended 26 budget the additional\nengineer and financial analyst. What do you have an estimate of the equipment\ncost for those two positions or anything they may need?\nThey wouldn't need equipment other than computers. We already have a car that\nthey can use to go to the sites that would require going to the construction sites\nthat's fairly regularly and it's three different plants so we have a fourth when it's already under construction so it does require a bit of driving but we're not asking for a vehicle because we already have one that's available for them to use.\nOkay, thank you. Any questions from members of the committee?\nAlrighty. Thank you, sir. Appreciate y'all being here today.\nThank you very much.\nYou're our best to the chairman.\nWe're ready, Mr. John, Department of Economic Development.\nThank you, Mr. Chairman, good afternoon.\nGood afternoon.\nThank you for being here today.\nThank you.\nSo, name is John Moffitt with the Department of Economic Development and we are the sales\nand marketing team for the state of Georgia and all our previous speakers have talked\nabout all the successes Georgia's had and we couldn't do without all their help and\nall the partnerships that we have with our other agencies.\nWe have World Congress Center here.\nWe have community affairs and we work very closely with all of them.\nJust a couple highlights of last year just to give you some of the successes that we had\nlast year, tourism, $82 billion in total economic impact, which is a tremendous amount, 174\nmillion people in total visitation, trade, 53 billion in exports. So that's, we broke\nthe 53 billion, 50 billion mark for four years in a row. That's a record. Global commerce,\n26 billion in investment. You notice these numbers are all in billions, which is incredible,\nover 23,000 jobs in the private sector.\nCentres of innovation, 441 companies serve.\nNow those you don't know about the centers of innovation,\nthey work mostly with small businesses\nwho are looking to take their business to the next level.\nSo they are connecting point from a small business\nto the research universities around the state\nlike Georgia Tech and others like that.\nAnd so we help those small businesses\nbe able to make those connections\nwith those research facilities,\nto be able to make that transition to the next step for them\nin their business operation,\nwith this manufacturing on a line or something like that\nor something with plastics and things of that nature.\nThe film department,\n245 productions last year,\nincluding 13 feature films and 42 independent films.\nI know Mr. Wilson, the commissioner, good friend of mine,\ntalked about Stranger Things and it was incredible\nbecause they spent 804 days filming in Georgia last year,\nhired over 3,700 Georgians and $298 million in crew payments.\nSo all that money is going to Georgians.\nThe arts, which is another great example\nof how we help small businesses, $5 million in grants\nlast year to the arts.\nAnd they go out there and they hit all areas of the state.\nThey're not just in the metro area.\nthe arts is out there helping out small businesses throughout the state.\nWhen we look at our 26 amended budget, one of the items in there in the Department of\nAdministration is $3 million.\nThat money is going to be used for, as you can see, tourism promoting tourism, update\nagency marketing, and enhanced recruiting efforts.\nAs far as the tourism piece goes, we're working hand-in-hand with World Congress Center this\nyear.\nWe have a little event called the FIFA World Cup, and we're trying to capitalize on that.\nNot only as the visitors are here, but also when they leave to remember Georgia.\nSo on that, we're using a lot of those funds for that.\nWe're also using some of those funds for web enhancements.\nThe web enhancements we need to transition over are going to help with search engine optimization,\nadvancements in analytics and things like that.\nSo we can keep track of things, we can do research\nand see what people are really looking for\nand what the advancements need to be.\nWe're also looking for, as we stated in that,\nagency marketing materials,\nwe're gonna be doing a ad in the Atlanta magazine,\nthey ask us we do an ad for the world's cup,\nwe're gonna do that.\nAnd the nice thing about that is that's a momentum piece.\nSo people are gonna hold on to those things.\nAnd so when I look at that,\nthey're gonna see Georgia all the time.\nThey're gonna see R.A.D. and that.\nhope that leads to a return visitation.\nWe're also looking for paid media, group travel, things\nlike that.\nWe go out to trade shows.\nThat's how we promote Georgia.\nWe're not only promoting Georgia domestically,\nbut we're in and nationally.\nAnd I know the numbers are, they say, we're in 12 countries\nand this and that.\nWe're probably in a little bit more,\nbut what we have is we have 12 contracts,\nbut some of the contracts include a couple of countries.\nAn example of that would be Chile, Argentina, and Peru.\nthose one contract, Columbia and Mexico,\nthat's one contract.\nSo we're all around the globe promoting Georgia\nand we've had these relationships with these people\nfor years and it just shows how well we're doing\nbecause they want to stay on with us.\nSo that $3 million, the other question was\nit is best use in admin and we feel\nthat it's the best use in administration in that bucket\nbecause the marketing team is going to be using\na lot of that spend and they're pretty much\nhoused in the admin program, those positions,\nand they're gonna be spending that money.\nAnd so I know a question was,\nwould it be better suited in tourism?\nActually, the best location is admin,\nthat's why we requested that in administration.\nOutside of that, we're very grateful for the $2,000\nthat people are getting.\nPeople don't realize, some people may think\nthat's a small amount, it's not a small amount.\nThat helps tremendously with morale\nand people are very excited about that.\nWe talk about, you know, the economy and things like that,\nhealth, payroll may have not been keeping up with inflation and things like that, so little\nthings like that make a tremendous difference and a people are very excited about that.\nThere is one item in here that I'd like to mention.\nI did mention it with Bailey on the $2,000 for the arts.\nIt's in the wrong program, so we would like to have that move from special projects.\ngroup for special projects for transparency purposes was moved to a new program to just\nshow the grants that we have for arts.\nSo that includes a $976,000 we have for state money for grants plus the money we get from\nNEA.\nSo if you look at that on my sheet here I think it's 23.4 special projects we would like\nthat 15,000 to move up to 23.3 because that's where the payroll is being paid for those\npeople in that division, Georgia Council for the Arts. After that, the final items here\nare in tourism and our friends over at the humanities have spoke about $110,000 and we are\nworking with them, close hand in hand along with the Historical Society on the 250 celebration\nthis year. We're working on that. We want to make sure that what we're going to look\nto do is we're going to have our website updates where all the communities they can reach\nout to us and let us know what they're doing for that special day.\nThis way, anyone can look at our website and go, hey, what's going on in this location?\nWhat's going on in that location and they can give us that information.\nThe other piece in here is the World Congress Center and Kevin and his team will be talking\nabout that $10 million.\nIf you see that, there you see it's for the Super Bowl.\nSo that's another item that if there's any discussion on that or questions they could probably without a doubt handled questions a lot better than I can.\nThat's pretty much for our amended budget for FY26.\nAgain, I want to thank you all for all the help you do for us because economic development is a team sport and it starts at the top.\nAnd all our agencies, the governor, the House, the Senate, you all know the importance of it.\nYou help us as best you can in giving us the tools, the right business environment here in Georgia,\nthe weather doesn't hurt, even though it was a little crazy the last few days.\nBut it wasn't that bad where I came from in New Jersey, it was a lot worse, so we should be very thankful.\nWell, that's sir, in the committee, that's our report. Glad to answer any questions.\nThank you, sir, for that presentation.\nBack to 23, 1.2 on the 3 million.\nDo you anticipate that being one third, tourism, one third,\nagency marketing, one third, recruiting efforts?\nHow do you anticipate, they said it would be spent\nin all three buckets, but how do you anticipate\nthat 3 million being divvied up?\nWe expect the trade one and a half to kill me\nand going towards the tourism and marketing\nwith the world cup and things like that.\nThen we expect about 500,000 comparable to that.\nfour, five to 700,000 for the website upgrades.\nAnd that website upgrades keep in mind is all interchangeable.\nThat's going to help with 250.\nIt's going to help with the world cup and things like that.\nPlus going forward from that.\nThen remaining money we're hoping is going to work with\nor outside marketing materials for other agencies,\nfor other divisions within our agency,\nand upgrades on that.\nAll right, your questions?\nDengreen.\nThank you.\nThank you so much.\nWe appreciate that very much.\nGoing back to the tourism thing,\nhow much does the state of Georgia take in\nfor every $5 that we take into?\nI'd have to look at that.\nThat's pretty hard to think of stabs.\nI know years ago, the department said,\nfor every dollar spent, you get a $7.62 return.\nI don't know if that's the case.\nI don't know, we'd have to, I mean, great question,\nbut to get answers to that, it costs a lot of money\nto do that research.\nAnd so we can dig into that and see if we can come up\nwith a number, but I don't honestly have an answer\nfor that right now on every dollar that we spend,\nwhat the return is on, marketing dollars is your question.\nYes.\nWe can look into that.\nI'm sure we have some ballpark.\nI just don't have it on hand right now, sir.\nFurther question?\nThe State of Georgia does the amount of money that we give for marketing is very low.\nI would like to see if there's a way and I believe that $5 is goes to the Department of\nthrough the transportation as we said it up years ago.\nAnd I think it's beyond the $100,000 threshold.\nI would like for us to look at some way of looking at that money to be divided up into\nour tourism and marketing.\nI mean, as the sales are marketing on for the state, we've gone through the recession\nof 0809, we had cuts in 11 and 12 and 21 are marketing dollars from 08 to now is 55%\nless. We were at 18 million, we're down to 8 million now. So that gives you an idea where\nwe're at.\nYes, it's time that we really took a strong look at that. Thank you.\nThank you.\nThank you, Dean Green. Mr. Giljard.\nI'm related about the upcoming American 250 of the anniversary.\nIs that going to be grant privy to the different municipalities on those funds?\nWell, we don't have any grant funds for that, so we're working with Humanities and Historical\nSociety.\nHumanities got an additional 110,000 in our budget for amended 26.\nThat's a pass through from us to them.\nI don't know about any granting what they're doing on that.\nI mean, I don't know what kind of funding\nif they've received anything like that.\nNow, if arts community are doing certain special things,\nor art grants could help with those types of issues.\nIn my second question, if you further yield,\nalways it's an attribute for tourism.\nSo that is number two in feature film.\nAre there any plans you were talking about marketing\nwith all this going on in the film industry\nto kind of do a reboot to retain other folks,\nto come back to Georgia, is there any effort\nwith our marketing dollars on that?\nYeah, we're always trying to market.\nI mean, the nice thing about when we had the Film Act,\na lot of these agencies and businesses that grew,\nthey grew organically.\nThey don't get the 30% discount.\nAnd so most other states now have copied what Georgia.\nI mean, Georgia made a bold move back in 2007 and 2008\nwhen people getting rid of those programs.\nGeorgia said, we're going to institute this new film tax credit.\nAnd it was tremendous.\nI mean, we were talking, you know, at one point, you know,\nmaybe, you know, $250 million to like over $2.3 billion.\nWe are having some issues with the teamsters now.\nAnd that's driving a lot of things with the film industry.\nAnd, you know, when prices like that raise,\nit's hard to come in here,\nand they can go somewhere cheaper.\nSo we're trying to work through some of those issues\nright now, I appreciate it.\nThank you.\nCan't come to a committee meeting with us talking\nabout how we're going to involve the rest of the state\nwhen it comes to the soccer games coming up.\nI know that the commissioner mentioned the efforts\nthere in the full committee joint hearings.\nBut for the sake of the members who might not have been here,\ncan you update us on where we are with the thought process\nof bringing community leaders from around our state\nto Atlanta to interact with world leaders\nwho are here during those games?\nWell, like I said, the website, we're going to work on that.\nWe're working with the Georgia World Congress Center.\nAnd I think they can speak that there's\nan activation center there.\nSo what we're trying to do is create\nlike an atmosphere at the World Congress Center\nwhere people can come have set up about their communities,\nwhat their communities have to offer,\ntalking about watch parties and things like that,\ncommunities do to see these things,\nand all these things are going to be on our website,\nhow to go about it, what they need to do,\nand things like that, and any resources that they need,\nor who to contact for that.\nWill there be an effort to communicate to those\nwho are attending the business leaders,\nthat that is set up there for that specific purpose?\nSo, we'll be looking at the business leaders that are looking to come, and the business\nleaders that we are currently invested in, and all business leaders for that matter.\nI mean, this is an opportunity, I think Kevin will say.\nI think we have this audience for like 37 days, and so we want to make sure that on those\noff days that they have a whole Georgia to go look at, and so that's what we're hoping\nto do with these monies in our website is to really branch out and talk about that with\nthe help from the World Congress Center and help many communities that they want but\nalso to really make that an event where everyone can participate in and enjoy it.\nWell, thank you for those efforts.\nWe just want to make sure that we don't miss the opportunity for rural Georgia to have\nan opportunity to come up and visit with those who will be here and possibly recruit businesses\nto their districts.\nAnd we want to make sure that it's returned as it's right, you know, we want them here, but we want to say hey come back\nThank you. Thank you for that\nAny other questions the other questions. So thank you appreciate you be here today. Appreciate it\nMr. Shane Hicks from G. Dord environmental finance\nThank you for being here today\nMr. Hicks, thank you for being with us today.\nThank you for having us, Mr. Chairman and members of the committee.\nI appreciate the opportunity to present on the amended budget.\nAnd the name is Shane Hicks.\nI'm the Director of Public Affairs and IT for the George Environmental Finance Authority.\nauthority, and I'm joined by Jamie Hardin. He is our director of financial services.\nWant to mention, we have had a change in leadership over the past few months in November. Governor\nKemp nominated an appointed up trade minute to be our executive director. Unfortunately,\nTray had a funeral to attend for a close relative and could not be in person today. So, wanted\nto pass that along. The George Environmental Finance Authority since 1986, this is our\nFortieth year has financed more than six billion in infrastructure projects for water and wastewater stormwater\nAll over the state of Georgia and we also manage several energy efficiency and renewable energy programs\nWith federal funding we also monitor the state fuels tanks to make sure they are staying up to date all of their compliance issues\nAnd as mentioned earlier we are the lead for ESF 12 emergency support function 12 with GMA and Homeland Security\non energy and fuel. So our staff were busy this weekend monitoring our power\noutages and fuel supply to make sure there are any urgent resource requests we\nwill get those power and fuel services restored. The amended budget is\npretty straightforward for Gefa would refer you to line 16.8. We have a\na $35 million appropriation recommended by the governor to support natural gas infrastructure.\nLast year, the legislature passed Senate Bill 13, and the governor signed it into law,\ngiving us the authority to finance natural gas infrastructure throughout the state.\nWe have a lot of local gas systems that I think as many of us realize are running into capacity issues with their natural gas infrastructure.\nAnd this is vital to support economic development\nin the role parts of our state.\nAnd so we're really excited about this program.\nIt is a natural fit to support what we've been doing\nfor the last 40 years on water and wastewater.\nAnd so we really appreciate it\nof the governor's recommendation\nand the legislature's support.\nHopefully as we go through the session\nfor this 35 million in finance.\nWith that, I'm happy to take any questions.\nThank you for being here today and for the update.\nOn the 35 million, do you have adequate staff in place\nto handle this new program or will additional staffing be needed\nin order to get this up and running?\nWe are discussing the possibility of one additional staffer\nin our Energy Resources Division to help manage this program.\nAnd with that, I presume that you're currently working on\nthe guidelines that you will use to set forth\ncompetitive process for the 35 million the governor has added in the budget.\nYes, that is correct. We're working on the framework. He'll have something by this summer\non how the program will work to provide the low interest financing.\nAnd then from there we'll move forward to taking applications and hopefully awarding some\nprojects. Well, thank you. Thank you for that update. Any questions?\nThat's it. Thanks for being here. We appreciate it. And thanks to the employees who worked\nduring the storm to make sure that the ordinance needs were addressed.\nThank you. I'll pass that on. Thank you. Thank you very much.\nDepartment of Community Affairs, Commissioner Nunn.\nGood afternoon. Appreciate the opportunity to be with you. Mr. Chairman, members of\ncommittee. I'll be brief as we know you're running long and leading and I'll\njust kind of dive in on the tracking sheet. Christopher Nunn, Department of\nCommunity Affairs, great to be with you all. Certainly appreciate support. I won't\ngo into the into depth just thanking you for the the $2,000 but I echo what\nyou've heard from from everyone else. That really does go a long way and it\ntells our employees that they are important and that they are valued and the\nThe great work that they do is really second to none.\nOn 166.2 in your tracking sheet, I will highlight a $50 million ad for a one-time funds for\nthe State Housing Trust Fund to address homelessness through matching funds for local governments\nand nonprofit organizations.\nI don't think that you have to look very far, no matter where you are in the state, to\nappreciate that there's been a that there is an increase in homelessness. I\nmentioned at the at the joint budget hearing this is a very complicated\nissue. In fact I shared I've shared with you all over in the past years that\nthere was a GAO study a couple of years ago 2020 actually it was 2020 data\nthat highlighted that for every hundred dollar increase in rent an average\nrent and a community, there is a corresponding 9% increase in homelessness.\nWe know that this is a challenge, that housing is a challenge for many of our 11.2 million\nGeorgia's. We also know that while $50 million is a lot of money, when you look across\nthe state, that's not an enormous amount of money to address the housing needs across\nthe state and so the intent with these funds is to target unsheltered homelessness.\nThose folks who are on the street and there were a couple of questions that I did make\nnote of in the joint hearing because it is true that trying to address people and their\nneeds before they become homeless is an important challenge.\nWe also, we know that because we have ministered along with a handful of local governments $1.3 billion\nin one-time federal funds over an 18-month period two years ago for that purpose.\nThese $50 million will be used to provide flexible grants to local governments and nonprofits\nwho come with solutions that are locally driven.\nSo we believe that the solution to address unsheltered homelessness in Atlanta looks different\nperhaps than the solution to address unsheltered homelessness in Savannah certainly looks different\nthan the solution to address unsheltered homelessness in Tifton or Statesboro.\nWe expect that these funds will simply enable the state to work alongside local communities\nthat are working with their local partners\nto address their local needs.\nSo, address on sheltered homeless.\nThe second piece that we anticipate is\nthat these funds will be leveraged.\nSo $50 million would be leveraged by local skin in the game.\nThat can come from local community commitment.\nIt can come through philanthropic commitment.\nAnd to clarify a question that came up,\nand I think it came up from a senator in the joint hearing,\nI am not the fundraiser.\nWe're not looking to go out and fundraise to expand this.\nWe simply in a competitive grant application process\nwill look for all of those grants to bring money to the table\nand we would be looking to participate\nalongside those local funds to develop sustainable solutions,\nwhether those are, whether that's providing capital,\nwhether that's providing for services,\nwraparound services as a part of an overall strategy.\nSo we will absolutely look to leverage these\nwith matching grants from local communities.\nAnd then the third piece and I'll tell you that\nthis was modeled in part off of what we have seen\nand talked about with some of our,\nwith some of our sister states.\nI know they were a handful of us that went out to Texas\nand met with some folks out there.\nAnd they've put some flexible grant funds,\nmade them available to communities.\nWe don't want to put a lot of requirements\nbecause we want to allow the local governments\nto drive the innovative solutions,\nbut we do need some data.\nAnd so we also expect there to be a reporting element\nthat is required out of this.\nThat's really the, the plan, the cursory plan at this point,\nbut again, we're asking your support for that $50 million ad.\nMr. Hicks reported on 16, 8, 1, and Gefa.\nI will tell you, Tray Bend is off to a great start\nand he's doing a great job,\nand we've talked a little bit about their plans\nto roll out that new program,\nand of course we will support them\nany way we are able in that regard.\nIt's at 169.1.\nThis is actually a reduction,\nalthough it is reflected in forestry and in the ag budget\nas an addition, so we're simply moving\nthe recommending that these funds be moved.\nLast year, you included $25 million in the budget\nto address Hurricane disaster response.\nAnd we appreciated the opportunity\nto stand up a new program to address Hurricane disaster relief.\nWe actually did that in conjunction\nwith some federal disaster funding as well.\nWe rolled out a program that was eligible\nor that was open to applicants from local communities\nas well as nonprofits.\nI know that we've talked about the fact that we needed to get blue tarps off of roofs.\nAnd I got an update from our federal funded program.\nWe have had two date, as of yesterday, 5,681 pre-applications from every eligible county\nfor those disaster funds.\nAnd of those pre-applications, 1,576 are in process with a full application.\nthat they've been qualified and we are assessing the home for home repair, roof repair of things\nof that nature. With these funds that you appropriated, the 25 million, we have made 17\ngrants through two grant rounds, totaling $13.8 million thereabouts to communities really\nall across that affected area from Valdosta to Augusta and much rural area in between.\nThese funds have been, I think, really critical to address non-Thema and non-insurance related\nor covered needs in communities that really needed to address some catastrophic issues,\nculvert repairs, building repairs that weren't insured and weren't going to be able to\nwait for federal disaster funds down the road.\nSo we've made those grants.\nThe recommendation here is to move the remaining funds of that $25 million to address timber-related\ndisaster needs that is, I think, in keeping with the legislative intent of those funds.\nAnd then at 169.2, we have a recommendation of $15 million to continue the rural site\ndevelopment program.\nI think I reported the other day to date we have made 11 infrastructure grants across\nthe state.\nIf you think about the history of one Georgia over 25 years, we've invested about $800\nmillion in communities all across the state.\nthroughout both of your districts and really I think it's about 140 counties that have\nbeen touched by one Georgia. Many of those smaller industrial parks that locals have marketed\nfor years have been consumed over the last five years as we've had unexpected or unprecedented\neconomic success. And so this is really a program of how do we rebuild some of that capacity\nAnd we've made 11 grants.\nWe've also extended 11 like planning scholarship grants\nfor 50 to $150,000 to help communities\nwith some of the engineering and the design\nand the environmental studies that are necessary\nto pursue the Department of Economic Development's grad\ncertification.\nAs those communities achieve grad certification,\nWe anticipate a continued pipeline and demand for the infrastructure grants.\nAnd so that's the recommendation here is to continue that program with the $15 million.\nThat's really the only, that's all we've got in the amended budget,\nbut I'm happy to entertain questions if there are any.\nBut thank you, Commissioner, for being here and that update.\nAnd I do know that the role site development funds I've been\nimportant to many communities across our state. Any questions from members of the committee?\nAll right, thanks so much for being here. Thanks so much.\nDirector Sabo, come on up.\nGeorgia Forester, commission.\nI'm pretty sure he's probably in the lot of Philly, isn't he?\nNo, I don't know, I don't know how to do a lot of it.\nI don't know either.\nAll right good afternoon yeah for the start thank you for being here\nI appreciate that and I feel like I got to say for the record I won't say which past speaker\nBut somebody made the comment they filmed stranger things for eight hundred and four days last year and that pretty much sums up the\nForce industry and forestry community. That's that that was a very good representation\nAlways let remind everybody of our mission vision and core values and and that really reflects in and who we are and especially the\nintegrity, respect, equality, using fax to drive our decisions and being responsible for\nour own success.\nTo me, that's something I think a little bit rare in government, especially those that\nthat very last one, and I really feel like our folks just embody that.\nQuick highlight on some recovery efforts, and so this ties back to last year, we were\nable to purchase 29 additional tractors with the 10.9 and total that we received, or sorry,\nare the 12 million, the 1.1 that we had in our budget and the 10.9 in the amended budget.\nFive tractors have been received, the other four, I mean, when I say they're weeks away,\nthey are literally weeks away.\nThe fuel mitigation program, that was the cost share program for landowners to help clean\nup, you know, almost, almost 2,500 applications.\nSo we did a second sign up because we reached out to every single applicant that we had\nto find out where they were if there was help that they needed and one thing we were\nable to do through that program or through those calls were link loggers who might have\nbeen misplaced from the loss of industry to help them with landowners who had funds to\nclean up. So that helped bridge the gap but we did have roughly $16 million in land\ninterchange they were going to use a federal EFRP fund so that's why we did the second\nsign up way more than enough applicants now to utilize the fund so I maintain that\na lot of the and a lot of those landers did indicate that they are waiting on the block\ngrant funding to have money in hand to help a clean up to begin that program.\nAlso we had three million of those funds separated out to help with the fire lines, force\nroads, over 3700 miles of roads and that's just a fire lines and roads and that's just\nin the impact area.\nThat's not statewide that we utilize those funds for over 11,000 equipment hours and we'll\nkeep doing free fire lines and breaks until we run out of funds and just really\nbeen an outstanding program and really important to our employees and their\nsafety and we'll get to that later on. Some key performance indicators that I\ndid not go over in a joint session that I wanted to highlight. The first one so\nfar this this fiscal year over 2100 wildfires for 11,000 acres. When you\ndrill down to it that's a 5.1 acre average for wildfire so even with the\nincreased fuel loading the increased fires we're still maintaining our five to\nsix acre fire average and really just want to thank our personnel there and\nonce again that ties back into you know that this committee and the help that\nyou've given us with the right equipment you know the funding to put those\nlines in and you know be proactive and not just wait. Forest management our\nour southern pine beetle spots are greatly down.\nThat was a big concern with the hurricane.\nWhat type of pine beetle activity will we have?\nSo those numbers are down 75% from where they were last year.\nSo really just good news from a forest health perspective there.\nThe other thing that we did, no one of the highlight was we\nadded four additional foresters to the field.\nSo some of our leadership came together through retirements\nand they took four positions which it does decrease\npromotional opportunity for people, leadership willingly took on more and we were able to put four additional foresters into the impact area to help with the caseloads and workloads and that that so far has just been an outstanding support or outstanding effort.\n5.6% turnover last year that includes retirements without retirements we're looking at 3.6% turnover for the agency so could not be proud of our our agency our leadership and to me I think that just speaks to the culture of where we are and the work has been done.\nyou know, by the members to help give us the funding and have the salaries where they should be.\nWe also dedicated our building to John Mixon this past year.\nThat was past last year in the resolution, so Mr. Mixon was a former state forester\nand just really a pioneer in many ways in our industry.\nSo that was an outstanding opportunity that we had.\nDiving off into our AFY budget, AFY 26 budget.\nAs everybody said, the employee supplemental to $2,000 that goes a long ways.\nI don't think I have to speak to anybody, you know, just the cost of living,\nand what that is, and how impactful that can be.\nSo this just helps morale, helps folks that may have been putting things on credit cards\nfor too long, and just kind of get their feet back underneath them.\nSo just a huge win and something we fully support within the agency.\n107,000 and operational funds for the new helicopter.\nThat is our picture of our new helicopter, so we will get that later on this.\nWe will bring it to Georgia later this week, it is in Virginia right now, doing a few\nlittle minor touches on it, so we don't want to take ownership until it is 100% how we\nwant it, but obviously it flies, so that's a good start.\nbut that 107,000 will be, that's the last quarter funds\nof what we'll see for our FY27 budget.\nAnd that was in conversation with OPP,\njust funds we knew we would need since it was an addition\nto fleet when we talk about fuel maintenance,\neverything else.\nI'm gonna skip the 10.9 to Georgia Forestry Innovation\ninitiative, because I will touch that on the next slide.\n148,000 in pasture grant funding for Talbot County.\nThat's just our traditional pasture funding.\nand there's a 60,000, it's internal, but staying with us,\nbut going from management to our forest protection.\nSo just wanted to mention that since it's on your sheet.\nThe last one that's on here,\nit's not part of the timber task force\nis a 12 million for tractor replacement.\nLast year was 10.9, but in total it was 1.1\nbecause we had 1.1 worth of equipment funds.\nThis year the ask is at 1.1 and FY27\nwill be shifted to operational funds\nto help with the increase in fire.\nSo to get our 12 million total that we were able to obtain last year, it's in this year's\namended budget.\nAnd happy to have more discussion later on if you would like.\nGover forestry task force, I'll start with the mass timber building.\nSo that is actually a picture of a mass timber facility just outside of Chattanooga.\nThat's the only one we've been able to find that may kind of resemble the inside of a\na county unit and that's what we're looking at something similar within Morgan County\nand that's what the 2.6 is for.\nIt would be the state's first, as far as the state agency, first mass timber facility.\nYou know, there's some nuances to it that we want to figure out.\nProjection costs, to be honest, do look like they're roughly 10% more than your average cost,\nbut we're trying to work with builders and architects who have utilized mass timber before.\nwhat you'll find in an architect or builder has not used it they're kind of they shy away from it and they'll price it\nLike they're building a traditional building, but there's a lot of cost gain from when you do when you do start receiving it on site and start building\nReally good example is a story here for pot city market\nWhen they were when they were building the mass-tumber facility adjacent to it\nThere were six workers putting the thing together in the building behind it had you know 50 plus but in the same size building\nso\nWe know there's efficiency to find and that's our ass is let the Georgia Forestry Commission\nkind of be the guinea pigs for the state find those efficiencies and how do we start utilizing\nmore mass timber. Commission or Harper touched on the Georgia grown wood that is that is in the\nDepartment of Ag budget as where it should be great partnership between us, Department of Ag\nand Forest Industry partners and once again this project specifically but really all the projects\nGeorge is behind in the loss of industry and that's a good thing for many reasons.\nWe recently lost industry, but our other state, South Carolina, Alabama, Mississippi, Arkansas,\nthey lost industry years ago. So we're at the back of the line, so to say.\nAnd so how do we attract more industry? How do we get to the front of the line?\nAnd that's a big piece of this.\nYou know, Georgia being the number one state to do business helps, our ports, our rail system,\nthat's factored in there, but how do we help tell our story and this Georgia Grown Wood\nproject is a huge part of it.\nThe increased funds for the Georgia Forestry Innovation Initiative with Georgia Tech,\nthat is, you may have heard the term like the rewood group out of Georgia Tech, they have\nbeen doing the research for years now, so these are not funds to do research specifically.\nThese are funds to take those research and go scale up and partner with industry through\nthrough their transfer technology program\nand work with our companies within the state.\nAnd how do you take those wood products to the residuals?\nThey use small diameter woods,\neven the less desirable species.\nAnd that's the market we lost, right?\nThat's the small diameter market,\nsome market we lost.\nSo how do they take those species\nand turn them into things like pharmaceutical coatings,\ncarbon black for tires,\njust a wide array of different things.\nOne thing that I read a full statement during the joint appropriations, I don't want to read it now,\nbut I do want to make sure I get these numbers right.\nSo the projection for the two-year economic impact could add up to 2 billion to Georgia's DDP,\nand it full matured it could grow up to 80 billion.\nI already started to have conversations with the technical college and how do we start ramping up programs,\nand we start looking at chemical manufacturing and different things that we typically haven't had\ntied to a forced industry so that we have the work force to see this out all the way\nto the end.\nSo really excited about this.\nThere's no other states that are doing anything like this that I've seen I'm aware of.\nAnd we're really just blessed to have somebody like a Georgia Tech in this state that have\nthose knowledge skills and abilities.\nLot fire outlook.\nThe governor mentioned during his presentation over 4,000 wildfires last year, over 26,000\nacres.\n6,000 acres sounds like a lot, but when we think about how the amount of\nforced at acres we have in this state, that is less than a tenth of a\npercent of our forced at acres that actually burned. So once again, just want to\nthink our team for the work that they've done, outstanding job. One thing that's\nactually happening today, it was happening this afternoon, our Oki-Fenoki\nswamp down in that southeast corner is historically low. And so there's a meeting\nhappening right now with really our team leads ICs, my deputies down there, and just\nhaving a conversation and getting ready for it now.\nWe'd rather prepare and it starts raining and hopefully nothing is needed, but it's\nlooking like it could be a really active spring in the swamp.\nSo it's leadership from Florida, Georgia, the swamp, some federal teams, and really a message\nbeing delivered from the Georgia Forestry Commission is the private forest industry and private\nforced landowners have had enough over the last several years between\nHelene, loss of mills and everything else and so we're going to have good\nsafe but aggressive firefighting tactics and we're not looking for massive\nburnouts and things in the past that may have been past practices. We're gonna\nwe're gonna be really aggressive so well I'm eager to talk to my\ndependency how that message goes over. I mentioned it's been busy so this was\nlast week. It's kind of like a tell of two weeks, right? These are some fires we've had\nat night just very aggressive heavy fuel loading in the impact area for a while. Montgomery\nCounty, Tattoo County, that area was really hot. We've had a limit authorizations and try\nto get ahead, especially since we've had most of our crews in the north end of the state\nworking. The rainfall helped, but we did not have enough rainfall to where this threat\nhas gone. So this is something we really expect to pick back up in the upcoming weeks, especially\nwith the amount of wind that we've had.\nAnd then Commissioner Harper mentioned the partnership\nthat we had for Winnerstorm Furn.\nAnd I just, I love this picture because you have DNR, GFC,\nand Department of Ag, some law enforcement officers,\nall in one.\nThis is about five chainsaw crews with law enforcement\nsupport while they're working.\nAnd so this was pre-stormed or smiling.\nSo they hadn't been running the chainsaw\nin single-digit weather yet.\nBut to me, this is how state government should function.\nFor us to work together, not duplicate efforts\nand really do good for the citizens.\nLatest update is we've cleared 25 counties by we.\nI mean, all of these agencies.\n25 counties assessed over 2,500 miles of road.\nClear 207 miles of road with full of debris.\nWe're currently in three counties,\nand the hardest three hit counties.\nHabersham, White, and Raven.\nAnd out of lunch, we still would Raven dumped about,\nor not sorry, not Raven,\nHabershan gave us about 60 requests of county roads\nthat need to be cleared.\nSo probably another day, day and a half worth of clearing,\nand then we will wrap that one up\nand get everybody home and rest in.\nWith that, I'd like to say thank you\nand also mention our tagline there at the bottom\nthe Fighting Fire, Protecting Force, serving Georgia.\nAnd that's something as we started to gal\nand talk to people and help tell our story, what do we do?\nI will say somebody mentioned that we should change\nour name, and that's absolutely not.\nThat's not happening, but our communications group came up\nwith about six or seven different taglines,\nand we sent out to all of our employees,\nand overwhelmingly, this was their favorite.\nThey thought this represented them and who they are\nand what they do, and so just couldn't be more proud of them,\nand I think that is a very accurate description\nof the Georgia Forestry Commission.\nSo, happy to take any questions.\nWell, thank you, Director, and thank you\nfor the great work that your team has done\nacross our state and working to assist Georgians\nin time of need.\nWe know that this isn't the first time Georgia Forestry\nhas responded to an incident we know it won't be the last,\nbut do appreciate the great work that they do,\nday in and day out protecting citizens of our state.\nand look forward to the additional conversation\nas we move forward with the transfer of funds\nover to move research to the next level to assist\nan industry that has, as you mentioned,\nit's had enough.\nYes, sir.\nThat from mill closures to the impacts of jobs\nin nearly 3,500 direct and indirect jobs\nthat have been impacted by the closure of mills,\nthe impact on landowners.\nAnd not just those, but also the contractors that work\nwith those meals.\nI mean, it's a ripple effect across all our communities,\nacross Georgia from Savannah, International Paper,\nto Cedar Springs on the West Side of State.\nSo it's very important we continue to work with you\nand your team and the industry to move the industry forward\nduring this difficult time.\nAs you've said many times over,\nwe need that next-herty moment.\nYes, sir.\nAnd it's common, so we look forward to working with you\non that and just for our gratification of members of the committee we do have the governor's\ntask force report that was also on the desk of the members this morning that was task\nforce that was convened after the announcement of the closure of international paper and\nother meals to give us a deeper dive so thank you for the great work that you've done.\nWe know it has not been an easy couple of months but thank you for the work that you continue\nto do as we move the state forward.\nYes sir.\nThank you Mr. Chairman.\nMr. Duval, Georgia War Congress Center.\nWell, good afternoon Chairman Meeks. Thank you and the committee for your time today. Thank you Bailey for getting us all set up here\nWe'll be working from the tracking sheet page 10 on the tracking sheet for the World Congress Center 50 dot 1 dot 41 and also understand\nThere may be something under economic development that we want to cover, but thanks so much again for allowing us to be here today\nwant to start off by\nhopefully\nOkay, you always have to carry it back up, so hold on there and stand by.\nBailey, is it okay if I, I mean, take this out.\nOkay, let's try that again, Chairman, excuse me about that.\nRecently just released our FY, last fall FY25 economic impact.\nClearly, the events we host on our campus,\nit's well known that they generate economic impacts,\nsport jobs, and help at least this fiscal year,\n$1.9 billion in economic impact.\nOne of the things we've been working on\nthat I think is important to illustrate a little bit further\nand maybe take a closer look at as a heat map\nbefore we spend some of our dollars\nin GWCCA managed facilities across the state of Georgia.\nAnd so we've worked with collecting some of our partners\nthat we work with and where we spend our money\nacross the state of Georgia.\nSo what you see before you is just kind of a version one.\nWe're continuing to work on several versions of this\nof where we have economic impact.\nAnd important for me, and important for everybody\nin the state of Georgia, and I was 101 out of 159 counties\nwe have impact and there's been money in.\nWhether that's buying goods or personnel\nor people living there in those counties.\nAnd so that equates to about $290 million.\nCertainly always pleased and want to say thank you.\nIt's to the governor and the legislature\nfor the support that we receive on all the capital requests\nthat we have in the past.\nReflective on the screen before you is obviously\nthe transportation terminal and pedestrian mall,\nbut also the end result of the signal by Hilton Atlanta.\nWe just finished our second year of operation,\nbelieve it or not, I can believe.\nRemember talking about it, going to be open,\nwe've finished our second year of operation\nhas done really well, but we had an investment\nof the World Congress and over half a billion dollars\nfor that facility.\nOther projects we completed that were putting in action today,\nis inclusive of the BC exhibit hall.\nAnd so, certainly excited about that.\nIPP is in the house right now,\ninternational production and processing expo\nor poultry is some of us used to call it,\nbut they've relabeled and also have the meat industry with them.\nBut they're 600,000 square feet going strong right now,\nopen this morning and 30,000 folks are in town for that show.\nClearly the orange deck helps us take care of all the folks\nwe have there, so we're appreciative of that funding too.\nfunding and progress right now. Any time you have to replace over a million square feet\nof roofing, it does take some time. I'm happy to report that we're about 70 percent of\nthe way there, and on our final building of roof replacement, Esquiter Modernization,\nwe're replacing 35 Esquaters within the facility, and that takes time too. And please\nreport we're 66 percent complete, and continue on that journey, and you can see the estimated\ntime we believe will be done there. I think I reported back to you some of the money\nwe received for HVAC that were replacing some of our rooftop units on top of the\ncongress center. Sometimes those require helicopter to put on top of the congress\ncenter. So that's what you see in the photo there. You kind of wrap it up and\nput it all together here and really look at it. The congress center were big\nbelievers in reinvesting in the facilities too. We know we can't reinvest\neverything we have but anything that we make extra we try to reinvest in and\nthat's what this slide shows you that since 2002 we've reinvested\n174 million dollars within the Congress Center to try to help match some of the funding that we receive from the state\nWell the big question I think is FIFA FIFA World Cup is coming and I took note of your your comments earlier\nAnd so just as a reminder I think the sports council or Metro Chambers that represented in the room\nSo we are part of the host committee along with the ACVB the Metro Chamber of Sports Council\nMercedes-Benz stay in the city of Atlanta all of us are part of the host committee that put on these great events\nobviously the state of Georgia is very involved with these events too and we're\nsuper excited about having that this year. I think you know eight matches and\nthat's what's going to happen inside the bins but also we are going to host a\nfan festival in Centennial Epic Park and so the fan festival I mean the atmosphere\naround FIFA I think John said it was about 37 days but we are going to extend\nthat on our campus in several locations so first is Centennial Epic Park right\nnow we're designated for 21 days of being open around matches now some of them\nwill be our match days that we're open the day before or day after and then some of the\nkey matches that you'll see. So in Centennial Olympic Park you'll have music, food and\nyou'll also be able to watch matches that are going to happen in and around the tournament\nas it's here. Additionally, I think what's kind of unique is 30 years to the almost\nof date after we hosted the world gathering for the Olympic Games will host FIFA World Cup\nin Centennial Olympic Park again. So it's pretty neat, big piece there, opened all Georgians,\nSo it's free event, so we're excited about that.\nWe're also excited for our visitors that will be becoming.\nSo if anybody wants to cross the state to come,\nwe'd be happy to host them during the FIFA fan fest\nin Centennial Epic Park.\nI think also what was mentioned is we've conceptualized\nand we're beginning to activate against to lay out,\nyou know, the World Congress Center's big stage\nat the end of the day and we have a lot of space available.\nAnd so really working with the Department\neconomic development, Department of Agriculture, DNR, et cetera, we're trying to get a coalition\naround that we can basically focus and show off Georgia inside the Congress Center during\nFIFA World Cup.\nAnd again, I think that's important for us to do not only on Match Day, but then the\nother days that surround the experience here.\nBecause obviously we want to drive and show everybody that we're the number one state to\ndo business at the end of the day.\nI mentioned to you the big hitter in the middle there, the IPP show, certainly excited\nabout them. Sports may be the headline on top, but we have a lot of a lot of\nbook, a lot of business on the books for now and into the future. And those are\nsome of the significant trade shows that we host and some of the other\nsporting events that we host at the World Congress Center. We have exactly\none request that the the governor was we appreciate putting in the\namended fiscal year budget. And that is electrical system replacement. Now\nelectrical system is one of those things you know when you're not when it's\nnot working, but it may not be the thing you see out front, but if the lights aren't\nworking or you have trouble with the 600,000 square feet of exhibit space, exhibits we\nhave right now and electrical, then it's not working, but really for us, it's about\nimproved reliability, safety, efficiency, and infrastructure.\nAnd at the end of the day, your support of our request for $12 million in the amended\nfiscal year budget is really going to help support and improve, would authorize the\ncommencement of the project for us at the end of the day.\nIt encompassed developing a comprehensive design\nand really pushed us off on the procurement of equipment\nfor a phase one approach.\nYou know, we were born in multiple phases,\nfive to be exact.\nSo we won't be able to tackle it all with $12 million\nbut this will certainly get us started\nand give us a roadmap to get there.\nJust some of that fun stuff that you don't see\nbehind the walls of equipment, it's aging out.\nWe'll also look at transformers, lighting controls,\nbus duct that support our activities on the exhibit hall where we wire up all\nthose great shows that come to the George in the city of Atlanta and also look\nat our emergency power. So last but not least thank you we appreciate it. I think\nwith the Metro Chamber in the room just a press that we've also I think under on\npage six of Department of Economic Development's information there's funding\none time funding non-recurring funding set aside for super well. I think that's\nIt's pretty consistent with what you've done for other large events we have, FIFA World Cup most notable thus far.\nObviously that would be important funds that the host committee and the World Congress Center as a state entity would keep,\nwould shepherd through the process if that indeed is something that's going to continue to be funded.\nIt helps cover public safety, infrastructure, and the like, and I'll, you know, check with my colleague from the Chamber of Nick and see if there's anything else we want to talk about that.\nthat but that's definitely in the budget process so I'll stop right there and\nhelp answer any questions and last but not least Mr. Chairman I forgot to\nrecognize the most important people and that's Lindsey Strickland our vice\npresident of government affairs Janet Finelinson our chief financial officer\nand actually I have two of my colleagues from Savannah here Kelvin Moore is our\nsenior vice president and general manager and helps us manage the Savannah\nComanche Center and then Al Ruhas is our vice president and assistant general\nI'm going to help Belle you ask that she did that, I won't have to do that for you.\nOn the 10 million, can you talk about a little bit more of what that, would that be more\nsecurity calls or would it be split?\nYeah, I think it's important to remember, we're already in the planning cycle.\nSo we're moving down the planning cycle right now, obviously it's super bold this year.\nOur hyper focus is on FIFA and execution against that, but you know two years out is really\nthe planning cycle.\npeople out to see the Super Bowl. You look at the new nuances of it. You're\nplanning against public safety needs, infrastructure needs, etc. What we're\ngoing to do, we're going to do something in St. Helibock Park, etc. And so I\nthink this gives kind of certainty to that approach as we move forward and the\ngood news is just a one-time request. Great. Thank you so much. Thank you for\nbeing here today and thank you for all that you're doing to promote Georgia.\nThank you appreciate it. Thank you and Mr. Kevin Moore\nGood afternoon Mr. Chairman, thank you for being here today, thank you for having me,\nand then there was one.\nMy name is Kelvin Moore, I'm the Senior Vice President for the Georgia World Congress\nand Authority and General Manager for the Savannah Community Center, and it's Kevin\nto introduce my colleague with me, Mr. Albra Haas, our Vice President and Assistant\nGeneral Manager, let's see here, there we go.\nSo today I'm going to have the privilege of giving you a lot of good news that's happening\ndown in Savannah and review one of the items we have in the governor's amended budget.\nSo first, 2025 is the 25th anniversary of the Savannah Convention Center.\nIt's been a very consequential and impactful year for the Convention Center.\nFirst, we were able to complete the expansion of the Savannah Convention Center at $276 million\nproject, which we are very thankful for the governor and the entire legislature for\nyour support on that.\nThat project allowed us to double the capacity of the Convention Center from 330,000 square\nfeet to 660,000 square feet.\nWhat that does is allow us to raise and rank as far as square footage and it improves\nself-competitive positioning with cities like Nashville and Tampa and Austin and Richmond.\nIt allows us to really step up and wait class and generate more economic impact for the\ncity and for the state.\nWe have been rocking the Rollins since the day we opened the doors there.\nWe started off with a 1970s showdown, Valley of All Tournament with 14,000 young girls\nand their families, and we have not stopped since then.\nThe other big news coming out of Savannah is the development of a new headquarters hotel.\nIt is a signature by Hilton Property, 444 rooms by the 33-month construction time that\nis planned for opening in summer of 2028.\nWhat those two projects do for the Savannah Communications Center for the Destination, it\nreally completes the overall package.\nAgain, it improves our competitive positioning with all of our compset, and most importantly,\nthat allows us to generate more economic impact\nand more impact for those in the region there.\nSo how's it going?\nThe chart on the screen now will show you\nall of the event activity have on the books\nthrough fiscal 31.\nAnd what this shows is that we have 320 events\non the books through fiscal 31.\nAnd 215 of those events are utilizing expansion space.\nWhat does that mean?\nThat means for not the expanded convention center,\nwe might not have been able to get the majority\nof those 2015 events.\nSo the expansion is paying off the state investment\nand that expansion is paying off.\nAnd as you can see, the outer years,\nyou have fewer events, the events book many years in advance.\nSo we expect the impact to be significant.\nI'm gonna report on you right now for FY25,\nbut our FY26 is even better.\nSo we're very, we're feeling very, very good\nabout where we are from, from a book in case.\nBy the numbers for fiscal 25, we had 162 events,\n400 event days, over 200,000 attendees,\nthe statistics that most proud about is a 96.1 customer\nsatisfaction rating because you can have the best\nbreaking mortars and all of that in a property,\nbut if your people aren't treated well\nand if they're not treating our guests well,\nthey won't come back.\nSo we're very proud of that.\nBut impactful, the Cometan Center supports roughly 28,000 jobs\nin the Savannah region that are related\nto the event and hospitality.\nAnd FY25, the economic impact from Cometan Center events\nwas $13 million for the county\nand just under $121 million for the state of Georgia.\nWe are here to seek the committee's approval\nFor one item we have in the governor's admitted budget.\nA couple of things I just want to make sure that I stress is the Savannah Community Center\nis a state-owned facility.\nIt is on state-owned land.\nIt is governed by a state-enabled authority and managed by a state-enabled authority.\nSo this is a state project managed for benefit of the state.\nSavannah Community Center Authority is self-sustaining, has never come to the state for any\noperating support the $276 million for the expansion with a pretty big\nnickel plus a thank you again for that. But we're pretty proud of how we've\nmanaged to do things down in Savannah. The next slide we'll show you what we've\ndone as far as capital self-funding over the 25 years of the Convention\nCenter and into this current fiscal year is about $41 million in capital\nprojects that have been funded by the Savannah Georgia Convention Center\nwith its own funding mechanisms. You will see that the most recent years that\nthe number has increased.\nWhy?\nBecause the existing part of the building is 25 years old.\nAnd as you've seen with our friends at the\nGeorgia Royal Congress Center Authority,\nwhen those stairs and escalators and HVAC units\n25 years old, those expenses begin to increase.\nThe project that we have before you today is in,\nI believe it's in the tracking sheet on page 10,\n50.1.32, and there's a $5 million request\nand the governor's, I mean, the budget for river walk repairs.\nThis project broadly speaking, it enables\nto serve, to connect the entire campus,\nto make the center, including the hotel\nthat's under construction.\nIt improves the walkability and the connectivity,\ncompletes the campus.\nAnd again, it's all part of that,\nimproving our competitive positioning.\nIt is a two-phase project, the first phase,\nwhich we are just about complete list is the reinforced\nand the bulkhead structural integrity,\nall of the work underground there.\nAnd phase two, which we hope to initiate soon\nis to complete the utility infrastructure underground\nand then come above ground to begin the beautification\npavers in lighting and landscaping through that nature.\nThis slide that's up now kind of shows you the area\nin red, where the work has been going on in the area that we helped to complete.\nThe next photo kind of shows you before when it began that work, which we are well under\nway, and the next photo kind of gives you a sense of where we were just two days ago.\nSo the teams there have been working very, very hard to get that done, but Riverwall completion,\nagain, it's very important to be overall packaged to the Savannah Community Center and to\nthe competitiveness of the destination overall.\nAnd again, we are seeking your support\nfor the $5 million projects in the government's\nimmediate budget for this project.\nHappy to answer any questions.\nThank you for that update.\nJust an economic question, I guess,\nwhen you were talking about the number of events\nthat have been booked, 25 and 26, and then 27\nthat falls off pretty significantly.\nOf course, there was a nice jump in 26\nand falls off of in 27.\nDo you anticipate more being booked for 27?\nI don't know, not big in the business.\nHow far out in advance for some of these books?\nYeah, so the way that the sales process works in Savannah\nand not dissimilar to the Atlanta, a smaller scale,\nwe partner with business of Atlanta,\nour destination marketing organization.\nThey handle all of the event sales 18 months\nout our sales team handles the event sale 18 months and it is not\nuntypical for you to see the out years where the numbers are smaller as you\nget into those years and closer to those years they rise up. I would suggest to\nyou that coming in FY26 we had roughly 60% of where we ended up on the books. A\nlot of that is our team going out in the year for the year hunting and killing\nthe events that we...\nOkay well thank you for the great work you are doing and thank you for being\nhere today. Thank you very much. All right ladies and gentlemen with that no\nquestion from members of the committee. We will stand adjourned. Thank you for\nyour attendance today.\n",
  "updated_at": "2026-02-12T01:25:40.855188+00:00"
}