{
  "video_id": "gGequbr9vg4",
  "url": "https://www.youtube.com/watch?v=gGequbr9vg4",
  "title": "AI, Kids, and the Future of Tech in Georgia | Lawmakers 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript on AI, Kids, and the Future of Tech in Georgia:\n\n## Overview\nThe discussion focuses on the rapid technological innovations happening in Georgia and the need to create laws that protect children, especially in relation to AI chatbots and addictive digital products targeting young users.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Todd Jones, chair of the House Committee on Technology and Infrastructure Innovation, discussed Georgia's efforts to be a leader in innovative technologies like air taxis, autonomous vehicles, and creative manufacturing.\n- Senator Sally Harrell, who co-chaired a Senate study committee on social media AI and children, shared concerning stories about 4th grade students accessing AI chatbots with inappropriate content on their school network.\n- Both legislators emphasized the need for guardrails and regulations to address the issues of AI chatbot companions and addictive digital product design targeting children.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "Technological innovations speed up faster than many of us can keep up. Our state is helping\nto keep things moving. According to the Georgia Department of Economic Development, Georgia\nis proudly at the forefront of digital health, cyber security, thin tech, and creative\ntechnology. Now, that's great for Georgians in the workforce, but as technology grows,\nThere's a need to create laws that protect Jordan's and joining me are Republican Representative\nTodd Jones of South Versailles.\nHe chairs the House Committee on Technology and Infrastructure Innovation and Democratic\nSenator Sally Harrell of Atlanta.\nHer committees include government oversight.\nShe also co-chaired a Senate study committee on social media AI and children over the past\nfew months.\nWelcome to lawmakers to both of you.\nI'm glad to have you here.\nI'm going to start with you, Chairman Jones.\nGive us a general picture of the types of innovation\nthat your committee will look at technology,\nthis coming session.\nLook, Donna, for over a decade,\nwe've been the number one place to do business.\nWe're now shifting to becoming the most innovative place\nto do business in the entire country.\nWe're going to take leadership in places like mobility\nin terms of air taxis, in terms of autonomous vehicles.\nWe're going to take those folks that have been,\nin a sense, stuck in their home because of disability,\nbecause of old age, and we're going to help them get out,\nvisa VAV, we're going to bring traffic off into the air, we're going to go ahead and use\na creative manufacturing, a lot of people call that 3D printing, to absolutely expand\neverything that we can print or in a sense of manufacturer here in Georgia and for outside\nof our state.\nIn other words, we're going to take literally what AI can do, what human beings can do,\nrobotics can do, and transform education, healthcare, transportation, just about everything\nthat a Georgian touches is going to be transformed in the next five to ten years.\nand you'll need to put guardrails on that.\nWe are gonna have to put guardrails on it,\nbut I'll tell you this, on the innovation side,\nwe wanna make sure that this is very similar\nto the third industrial revolution,\nwe're in the fifth industrial revolution,\nwhen Carnegie and Rockefeller and Edison,\nwhen they were making those changes\nand they were giving those great innovations in steam\nand electricity, there wasn't a lot of guardrails\non them on the innovation side.\nWe wanna do the same thing.\nWe wanna give our innovators a chance\nto innovate and really change the game\neconomically, healthcare and education.\nNow, I know you have done a lot with urban transportation.\nWe'll get to that in a moment.\nSenator Harrell, I want to actually start with you\nwith the committee we talked about,\nand play a clip of a DeCab County mother\nwho talked at one of the final ones.\nShe testified before your committee on October 10th.\nHer name is Kay Fullerton,\nand she described how her fourth grader and his friends\nfound an AI chat box, but with a Hunger Games theme.\nAnd they started to have a conversation with it because they're kids and curious and that quickly descended into sexualized content on the school network in fourth grade.\nAnd this wasn't blocked because of the nature of the website services like chat GPT have these developer tools that allow developers to access these large language models for fractions of a penny with no oversight on where that content goes after it's produced by the model.\nmodel.\nYeah.\nAnd Senator Harold, one of her concerns is, parents can't preview what these bots are doing.\nSo there's no way of monitoring any of that.\nSo talk a little bit about that.\nThat's right.\nThis parent came to me during session last year and told me this story.\nAnd I immediately tried to find a bill to amend because it was late in the session so that\nwe could fix this issue.\nUnfortunately, the bill didn't pass.\nAnd so that's when I really pushed to have this study committee.\nThis issue is personal for me, my kids were like in middle school when everybody started\ngetting smart phones.\nAnd I could see that these programs on these phones were fundamentally changing my children.\nAnd I tried to sound the alarm and no one would hear me.\nAnd so I've waited eight, ten years to be able to do something about it.\nNow we have enough millennials who have had kids who were scared about the phone and what\nit can do to their children that we have enough collective voices that we can do something\nabout it.\nI want to clarify something, they watched at school, and there are, there's a way they\nblock things, but they were able to get through.\nRight, because this is new, these AI companion chatbots are new, and so the companies that\nhelp the school's monitor what kids can access, they were on top of it, and so this just\nslip through. Now, Ms. Fullerton did say that the school responded really, really well\nand took care of the problem. But this technology, it changes so quickly that schools can't keep up,\nparents can't keep up. So in the end, we made our committee made several recommendations that we\nare turning into legislation now. Okay, we're going to talk about those in a minute. I want to\nget back to you. Going back and forth, you certainly agree with all of that. And I've heard that\nThere are members of your party who certainly agree that there needs to be some kind, something happening\nwhen it comes to these chat box and things like that.\n100%.\nLook, we're seeing basically data telling us that upwards of 75% of 15 year-olders in our state consider their AI chatbot their best friend.\nThey're best friend.\nWe have to find a way to get that socialization to be fundamentally different.\nWe got to put the guardrails on, but frankly we need to help of 11 million Georgians.\nlook, legislation can create that guardrail, but we need the parents, we need the grandparents,\nthe uncles, the aunts, and everyone else to understand this is changing and it's changing\nmonthly.\nIt's changing daily, so all of us need to be super diligent in terms of what we're doing\nand what we're doing with our children.\nAnd I know that's hard.\nI got four children, and I know how hard that is to do, but between the guardrails that\nwe can put on with my colleague in the Senate and what we can also do to work with 11 million\nGeorgians, I think we can make a difference.\nTalk a little bit about what you're expecting to do\nwith some legislation.\nRight, so what we've realized is that these big tech companies\nhave discovered through the years that the more engaged\nthey keep the users, the longer they keep them\non the phone or the iPad, the more money they make,\nselling information to advertisers.\nSo they're making money off of our kids' attention\nAnd they're doing that now by designing the platforms\nand the products to be addictive,\ndesigning things in where if you do something,\nthey give you something back, they give you a reward\nthat gives a little dose of dopamine\nthat makes you feel good.\nSo the first thing we want to do is regulate\nthe addictive design.\nWe don't want addictive products designed\nfor our children.\nThe second thing we want to do is address the chatbot,\nthe companion chatbot issue.\nThis is critical.\nThis is going to make the situation so much worse.\nChildren are using these chatbots\nand becoming friends with these chatbots.\nAnd the parents, they don't know yet\nthat their children are interacting with these chatbots.\nWe had parents who told horrible stories\nabout the chatbot actually telling the child\nto kill himself, to commit suicide.\nI listened to that, it was just terrifying.\nIt's awful.\nNo parent knows what this chatbot is going to say to their child.\nSo two, those parents out there, I would tell you,\nfind out if your children are using companion chatbots,\nif they are, please teach them about the dangers.\nWe want to hold these companies accountable.\nIf a parent bought a doll and the doll said,\nkill yourself, that company would be liable\nbecause they had a product, just like cars.\nCars have to study safety measures\nbefore they bring out a new model.\nWe want these companies to be responsible for the products\nthey put out in the harms that they cause\nin terms of AI chatbots.\nAnd then finally, we want to give parents more power.\nSo the parental controls, they're very difficult to use.\nAnd parents are frustrated.\nAnd the kids find their ways around them.\nSo we're supporting something called the App Store\nAccountability Act, which when a parent buys a phone\nfor a child, the phone is linked to the parent's phone.\nIf a child tries to download an app,\na notification is sent to the parent,\nand the parent can decide whether to approve the app\nor not, that's easier than parental controls.\nAnd then the very last thing we're doing,\nlast year we passed a law banning cell phones\nin schools K through eight.\nI believe we are gonna come back and add high schools.\nAnd I know that they're talking about that\nboth in the Senate and certainly in the House.\nThat's going to happen.\nSo that's good.\nI want to get back to you about something.\nWhile we still have time, I know that when it comes to the\nair taxis, something special is going to happen in 2026.\nAnd you've been working on this for a long time.\nFor a long time, knock wood.\nWe're going to get special permission to be able to land\nan air taxi right in the middle of the Georgia World\nCongress Center at the kickoff.\nAnd I don't mean that as a pun at the kickoff of the\nWorld Cup.\nAnd this is literally the world looking at us.\nmillions of people looking at Atlanta and being able to land an air taxi and simultaneously\nbringing up an autonomous vehicle and hopefully having the FIFA head, our governor, our speaker\nand our lieutenant governor going into a 3D printed mini house because we want to show that\naffordable housing can be done, it can be done in our state and we can do it through a\ncreative manufacturing.\nSo we're going to go ahead and put all together basically an entire portfolio of innovation\nfor the world to see that George is leading the way.\nSo they're going to start at this, at this bear, bear report, bear, bear up in the North\nBolton, right?\nThe governor and all of these officials are going to go to the Georgia World Congress\nCenter and then there's going to be this house there.\nThat is our hope and we're hoping to get the final approvals on that and any of you\nwho know anyone at the FAA would like to be able to get that from them.\nAnd for people who don't understand, these, these taxis are going to go along the interstate\nand they'll be able to go to Hart's Field\nand different things like that.\nYeah, look, imagine an idea\nwhere you're going to be able to go out to your ride share app\nand you're going to have a choice of,\ndo you want to go autonomous, do you want to go driver\nor do you want to go in the air?\nAnd you're going to be able to go in the air\nand literally go from, say, the northern arc to Fox Theater,\nthe northern arc into the airport.\nYou name it, you're going to now have a defined commute time\nas opposed to guessing what your commute time\nis going to be based on traffic.\nAnd autonomous, let me see if anybody will be.\nYeah, well, okay, so much to talk to you too about.\nThank you so much for coming on.\nWe'll keep up with these issues.\nThank you so much.\n",
  "updated_at": "2026-02-12T01:28:08.168444+00:00"
}