{
  "video_id": "gHENl0hFNZg",
  "url": "https://youtu.be/gHENl0hFNZg",
  "title": "Georgia House - Day 1 (2026-01-11)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": "2026-01-11",
  "duration_minutes": 206,
  "summary": "Here is a summary of the Georgia House session transcript in structured markdown format:\n\n## Overview\nThe Georgia House session on 2026-01-11 featured an opening prayer and pledge of allegiance, as well as remarks from the Speaker. No substantive legislative actions were detected in the transcript.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The session opened with a prayer and blessing from House Ethics Committee Chairman Rev. Randy Nicks.\n- Rev. Nicks delivered a reflection on the biblical \"Aaronic Benediction\" and its relevance for the legislature.\n- The Pledge of Allegiance was led after the prayer.\n- The Speaker recognized the return of \"Georgia's tenor\" Timothy Miller to perform for the opening of the session.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nThe transcript indicates that all members were present and the chamber doors were closed, suggesting a quorum was achieved.\n\n## Adjournment\nThe transcript does not include an explicit adjournment, but the lack of further business suggests the session concluded.",
  "transcript": "The hour for convening the 2021 session of the House of Representatives having arrived. All members who please take your seats. All members please take your seats. All guests please exit the chamber floor. Madam Clerk, will you ring the bell? All members please take your seats. All members please close the doors and keep them closed. The first order of business this morning as we will have scripture reading and prayer by the chaplain, after which time we will have the Pregional Eagents to the flag. Our chaplain this morning will be introduced by the gentleman from the 7th District, Speaker Austin. Well good morning. Thank you, Mr. Clerk. The great honor of this morning of introducing our chaplain of the day is not his first time. Many of you may be the first time to hear him, but he is a truly special individual. A dear, dear friend to me and to many in this body. Chairman Randy Nicks is the chair of our House Ethics Committee. He is a Methodist pastor and he is just a wonderful speaker. I know you are going to be blessed by his message this morning. He will then lead us in prayer in the pledge and I am going to ask you to remain in attention after that because we have another special treat for you after that. But it is my honor now to introduce to you the chairman of the Ethics Committee, Chairman Randy Nicks, our chaplain of the day. Thank you, Mr. Speaker. Good morning. Let's say good morning to a lot of my old friends and a lot of my new friends I am going to get to know here real soon. Mr. Speaker, I want to do something a little bit unusual. I want to begin today with an ending. The Lord bless you and keep you. The Lord calls his face to shine upon you and be gracious to you. The Lord lift up his countenance upon you and give you peace. Now I don't want any of you to leave yet, but I know some of you Methodists when you hear that you know that it's time to run out the door and beat the Baptist to the cafe. But you know as I thought about what I would say to you this morning I thought about the fact that I think we all need a blessing. I've been contacted by several thousand people over the last six weeks and none of them gave me a blessing. None of them wished any blessings upon my house, but this morning I want to invoke this blessing from God on each member, the full blessing from God on everyone who can hear my voice. Now this is the same blessing for our minority leader James Beverly as it is for Speaker Austin. I'm praying this same blessing for our majority leader Burns as I am for our minority caucus chair, Mitchell, Billy Mitchell. And also this is the same blessing for Dean Smirie who I just verified is starting his 47th year in this body as it is for approximately... It's the same blessing for him as it is for approximately 26 new members that will be sworn in later. And Dean Smirie I think you're okay with me wishing that same blessing on them that I wish on you. You know there's no rationing or limiting of God's ability to bless. The amount of your blessing does not reduce or limit God's ability to bless others. God's blessings never run out. I want to do just a brief analysis on this scripture and give you a couple of points on it. I read that this is the oldest copy of biblical text that has been found. It is considered to be 400 years older than the Dead Sea Scrolls. The words were originally given by God to Moses and then through Moses, God commanded the priest to bless the people with this blessing. Now if you read the book of numbers where this comes from, this blessing comes at the end of several chapters of scripture that are focused on the organization of Israelite people as they're forming themselves into a nation. It is a very foundational moment for them as they move from a people who have been in slavery to a free people and an independent nation. And also I think it's important to know this was a blessing for a journey. They were getting ready to go to the promised land. So this blessing was for a journey that would end for them in the promised land. Now this morning I hope that we will take this as a blessing for our journey that hopefully sometime in 2021 will end with a signy die. I want to go through the words and phrases individually. The Lord bless you. Here blessing implies the provision of all things that make human life possible and full. Posterity. Our children, our grandchildren, land, our possessions, health, but most importantly the presence of God. The Lord bless you and keep you. This is God guarding and protecting you from the enemy who would deprive you of your great blessings. The Lord make his face to shine upon you. God's face shining brightly with warmth and brightness and life giving energy. A shining face is a smiling face showing happiness and acceptance. God is not looking at us with the frown or with the scowl but looking at us with his smiling face showing acceptance and be gracious to you. This is God dealing with people not according to their sin but with love and compassion and delivery in time of trouble. The Lord lift up his countenance upon you. In other words, the Lord look at you and focus you. This is an active act of God to look at you and his direct acceptance and blessings on the specific people and a specific person in a gesture of reconciliation even though it's undeserved. God looking us in the face with acceptance and love. For the Israelites this was a preview of the coming Christ and a direct relationship that they would have with God through Him. And finally, and give you peace. Now this word peace here is the Hebrew word Shalom and that's not simply the absence of war conflict but rather God's gifts of health, well-being, justice, salvation and friendship with God and man. Blessings and peace. I think we could all use a little bit more of those today, couldn't we? I know that I could. And while this blessing was pronounced by God's priest on his people many years ago, they're still relevant for us today. And not just for today but if you look at lamentations 32, 22, 23 it says, the steadfast love of the Lord never ceases. His mercies never come to an end. They are new every morning. That is his faithfulness. God's blessing, God's love, God's peace every day. My prayer is that you, each of you, receive this blessing today all of it and my challenge is that you pass it on because I believe that people who experience God's love and God's peace will treat others with love and with peace. I believe in the old saying that you are blessed to be a blessing and that's my challenge to you this morning to pass this blessing on. Would you please stand with me? Father, we ask for you, you're blessing this morning. Lord we know that we're unworthy in so many ways but Lord we trust your word that you want to look at us. You want to smile at us. You want us to have the good things in life. And Lord I pray that blessing this morning on everyone that's here, every member of this body, every member of their family. Lord just help us to remember how much you have blessed us and commit to passing that blessing along to others for what's in Christ's name I pray. Amen. And once again, the Lord bless you and keep you. The Lord make His face to shine upon you and be gracious to you. The Lord lift up His countenance upon you and give you peace in the name of the Father and the Son and the Holy Spirit. Now if you would please join me as we pledge allegiance to our flag, our pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Please be seated at least momentarily. You know, the first day of a session, particularly the first day of a biennium is always a special time and we've tried to do that today under some extraordinary circumstances. And part of making it special is the return appearance of the fellow that I call Georgia's tenor. Georgia's tenor, Timothy Miller from Augusta, Georgia, who has sang with some of the greatest groups all over the world, including the Atlanta Symphony. He is sing at inaugurals. He's sing for us here a few years back. And then he made the real big time. He sings during the seventh inning stretch at the Brave's Home Games and does an amazing job. Please make welcome an individual that we're very, very proud to have as a Georgian, Timothy Miller. Oh, say can you see by the dawn's early light what so proudly we held at the twilight's last gleaming whose broad stripes and bright stars through the perilous fight or the ramparts we watched were so gallantly streaming. And the rockets red glare, the bombs bursting in air, gave proof through the night that the flag was still there. Oh, say does that star-spangled banner yet wave? With the land of the free and the home of the brave. Why the storm clouds gather far across the sea, let us swear allegiance to a land that's free. Let us all be grateful for a land so fair as we raise all voices in a solemn prayer. God bless America, land that I love, stand beside her, and God her, through the night with a light from above, from the mountains to the prairies, to the oceans, what with form. God bless America, my home, sweet home, God bless America, my home, sweet home, why. Thank you. The doorkeepers will please open the doors. Now communication from the Secretary of State will be read into the record certifying the representatives elect for the 2021-2022 term. The attached six pages constitute a true and correct list of the state representatives in the Georgia Assembly of Georgia. The 2020 general election held on November 3, 2020, all as the same appear of file and record in this office. District 1, Mike Cameron, District 2, Steve Tarvan, District 3, Duane Hill, District 4, Casey Carpenter, District 5, Matt Barton, District 6, Jason T. Ridley, District 7, David Ralston, District 8, Stan Gunner, District 9, Will Wade, District 10, Victor E. Anderson, District 11, Rick Jasper's, District 12, Eddie Lomston, District 13, Katie Dempsey, District 14, Mitchell Skoggins, District 15, Matthew Gamble, District 16, Troy Kelly, District 17, Martin Mopton, District 18, Tyler Paul Smith, District 19, Joseph Gullett, District 20, Charlize Berg, District 21, Brad Thomas, District 22, Wes Cantrell, District 23, Mandy L. Ballinger, District 24, Sherry Smallwood, Gilligan, District 25, Todd Jones, District 26, Lauren McDonald, the 3rd, District 27, Lee Hawkins, District 28, Chris Irwin, District 29, Matt Dubbick, District 30, Emery Dumbledd, who's just here. Emery Dumbledd, who's Jr. Junior, District 31, Tommy Benton, District 32, Alan Powell, District 33, Rob Leveritt, District 34, Bert Reeves, District 35, Ed Settzler, District 36, Jenny Ayerhart, District 37, Mary Frances Williams, District 38, David Wilkerson, District 39, Erica Thomas, District 40, Eric Eugene Allen, District 41, Michael Smith, District 42, Terry Onullowitz, District 43, Sharon Cooper, District 44, Don L. Parsons, District 45, Matt Dollar, District 46, John Carson, District 47, Jan Jones, District 48, Mary Robachow, District 49, Charles E. Chuck Martin, District 50, Angelique Takaush, District 51, Josh McLaren, District 52, Shay Roberts, District 53, Sheila Jones, District 54, Betsy Holland, District 55, Marie Metz, District 56, Misha Mayner, District 57, Stacey Evans, District 58, Park Cannon, District 59, David Dreyer, District 60, Kim Schofield, District 61, Roger Bruce, District 62, William K. Bodie, Jr., District 63, Debert Beesmore, District 64, Derek L. Jackson, District 65, Mandisha A. Thomas, District 66, Kimberly Alexander, District 67, Micah Graveli, District 68, Jay Collins, District 69, Randy Nicks, District 70, Lynn Smith, District 71, Philip Singleton, District 72, Josh Bonner, District 73, Karen Mathyack, District 74, Yasmer Neal, District 75, Mike Lanton, District 76, Sandra Givens, Scott, District 77, Rhonda Bernal, District 78, Dmitrius Douglas, District 79, Michael S. Walensky, District 80, Matthew Wilson, District 81, Scott Holcomb, District 82, Mary Margaret Oliver, District 83, Becky Evans, District 84, Renetta Shannon, District 85, Carla Drenner, District 86, Zomel Lopez, District 87, Violet Davis, District 88, Billy Mitchell, District 89, B. Hwynn, District 91, Rhonda S. Taylor, District 92, Doreen Carter, District 93, Darshan Kendrick, District 94, Karen Brant Bennett, District 95, Beth Moore, District 96, Pedro Pete Marin, District 97, Bonnie Rich, District 98, David Clark, District 99, Marvin Lim, District 100, Dewey L. McLean, District 101, Sam Park, District 102, Greg Kennerd, District 103, Timothy Bar, District 104, Chuck F. Strachan, District 105, Donna McLeod, District 106, Rebecca Mitchell, District 107, Shelley Hutchinson, District 108, Jasmine Clark, District 109, Regina Lewis Ward, District 110, Clint Crow, District 111, Elmati Holley, District 112, Dave Belton, District 113, Sharon Henderson, District 114, Tom Kirby, District 115, Bruce Williamson, District 116, Terry England, District 117, Houston Gaines, District 118, Spencer Fry, District 119, Marcus A. Wheedower, District 120, Trey Rhodes, District 121, Barry Fleming, District 122, Jody Locke, District 123, Mark Newton, District 124, Henry Wayne Howard, District 125, Sheila Clark Nelson, District 126, Glory Frazier, District 127, Brian L. Prince, District 128, Mac Jackson, District 129, Susan Holmes, District 130, David Knight, District 131, Beth Camp, District 132, David Jenkins, District 133, Vance Smith, Jr. District 134, Richard Smith, District 135, Calvin Smirie, District 136, Carolyn Hudley, District 137, Debbie G. Buckner, District 138, Mike Chocus, District 139, Paddy Bentley, District 140, Robert Dickie, District 141, Dale Washburn, District 142, Maryam Parris, District 143, James Beverly, District 144, Danny Mathis, District 145, Ricky Rick Williams, District 146, Shaw Blackman, District 147, Heath Clark, District 148, Noel Williams, Jr., District 149, Robert Pruitt, District 150, Matt Hatchett, District 151, Gerald Green, District 152, Bill Yurda, District 153, Camio Whitaker-Hopson, District 154, Winford Dukes, District 155, Clay Perkel, District 156, Greg Morris, District 157, William Bill Workhizer, District 158, Harris, District 159, John G Burns, District 160, Jan Tancersley, District 161, Bill Hitchens, District 162, Carl Wayne Gillard, District 163, Derek J. Mallow, District 164, Ron Stevens, District 165, Mickey Stevens, District 166, Jessie Petrie, District 167, Buddy Deloche, District 168, Al Williams, District 169, Dominic Larickia, District 170, Penny Hauston, District 171, Joe Campbell, District 172, Sam Watson, District 173, Darleen Taylor, District 174, John L. Corbett, District 175, John LeHood, District 176, James Perchette, District 177, Dexter L. Sharper, District 178, Stephen Meeks, District 179, Don Hogan, District 180, Stephen Saints, This communication from the Office of Secretary of State was certified by Brad Rathus, Berger, Secretary of State of the State of Georgia, I now tender it into the record.\n\nAt this time, roll call will be called. Roll call will be called. The clerk will ring the bell. All members present will please vote yes or green on your voting machine to signify your presence in this chamber. Have all members voted? Have all members voted? If so, the clerk will lock the machine. The next order of business will be the administering of the oath of office to the representative's elect. The speaker asked me to pass along the following information to you. Part of our COVID protocols for session is the twice weekly testing of members. Instructions for provider for you and how you need to test here at the capital. Those tests are typically administered on Mondays and Thursdays. If you have not done so, you need to submit a saliva test in room 230 of the capital this morning. Please listen carefully to the process for how you will be sworn in today and where your groups need to meet. Districts 1 through 45 will gather in the hallway outside of the house chamber upon the conclusion of being sworn in. I'm going to ask that you sign the oath that was on the desk and that you give that to a member of the clerk's office as you exit through the south antivroom and ask you to proceed to room 230 if you have not already tested this morning. Districts 46 through 90 will gather in the area outside the speaker's office upon conclusion of being sworn in. Sign the oath. Give that to a member of the clerk's office and as you exit through the south antivroom and ask you to proceed to room 230 if you have not already tested. Districts 91 through 135, please proceed to room 341. I'm cap, unless you have not tested this morning. In which case please go to room 230 and upon conclusion of testing, please report back to 341 unless directed differently. Districts 135 through 180, please proceed either 132, 133 or 403 of the capital, you will be directed to the test at the appropriate time if you have not tested yet. So at this time we're going to ask you to leave the chamber and folks in districts 1 through 45, please gather in the hallway outside the house chamber. When you sign your oath, just leave it at the desk instead of just passing it out to the clerk or passing it to somebody in the clerk's office, just leave your oaths on the desk. All right, at this time we're asking everyone to leave the chamber so we can get organized and get the first group of members sworn in. So asking that everyone leave the chamber. All right. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. We're going to ask that you stand in an area where there's no seat instead of stopping at a seat. All right. You should find an oath of office. The oath will be administered while you're at those desks. After the oath is administered, we're going to ask that you sign the oath and please don't forget to put your district number at the top. The oath will be administered while you're at those desks. Thank you. All right. If I can have your attention please. The oath of office will be administered today by Judge Brenda Weaver, Chief Judge of the Appalachian Judicial Circuit. Judge Weaver. Good morning. Please place your left hand on the Bible and raise your right hand. I, in state your name, do you hear by a solemnly swear or a firm that I will support the Constitution of this state and of the United States? And on all questions and measures which may come before me, I will so conduct myself as will in my judgment be most conducive to the interest and prosperity of this state. I, further swear or a firm that I'm not the holder of any on account county for public money do this state or any political subdivision or authority thereof that I'm not the holder of any office of trust under the government of the United States, any other state or any foreign state that I have been a resident of my district for the time required by the Constitution and the laws of this state and that I'm otherwise qualified to do this state. I, otherwise, qualify to hold set office according to the Constitution and laws of Georgia. So help me God and if you so swear or a firm, please state I do. I, further swear and a firm that I'm a citizen of the state of Georgia and a member of the general assembly and the recipient of public funds for services rendered as such officer and I do hear by solemnly swear and a firm that I will support the Constitution of the United States and the Constitution of Georgia. So help me God and again if you so swear or a firm, please state I do. Congratulations. Thank you. Thank you. Thank you. All right. At this time we're going to ask that everyone now depart the house floor and that the next group of representatives and guests enter the house chamber. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Please line up in between the seats please.\n\nAll right, please find a spot. Please find a spot. The oath of office this morning will be administered by Judge Brenda Weber, Chief Judge of the Appalachian Judicial Circuit. Please raise your right hand and place your left hand on the Bible. I do solemnly swear or affirm that I will support the Constitution of this state and of the United States and on all questions and measures which may come before me, I will so conduct myself as will in my judgment be most conducive to the interests and prosperity of this state. I will further swear or affirm that I am not the holder of any unaccounted for public money do this state or any political subdivision or authority thereof, that I am not the holder of any office of trust under the government of the United States, any other state or any foreign state that I have been a resident of my district for the time required by the Constitution and laws of this state and that I am otherwise qualified to host that office according to the Constitution and laws of Georgia so help me God and if you so swear or affirm please state I do. I further swear and affirm that I am a citizen of the state of Georgia and a member of the General Assembly and the recipient of public funds for services rendered as such officer and I do hereby solemnly swear and affirm that I will support the Constitution of the United States and the Constitution of Georgia so help me God and if you again further swear or affirm please state I do. Thank you. Congratulations. Thank you. Please turn in your oath as you exit the chamber through the South Ani Room please and a friendly reminder if you haven't been to 230 for your COVID testing please do so. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. All right at this time we're going to ask everybody to depart the house floor so we can get the next group of representatives and guests in the house chamber. Thank you. Thank you. Thank you. Thank you. All right to the new group coming in we're going to ask that you stand in between the chairs. You will find an oath of office there we ask that you sign one oath of office and after Judge Weaver administers the oath we're going to ask that you hand your oath in to the committee representative from the clerk's office standing at South Ani Room. Thank you. Thank you. Thank you. We ask that you stand in a spot in between the chairs you'll find an oath there when you sign the oath after taking the oath we ask that you hand it into the clerk's representative standing at the South Ani Room. The oath of office this morning will be administered by Judge Brenda Weaver, Chief Judge of the Appalachian Judicial Circuit. Please place your left hand on the Bible and raise your right hand please. I in state your name. Do you hear by solemnly swear our firm that I will support the Constitution of this state and of the United States and on all questions and measures which may come before me I will so conduct myself as will in my judgment be most conducive to the interest and prosperity of this state. I further swear our firm that I'm not the holder of any unaccounted for public money do this state or any political subdivision or authority thereof that I'm not the holder of any office of trust under the government of the United States any other state or any foreign state that I have been a resident of my district for the time required by the Constitution and the laws of this state and that I'm otherwise qualified to hold set office according to the Constitution and laws of Georgia so help me God and if you so affirm or swear please state I do. In addition I do further swear our firm that I'm the citizen of the state of Georgia and a member of the general assembly and the recipient of public funds for services rendered as such officer and I do by hereby and I do hereby solemnly swear and of firm that I will support the Constitution of the United States and the Constitution of Georgia so help me God and if you so swear our firm please state I do. Congratulations. At this time we're going to ask everyone to depart the house floor so the next group can have representatives and their guests can enter the house chamber. Thank you.\n\nyou All right to the group that's filing in we're going to ask that you place yourself in between the seats you will find the oath of office there after Judge Weaver administers the oath this morning we're going to ask you to sign it and as you were leaving through the aneurom, south aneurom that you hand your copy of the oath to represent it from the clerk's office. Please find a spot in between the seats in between the seats please. All right the oath this morning will be administered by Judge Brenda Weaver Chief Judge of the Appalachian Judicial Circuit Judge Weaver. Please place your left hand on the bottle and raise your right hand. I in state your name do here by solemnly swear our firm that I will support the Constitution of this state and of the United States and on all questions and measures which may come before me I will so conduct myself as will in my judgment be most conducive to the interest and prosperity of this state. I further swear our firm that I'm not the holder of any unaccounted for public money do this state or any political subdivision or authority thereof that I'm not the holder of any office of trust under the government of the United States any other state or any foreign state that I have been a resident of my district for the time required by the Constitution and the laws of this state and that I'm otherwise qualified to whole set office according to the Constitution and laws of Georgia so help me God if you so swear our firm please state I do. In addition I do further swear our firm that I am a citizen of the state of Georgia and a member of the General Assembly and the recipient of public funds for services rendered as such officer and I do hereby solemnly swear and a firm that I will support the Constitution of the United States and the Constitution of Georgia so help me God and if you so swear our firm please state I do. Congratulations thank you. I should say they're not using one years on I'm going to start to go back to the Davis thing. Yeah well what we're going to do is now we're going to check against our voter make sure everybody's got one. I'm going to ask the members to please take their seats. Please take your seats. The next order of business is the election of the speaker the House for the 2021-2022 term. The House is now open for nominations for speaker. The chair recognizes a gentleman from the 11th representative Rick Jasper's. Thank you Mr. Clerk. I would like to know a gentleman from the 7th David Ralston speaker of the House. The chair recognizes a gentleman from the 128th representative Mack Jackson. Thank you. I'm right. Chair recognizes a majority leader for motion. Mr. Chair I move that the nominations be closed for speaker the House of the Georgia General Assembly. Is there any objection to closing of the nominations? Any objection? Any objection? Hearing none the nominations are closed. The chair recognizes the gentleman from the 11th representative Rick Jasper's to speak the denomination of speaker Ralston. Thank you. Thank you Mr. Clerk. Thank you Judge Weaver for making this official today. Judge Weaver has had a long and dedicated career in our court system in David Ralston in my area in the L.A.J. Blue Ridge and Jasper area. It is an honor for me to nominate the gentleman from Blue Ridge David Ralston as our speaker. I'm fortunate to know him in a little bit different way than most of you. He and I share county lines and even neighborhoods. I guess I've known him for 25 years as part of my community as a leader, a community leader, our state's representative and our state center. You know I was a county agricultural agent for a long time and a 4-H leader and of course we have 4-H awards of equates you know and you have to invite your legislator like many of you all have been invited to these things and you get to come and see the kids. The first time I met David Ralston as I of course had invited him to ours I didn't know him and you know we had that the Jasper United Methodist Church. It's a big deal for kids and all of us and these things and when David Ralston came into the room you know it's your funny how your memory is. I remember seeing the walk in there's a group of kids over to the side and what did he do you know there are adults everywhere voters you know the people that we're supposed to you know be talking to. No he went to the kids the real stars of the show that people that we're there to support and his attention was focused on them and that's not your normal politician probably a lesson for all of us but that's the guy he is David Ralston is thoughtful, caring, giving as he was then as he is today. In our community he has held a great respect and love he is a constant advocate for our region and I hope you new folks you'll get the opportunity at some point in this session to taste and eat an apple pie from a serious orchard we tend to have them here a lot they're for Blue Ridge. When you talk today with Ralston about his family watch his eyes his brothers are the David Ralston sign team I wish they were here today you'd see they're good size men they can do it they put up hundreds of signs all over our region you know he has the voted father his kids loving a dooring and so does Miss Sherry but you may not know it David Ralston loves Georgia football he can recall dates and who played when and this is just amazing and he's a reader thank you that's right Barry he's a reader of his\n\nand applies the lessons learned from studying our past to what we do here. We have all heard from our parents that you're judged by who you hang out with. And ever since I got here 10 years ago, I've seen only the best in the staff that he has selected. They reflect him, his values, his dedication to you and your success. For the past 11 years, David Rolson has put Georgia first. The speaker's hard, hard job is a hard one. You know, the job of balancing our needs or what we think or our needs, and those of the state. As our speaker, his thoughtful, clear thinking has pushed you and me and the house to lead. He has encouraged discussion and bipartisanship, what many others would not. He has braved and courageous on issues that cut across party lines that are important to Georgia. We rely on the speaker to be fair. In the times we're in, they are difficult. And we need the steady hand of David Rolson to lead us a speaker. He has reinstated the core of the house. And to me, that was important. But he has maintained the expectation of civil discourse and behavior. With his vision and steady leadership, the house will continue to put Georgia first, be prosperous, and hold the values of his citizens dear. We are a family, it's not just to empty saying to him, I watched him beam with pride at the work that you've done in your community and hearing this building. And on the sad end, pry with you at a loss. The speaker's job is one of those all-in jobs. Every day, every night, we call on him and he answers. He has a vision for Georgia. And as he talks and press conferences and hear with us, we know it. And I think our state motto, wisdom, justice and moderation. I know David Rolson is pattering. His work is speaker by that motto. And I hope you'll join with me in selecting David Rolson, speaker of the Georgia House of Representatives. Thank you. The chair recognizes the gentleman from the 128th, Mac Jackson, to speak to the nomination of Speaker Rolson. Thank you, Mr. Chair. When I think about Speaker Rolson, I think about Joshua in the Bible. When God said, be strong and very courageous. I found that Speaker Rolson is a very strong man, very courageous. He's a fair man. He rules with integrity in the House of Representatives. When he developed the Rural Development Council, he placed me on there, along with some more representatives. Because he was interested in the prosperity of all of Georgia. He wanted to see growth in all of Georgia, not just in the Atlanta area in the Northern parts. But he wanted to see growth in all areas of Georgia, especially in rural Georgia. And we've got some issues in rural Georgia, and the speakers show a lot of concern about the things that we have in rural Georgia. I'm a rural legislator, and I appreciate the concern that he has for areas that I serve in. And those things mean a lot to a district like mine when you have the speaker with concern forward. Speaker Rolson has always shown kindness. He's always been fair. In debates and everything here on the House. This is my, I'm going into my 13th year being here in the House of Representatives. And I can say that Speaker David Rolson is a man of integrity, a man of honesty, and a man of fairness. So I urge you to vote for Speaker Rolson for Speaker of the House of Georgia Representatives. On the election of the Speaker, the Georgia House of Representatives for the 2021-2022 term, those voting for the gentleman from the 7th district, Representative Rolson should vote yes or green, and those opposed to should vote no or red, and the clerk will unlock the machines. Have all, have all members voted? Have all members voted? Have all members now voted? Yes, so, the clerk will lock the machines. On the election of the Speaker of the House, the gentleman from the 7th Representative Rolson received 158 votes. The gentleman from the 7th Representative Rolson having received the majority of the votes cast. He's hereby declare elected Speaker of the House for the ensuing 2021-2022 term. The chair appoints the following members to the S. Court Committee. The gentleman from the 8th Representative Stan Gunner, the gentleman from the 18th Representative Tyler Smith, the lady from the 131st Representative Beth Camp, the gentleman from the 21st Representative Brad Thomas, the lady from the 20th Representative Charlise Bird, the gentleman from the 167th Representative B. The gentleman from the 1st Representative Mike Cameron, the lady from the 73rd Representative Karen Mathyak. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. Committee of S. Court, please escort the Speaker to the Speaker's Rosper. The Chair recognizes Ms. Sheree Bradburn. I'd like to personally welcome the new members of this body. I'd also like to welcome those who have served before. 2020 has definitely brought many challenges. However, I am praying for a better 2021 because as a Christian, my faith is in our Lord and Savior. As is the Speaker. In introducing the Speaker today, I am not going to talk about the fact that he is the second longest serving Speaker in Georgia. I'm not going to review his record in getting important bills passed, nor talk about his bio. I want to share with you my perspective of this man. A man who means it when he says he loves this house. A man who hurts when you do. He sheds tears privately when tragedy or loss hits a member of this body. I see those tears, but I also see how he joyfully carries your burdens. He is a man who is made happy by the little things in life. He loves to call home and he shares his excitement about when a new member passes his or her first bill or when he surprises a member by just showing up at their church and announced. He is a strong man and never takes his eyes off the prize, even when he is being unfairly attacked and called all kinds of not so nice things. To be honest, sometimes that makes me angry because he doesn't get angry. So I guess he knows that I'm angry enough for both of them, but for both of us. Most of all, he loves the state. He loves traveling the state and meeting people in their communities. He wants Georgia to be the greatest state in our nation. He is fair, he is compassionate, and he is kind. And oh, by the way, he does not keep secret files on his members. The only secret file there is is the one that I keep on him. When you share his life, you know what this house means to him. He also prefers vegetable soup and cornbread over a steak any day. And you also know what those mountains within him mean. To us, he is David or he is dad, but today it is with heartfelt honor that I introduce to you, your speaker David Rolston. Thank you. Thank you all very much. Thank you. I didn't know about that till yesterday. Didn't think she'd pull it off, but thank you very much. I'm speaker, leader Burns, leader Beverly, leadership teams of both caucuses, my friends and distinguished colleagues of the Georgia House of Representatives. To our great clerk of this House Bill Riley, my fellow Georgia's. I am honored to welcome each of you to the 2021 session of the Georgia General Assembly. I am especially pleased to welcome the new members of this body. Today you begin a journey that I hope will be fulfilling and productive. You join a body that has accomplished much over the past several years, much of it on a bipartisan basis by working together. It has been the leader on the big issues in this state of the past decade. On July 3rd, 1889, the members of the Georgia General Assembly marched from the Kimball Opera House in downtown Atlanta, which housed state government during the construction of this new Capitol, the first building to house the Capitol in Atlanta, to the new building here into these halls in which we sit today. In the years since that time in this hall, those elected to represent their communities have faced awesome challenges. A war to end all wars combined with a pandemic, a devastating great depression. A Second World War fought to rid the world of a hateful totalitarianism. Fear struggles for equality during the Civil Rights Movement. A war in a jungle on the other side of the world that ripped many of us, ripped many of the ties that bind us, and a war on terror that brought death and destruction to American soil. We begin this session in another period of state and national people. A vicious pandemic that in less than a year has claimed more than 350,000 lives in our country. Almost 11,000 of those right here in Georgia, people that you and I know. Tragic and brutal reminders that the fight for equality and justice is not over. And finally, an election cycle that on the national level has provided far too much division, anger, and threatens to tear us apart on a scale never before seen. As public servants, we will be tested how we respond will both say much about not only what kind of leaders we are, but more importantly, we will determine in large measure whether we help navigate a path to an even brighter future for our state. Leadership is not measured by a volume of noise, by petty political posturing or appeals to our lesser angels. It is not a self-measurement test where one promotes their own integrity or becomes self-absorbed with what they believe to be their own goodness. Leadership is not complicated. It is a combination of basic qualities that we should all embrace, honesty, fairness, compassion, and courage. It looks to the greater common good. And it recognizes that none of us, not one, are more important than the sum of our parts or above the law in this state or this country. Finally, leadership requires courage. Courage can take many forms. It can mean admitting you are wrong even when to do so hurts. It can mean being willing to change your mind if you are presented with sufficient facts. And yes, it can also mean having the strength and resolve to do that which is right even though it may not be politically popular. You are all called to be leaders. You sit here today because at some point in your life, someone saw you as a leader. My challenge to you today is to be the best leader that you can be. I believe that when good leaders work together, great things can happen. And I want great things to happen for each member of this body, this house, and our state of Georgia. Let us strive toward that goal, finding common ground when we can, and being civil and respectful when we can't. I really believe that is what Georgians want us to do. The voices of the angry, the bitter, and the discontinent are frankly getting weary and getting exhausting. Whether you are on the left or the right, Georgians have a right to expect you to be the leader. They felt you to be when they elected you. They expect us to do everything we can to overcome this pandemic and keep our state and our economy open. They expect us to begin the big and bold work of creating a freight and logistics system which can fit seamlessly with our economic engines all over the state. They expect us to quit treating mental health as less than what it is. A serious widespread and crippling problem that touches the lives of most every family in Georgia. We must address the concerns of many Georgians about the integrity of our election system. But this will be done in a thoughtful and responsible manner based on facts. Our elections must be free. Must be fair, free from fraud, secure, and accessible. That is our obligation. But equal to that obligation is this one. We must always tell our citizens the truth. Last Wednesday was a dark day in the history of our nation. I found it on a personal level to be painful and heartbreaking to see American citizens storming our beautiful and revered national capital. Later that night my mind went by to the passengers on flight 93 who gave their lives to save that building and other shrines in Washington, D.C. There is no possible justification for this loss of life, bloodshed, and damage. My friends, America is better than this. It is time now for healing. We must once again become one nation under God and indivisible. In his first inaugural address on the eve of the Civil War, President Abraham Lincoln said, We are not enemies, but friends. We must not be enemies. Though passion may have strained, it must not break our bonds of affection. So as we begin this session in an extraordinary time, let us embrace a spirit of healing and unity. I am reminded about the passage that I love so much in the book of Isaiah, where we are encouraged to come now and let us reason together. Never has this exhortation been more timely. I thank you for this honor. I am humbled and I thank you for your confidence. May God bless you and keep you and your family safe and well. And may He continue to bless the great state of Georgia and our United States of America. Thank you very much. Thank you very much. Thank you. The next order of business is the election of the Speaker Pro Tem of the House for the 2021-2021-2022 term. The House is now open for nominations for Speaker Pro Tem. Chair recognizes Chairman Nix from the 69th. Speaker, I rise to nominate the lady from the 47th representative Jan Jones for Speaker Pro Tem of this House. Representative Nix has nominated Representative Jan Jones for re-election for the Speaker of Pro Tem. Is there a second to the nomination? Chair recognizes the lady from the 160th district representative Jan Tancersley. Thank you, Mr. Speaker. I am honored to second the nomination of Jan Jones as Speaker Pro Tem of our House of Representatives. Representative Tancersley has seconded the nomination of Speaker Pro Tem Jones for re-election to that position. Are there further nominations? The Chair recognizes the majority leader of the House for emotion. Mr. Speaker, I move that the nominations for Speaker Pro Tem be closed. The majority leader has moved that the nominations for Speaker Pro Tem be closed. Is there objection to closing the nominations? The Chair hears none and the nominations are closed. The Chair recognizes the gentleman from the 69th district representative Randy Nix to speak to the nomination. Thank you, Mr. Speaker. I'm honored to nominate my friend and colleague represented Jan Jones for Speaker Pro Tem of this House. She has served her district in the state of Georgia with distinction since 2003. She's a native Georgian born and won her Robbins Air Force Base with her family roots in Lawrence County. She's the daughter of a career soldier and the granddaughter of two Lawrence County farmers. She has lived in Fulton County for 25 years. For those who have followed Georgia politics over the past 10 or 12 years, Representative Jones doesn't need a lot of introduction. She rose quickly through the ranks of leadership in the House, breaking barriers and making history along the way. This was made possible by her relentless energy and commitment to excellence. Jan always puts character in principles first, feeling that a leader should be held to a higher standard. On a personal note, Jan has been a mentor to me and also to many others in this House. She generously shares her time and experience to help others be successful. I believe her quiet, calming demeanor, her thoughtfulness and her outstanding commitment to this House make her the ideal candidate for Speaker Pro Tem. And I am proud and honored to make this nomination. Please join me in electing Jan Jones is our Speaker Pro Tem for the 2021-2022 legislative term. Thank you. Chair recognizes the lady from the 160th district representative tanker'sly to speak to the nomination. Thank you, Mr. Speaker. Colleagues, I think as you could tell, I'm excited and I'm honored to get up here and to thank the nomination of Jan Jones as our Speaker Pro Tem in this House. Ten years ago, on a day like today, but it was during an I-Storm.\n\nthat paralyzed North Georgia and certainly downtown Atlanta. I was sworn into office. One of my first and proudest moments was devote for Speaker David Ralston and Speaker Pro Tem Jan Jones. Aside from knowing that I was going to serve under great speaker, I was fascinated at the thought of serving under the under leadership and a body that included so many great men and women who were here to serve the constituents from their home areas. My political role up until the time I came here for about 15 years prior to coming here, I was pretty much the only woman to serve on a city council and then later the first female led to to serve on a board of commissioners and then a first female to come here as a state representative. So Jan Jones right away became a person of interest to me and I watched her closely. It was obvious from the outset that she sincerely cared about others and she made it clear that she wanted our members to succeed. I took advantage of every opportunity I had to seek her wise counsel. Over the years we've developed a great friendship and you know what the good news is for all of you? Jan Jones is your friend too. She will make herself available to discuss your ideas or your concerns and sometimes it's just to offer some much needed encouragement when things don't go quite as planned. Today, as you know, we again face challenges from forces of nature that we could not have predicted. But we can rest assured that Jan's dedication to this body remains strong as we craft sound policy called for the benefit of the constituents that each of us serve. Year after year, I've been proud to call Jan Jones Madam Speaker Pro Tem but even more proud to call her my friend. Ladies and gentlemen, I humbly ask that you join me in support of my friend, Anniers Jan Jones is your Speaker Pro Tem. Thank you. On the election of the Speaker Pro Tem of the House of Representatives for the 2021-2022 term, those voting for Representative Jan Jones should vote yes or green and those opposed should vote no or red and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the election of the Speaker Pro Tem. Representative Jan Jones, having received 159 votes, is hereby declared elected Speaker Pro Tem of this House for the ensuing term. The Chair appoints as a Committee of Escort Representative P3 from the 166th, the Representative Todd Jones from the 25th, Representative Watson from the 172nd, Representative Gamble from the 15th, Representative Rich from the 97th, Representative Taylor from the 173rd, Representative Drenner from the 85th, Representative Smiley from the 135th, Representative LaHood from the 175th, and Representative Earhart from the 36th. All right, Madam Dorkieper, tells me we're all set. Please greet the Speaker Pro Tem of this House. The House will come to order. The House will come to order. The House will come to order. The House will come to order. The House will come to order. The House will come to order. The House will come to order. The House will come to order. The House will come to order. Well, thank you, and thank you for the privilege to serve you one more time. I'm proud to know you, to work with you in creating an even brighter future, and uphold the traditions and honor of the House. I want to thank the gentleman from Lagrange of the 69th, Chairman Nex, for his more than generous words, and I want to thank my friend, the General Lady, of the 160th, from Brooklyn, Chairman Tankersley, for her kind words. I do have to say I want to thank my husband, Kaylen, and our four children, and sons-in-law, and daughters-in-law, who continue to make my service possible. They've stood by me patiently as your families stand by you, and I hope that you will remember that they are what make it possible for you to be here. I'm also appreciative to this body for its sound judgment in re-electing David Ralston as speaker. I know his heart and his efforts to improve Georgian's lives after serving alongside him, as he mentioned, as pro-tim for ten previous sessions. I'm honored to serve this House and use speaker Ralston on its behalf. I look forward again to Majority Leader Burns, Steady Han, and the good work of the Majority Leadership Team in Republican Caucus. I want to extend my heartfelt congratulations to new Minority Leader Beverly, and new Minority Whip, Wilkerson. I hope you enjoy your new places up at the front. You'll have a great view of things that the House will accomplish during this next term and your participation. I look forward to joining with both of you, the Minority Caucus Leadership Team and the Democrat Caucus, as well as we strive to make Georgia an unparalleled land of opportunity for all of our constituents. Welcome as well to the 26 newly elected freshmen to the People's House. You're just about evenly divided between the two caucuses, and you've got a great future ahead of you. We serve in a capital building that echoes the efforts of representatives that came before us. For 132 years, elected officials have gathered to work together and find solutions to improve the lives of their constituents. Let's join together this term and accomplish even more than our predecessors. One more word to the freshmen. As you begin and extraordinarily rewarding endeavor for you and your constituents, I encourage you to prioritize your family and close friends, regardless of the Tugs elsewhere. They were with you before elected service, and I pray they will be with you when elected service ends. I'm committed to support each representative in this room and up in the gallery and in the other room. Republican and Democrat rural, metro, and urban. In positioning Georgia, again as a leader in job creation, education excellence, a sustainable, compassionate safety net for those facing hardship, protecting the vulnerable, and safeguarding our individual freedoms. It's imperative, so Georgia emerges even stronger beginning today and after the COVID challenge. Let's listen to all voices, never forgetting the silent center. The ones that don't fill up our emails and our telephone calls, but the ones who are back home, raising the family, taking care of their elderly parents, paying the rent and taxes, and volunteering at the Food Bank, the local church, or the baseball field. The people's house should hear them and make their concerns ours. I pledge to serve you as we move past this pandemic, doing what is good and right for the great state of Georgia. May God bless you in your service to the people. Thank you. Applause. Thank you. Applause. The next order of business is the election of the clerk of the house for the 2021-2022 term. The chair recognizes the lady from the 13th House District Representative Dempsey. Thank you. Mr. Speaker, there we go. Thank you. I rise to nominate a friend to each and every one of us. As you stated, and your acceptance remarks, the great clerk of this house, William L. Bill Riley, to continue to serve as the clerk of our Georgia House of Representatives. Representative Dempsey has nominated Bill Riley to be the clerk of the house for the 2021 term. Chair recognizes the gentleman from the 143rd District Representative Beverly. Thank you, Speaker. I rise to date a second in nomination to Bill Riley. I think of a greater clerk. When I first came here, it was Bobby. And we remember Bobby and then Representative Bill Riley came along. And I didn't think that he would ever be a victim and Bill called me this past week. And I said, men, I'm honored to second in nomination. We couldn't have a better clerk in the state of Georgia than Bill Riley. So I'll take this honor seriously and I absolutely second in nomination. Representative Beverly, a second in the nomination of Bill Riley to be reelected clerk of the house. Chair recognizes the majority leader for emotion. Thank you, Mr. Speaker. I speak I move that the nominations be closed and that the entire membership cast their votes for the election of Bill Riley as clerk of the Georgia House. The majority leader has moved that the nominations for clerk be closed and that the entire membership cast their votes for the election of Bill Riley as clerk. Is there any nomination, any objection to the nominations being closed? The Chair here's none. The nominations are closed. Is there any objection to directing the deputy clerk to cast the entire vote of the membership who are present for the election of Bill Riley as clerk of the Georgia House. The chair here's none and the deputy clerk is so directed on the election of the clerk of the house Bill Riley has received the entire vote of the membership who are present and he is hereby declared an elected clerk for the ensuing term. The chair appoints as a committee of escort the following the lady from the 48th district representative, Robus show the lady from the 100th and 8th district representative. The representative Jasmine Clark the gentleman from the 111th district representative Elmati Holley the lady from the 70th district representative Lynn Smith the gentleman from the 151st district representative green the gentleman from the 2nd district representative Tarvan the lady from the 139th district representative Bitten. The representative Bentley the committee of escort will please meet and escort the clerk to the front of the chamber. Thank you. Thank you. Madam doorkeeper are we already back there the committee of escort will please present the clerk to the house. Thank you. At this time the chair will administer the oath of office to the clerk of the house. Thank you. Thank you. The next order of business is the election of a doorkeeper for the house for the 2021-2022 term. The house is now open for nominations for doorkeeper the chair recognizes the gentleman from the 12th house district representative Lumsden. Mr. Speaker it's my privilege to nominate Pat Highnote for doorkeeper for the Georgia House of Representatives for the 2021 session. Representative Eddie Lumsden has nominated Pat Highnote as doorkeeper of this house. The chair recognizes the gentleman from the 38th house district representative Wilkerson. Thank you Mr. Speaker. It is my honor to second the nomination of Pat Highnote for a doorkeeper. Representative Wilkerson has seconded the nomination of Pat Highnote as doorkeeper of this house. The chair recognizes the majority leader of the house for a motion. Mr. Speaker I move that the nominations be closed and that the entire membership cast their votes for the election of Pat Highnote for a doorkeeper of the Georgia House. The majority leader has moved that the nominations of the house be closed and that the entire membership cast their votes for the election of Pat Highnote as doorkeeper. Is there any objection to closing the nominations? The chair here is none in the nominations are closed. Is there any objection to directing the clerk to cast the entire vote of the membership who are present for the election of Pat Highnote as doorkeeper. The chair here is none and the clerk is so directed. On the election of doorkeeper Pat Highnote has received the entire vote of the membership who are present and she is hereby declared elected doorkeeper for the ensuing turn. The next order of business is the election of a messenger for the house for the 2021-2022 term. The house is now open for nominations for messenger. The chair recognizes the gentleman from Sunter County in District 138, Representative Chokus. Thank you, Mr. Speaker. It is indeed an honor for me to nominate Betsy Thoreau for messenger and media communications director. Representative Chokus has nominated Betsy Thoreau as messenger for the house for the ensuing term. The chair recognizes the gentleman from the 127th District Representative Brian Prince. Thank you, Mr. Speaker. I would like to thank the nominators for having me. Representative Prince has seconded the nomination of Betsy Thoreau as messenger of this house for the 2021-2022 term. Chair recognizes the majority leader for a motion. Mr. Speaker, I move the nominations be closed and that the entire membership cast their votes for election of Betsy Thoreau as messenger of the Georgia House. The majority leader has moved that the nominations of the house be closed and that the entire membership cast their votes for the election of Betsy Thoreau as messenger. Is there any objection to closing the nominations? The chair here is none and the nominations are closed. Is there any objection to directing the clerk to cast the entire vote of the membership who are present for the election of Betsy Thoreau as messenger? The chair here is none and the clerk is so directed. On the election of the messenger of this house, Betsy Thoreau has received the entire vote of the membership who are present and she is hereby declared elected messenger for the ensuing term. Thank you. Okay, we now have some business, a little more business to do. All right, the Senate has adopted earlier today SR-2 to notify the governor that the General Assembly has convened. Is there any objection to buy this house to the adoption of the resolution? The chair here is none and the resolution is adopted? The chair appoints as a committee of notification on the part of the House, the following members. Representative Gaines from the 17th, Representative Wheat Hour from the 119th, Representative Fry from the 118th, Representative Reeves from the 34th, Representative Lot from the 122nd, Representative Larickia from the 169th, and Representative Bonner from the 72nd. The chair recognizes the majority leader for the purpose of offering a resolution. Thank you, Miss Speaker. Miss Speaker, I would like to offer House Resolution 6 at this time if the clerk would read the caption. House Resolution 6 by Representative Burns 159th to notify the Senate that the House of Representatives has convened. Chair recognizes the majority leader to speak to the resolution. Thank you, Miss Speaker. Well, good afternoon and happy new year. It's an honor and a pleasure to be here with my colleagues as we move forward. I have some good intel that the Senate was able to find the light switch and they finally got their business going on that side of the building. So I believe it's time we move forward with this resolution. It simply notifies the Senate that the House is here ready to lead as always. We notify them that we're here and that we're ready to do business. Mr. Speaker, I would ask for this body to support this resolution, House Resolution 6. Is there any objection to the adoption of the resolution? The chair here is none and the resolution is adopted. The chair recognizes the majority leader for the purpose of offering a resolution. Miss Speaker, this time I'd like to offer House Resolution 7 if the clerk would read the caption. House Resolution 7, my representative. It's on 159th adopting the rules of the House of Representatives. Chair recognizes the majority leader to speak to House Resolution 7. Thank you, Miss Speaker. Miss Speaker is beginning of every term of this House. We go back and take a close look at the rules and have we've operated in the past and see if there's any changes or that may need to be made to make sure this House continues to work smoothly. In 2019, Miss Speaker, you had the vision of a pointy working group that dealt with the creative arts and entertainment and issues that surrounded those issues in our state. Very successful work has been done and I believe it's time and we're going to propose a rule that we add that committee that deals with as a permanent committee to deals with creative arts and entertainment. Certainly we'll deal with legislation surrounding the art and entertainment industry. And ask for the adoption of the rules of this House, Miss Speaker. There's any questions I'll take them if not. I would ask favor consideration. You do not appear. You do have a question.\n\nrecognizes representative Wilkerson to your left for a question. Thank you, Mr. Speaker. I received notification. Do you, did everybody in the gallery get a copy of the rules? I would ask that they be given a copy. Thank you, Mr. Speaker. They should have been there. Thank you. Clerk's office says that they were given one. Here they come. I'm glad we got him out because I wanted to talk about those rules before we leave. I saw several of you speedread right on through those rules. So thank you very much. Well, the rules are identical to what they have been at least for the last 11 years, with the one change that Leader Burns talked about. Mr. Speaker, if I may add, they've served us very well through some different situations and trying times. You do not appear to have any further questions. Mr. Speaker, I'll ask for the members' favorable consideration, and I can guarantee you, if you're having trouble sleeping at night, take that home with you, and it'll help you go right on the sleep. So I'll ask for the members to prove the rules for this house. Thank you, Mr. Speaker. Is there any objection to the adoption of the resolution? Is there any objection to Chair Here's None and a House resolution seven has been adopted. What purpose does Representative Al Williams wish to be heard? Thank you, Mr. Speaker. Thank you, Mr. Speaker. Apollometry inquiry. State your inquiry. Is it not true that we've began to see some light in a positive direction with the budget? The numbers that came out yesterday were in a good direction. Is it not true that you that like to ask that because of that, after the doughkeeper moved the block of ice from a munders, can we put a little coal on the fire? I may join with you in that Representative Williams. I think I have frostbite up here. Is there, we adopted House resolution seven. Okay. Chair recognizes the majority leader for the purpose of offering a resolution. Thank you, Mr. Speaker. This time I would like to offer House resolution eight if the clerk will read the caption. House resolution number eight, by the person that burns 159th relative to officials, employees, and committees in the House of Representatives. The majority leader has recognized to speak to the resolution. The caption of resolution eight was very descriptive and succinct to the point. It allows the speaker to make sure the business of this house is transacted and make sure that the employees are adequate and that everything we need to make sure that what happens behind the scenes that makes this House work transpires and is taken care of so we can have a successful session. Behind the scenes work is what makes every smooth running machine work. This one works very well. It's very successful for the people of Georgia and I would ask your favor consideration on House resolution eight. Is there any objection to the adoption of the resolution? The chair here is none and the resolution is adopted. The chair recognizes the majority leader for the purpose of offering a resolution. Thank you, Mr. Speaker. This time I would like to offer to the House, House resolution nine if the clerk will read the caption. House resolution nine by Rips and the Burns 159 calling a joint session of House of Representatives in the Senate for the purpose of hearing a message from the governor. Chair recognizes the majority leader to speak to the resolution. Thank you, Mr. Speaker. Mr. Clerk, as our tradition here in this state is that we hear from the governor. With the state of the state, we have that schedule for Thursday of this week. The governor will be with us and bring us the his perspective and his thoughts. On the state of our state as we move forward into the 21-22 year and his perspective and his guidance as we consider the beginning of this legislative session. So that is Thursday this week at 11 a.m. here in this chamber. We will have the same posture. Don't Thursday that we have today as far as our members go. So that's what I would ask you to approve today. Approved today is House resolution nine calling for a joint session of the House in Senate. Is there any objection to the adoption of the resolution? The chair here is none and the resolution is adopted. The chair recognizes the majority leader for the purpose of offering a resolution. This is the one you've been waiting for. On the bring to the members House resolution 10, which is a scheduling resolution. Mr. Clerk, if you read the caption. House resolution 10 by represent a parent's 159 relative to meetings and adjournments of the general assembly. Chair recognizes the majority leader to speak to the resolution. Thank you, Mr. Speaker. Can we put it up on the screen, Mr. Clerk? Or I can explain this when I believe pretty closely. Let me see if I can do that. Obviously today is we will be in today. Obviously we're in here taking care of our business on Monday, January the 11th. Here we go. We'll be in this week on Tuesday, Wednesday and Thursday. Thursday will be legislative day four. Then we will be out for budget hearings. Certainly the Martin Luther King holiday next week. Then out for budget hearings next week, which I think the appropriations chair may address, but may be encouraged to participate virtually with the appropriations hearings. Then we'll come back for day five on Tuesday, Tuesday, January the 26th. That's the adjournment resolution for now that we have, that we will certainly send over to the Senate for their agreement. But Mr. Speaker, I would ask all the members of this House to approve this House resolution 10. I would first adjournment resolution. Is there any objection to the adoption of House resolution 10 regarding adjournment? The chair here is none, and the resolution is adopted. Okay, that completes the resolutions, but we have two or three other brief matters that are very important. And I'm going to recognize the majority of the leader to speak to one of those matters. Thank you, Mr. Speaker. If I can have your attention, full attention, just for a few minutes, more minutes. I want to remind everyone to take note of our testing. Our surveillance testing that is being conducted by the Georgia Tech family downstairs. It will occur on Mondays and Thursdays. Mondays and Thursdays. But let me clarify right now, I don't want to confuse you, but since we will not be in until the Tuesday, or week on whatever that date is, I just took the 26th, the 25th of January will not be a testing day, the 26th will. That week will be Tuesday and Thursday instead of Monday and Thursday. But let me bore you with this, so let me make sure we all understand what we need to do because this is most important to us all. And it's something that the minority leader, and I worked on along with the staff to make sure we would keep the members of this House safe. But let me remind you of a couple of things. During the 2021 session, Georgia Tech will provide COVID-19 surveillance testing program to general assembly members and staff twice per week on Mondays and Thursdays from 7 a.m. to 11 a.m. in room 230. This schedule is subject to alteration based on the schedule, as we just mentioned. This testing program is for asymptomatic persons only. Symptomatic individuals should not report to the Capitol for testing through this process. All members and staff are required to test twice weekly. If any member or staff has not already been tested through the Georgia Tech program and has failed to set up their online testing profile, then visit the testing site outside room 30 this week to be assisted with setup. Georgia Tech plans to have side teams on site on Monday and Thursday. They were here this morning. They're not here now. They were here to 11 o'clock. So you'll have to do that on Thursday if you need their assistance. Results reporting. Your test will be processed by Georgia Tech by the end of the day on which you are tested. Your results are then reviewed by a physician from North Georgia Health System. After review, results are transferred to the Georgia General Assembly's Human Resources Department. Individuals testing positive will be contacted directly via phone by an HR representative. That evening or early the next morning after testing, let me repeat. Individuals testing positive will be contacted directly by phone by an HR representative that evening or early next morning after testing. Individuals who test negative will not be contacted. Your test results will not be reported via the Georgia Tech dashboard at mytest.ga.edu. That is only for their own campus testing program. So don't look for our testing on that. That's for Georgia Tech students. For those of us who have had COVID in the past 90 days. All members and staff who have been diagnosed with COVID in the past 90 days are required to be tested through the Georgia Tech System at least once. Sure, their test results yield a false positive result as a result of having had COVID in the past 90 days. Those individuals should work directly with the speaker's office on a plan for the remainder of this session. I hope that answers everyone's questions on how our surveillance program is going to work. If we cooperate and work through that surveillance program, I think we will have a good status for our health. And dealing with this pandemic with the COVID doing this session. So I encourage all of you, if you have not, to make sure you get your work done with Georgia Tech so that we can monitor our health in the appropriate manner and not only protect ourselves but protect our neighbor. Thank you, Mr. Speaker. Are you the one? You had a question, I think. Do you yield? Yes, sir. I'll try to answer. Chair recognizes representative Wilterson to your left for a question. Thank you, Mr. Leader. Thank you for the testing. I do have two questions that have come up. The first, is there any contract tracing being done as a result of positive tests? So if a member has been exposed, has passed test positive, are we checking to see if other members are impacted by that? Yes, we are following, certainly, Georgia Public Health guidelines. And that would be a part of the contact tracing. And certainly our HR department is engaged from the standpoint, certainly protecting the privacy of our members and certainly following all legal procedures. Okay, so will you yield for a follow-up question? I sure will. So if that is the case, then it is possible you may get a phone call where you are not positive but you may get a phone call saying you've been exposed. Because that's what typically happens through the Department of Health. If I can just get clarification on that, I think it would be helpful. Thank you. Yes, I think that is the case. And certainly we're going to have a, we will have, we have and we will have a very robust process of making sure that our members are kept safe. And that would be part of that activity. Yes. Thank you for your question. You have another question if you care to you. I hear from one more, Ms. McClure. Chair recognizes representative camp to your right up in the gallery. I'll say it will bring you the mic. Okay. Representative, can you hold up just a minute? We can't hear you at all down here. Do we not have a microphone up there? Are you kidding me? I'm not going to be a microphone. I'm not going to be a microphone. Of course, be honest with us. I'm not going to be a microphone. I'm not going to be a microphone. I'm not going to be a microphone. I'm not going to be a microphone. I'm not going to be a microphone. I'm not going to be a microphone. We're running with us. We're running with us. Representative camp just hold for one moment. I think we have something coming to you. I'm told that the audio is down. And we do have microphones, obviously, up in the balcony. Thank you. Thank you. Okay. Chair recognizes Representative camp. Thank you very much, Speaker Ralston. I have a question that I have not been able to find where it's been addressed yet. My mother and father-in-law live on property with us. They're in their 90s. They are being vaccinated as my husband and I are next week. What is the protocol if we've received a vaccine? We will continue to test everyone. Certainly, the science is... There's all sorts of views on the science right now. We're certainly working very closely with the GUSD University. From that perspective, make sure we have the latest science. But we're making sure, though, the other part is we're not taking any risk with our health of our members. And so everyone will continue to be tested. And then certainly, if there are certainly additions that we can understand about a false positive, certainly, then that will be taken in the consideration. Representative Camp, I asked that same question last week. And what I was told by someone in public health is that for five days, there's really no benefit whatsoever to the vaccine. And then after five days, and before the second one, you have a 60% protection rate, which means you have a 40% unprotected rate. And then there is a time lag, I'll see you Chairman Newton in here. What's the time lag on the second vaccine before we get up to 95, 96%, yeah, so 10 to 14 days. So just the day you get it is not going to be, you know, you're done. So that's why we're continuing to test. Hope that helped. Anything else, Mr. Speaker? Any other questions? No further questions. Mr. Speaker, I thank you for letting us have that time to discuss this matter. Thank you for the questions. I would tell you my observation is that our staff, and certainly when leader Beverly and I were engaged in this discussion at the leaders' direction, we've made sure that we have a abundance of caution in everything that we do to make sure that we follow the best procedures. We have the best people engaged. We're going to make sure we can do everything we can to keep our members and our families at home safe. Mr. Leader, without, Mr. Speaker, without I'll yield the well. Thank you, Mr. Leader. I have two or three announcements I want to make, and I want you to listen up to these very carefully. Once you get sworn in, which I think all of you have, you need to stop by the House Post Office out here and pick up your paperwork from the fiscal office. And probably that should be done today. The second announcement is that the books, the notebooks that normally are placed on your desk every day with bills and status reports and that kind of information in them will not be put on your desk. And that applies to whether you're in the chamber, in the balcony, or in the room 341. They will be outside your seating area, outside the door. So you'll need to pick those up as you come in each day. Please leave your voting cards in your desk drawer and leave your voting tablets on your desk. Members in the gallery, please return your tablets to the clerk's office staff who will be stationed as you exit the door. Okay, strike all that. If you have a voting machine, leave your card in it. It'll help us test the audio after we have cleared out of here today. I want to give a big thank you to some of the greatest people we have in this state. And that is our men and women of the Department of Public Safety that have been out here preparing for today and then taking good care of us. And I think we should show them an expression of gratitude at this time. Thank you. My final announcement is this. We don't have committees yet. Which means you got a lot of free time. This is a rule book for this house. And when I spoke to the new members back in November, I encouraged a study of this rule book. I got to tell you that in certain parts of this body today, the decorum and breaches of rules has been frankly a little concerning. It's gotten a little better as we've gone on, but it was concerning. There are some specific do's and don'ts in there that I didn't call attention to today. But come tomorrow, I will. Because we're going to all follow the rules. So you know, you got this afternoon after you have lunch, go read the rule book. Everybody in this house should master the rule book. Now with that, I know that three of our members will be reading the rule book religiously today, while they celebrate their birthday. Help me wish a happy birthday to Representative Derek Jackson. Representative Matthew Wilson. And Representative Houston Gaines. Houston Gaines is going to go buy a cold drink this afternoon. He's turned 21. He's eligible now. No other business to come before the house. The chair recognizes the majority leader of the house for a motion. Mr. Speaker, I move that this house stand adjourned until 1 p.m. Tuesday, January the 12th, 2021. The majority leader has moved that this house be adjourned until 1 o'clock p.m. On Tuesday, January the 12th, 2021, all those in favor of his motion will say aye. Those opposed will say no. The eyes have it. This house will be adjourned until Tuesday at 1 p.m. The House of Representatives. The House of Representatives. The House of Representatives.",
  "updated_at": "2026-02-13T08:12:11.462681+00:00"
}