{
  "video_id": "GK1-jwdMtp0",
  "url": "https://www.youtube.com/watch?v=GK1-jwdMtp0",
  "title": "Rules PM Meeting Part 2 for Day 35 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 35,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "Overview:\nThe Georgia Rules PM Meeting Part 2 for Day 35 of the 2025 Session focused on amending and passing a substitute bill through the subcommittee. There was some debate and a failed amendment proposed, but ultimately the substitute was passed with two other amendments.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- The chair proposed two amendments to the substitute bill: 1) adding \"related to the litigation\" after \"services\" on line 267, and 2) striking the word \"regulated\" on line 384.\n- A member proposed an additional amendment to change \"shall\" to \"may\" on line 274, but this amendment failed.\n- There was some procedural discussion as the chair worked to properly manage the motions and amendments.\n\nVotes:\n- The amendments proposed by the chair were approved by voice vote.\n- The final motion to pass the substitute bill as amended was approved, with one no vote.\n\nAttendance:\nA quorum of members was present.\n\nAdjournment:\nThe subcommittee meeting was adjourned after completing its business.",
  "transcript": "If anybody's out there in the hall, if you'd come on back in, we have our members on the\nIt's still outside.\nOkay.\nPatients.\nSo what I'd like to do is I'd like to put the sub before us and then I have a proposed\namendment and then I'd like us to have the discussion we need to have and then take\na vote. So we've got a substitute before you which is LC 49238 to ECS. Do I hear a motion\ndo pass on the substitute, motion in a second, and now as far as amendments go, the chair\nwould like to entertain a motion to make two changes to the substitute. One of them\nonline 267, which is on page 11, I believe,\nto add, after the word, services,\nto add the words related to the litigation,\nto narrow the scope of that prohibition,\nbecause some of the companies that do this kind of stuff\nalso provide financial services that would not\nimpact the litigation necessarily.\nI'm sorry, it related to the litigation right after the word services on line 267.\nAnd then the other one, which we can refer to as the Evans and Sally amendment, is to\nstrike the word regulated on line 384.\nAll right, so we have striking regulated on 384 and adding related to the litigation after\nthe word services on 267. Do I hear a motion to make that amendment? Do I have a second?\nI have a motion to second. Any discussion about the amendments or the substitute?\nHearing none, I'll call the question on the amendment first and then we vote on the bill\nas amended. I know you've got my little script here but I wanted to confirm it.\nOkay, so I was reading something wrong.\nAll right, so we've got a motion to amend on the floor with a second.\nI don't think there's any further discussion.\nAll those in favor of the motion to amend the bill, signify by saying aye.\nThose opposed say no, all right, the ayes have it.\nAnd so the bill, the substitute is amended.\nNow all those in favor of recommending do pass to the substitute as amended.\nWould you signify by saying aye?\nAye.\nAll those opposed?\nI do apologize, I was reading as you were moving swiftly, I did want to propose one small\namendment for the committee, the subcommittees consideration, it is online 274 of the Substitute,\na litigation financing agreement, shall, my proposal based on some of the discussion\nI had and what I've sort of already said on the record.\nI propose shall be changed to May.\nOkay.\nI think the chairman understands why, but I will just say it for the benefit of my colleagues.\nI think that if a litigation financier does everything he or she is supposed to do under\nthis bill and let's say a legal representative based on that legal representative's conduct\nunrelated to the financier could be held responsible for decisions\nin the litigation when they are at the same time prohibited from participating in the\nlitigation. So I think that is a sort of contradictory in this code and more importantly I think\nit would discourage good litigation financing companies who do everything that they're\nsupposed to do from engaging in this endeavor which does as we've already discussed provide\nbenefit to plaintiffs, when done correctly, plaintiffs who need assistance bringing their\nclaim. So I would ask the chairman to consider changing shall to may.\nI think we had, we discussed that issue and the chair tried to offer a contrary position\nbut I will allow that motion. So if you want to make that motion.\nAll right, is there a second all right is there any discussion right all those in favor so you can find by saying aye\nAll those opposed say no\nLet's have a show of hands those in favor raise your hand\nHelp me do my siphon it's for all those opposed\nLike the motion fails. Great. Okay. All right. So there any other motions\nAll right, so we've got the motion to pass the bill as amended with the, I'll just collectively refer to that as the\nassalignment and the motion and second of our inmates there on the floor, all those in favor of passing the bill as amended in that manner.\nSo you can find by saying aye.\nAll those opposed, say no.\nNo.\nNo, we had one no.\nI think the chair says the motion passes.\nAnd so we will recommend do pass to the full rules committee on that substitute as amended and that ladies and gentlemen\nI believe concludes our business for this evening\nSo thank you all and hopefully that will conclude our business as a subcommittee\nI just want to thank all the committee members for your service and want to thank all the folks who attended so\npatiently throughout the hearing so thank you and we're adjourned\n",
  "updated_at": "2026-02-12T17:40:33.495486+00:00"
}