{
  "video_id": "GmRlqdKAKGQ",
  "url": "https://www.youtube.com/watch?v=GmRlqdKAKGQ",
  "title": "Rules Meeting Special Session for the 2025",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the Georgia Rules Meeting Special Session for the 2025 session:\n\n**Overview**:\nThe session focused on considering several Senate bills, including legislation related to organ transportation, drug testing equipment, and a dispute between Gwinnett County and the City of Mulberry. There was debate and discussion around these bills.\n\n**Key Actions**:\n- **SB 138**: Legislation to address Gwinnett County's refusal to enter into a service delivery agreement with the City of Mulberry, which was passed by the Senate.\n- **SB 81**: Bill to allow testing equipment for drugs like xylazine to be exempted from drug paraphernalia laws.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Debate over SB 138 and the dispute between Gwinnett County and the City of Mulberry, with accusations of the county not cooperating with the city.\n- Discussion of the importance of SB 81 in allowing for testing of emerging drugs like xylazine.\n\n**Votes**:\nNo recorded votes mentioned, but SB 138 appears to have passed the Senate.\n\n**Attendance**:\nQuorum was present, with a \"slight crowd\" noted.\n\n**Adjournment**:\nThe meeting adjourned, with the next session date not specified.",
  "transcript": "Good morning everybody, if you will come on in and have a seat and we'll call the meeting\norder. We've got kind of slight crowd today. Must be something going on in our meetings, I guess.\nThat's right. We've got the faithful here. We're going to ask Chairman Stevens to open\nus up with a word of prayer this morning. Thank you, Mr. Chairman. Let us pray. Most kind of\nthe grace of seven and father, give us the wisdom to do your will, give us the\nsight, place your hand on us, leave us and God is all these things we ask. Amen.\nAmen. Thank you. Folks, we've only got ten Senate bills forced to consider so\nfar. We should have some more coming tomorrow. We had a lot of committee report but\nbut they won't be eligible until the court reports them out.\nSo we have these 10 that we can be considered today\nand we've got some senators here that want to ask for these bills.\nSo we're gonna go ahead and do that\nand then we'll go from there.\nSo come on up and let's hear from you.\nThank you so much, Mr. Chairman.\nDistinguished members of this committee,\nI've got two bills on your page six.\nSenate Bill 58 is Georgia transporting life-saving organs and personnel act.\nThis allows organ procurement vehicles to take life-saving organs for one place or another.\nIf they are time sensitive to run emergency, they have done it in the past.\nThis is to clarify the law.\nWork with Colonel Billy Hitchens, our Commissioner of Public Safety helped write this bill.\nThis will undoubtedly save lives.\nAs you know, personal to me, as well as our very own representative Rick Townsend,\nwho donated a kidney to his daughter.\nAny questions?\nOkay, don't see any questions you have another one. I do sir sent bill 84 just creates a special license plate\nAnd it says a shepherd center. It's actually a different one. It's actually organ donation saves lives\nOkay, don't see any questions. Thank you sir. It's a license plate says organ donation saves lives\nThank you so much you\nSoon to come home\nThank you mr. Chair I\nI have three bills on your sheet, two of them I've already presented, so I can do them\nagain if you like, or I can just talk about Senate Bill 6.\nIf you've already presented this one time, then that's enough.\nOkay, Senate Bill 6 has to do with testing for drugs, and we've passed fentanyl test strips\na few years ago, but what we didn't know is that there are street drugs that have shown\nup that are not opioids, and so the fentanyl test strips are not going to pick them up.\nare now test strips for xylazine.\nAnd so this bill just broadens\nso that it will cover any testing equipment\nthat we need for xylazine and other drugs\nthat may show up.\nOkay.\nYou have the question.\nYes, sir.\nIt's a big protein.\nSo is xylazine all that,\nlike that horse drug?\nYes, ma'am.\nXylazine is a horse tranquilizer.\nSo it has legitimate purposes or veterinarians\nBut it's out on the street, and it's killing people.\nAnd I'm not quite clear what the bill does.\nIt basically treats testing equipment\nlike fentanyl test strips, allocene test strips,\nto be allowed, I'm not treated as drug paraphernalia.\nOh, okay.\nThank you.\nOkay, I don't see any other questions.\nThank you, Senator.\nYes, sir, Senator Dason.\nThank you, Mr. Chairman, I have two bills on your list today, first one is Senate Bill\n138.\nAnd it has to do with Gwyneth County and the City of Mulberry.\nThe reason for the bill, Gwyneth County is refused to enter into a service delivery agreement\nor an intergovernmental agreement with the city, next to the mayor's, you know, unable\nget in touch with the chairwoman or any of the folks at the county kind of\nstart that process. So they're not adhering to the transition statute. This bill\nwould bring that into line and get the Mulberry off to a good start.\nOkay, you have a question with parks. Thank you, Mr. Chairman. Senator Dixon,\nis it not true that I asked the city of the mayor of Mulberry in committee\nwhether or not he had any communication with the county over the past three\nmonths and that I was told to my face no and when I reached out to the county they\nprovided me written documentation of communications including a draft\nintergovernmental agreement for purposes of service delivery received just a few\nweeks ago. Is that not true? You know what I would say is the mayor was true in\nand what he spoke, the chairwoman or the county manager will not return his phone calls,\nhe's not spoken to her, or the manager, the way that the county's handled it is that the\nattorneys to attorneys have to talk. There was no agreement issued. I've not seen that.\nIf the if when it has sent something over is because of this legislation before we start\nor to move into legislation,\nwhen it refused to recognize the city,\nthere's a stop sign that's actually been knocked over\non a county road, and when a county DOT\nis refused to come fix it,\nPell's residence to call the city of Mulberry,\nwhich is clearly still the county's responsibility.\nAnd unfortunately, the county's forgotten\nthat the city of Mulberry residents\nare a Gwyneth County residents.\nIs it not true that regarding SB 138,\nACCG strongly opposes this legislation\ngiven the really horrible precedent it would set in waving sovereign immunity and again\nforcing from the state a county to enter into these sorts of agreements without allowing\nthe city and the county to otherwise negotiate terms and I would I would say representative\nthat it's egregious and and horrible that Gwyneth County is trying to circumvent the will\nof the voters. They ratified the legislation last year, and Bennett County refuses to work\nwith the city and recognize the existence of the city, and I think that is what's unfortunate.\nAgain, Senator Dixon, I have written documentation. I'm sure the county attorney would be more\nthan happy to also send you prior communications, including a draft, intergovernmental agreement,\nthat again, it appears the city of Mulberry is unwilling to take up or even consider it.\nthank you for time. Yeah I would say that you know city the elected officials were elected in\nNovember they've been trying to make contact since then the county to my knowledge has not responded\nin the county attorney only reached out after this legislation passed over out of the senate\ninto the house and that is true. Lee Riftration. Thank you Mr. Chairman. Chairman Dixon isn't it true\nthat after the election of the council mayor for the city of Mulberry that the mayor of Mulberry\nmade multiple attempts to have contact with the county commission chairwoman and the county\nadministrator that those were not responded to that the only time or proposal or government\nagreement was sent to Mulberry on the county's terms only communication which the whip was\nreferring to was sent after SB 138 had actually passed out of the State Senate and the night\nbefore it was to be heard in the House of Representatives Committee in that truth.\nThat is true, Mr. Leader.\nAnd isn't it also true that there are multiple bills pending this session which would allow for\nselective waiver of sovereign immunity and that this would only apply to Gwinnett County because\nof the egregious conduct of Gwinnett County during this very important transition through?\nThat is true, Mr. Leader, and as long as the county hears to the transition statute,\ntheir sovereign immunity would not be in jeopardy.\nThank you.\nOkay, having another question, let's pick Pro Temp.\nMr. Chairman, Representative Dickson, how many, as a non-Guinette citizen of Georgia,\nhow many Guinette County residents now reside in the City of Mulberry?\nRoughly 41,000, I believe.\nAnd is it not true that this bill will assure that the welfare and public safety of the\nresidents, these Gwinnett County residents, is protected in a way that the county is not\ndoing that?\nThat is true.\nBy not entering into these intergovernmental agreements and that it would set a very strong\nand positive precedent to suggest to Georgia that it is the county's duty to make sure\nthat these residents public safety is protected in the way that the government will agree\non what allowed.\nThat's true.\nThank you.\nOkay.\nI don't see any other questions on that.\nYou have another one, Senator.\nI do, Mr. Chairman.\nIt's Senate Bill 139, also has to do with the City of Mulberry.\nIt's an annexation bill.\nIt's mostly commercial properties, a few large tracks, and it's not uncommon for a city\nto come in and ask for an annexation after a formation.\nThere was a few commercial nodes with a city, was on one side of it, and didn't, was not\non the other side, encompassing that entire commercial node would help or would effectively\ncreate that commercial node, that character area, whether there's more development or redevelopment\nor just, you know, sustainability that's already been developed out.\nYeah, you have a question.\nWe're part.\nThank you, Mr. Chairman.\nSenator Dixon, is it not true that Senate Bill 139 violates the\nviola's of the local delegation that require any annexation related\nlegislation to require a majority of those who represent Gwinnett County\nbecause 950,000 or those who may live outside of the city of Mulberry,\nBut otherwise be impacted with respect to any sort of annexation that the city then, you know,\nlaterally takes from the county. Again, is it not true that the only way that Senate Bill\n139 is able to move is as a general bill, because again, it violates otherwise the rules\nof Gwinnett County local delegations bylaws that had bipartisan support.\nWell, what I would say to that is there's no violation of any rules of running a local bill as a general bill.\nI'm chairman of state government in the Senate and I think I've got four bills on the agenda today that were local bills that are run as general bills.\nSo it's quite common practice, I believe, here under the bill dome.\nAs far as I'm aware, not so much on the House side. Senator Dixon, is it not my last question?\nIs it not true that, you know, for me, personally, you know, I want to make sure the city of Mulberry\nsucceeds along with Gwinnett County, and I fear that continuing to move forward with these\nunprecedented actions that again could potentially undermine the will of nine hundred and fifty thousand\nclinicians as opposed to 40,000 that this will only continue to harm a\nrelationship that the city and county need for the long-term success of the city.\nYeah, you know what I would say is the county has a $2.67 billion budget which I\nmight add is going up 30% in the past two years. You know nine million that the\ncity of Mulberry captures is you know dropping the bucket to that plus you\nknow I would say that the services that the city will provide now that the\ncounty won't have to you know the net loss may be more like seven seven and a half\nso I don't see the impact to the entire county you know it is just that area\nand the city wouldn't exist if the board commissioners would actually listen to\ntheir constituents when they're concerned about zones they felt a lack of\nrepresentation they want a more local control and that's what they got this is not true\nsorry one one last question is it not true that Gwinnett County has this one of the few counties I have a\ntriple A bond rating no they have a triple A bond rating as far as them being one of the few I\ncouldn't speak to that okay leader registration has a question thank you mr. chairman sir isn't it\ntrue that all impacted representatives by Senate Bill 139 and all\nrepresentatives who represent Mulberry currently all support that. That's five\ndifferent representatives all support Senate Bill 139.\nMadam correct and isn't it true that Senate Bill 139 actually passed out of\nintergovernmental coordination with bipartisan support?\nThat is true. Isn't it finally true that when Mulberry was originally well that Mulberry is\nenjoyed by parts of support in the community and what is unprecedented is members who do not live\nin Mulberry do not live in the proposed areas to be added to Mulberry are attempting to the work\nthe will of the voters to ensure that Mulberry thrives. That is true and Mr. Leader I'm sure you\nheard the same was we were going through the process with incorporation heard from\nup team residents that were across the street from the city boundaries or a parcel next door that\nexpressed great interest in being annexed in the city. Was there another question?\nNo way. Okay. No more questions. Thank you. Thank you. Thank you, Mr. Chairman.\nSenator Brass, what bring you over here to this side of the building?\nWell, good morning, Mr. Chairman.\nI wanted to, number one, just come visit, you know?\nWe glad to have you.\nI just wanted to say hello.\nSee if you needed anything.\nI think a few folks want to be.\nI feel like I need 75 things from just one day, so.\nBut no, I wanted to see about getting SB 81 is on the last page.\nyour franchise dealer franchise update we hadn't done in about six years or at\nleast not a thorough one and this it was all or majority of of that bill was\npre-negotiated between the manufacturers and the dealerships and they get\nalong pretty good on this one and we worked out a few other details throughout\nabout the process and it's just ready to go.\nAs soon as you all are.\nGood.\nI don't see any questions, Senator.\nThank you.\nThank you.\nOK, any members of the committee have a request?\nOK, I don't see any.\nWhat we're going to do is set a calendar for our next legislative\nday, which would be tomorrow.\nSenate bill 81 have a move second any opposition it's on Senate bill 138 any\nopposition it's objection all those in favor say aye any opposed yes on Senate\nbill 139 moved in second any opposition there is an objection all those in\nfavor say aye.\nAny opposed?\nIt's on.\nThank you.\nThat'll set a calendar for us for tomorrow.\nAnd that'll get us started.\nAnd then we should have a good many more Senate bills coming out\nafter the clerk reports tomorrow.\nSo thank you all for adjourning.\n",
  "updated_at": "2026-02-12T17:59:05.21442+00:00"
}