{
  "video_id": "gqm9rqBVh0Q",
  "url": "https://youtu.be/gqm9rqBVh0Q?t=3355",
  "title": "Georgia House - Day 30 (2026-03-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 30,
  "video_date": "2026-03-17",
  "duration_minutes": 111,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 30 (2026-03-17) session:\n\n## Overview\nThe session featured a notable speech by a visiting pastor, who shared an encouraging story from the Bible and reflected on the work of the legislators. No major bills were passed, but the transcript suggests a thoughtful and reflective tone to the proceedings.\n\n## Key Actions\nNone.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- A visiting pastor gave a speech, sharing an encouraging story from the Bible and reflecting on the work of the legislators.\n- The pastor discussed the obstacles and problem-solving process the characters faced in the biblical story, drawing parallels to the legislators' work.\n- The pastor acknowledged the obscure aspects of the biblical story and encouraged the legislators to use their imagination to fully envision the scene.\n\n## Votes\nNone recorded.\n\n## Attendance\nNo explicit notes on quorum.\n\n## Adjournment\nThe transcript does not include details on the adjournment or the date of the next session.",
  "transcript": "\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I appreciate that introduction. Although I'm concerned since I've come here, everybody I've met has sounded incredulous when they've said, your nose pasture as if that's an unusual and unexpected thing. So we'll talk a little later. I wouldn't be able to cover that one. Mr. Speaker, I thank you for having me here. Members, I appreciate the invitation and the opportunity. And I want to thank you for the work and the service that you do. One of the things that's been fun here this morning.\n\nhearing about the way the schedule sets up and the various committee meetings. And my hunch is, because I know as a Georgia citizen and a voter, we don't have a clue what you do most all day long, right? And I empathize. I'm a pastor. I've been a pastor for 28 years. And in my 28 years, I've heard the same joke every day. And it goes something like this. What do you do the rest of the week? Just be quiet a job, working one day a week for about an hour. And I always say when you have that opinion, that's why I preach long time. I'm giving you your money's worth. But I'm not going to do that today. What I'd like to do in this time is bring you some encouragement and bring you a way of saying thank you for all that you do. What I'd like to do today is share a story with you, a story from the Scriptures. I am fond of stories and storytelling. I was blessed to grow up in a family of storytellers. One of the things about the Scriptures when you find it is that Jesus loved to tell stories. And they get us in it. The reason He tells stories is because they help us see ourselves in the story. So as I share this with you today, I'm going to invite you to use your imagination. I'm going to invite you to put yourself in the seat in that place. I know it was a long time ago. It was an ancient setting. It's their sum familiarity. And forgive me, I'll also give them to understand Uncle Dom that it may not be as far back for you as for others. But somebody asked me to share that along the way. So if you have any questions about the veracity of the story, you know who to ask in that one. Allow me to share with you a story. It comes from the Gospel of Mark in the New Testament. It's in chapter two. And I'm not going to read it to you verbatim. I'm going to pull some sections. I'd like to share this as a story. Most of you, and many of you have probably already heard it. But one of the things about those stories is I like to get into them and understand them a little better. And I hope that you'll find the encouragement I spoke about in this. In the story, we're told that Jesus is in the little town of Capernum, which is on the north shore of the Sea of Galilee. A few years ago, I had the opportunity to go to Capernum and to walk through the ruins. And if you've ever been there, the streets are incredibly small. The houses are very small. And we're told in the story that there are so many people packed in. Jesus is preaching from a house, probably standing in the doorway. And there's just no way to get any closer. Those narrow streets are full of people. And they're listening to the story. And you kind of have that image in your head. And then the next part we're told in the story is a long comes a group of folks who are bringing their friend to Jesus. He's paralyzed. He can do nothing for himself, but his friends. And as at least four of them, because we're told they're carrying the corners of his mat, but there may have been more. And they're coming to bring him to Jesus. They've decided we're going to take care of, we'll call him Bubba to give him a name. We're going to take care of Bubba. We're going to bring him in. And Jesus is going to see you. And so they come in. But the crowd is there. There's this obstacle. There's no way through that large bunch that's there. Now I know the members in this body are familiar with running into obstacles. You know what it is to have a plan and a goal. And suddenly something gets in the way and it doesn't work. And one of the things the wording of the scripture doesn't tell us, but if you've ever had any experience with human beings, you know this happened. They looked at the mess. They looked at the crowd. They knew what they wanted to do. And there's that one person in the group. I'm certain he said, well, it'll never work. Eure exists in every group somewhere, right? And that was, this is never going to happen. My soul just go home. It won't work. You had that other person in the group. I don't know who it was, but there's that person who is sure optimism with no practical application. You know, that was the person saying, we can do this. I have no idea how, but we can do this. And then you had that other person in the group. I'm absolutely certain whose skill is pointing out how everybody else's idea is wrong. They have no idea of their own, but everybody else's idea is wrong. And you can put in anybody in that. If you've been with a group of people, you know this to be true. If you find four people trying to make a decision as to where to go to lunch, then you know what happened here, right? And so somewhere, somebody, maybe it was a group decision, maybe there was that out of the box thinker, we don't know. There was the one that said, I know what we'll do. We'll go up on the roof. We'll go from above. And so evidently probably went around behind the house, climbed up onto the roof. And this is where, if, forgive me, to say it this way, the Bible annoys me. Because it says things so briefly, so lachonically, that if you don't stop and think about it, you don't realize the extent of what's happening. You're told they got up on the roof. Remember they've got a friend on a mat. And somehow they get him up onto the roof of this house. And then as you get down into the passage, in verse 5, you have this very easy passage. And it says, and they lifted up the roof above Jesus and dug through it. Now stop there for just a second. It's where I need your imagination to come with me some. Stop there. Because in the ancient world, you didn't spend time in your house. It was dark, it was small, it was cramped. As a matter of fact, like the old Drifter song, you went up on the roof, where the air was fresh and sweet. That was the best place to be. And so those roofs were solid constructions. They were usually interlocked timbers with dirt packed in tightly enough to be like concrete. By the way, Nol didn't tell you I'm an ex history teacher, so this could go a while. So just brace yourselves there. But they packed in the dirt on the... They packed in the dirt on those roofs and had these solid roofs. So there is no way that they just lifted the roof. It took some work to get in there. Now, here's where I need you to really come with me. To get into that roof and it says in the scripture, they dug through it. And we're not talking just a little scratching. I don't know if they had pickaxes with them. I don't know what they had, but it would have had to be some serious work. And you can't tell me those folks on a one story building above Jesus digging into the roof don't draw the attention of the crowd. I've seen whole congregations lose with a complete train of thought when a wasp, blew across the congregation. And everybody went, you know. So you know folks were watching the crowd up there on the roof. You know they were intently watching it. And this point nobody's listening to Jesus. It sounds blasphemous, but I am certain of it because that's what people do. They're all watching. And you know there's somebody out there going, y'all need to stop. Y'all go get in trouble. Do you know who owns this house? You better not dig into the roof of that house. And I imagine there's groups among the group that's up there digging. There's somebody going, y'all, maybe this wasn't a good idea. I imagine Bubba on his mat is thinking, I'm just going to get in trouble. Y'all just take me home. We'll try this another time. I don't want to be a part of whatever trouble is coming because of this. But they don't. They keep digging. And by this point, the other thing you have to picture is Jesus inside the building. He's not oblivious. If you can't take a pickaxe to the roof and not know somebody's up there. And they're hacking away. I imagine there's dirt coming down through the ceiling, drifting down on top of them. I imagine at this point in Jesus' stock, how do you go on? There's a point where you're interrupted and you can't go. My first church I served down in Chester, Georgia. I will never forget. I was preaching my sermon and my three-year-old son was on the back row. And he stood up and walker in his three-year-old voice said, Daddy, stop talking. I'm hungry. It would have been bad enough if there wasn't a chorus of amends that followed. So it kind of ended that service. And so I imagine in that pandemonium there's a stop. And I'd like to picture Jesus look it up. And they're heading to come that moment. Again, go a little further here. Heading to come that moment where they got a hole about maybe yay big in the roof. And somebody's face stuck in there and went, I can see him. We're almost there. Keep going. Because we're told they opened it up big enough to lower their friend in. This didn't happen in three minutes or two minutes. This was a massive effort. So they finally get the roof all the way open and they lower him down. And at this point, you know everybody got quiet. What's Jesus going to do? What are they going to say? What's going to happen at this point? And this is where I get a little frustrated. Sometimes the Bible as well. Because I want stage directions. Tell me what Jesus, what was the expression on his face? What did the crowd do? We don't get that. We're just told they opened it up and lowered him down. I imagine Jesus. And this is just me. I imagine a huge smile on his face. And I tell you why. How could you not look up through that hole at these crazy hair brain group that just dug through the roof? And they're all standing up. They're sweating and they're dirty and they're filthy and they're expectant and they're hopeful and they're grinning. And he looks up at them and he looks down at the friend that's on the floor. And you know somebody out in the crowd is going, they're going to get it now. And they did. He looks down at the man on the mat and looks up at them. And it says this in the scripture. This is to me one of the best parts of the whole story. This is at chapter 5 of Mark 2. When Jesus saw their faith, he said to the man, your sins are forgiven. Now there's a whole theological discussion about forgiving of sins and that sort of thing. We're not going to, that's not this time and place. And Jesus does go on to heal him. But I want to grab that passage when he saw their faith. As you remember the paralyzed man, he has no agency whatsoever. Like I said, he's probably going guys, let's just go home. But they brought him. They've lowered Baba down. He's there in front of Jesus and it's going to happen. And Jesus is looking up at those folks on the roof. And that's what I want you to grab today. He's looking up at folks who were determined. He's looking up at folks that overcame obstacles. He's looking up at folks who love their friend, who understood the need and did what whatever it took in the face of criticism, in the face of disagreements, in the face of anger, whatever happened in the face of a hard roof and a dull pickaxe. I don't know what all went on, but it was worth it to them to do so. And I think Jesus smiled for this reason because they were people after his own heart. For Jesus himself would later go on and show what leadership was all about when he took off his robe and washed his disciples' feet. Jesus would go on and show that leadership is like those folks on that roof. It's about sacrifice. It's about giving up of yourself for someone else, something that he would live out all the way to that cross. This is why I wanted to share that with you today. Every one of us runs into obstacles. And this body, probably more than most, has to deal with those things. And I want to thank you for that, not because I want you to struggle, but because I appreciate the sacrifice you make. And it may be that a lot of folks never see it, and it may be that a lot of folks never understand it. But the truth is, those folks who think outside the box, who manage to come together, because see, there wasn't one person carrying that mat. They couldn't be carried by one, two, or three, had to be at least four. It had to be a group. They had to come together, and there's no other way to make it work. And I thank you for making it work. I thank you for being willing to wrestle and being willing to struggle and listening to those around you and doing what needs to be done for the sake of folks who may not ever truly understand the work that went into it. And so I want to say thank you. And I hope you'll take that passage in the story today as an encouragement. You see, I think we're all called at some level at some time, at some point, to be a member of what I call the hole in the roof gang, those folks that stand up and dig the hole and bring their friends to where they're needed. And step out. Thank you for being that. Thank you for serving in that way. And thank you for all that you do. Today we pray. Almighty God, we come before you this day and thank you for the blessings that you have given us in such abundance. Blessings of bounteous resources and limitless potential. We thank you for the beauty and strength of our state and most of all we thank you for the wonderful people here who make it such a vibrant and special place. And we thank you for the holy privilege of serving them. Make that we would approach the tasks and challenges before us with your graciousness. Help us to see and appreciate one another through your eyes. Give us we pray the ability to will the best in all situations. Offer strength where needed. Flexibility and creativity in the face of challenge and encouragement in all things. May your wisdom be in our deliberations. May your creator's hand be in all we're tasked to do. And may your perfect love be in every word and thought. Use things we pray in your precious and gracious presence and in whom we put our trust. Amen. Would you join me in the Pledge of Allegiance? I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God, indivisible with liberty and justice for all. More keepers will unlock the doors. Members may greet the chaplain in the south any room. Chair recognizes chairman Hogan, the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, happy St. Pat's Day. And I've been to Ireland several times and I've never seen a snake over there. And each had the honor of getting all the snakes off of Ireland, supposedly. May the road rise to meet you, the great Irish blessing. And may the wind be always at your back. May the sun shine warm upon your face and the rain has fall soft upon your fields. And until we meet again, may God hold you in the palm of his hand. And a happy St. Patrix Day to you, Mr. Chairman. Sometimes I think I know where they brought the snakes though. Mr. Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, honor 59, is following me, establishes the order of business in the first part of the period unanimous consent and introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill 1571 by represent them. It claim to the 100th of Bill B. Todd and Act Amendment, part 4 of our 13th, chapter 6 and title 40 that this go to George Anzettin relating to Moe Peds. Insurance. House bill 1572 by represent Chocos of the 138th and year to the 150th Second Bill B. Todd and Act Amendment, the act to create the order of elections and registration. Intergovernmental coordination. House bill 1573 by represent them. Year to the 150th Second Bill B. Todd and Act to create the Worth County Building Authority. Intergovernmental coordination. The resolution 1028 by represent the claim to the 100th, scope field of the 60th Jackson, the 64th, the resolution honoring the life of Mr. Gregory Greg Slethal's senior. Transportation. That completes first readers. Second reading of bills and resolutions, the clerk will read. House bill 1564 by represent them. It was 149th of Bill's provide for the reapportionment of the election districts of the Wheeler County Board of Commissioners. House bill 1565 by represent Malau of the 160th. Stevens of the 164th, Gailier of the 160th Second Jackson of the 165th, Higgins of the 161st Bill to amend and act to create the Savannah Development and Renewal Authority. House bill 1566 by Rempere of House of the 170th. It bill to authorize the assessment and collection of a technology fee by the Probeck Court of Barian County. House bill 1567 by represent Cameron of the 1st and Hill of the 3rd. House bill to amend and act to provide for the election of the members of the Dade County Board of Education. House bill 1568 by represent Williamson of the 115th and Kirby of the 114th. It bill to create the Walton County Public Facilities Authority. House bill 1569 by represent Scott of the 76th Jackson of the 64th, Beverly of the 143rd. Davis of the 87th Scofield of the 60th. It bill relating to state flags, seal and other symbols. House bill 1570 by represent abstration of the 104th. It bill to amend and act to continue and recreate the state court of Gwyneth County. House resolution 1191 by represent Smith of the 133rd. Buckner of the 137th Resolution honoring the life of Reverend Dr. Martin Luther King Jr. and dedicating a road in his memory. House resolution 102 by represent Parish of the 158th. Resolution honoring the life of Sheriff Tyre Tyson Stevens. a dedicating a road in his memory House Resolution 1023 by Rep. Clark of the 108th resolution urging the Federal Railroad Administration to take action to regulate the blocking of railroad crossings House Resolution 1024 by Rep. Kirby of the 114th workies of the 157th Kenner of the 102nd Carpenter of the 4th and Park of the 101st Resolution Creating the House Study Committee on indexing maximum weekly workers compensation and dignity benefits House Resolution 1025 by Rep. Williamson of the 115th Attitude of the 150th Jones of the 47th Blackmen of the 146th plumbing of the 121st Resolution recognizing copper as critical to the state of Georgia and urging for its inclusion and the official United States Geological Survey Critical Minerals list House Resolution 1026 by Rep. Neil of the 74th Gamble of the 15th Carpenter of the 4th Washington of the 141st Smyred at the 135th Resolution Creating the House Study Committee on Economic Development Opportunities and Alternative Sources for Investment Funding House Resolution 1027 by Rep. Clark of the 108th and Smith of the 133rd Resolution Creating the House Study Committee on Railroad Crossing blockages Senate Bill 76 by Senator Albert of the 56th Robertson the 29th Dougan of the 30th Carp Patrick of the 32nd Kennedy of the 18th and others a bill relating to emergency communications authority and emergency telephone number 911 system Senate Bill 96 by Senator Jackson of the 2nd Robertson of the 15th Jones of the 10th Robin of the 5th a bill relating to Notaries Public Senate Bill 108 by Senator Davenport of the 44th Butler of the 55th Anderson of the 43rd Sims of the 12th Jones of the 10th and others a bill relating to Handi Cap Persons Senate Bill 167 by Senator Oryk of the 36th Butler of the 55th Jackson of the 41st Lucas of the 26th Jones and 2nd of the 22nd and others a bill relating to employees retirement system Georgia Senate Bill 171 by Senator Robertson of the 29th hours of the 56th Dougan of the 30th Harper of the 7th Melissa of the 53rd and others a bill relating to crimes and offenses Senate Bill 227 by Senator Jones of the 22nd of the 22nd Jackson of the 2nd and Anderson of the 43rd a bill relating to general provisions regarding eminent domain Senate Bill 267 by Senator Romano of the 5th Melissa of the 53rd Huffstattler of the 52nd Pellor of the 55th Jones of the 22nd of the 22nd a bill and others a bill relating to teachers retirement system of Georgia Senate Bill 279 by Senator Danderson of the 43rd Jones of the 22nd Lucas of the 26th Harper of the 15th Jones of the 10th and others a bill relating to state flag seal and other symbols Senate Bill 353 by Senator Thompson of the 14th Dougan of the 30th Beech of the 21st Albers of the 56th McNeill of the 3rd and others a bill relating to criminal procedure and driver's licenses Senate Bill 468 by Senator Jackson of the 41st Albers of the 56th Robertson of the 29th Paine of the 54th Jones of the 22nd and others a bill relating to Georgia state indivineification funds Senate Bill 470 by Senator Robertson of the 29th Albers of the 56th Dirkland of the 17th Kirkpatrick of the 32nd a bill relating to licensing of mortgage lenders and mortgage brokers Senate Bill 474 by Senator Summers of the 13th walk of the 30th 20th Harper of the 7th Goodman of the 8th Anderson 24th and others a bill relating to property tax exemptions Senate Bill 487 by Senator McNeill of the 3rd Brett of the 33rd Gooch of the 51st James of the 35th Kirkpatrick of the 32nd others a bill relating to insurance Senate Bill 491 by Senator Davenport of the 44th Jones of the 22nd Anderson of the 43rd Butler of the 55th Tate of the 38th and others a bill relating to revenue and taxation Senate Bill 498 by Senator Tipton of the 37th Miller of the 49th Dougan of the 30th Mulles of the 53rd Albers of the 56th and others the bill relating to general provisions relative to education and accountability Senate Bill 504 by Senator Robertson of the 29th Albers of the 56th and the Vartee of the 31st Mulles of the 53rd a bill relating to general provisions regarding bonds and recolidness Senate Bill 510 by Senator again in the 47th coutes of the 46th Albers of the 56th Anderson of the 24th Dougan of the 30th others the bill relating to instruction permits graduated licensing and related restrictions and temporary license relative to the operation of a motor vehicle Senate Bill 512 by Senator Payne of the 54th Albers of the 56th Burns of the 23rd House setler the 52nd Anderson of the 24th the bill relating to gambling but Senate Bill 516 by Senator Robertson of the 29th Mulles of the 53rd Anderson of the 24th Patrick of the 32nd Jackson of the 2nd others a bill relating to general provisions of solid waste management Senate Bill 537 by Senator Jones of the 22nd goodman of the 8th Jackson of the 2nd sims of the 12th rat of the 33rd others the bill relating to agriculture Senate Bill 539 by Senator Hatcher of the 50th Mulles of the 53rd Kennedy of the 18th Albers of the 56th Watson of the 1st and others the bill relating to wiretapping eavesdropping surveillance and related offenses Senate Bill 543 by Senator Halpern of the 39th parents of the 42nd Jones of the 10th Jordan of the 6th and Strickland of the 17th the bill relating to wrongful death Senate Bill 545 by Senator Halpern of the 39th Albers of the 56th Robertson of the 29th and in the birthday of the 31st Jones of the 10th and others the bill relating to competencies and core curriculum Senate Bill 553 by Senator Robertson of the 29th Gras of the 28th Jones of the 25th Al of the 48th Albers of the 56th and others the bill relating to general provisions of registration operation and sale of watercraft Senate Bill 556 by Senator Thompson of the 14th Albers of the 56th Duggan of the 30th Gute of the 51st Robertson of the 29th and others the bill relating to issuance, expiration and renewal of driver's licenses Senate Bill I 58 by Senator Gute of the 51st again in the 47th Duggan of the 30th Dixon of the 45th Watson of the 1st and others the bill relating to the Department of Transportation Senate Bill 565 by Senator Strickland of the 17th parapatch with the 32nd Jones and 2nd and 22nd Albers of the 56th and red of the 33rd Bill relating to procedure for sentencing and imposition of punishment Senate Bill 566 by Senator Berk of the 11th Huff Stettler 50th Second Watson of the 1st parapatch with the 32nd Duggan of the 30th and others the bill relating to insurance Senate Bill 572 by Senator Mulles of the 53rd Kennedy of the 18th Harveston of the 15th Gras of the 28th and Bill relating to taxes on tobacco and vaping products Senate Bill 573 by Senator Bras of the 28th Walker of the 30th of the 20th throughout the 29th and the 29th Abil relating to regulation and construction of hospitals and other healthcare facilities Senate Bill 575 by Senator Tipins of the 30th Heaven Bill relating to elementary and secondary education Senate Bill 576 by Senator Strickland of the 17th Bill relating to actions by grandparents and other family members for visitation rights Senate Bill 581 by Senator Walker of the 30th of the 20th again of the 47th due to the 51st Duggan of the 30th Miller of the 49th the bill relating to determination of boundaries Senate Bill 588 by Senator Miller of the 49th Albers of the 56th and other Barthay of the 31st Dicks and of the 45th Harveston Harbond of the 16th Bill relating to local boards of education Senate Bill 591 by Senator Hatchett of the 50th and getting to the 47th the bill relating to secondary metals recyclers Senate Bill 5603 by Senator Romano of the 5th and Hatchett of the 50th a bill relating to public school property and facilities Senate Bill 695 by Senator Barker of the 11th the bill relating to contributions or payments in lieu of contributions relative to employment securities Senate Bill 609 by Senator Malson of the 53rd Anderson of the 20th Port Sims of the 12th again of the 47th Jones and 2nd and 22nd others the bill relating to access to medical cannabis Senate Bill 610 by Senator Harrell of the 40th Berk of the 11th Duggan of the 30th Berk about the 50th watching the 1st and others the bill relating to medical assistance Senate Resolution 463 by Senator Duggan of the 51st Council of the 46th Kennedy of the 18th again of the 47th Miller of the 49th and others resolution creating joint study committee on the electrification of transportation Senate Resolution 596 by Senator Duggan of the 47th Duggan of the 30th Council of the 46th Miller of the 49th future of the 51st Nathers resolution honoring the life and memory of Mr. Isaiah Barry in dedicating an intersection in memory Senate Resolution 623 by Senator Tipens of the 37th Resolution proposing amendments of the Constitution of George and so as to provide a staggered four-year terms of office for some members of the Senate. Third-second readers there are no reports from standing committees there is no local calendar today so we're going on to morning orders going on to morning orders one minute each on morning orders here recognizes representative Roger Bruce see down here okay we'll come back to him representative Bennett is recognized for a morning order good morning Mr. Speaker and colleagues thank you and happy St. Patrick's Day to each of you on your desk you have a newsletter that is in starts with healthy choices and what is food equity when I made a report a couple of weeks ago I had one of our colleagues to walk up to me to tell me that he did not know about food deserts or food equity so I have provided this information and I just like to share just a bit with you food insecurity at least the food deserts in Georgia USDA defines food insecurity as a household level economic and social condition of limited and uncertain access to adequate food fresh fruits vegetables and fresh meats mix mix a difference in our health care Georgia currently ranks at the bottom quadrant in our health rankings compared to other states and so having access to food healthy foods in our community will help improve our health rankings so thank you Georgia for providing our farmers with an opportunity to bring foods to this to the urban and rural areas so we can improve our health rankings thank you chair recognizes representative Tyler Paul Smith for a morning order thank you miss speaker good morning ladies and gentlemen this house I rise today to recognize a very special guest we have among us today this young man tends my own beloved alma mater a gentleman in a scholar already majoring in mechanical engineering with a minor in Chinese achieved a great point average his first semester of 3.823 earning gold stars he displays on the collar of his uniform as citadel near as it's a hundred and eighty th birthday this come Sunday I'm hopeful and encouraged by young men such as Lauren Wiley McDonald the fourth the son of our very own colleague Lauren McDonald he intends to serve our nation in the Marine Corps upon graduation and he has definitely chose the path less traveled he embodies everything a citadel cadet should be cadet I'm proud of you and everything you will become please help\n\nme and welcoming Lauren Wiley Mcdonald the fourth to this house. Chair recognizes representative Holly Laura Morning Order. Thank you, Mr. Speaker. Hello colleagues. As you know, March is women's history month. And so it is probably best for us at this time where most of our teachers and even their students don't really see us as a unified body when they watch the news. But fortunately for so many of us, we know that we have women teachers who have poured into us. In Georgia, we have 826,000 women teachers in our public schools, our private charter schools, all the way from vocational, as well as even in the college sphere. So we just thank you. If we can't at this time, let's show them how much we love them. If you have a positive women teacher who has been able to help you out in your life, please let's rise to our feet and give them a hand clap of praise. Thank you. Are you the well? Chair recognizes representative Roger Bruce for a Morning Order. Thank you, Mr. Speaker. Quite often, you know, we come to the well to announce that somebody has left the planet. I come this morning to announce that we got a new person on the planet. I am so proud to announce that I have my first granddaughter. Nova, Marley Bruce is in the world. Thank you very much. Chair recognizes representative Jasmine Clark for a Morning Order. Thank you, Mr. Speaker. Let's talk about trains. Trains are absolutely essential to our economy. They transport our goods from point A to point B, so that those goods are available to all of us. I truly appreciate the value that our trains provide to all of us. However, I believe it is absolutely essential that when these trains are doing their business, that they work collaboratively with the communities that they travel within. Blocked railroad crossings due to stopped trains or train maintenance can cause significant disruption to communities and potential public safety hazards for emergency vehicles. However, communities have very little recourse to address these disruptions because trains are federally regulated and a federal railroad administration has no specific regulations regarding blocked crossings. I would like to urge the FRA to do more and I invite you to sign on to HR 1023 and urging resolution to ask the FRA to do more to stop blocked crossings in our communities. Thank you, Mr. Speaker. Chair recognizes representative Rebecca Mitchell for a morning order. Thank you, Mr. Speaker. I usually come up here with slightly heavier morning orders, but I have a delightful one this morning. I don't know how many people in this house have been here for the majority of their birthdays, but there is an eight-year-old right outside today who has been here for the majority of his. So if you have a moment to walk outside and say happy birthday to Zander, he would love to talk to you. And he would like you to know that he really loves seeing his own family reflected in the books in his school library. Thank you very much and I yield the well. Chair recognizes representative Wade for a morning order. Good morning colleagues. I rise to celebrate the Lumpkin County Women's Basketball team for being the triple A basketball champs for the state of Georgia. It's their first state championship. And one of the most special things about this team is they have been playing together as a team for a long time. They're all neighborhood kids and I'm just extremely proud of them in the community and since those first days in elementary school when they tied those laces. So just celebrate the Lumpkin County Lady Indians. Thank you very much. Okay, I'm going to ask all members to please take seats. Have a special order coming up. There is no time limit. Today is representative Susan Holmes and her husband Paul 60th anniversary. Is that correct? I'm one of the few people you know that remember that he played football at Georgia and I remember watching him play. I think they were on TV one time when he played different era than but y'all special people. Chair recognizes for a special order representative Susan Holmes. I'm going to ask all members once again, ladies and gentlemen, please suspend all members to please take seats. If you need to talk during this one, then take it outside please. Representative Holmes, you may proceed. Thank you, Mr. Speaker. I appreciate those kind words. I have really two full purpose in speaking to you this morning. It will be quickly. After 26 years in the political arena, 12 years is May of the City of Monticello, two in the federal government and 12 to serve as the state representative for my county's Jasper Jones, Monroe and Buds. I'm looking forward to finally retiring. I've been my honor and privilege to serve these fine folks and I'm very pleased that my friends Clint Crow and Dale Jasper will be taking very good care of them and will be providing the service that they deserve. I'm also proud of our state. This is the greatest state in the nation and I'm proud of the progress that's been made. I'm especially pleased about the New Rivian project that is slated the greatest economic development project for this state and the outstanding opportunities it presents for everyone in this state. Really looking forward to that being very close to my district. I want to thank so many of you for cherished friendships that Paul and I have made. We have loved working with you and we are looking forward to staying in touch with you. I also want to thank our speaker for doing an outstanding job of leadership. I appreciate him more and more every day. I also want to say thank you to my guys over in this corner. They have very patiently endured my many questions about where are we, what is this spell, what number is this. Please remind me to vote. Don't let me sleep. What is wrong with my phone? Why can't I get my messages? You guys are just the greatest there. Some fine, fine leaders over here and I just appreciate all your patience and love for me. The main reason I'm here today is I just want to say I give a special tribute to this good-looking man. You can stand up right all the way up. That would be fine. I just have to tell you and so many of you know this is the kindest, most thoughtful, most helpful, loving man that's ever been. He has been my life partner for 60 years. We met when I was a 16-year-old farm girl freshman at the University of Georgia and he and I had classed together and he was this big, good-looking, very popular football player. I mean I just felt head over heels and love with him. We were just very good friends therefore a couple years and then all of a sudden, well you know, 60 years ago on St. Patrick's Day we got married. It has been a wild, wonderful, loving, charmed, crazy ride. It has been so good. He's just one of the most special people. I have had a blessed charmed life because of this man. I just want to say and one of the main things I have to tell you all is he never lets a day pass that he doesn't say I love you and usually several times a day. I just want to say thank you. I love you and I'm looking forward to many more very exciting years together. Thank you. Thank you. What purpose does a chairman Collins rise? To make a motion? State's a motion. I move that Senate bill 76 be moved out of public safety and into motor vehicles, both chairman and agreements. Clerk will read the caption to Senate bill 76. Senate bill 76, Senator Albers, the 56 and others to be entitled to an act to amend Article 12 of Chapter 3, Title 38 and Part 4 of Article 2, Chapter 5, Title 46, the fiscal to Georgia Antietta relating emergency communications authority and emergency telephone number 9-1-1 systems. On the gentleman's motion that Senate bill 76 be transferred from the Public Safety and Homeland Security Committee to the motor vehicle committee, is there any objection? Chair, here's none and it is so ordered. Clerk will read the caption to a group of privileged resolutions. Recognizing commending, Dr. David Bridges. Recognizing commending the state of Georgia's Film Industry and Associated Businesses. Recognizing commending Alicia Gray. Congratulating the cross-country's Razorback Basketball team from winning the 2022 GHSA Class Triple A State Basketball Championship. And recognizing commending the leadership Putnam Class of 2022. And for other purposes that completes the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions that Chair, here's none and the resolutions are adopted? If you have signed up for an announcement, not quite to the end of the round, but getting close. If you have signed up for an announcement, be making your way to the front of the chamber. Chair recognizes Chairman Jasper's for an announcement. Thank you, Mr. Speaker. So we did the road medications the other day. And so people have been pulling on my shirt, Coatel. Can they still do one? Yes, you can. Every day, who is our road naming babysitter, and I taught this morning, get this sheet, each resolution in to legislative counsel, the conflict letter done. Our due date is on March the 30th, at 5 p.m. to get it on the Senate bill that we'll do. So you do have time. I'm putting one in today. So please take time to do that. Thank you. And I'm over here if you have any questions. Chair recognizes Representative Jasmine Clark for an announcement. My co-chair, Stephen Sains is having a conversation and therefore. All right. All right. I just want to invite everyone who is the age of 45 and under born in 1977 or later to a social kickoff tonight, or this afternoon at 4.30 p.m. at Reverb Hotel for the Georgia Future Caucus. Thank you. Chair recognizes Representative Holly for an announcement. All right. Thank you, Mr. Speaker. All right. Settle down. I know I'm a big deal. Okay. No, I'm just joking. All right. Just thank you. I want to remind everybody. I'm sure you all probably received an email. Unfortunately, had the opportunity to put together something last year. And now we're going to launch this. Thanks to the leadership who's long been here. Hopefully you all are able to join us for the launching of the Georgia Africa Legislative Caucus. It'll be tomorrow at 8.30. We'll do our press conference at these South Steps. And hopefully Georgia, as we expand our C-Port and AirPort will have a very positive opportunity to be able to highlight those 15 or 16 global 100 and Fortune 500 companies that are currently doing business there. You said it's an example for something more. So thank you 8.30 tomorrow. South Steps. And I appreciate you all and have a very blessed day. Chair recognizes Chairman Collins for an announcement. Thank you, Mr. Speaker. The Public Safety and Homeland Security Committee, Gerald Green subcommittee, will meet today at 1 o'clock. 406 CLOB. We have a couple of bills to hear. Thank you. Chair recognizes Representative Cannon for an announcement. Thank you, Mr. Speaker. Hi there, members. I just wanted to announce that there are families who are grieving and who are mourning who are here in the Capitol today. You might have already seen them on the stairs. I just wanted to ask that if you are a praying person that you pray with these families, they are asking for some justice. And even if it's not the issue that you believe should be discussed right now, Andrew Smurner's life, Jimmy Achensen's life, lead in Boykin's life, are who they are here mourning today. Thank you very much. Chair recognizes Representative McClain for an announcement. Thank you, Mr. Speaker. Just want everyone to join us for the Zoom W Working Family Caucus meeting. You can pick up your lunches in Room 307. And we are going to start at noon. So please pick up your lunches in Room 307. And we are going to start our Zoom meeting at 12 o'clock. Thank you, Mr. Speaker. What purpose does Representative Grabley rise? I don't know if it'd be a point of personal privilege or a parliamentary increase, sir. Parliamentary inquiry? I think so, yeah. I failed to sign up for the announcements, but that everybody over 45 would meet tonight at 545 at the Cracker Barrel. And we'll be meeting in 545. Yes, sir, so that we could be home and in bed by 19. Yeah. And the meeting the social will be over by 630. Yes, sir. Thank you, sir. I see a chicken and dumplings for our nerves and drinks. We have a birthday today. Listen up, we have a birthday today. A St. Patrick's Day birthday. How cool is that? Please join me in wishing a happy birthday to Chairman Mark Newton. Chair recognizes the majority leader of this house for a motion. Thank you, Mr. Speaker. Mr. Speaker, I moved to this house standing adjournment until 10 a.m. 10 a.m. Friday, March the 18th, 2022. The majority leader has moved that this house be adjourned until Friday, March 18th at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. Let's put it on the board. Just teasing the eyes do seem to have it. So this house will be adjourned until Friday, March 18th at 10 a.m.",
  "updated_at": "2026-02-13T22:19:04.716118+00:00"
}