{
  "video_id": "GrYL9AStWi8",
  "url": "https://youtu.be/GrYL9AStWi8",
  "title": "Georgia House - Day 22 (2026-03-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-03-02",
  "duration_minutes": 57,
  "summary": "Here is a summary of the Georgia House session from 2026-03-02:\n\n**Overview**\nThis session focused on substantive legislation, including a bill to combat human trafficking and another to allow certain medical professionals to incorporate as a professional corporation.\n\n**Key Actions**\n**HB 823**: Requires the Georgia Department of Driver Services to permanently revoke the commercial driver's license (CDL) of an individual convicted of using a commercial motor vehicle to commit the offense of trafficking a person for labor or sexual servitude.\n\n**Bills Introduced (First Reading)**\n- HB 816: Allows chiropractors and medical doctors to incorporate as a professional corporation when practicing together.\n- HB 578: Authorizes the Department of Human Services and its contractors to receive conviction data on volunteers, students, and interns to ensure they pass criminal background checks.\n\n**Notable Moments**\n- Representative Houston Gaines presented HB 823, noting Georgia's high rates of child sex trafficking and the need for additional tools to fight this issue.\n- Representatives expressed bipartisan support for HB 823 and the efforts of First Lady Marty Kemp to combat human trafficking.\n- There was discussion of a recent incident in Columbus where truck drivers helped rescue a young trafficking victim.\n\n**Votes**\n- HB 823 passed with a vote of 166-0.\n- HB 578 passed with a vote of 166-0.\n\n**Attendance**\nA quorum was present, and no issues with attendance were noted.\n\n**Adjournment**\nThe session was adjourned. The next session will be held on a future date.",
  "transcript": "Section 16, 546 in 45, 151 of the fiscal to Georgia annotated relating the trafficking of persons for labor or sexual servitude.\nChair recognizes representative Houston Gaines to present the bill.\nThank you, Mr. Speaker. Today I bring House Bill 823. Over 3600 children are sold for sex in Georgia every single year.\nThe average age victims are brought into the sex trade is 12 to 14 years old and\nAtlanta's been named by the FBI as one of 14 U.S. cities with the highest rates\nof child sex trafficking. This legislation provides one more tool in our fight in\nthis state and the fight against human trafficking. We must work together to bring\nthis evil industry into the light and provide a safe haven for victims across the\nstate. House bill 823 brings Georgian\nalong with a recent federal rule\ncompleted this summer. The federal\nrule revised the list of offenses\npermanently disqualifying individuals\nfrom operating a commercial motor\nvehicle for which a commercial's\ndriver's license or commercial's\nlearners permit is required. This\nrule reflects a change made by\nCongress and the no human trafficking\non our Roads Act which prohibits an\nindividual from operating a commercial\nmotor vehicle for life. If that\nindividual uses a commercial motor\nvehicle and committing a felony involving human trafficking.\nThis legislation will ensure Georgia comes into compliance with this federal rule and\nwill authorize the Department of Driver Services to permanently revoke an individual CDL\nlicense upon conviction if they use the commercial motor vehicle while committing the offense\nof trafficking a person for labor or sexual servitude.\nThis legislation comes on behalf of First Lady Marty Kemp as we all work together to bring\nhuman trafficking in our state to an end.\nwe must fight back against those who victimize our state and I believe House Bill 823 is another\nstep in tool to assist us in the fight against human trafficking and I would ask for your\nfavourable consideration. Mr. Speaker, I'm happy to answer any questions.\nYou have a question if you care to yield. I do. Chair recognizes Chairman Welch,\ndo you're left for a question? Is gentleman yield? I will. Thank you for bringing this legislation\nAnd I want to just express my gratitude to you to the members of this House and to First Lady Kim who are leading the charge that has been needed and been worked on by this House and by the Senate for the last decade or so, but I'm really proud of her I'm really proud of the administration for taking on this as a frontline initiative of the administration and I wish her and you all the success of the world with this measure. Thank you for bringing it to the House.\nThank you.\nDo you further you?\nOh, you're for one more.\nChair recognizes representative Butler to your left for a question.\nThank you for bringing the bill.\nSaturday in Columbus, we did a ceremony to bring attention to the problem.\nAnd I learned following the ceremony that it was indeed truckers that helped save the life of a young girl.\nOne trucker saw something unusual, put it out on the network and called for backup.\nback up and they were able to circle around the truck that had actually lured a young\ngirl into one truck. They were able to circle around that truck, stop him and keep him from\ngetting across the state line. So there are great people out there trying to help out\nand thank you for this bill because I think it will help as well.\nThank you so much. Mr. Speaker, I yield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered. The chair hears none. The previous question is ordered. Is there any objection\nto adopting the committee substitute? The chair hears none. The committee substitute\nis adopted. Is there any objection to agreeing to the report of the committee, which was\nfavorable to the passage of the bill? The chair hears none. The report of the committee\nis agreed to. Shall this bill now pass? All those in favor of the passage of House\nbill 823 will vote I. Those opposed to vote no and the clerk will unlock the machines.\nhave all members voted? Have all members voted? If so, the clerk will lock the machines on\nthe passage of House Bill 823. The eyes are 166. The nays are zero. This bill having\nreceived the requisite constitutional majority is therefore passed. Clerk will read the caption\nto House Bill 578.\nHouse Bill 578 by President Dempsey of the 13th and others to be entitled to act to amend\nArticle 1 of Chapter 2, Title 49 of the Bishop of the George Anatetti relating the general\nprovisions regarding the Department of Human Services, so is to provide for the review\nof certain law enforcement conviction down to this bill and referred to the Committee\nYou know, Health Human Services, that committee recommends\nthat this bill do pass by committee substitute.\nChair recognizes Chairman Dempsey to present the bill.\nThank you, Mr. Speaker.\nGood morning.\nHouse Bill 578 is a compliance measure brought to us\nby the Department of Human Services.\nIt will authorize the department and its contractors\nto receive conviction data on volunteers, students,\nand interns utilized by the department and its contractors.\nThe statute has not been updated to keep pace\nwith the department's need to ensure that any person working\nor providing services on behalf of the department\nthat has access passes a criminal background check.\nThe consequences of this not passing actually\nwill be that the department will not be able to fully vet\nthrough fingerprint-based background checks everyone\nthat has access to these clients,\nthe client's confidential information,\nthe information systems and other information\nthat is confidential or protected in nature\nor required by law,\nbecause current statute limits the types of employees\nwe can conduct fingerprint background checks on.\nThe FBI recommends amending the state statute where possible rather than relying on the federal\nstatute.\nIt is important that the language not be changed one bit, not one comma, not one period.\nIt is all been approved by the FBI and we'll go back to them for their sign-off on as well\nonce we pass it here.\nIf there are any questions, Mr. Speaker, I will take them.\nIf not, I will yield the well and ask for your favorable support.\nhave no questions. Thank you. I yield the well. Is there any objection to the\nprevious question being ordered? The chair hears none. The previous question is\nordered. Is there any objection to adopting the committee substitute? The\nchair hears none. The committee substitute is adopted. Is there any objection to\nagreeing to the report of the committee which was favorable to the passage of\nthe bill? The chair hears none. The report of the committee is agreed to. Shall\nWhile this bill now pass, all those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nhave all members voted. If so, the clerk will lock the machine on the passage of House\nBill 578, the eyes are 166. The nays are zero. This bill, having received the requisite\nconstitutional majority, is therefore passed. Clerk will read the caption to House Bill\nbill 816.\nHouse bill 816, member of the Senate of May the act, the 73rd and others to be entitled\nan act to amend Code Section 147 for the fiscal to Georgia and to be related to professional\nservices in which a professional corporation may engage.\nThis bill I have referred to the committee on regulated industries that committee recommends\nthis bill do pass.\nChair recognizes Representative Mathy Act to present the bill.\nThank you, Mr. Speaker, and good morning.\nToday, I bring before you House Bill 816,\nthis bill simply gives caripractors and medical doctors\nanother way to incorporate and practice together.\nCurrently, they incorporate as an LLC,\nand if they practice together,\nThis would allow them a way to incorporate\nas a professional corporation.\nMr. Matos, Mr. Everhart, Mr. Reeves,\nco-sponsored and passed House Bill 316 in 2015,\nallowing optometrist and ophthalmologist\nto practice together.\nSo this is a little similar.\nThere are no questions, Mr. Speaker.\nI'll yield the well.\nAnd I ask for your favorable consideration.\nYou have a couple of questions if you care to yield?\nYes, sir.\nChair recognizes representative Jasmine Clark\nto your left for a question.\nYes, ma'am.\nThat's a generality yield.\nYes, ma'am.\nJust a quick question.\nHow will this affect billing and insurance for patients?\nIf they go to their in-network doctor,\nbut they're seen by the chiropractor,\nor if they're seen by both the doctor and the chiropractor,\nAre they going to get two separate bills from their insurance company?\nI believe that that will be how the clinics will set their businesses.\nThat's two separate licenses.\nSo I assume it would be two separate billing procedures.\nDoes the general lady for the year sure is there any way to protect patients by notifying\nthem ahead of time that if they were to go to a doctor slash tire factor that they\nwould in fact or could in fact receive two separate bills, one where their\ninsurance actually does cover it and one where the insurance may not cover it\nin the case of a tire factor. Yes, ma'am. I believe that that's what the\ninsurance department of those clinics would clarify that with the patient.\nThank you. Thank you. Do you further yield? Yes, sir.\nChair recognizes representative Rodgers to your right for a question.\nThank you, Mr. Speaker.\nWill the general lady yield?\nYes, sir.\nIs it not true in regards to the lady's question that the person does not have to see either\nthe doctor or the chiropractor if they go to see the doctor, the doctor recommends the\nchiropractor.\nIt's up to the patient's own option as to whether they're going to exercise seeing the\nperson or not.\nYes, sir.\nI would imagine.\nAnd will you further yield?\nYes, sir.\nthat probably at that time that they would be advised that there would be separate\nbilling. Yes sir. Thank you ma'am. Thank you. Do you further you? Yes sir I'll take\none more question. Chair recognizes representative Dickerson to your left for a\nmy question.\nNo, it was on.\nThere.\nI think it went off.\nOkay, it's back on.\nCould you tell me what your profession is?\nI am a character by the way.\nThank you.\nAnd I will yield the well and I ask for your favourable consideration.\nThe lady is yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nYou\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of House Bill 816.\nThe eyes are 161.\nThe nays are five.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe are going to read the caption to House Bill 914.\nHouse Bill 914, members, and a clerk of the 147th and others to be entitled to amend Title 43, the Fisherhood of George Annotated Related to Professions and Businesses,\nso as to provide for military spouses licensed in other states.\nThis bill I refer to the committee on Governor and Affairs.\nThat committee recommends that this bill do pass by committee substitute.\nYou\nChair recognizes Chairman Heath Clark to present the bill.\nThank you, Mr. Speaker.\nMembers of the House have HB914 before you today.\nThis is an effort to piggyback on what Representative Al Williams started a few years ago.\nIn our nation, we're experiencing record unemployment in Georgia.\nIt's at 3.2 percent nationwide, about 3.3 percent.\nAnd this is great, except for one group of people, and that is the military spouse.\nCurrently in our nation, the unemployment rate for military spouses is about 16 percent.\n34% of military families live paycheck to paycheck and they depend on two incomes.\nThe military family is ten times more likely to move than a normal civilian family.\nThey transition about every two to three years.\nSo what we have today is a proposal that will require our boards that oversee professional\nlicenses if a military spouse has a professional license in another state with significantly\nsimilar requirements that our boards will endorse that license so that military spouse\ncan get to work immediately in our state.\nThis would remove undue burden of having to apply, pay, take other exams over again, classes\nover again, a significant cost to these families, and the whole time while they're dependent\non two incomes to survive for their financial needs and stability, that that person is not\nable to work when they come into our state.\nYou compile that with the fact that they're only going to be here for two to three years\nin many cases, and if it takes a year or longer to get that license in this state that they've\nalready obtained in another state, then it becomes hard to get hired by an employer because\nas an employer is looking at the investment cost\nand they're gonna lose that investment within a year.\nSo HB914 is a step to remedy this problem\nand help military spouses get to work immediately.\nThere are some provisions that would,\nif they violate the professional standards,\nthey would lose that endorsement\nand notify the state that the license originated\nthat they could take action in that state if they see fit.\nIf there's a Georgia specific exam that goes over the rules\nthat are unique to our state and laws or regulations,\nunique in our state, they would have to pass that exam as well.\nBut with that, Mr. Speaker, that's the bill,\nand I will stand for any questions.\nYou have no questions?\nWell, I will yield the well\nand ask for your favorable consideration.\nChair recognizes representative Owl Williams to speak to the bill.\nThank you, Mr. Speaker.\nI say I want to thank the gentleman for this bill.\nThis was a bill that was introduced by me about four years ago as first just for clarification.\nIt has been well explained the purpose of this bill. We really should not have to be\neven standing here this morning. Because patriotism goes beyond saying you a\npatriot and saluting the flag and tearing up on certain words. The folk that\nhave not followed the intent of this bill should be ashamed of themselves\nbecause the only difference in this one is is saying Shell. They had the\nopportunity to do right by these spouses from day one and they did\nthe same thing they had been doing and that's just keep passing them on. Can't do this to people\nwho have served their country and who've trailed their husbands or wives all over the world.\nA highly young lady who was a registered nurse came to Liberty County, could not get hired,\nchanged professions because they couldn't do her paperwork and after six months of waiting,\nShe went into another profession.\nWe shouldn't have to be doing this.\nIt's bad when we have to make folk do the right thing.\nSo I don't even want, I know some folk that didn't do right.\nDon't stand near me and sing the National Anthem.\nAnd go back home and act like, well, I won't even say that\nfrom this gracious floor.\nBut it's a crying shame that we have to do this.\nThe run we cross I would make, and I'll apologize\nto the gentleman for not having said this,\nbut this bill was originally the Tracy Rainey Bill,\nnamed for Tracy Rainey, the wife of now Lieutenant General\nJim Rainey, who was an untying advocate for the spouses.\nAnd to honor her, I've injected the name Tracy Rainey.\nShe flew back from a graduation at Ohio State\nto be here when the governor signed this bill.\nAnd I would certainly hope that when we get to the Senate,\nwe ask them to restore her name to this bill.\nBut most of all, we need to let our constituents\nwho are in position to hire people,\nwho the bureaucracy seem to run everything,\nto do the right thing by military spouses\nand do what you should have been doing\nfor the last four years,\nand people wouldn't be here having to have this done.\nWith that, Mrs. Speaker, I yield the will.\nIs there any objection to the previous question being ordered?\nThe chair here is not and the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is not and the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee which was favorable to the\npassage of the bill?\nThe chair here is not.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of House Bill 914?\nWill vote aye, those opposed to vote no,\nand the clerk will unlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the\nmachine on the passage of House Bill 914. The eyes are 165. The nasal zero. This\nbill having received the requisite constitutional majority is therefore\npast. The clerk will read the caption to House Bill 486. House Bill 486 by\nRepresentative Washburn and the 141st and others to be entitled to an act to\namend chapter 14 in Title 43, the physical to Georgia and\nattended relating to electrical contractors, plumbers, conditioned air\ncontractors, low-volt contractors, and utility contractors. This\nbill I refer to the committee on regulated industries. That committee recommends\nthis bill do pass by committee substitute. Chair recognizes representative Washburn to present the bill.\nThank you, Mr. Speaker. Ladies and gentlemen, the House, I present House Bill 486,\nThis was asked to do with a plumbing license here, a master, and a gentleman plumbers\nin advertising.\nThe bill simply prohibits someone who does not have either of these licenses from advertising\nthat they do.\nWhat the bill does not do is add any requirement for additional license here for some folks\nthat might have concerns about that.\nIt simply says if you don't have the license, you cannot advertise that you do.\nIt is a good bill that protects these people who have spent the time and energy and the\nmoney to become licensed in this important business and also protection consumers.\nSo I urge your favourable consideration of this bill and miss speaking on a yield for any\nquestions.\nYou have a question, did you care to yield?\nYes, sir.\nI will.\nChair recognizes the chairman of the Agriculture and Consumer Affairs Committee Chairman\nMcCall to your right for a question. Thank you, Mr. Baker. Gentlemen, you. Yes, I will.\nIt is not true that I'm in favor of you, Bill, but I just want to make sure that there's nothing\nin here that prevents a person from doing work on his own property. That is correct, Mr. Chairman.\nThank you for the question. Thank you. You have no further questions. I yield well. Thank you,\nThank you, Mr. Speaker.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to shall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no, and the clerk will unlock the machines.\nhave all members voted, have all members voted, if so the clerk will lock\nthe machine on the passage of House Bill 486. The eyes are 158. The nays are six. This\nbill having received the requisite constitutional majority is therefore passed. Clerk will read\nthe caption to House Bill 972.\nHouse Bill 972, by revs, and have housed into the 170th and others to be entitled to enact\nto amend Article 5 of Chapter 2 of Title 46 of the official bill of Georgia, annotated\nrelating to miscellaneous offenses and penalties, which is just to provide for penalties for violation\nof pipeline safety standards.\nThis bill had been referred to the Committee on Energy, Utilities, and Telecommunications.\nthat committee recommended this bill do pass\nby committee substitute.\nChair recognizes Chairman Hausten to present the bill.\nThank you, Mr. Speaker.\nThis legislation will bring the PSC fines\nfor pipeline operators who in violation\nto mirror the federal fines.\nSince our state-manned fines have been different\nfrom the federal guidelines,\nThey've encouraged us for several years to update our fines.\nAnd we have it in the last two years,\nthey've been deducting points that affect\nhow much reimbursement we get.\nI don't know if we can't reimburse them,\nbut how much money we get from the federal government\nfor doing this.\nI don't think we really get ever get reimbursed.\nBut anyway, there's no opposition to this bill.\nThere's, this does not have any effect\nthe operators who operate call to dig what this bill would do would give us more money\ncoming into the state from the federal government and I asked for your federal, I asked for you\nto please pass this bill. It has been a long day already, but let me tell you, nobody's\nopposing this bill. In fact, we had Atlanta Gaslight testified in front of\ncommittee. They were for it. This has absolutely no opposition. And I would\nappreciate it if you vote yes. Any questions? Thank you. You have no\nquestions. Thank you. And I'll leave you. Bye.\nNobody would dare.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nchair here's none. The report of the committee is agreed to. Shall this bill now pass all\nthose in favor of the passage of House Bill 972 will vote aye. Those opposed to vote\nno and the clerk will unlock the machines.\nAll members voted have all members voted if so the clerk will lock the machine on the\npassage of House Bill 972. The eyes are 164. The nasors zero this bill having\nreceived the requisite constitutional majority is therefore passed. The clerk\nwill read the caption to House Bill 861. House Bill 861, representative wheat\nhour of the 119th. We titled an act to men chapter one, title 40, the fiscal\nof Georgia and it's heading relating the identification and regulation of\nmotor vehicles. So as to amend certain definitions relating to commercial\ncarriers, this bill ever referred to the committee on motor vehicles. That\ncommittee recommends that this bill do pass. The chair recognizes\nRepresentative Weedower to present the bill.\nThank you, Mr. Speaker.\nColleagues, today I bring to you House Bill 861, which is a Georgia State Patrol Agency\nBill.\nLet's say a carriage transport truck is heading south on I-75 and it gets pulled over\nand ticketed for speeding by one of Georgia's finest apron troopers.\nUnfortunately, with the current definition of commercial motor vehicle,\nthat same Southbound truck only delivers within the state of Georgia,\nthat's supervised well state in this cruiser and watches that truck joyfully pass right by.\nYou see, there are some sharp lawyers out there getting their clients out of citations\nbecause the current definition of commercial motor vehicle states that the vehicle has to engage\nin inter and intra state commerce.\nOn line 11, you'll see by changing and to ore and adding\nore both, this bill will close that loophole\nand allow for the appropriate enforcement of citation.\nOur troopers have all the capability in the world,\nbut I'm married with convictions.\nWe'll leave our troopers without hope of enforcing the law.\nMr. Speaker, I'll stand for any questions.\nYou have some questions.\nOh, you.\nI'm just waiting till they finish piling up up here I mean chair recognized as\nchairman Watson to your right for a question thank you mr. Speaker does\ngentleman you hi do your bill mentions interstate and interstate commerce\ncould you explain to me how our interstate system is related to the\ncirculation of orders across our state.\nWell, they begin in the same way.\nThey just keep cyclically going.\nThey never end.\nSo one state to the next, they're interconnected\nfrom pond to pond.\nVery good.\nThank you.\nChair recognizes Chairman Rhodes to your right for a question.\nAs a gentleman, you.\nI do.\nOK.\nI heard in the definition something about a carriage.\nDid the old definition include horse-strong carriages?\nIt did.\nOK, does the gentleman further you?\nI do.\nOK.\nWill this create a dualism problem for us?\nNo, actually, in fact, it does speak to that.\nIt actually does speak to that theory of dualism.\nSometimes it's either or, but sometimes it's both.\nChair recognizes Chairman Fleming to your left for a question.\nThank you, Mr. Speaker.\nTo the gentleman in the well, you and I had a conversation about this bill as in the rules\ncommittee of the day and at that time I asked you a question which you would not prepare\nto answer.\nSo I'll repeat it for you now.\nCan you tell me the relation between this bill and its possible effect upon a barotian\nfour?\nYes, sir. I do believe that the brochure for again if you were to sit Ali by they would have to sit\nAli by and watch as it passed through if they're not equipped with the right tools to engage in the citation\nChair recognizes representative prints to your left for a question\nIs it not true that this measure could be a reflection of the concept of dualism?\nThe gentleman is correct.\nLike I said, sometimes it's not one or the other, but sometimes it is both.\nThank you for this measure.\nThank you.\nMr. Speaker, if there's no more questions, I will yield the well.\nWell, you have some more, but you answered the ones from Chairman and from Representative\nPrince.\nYou yield the well?\nYou did the well. Thank you.\nGentlemen has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none. The previous question is ordered.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of House Bill\n8.61 will vote aye. Those opposed will vote no and the clerk will unlock the machines.\nall members voted? Have all members voted? If so, the clerk will lock the\nmachines on the passage of House Bill 861. The eyes are 163. The nays are\ntwo. This bill having received the requisite constitutional majority is\nis therefore passed.\nClerk will read the caption to House Bill 968.\nHouse Bill 968 by Representative\nAbstration of the 104th and others to be entitled\nand act to amend Article 3H,\nChapter 3, Title 9 of the fiscal\nto Georgia and Tate of Relating\nto limitations on recovery for deficiencies\nconnected with improvements to reality.\nMr. Bill, I refer to the Committee on Judiciary.\nThat Committee recommends that this bill do pass\nby committee substitute. Chair recognizes chairman effustration to present the bill.\nConsidering the recent opinion of southern states versus Tampa tank, I want to thank you Mr.\nSpeaker for allowing me to present today House Bill 968 to you members of the Georgia House.\nWhat this opinion gave us from the Court of Appeals is that expressed warranties that\nare contractually agreed to fall under the Statute of Repose, which is an 8-year limit\nin time.\nSo effectively, what happens is, let's say you have a contractual agreement for a 25-year\nwarranty on your roof.\nThis opinion means that under Georgia law, that warranty is only valid for 8 years, regardless\nof what the contract was.\nSo it's very important that we bring legislation\nto address this, and I'll quote on your desk,\nyou can see commentary from Consumer Advocate Clark Howard,\nwho said, I'll just quote here,\nnow the reality is it's up to the state legislature\nwhen they come back next month to fix this.\nBecause if you and I, as consumers,\nspend big money on our home,\nand we expect that the work we have done\nis going to be protected by warranty coverage,\nthen the company that gave us this warranty\ncan say, well, in Georgia, even though we said we were going to give a warranty for that\nlong, we don't have to. That's a stunner. And I don't understand how the Court of Appeals\nmade this decision that they did, but the legislature needs to fix it. So it's with\nthat in mind that I bring this to you today, would be happy to answer any questions, but\nI don't expect on this important issue that will be any quarrel.\nDo you yield for questions?\nYes, Mr. Speaker.\nChair recognizes Chairman Fleming to your left for a question.\nThank you, Mr. Speaker, to the gentleman in the well.\nMr. Chairman, I appreciate you bringing this measure,\nand I think you would agree with me that we particularly need to thank Clark Howard\nfor the attention that he brought to this measure.\nBut also, we need to recognize Jeff Lewis of Arnold Golden and Gregory\nand to put it in Carl Lillian terms, he is a rather large bovine in this area and particularly\nas it relates to things dealing with altruism and we need to thank him, is that not true?\nMr. Lewis is a partner at the law firm of Arnold Golden and Gregory and a distinguished\ngentleman and individual who helped greatly with this important issue and was willing to\ntestify in your committee, Mr. Chairman and I think that's very appropriate.\nThank you very much for bringing this legislation but to a non-lawyer such as myself and I apologize\nfor not having asked this question in the rules committee, is this fix the contracts\nthat were previously engaged in or is this just moving forward in time?\nWhat this does is it makes clear in Georgia law that the objective is for statute of\nrepose to not to apply to contractual warranties.\nThat would include warranties that are currently in effect and that would certainly involve\nwarranties going forward, so it would be both.\nBecause we're doing this not for us, but for all Georgians.\nI think that this is a very important measure to ensure that it's clear that the statute\nof repose doesn't apply to existing contractual warranties.\nMr. Chairman, further a year.\nYes, sir.\nSo on behalf of all the consumers of Georgia, I appreciate your work on this as well as\nMr. Lewis and those other learning attorneys that help educate business guys like me and\nAnd also for all the affected parties, it could be roof warranties, home roof warranties,\ncopy and machine warranties, anything, as I understand it, this has previously been\nagreed to, the contract paid for eight years in excess.\nThis allows both parties to enjoy the benefits of the contract.\nThat's correct.\nGentlemen's correct.\nAnd if you look at line 33, it makes clear that that's on or after the date that the\nThis statute was previously and originally passed.\nThe statute that was subject to interpretations, yes sir.\nI can't answer my questions.\nMr. Speaker, I know the hours late, so I'll yield the well, ask for the member's favorable\nconsideration.\nGentlemen, as yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the Committee Substitute, the chair here is none.\nThe Committee Substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nChair here's none the report of the committee is agreed to shall this bill now pass all those\nin favor of the passage of the bill will vote aye those opposed to vote no and the clerk will\nunlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the machines\non the passage of House Bill 968. The eyes are 165. The nasor zero. This bill having received\nthe requisite constitutional majority is therefore passed. House Bill 378 was carried forward\nfrom the last day we were here to the next legislative day. It will now be carried\nforward to a date certain and that day will be Monday March 9th. That's House Bill\nthree seventy eight. Chair recognizes representative Henson for a morning\norder.\nIsn't it, does this compete with Chan easily teach?\nI don't think so.\nGood afternoon.\nI'm just going to make this short and sweet.\nSo you can tell I'm going to recognize someone.\nI'm going to recognize women in construction.\nAnd we have some up there.\nAnd this is Women in Construction Week.\nNow, just to mention something, that only 10% of people working in construction are women.\nIt's a very male-dominated field, but I know they're making a great impact.\nThey're making a great difference.\nWe're going to bring more women into the field.\nThank you so much for being down here today.\nThe clerk will read the caption to a group of privileged resolutions.\nRecognizing commending judge William H. Bow McLean on its outstanding public service\nin the spirit court of Douglas County, recognizing commending judge Peggy H. Walker on her outstanding\nservice as a Douglas County juvenile court judge, recognizing commending\nDeVitrian D. Calwell, one of his outstanding public services, a member of the\nDouglas County Board of Education, recognizing commending judge Eddie Barker in\nhis outstanding service, honoring congratulating Mrs. Naomi and Evans on the\nremarkable occasion of her 90th birthday, recognizing commending Kennedy\nSimone Demon, congratulating the North Hall High School Trojans wrestling team for\nwinning the 2020 GHSA Class 3A dual state championship, recognizing commending\nMadison B. Todd, recognizing February 11th, 2020 is Georgia Farm Bureau\nFederation Day at the State Capitol, commending the Chisholm leadership\nAcademy, recognizing commending by\nPresident-Chief Dr. Joule Howard Taylor,\nrecognizing commending Victoria Hill,\nMiss Georgia 2019, honoring the life and\nmemory of Dr. Esco Hall, junior,\nthe first black veterinary and\ngraduate from the University of Georgia.\nExpressing regret at the passing of\nRichard Spencer Mueller,\nrecognizing commending President John\na cater for 50 years of ministerial service and for other purposes that completes the\nreading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none in the resolutions are adopted.\nAlright, we're about to go on to announcements.\nIf you have signed up for an announcement, make your way to the front of the chamber.\nYou\nAll right, we're going on now to announcements.\nListen up now, going on to announcements.\nChair recognizes Chairman Beverly, Chair of the Minority Caucus for an announcement.\nThank you Mr. Speaker.\nThe Georgia House Democratic Caucus will meet in room 506 immediately upon the German\nroom 506.\nLunch will be served.\nPlease come right away.\nWe have an important measure to take up.\nThank you.\nMr. Chair, recognizes Chairman Hitchens for an announcement.\nThe Public Safety and Homeland Security Committee will meet at 1 p.m. today in CLOB 606.\nChair recognizes representative Jasmine Clark for an announcement.\nGood afternoon colleagues, you just received a notice on your desk about the first future\ncaucus meeting of the 2020 session.\nThis will feature guest speaker, Michael, actually I can't say the last name, I apologize.\nToday at Atlanta's Top Tech Entrepreneur,\nit is tomorrow, tomorrow at 3 p.m.\nand 605 Club, we will have food, hot food.\nSo, look forward to seeing you all tomorrow.\nAnyone can attend.\nI repeat, anyone can attend.\nThank you.\nMr. Speaker, ladies and gentlemen of the House, I want to remind you that on your desk,\nyou'll find an invitation from the Lynx Incorporated.\nThere is a special legislative reception this afternoon.\nAt 5.30 at Ohio River South, we look forward to seeing you there.\nChair recognizes Chairman Corbett for an announcement.\nThank you, Mr. Speaker.\nThe Environmental Quality Subcommittee of Natural Resources will meet at 2 p.m. in room\n515, CLOB, and in the morning at 8 a.m. the Motor Vehicles Committee will meet at\nin room 515 also, thank you.\nAll right, if you have pages, we have a few pages up here that are waiting on you.\nI will not wait on you.\nChairman, Chair recognizes Chairman Dollar for an announcement.\nI can do them up there.\nI don't apply to you since you're in the well.\nThank you, Speaker.\nThere is a 130 meeting for the working group Creative Arts Entertainment up in 403, again\nthat's at 130, and then at 230 up in 403, there is a telecommunications subcommittee\nof the Energy Utilities and Telecommunications Committee, and that is at 230, thank you.\nYou\nYou\nYou\nYou\nYou\nOkay, we have no more announcements.\nWe have no birthdays.\nrecognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I moved that this House stand adjourned\nuntil 10 a.m. Tuesday, March 3, 2020.\nMajority leader has moved that this House be adjourned\nuntil Tuesday, March 3 at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no, the eyes have it.\nThis house will be adjourned until Tuesday at 10 a.m.\n",
  "updated_at": "2026-02-12T14:30:26.508299+00:00"
}