{
  "video_id": "GYfvfeXUCCs",
  "url": "https://www.youtube.com/watch?v=GYfvfeXUCCs",
  "title": "3/20/23 - Committee on Finance",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 89,
  "summary": "Here is a structured markdown summary of the key points from the Georgia 3/20/23 - Committee on Finance session transcript:\n\n## Overview\nThe session covered several pieces of legislation, including HB 170, SB 153, and HB 504. There was discussion around the rural hospital tax credit and public school tax credit provisions. The committee made some amendments to the bills and advanced them.\n\n## Key Actions\n**HB 504**: Included a hospital tax credit provision and a $5 million public school foundation tax credit, while repealing the Perry on Sunset provision by December 31, 2026.\n**HB 170**: Passed unanimously out of committee.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Discussion around the need for the rural hospital tax credit going forward given improvements in Medicaid reimbursement.\n- Representative Hatchett had originally proposed a change to a free port provision, but withdrew it after a $300 million fiscal note was provided.\n\n## Votes\n- **HB 170**: Passed unanimously.\n- **HB 504**: Passed unanimously with amendments.\n\n## Attendance\nQuorum was present, as indicated by the unanimous votes.\n\n## Adjournment\nThe timing of adjournment was not specified. The next session date was also not provided.",
  "transcript": "You\nIt is 3 o'clock and we have a busy agenda.\nSenator Rhett, would you do the invocation for us?\nYes, sir.\nYes, sir.\nYes, sir.\nMr. Chairman.\nBow our heads.\nOh, Lord, we thank you for this day.\nAnother day's journey, and we're glad about it because we have the opportunity to do the\npeople's work.\nGive us your guidance and wisdom, hold our hands, walk with us as we move forward and try\nI make Georgia a better place to live for all Georgians.\nWe ask this to Christ our Lord, Amen, and Amen.\nAmen.\nAll right, the first bill we're going to call today\nwas one that was left over from before\nwith Representative Mitchell Skoggins.\nThat's going to be, you have to go back.\nI think they're in the numerical order and pull out 290.\nSo when you've got a copy of this and give me your LC number just to be sure we're the\nsame.\nI think just that last section where we were looking at the\nthe wordage. All right. So we wouldn't in that year be their\nterm of office. Okay. So instead of it being the I think before it\ncould be interpreted to say it would be that year contract year this\nwould be their term of office.\nSo if they've got a contract in place for a four-year term, it would stay in place for\nthe four-year term.\nAnd anybody that wasn't here at the previous meeting, this is dealing with the tax commissioners\nthat has language that says that the fees they get will be no more than 50% of their base\nsalary and that it will be a three-way negotiation with the county commission, the tax commissioner\nand the entities that they're wanting to collect the taxes.\nAny other questions by anybody?\nIf there's no question, Senator Hickman's move\nthat we do pass the Substitute to Hospital 290,\nis there a second?\nSecond by Senator Alvers.\nAll in favor, raise your hand.\nAll right, I don't see any opposed.\nPasses unanimously.\nAll right. We're going to move Representative Crow's 101 got split up a little bit. So if\nyou'll pull out your package on 504 and I'll kind of explain what's going on there.\nI think 504 may be in between somewhere.\nYou said you put it behind 170 or?\n570, 770.\nOK.\nOK, so that's 170.\n504 is just behind the audit note on 170.\nAnd just behind that, then, is the audit on the original bill from Chairman Hatchett\nover there.\nAnd this audit is not going to be good for this bill, but I want to explain here.\nChairman Hatchett had a change he wanted to make to a free port, and he didn't feel\nI like it would be a very significant amount of money.\nAnd we said, well, we need the fiscal note on the check and see.\nWe got the fiscal note back, and it's about $300 million.\nAnd Chairman Hatchett said, never mind, don't hear my bill.\nSo because of that, what we have done trying to get some stuff\nthrough is we put on there the hospital tax credit.\nAnd the five million for the public school foundation\ntax credit.\nAnd I'll further say that the original hospital bill\nhad it going from $75 to $80 million.\nWe're trying to save those discussions for the office session.\nSo this will stay at $75 million.\nThere was some language they needed\nthat would clarify which hospitals are eligible\nand would match the federal definition.\nSo that has been left in.\nThe, there was some information there\nabout raising the corporate from 10 to 25\nand we're going to save that for the off session as well.\nAnd then you'll see in there in keeping\nwith the administration's request on Perry on Sunset's\nthat we repeal it on December 31, 2026.\nAnd let me make sure, because we have changes,\nthat both sections are subject to that, aren't they, or?\nOkay.\nSo it's really not changing much on the hospital part,\nor the other one's not changing at all.\nThe only change on the hospital part is some language\nthat would make it match the federal language\nthat we need, and the two would both sunset at 2026.\nDecember 31st, 2026.\nAny questions from the committee center albers. Thank you, Mr. Chairman\nThe rural hospital tax credit. I know it's been quite successful. My question is now that the great work has been done by Commissioner\nNoggle in order to\nHave a full payment on especially those Medicaid Medicaid costs\nI'm wondering what the long term need for this is any more once we get to that level.\nI don't know if anybody here today could speak to that, but it seems like where they\nsuffered in years past that they may not be suffering any more and do we need to have\nthis in addition to?\nOkay.\nI don't know if anybody from the hospital association wants to speak to that or not.\nI know my, let's see, we just now got the sign up sheet over here.\nLet me see what we've got.\nYeah, go ahead, Senator Avin, to address Mr. Senator Albert.\nNow, I've actually had a hospital to admire you, it says that the Medicaid thing to refer\nto is not going to be very good for them.\nIt's not going to take them, you know, like we got a hospital to admire you, it's getting\na million half, two million dollars with the tax credits.\nAnd I don't know if that's across the board or just not\nor what is it, but I have had that conversation with.\nThank you.\nI noticed there's a number of people who have signed up\non 101.\nIf you're interested in either one of these sections in here,\nyou know, you can speak on this.\nBut this is dealing with the Royal Hospital Tax Credit\nand the five million public school tax credit\nthat Brooks Culliman had started.\nI think from my knowledge of hospitals,\nI think you've got a valid point in that they're getting\n1.7 billion more money with this direct pay,\nwhich we've worked on.\nThe total uncompensated with energy and care\nand low rates and everything is probably around 6 billion.\nSo from my perspective, you know, you're partially right on that.\nMy only thinking was we were kind of having a big study that we would do a short sunset,\nnot raise it and look at it from that standpoint.\nBut it's certainly the will of the committee.\nSenator Hodges, your number, what number are you, okay, there you are.\nThank you, Ms. Chairman.\nI was just gonna mirror what Senator Hickman was saying.\nI'm told by the only hospital in my district\nthat the difference in this program is really minimal.\nFor them and their net revenues of about $500 million.\nSo with about an 80 to 90 million uncompensated care package.\nThat's helpful.\nI think maybe we could have Chairman Watson\nsome time over the summer help us to figure out what they're going to do.\nThank you.\nAll right.\nEverybody understand the bill and what we've got in here and those in the audience too.\nIt's it's only the the public school five billion portions setting it to go on through\n2026 and the hospital basically saying this, staying the same with a little bit of\nneedy language and going to 2026.\nAny if there are any other questions we can have a motion No, we're staying the same\nThat well you there's and this is the public school. Not nothing to do with the SSOs. Yeah, that's that's late around and that's one of the reasons\nI want to do this early so that we get one-to-one and everything's not there. We'll say we've already dealt with two of them.\nOkay. All right. We'll entertain a motion. We got a motion. Is that a motion? Well, go ahead and state your motion motion.\nDo pass. All right. Is there a second?\nSecond from Senator Estava as any discussion. I guess on this one. All in favor raise your hands.\nThat looks like unanimous, okay.\nSo Chairman Hatchet over there, his 504 pass, but just not exactly in the form it was.\nHowever, I had a discussion with him about what I was putting in here, and he was good\nwith it.\nSo, you're a little bit late, Miss Adams, I think, but you're bill passed anyway, so even\nwithout you here.\nAnd who, well, let's see, I guess that would be Representative Crow, I think, over all\nthese things.\nMaybe he wants to pick the Senate sponsor on this.\nSee here?\nOkay.\nI can do it.\nThat's fine.\nI know we've got different committees going on out there.\nAll right.\nLet me put that out of the way.\nSo now we'll go to House Bill 86.\nRepresentative Rhodes, are you here?\nShould be in the very front of your package.\nAll right. Go ahead. Thank you, Mr. Chairman.\nMembers of the committee, LC number four, three, two, seven, nine, two, S. Committee\nsubstitute. This is really is a simple bill. Two of our great establishments here in\nthe state. Let's hang on just a minute and make sure I've got the right LC number.\nOkay.\n2-8-2-0-S, is that what you said?\nLC-4-3-27-9-2-S.\nOkay.\nWe might not have given you a 4-3.\nWe'll get you a copy of it.\nI don't think you're going to see too much of this.\n4-3-27-9-2-S.\nWe've got up there one, one second.\nSo we need to first get him a copy of it.\nYou need to copy this one.\nSo we'll let you look at that for a second, the, I'm trying to see what's different.\nWe do need to have a sunset in the form of amendment that would make it equal our last\nI think it was a technical change from leds council where it struck state.\nThat's correct.\nThat's really the only difference.\nThat's correct.\nThere.\nSo this one.\nonline 19 in in my version the LC I just gave you it just struck the word\nstate and then it was I'm trying to see yeah yeah I'm trying to figure this out\nto. This is the current one, this one. Well, we'll go through it from the easiest way and\ngo through it. It was underlined as a change. So starting at the beginning, you've got\na change on line 13, where you're taking out subparagraphs, B and C, and you're just changing\nto provide it in this paragraph. That's correct. Okay. So then that line 22 should have been\nstruck in your original bill as well. I would think 22 through 27. That's right. Okay.\nThen there's a little bit of numbering done in there where we go from, you know,\nSince C is gone, we added D and E changes, F changes to E, just technical stuff.\nThat's the same.\nThat's right.\nOkay, then we go to line 50, and again, provide it in this paragraph, that's the same.\nAnd then we go to B and C are different, we go to June 30, 2027, which we're going to\nneed to change to be consistent to December 31st, 2026,\nor until the aggregate sales.\nOther than that, it would be the same.\nOK, and go ahead, Senator Alversy,\nwants us to stop right there.\nThank you.\nThank you for your turn now.\nOK, I just see one thing that looks concerning now\nthat I'm looking at this version.\nIf we go to line 16, where it talks about the aggregate state sales tax and use to\nrefund a pursuant to this paragraph exceeds 4.5 million.\nHowever, if you look two lines down, this applies to both state and local because it's just\nsales tax.\nSo we're saying that there's a cap in the state portion to 4.5 but the locals which\nwould be the majority of that sales tax would be unlimited.\nThis is state and local, that's why, in hints on 19, they strike the word state.\nSo it takes that completely out of play, it means state and local.\nYeah, I know, but if you look up ahead of it, right?\nSo start on mind 15, it says this is going to apply between July 1st, 2023 until June 20,\n30, 20, 27, or into the aggregate state sales tax and use for funding.\nSo right now, it's inconsistent.\nSo if it needs to be a total of 4.5 million in the city of Atlanta, you'd have a 4%\nto ask you to have a 4.92% local tax, then that would be incongruerant. You'd have to strike\na state on line 16 as well.\nMr. Chairman, I'm just going by what Lage cancels say. I'm no attorney.\nall right so um so was the intent to to have a total of 4.5 million or have a total\nof 4.5 million kept at 4.5 million for the agreement 800,000 for the\nSo is that state in local money 4.5 million?\nYes sir.\nOkay.\nSo we'll need to make sure we've got the right language on this, which I guess I think\nI agree with Senator Albers that we would strike through state again on line 16.\nthe exemption is for both. However, the way that the amount not to exceed is, says just\nstate, I was just conferring a legislative council. It's inconsistent right now.\nSo if the author is agreeable, I think if we take out line 16 and say 4.5 million state\nand local, that's correct. That would correct that era. And then again, we've got to change\nthe sunset. This will both be at\nthe land of Fallen County.\nNot my bill. You have to ask the\nauthor of the bill. Pretty sure\nthe zoo and the other zoo in the\naquarium presented this and\nthat's what they want it. Do we\nhave anybody here? We do. I don't\nsee him.\nI don't know about from the seat.\nSo whatever it might be worth, Mr. Chairman, when I passed this in 2017, the good news is\nyou all know how much I like to measure everything.\nThis actually came back as an 11-to-1 return on investment positive on the sales tax exemption\nversus what they got back in ticketing and all the other things of that nature.\nSo it did have a very, very good ROI, I will say that much.\nOkay, Senator Hickman, you're next. Just clarification. It says certain aquariums and\nZoological institution is there more than one aquarium involved or is it no sir? She's the Atlantic. Just the Atlanta. Okay\nBut it's open to all the aquariums and Atlanta to apply\nMake sure we're not being gratuitous. Yeah, and also zoos if we don't need one would be the zoo in Atlanta. That's correct\nYes, there was a plural on this. They just won. That's correct. Okay\nAll right, let me let me do Senator Estevez next and I'll get to you thank you, Mr. Chairman\nI\nam aware that this bill would\nHelp the zoo help the aquarium\nWith some of the stuff that they're doing and the city of Atlanta does not have objection to the bill\nAll right\nAll right, Senator Beach. I'm number three. Okay\nThank you, Mr. Chairman.\nAt the proper time, I would like to offer an amendment to House Bill 86.\nOkay, well we'll need a motion on the original bill before we get to that.\nOkay, obviously, but if there's no other questions, I guess we're open.\nYou got another?\nNo, I'm just going to have the appropriate time.\nWell, go ahead.\nYou can go ahead.\nI'm passing these around.\nThis is the amendment.\nI'd like to make a motion to approve.\nAll right, we got a motion to approve, is there a second by Senator Albers.\nOkay, now Senator Beech is passing around an amendment he would like to offer.\nFirst off, I love his bill, I love what the aquarium's done.\nThis has nothing to do with his bill.\nAs you recall, Mr. Chairman, we heard testimony on SB 153 and\nthat was a 2% ticket sales fee on arenas of 5,000 or more.\nAnd that revenue would go to public safety to buy fire equipment and capital outlay equipment.\nAnd we were told by legislative council that this would have to originate in the house because it was a revenue bill.\nAnd we were talked about attaching it to another bill and this bill looks like the bill we could attach this to.\nAgain, it would be for capital outlay, for fire trucks and such.\nAnd it's a voluntary tax.\nI mean, it's a voluntary, just like the hotel motel tax, the municipalities or the county commissions don't have to do this, but it's a tool in their toolbox to make sure that they are able to buy the proper equipment to go to these arenas if there's a fire or a disaster and have the proper equipment to do the public safety needs that they need to do to address the incident.\nSo we had a couple of days of testimony on this, Mr. Chairman, if you remember.\nWe had the fire chief from Atlanta that came and spoke to the need that a fire truck 10 years ago costs 600,000.\nNow it's almost a million one to buy some of these fire trucks and they're getting more and more expensive.\nAnd this is good for a range of 5,000 or more is where you could apply this 2% sales tax.\nAnd with that, I'll answer any questions.\nSo basically what this is, is this is Senate Bill 153 that would be inserted into his bill.\nI think after line 88 on the bill I have, I don't know if that's the same LC number.\nBut my amendment would be to amend, to add this language to House Bill 86 LC 4332792S.\nBeginning at the end of his bill at line 88, that's my amendment.\nSo I'm looking for the the 5,000 here, but it's on page.\nOkay, I see it now. Okay. So so you're wanting to to have a 2%\nsales tax increase on all the stadiums in Georgia. If 2000 more people and\nfor for how long did you want to do this and and well and then I'm sure it\nspecifies in here where the money's going to you're saying fire trucks it's\ngoing to capital outlay I think that's on let me see I can\nAll right.\nFlying 76.\nI think.\nCapital outlay projects.\nMaintenance and operations.\nRight 76.\nCapital outlay projects.\nThe construction of public safety\nfacilities, including acquiring.\nImproving.\nEquipping.\nof the retirement debt issued to respect the Cal State project.\nAnd again, this is voluntary by the county or cities if they want to enact this, but if\nthey do, this revenue would go to public safety.\nCapital projects.\nAll right, I don't know if I think he's checking with leds counsel making sure it was all.\nOkay.\nAny questions on this that would have a 2% sales tax increase on all stadiums in Georgia\n35,000 or more. The Senator Beech would be the one to ask the questions, too.\nOkay. Senator Hickman wants to make a motion.\nPlease.\nTwo steps. Senator Beech is a member of the Sunside.\nAll right. And you don't have a sunset on either, do you? No, I do not.\nWell, we've got a motion a second on the table.\nAny discussions, any amendments, anyone needs to offer that would be at this time.\nAll right, I see nothing, so I see the other questions, so this will be up and down\nvote I guess all those in favor of Senator Beech's amendment raise your hand all right opposed all right motion carries\nthank you eight to three I believe I saw four no votes eight to four okay\nOkay. So now we've accepted the amendment onto the original bill. So now we're ready\nto vote on the bill as a whole. All those in favor of the bill.\nOh, okay, sure. That's right. We've got to amend it some more.\nWell you've got the bill you you've got you don't have the bill in front of you\nNow what we're saying is he offered an amendment\nHe's got an amendment I passed out an amendment right here, but she's talking about the\nelse in them. Give the current else that you're working off over right now, Representative\nRhodes. The latest version.\nthe amendment the one I presented that we changed was 4 3 2 7 9 2 s but that's\nbut when you got here we said we had 43 2 8 2 0 as somebody should have\ncame right 43 2 8 2 0 yes that's a copy you have that's the latest version with\nsome technical changes and now the amendment is on there and we've got to\nchange the sunset and take that state and strike it out. So I think you're\nready to offer amendments on that, aren't you? First, Mr. Chairman, I'd like\non line 16 to change 2027 to 2026 and then do the same thing on line 59 to\nstrike 2027 and make it 2026 as a first amendment.\nSo we can we can vote on that or we can we're still going back and forth on the state sales\ntax part so to give us a minute what we put on that one okay so we've got an amendment\nto change the sunset to December 31st 2026 and and we've got a second any other discussion\nI had a question for the sponsor of the bill I didn't know whether 2027 was\nof any significance to the aquarium or to the zoo it was it's just like we've\ndone the previous few times they did this bill it was just a four-year period\nand I guess they were just running it on our physical calendar and since we're\ngiven parity to the bills that's why we're using the December 30\nfirst 2026 date.\nI'm just cheering. I think if we just strike state on line 16, that actually does it. So it's\na congruent with the rest of it. So it just says aggregate sales taxes.\nOkay. Yes. I can't remember. I don't think we voted on the other amendment on the sunset.\nDid we? So first of all, let's vote on the sunset amendment.\nDecember 31st, 2026, all in favor, raise your hand.\nOkay, looks unanimous, I think.\nSo now you can offer another amendment.\nAlign 16, strike the word state between aggregate and sales.\nOkay, you need a second to that.\nAll right, second from Senator Arkel's,\nany discussion, all in favor of that, raise your hand.\nLooks unanimous again, okay.\nSo now we're back to the original bill with Senator Beaches' amendment, with the Sunset\nAmendment and Strocking State amendment now in the bill.\nAll those in favor of the bill as a whole?\nRaise your hand.\nOkay.\nOpposed?\nAll right.\nWe've got two opposed motion carries.\nAnd we just a second to catch up with my paper work here.\nAnd Chair, Chairman, you're carrying, correct?\nYes, sir.\nAll right, we're going to move down, like, is representative Crow here.\nOkay. Well, I guess we can try to do this without him. House Bill 101, Representative\nCrowe. The a couple of sections had been taken out of that. So right now we have just got\nthe SSI win there or if the committee thinks we need to wait on the House member.\nI'm going to either way on that.\nMr. Chairman, he had come to Senate Bill to present, and so he makes it up beyond the board\nand Senate Bill as well.\nOkay.\nAll right. Well, we can, let's see, we've got a couple of more besides this.\nSo we can go on to your bill if you want to, Mr. Chairman, but I don't think I've got\na fiscal note yet on it, so we may have to wait on a vote on it.\nDo you want to go through it or?\nSo this will be House Bill 454, if my members are right, let me look and see.\nYes, House Bill 454 from Chairman Black,\nand if you all want to move to that.\nI guess since we're waiting on the fiscal note, Mr. Chairman,\nI'll try to hit the highlights and be happy to jump\ninto the weeds if anybody has any questions.\nBut there are three parts.\nAnd in section one, it would allow our manufacturers\nto take certain expenditures in year one as they have been,\ninstead of over a five year period,\nwhich was a change from the Feds.\nAnd this year's IRC update sections two through five\nare several technical changes and also some code\nthat would try to help offset some of those changes\nthat were made in 1437 from last year,\nincluding a credit for itemizers.\nBut it also is designed to kind of saddle up\nwith what the feds do and closely align with how the feds\nprocess income tax, according to itemizers\nand standard deductors.\nAnd then in the last section, it contains a piece\nwhich on the forced measure definition\nthat would include pandemic as a part\nof the natural disaster that would\nqualify them for an extension on receiving credits.\nSo the issue with section six is that\npandemics weren't included.\nI think there's an issue of somebody may not,\nmay have some legitimate reasons,\nbut there's also the question of how to do it\nand not go back retrospective and be gratuitous in it.\nus in it. So that's still kind of being looked at a little bit, I think, to my understanding.\nSo we'll save that for the next time. Did you go, let me just go through it section\nby section. A lot of people, you know, haven't been familiar with this as you are. So I want\ngive them all time to see this. So the the accelerated appreciation is I didn't\nthat's in this one right it is section one yes so that is I guess what you\nwould call decoupling from the federal code which would let us treat it as we\nhad been treating it. And it's the only thing that when Senator Hickman did the IRS update\nwas not included in that bill. It was being looked at when we update the code. So that's\none section of this is changing our depreciation to where it had been. It's, I guess in my\nmind, if you look at that, it changes the years you can take it in so you could have a\na dip in revenue and then an increase later on\nbecause where they depreciate out over five years\nare able to depreciate it in one year.\nIt's kind of still the same amount of money we're getting.\nDoes that make sense to everybody?\nIt's a little dip in year one\nand I think it kind of bounces out\nand actually pushes back up over time, yes.\nAnd then the next part of the bill deals with trying\ntrying to eliminate the marriage penalty where we would go to 12 and 24 on standard deductions.\nWhy don't you talk personal exemptions and standard deductions in the committee?\nWell, there's some words to it.\nWhere we were and where we are.\nYes, sir.\nWith the personal exemption, you actually impact not only itemizers, you know, obviously\nnot only non-automizers, but itemizers.\nAnd so when we did a look back and adjusted that back over to the standard deduction, there\nwas some increase in revenue over time, having our accountants and groups, different groups\nlook at that.\nAnd so we adjusted from the standard deduction all the way up instead of phasing it in\nover time on page seven.\nThose are struck and you jump straight to the 24, so you're allowing families to go\nahead and realize those extra dollars earlier sooner rather than later if you will.\nThat section's three and four.\nAnd then it's a three year look back on the triggers instead of a five year look back\nto you.\nI don't think you talked about that.\nThere was some question, yes, or as to whether or not with the years, the way they were\nstructured as if that would skip a 10th of a percent and so I know that was a\nSenate provision I would certainly yield the y'all's judgment but yes or\nit adjusted from five to three and one of the reasons you know I'm conscious\nand like see often numbers is we had a previous and this really isn't a tax cut\nand rate but we had a previous tax cut and a rate and I was trying to make\nsure that nobody got a tax increase in the bill. We thought we had everybody\ncovered and then the last go around we looked all the numbers and there was a\nsmall group because of a little exemption that went away of blind and disabled\nthat got a tax increase and so we had to go back and fix that otherwise the\nheadlines would have been we raised taxes on the blind and disabled which\nwasn't the intent but we're still trying to make sure we have all the numbers\nin place to go with this so that we can show everybody exactly how it impacts. It's really\nnot a change again in tax rate, but it is accelerating the plan on going to 12 and 24,000 on\nstandard deductions individual and couple because that would then eliminate, well, take\na wet blanket. That would eliminate what's called the marriage penalty where people may\nactually play more into axes. And it couples with the, you know, the feds and the way\nthey're handled, they're standard deductions. And in lieu of a personal exemption,\nitemizers would either get to choose between the standard or their\nitemization, which they drag down from the federal level, and of course they\nget for 3,000 on the dependent side, and then the credit would offset what they've\nbeen getting in the personal exemption as of right now that's right and you\nmay have been saying this but they could now choose whether they want to go\nstandard or itemize. Senator Hicken, I never call on you. You had your line on\nforever. No, so I think you've answered most of the question but I think I go back\nand blow jaw because this happened a lot of this happened at the end of last\nsession when we were when we had a lot of pressure on us to do away with the\nwhole state of economics in Georgia and the all came back with this compromise which I'm\nvery, very much pleased with. And you cleared up a lot of my question by your answers.\nThank you. Okay. All right. Well, we can't vote on today. So if there's not any other\nquestions, we'll have you back on Wednesday. And I hear there's a fiscal note that maybe\nis waiting on one second here, but I hadn't seen it yet. Maybe you'll have it today.\nI don't know. I thank you Mr. Chairman and members of the committee. All right now they've been\nstay in there. Maybe from last time, they've been there a while, Mr. Jen.\nAll right, we're going to go on to 101 now if the rep is here.\nMr. Chair, you're your rep hat and come in. I don't guess yet, Hazy.\nAll right, we'll do 170 then. I think those are the two we have left for the day.\nThank you, Chair. Thank you, committee. Let's make sure we're all on the, I think I got this\nthis from the back LC 432795S.\nIs that what you guys have?\nLet me pull that out.\n170.\nOkay.\nYeah, so most of this deal is,\nI believe we're still just two subjects on this aren't we\nthe digital downloads and the length of distance somebody could sell their goods.\nThat is correct.\nSo it's basically two items that deal with digitally collected sales tax.\nSo I'm going to go over the digital download piece first.\nI think this is something most people have heard.\nAnd then we'll touch base on the alcohol piece after that.\nSo the digital download piece is basically trying to put parity between mom and pop\npop and retailers in your community and retailers that sell online.\nSo this would apply to books, there's a big list over here, but it basically would apply\nto books, albums, artwork, newspapers, magazines, video games that you buy for permanent use.\nSo it's not a streaming service, it's not something that you're renting, it's literally,\ninstead of going to GameStop and buying Call of Duty, you're buying it online.\nAnd so it's a parody and taxation I think that's been long overdue and it's just updating\nour tax code.\nThere's language in here that exempts and make sure it's clear that it's not streaming.\nIt's also not business to business stuff that's currently not taxable as my understanding.\nThere has been some language chairman has changed some language around but I feel pretty\nconfident.\nThe purpose of the language change was to make sure that we were capturing the taxes\nthat we are wanting to tax on permanent use items and not streaming top materials.\nIs that correct, Chairman?\nRight, right.\nThe way there's going to be a fiscal note here, my personal opinion is it's higher than\nwhat we're going to capture, but also there was a couple of legal opinions that we weren't\nreally going to tax anything with some of the other wording.\nYep, and so then he added the language there with me if I can find a sheet that's on\nmy power desk.\nSorry, oh, there we go.\nSo that section 2, 3 basically is what it basically discusses that stuff that was\nchanged but yeah and I agree with you I don't think the fiscal node will be\nquite as high as that as well but it is just to me it's important to make\nsure that we have a parity in our tax at taxation system so that we are\ntaxing brick and mortars the same as we're doing online and then if that's\nand this is this is basically what you're trying to get to is if they're an\nend user of the project that's correct and possess it that's the only thing\nThat's right. So it's not a book. It's not a it's not an app that you might have to get a bunch of books in a month\nIt's literally you go to Barnes and Noble you buy the book or you buy the book permanently on your phone your tax\nAt the same rate and so that's that's the point of the tax\nAll right, Senator Albers\nThank you, miss chairman\nThis actually I believe a representative carpenter similar to have what we do with marketplace facilitator to make sure that we didn't give\nSomebody online a benefit versus mainstream that that's exactly right\nI mean it's so a lot of people say well this is the tax increase and I'll say it is in a way\nBut in the because there's more revenue, but I think it's actually making our tax code congruent across all man\nWays people purchase items\nSo it's updating that thank you\nAll right\nAny questions on this section from the committee\nAll right, don't see any okay go to the other part of your bill if you would all right\nYep, thank you, sir.\nIn 2020, the legislature passed House Bill 879, allowing home delivery of alcohol.\nIt was a great step to allow consumers to match alcohol regulation in the state of Georgia.\nLike most laws we pass in this building, I think it's important to evaluate after a few\nyears and make sure that the intention of the legislation is working in the real world.\nI'm pushing this legislation because it does not work for all of Georgia.\nWhen you live in a city with one grocery store or liquor store, this law only works for\nyou if you live in that city and not in that county.\nEven worse, if you live two miles from a store, but it happens to be in the next county,\nour laws do not allow these deliveries to occur.\nNothing in this bill will change where the taxes paid or how returns are currently handled\nwith alcohol delivery and it does not create some sort of alcohol fulfillment centers.\nIt just allows Georgians to buy products they desire from the stores that they normally\nshop and puts us in parity with Alabama, Mississippi, Tennessee, and Louisiana.\nSo what it would do currently is alcohol delivery that we pass in 2020 allows you to deliver\nin the jurisdiction.\nSo if I live in the city of Dalton, I can only have by alcohol delivered to my house from\nstores in the city of Dalton.\nI can't buy them from the county to come into the city.\nI can't live in the county and buy from the city,\nor I can't live next door on the county line\nin Murray County and get stuff delivered from Dalton\nor Whitfield County.\nAnd so what I'm saying is consumers don't always purchase\nwithin their county.\nThey have stores that they like to purchase,\nand I think a 25 mile radius is a reasonable distance\nfor people to be able to purchase these items\nto be delivered to their home.\nMy county's 33 miles long, so I don't,\nI think if you did just county, just jurisdictions\nwithin that county, it wouldn't, I mean,\nthat's even bigger than what I'm asking here.\nI think that it's shopping patterns\nand what people desire to be dropped off\nat their front door.\nAnd I'll be glad to take any questions.\nAll right, Senator Albers had one.\nThank you, Mr. Chairman.\nThank you again, Representative Carpenter.\nI live in an area that I think this is most applicable to,\nwhere I live in Roswell within a mile or so\nis Alpharetta, is Milton, and Cobb County.\nAnd some places cannot deliver across the street,\nbut they can go 30 miles in different directions\nbecause of where those lines come together.\nAnd it makes absolutely no sense to arbitrary pick it up\nby that line.\nI realize in some areas of state,\nthere might be large, unincorporated counties\nin other areas where some of us live.\nThere's a lot of municipalities.\nBut this just makes perfect sense.\nSo somebody can actually service the people\nthat are cross the street for them\nas opposed to missing all that opportunity.\nSo thank you for bringing it forward.\nYeah, and I mean, I'll agree with you.\nSo Whitfield County didn't even have a liquor store\nuntil about a year ago.\nSo, I mean, you couldn't even,\nthey couldn't even buy from anywhere\nfrom a liquor store until about a year ago.\nAnd we don't have anybody operating in this space\nbecause I don't think that the,\nyou know, when you get out of the metro,\nthe radius is important to be able to,\nallow people to be profitable in the space, so.\nAnd one more question that I could.\nIsn't it true?\nWe'd much rather someone gets something to deliver to their house, then to potentially\nget in their car and drive under the influence.\nAbsolutely.\nThank you.\nAll right, Senator Hickman.\nI believe you were next.\nThank you.\nGovernor.\nI think I picked up somewhere.\nThis particular bill was heard like three times in a house and three different committees\nand it failed in all three committees and it's over.\nYeah, this bill hadn't failed in any committee.\nIt's been, there's been a Senate bill, a house bill, and they've never had hearing.\nin a couple of committees and then it was put on another bill in another committee, but never received a vote.\nUnfortunately, because I think we had the votes.\nHow, okay, second question. How does this one protect minors from receiving out?\nThe same way the current law does.\nNothing, we're not changing the current law.\nWe're just opening it up to be able to go to 25 mile radius.\nSo currently you have to have an ID on site when you deliver, et cetera.\nSo nothing, that's current law right now.\nThis bill doesn't address that issue.\nSo we can't do it like a jail fence and think around counties to figure out where the county line is is supposed to 25 mile\nYeah, I don't what I don't think it solves the real problem is what center Albers said\nYou know the important that if you live on the county line here and you shop at that store right there\nBut you can't have it delivered but you got to order it from 30 miles the other way\nI mean just it doesn't it doesn't make make a lot of sense to me\nOkay, and and nothing's changing about where the tax is being paid\nIf I go to the liquor store here and buy a bottle of bourbon and drive home and drink it, I'm paying taxes here\nI'm not paying it where I'm drinking it and so this would be the same thing and that's what's occurring right now with the delivery piece\nAll right, we got it. Thank you. Keep going on this center as the best. I think you were next. I just had a question\nI I wasn't here in 2020. What was the reasoning?\nCOVID? Oh, what was the reason for just the\nThat was the reason behind the local jurisdiction.\nYeah, I didn't carry the legislation.\nThe gentleman's here today that did,\nbut I think a lot of it was negotiations, right?\nIt was a tough, it was a big step from where we had been.\nAnd when we negotiate legislation,\nsometimes we have to do what we can get through\nto get passed.\nAnd so that's my belief.\nAnd there was some concern about the taxation piece,\nbut I think we've proven that the taxation should occur\nwherever the products picked up.\nAll right, one more question.\nWe're gonna hear from some others, Senator Beech.\nI want to say that, oh sorry, the 25 mile radius bothers me, I have a problem with that.\nAnd I also like Senator Hickman.\nI heard it's failed three times in the house, now maybe you just clarified that.\nBut this bill should, this part of the bill, part one section one, one should be a regulated\nindustry bill not in finance.\nAnd so I cannot vote for this bill with this Part 1 section 1, 1 in it.\nI think 25 miles is just too long.\nI mean, some people would call that boot lagging, and that's a long way.\nAll right, we've got a couple people that want to speak on this.\nSo, um, I'm pretty much saying bye-bye.\nBrett Herald, former Chair of Ways and Means, I think is here.\nAnd-\nI don't know if I can see it if they're together.\nI'm-\nI'm going to go too far.\nI'm going to go too far.\nI'm going to go too far.\nHe loved the day Jim and battle loads.\nI do love that part of the sound tax policy.\nWell, I'll do his babies to get it.\nAll right, and try to be concise.\nWe are.\nYeah, we will.\nCasey Honeyman with the Wine and Spirits Hall Sailor's\nthe Georgia thank you all for here in a cell.\nI have with me, Brett Harrell, who helps us out with Robins\ngovernment relations.\nThank you for here in us.\nI think a couple of points here.\nI think number one, this isn't a normal consumer package.\nnormal consumer package good, this is beverage alcohol.\nIt's the product of not one but two amendments to the U.S. Constitution.\nWe have to keep that in mind when we're setting the table here.\nWhen we stood up this law two years ago, we were very proud to support it.\nThis is something that we took and it was a big step forward.\nPeople are getting their groceries delivered.\nWe wanted to be able to have beer and wine and spirits in this case to be in that mix.\nAnd I think Chairman's a good friend, but I think there were a couple of pieces that\nWe wanted to kind of make sure we're clear on the record here.\nAs it relates to the taxation piece,\nwhen our wholesalers make deliveries to a beverage alcohol\nretailer, the excise tax is remitted at that point.\nThe beverage alcohol retail delivery law stipulates\nthat because alcohol is regulated,\nit's treated differently than tomatoes and toothpaste\nthat when that goes out the door for delivery,\nthat sale is not consummated on a sales tax perspective\nuntil that delivery is made.\nSo if you broaden out 25 miles,\nwe're now tax-based shifting a lot of money on a local level.\nIf a city of Atlanta retailer is making a delivery,\nthe excise tax mark trucks,\nit's remitted to that local city of Atlanta\nand to the state.\nAnd then also when that delivery is made,\nand now it's a consumer in Sandy Springs\nand done what he dropped 25 mile map around the city of Atlanta,\nhe touched a lot of places.\nThose are cities and counties that are not realizing\nthat those tax dollars anymore.\nAgain, we have the chairman of the Ways and Means Committee\nthat was there that was focal or a key part\nof making this bill a reality.\nAnd I think when we did it two plus years ago,\nwe all sat together and we all raised our hands and said,\nthis is something that needed to change.\nThis is something that was carefully done,\nthat was thoughtfully done.\nIt's something that we were happy to support in the end,\nbut maybe Chairman Harrell, if there's enough time,\ncan kind of talk about how that process came to us.\nSo as mentioned, I actually was the author\nthe original facilitator bill and the author of the original home delivery of alcohol bill.\nSo I have some knowledge of both and let me stop you there and say that we passed down\nthe fourth day of that session, the first three days, because I was a Senate sponsor,\nthe first three days he was out with a flu and wasn't helping me at all.\nWell, I came on strong at the end and we got it done.\nPretty much.\nLet me make the, as was mentioned earlier, the purpose of facilitator was to get Georgia\nbrick and mortar stores on parity with large out-of-state sellers. This amendment does just\nthe opposite with regard to jurisdictions. You will have a large retailer buying alcohol\nin significant quantity that now can ship outside of their licensed jurisdiction and compete\nwith smaller retailers and other jurisdictions. It is just the opposite of what we intended\nwith marketplace facilitator.\nSecondly, it was stated nothing changes,\nnothing in this bill changes the tax sales tax law.\nThat's true.\nBut the sales tax in the law today and in facilitator\nis paid at the point of delivery.\nSo when deliveries are made outside of a taxing jurisdiction\ninto a taxing jurisdiction with a different tax rate,\nthat will cause problems with collections and remittance.\nOne jurisdiction will probably benefit.\nthe other jurisdiction may not.\nSo there are legitimate tax issues caused\nby a 25 mile radius because nothing else\nin the underlying bill was modified.\nSo that is a serious and legitimate problem there.\nAlso an enforcement, let's say a delivery is made\noutside the licensed jurisdiction.\nUnder the current home delivery law,\nthat alcohol license hanging on the wall in a retailer\nis ultimately what guarantees compliance.\nIf you make a delivery outside that licensed jurisdiction,\nlet's say an underage delivery.\nAnd a police officer catches that person\nmade an underage delivery.\nSo what are they going to issue a citation\nto the delivery person, maybe the delivery company?\nBut how do they jump from that jurisdiction back\nto a license that they have an issue?\nI mean, is that police officer going\nto call the neighboring jurisdiction\nand say, please enforce against this retailer\nthat has an alcohol license on the floor.\nIt is a serious enforcement issue as well.\nAnd these are things that just simply are not contemplated\nin this simple amendment that strikes the word licensing\njurisdiction in replaces it with $25.\nThank you, Mr. Chair.\nWe got to get some questions here, Senator Alpers.\nThank you, Mr. Chairman.\nGreat to see you again.\nI don't know if I should feel like a chairman representative\nor the smart guy.\nJust the smart guys making more money in the room.\nThank you for all the work you did when you were here.\nI think, in case you were up a great point about groceries,\nthat same grocery store can deliver to everyone around them\nfor everything else in that grocery store today.\nThey have thousands of thousands items,\nand they can go to everywhere around them,\nno issues, no concerns at all.\nAnd if a delivery company did something foolishly\nlike not ask for an ID, the delivery company\nwould be the people that are in trouble.\nthey would be the ones who would get cited,\nthey would be the ones who would get in trouble,\nnot necessarily the owner of the liquor store\nbecause at the point of left them,\nit was the delivery company's part.\nSo I appreciate the fact that you're very passionate\nabout your industry.\nYou wanted to protect what is currently in place,\nbut this is kind of silly, guys.\nI mean, it's time to move forward on some of this.\nAll right, let me get Senator Tiller here, your comments.\nThank you, Mr. Chairman, thank you.\nChairman of ICE for being with us today.\nI just have a question for you.\nI think we'd be remiss if we didn't take you up on your expertise in cases as well.\nWhat do you think an appropriate radius would be if 25 is not it?\nWell, I think the concept of radius is not the appropriate way.\nI mean, again, I don't think a radius is going to call, when it crosses jurisdiction\nand boundaries is going to cause these problems,\nwhether it's five miles or up to 500 miles,\nabsent if you really want to achieve that.\nThey're just simply multiple other portions of state law\nthat would have to be addressed that are not addressed here.\nSo radius was always going to be problematic.\nAnd Mr. Chairman, if I might, the original law\nspoke to the idea of same day local proximate delivery.\nAnd that was really important.\nand the one way we achieved that was making sure\ntax dollars stayed in the communities\nin which these retailers were servicing every day.\nIt was not next day shipping, that's different.\nThat's when we start to separate out.\nAnd the radius, as you continue to grow,\nthat's where we start to move into.\nAnd I think the idea of looking at these third-party actors\nin the state of Georgia, they are not licensed in the state.\nAnd they are eight, they're agents of the retailer.\nSo they don't have any skin in the game.\nExcuse me, Mr. Chair.\nSenator Ann Vittart, I think Mr. Chairman,\nI'm going to be brief, not to beat a dead horse,\nbut I love you guys, but I mean,\nthis is such common sense stuff.\nConsumer driven, as someone who hates taxes,\nwhether I drive to the store to pick it up\nor they're going to bring it to my house,\nI'm going to get taxed, whether you\nin here at the cost or not, I'm still going to get taxed.\nI mean, if I can right now buy a wine online,\nwhich I know all these products can be different,\nand I can literally get it to the Walgreens\nand pick it up,\nbecause that's where the FedEx box is gonna be,\nor they're gonna bring it to my house,\nor whatever, I'm still gonna pay.\nLike, let's just change the system and move on\nto consumers after what we've lived through,\nafter, you know, during the pandemic\nto the way everything towards, you know,\nSenator Albers mentioned,\neven to buying a sofa wanted to put it in my house,\nLike, let's stop over-regulating everything\nand get to just common sense policy.\nI love both of you, but I mean, this is simple.\nAll right, there's people that,\nand I'll call the question Mr. Chairman when you're ready.\nBut I need to let a couple more people talk,\nif y'all could step down.\nThank you for the opportunity.\nNow, Dante Handel was here from ACCG.\nAre you on this particular issue?\nOkay, so that was taken care of, I think.\nDepartment of Revenue is here. I guess I want to ask you all quickly before I let the last guy speak here\nWhat's your we've heard some stuff that they might be some confusion here? Do you mind testifying to that? I don't like putting you on the spot, but\nThank you, Mr. Chairman and members of the committee, Austin Gibbons, from the Department\nof Revenue.\nI'm joined by Ironetta Duncan, our alcohol chief attorney at this is her first time before\na senate finance hearing, but she's our expert on this issue.\nWe've worked really hard with the House and the Senate on the underlying bill and I yield\nTyronella for any questions on the title three changes.\nSo the question is it sounds like it might be hard to regulate or keep up with or something\nlike that is what's your opinion on that?\nAt this time we don't find that it would be difficult for us.\nWe do feel that we can implement this bill administratively, even if we have to do it\nthrough rules and regs.\nAll right. Well, that's probably all I need from you today. I appreciate you.\nThe last one that had signed up and you're going to have to be pretty quick is Mark Smith.\nOkay. Two points. I would offer that the legislation we passed last year with\nfood trucks showed where a food truck was permitted in one county but can operate\naround the whole state from a dealing with a permit process, same with a license.\nSo an alcohol license in one county, if there was an issue delivered to the other county,\nwe are already addressing that issue in other places.\nAnd then also just a ACCG and GMA, we had conversations on this piece of the legislation, they\nwere neutral.\nOkay.\nThank you, motion, Mr. Chair.\nNow, your button's about amendment something, or we'll do that after the motion.\nthen. So go ahead, Senator Albers.\nThanks, Mr. Chairman. I moved you past House Bill 170, LC 43, 27, 95 S.\nOkay. We got a motion and a dual seconds. I think it was Senator Arik that won that.\nSo any other discussion on that? Now you want to offer an amendment.\nYeah. Thank you, Mr. Chairman. Chairman Carpenter, I love the part two about your bill getting\ndigital up with bricks and mortar and making a level playing field. But when you're dealing\nwith alcohol, I just think it's different. In my amendment to HB 170 LC 432795S would\nbe strike part one section one dash one lines 10 through 43 regarding the 25 mile radius\nlanguage that's being requested. That's my amendment. We've got an amendment that says\njust struck this section altogether. Is there a second of that? Okay, we've got a second\nto that, so we'll vote on the amendment first. All those in favor of striking this section\ncompletely raise your hands. Okay, we've got four. Okay, all those opposed. Okay, I think\nyou voted twice. Okay, so this is to oppose to the amendment. Let's start over. All those\nthat are in agreement with the amendment that we struck this section out completely raise\nyour hand. Okay, that's going to be three. Now, all those opposed to the amendment raise\nyour hand. One, two, three, six. Okay, six to three. So the amendment fails. Now, we're\non the main motion. All those in favor of this bill. As it is, raise your hand. One, two,\nthree, four, five, six. Okay, opposed. Oh, actually, okay, three opposed. Okay. So six\nand three again, I believe.\nAll right, your motion carries.\nThank you.\nAppreciate you guys.\nAll right, we've got one more bill\nif the committee wants to tackle it.\nIf you think we have time.\nI got to go to another committee.\nIs everybody OK to stay for one more bill?\nAll right, come on up.\nOK, I don't think any of this shit is hurtful.\nYou know, I got to get to that meeting on subcommittee on the\nChristmas.\nNo, but well, thank you.\nThat's okay.\nThat's tillers.\nAll right.\nYour bill now just has the, we did the other part earlier and passed out the hospital and the public school with a\nthe 2026 Sunset, like we're doing everything else, December 31st.\nSo your bill currently just has the SSO on there,\nand I need to flip pages and get rid of all this paperwork and get to it.\nI'll say if I can get a copy of that, Mr. Chairman.\nYeah, make sure he's got a copy of the,\nI think it's pretty much the same language you had going to 130.\nThere may be a sunset on it as well, but\nOkay, if not, I would want one more on there.\nSo that's LC432795S, is that correct?\nOkay, so we've got a 4.3, 2838S,\ny'all gave him that copy.\nYeah.\nSo the only thing different in this in yours\nis the sunset on there that we have consistently put\non everything, other than that.\nI mean, look it over and be sure,\nbut other than that, I believe that's the only change.\nYes, that looks like it.\nSo all the other parts you said would be.\nI'm just second somebody's still trying to find the bill here, so this is the substitute\nof House Bill 101, LC432828S, all right, y'all keep the talking down please, all right,\ngo ahead and present, y'all keep the talking down over here, come on, okay, well as you\nstated Mr. Chairman, this is the portion of the bill that's left from our original House\nbill 101 would deal with the school scholarship organizations. And it looks like that it would raise the aggregate amount for 2024 in all subsequent years to 130 million per year.\nAnd there is a sunset added for December 31st, 2026. And you said that the rural hospitals.\nWe put that on, on Matt Hatchett, Chairman Hatchett's bill and you're welcome to pick the\ncare for that Senate sponsor if you want to.\nThe only change there was we didn't go to the 80 million, we left it at 75, we left\nthe language and they needed, and we also sunset those 20, 20, 60's in particular first.\nAll right.\nSo those passed out earlier.\nAnd what was the other one you said you moved on to that is rural hospitals and-\nAnd the public 5 million.\nOkay, and the habitat is still got some work to do on that yeah, all right?\nAll right, so we've got we've got this villain front of us. Everybody familiar with what we've got here?\nAny questions on it?\nLooks like I see some people had some amendments put first.\nWe've got we'll have to have the main motion on the floor to do that. So we've got a motion by\nSenator Hickman to approve is there a second got a second\nSenator Albers to approve all right Senator Chiller your life is lit up there\nso thank you miss president I'd like to propose a amendment and it's handed\nout it's a amendment 49-0-100 I think everybody has it let me tell you what\nLet me, let me find it here.\nMonths, 49, zero, 100.\nI think it would have came to you a little quicker.\nI'm still looking for my coffee, but.\nOkay, I found it here.\nThere's one right here.\nOkay, Mr. Chairman, the purpose of this amendment is we've continued to raise the\nScholarship this goals. I think most people call it a goal scholarship year after year and I have\nHave issues with that overall all support school choice and support at this point in time a complete ESA voucher\nI do have concerns about the fact that we have broker fees that are associated with this scholarship that\nThat continue to allow it to be eroded from its total amount for paying of the broker\nSo what a amendment I guess this will be a amendment one does is it caps that broker fee currently right now that broker fee for the first\n1.5 million is kept at 8%\nThat's about 120 thousand dollars and then later on after that first 1.5 million it looks like it goes up to\ngoes down to\nA 6%, which raises about another $7.2 million.\nWhat the amendment does is caps the broker fee at 2.5%\nfor the first $120 million.\nAnd then after $120 million caps it at 2%.\nThat would still leave an excess of $3 million in broker\nfees for this $120 million scholarship.\nIt would force more of the scholarship to be used\nfor its purpose, and if the committee thinks as well, I think it makes it a better bill.\nSecond.\nSecond.\nAll right.\nWe've got a motion and a second on that amendment.\nI guess we may look like I've got a couple more people handing me some able to go through\nall these and then look at them.\nquestion I had two on this I guess the I don't know how you refer to them but\nthe corporate donations go to kind of like the poor schools and I know\nyou've got a list of all those schools in the in the package and that is limited\nto five million dollars is there a reason that parts only at five million\ndollars. Okay. All right. Just a question I had. All right. So we've got an amendment on the floor\nand now Senator Estevez, you must have one of these here, huh? I do. I have a couple actually.\nI've broke them down in small bites for the committee and would refer folks and\nand Representative Crowd, thank you so much for bringing this bill.\nThe first amendment is AM430235, amendment two, and this would be an amendment that would require annually for the student scholarship organization to submit a report to the Department of Audits.\nthat would be very similar to the voucher bill\nthat was passed out of the Senate, sorry,\nearlier this session, but would require a report\nthat has performance data from the scholarship recipients\non a nationally norm reference test,\nlevel of satisfaction of those parents\nand the participating students,\nand then the average medium amount of scholarship received\nby the scholarship recipients,\nas well as the average and median total cost\nof attendance of the schools that those students are going to.\nThis information would be aggregated,\nso as to protect the student's identity,\nbut would provide the public some transparency\nas far as what's happening with the money\nthat is going to these students who\nare attending these various schools.\nSo just a transparency measure that would help us better understand where this money is going and how it's being used.\nSo that would be a minimum number two.\nSo looking to remember, is this language that was in Senator Dola's office bill or is this different?\nYeah, I believe it's very similar to his bill.\nI can't say it's all of it is word-for-word, but the reports, I will say the reports are\nor the information that's being requested in these reports\nare pretty straightforward and something that certainly\nI know public schools report on pretty normally.\nSo I'd imagine it would not be too difficult\nfor these student scholarship organizations\nto do the same.\nAll right, we've got a motion.\nIs there an amendment offered?\nIs there a second to that?\nAll right.\nline's 37 through 40 that protects the identity of the individual students in that\nright right because it's aggregate it says there yeah okay and let me see who\nalways sign up on this though I guess there might be more about this trim I had\ntwo more amendments two more okay go ahead five zero zero zero four one much\nmuch quicker this time around. This would be a amendment that would require students,\nstudent scholarship organizations have a yearly audit that is provided to the Department\nof Revenue. This would make those audits open to, or the require the organization to\nmake those available to the public within a reasonable time of such requests. It's very\nWe're similar to the interest that we showed earlier today in ensuring that those veteran\nprograms were transparent with the grant money that they were receiving.\nAnd then the second provision would ensure that no member of General Assembly or spouse\nwould receive income from student scholarship organizations during the taxable year that\nthey're receiving these contributions with the tax credit.\nSo to ensure that all of us don't have a conflict with these programs that are receiving\nover $120 million in tax, pay or money.\nAll right, so two bars to that amendment.\nOkay, Senator Hickman.\nCan you clear if a legislative receive an income, what you mean by that?\nNo member of the General Assembly or their spouse can receive income from the student\nscholarship organization. Does that mean that no legislators can be one of those people\nthat sells those scholarships receive commissions off of it? So what's your name?\nCorrect. The administrative fee. Okay. Thank you. Senator\nSillier was talking about. Okay, so we've got amendment number three offered. Is\nthere a second to that? Second from Senator Oroch. You said you had one more. And\nAnd then the last amendment, Mr. Chairman, I believe addresses your concern.\nIt would restrict the additional $10 million that is being requested to those student scholarship\norganizations that give 100% of their scholarships and tuition grants to students who reside in\nschool zones with the lowest 25% of all public schools.\nIf you recall the Senate passed that amendment with the voucher bill that passed a chamber\njust a couple weeks ago, so this would make that consistent with the SSO program only for\nthe additional $10 million that is being requested.\nSo were you saying the $5 million and $10 million total of $15 million or just $10 million?\nThis would be separate from the 5 million.\nOkay, so they would get 15 million of the 130 million, is that what you're saying?\nThat would be, that would be my desire for the, for, that's, that's what your amendment\nis offering.\nThe increase in, the increase in funds would, would only go to those student scholarship\norganizations that are giving 100% of their grants to students who reside in those attendance\nzones.\nAll right.\nAnd that's your last amendment, all right?\nYes, sir.\nLet me let some people speak real quick. One of them has already been taken care of because\ntheir stuff got moved to another bill. Let's hear from Kellen Carr. I guess you\nrepresent these and you can you can still say that stay there unless we get two\npeople here. You represent the I guess the corporate schools and I think\nthere's a list in here. Maybe several pages long while the schools that you\nwould you would represent is it going to? Yeah, this triple A scholarship foundation. So\nthat would be your school. So tell us quickly. Let me ask you first about, there's a lot\nof, I guess, transparency that's been put on here. What's your opinion of that?\nYeah. Well, first of all, thank you, Chairman Hustetler, for allowing me to speak today\nand the committee.\nThank you for, you know, representative Crow,\nyou know, definitely think that an increase to the cap\nis needed.\nThe demand was hit day one.\nMany donors were subject to a 78% pro-ration.\nStudents remain on the wait list throughout the state.\nWe have 130 students right now on our wait list.\nFor AAA Scholarship Foundation,\nwe serve eligible low-income children\nthrough the QE tax credit program.\nSo our student is an ethnic minority living\nwith a struggling single parent caregiver\nand many times a high crime community.\nMore than 80% of the children that we award\nare living and households with annual incomes\nat or below 200% of the federal poverty level.\nSo for the average household income of the families\nwe serve, it's about $37,000 a year.\nAnd by the time our students receive this scholarship,\nthey're either below grade level,\nThey're failing at their previous school\nor both when they received the scholarship.\nSo the spirit of the income-based scholarship\nis that it really provides an educational alternative\nto a group of people who, because of the financial\ncircumstances alone, would otherwise have none.\nThe cap was met day one this year.\nIt was a 78%, you know, pro-ration.\nWe have a lot of students still on our wait list.\nAnd for us, it means that we can't get the siblings\noff of our wait list.\nAnd for financially struggling families,\nthat means the difficulty of splitting\ntheir children between multiple schools\nor forfeiting their scholarship\nso that both children can attend the same public school.\nWe also rely exclusively on corporate donations\nto fund our scholarships.\nAs the families we serve typically\ndon't have much tax liability to speak of.\nI think Chairman Hustler,\nwhen you asked the question earlier\non the low income students,\nwe do rely on corporate donations.\nWe commend the Senate last year\nfor allowing insurance companies\nto participate in the program,\nlike C-CorpS have always been able to participate.\nRight now in statute, there's a limit on insurance companies\nthat is set at six million.\nWe would respectfully ask the committee\nto consider striking that, setting it at 5%,\nso that if the cap is raised,\nit just gives insurance companies more room to participate\nbecause that does serve our low-income students.\nAs far as some of the other things, I was trying to take notes pretty furiously on some\nof the other amendments were certainly open to more transparency.\nSome of this past last year on interest earned having to go to scholarships, but look forward\nto continuing the dialogue on all of this, but certainly happy to answer any questions.\nIt's back to your, when I talked about the aggregate data of the transparency fiscal\naudits, is that something you're comfortable with, you've got any issues with that or?\nYes.\nSo some of the transparency past last year and 517 that was interest earned would have\nto go back into scholarships.\nWe thought that was really good.\nAnd I think there was maybe 17 measures that were passed.\nWe certainly have some ideas on additional transparency.\nOne thing that my SSO brought forward is if the school requires an annualized standardized\ntest that that be reported to the parent or guardian so that these families can track whether\nthis is working for the student or not.\nMost schools provide a standardized test being sure that the parents have access to that\nso that they can see if that child is meeting grade level metrics.\nWe think that would be a good pathway.\nWe've got two more people I think want to speak.\nIs there something important you're going to need to ask on this?\nSo we appreciate your testimony.\nI've got Justin Polly.\nJim, committee members. Just thank you for the opportunity to speak here. I'll be very\nbrief. I'm Justin Polly with the Georgia School Boards Association. We currently represent\nevery school board in the state. Our association, our membership, has a long standing position\nopposing tuition tax credits, and at this point we just can't support what this bill is trying to do.\nWe do appreciate the amendments offered, and we thank you very much.\nAll right.\nThanks. We've got Dr. Steven Owens out here.\nI believe this is the last one that hasn't spoken, and again, try to be, I hate to catch on time, but we're running out.\nNo, that's no problem.\nChairman Huffsetler, members of the Senate Committee\non Finance, some Dr. Stephen Owens,\nthe Education Director of the Georgia Budget and Policy\nInstitute, we have a longstanding opposition\nto public funds being used for private educational expenses.\nJust a couple of things to think about on the inputs\nand then output side on inputs.\nIf we could close the loop to not allow businesses\nto claim this donation as a business expense,\nIt can make money for corporations to, quote unquote,\ndonate if it's a dollar for dollar tax credit.\nIt's hard to imagine that as charity.\nBut you can donate to these SSOs and then you\ncan claim on the federal taxes as business expenses.\nThis is advertised on SSO websites.\nThis is not some mystery.\nWe could close that loop like some other states have\nso it could be seen more as a charity\nthat it's being advertised as.\nAnd then if we could also maybe talk about a cap on the credit\nfor corporations.\none of these student scholarship organizations is held\ntogether by one donation every year of a million dollars\nfrom one corporation, which means they have at least\n$1.3 million of liability to state of Georgia.\nA million of that instead is going to an SSO.\nAnd then 10% of that is going to the salary of the CFO\nof that SSO.\nSo just kind of what does it look like to have a tighter\nauditing controls over how this money is being spent.\nAnd then finally, I really want to thank y'all\nfor the amendments that y'all brought forward.\nWe really appreciate that.\nOne I would like to add as well,\nis if we could have some understanding\nof the boundaries that private schools have put\non who they would enroll.\nIf this really is about parent empowerment,\nif the private schools could publicly list\nwho they would not educate,\nI think it would help parents know,\nhave a better idea of the choices\nthat they're allowed to make\nand it not just be a private school choice bill.\nAll right, we probably won't have time today\nfor the amendments you're talking about,\nbut appreciate your testimony.\nApparently I miss Claire Suggs,\nso if you wanna come up quickly and...\nGood afternoon.\nYes, my name is Claire Suggs,\nand I am with Paige,\nthe Professional Association of Georgia Educators.\nAnd Paige does have a position,\nwe are not supportive of voucher programs.\nThough I do want to recognize and thank you\nfor the consideration of expanding the transparency\naround this program.\nThough it has been in operation for well over a decade,\nit's never been evaluated.\nSo having additional information\nwould be hugely helpful to really understand\nthe impact that this has had on students.\nI also do want to point out that in code right now,\nthere is a requirement that an analysis be done in 2023.\nSo I would ask you to consider before moving ahead\nwith raising the cap, if you would wait until that analysis\nhas been completed and ideally until the amendments\nthat Senator Estevez has proposed,\nso that we really do have an understanding\nof how this is affecting children.\nAll right, we're gonna have to appreciate your comments.\nSenator Hickman, you had a comment.\nBecause of the significance of these members,\nI make a motion that we table this\nto the next meeting.\nOkay, so we've got a motion a second to table. I don't think there's any discussion on a motion like that. All those in favor of tabling raise your hand.\nOkay, so we've got a majority that wants the table to build at this point. So we will stop right there. Yeah, I'm sure you would.\nAll right, thank you committee for your work on this.\n",
  "updated_at": "2026-02-12T10:35:59.307039+00:00"
}