{
  "video_id": "HBfqs6zXfx0",
  "url": "https://www.youtube.com/watch?v=HBfqs6zXfx0",
  "title": "3/23/23 - Committee on Children & Families",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 57,
  "summary": "Here is a structured markdown summary of the Georgia 3/23/23 - Committee on Children & Families session:\n\n## Overview\nThe session focused on House Bill 144, a bill that codifies the International Holocaust Remembrance Alliance's (IHRA) definition of anti-Semitism. The bill aims to ensure that when analyzing intent behind illegal discriminatory actions targeting Jewish people, the IHRA's widely accepted definition is considered.\n\n## Key Actions\n**HB 144**: Codifies the IHRA definition of anti-Semitism to be used when analyzing intent behind illegal discriminatory actions targeting Jewish people.\n\n## Bills Introduced (First Reading)\nNone.\n\n## Notable Moments\n- Representative Carson presented the bill, explaining its purpose and addressing concerns about limiting free speech.\n- The committee discussed the merits of using the IHRA definition, emphasizing the importance of uniformity in defining anti-Semitism.\n- A legal scholar was available to provide technical answers to the committee's questions.\n- One committee member expressed understanding for the bill's intent, but noted that the state had previously passed an anti-hate bill that could already cover these issues.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present.\n\n## Adjournment\nThe session was adjourned with a hard stop at 8:50 AM, as many committee members had to attend another meeting.",
  "transcript": "You\nWelcome to the Children and Families Committee and before we start I'm going to ask\nSenator Paine what's your mic number 11 to open a separate prayer.\nLet's bow our hand pray.\nHaving Father we come to you today Lord and we just thank you first and foremost for\nall of our many blessings.\nThank you for the air that fills our lungs.\nIt comes only with purpose to serve or let us find our purpose in you that we would be\nglad of you to do all your will and not just of our own.\nFather, we just give you, ask you to give us clear eye and mind the discernment and\nall that we do, for it's in Jesus' name that we pray.\nAmen.\nThank you.\nOkay.\nWe have one bill on our agenda this morning, it's House Bill 144 and there is now a\nsubstitute to that, which was formerly House Bill 30.\nAnd Lieutenant Governor's Office\nfeels this issues of public importance\nand should be considered by the Senate.\nSo that is why we're talking about this this morning.\nThreats and attacks against the Jewish children and families\nin all of our districts can't be tolerated in Georgia.\nThis bill has been thoroughly publicly vetted\nand here's how we're going to proceed.\nWe have a hard stop at 8.50\nbecause many of our members have to go to another meeting.\nAnd so we need to be sure that we're finished by then.\nAnd we're gonna have the author present the bill\nand take questions from the committee.\nThen we are gonna allow some public testimony,\nalthough there's been a lot of public testimony\non this bill already.\nAnd the way that's gonna work is we're gonna have\n15 minutes for people that are opposed to the bill,\nand 15 minutes for people that are in favor of the bill.\nand feel free to yield your time\nif your points already been made.\nAnd I would ask people to be as brief as you can.\nWe also need everyone to be respectful\nand we don't have any disruptions in our Senate committees.\nSo please keep that in mind.\nAnd we will have discussion by the committee\nbut we're not gonna entertain any amendments.\nAnd so with that, I'll ask Representative Carson\nto come and present the bill.\nThank you, Madam Chair, members of the committee.\nI'm presenting before you, the substitute to House Bill 144.\nMany of you know this as the anti-Semitism bill that this legislature has been debating\nthis year.\nWhat this basically does is, and just for clarity, I'm working on LC 491454S.\nWhat this basically does is what it does is codifies a definition of anti-semitism for\nthe International Holocaust Remembrance Alliance.\nAll this bill does really is ensure that when analyzing intent behind illegal discriminatory\nactions that target Jewish people, whether it involves a hate crime or illegal discriminatory\nactions, that there is an allegation that the action was motivated by anti-Jewish sentiment\nand that the relevant authorities consider\nthat this, the world's most accepted definition\nof anti-Semitism by Ira,\nthe International Holocaust Remembrance Alliance.\nI have a printout, Madam Chair,\nif members want to see it in regard to what that definition is,\nbut I think we've talked about this in length\nin both bodies and both chambers.\nBut I'm happy to share, I have several copies of that.\nWhat this bill does not do,\nIt does not in any way limit or chill,\nanyone's freedom of speech, what have you.\nYou can take a look at the Bill Substitute.\nIf you take a look at lines 29 through 34,\nI'll just read the first sentence or two.\nNothing in this code section shall be construed\nto diminish or infringe upon any right,\nprotect it under the first amendment to the US Constitution.\nIn addition to that, the Ira definition of anti-Semitism\nLiterally says, however, criticism of Israel, and I'm quoting here from the definition\nfrom Ira, criticism of Israel similar to that level to against any other country cannot\nbe regarded as anti-Semitic, and that's just an excerpt.\nGroups in support of this, you have a letter in your packet, I'm just going to hold this\nup, sorry, mine's in color, maybe yours isn't in black or white.\nI want to encourage you to understand the persecution\nthat the Jewish community is under,\neven though they only make up one, one and a half percent\nof the Georgia population, they probably are targeted\nwith over 50%, maybe 60% of all the crimes,\nhate crimes of persecution in the state.\nThis bill is very similar to what are almost identical\nto what has been passed in Arizona, Iowa, Tennessee,\nArkansas, several other states.\nSo I think about six or seven or eight states by statute,\nabout 22 states and total by resolution.\nThis definition has been adopted\nby 1,100 separate governments, non-governmental entities.\nMost of the EU nations has also been adopted\nby the US State Department, US Department of Education.\nAnd as you can see, on lines of the bill,\non lines 16, 17 and 18, it's also been adopted\nas a presidential executive order.\nand it's also been enforced by the prior president\nand it's been enforced by the current president\nand the current administration.\nThe biggest question I get, Madam Chair,\nand members of the committee is why is this necessary?\nThe Jewish identity is multifaceted and it's complex.\nIt incorporates race, religion, culture,\nnational origin, national origin, and ethnicity.\nAnd it's not just one simple thing.\nSome people can put up a swastika and say,\nI'm making a political statement.\nNo, you're making an anti-Semitic statement.\nWith that, I know we have a number of speakers.\nAnd honestly, this legislature has debated this quite a bit.\nI'm happy to take questions at the pleasure of the chair.\nI do have with me, Mark Goldfeather, Mark,\nif I may, Madam Chair.\nHe's kind of a legal scholar on these issues,\nconstitutional scholar, and I'm happy to help have him,\nIf you may, at the chair's indulgence,\nhelp him answer technical questions.\nBut with that, I would just ask for the committee's support\nin this matter.\nThank you.\nWe are going to take some questions from the committee.\nSure.\nOkay.\nSenator, the represent.\nRepresentative, thank you for bringing this legislation forward.\nI got a question for you or your esteemed attorney.\nWhy are you?\nIra is the internationally recognized definition of anti-Semitism.\nIt's been sought out, vetted extensively by various professors, went through a three-year\nworking process.\nIt's been adopted by non-governmental entities, it's been adopted by government bodies around\nthe world, including, as I mentioned, a number of states, as well as the U.S. Department\nstate, U.S. Department of Education, and the prior president's executive order, which\nthe current president is enforcing.\nI would not want there to be another definition, such that what is anti-Semitic under state\nlaw is not anti, or in other words, there's differences between state and federal law in\nregard to what is anti-Semitic behavior, so thank you for that.\nuniformity matters. Absolutely. Absolutely.\nThank you, Senator. I would just add that dire definition was put together over years by subject\nmatter experts across 50 different countries. It's been vetted. It's been adopted by presidents\nof both parties, UN Secretary General and others. And more importantly, it is accepted by the\nvast majority of Jews as actually reflecting their shared experience of what antisemitism is\nis in how it manifests itself.\nIt's true, and that's why it's a good definition.\nIn terms of why it's a good definition for this bill,\nthe IR definition focuses less on why people hate\nand more focuses on manifestations\nof what people do when they hate.\nIt's a practical, sociological,\nraconduct-based definition, if you will,\nwhich is what you need when you're looking for\nthis kind of definition.\nThank you, Madam President.\nGood morning, everyone.\nAnd I do understand the intent of this bill.\nThe actual intent of the bill, I have no problem with.\nI'm black on them from the south.\nI understand hate.\nWe don't want any postings of any hate of anyone or any group.\nAnd I do think we pass our anti-hate bill in this body\na couple years ago.\nAnd it should cover what we're trying to do here.\nI would have said go ahead and add an amendment to that particular bill.\nAnd I guess our concern is the definition of IRA.\nThat is the sticking point here.\nAnd I do believe this was heard in another committee, is that correct?\nThat's correct.\nOkay.\nWas there a problem with what the Judiciary Committee did that day?\nThere was.\nOkay.\nCan you explain to me what?\nEssentially just to Senator Robertson's question, we're about a conformity here and\nwhat the Senate judiciary did is by a one vote margin adopted a definition other than\nIra for anti-Semitism.\nOkay.\nIf I may, then chair.\nOkay.\nSo because the problem is the Ira definition, that definition is very broad.\nI get what you're saying, but under that definition, and I've seen it, there are several\nwhat means what anti-Semitism means.\nAnd the concern is it could be used if interpreted strictly by law to sense of free speech.\nAnd that's what we don't want.\nAnd I kind of, and even the, and I, you know, I just did some research myself because it\ncould be used in that way.\nIt could be because the language under the IR definition is, I've seen it, it's a lot\nthere. That it could threaten, you know, our academics, the protests for students, and\neven the author himself, Kenneth Stern, he warned that it could undermine the fight\nof anti-Semitism and charges of anti-Semitism. So he was in concern, and this was only supposed\nto be a working definition. And it wasn't intended just yet to be the definition that we're\ngoing to codify into law.\nAnd I have huge concerns if we're going to codify this into law\nas it applies to our state.\nBecause here, it's all state agencies\nshare, shall consider, any sympathism\nas evidence of discriminatory intent\nfor any criminal or non-criminal law policy\nin this state, which prohibits this discrimination\nbased on race, color, and religion.\nSo I have some concerns.\nAnd I do, I get what you're trying to do.\nI really do.\nBut I think the vagueness might leave us open\nto some trouble later.\nAnd that's what we don't want.\nSo that's my question.\nHow do we-\nSenator, I very much appreciate that.\nAnd if it's OK, I'd like to respond,\nif I can, just several of the points.\nFirst in regard to what Ken Stern actually said.\nAnd this is not fearful.\nHe's been misquoted on this so many times.\nHe's written about it in three places, including chapter 7\nof his book, The Clarify.\nHe does not think this should be ever codified\nas a speech code.\nI won a thousand billion percent degree.\nThat is why this bill cannot and does not touch speech.\nThere's never been an allegation that any bill like this one,\nwhich is in several states now has ever been used\nto silence or chill speech because it cannot be used that way.\nThat our definition is only, only, only triggered\nif there's been an unlawful act of discrimination\nor a hate crime.\nAnd in that instance, the our definition is clear\nthat those examples, if you look on the line\nabove the examples, could taking into the overall context\nbe discriminatory?\ncontext is crucial here as it is in every case of discrimination.\nThe reason those examples are there are not because they're always anti-Semitic and\nthe Irish takes pains to say that in two different places.\nIt's there because people sometimes do these things and use them as excuses to attack\nJewish people.\nAnd I'll give you an example if it's okay.\nJust recently, two weeks ago in New York, a man named Sodom, a Sod was on trial for\nhate crimes and his lawyers filed an open court and I submitted this testimony to the previous\nmeet him, happy to submit it again, and said that he didn't attack these innocent American\nJews because he's an anti-Semite.\nHe did it because he hates Israel, as if that was an excuse.\nAnd our hate crimes right now doesn't catch everything.\nYou'll hear testimony soon from children themselves who are from Fulton County who are terrorized\nbecause the swastika is not a religious symbol, and the school gaslighted them and told\nthem that it wasn't.\nAnd you'll hear stories about people if we have time who have been attacked for things\nrelating to Israel as well, and they use that as an excuse.\nSo the examples are there just so that a judge\nwhen there's a hate crime allegation\nlooks at a list of things, prior statements,\nprior posts, all kinds.\nAll this definition says is, look at this list of things\nthat could potentially be anti-semitic,\nso you don't miss it.\nBecause otherwise, anti-semites like to hide\nbehind ambiguity and do things to Jewish people.\nSo this is only if a Jew is targeted,\nand there's an allegation, look at this for intent.\nUnderstood.\nNow the example you just gave, we,\nWhat triggered this is anti-hate groups lag,\nwhite nationalists, white supremacists,\nNazi symbols, these type things, right, correct?\nNo, Senator, it's coming from all different sites.\nOkay, so, okay.\nI was just saying the example that you gave,\nI think the intent of this was to just target\nthose groups that were actually doing\nthe crimes that were here in Georgia recently\nin the Jewish community.\nAnd Senator, this bill would not touch any of the\nantisemitic literature, that's free speech.\nThis bill wouldn't even come close to touching it.\nBut I'm really glad you brought that up because two things.\nNumber one, the person in Georgia\nwho is actually spreading those literatures,\nhe is a person who has done hard time\nfor violent racial attacks.\nHe's not, we're worried about it.\nTwo weeks ago when they cleared a national day of hate,\nmembers of my community were afraid to go to synagogue\nand afraid to go to school.\nActually, because they're afraid of being attacked,\nit's not the literature.\nAnd in San Francisco, three weeks ago,\na man who distributed that same literature,\na man named Jamie Tran, then went and shot two Jewish men,\nleaving two different synagogues on two different mornings.\nThis bill would not touch the antisemitic literature.\nIt's a free speech.\nBut it would say that if he then got forbid goes and shoot\nsomebody, it would be used as evidence of intent\nfor why he selected his victim.\nOK.\nThank you, Collie.\nSenator Estvez?\nSorry.\nWe'll lock the end of this in time.\nYeah, thank you.\nand good morning.\nCan you explain why this version of 144 is different than HB30\nand how it incorporates the IRA definition?\nI can, yes, which version of HB30 were you referring to?\nAs passed by the House.\nThe As passed by the House online 14.\nThe next speaker says definition.\nThere used to be the word advisory or working,\nand that's been striking.\nWell, I understand what's different.\nI'm asking why.\nWhy?\nIf uniformity is the key here, why remove the definition\nitself, and then include a reference to a federal order?\nIf I may.\nThank you, Senator, for that question.\nWhat happened to the Judiciary Committee\nexactly the reason why we want to do it by reference because if you put the\ndefinition to the code it invites anybody with a pen to go and start editing out\nwhat they don't think should be anti-semitism. In the one minute that it happened\non the judiciary committee the person who made the amendment changed a word\nin Ira and from the word he changed was he said I don't think it should be a\ncertain perception Jews has to be a negative perception. Well people like\nIlan Halmi were tortured and killed because they thought that Jews were rich.\nIt's not a negative perception. People in Colleople, Texas were taken hostage in\nsynagogue because they thought Jews were powerful. It's not a negative\nperception. In minutes, people go and they think and they mean well. I'm not\nthey mean well. They think that they have a better definition. This definition\nworks. It's been an essential valid tool. And just again to go back, I'm\nsorry to what Kenneth Stern wrote. And I'm happy to provide this and writing. I\nprovided to the previous committees. He said, of course, the Irish should be\nused for hate crimes. Of course, it should. And more importantly, the other three\nauthors also signed a letter saying the working definition, it was cold\nworking because they meant to put it to work. And that's a letter that they signed that\nthree of them, Andrew Baker, as a person from the AJC will come and speak to that as well.\nHe's from that committee. And it has been put to work. They immediately gave it to prosecutors\nand other authorities in Europe. And it has a 20-year history there of being a tool to\nhelp us monitor anti-semitism and to help us look for intent behind hate crimes.\nThank you. Two more questions really quickly.\nThank you. You're kind of short because otherwise we're going to run out of time for public\nreally really quickly how many time well are we aware of other instances in\nGeorgia law where we refer to a third third party definition yes depending\nthe definition itself in the law we are we ask legislative council to provide\nthat for the House Judiciary Committee and throughout title 33 which is\nthe insurance title. The code Georgia code refers to the National Association of Insurance\nCommissioners NAIC as authoritative. In title 12 regarding to forest resources in title\n6, in title 12 in regard to forest resources chapter 6, the code recognizes the NAICC or\nthe North American industry, industry classification code as authoritative. And throughout the code,\nthe NFPA National Fire Protection Association\nand its various safety codes are recognized as authoritative.\nIn chapter six of 32, that's the regulation\nof maintenance and use of public roadways,\nthe code sites, the National Arborist Association,\nInternational Society of Arbor Culture,\ntheir regulations as of January 1st, 2011, as authoritative.\nOkay, and the last question is how many times\ngenerally has it's been used to prosecute hate crimes across the country.\nA statue like this?\nYes, never.\nSenator Jackson.\nThank you, Madam Chair.\nThank you all for being here today.\nThis question Senator Robertson may actually be able to answer it, but for me.\nI've spent a lot of time in code 16 with you and I feel like we spent a lot of time\nWe spend a lot of time writing definitions or clarifying definitions in code 60.\nTo your knowledge is there any incident, because this is about a crime, their instances\nwithin that title, where we don't define the definition explicitly, or to your knowledge\nare we always, do we ever reference somewhere outside of that code, or do we not just name\nthe definition?\nI think questions for Senator Roberts?\nYes.\nI think in Title 16, a lot of times the way we write the code are based on case law because\nwe're dealing with criminal acts that happen in other places.\nAnd I think Title 40 is where we would probably find more definitions as associated with traffic\nsafety and things of that nature that are definitions that were codified by the federal government\nand sent down because of federal highways and other things.\nin Title 16, I think the vast majority of that is based on case law.\nAnd looking at case law looked at a case yesterday, similar to this, where it didn't reference\nthe definition, but what it did was explain how this bill and the definition, the way this\nbill is defined, is applicable in the courtroom, and I'm sure the attorney will correct me.\nIf I'm wrong, which I am occasionally, that a crime occurs, crime occurs in what this\nlegislation does is allow law enforcement to look for evidence related to this that calls\nthe crime.\nIn other words, if somebody stands in the middle of the street and yells, I hate Israel,\nthat's fine.\nIt's when there's an act that follows that, that you can draw a line from that act back\nto them standing in the street saying, I hate Israel.\nThe same thing is if I went out there and made racist remarks\non a regular basis and then went and followed through,\nand I will briefly say this, the individual that they are\nlooking at for spreading this literature,\nwhile this literature is free speech.\nThis is a legitimate thread.\nI have a very, very good understanding of this individual\nbecause he happens to be from my district or was\nuntil he was banished.\nBut by the court, not by me, but to answer your question,\ntitle four, you would fall in line more than title 16.\nOne follow.\nSo you've said repeatedly that this is only\nas it relates to if there was a crime that happened beforehand.\nBut once 22 say that all state agencies\nshall consider anti-Semitism as evidence of discriminatory\nintent for any criminal or non-civil law or policy.\nSo the way I read that, that means that this is going\nto come up in any state agency.\nSo this could imply, say, to our schools,\nto our university system, that this exact definition,\nand because you all, instead of giving us\nwhat we had previously from the House,\nbecause you've referenced the entirety\nof the Iowa definition, that includes\nexamples, which explicitly say that if you believe that the state of visual\nis racist, that that is anti-submitting, then this will apply to our\nuniversity setting where this has become. We have letters, tons of letters in\nhere, from students who have had this iridefinition used against them from\ntheir speech, and so I am gravely concerned because it's not just about a\npredicate to a hate crime lines 22 explicitly say that it implies it applies to all\nstate agencies so please explain to me how I am wrong if I am I don't want to\nsay that you're wrong I just want to explain what the bill does the acts\nthat's referring to are unlawful illegal discriminatory conduct it's not\njust acts and it applies to all state agencies and I'll give you an excellent\nexample of why you brought up schools you're gonna hear testimony from children\nwho were terrorized in their public schools,\nand the school administrators rung their hands,\nand they said, well, we don't know what anti-seminous is,\nor not sure what it looks like.\nSwastika's killed the Jews, gas the Jews terrorized.\nThe Fulton County wouldn't correct this\nuntil the Department of Education\nand the federal government came in and threatened\nthey were funding and their accreditation,\nbut that's why you want to tie it to the DOA.\nYou want the exact definition\nthat the federal government uses.\nNow, I've seen those cases on your list.\nI have, I want to say this, almost every one of those cases\nare false.\nThey're full of things that are not true.\nAnd I'm happy to submit in writing a bottle of every single\none of those.\nBut I will tell you this in a short response.\nNone of them, not one of them, involves a law like this.\nNone of them.\nAll of them, even the ones that some of them don't even involve\nIra.\nThe ones that involve Ira, don't involve a law like this.\nThey involve the possible use of Ira as a speech code.\nThe ones that involve a law, involve Title VI, which is already\nin existence, and will continue to be in existence.\nThis law would not change in Iota.\nIt doesn't affect free speech on a campus.\nIt doesn't affect speech speech in a public school.\nState agencies should use this in case there's a problem\nin their district like Fulton County had\njust a couple of years ago.\nAnd why is it not acceptable for us to just write\nexactly as Iro State's what the definition\nof anti-Semitism is?\nWhy are you referencing the entire thing with the examples?\nAnd that was the bill that we received from the House.\nIt just says anti-Semitism means a certain perception\nof views.\nlike it says the definition.\nWhy are you all so insistent that we include\nthe reference specifically to Ira\nand now to the Federal Civil Rights Act\nthat is also like, just help me understand\nwhy we're in this different posture.\nSure.\nFirst of all, again, what happened at the last committee\nis why you don't wanna put the definition in word-by-word\nbecause people then take a pen and edit it.\nAnother senator said, she'd be okay\nif we just cut a different two lines.\nLast year a different senator said\nshe wanted to cut seven lines.\nThose examples are there because they're crucial.\nThose are some of the most common excuses\nthat people give to hurt Jewish people.\nIt doesn't matter.\nYou can hate Israel, you can hate Jews.\nIt doesn't matter.\nYou can say whatever you want.\nAnd the Irish definition, again, clearly says,\nthese are not always anti-Semitic.\nThey could be.\nThey're there because some people say\nthat they're never anti-Semitic,\neven like Saddam Assad,\nwhen you're attacking physically violently Jews.\nThey say, it's not.\nThere was a case in Germany,\nThey were told Germany in 2017 a group fire bombed a synagogue and they said to the judge\nwhen they wanted to hate crime enhancement it's not anti-semitism we just don't like\nIsrael and the judge accepted that and removed the hate crime enhancement in response Germany\nadopted the ira definition with the examples because that is what anti-semites do and that's\nwhy it's important.\nOkay, we're going to have to stop with the questions right now and move to public testimony\nand unfortunately we are now behind on time so we're going to have 10 minutes.\nfor each side. So we're going to start with the people who are opposed to the bill and I'm going to ask the author to\nstand by and\nwe'll call you back at the end\nFirst I'm signed up and keep in mind that however long you take is\nusing the total time. So if you want more people to speak you need to make your points quickly. René\nOkay, I'll vote funny.\nI probably butchered your name.\nI'll miss Annie.\nThank you.\nMembers of the Children and Families Committee,\nmy name is Renee El Nubani,\nand as a Palestinian and a board member,\nan incoming president for the Georgia Tech\nMuslim Students Association.\nI am giving this testimony in opposition to HB144,\nwhich has been replaced with the bill text\nof former HB30.\nPlease do not vote any version of this bill\nout of this committee.\nThis year our MSA held a year-long educational series\nhighlighting different genocides and human rights violations\ntaking place around the world.\nIn February, our MSA plan to hold an event\nabout Palestine as part of the series.\nWhen reaching out to speakers from Jewish voice for peace,\nwe found out what happened years prior\nat YDSA's Palestine 101 event\nand how they were put on a nine-month disciplinary probation\nafter complaints that Hillel made.\nGeorgia Tech later adopted the IRA definition\nand 11 examples of anti-semitism as a result.\nWe initially intended on discussing the topic\nof the legality of the state of Israel,\nand one of the other examples of anti-semitism states\nclaiming that the existence of a state of Israel\nis a racist endeavor.\nConsidering this example,\nand how we could be labeled as anti-Semitic,\nwe decided not to discuss the legality of the state of Israel\nduring the event for fear of what the consequences might be.\nWe communicated this to the guest speakers\nto ensure that they would not discuss it.\nWe reached out to IDSA to ask them about what happened\nyears prior and they gave us suggestions\nfor how to proceed with our event cautiously.\nWe also contacted and met with Palestine Legal\nto give us advice on whether or not we should hold the event,\nwhat our legal rights are in the scenario\nand how to ensure the safety of the students attending.\nBased on the advice given to us,\nwe took the following measures to ensure our safety.\nWe video recorded the event to capture\nif anyone acts violently.\nWe required we required people to RSVP for the event\nand we only allowed people to ask questions\nthrough an online form for sensory purposes.\nAll of these are things we have not done\nfor any other events like this in the past.\nHad it not been for the Ira definition,\nwe would not have had to suppress the speech\nof the speakers and students attending\nor take extra measures to ensure the safety\nof our students.\nThis bill is not about combating anti-semitism.\nIt is a bill that will silence those advocating\nfor Palestinians and against human rights violations\nin Israel infringing upon freedom of speech.\nThank you for letting me give this testimony.\nThank you.\nNext is Fatima Chaudhary.\nAnd we're down to seven minutes and 43.\nGood morning.\nMembers of the Children and Families Committee,\nmy name is Fatima Chaudhary.\nAnd as the current president for and on behalf\nof the Georgia Tech Muslim Students Association,\nI am giving the testimony on opposition to HB144\nwhich has been replaced with the bill text of former HB-30.\nPlease do not vote on any version of this bill out of the Senate Children and Families Committee.\nRenee spoke previously about the effect the IAHRA definition has had on our MSA in suppressing speech,\nand I want to further discuss the extent to which this could affect students and college campuses.\nMany students have been interested in advocating against the IAHRA definition at Georgia Tech,\nBut if any run addition of this bill is passed in the Senate and signed into law,\nthe issue would become much larger and become more challenging for us to repeal.\nWhile proponents of this bill suggest that the definition of anti-Semitism outlined\nwill only be used by state agencies, there is nothing stopping schools and universities\nfrom viewing this as the official state of Georgia definition of anti-Semitism\nand using it to suppress speech even further.\nFor Georgia Tech specifically, this bill will affirm the school's leadership\nthat their adoption of the IHRA was appropriate\nand acceptable under state code,\nleading to greater suppression of speech\nand targeting of Georgia Tech students and organization\nwho speak out in support of Palestine.\nThe claims made that the purpose of the bill\nis to protect the Jewish people from hate crimes,\nbut it will only increase hostility and violence\ntowards those who advocate for Palestinians,\nespecially Muslim women who are easily identifiable\nbecause of their hijab and who have been the target\nof countless hate crimes, threats,\nand verbal assault even on college campuses.\nEvery year, we have a few instances of verbal assaults\non Georgia Tech Muslim women.\nAnd I want to urge that while you may hear from the opposing\nside that anti-Semitism should be considered equal to the\ncriticism Israel, there is no country, no state, and no\nsingle authority on this earth that exists and from having\nthe ability to be criticized by the people.\nAnd I think if you were to equate criticism of a state to\nthe racist and persecution of a people,\nthen there is a dangerous boundary that you are crossing.\nWe ask this committee to protect free speech and support\nto just students by voting no on HB144.\nThank you.\nThank you.\nYep.\nYes.\nWhat are the questions you might have for my room?\nHello.\nThank you, Madam Chair.\nCan you show me in the drill where it says\nyou can't criticize the state of Israel because the way I'm reading this all\nthat matters is if you have an act and they will tie that act as a was\nmotivated by discriminatory discriminatory intent so the only way you the\nonly way you would it would suppress speech is if you're motivated to go do a\nviolent act as the only way that you're going to be negatively impacted by your\nspeech is if your intent is to commit violence towards someone that is what\nthis bill says. Right but let's take back into consideration what Renee said\nabout specifically what happened in Georgia Tech which led to the IHRA\ndefinition being adopted at our school. Why DSA held an event that criticized\nthe state of Israel that brought to light issues that were going on with their humanitarian\nviolations or whatnot that Israel was doing in Palestine at the time, right? That specific\ncriticism of that state, not advocating for any violence, not advocating kill all the\nJews or any other type of heinous and antisemitism action was criticized as going against the\nJewish people. Why is it that going to criticize and going to talk about a certain state and\ntheir certain actions that they've taken against the people that have been well documented\nby many international agencies is seen as equal to the criticization and the prejudice\nagainst a Jewish people, but you're saying it's an act, right?\nNo, I'm not saying anything.\nI'm saying what the bill says, the bill says you can say whatever you want, but as soon\nas a violent act is committed they can tie that back to the speech.\nI understand. So if there's no fear of doing a violent act and there's no intent to commit a violent act\nYou can say whatever you want\nSo that is the point of this bill is very clear. Okay, so my question to you would be what you don't ask questions\nI asked the questions I think okay\nExcuse me. Yeah, we have another question real real quick\nYou use the Georgia Tech example and you said y'all held an event there, you know, yeah, why do you say right?\nHow did you end there and you said y'all were criticized they were criticized by the okay\nHold on just give me a second who was criticized why DSA at the time who were they criticized by the Georgia Tech leadership\nOkay, thank you. Was any student expelled or suspended no, but the organization was almost banned okay almost banned\nI've almost been hit by cars. Okay, so it's been very specific because\nmyself and Senator Jackson as we were talking before, laws are laws they're very\nspecific so let's don't make hypotheticals and let's be very specific to Senator\nBrass's point as I said before there's got to be the thread tying the two\ntogether if it's not there then I can stand on the street out there and talk\nbad about anybody I want to.\nJust the way the committee process works you I asked we asked questions up here\nI didn't mean to jump you so I don't know\nPersonally, I think stop there\nIt doesn't say it in the bill but the IRA definition is pulling the very question that you\nare asking like where is it?\nIt is implied in the IRA definition.\nWe're going to have to move on here.\nWe're seriously running out of time so we have five minutes left.\nor testimony from the con side, Annie, Jolani.\nChairwoman and members of the committee,\nthank you for the opportunity to testify today.\nMy name is Annie Golanne,\nand I'm a political strategist\nat the Asian American Advocacy Fund.\nA grassroots organization with a mission\nto uplift the voices of Asian American specific islanders\nand Native Hawaiians in Georgia.\nI'm speaking to you today in opposition of HB144.\nI want to first acknowledge how inappropriate\nand undemocratic it is to just two legislative days\nbefore Sinidai, strip a bill of all its current language,\nand funnel in a bill that failed to make it out\nof its original committee.\nHB30 was heard in Judiciary in both the House\nand the Senate.\nJust three days ago, after significant opposition\nto the measure, we watched it get tabled in Senate Judiciary.\nIt is now before you in this committee.\nHB30, now HB144, is a violation of the First Amendment\nof the Constitution.\nIt disproportionately suppresses the freedom\nof speech of Palestinian Americans\nand applies in both the context of hate crimes\nand discriminatory intent.\nSeven of the 11 contemporary examples\nof anti-Semitism outlined in the 2016\nIRA definition have to do with the state of Israel.\nFor context, one of them claims it is anti-Semitic\nto say that the state of Israel is a racist endeavor,\nwhich would bar someone from stating\nthat Israel is in apartheid state.\nWhile the sponsors of the bill suggest\nthat it has nothing to do with protecting Israel,\nthey have publicly made comment stating\nthat people who oppose this bill do so\nbecause they support Palestine rather than Israel.\nThese comments make the sponsors intent clear.\nThis bill is about protecting Israel\nand the IRA examples that protect the state of Israel\nat the expense of freedom of speech will be weaponized.\nOur organization is particularly concerned\nabout this bill's impact upon Palestinian, Jordan's,\nexercising their freedom of speech\nto protest Israel's human rights abuses.\nThis bill explicitly states that anti-Semitism will be used\nas evidence of discriminatory intent\nunder both criminal and civil code.\nNot solely in the hate crimes context\nthat proponents claim the bill will apply in,\nwhich we also oppose.\nWith the IRA definition conflating criticism\nof Israel with anti-Semitism,\nthis leaves the door open for any actions by individuals\nwho criticize Israel to be perceived a discriminatory.\nBecause of the definition cited in this bill,\nand especially the language used of rhetorical manifestations,\nwe are very concerned that this language will be used\nto target peaceful protests by Georgia residents\nwho seek to voice opinions\nabout the occupation of Palestine.\nIn fact, ever since the IRA definition\nwas adopted by Georgia Tech,\nstudents have been afraid of speaking out\nin support of Palestine due to the risk\nof their organization being suppressed.\nI want to be clear that triple AF will oppose\nany rendition of this bill.\nAlthough we remain steadfast against anti-semitism,\nwe do not see any use of the IRA definition and examples\nwhether explicitly stated or not to be acceptable.\nDue to the IRA definition suppressing\nfreedom of speech, the bill's disproportionate impact\non Palestinian-Americans and the bill's use\nin multiple criminal and civil contexts.\nWe urge this committee to vote no on HB 144.\nThank you.\nThank you very much.\nnext is Megan Gordon, and we're down to two and a half minutes.\nYou lining up to the next of that, father.\nGood morning, y'all.\nI will be quite brief.\nMy name is Megan Gordon.\nI'm the Policy Manager with the Council\non American Islamic Relations.\nY'all have already heard this is not\nversion that passed the House. The House Judiciary Committee had three very long hearings\non this bill, and I know my audience. I know the Senate does not feel bound to do anything\nthat the House does. This bill also didn't come out of the Judiciary Committee, and I\nknow this landed with y'all. I mean, I don't actually know when it landed with y'all, but\nIt couldn't have been like 72 hours ago.\nIf this was as simple as predicate to hate crimes,\nit would not have spent three committee hearings\non how judiciary.\nIf it was that simple, I think Senate Judiciary,\nprobably would have passed it.\nIf it, like, we have had 55 minutes almost in here today,\nand y'all have had this bill for a couple of days,\nIt is the first year of a two year session.\nThere is time to continue to vet this bill.\nWe don't have to rush.\nWe don't have to make a decision today.\nAnd so all I'm asking if you all\nis to just not take action on the state\nand allow time for the process to work.\nThank you.\nExcuse me real quick.\nYes sir.\nYou came and saw me yesterday\nand you gave me your number.\nAnd what organization do you represent?\nI work with the Council on American Islamic Relations.\nOkay.\nIs it true or not true that the FBI's distance itself\nfrom working with your group because of ties to Hamas?\nI don't know.\nYou don't know?\nI appreciate your answer.\nI've only been with the organization for.\nYou've answered my question.\nThat works.\nOkay.\nI'm sorry, what's your name?\nMy name is Fahed Abou-Aqou.\nYeah, you're not next on the list, unfortunately.\nI know, but since our time is limited,\nand I was born there, there are about eight other people\nthat are out there.\nBut you say there's only three minutes.\nThere's one minute left.\nAnd you're jumping the line in front of five other people.\nBut we agree that I need to speak.\nAt least Cohen is next.\nOK.\nGood morning.\nUnfortunately, we only got one in 15 left.\nOkay.\nI would say more about myself.\nI'll just say my name is Elise Cohen.\nI'm an anthropologist and also Jewish Studies\nand Middle East Educator, Scholar Activist and Writer,\nJewish Life Cycle Facilitator.\nAlmost 20 years I led delegations to Israel and Palestine\nand I also have lived in Israel multiple times for research\nand for working with Palestinian Jewish sectors in Israel.\nThere's no need for this bill to define anti-Semitism.\nThere's no consensus by the Jewish people\nand organizations to do so.\nAnd the controversial IRA definition\ncould not highlight that more.\nAs it said, Kenneth Stern, one of the lead\ndrafters of the definition, has said it would be\nweaponized to chill free speech.\nThe push to codify this non-legally binding,\nIRA working definition of anti-Semitism\nis one of a long list of ways that sadly,\nsome in our Jewish community have tried to shut down free speech related to\nIsrael for decades. I have multiple examples of those including personal ones\nand how I the university where I worked was pressured to make sure even though I\nwas a Jewish studies professor there and did advocacy on Palestine outside of it\nthat to pressure the university to make sure my contract didn't continue. I\nwant to just actually point out that and I wouldn't typically do this but I\nI think it's important to show\nthat why the I wrote examples,\nwhat the intent is about using the I wrote examples.\nYou're going to need to wrap it up, Ms. Cohen.\nOkay, Mark Goldfetter, legal counsel to the bill,\nand who has said in testimonies\nthat he made the model for this bill,\nhas written articles in the Washington Times in Mishbhaha\nabout the Palestinian Nakba or history,\ncalling it a foundational myth of forced displacement,\ndemonstrably false.\nThe entire story is a lie,\nNakba mythology, a blood libel,\nand anti-Jewish information.\nhe denies. Thank you. We're gonna go to the people who are in support of the\nbill and again we only have 10 minutes so please keep your remarks brief. Beth and\nAaron gone.\nWe're only three minutes total. We've timed ourselves. Okay so what I know\nOh, will I want to make sure?\nOkay, I just need my glasses.\nI'm sorry, I'm going fast, I'm a little nervous.\nOkay.\nShould have had this ready, but I dropped my phone.\nOkay.\nGood afternoon, honorable members, or good morning, I should say.\nHonorable members and chairwoman of the committee.\nMy name is Beth, and I'm in front of you today\nto discuss why the definition of anti-Semitism is so important.\nMy twin boys were terrorized with antisemitic gestures\nin Swastika's.\nThis went on for 18 months.\nI was told that this was not a Swastika, but a piece symbol.\nI was not taken seriously until I was\ncontacted by the Department of Justice\nand the Department of Education in the Office of Civil Rights.\nAnd that's when the school board decided to take action.\nThe Department of Education said if the state\ncould not figure it out, they would\nI feel figured out for the county and take away the accreditation.\nMy situation had escalated to death threats and physical assaults, so I had to pull my kids\nout of school early.\nOur case is now known as the worst anti-stimetic incidences in schools in the history of the state\nof Georgia.\nIt seems obvious that this killed the Jews picture that my son found in the bathroom and\ndown his locker is antisemitic, but it was not, we were told that it wasn't antisemitic.\nUnfortunately, this is going on today.\nI am currently advocating for a mixed racial student that is Jewish who defines our selfish\nJewish who is experiencing the same hate that we did.\nAnd I've advocated in other schools and counties throughout the state of Georgia, including\nbut not limited to Fulton, Gwinnett, DeKab, and Atlanta.\nWhy?\nBecause there's no definition.\nThe school was afraid to act.\nThe police could not act.\nAnd if there was a definition of anti-semitism,\nthere would not have been a question of what this was\nand how to act.\nI stand before you today to encourage and act,\nto encourage the definition of anti-semitism.\nSo no other family has to endure the pain\nthat we went through.\nI ask you to vote in favor of HB 144,\nso my family's suffering wasn't invading.\nThank you.\nYou're welcome.\nYeah.\nI know.\nMadam Chairwoman, honorable members of this committee.\nFirst of all, thank you for letting me testify today.\nMy name is Aaron, and I'm testifying to you\ntoday in favor of House Bill 144,\nand part based on my own personal experiences\nof anti-Semitism.\nAs my mother previously pointed out,\nme and my brother were terrorized for 18 months at our school, finding graffiti on the walls\nsuch as kill the Jews, gas the Jews, along with, I believe I found 15 swastikas in the\n18 months that this went on.\nAnd I also had students occasionally surround me and throw money at me while screaming\nJimmy down in my face.\nI believe this wouldn't have happened had there been a definition of anti-semitism, in\nIn part because everyone I went to, teachers, staff, administrators, even social workers,\nand even the principal at one point all told me the same thing.\nThat what I was experiencing did not amount to anti-semitism, rather it was a piece symbol\nand that the graffiti I was finding amounted to nothing but students pulling pranks.\nThe graffiti appeared on a near weekly basis, and it got so bad to the point where I contemplated\nsuicide at only 13 years old. And ever since I've been in therapy, had there been a definition\nthis would not have happened, and there would have been no doubt as to whether or not the\ngraffiti I was finding was anti-Semitic in nature. Such a definition would not have allowed\nsuch an action for such a long period of time, but as painful and traumatic as this experience\nhas been, and as upset as I was to wake up at 7 a.m. to come here today, I'm here today,\nAnd I'm here today because I don't want this to happen to anyone else.\nLet alone have someone successfully contemplate suicide because no one acted.\nBecause not everyone has such loving friends and family who are fortunate enough to recognize\nsigns of suicide.\nSo please, to ensure that no one ever has to go through the unimaginable pain and trauma\nthat I went through and to make sure that everyone has a safe environment which they can\nlearn, work, or just be themselves where they don't have to worry about being targeted\nbecause of who they are. Please vote in favor of this bill.\nThank you very much. Julie Katz. We've got five minutes and 26 seconds left.\nmorning. My name is Julie Katz and I am the Associate Director of American Jewish\nCommittee's Atlanta office. We are the Global Advocates organization on behalf\nof the Jewish people and anti-Semitism is one of our areas of expertise. So\nsomeone who spoke in opposition of this bill said if it were that simple we\nwould have just passed it. And unfortunately that is the problem is that\nanti-Semitism is not simple and manifests differently than other forms of\nof hate.\nA little over a year ago, a terrorist\nentered a synagogue in Coliville, Texas\nand held four Jews hostage.\nHis motivation was to try to release\nanother terrorist from prison a few miles away.\nAnd he chose the synagogue because he\nbelieved that Jews had an extraordinary amount of influence\nand government in the media, and that if he held\nthese Jews hostage, then he would be able to help this person, this terrorist get released\nfrom prison.\nWhen the FBI released a statement, the first statement they released while this hostage\nsituation was ongoing, they said that this person was not motivated by anti-symmetism.\nthat sink in. One of the oldest tropes of anti-symmetism in the books, the idea of Jewish\npower and control, was not recognized by arguably the most important law enforcement agency\nin the country. And that is why we need this definition so badly because it is not simple.\nAnti-symmetism is multifaceted and manifests in so many different ways, which is why the\nor definition compiled by experts for years gathering together to put together a definition\nthat encompasses or tries to encompass all these different types of anti-symmetism to help\npeople recognize it.\nThat is why this is so important.\nI will finish with a few statistics from American Jewish Committee's most recent state of anti-symmetism\nreport.\nOne third of Americans have never heard the term anti-symmetism or do not know what it\nmeans.\nNine out of ten American Jews are concerned about anti-symmetism, and four out of ten American\nJews believe that their status as American Jews is less secure than it was a year ago,\nand that is a ten percent increase from a year ago, ten percent.\nSo please stand with the Jewish community,\nhelp us address these hate crimes,\nand vote in favor of the spill.\nThank you.\nThank you.\nRabbi Nidich, and we have just a couple of minutes left.\nIt's not here.\nOK.\nWayne Keel Kyle.\nKyle, thank you.\nMembers of the committee, my name's Wayne Kyle.\nI'm the CEO of Hills of Georgia.\nOrganization manages 24 campuses across the state of Georgia.\nSupports 7,000 Jewish students.\nOur students are subjected on campus incidents\nthat don't make the news and they're terrified.\nWe have had a student who had a walk out of a class\nbecause professors called Judaism or Brutal\nand grew some religion in explaining the Exodus,\nthe same professor said, how could it take 40 years?\nMaybe they were lazy.\nSo substitute Judaism for African-American,\nor any other ethnic group, and get a sense of how that student felt.\nSo let's talk about the elephant in the room.\nThe Irish definition talks about Israel being a racist state.\nIt has caused apoplectic contortions.\nNow, I don't know about you, but I think\nthat the Chinese government is guilty of crimes.\nBut I don't believe that that belief allows me to go\nand subjugate Chinese people to violence or discrimination.\nOK?\nThe type of Israel rhetoric that's being referenced here\nis being used by people on our college campuses against Jewish students.\nAnd why?\nWhat did they have to do with the Israeli government?\nThey don't have a direct line to the Kineset.\nThey don't.\nYet they're being harassed simply because they are Jewish.\nThe escalation of anti-Semitism isn't up for debate.\nIt's happening around us how we decide to step up and fight it.\nThat's on us.\nI get in front of university committees.\nThey don't understand Title VI, Title IX.\nWell, I'm going to tell you our students aren't being harassed and bullied or publicly\nshame because they like candles on Friday nights or because they pray in Hebrew.\nThey're being harassed because they choose to go to Israel or vacation there in their\nJewish home.\nIt has nothing to do with religion.\nAnd the bill in front of you allows us to set a standard.\nWe need to protect our students and give universities something that they can set policies\naround and this bill does that.\nI ask you to be brave.\nI ask you to ignore the noise behind me who are from people who haven't read the bill\nand haven't read the definition.\nI could care less if someone thinks Israel is a racist state.\nI don't care.\nI don't care if someone's critical of the Israeli government.\nI'm critical of the Israeli government, but what I do care is if you use that to attack\nJewish people on the street, and that's what's happening.\nThank you very much. We're out of time.\nSenator Robertson. Madam Chair.\nI move this committee past substitute House Bill 144 LC 491454 S is in Sierra.\nSecond. Okay. We're out of time.\nAny really quick discussion? Then we're going to vote.\nmotion to table is or second that motion text priority so we'll vote on that\nnow so all in favor of the motion to table raise your hand all opposed okay\nthe motion fails.\nMadam Chair, we have a member that is not part of the Children and Families Committee.\nHe's an ex officio member.\nIt's not listed as ex officio.\nRight.\nWe have a letter from the Lieutenant Governor's Office because of the conflict with time,\nwe were afraid we were not going to have enough members to take a vote on this measure.\nSo I can provide the letter to you if you would like to see it afterward.\nThank you, Madam Chair, it would have been nice to have seen that the committee members\nto know that before.\nBut thank you.\nOkay, now we're going to vote on the motion that is on the floor from Senator Robertson.\nWe have a motion a second.\nAll in favor of the motion, raise your hand.\nAll opposed?\nOkay.\nDid you get the count?\nOkay.\nTo oppose the motion passes.\nWe're adjourned, thank you.\nYou\n",
  "updated_at": "2026-02-12T03:07:13.109459+00:00"
}