{
  "video_id": "HbqHaEPNngU",
  "url": "https://www.youtube.com/watch?v=HbqHaEPNngU",
  "title": "Sen. Strickland Press Conference on Autism Legislation & Rio's Law | 01/29/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a structured markdown summary of the key details from the Georgia Senate Strickland Press Conference on Autism Legislation & Rio's Law on 01/29/2026:\n\n**Overview:**\nThe press conference focused on announcing the filing of Senate Bill 433, also known as \"Rio's Law\", which aims to create a specialty license plate to help law enforcement and first responders better identify and interact with individuals with autism or developmental disabilities during traffic stops and emergencies. The bill also requires basic training for Georgia peace officers on how to best interact with these individuals.\n\n**Key Actions:**\n**SB 433 (Rio's Law):** Creates a specialty license plate to help law enforcement and first responders identify individuals with autism or developmental disabilities, and requires basic training for Georgia peace officers on interacting with these individuals.\n\n**Bills Introduced (First Reading):** \n- SB 433 (Rio's Law)\n\n**Notable Moments:**\n- Senator Strickland shared his personal story of having a son with autism and the importance of acceptance and services for the autism community.\n- Layla Luna, founder of Jess B and mother of Rio (whom the law is named after), described a concerning traffic stop incident that inspired the creation of Rio's Law.\n- Connor Tomlinson, star of the Netflix show \"Love on the Spectrum\", spoke as an autistic advocate in support of the legislation.\n- Chairman Lumpston of the House pledged to champion the bill in the House, drawing on his own law enforcement experience.\n\n**Votes:** No votes were mentioned in the transcript.\n\n**Attendance:** No specific quorum details were provided.\n\n**Adjournment:** The press conference ended without a specific adjournment time mentioned.",
  "updated_at": "2026-02-12T01:34:04.410293+00:00"
}