{
  "video_id": "HbqHaEPNngU",
  "url": "https://www.youtube.com/watch?v=HbqHaEPNngU",
  "title": "Sen. Strickland Press Conference on Autism Legislation & Rio's Law | 01/29/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a structured markdown summary of the key details from the Georgia Senate Strickland Press Conference on Autism Legislation & Rio's Law on 01/29/2026:\n\n**Overview:**\nThe press conference focused on announcing the filing of Senate Bill 433, also known as \"Rio's Law\", which aims to create a specialty license plate to help law enforcement and first responders better identify and interact with individuals with autism or developmental disabilities during traffic stops and emergencies. The bill also requires basic training for Georgia peace officers on how to best interact with these individuals.\n\n**Key Actions:**\n**SB 433 (Rio's Law):** Creates a specialty license plate to help law enforcement and first responders identify individuals with autism or developmental disabilities, and requires basic training for Georgia peace officers on interacting with these individuals.\n\n**Bills Introduced (First Reading):** \n- SB 433 (Rio's Law)\n\n**Notable Moments:**\n- Senator Strickland shared his personal story of having a son with autism and the importance of acceptance and services for the autism community.\n- Layla Luna, founder of Jess B and mother of Rio (whom the law is named after), described a concerning traffic stop incident that inspired the creation of Rio's Law.\n- Connor Tomlinson, star of the Netflix show \"Love on the Spectrum\", spoke as an autistic advocate in support of the legislation.\n- Chairman Lumpston of the House pledged to champion the bill in the House, drawing on his own law enforcement experience.\n\n**Votes:** No votes were mentioned in the transcript.\n\n**Attendance:** No specific quorum details were provided.\n\n**Adjournment:** The press conference ended without a specific adjournment time mentioned.",
  "transcript": "Well good morning, you all ready? Good morning, thank you so much for joining us\nhere today and I'll start by looking back a little bit at some of the history\nbefore we get into this bill that we're about to announce. When I first started as\na member of the General Assembly back in the state house, I remember this house\nbill, I actually think it was a Senate bill at the time, that kept stalling out.\nThey talked about this condition named Autism Spectrum Disorder.\nThey like most members, I didn't really understand.\nAnd how insurance companies weren't paying for services to help with early intervention\nany of the therapies. We have come so far since that time. And I can't imagine today, even debating\nwhether or not insurance companies should be required to provide the necessary services\nto help young people navigate a condition that makes them see the world through a different lens.\nWe have finally moved as a society, as an estate, and as a state, from raising awareness\nabout this condition to learn to accept those that think differently.\nMy wife, Lindsay and I are blessed to have an eight-year-old son with autism.\nIt's something we don't call a disability or disorder, but a gift.\nKids like our son are fortunate to be grown up in a community that now has services to\nto help him learn how to manage his unique way\nof seeing our world.\nAnd his parents, Lindsay and I are blessed\nto be able to grow with him\nand learn how we can help people\nlike our son thrive in this world.\nSay I'm joined by a several special guests\nthat I'll recognize in a minute\nand also members from our law enforcement community\nand first responders,\nas we announce the filing of Senate Bill 433,\nalso known as Rio's Law.\nIt continues our work to help Georgia families who are living with autism and developmental\ndisabilities by creating a specialty license plate that families can choose to have on\ntheir vehicles.\nThese places will not only continue our efforts to create more acceptance for those living\nwith autism and developmental disabilities, but they'll provide a resource for our law\nenforcement, an entire first responder community, to be more equipped when they encounter these\nindividuals with conditions that aren't immediately identifiable on our roads.\nThis is important because as Lindsay and I have learned first hand, with proper training,\nthere are things that we may see as small that can make all the difference in the world\nwhen interacting with folks that see our world in a different way or manage life with\nthe disability.\nSenate Bill 433 also makes certain that it's part of the basic training that's required\nfor peace officers in our state, training on how to best interact with individuals with\nautism or developmental disability is included.\nAs folks in law enforcement have repeatedly said to me, the more an officer or first responder\nknows when approaching a vehicle, the better.\nI'm proud to be joined by folks representing these first responders and families like mine\nas we all come together to make certain that we get this legislation right and that we\nSo we get this legislation passed this year.\nNow I'm going to turn it over first to Layla Luna,\nwhose founder and CEO of the organization, Jess B.\nGood morning, everyone.\nI'm Layla Luna and I am the founder and CEO of Jess B.\nAnd I'm Rios Mom.\nI want to thank you all for being here today\nand especially thank Senator Strickland\nfor championing Rio's Law and also for Conor\nfor being Rio's Voice.\nRio's Law will help protect law enforcement,\nsafeguard individuals with autism.\nMy son, Rio, is nonverbal.\nAnd like him and others, we got pulled over\nin a routine traffic stop.\nbut Rio went into a complete sensory overload meltdown.\nHe was so terrified that he attacked me\nand tried to jump out of the car\nand run out into the street.\nThe only way I could stop him\nis by letting him bite me,\nwhich I have a giant scar on my wrist to prove it.\nAfter that night, after being so terrified,\nI thought we have to do something.\nThere must be a way to let law enforcement\nand our first responders know more\nabout the education and awareness of autism.\nI knew that something could be done\nAnd that's why we started Rio's Law.\nRio's Law is an identifier license plate\nthat if you're ever pulled over or on the side of the road,\nimmediately our law enforcement knows\nthat someone in the vehicle is on the spectrum.\nAnd if safe, turn off the sirens and the flashing lights.\nAnd then they know what they're walking into.\nBecause autism has no facial recognition, there's no look.\nAnd we know with our first responders\nthat time saves lives.\nThe B, the bumblebee logo.\nMy father is a pilot and was a captain in the army.\nAnd he told me that bumblebees mystified scientists\nfor hundreds of years.\nAerodynamically, a bumblebee should not be able to fly,\nbut it does the impossible.\nAnd just be his mission is it's not about the disabilities,\nit's about the possibilities.\nThank you so much.\nThank you, Layla.\nAnd I'm gonna call up Connor Tomlinson\nAnd Connor, as many you all know, is one of the stars of the show on Netflix, Love on\nthe Spectrum.\nI believe your star of seasons two and three if I'm correct.\nAnd he's incumbent say a few words.\nGood morning, everyone.\nGood morning, everyone.\nMy name is Connor Tomlinson and I have autism.\nSome of you here may know me from Netflix's TV show Love on the Spectrum, but I am here\ntoday as an advocate for the autism community.\nWhile I do not drive, I am often a passenger in a vehicle.\nAnd as an autistic man, I understand first hand what sensory overload and dysregulation\nfeel like.\nIn moments of dysregulation, I may avoid eye contact, make sudden movements, or struggle\nto communicate effectively.\nIn the event of a routine traffic stop or an emergency situation, the likelihood of me\nbecoming dysregulated is extremely high.\nIt's important to understand that these responses\nare not signs of defiance or threat.\nThese are neurological responses to overwhelming sensory\ninput.\nRio's law ensures safer encounters, better outcomes,\nand stronger trust between the autism community\nand professionals sworn to protect them.\nAs a proud Georgian,\nI am encouraged by the tremendous bipartisan support\nfrom our state legislators and law enforcement\nto help people with autism and their families\nfeel safer and seen.\nThank you, Senator Strickland,\nfor being a champion for Rio's Law.\nNow let's pass this bill.\nThank you Connor and I know with champions like you and Layla we're going to get this bill\npassed but one of the secrets to passing any bill is to make sure it goes through both\nchambers of course and I'm proud to have an ally with Chairman Lumpston from the house\nwho's been a big champion of course of law enforcement his entire career is former\nlaw enforcement officer himself and I'll now turn it over to Chairman Lumpston.\nThank you, Brian.\nLast year we had the, I had the privilege of carrying House Bill 238, which is a bill\nsimilar to what we're trying to accomplish here that dealt with dementia in Alzheimer's\npatients.\nSo, having worked through that and been able to get that passed, we're also looking\nto do this for those folks that are on the spectrum.\nWe want to make sure our law enforcement officers understand how they react and what the\nresponses might be.\nSo this training I think is very important.\nHaving been a law enforcement officer myself for 30 years, I understand that you encounter\nall types of things and you cannot always interpret what's going on.\nSo I think this type of training is very instrumental for our folks in the law enforcement community\nfirst responders.\nSo I'm very honored and privileged to be able to carry this on the house side for Senator\nStrickland.\nThank you.\nThank you.\nAnybody else?\nAll right, with that now we'll take it up, take any questions anybody wants to ask us.\nMe.\nTold you y'all to get the questions, they see me all the time.\nThat's a bad hearing.\nI'm sorry, good.\nAll the training.\nGypsies.\nSo, we are still working, the current draft\nthe bill has is under post training,\nbut that's one of the things we're working with our law\nenforcement friends on as to how the training\nis actually gonna work.\nWhat type of training would someone need to encounter?\nWell, with the training, the first,\nwell, we always say with the training,\nthe first takeaway is that there's no look to autism.\nSo if you remember anything,\nthat there's no facial recognition.\nAnd individuals with autism, like my son,\nhe looks absolutely typical,\nbut his pupils may be dilated or he's a runner\nand they might be attracted to shiny objects like the badge.\nSo these are the things that our officers have seconds\nbefore this goes into fight or flight.\nAnother thing is also understanding the allotment.\nYou know, children that are autistic,\nthey gravitate towards bodies of water.\nSo those are the two biggest takeaways,\nbut mainly understanding that the spectrum\nis an invisible diagnosis and that these individuals\nmay not even feel sobriety test.\nAny other questions for us?\nAll right, well thank y'all so much.\nThank y'all for being here today.\nLook forward to passing this legislation.\nThank you.\n",
  "updated_at": "2026-02-12T01:34:04.410293+00:00"
}