{
  "video_id": "HGEIOYhgS9E",
  "url": "https://www.youtube.com/watch?v=HGEIOYhgS9E",
  "title": "House Day 31 of the 2025 PM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 31,
  "video_date": null,
  "duration_minutes": 86,
  "summary": "Here is a structured markdown summary of the Georgia House Day 31 of the 2025 PM Session session:\n\n**Overview**:\nThe session focused on passing various privileged resolutions honoring individuals and organizations, as well as the introduction and discussion of Senate Bill 144 related to liability for use of fertilizers and pesticides.\n\n**Key Actions**:\n**SB 144**: Clarifies that a manufacturer cannot be held liable for failing to warn consumers of health risks above those required by the EPA for fertilizers and pesticides.\n\n**Bills Introduced (First Reading)**: \nNone noted.\n\n**Notable Moments**:\n- Extensive discussion and defense of SB 144 by a representative, highlighting the importance of agricultural science and technology, the rigorous regulatory environment in the US compared to other countries, and the need to keep domestic chemical manufacturing viable.\n- Concerns raised about the timing of EPA regulatory changes and how that impacts Georgia farmers.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum present, all members called to the House floor.\n\n**Adjournment**:\nThe session details do not mention when the House adjourned or the date of the next scheduled session.",
  "transcript": "House will come to order. All members, please come to the House floor. All members.\nHouse will come to order. I know rules went a little bit long, so we're going to give them\na few more minutes, but we're going to read a group of privileged resolutions so the\nHouse will come to order, members, please come to your seats.\nMr. Clerk, will you read the caption to a group of privileged resolutions honoring the\nlife and memory of David Lamar Beecher senior.\nAll veterans and their families in the state commending Tech Bridge Incorporated on the occasion of his 25th anniversary in recognizing March 17, 2025 as Tech Bridge Day at the State Capitol.\nCongratulations in commending Irene Barton for receiving the 2025 Yellow Rose Nickety Randall Service Leader Award.\nCommending Kristen Timateo, the Georgia Public Library Services 2024 Library\nEmployee of the Year, recognizing pending Dr. Jose A. Marquez-Leon.\nCelebrating the Georgia Latino Film Alliance and the Georgia International Film Festival.\nExpressing support for increased awareness of stomach cancer.\nCommending Sam Yee for his trailblazing and extraordinary contributions to\nGeorgia's jazz community. Commending Colt Manufacturing Company for its\ncommitment to safe and responsible firearms ownership. Recognizing\ncommending mayor Allison Wilkerson. Congratulations commending\nKurdishia McGill Brown for receiving the 2025 Yellow Rose Nickety Randall\nService Leadership Award.\nRecognizing March 27th, 2025 is City of Thomasville Day\nat the State Capitol.\nCongratulations, St. Joseph's Hospital of Savannah, Georgia\nupon its 150th anniversary,\nrecognizing commending delay in Roberts\non the occasion of her retirement.\nRecognizing commending to Metro Atlanta Coalition\nfor Healthy Neighborhoods, Olsen Wave, Georgia.\nAnd recognizing March 20th, 2025 is out the trap day\nthe State Capitol and for other purposes that completes the reading of the privileged resolutions.\nIs there any objection to adopting the privileged resolution here in none of the resolutions are adopted?\nMr. Clerk, will you read a caption to Senate Bill 144144?\nSenate Bill 1444 by Senator Watson, the 11th and others to be entitled, and act to amend Article 6 of Chapter 7 to title 2 of the Fiscal Court of Georgia and Tated Relay in the liability for use of fertilizers.\nPlanned growth regulators are pesticides, so it's a clarify that a manufacturer cannot be held liable for failing to warn consumers.\nThis bill evidence for the Committee on Agriculture Consumer Affairs, that committee recommends that this bill do pass.\nMr. Speaker, ladies and gentlemen of the House, a pleasure to come to you today to bring\nSenate Bill 144, LC-144, CSFA from Senator Watson, as Speaker mentioned.\nLadies and gentlemen, if you will look online, two through four of the bill.\nSo I ask to clarify that a manufacturer cannot be held liable for failing to warn consumers of health risk above those required by the United States Environmental Protection Agency.\nNow, you've gotten thousands of emails just like I have and you've been told what this\nbill does and does not do, but ladies and gentlemen, that's exactly what the bill does.\nAs we say in the South Georgia vernacular, it just says the law is the law and the EPA\nis the law when it comes to the label.\nYou know, ladies and gentlemen, y'all know that agriculture is our number one industry\nin the state of Georgia.\nWe produce the cheapest, safest, most affordable food supply of anywhere in the world.\nWe only have that ability to do that because of science, technology, and a comprehensive\nredundant regulatory system that reviews and approves plant protection products.\nYou know, in 1960, one farmer only fed 25 people.\nIf I surveyed the producers in this room, they would also agree with me that today,\nfarmer feeds an average of 169.\nThat's not because of the weather.\nIt's because of science and technology\nthat we are able to do that.\nThe science behind the chemical compounds\nused in agriculture and urban ag are subjected in the United\nStates to the most rigorous regulatory structure\nof anywhere in the world.\nSome of you may or may not know that chemical compounds that\nused in Europe that are used here in the United States have recently been labeled in Europe.\nSo again, what does Senate Bill 144 do? Again, I direct your attention to lines 2 through 4 of the\nbill that basically says the law is the law and the EPA is the law of the land when it comes to\nthe label. But why is this important? It will help keep chemistries available for Georgia farmers\nand farms in rural America and urban settings that are manufactured here in the United States.\nIt's not a surprise to anyone that more and more of our chemical chemistries are coming from overseas.\nWe need to make sure that we can continue to have those manufactured domestically here in the\nUnited States under our rules, our regulations, and under our safety protocol. So how did we get here?\nThanks to California, Proposition 65 is really kind of where it all started,\nmandating that a manufacturer of a certain chemistry put on the warning label\nmay cause cancer. They were basing that off of one study out of France,\nout of, I call it the Iraq study. It was based off a subset of data that in my\nestimation and talking to those who were engaged with EPA on a daily basis, the\nThe study was conducted with a very small subset of data points that they chose to use.\nIt wasn't what the EPA uses here in America.\nThe EPA took a look at it.\nThey used a broader set of data points and came to a different conclusion.\nEven the Ninth Circuit Court of Appeals came out and said, you know what, the state of\nCalifornia cannot require that because the EPA says that it is misleading.\nIn that case, it is indeed misleading because there is no science to back up what California\nwanted to do.\nNow, I want y'all to think about this.\nYou're in the three months of the year that we're here in this chamber, legislating and\ndoing the people's work of Georgia.\nIt's usually the three months out of the year that we import our food, right?\nBecause of our climate conditions, we don't grow year-round.\nWhere do y'all think that comes from?\nWhat do you think that the products that are used come from?\nProducts coming from Mexico, a country that has significantly more lacks regulatory\nenvironment, and they use more harsh chemicals than what we use.\nGreat's coming out of Chile.\nIs it the same regulatory environment?\nAbsolutely not.\nWe rely on those imports, but we don't control what they put on those.\ngoing to see that in a few months. Actually another week or two if I had the\nguess when this product start coming from Mexico and South America where\ntheir climate is warmer. We don't control what they put on theirs. We do here.\nThe bigger picture is are we going to continue to feed ourselves using the\nchemistry and science that is available to us or not. We're going to allow it to\nbe manufactured here or we're going to bring it in from overseas. I just\nassume haven't here where our regulatory environment controls the outcome of\nwhat we put on our food products. And ladies and gentlemen, it's the same food\nproducts that I eat, that my family eats, that my child eats, many of y'all have\nseen John William running around here from time to time. It's the same food\nproducts that you eat. Georgia's farmers take great pride in the training\nthat comes with applying any chemistry that we apply.\nThe University of Georgia Cooperative Extension Service has developed one of the best training\nprograms and every time I go to a training program somewhere, I submit this card to them with\nan ID number on the back that tells them how many training credits I've had and what\nI've been trained on to make sure that we are indeed using anything that we use in the\nthe wisest men are possible for the benefit of food production and the health of our neighbors.\nMr. Speaker, there was some question in rules, committee, in terms of the lag in time,\nand when EPA does react to data that is submitted to them, and I appreciate the conversation\nthat I've had with the, with the general lady, I went back and made a call while I had\na few minutes to ask the question of, okay, how quickly can EPA issue a stop to a product\nthat is on the market, that additional harm that may be caused is being caused.\nAnd under FIFRA, the federal insecticide, excuse me, I get this tied up from time to\ntime, the federal insecticide, the federal insecticide, the federal insecticide act known as FIFRA,\nthere are emergency orders.\nWhenever data is submitted to the EPA, they can intern and then talking to even our state regulators.\nWhat happens, data is verified.\nAnd in this particular case, August the 6th, 2024,\nDackfall, there was an emergency order issued and the product was immediately moved from the market.\nMr. Speaker, this is not about a single product.\nabout all products that we use in agriculture and allowing us to continue to\nproduce the most abundant, safest food supply of anywhere in the world.\nAnd ladies and gentlemen, I hope that you will join me in supporting this\nlegislation so we can continue to do that. We are America. We are heavily\nregulated when it comes to what we can and cannot spray on the food products that\nthat we are producing for human consumption.\nI ask for your favorable consideration\nto House Bill 144 and Mr. Speaker,\nI'll yield for a couple of questions if there are any.\nGentlemen, let us have a couple.\nRepresentative Carter, to your left,\nway back to extreme left.\nHe sure makes sense.\nI'll give you, I'm sorry.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nYes, ma'am.\nSo I'm asking the same question that I asked yesterday in committee yesterday because as\nI read the language and I'm trying to understand not being an attorney, the language speaks\nof not being able to sue because there isn't notice on the label.\nHowever, there have been suits and these manufacturers have lost because people have been harmed, so help me understand if this measure passes, what will be the cause for someone who's been harmed to bring suit if they can't show that the issue in the product is what has caused the harm.\nYes ma'am, thank you for, thank you for the question\nand we did have a great conversation yesterday\nin the Agriculture Committee.\nWhat this bill is saying based on the label\nand from the data and the science\nfrom the Environmental Protection Agency,\nwhich does not have data to support any warning\nthat may be on the label.\nThat's all we're saying here.\nIf there is a different cause of action\nthat a individual would like to take against any product,\nwe don't take away that ability in this.\nThis is solely based on the label that's approved by EPA\nand the wording that is on that.\nDoes the gentleman further you?\nYes, ma'am.\nWould you share an example of someone who has been harmed\nthat can bring suit?\nWell, how would they go through that process\nif they're not able to show that there\nis something negligent in the product,\nthat the manufacturer is something,\nas some degree, know that there's something in the product.\nBut they're died on the label.\nI understand the EPA side of that,\nand maybe other people may need some explanation.\nBecause I think at the end of the day,\nwhat we want to do is protect our constituents\nand not necessarily the manufacturers.\nSo can you help me really and help us understand that?\nBecause we still have a little pause.\nWell, as you know, I'm not an attorney either.\nBut the way that I view it and the way that I read it,\nif there are some other issues that you may experience\nfrom being around the application of this product,\nthen this legislation doesn't prohibit you\nfrom taking calls for that.\nAgain, I mean, it could be any warning.\nI mean, I was sharing with others earlier,\nthere are products that we plough on a daily basis\nthat has poison written all over.\nYou take additional precautions when we are utilizing those\nfor ourselves and for those who are applying it.\nAs long as we're following those rules and regulations,\nthat's what EPA has looked at and said this product\nis deemed safe to apply.\nSo in my estimation, if there are other things\nthat, you know, other symptoms that are caused,\nyou may be, you would be able to take a cause\nof action based on that.\nThis is specific to any warning that may not be on the label,\nbut again, EPA won't even allow you to put one\non the label unless there's data to support that.\nYes, ma'am.\nYes, ma'am.\nThe property of Jasper's to your right is recognized for a question.\nThe gentleman, will you yield?\nYes, sir.\nYes, sir.\nWe're good now.\nYou know, I had a long career as a county extension agent, spent 30 years training people\nhow to read a label.\nIt's not true when you look at your bill, does nothing to ease the regulations or even\nor lower, especially lower the standards that a user of pesticide has to eat.\nYou know, the gentleman knows of what he speaks given his distinguished career and extension service.\nAnd I think it's important to note, sir, if Jim was still yield.\nYes, sir.\nThat is true that the pesticide label, that can be one page or 30 pages long,\ngives the producer the user all the information they need to use that product safely\nand to protect their food supply.\nThe gentleman knows of what he speaks, but thank you for bringing the bill. Thank you, sir\nGentlemen you to a question of the representative or now on your left\nOut in front of you to your left\nThank you, Mr. Speaker. That's gentleman you. Yes, ma'am. I appreciate you telling us all about\nthe EPA and\nHow much our country protects us and that the other countries? We don't know what comes from them\nHowever our current federal government has just fired 400 people so what\nhappens when EPA goes away? Who's going to protect us? Well I do believe that\nthat's a conversation we're going to have to make sure we're on top of.\nThank you. Mr. Speaker with a one more question from\nRepresentative Corbett, gentlemen, we're yield to you.\nYou're right. Thank you Mr. Speaker, because gentlemen you. Yes sir.\nIs it not true that providing a clear and consistent regulatory framework?\nThis bill fosters a stable business environment that attracts investment into Georgia's agriculture sector.\nGentlemen, those are what he speaks.\nThank you for the bill.\nThank you, Mr. Speaker, and ladies and gentlemen.\nAs we continue to feed Georgians in the world, I hope that you will stand with agriculture on this important measure.\nAnd ask for your favorable consideration to House Bill 144.\nWithout Mr. Speaker, I'll yield the will.\nThe gentleman has yielded the well, you had other questions, maybe they'll be answered\nbecause we have a number of folks signed up to speak to Senate Bill 144.\nI'm going to allow up to 25 minutes for those opposed and those in favor.\nUp to 25 minutes, I'm sure you don't have to take up to 25 minutes.\nWe'll begin with those who are opposed.\nRepresentative Drenner is recognized to speak to Senate Bill 144.\nWhere's that Carla Drenner?\nLadies recognized.\nThank you, Mr. Speaker.\nI was headed to get my coat because it is so cold in here.\nSo if you-\nYou ought to borrow mine.\nI'll bring it down there.\ndo you mind? My hands are shaken. So I rise today to voice my strong opposition to Senate\nBill 144, which seeks to amend Article 6 of Chapter 7 of Title 2 of the Official Code\nof Georgia annotated regarding the liability for the use of fertilizers, plant growth,\nregulators. Oh, thank you. You look better than in the not\nday. My goodness. Yeah. Thank you. Chivalry is not dead. I\nappreciate this. It makes great picture too. While the intent of\nthis legislation may be to support agricultural growth and ensure the availability of crop\nprotection products, the implications of this bill raise serious concerns, particularly\nwhen it comes to the health and safety of Georgian citizens and the environment.\nI have five key objections.\nNumber one, potential health risk to consumers.\nSenate Bill 144 would limit the liability of pesticide\nmanufacturers by stating that they cannot be held responsible\nfor failing to warn consumers of health risk\nthat go beyond the warnings required by the USAP EPA.\nWhile the EPA does regulate pesticides,\nit is essential to recognize that their assessments\nmay not always reflect new or emerging scientific data\nabout health risk.\nBy restricting the duty to warn only to EPA-approved labels,\nthis bill effectively undermines the responsibility\nof manufacturers to alert consumers to potential risk\nthat may not have been fully assessed by the EPA\nor that may become clearer over time.\nThis could place Georgia citizens,\nespecially farm workers and rural communities\nat greater risk.\nObjection number two,\nignoring local public health concerns.\nWhile the agricultural industry is vital to Georgia's economy,\nThis bill fails to account for this specific public health\nconcerns that may arise in local communities.\nLocal health departments, health care providers,\nand researchers often identify risk\nthat national agencies like the EPA may overlook.\nThis bill would restrict the ability of state-level health\nauthorities to act in the best interest of Georgia's people by weakening the liability\nfor pesticide manufacturers.\nObjection number three.\nThe ministering consumer protection.\nSenate Bill 144 sets a dangerous precedent where corporations are not held fully accountable\nfor their products.\nprotection laws exist to ensure that people are adequately informed about the risk associated\nwith products they use. By removing the possibility for additional warning labels or safety information,\nthis legislation weakens protections that could potentially save lives and prevent long-term\nhealth effects. Objection number four, risk of environmental damage. We cannot overlook\nthe environmental consequences of pesticide use. While agriculture is indeed crucial to Georgia's\neconomy, our land, water, and biodiversity must also be safeguarded. Limiting accountability\nfor pesticide manufacturers could result in more hazardous chemicals being released\ninto our environment with long-term irreversible consequences for Georgia's natural resources.\nMy last objection is public distrust of regulatory oversight.\nThis bill suggests a heavy reliance on the federal EPA, which though an important body\ndoes not always align with the public health priorities\nof Georgia's citizens.\nRelying exclusively on federal regulations\nand stripping away state-level responsibilities\ncreates a public perception of insufficient oversight.\nFurther eroding trust in government and regulatory systems.\nIn conclusion, while we all recognize the importance of supporting Georgia's agricultural economy,\nit is equally important to ensure that our citizens and the environment are protected.\nSenate Bill 144 undermines the safety of our communities by shielding pesticide manufacturers\nfrom accountability for potential health risk\nthat may go unaddressed by the federal EPA.\nThis is not an issue of economic growth\nversus public health.\nIt is about striking a balance that protects the health\nand well-being of every Georgian.\nI urge you to vote no.\nIt is our responsibility to create a system\nthat holds corporations accountable for their actions\nand ensures the safety of all who live and work in our state.\nThank you, Mr. Speaker.\nI yield the will, and I'm going to bring you your coat back.\nHi, thank you.\nThe lady as you were the will.\nRepresentative Ramon is recognized to speak to the bill,\nrepresenting Ramon.\nThank you, Mr. Speaker.\ncolleagues today I rise in strong and vehement opposition to Senate Bill 144 and I really hope\nyou will take a moment to allow me to lay out for you how this is part of something way bigger\nthat is going to make our constituents and our families less safe and that is not an exaggeration.\nThe corporations behind these bills have been working around the country to limit their liability.\nThey are trying to shield themselves from the consequences of their products and the way they are harming consumers.\nIn fact, they have now been before the Supreme Court twice and failed both times, including as recently as February of last year.\nSo what did they do? They decided to go to legislatures, much like ours, and they went to several of them.\nAnd do you know where they most recently failed in Idaho, not some progressive bastion,\nbut a place that is actually more to the right than Georgia?\nAnd it's because people are refusing to allow these corporations to be shielded by our votes.\nIn fact, Idaho overwhelmingly killed their efforts.\nBecause the reality is, a lot of people around the country and particularly lawmakers are\nrecognizing this for what it is, an attempt to shield themselves from responsibility.\nI refuse to be used by a corporation as a shield for the consequences of their actions.\nIn fact, just yesterday, in the past 24 hours, because the point of this bill is it says,\nyou know what, the standard that we are going to go by is the federal one, and what this\nThis body is trying to use federal government inefficiencies to say we've done our due diligence.\nBut no, we haven't.\nThe EPA within the past 24 hours not only has announced almost 1,300 layoffs, but in addition\nhas announced multiple deregulations related to our air, to our water, to the things that\nwe need every single day.\nAnd then to have the audacity, for some of these companies to say, poor us, we need your\nhelp. We are in such dire straits. One, in fact, they've now tried the judicial branch,\nnow they're coming to the legislative branch, and also are already gutting the executive\nbranch part of this, both on a federal and state level. And we're being told, no, we\nare actually just trying to improve standards. We're actually trying to make sure standards\nare equal across the board. No, they are literally gaming the board. No matter which way you\nare moving these pieces, they are changing the actual board they are working on.\nWe cannot be pawns in this game.\nWe cannot allow ourselves to make the world more dangerous for consumers and for Georgians.\nAnd I want to be clear, at the heart of this bill, at its most basic fundamental level,\nwhat this bill is saying is it is saying that a corporation can bring a product to market,\nis on the consumers and the rest of us to prove that market is dangerous. I firmly believe that you\nneed to prove your product is safe before you bring it to the market. It shouldn't be, let's try it\nout and then see what happens. This is not, this to be clear, this door has already been opened. We\ncannot further open it. We cannot further hurt more people because the reality is, yes, we do get\nupdated science. Yes, we do get updated regulations. But let's be honest, and I'll be so honest\nwith you, I don't know what's going to be left of the EPA to actually deal with these corporations.\nAnd if the only entity that we are going to be listening to on these labels in court,\neverywhere else is going to be the EPA, is anybody going to be able to successfully\nget the justice that they deserve for the harm that's been caused to them? And lastly,\nI truly believe in procedure to hold this bill knowing that some of our members had flights,\nthat some of our members had work commitments and bring it at the last moment to me that\nis not okay.\nIt tells me there's something wrong with this bill and that we needed to shove it through\nas quickly as possible.\nI firmly believe that Georgians deserve better than this and I sincerely hope you join me\nand opposition to this bill, even if it means you got to leave early.\nThank you, Mr. Speaker, I yield the well.\nI'll just remind the lady that this is not an attempt to ram anything through.\nThis body meets on the days we scheduled to meet, and we're here to be here to finish\nour legislation, whether we're doing it one o'clock, two o'clock, or ten o'clock.\nRepresentative Willis is recognized to speak to the bill.\nThank you, Mr. Speaker.\nGood afternoon, colleagues.\nArise today in opposition to SB 144 for a variety of reasons.\nThis bill came through committee, the committee that I sit on.\nThe committee is called agriculture and consumer affairs.\nSo I speak to you today from a position of the protection\nof the consumer.\nFirst, to define an acronym that you'll\nhear a bit more of today, FIFRA, F-I-F-R-A.\nFederal insecticide, fungicide, and rodenticide act,\nassuming you didn't know that, that is what FIFRA stands for.\nThe EPA does not have any authority to determine\nwhat a manufacturer knowingly withheld,\nconcealed, misrepresented, or whether or not they\ndestroyed material information.\nThe EPA can only enforce FIFRA, the federal insecticide,\nfungicide, and rodenticide act.\nMeaning, at most, they could bring an enforcement action\nagainst a company for misbranding a pesticide.\nBoth of my parents led distinguished careers\nin federal government, my mother retired from the EPA.\nas an investigator.\nHere's what I know for sure.\nWhen something comes to the EPA to make a change in labeling,\nthere's a process and a procedure.\nThat process and procedure takes time.\nThat process and procedure could take six months.\nThat process and procedure could take a year.\nSo my immediate question in committee\nwas what happens to the consumer in that gap?\nWhile we wait for a label to be changed\nor something to be stated as unhealthy for a consumer.\nThere was no answer, therefore, my concern remains.\nOnly a judge or jury could determine if a violation occurred.\nIf the EPA went through all of the steps,\nand took a company to court to hold them accountable\nfor knowingly concealing material information regarding\nhuman health risks, a jury would then be tasked with determining\nwhether or not they made their case,\nit is up to a jury to determine\nthat a manufacturer violates FIFRA.\nAgain, it is up to a jury to determine\nwhether or not a manufacturer has violated FIFRA.\nIf the EPA tried to determine this without due process,\nthey would rightfully be sued by the manufacturer\nand then lose.\nI hope that I'm exemplifying the dangerous loop\nthat this place is us in.\nRegardless of what's happening at a national level,\nthis is still America where every person deserves due process,\nespecially those accused of a crime.\nThis puts inappropriate pressure on the EPA,\nwhich we already don't know where they stand right now\ntoday or tomorrow with all that's going on.\nThis puts undue pressure on the EPA to vindicate individual rights rather than protect public\nhealth.\nThe EPA's mandate is to protect public health rather than purse claims to the end in order\nto make a determination that would revive civil lawsuits.\nThis exception only applies to human health claims and does not protect property rights\nclaims.\nquickly I want you to know that Monsanto knowingly concealed the risks that\ndichambous braid over the top would drift and harm neighboring farms. What I'm\nspeaking of is even if I choose to use a pesticide and my neighbor does not,\nthere's something called drift. For once it gets in the air it can then travel\nand it can travel to your organic farm and it can hang out over your organic\ncrops and then it can infect or weaken what is happening to what you're growing that you're\nselling is organic. We can't overlook that. So the ultimate question is why would we ever\nstand here today to weaken consumer protections when the committee is called agriculture which\nwe love and support and consumer affairs which we stand here today to weaken protections for.\nIn conclusion, for those of us who have survived inexplicable cancers, for those of us who have received diagnosis and had to fight for our lives, and one without explanation as to where our sicknesses have come from.\nWhen we don't have the cancer gene, when we still receive a diagnosis that's life threatening, like I did, and there's no way for the doctor to tell you where it came from.\nyour mind begins to spend. Is it environmental? Is it dietary? Is it pesticides? Is it the food\nthat I'm eating? In the absence of a clear answer, we must protect consumer affairs. And not just\nfor those of us who have fought for our lives in one with inexplicable illnesses, but for those that\nwe have lost. And with that, Mr. Speaker, I yield the well. Thank you, Representative.\nthe lady as you are the well, that concludes those speaking that are opposed to the bill.\nWe now have up to 25 minutes for those in favor.\nRepresentative Osteen is recognized to speak to the bill.\nThe lady is recognized.\nThank you Mr. Speaker, good afternoon colleagues.\nday I rise in support of Senate Bill 144.\nLike most of you, I've learned over the course of this session\nthat Senate Bill 144 is certainly an emotional topic\nto several Georgians.\nIn fact, my inbox probably like yours\nhas been inundated with countless copy and paste emails,\nbut I haven't opened the first personal email\nwith a real-life story to tell.\nHowever, I'll share my personal story with you in a moment.\nBut let's look first at why this bill is vital to the success of agriculture, our state's\nnumber one industry.\nThe Environmental Protection Agency, aka the EPA, serves as the federal agency charged\nwith protecting the environment and human health in the United States.\nIn other words, they are the sole authority for determining what is and what is not deemed\nfactual and necessary information that is to be printed on product labels.\nSenate Bill 144 will clarify who makes the play, sorry, will clarify who makes the rules\nto play by regarding pesticide labels.\nAgain, that is the EPA period.\nThis bill does not absolve companies of any wrongdoing.\nRather, this is a bill to keep all pesticides available in our toolbox.\nAnd this issue is not about one pesticide nor one company.\nThe future of ag profitability depends on a full complement of safe, effective chemicals\nto address problems in production agriculture by using the best practices and modes of action.\nAs I mentioned earlier, I do have a story to tell.\nWe're a multi-generational family of production\nrow crop farmers that take immense pride\nin helping produce the safest, most abundant,\nand most affordable food supply on planet Earth.\nOur peanuts are grown sustainably and responsibly\non our farm in which we live in South Georgia.\nIn fact, we eat them ourselves.\nOur cotton becomes the shirts and the jeans most of us enjoy wearing and our pine trees eventually become the wood for building materials.\nWe take very seriously our role in meeting the basic needs of life by producing safe food, clothing and shelter.\nWe would never consider compromising our integrity by cutting corners or safety measures in order to meet the needs of us all.\nMy husband and son are responsible for everything applied to our crops.\nAs required by the George Department of Agriculture to keep their pesticide credentials, they\nare continually trained, licensed, and informed ag professionals who are on the front line of\nagriculture, making certain everything is stored, mixed, and applied according to these labels.\nAs a matter of fact, one of the USDA inspectors just showed up at our farm, completely\nannounced last month to inspect our chemical storage, safety equipment and application records.\nMy husband and I would never, ever, ever allow our son to be put in harm's way, especially\nsince he is the loving father to our only grandchild.\nAdditionally, I would never stand in this well and ask my fellow legislators and friends\nto essentially tie my family's hands and all the hands of the farmers,\npesticide applicators, and workers in the chemical business in the state,\ngreat state of Georgia, from being able to seek damages from bad actors.\nI would never do that. My knowledge does it come from magazine articles or\nopposed on social media regarding this topic.\nMy family is ground zero for handling and applying pesticides.\nWe apply these products daily throughout the growing season.\nThis critical piece of legislation will ensure\nthat Georgia farmers keep available\nthe essential chemistries needed to produce a safe,\naffordable, sustainable, and responsible crop\nthat solidifies continued food security\nFor our state, country, and world, as President Dwight Eisenhower so thoughtfully pinned\nmany decades ago, farming looks mighty easy when your plow is a pencil and your a thousand\nmiles from a cornfield.\nFriends, I ask for your favorable consideration of Senate Bill 144.\nOur farmers are depending on your affirmative vote to protect the future of Georgia agriculture.\nMr. Speaker, I yield the well.\nThank you.\nThe lady as you were the well,\nthat completes our conversation on Senate Bill 144,\nthose that are opposed and those are in favor.\nIs there an objection to the previous question being ordered?\nHere you know, the previous question is ordered.\nWe do have a minority report,\nand then we do have Chairman's time,\n20 minutes will be allotted for each.\nThe minority report would be brought to us by Representative Stacey Evans who\nrepresentative Evans is recognized to speak to Senate Bill 144, the lady has the\nwell. Thank you, Mr. Speaker. Good afternoon colleagues. I rise in opposition to\nSenate Bill 144. I want to touch on what this bill is about to begin with. We've\nbeen told here today that this is not about a single product, but it is. You can just\nGoogle it. This bill that we're considering here today is not unlike a bill that sets\non legislative desks in states all across this country. It is a nationwide effort. It's\npassed in a lot of places. It's been stopped in a couple of places. Midwestern states to\nbe exact, stopped by who in those states? Farmers. Farmers stopped this bill in Midwestern\nstates. This bill is not about farmers. This bill is about bear, B-A-Y-E-R, the company.\nBear bought Monsanto. Monsanto made Roundup. Roundup causes cancer. That is not a debate\nanymore. Roundup causes cancer. A lot of people got hurt. A lot of people got sick.\nMonsanto got sued. Monsanto got liability. Monsanto so to bear. Bear bought that\nliability and now bear wants to ask us to take it away. They made the deal. We\ndon't need to help them. They have plenty of lawyers to help them. I'm sure it's\nnot about farmers. Here's the reality of life, ladies and gentlemen. Industry is always\nahead of government. It's not meant to be an insult to us. It's just reality. They've\ngot more money. They've got more people. They've got more researchers. They can go faster.\nWhile we appreciate the EPA, and I really love and all the love for the EPA regulators\ntoday in this body, but industry is always ahead.\nSo under this bill, if industry finds a problem through their own research and development,\nfor example, that a product causes cancer, may damage land, may cause asthma, who knows,\nit could be anything.\nThey have to report to the EPA through the FIFRA process, and that's fine, that's the\nlaw now. And I'm aware that perhaps industry wanted to make sure through this\nlegislation that they only have to do one avenue of reporting just to the EPA\nnot also to the EPD not also to any other regulators out there. That's fine. I\ndon't have any problem with that. But the bill does more than that. It says that\nwhen industry reports to EPA what they've discovered that's it. I told\nthem. They didn't tell you. It's not public. I guess if if you happen to know\nsomebody who knew somebody who knew that industry just found something and they\nreported it to fifth grade you could do a freedom of information act request\nand maybe in six months you might get the answer and find out what they said\nbut otherwise we don't know. So industry tells government. Government looks at it.\nI heard the author and I appreciate that, yes, there are times when someone can sound\nthe alarm and there can be an emergency action to take a product off a shelf.\nBut that's not what normally happens.\nAnd proponents of this bill have said and is true and I don't think anybody is going\nto find this to be revolutionary.\nUsually, it's slow.\nEPA gets the information through FIFRA.\nthey look at it, it sets on the shelf,\nmaybe there's a change of administration, who knows?\nDoesn't have to be nefarious, it just takes a minute.\nSix months, eight months, nine months, a year.\nSo in this interim period of time, under this bill,\nwe've told industry, you told the EPA,\nif the EPA doesn't tell consumers, you're good.\nSo in the meantime, six months, nine months,\na year, two years, who knows?\nConsumers keep buying the product.\nIndustry knows there's a problem.\nBig little small, it doesn't matter.\nWe the consumers should be able to have\nand form consent about what we buy.\nIf industry knows there's a problem, why not tell us?\nWhy not let the consumers know so they can decide\nif they want to buy it?\nSo passing this bill means if industry tells government that's fine, they can keep selling\nthe product, they can keep knowing that there's a problem and they will not be on the hook\nfor a failure to warn claim to consumers.\nThat's essentially it.\nWe're giving that up.\nRight now consumers would have that right under this law they wouldn't.\nNow I have heard my colleagues who I respect greatly say,\nbut this doesn't take away a,\nlet's say you, the information got shared with the EPA,\nit didn't get shared with the consumer,\nthe consumer bought the product, the consumer gets sick,\neven worse the consumer dies.\nMy colleagues say, you can still sue for wrongful death.\nYou can still sue for personal injury.\nYou can still sue for all the medical costs\nfor your kids asthma or whatever happened.\nThank you.\nBut how about just tell me in the first place,\nso maybe I don't buy it, my kid doesn't die.\nMaybe let's do that.\nBut thank you for not killing my claim\nto recover for my dead child.\nConsumer information.\nYes, it kills a failure to warn claim.\nSo yes, it cuts off that litigation claim,\nbut most importantly, it cuts off incentives for industry\nto tell the consumers what they know.\nThat's what we're doing because we're telling them\nthey don't have to.\nNow here's something funny.\nIt's been Democrats up here speaking against this,\nbut those emails that are coming around\nto all of our inboxes, most of those are not from Democrats.\nThose are from Republicans and how do I know that?\nI had a general election this last go around\nlike many of you did in my opponent\nwho's a lovely woman that lives in the neighborhood\nnext to mine who comes down here to lobby\non various issues from time to time.\nShe's very much against this bill\nand she's been emailing me and you and others.\nThis is a bipartisan thing.\nThis is about, this isn't about litigation,\nthis isn't about farmers, this is about bears liability\nand interference and litigation\nand it's about consumer information.\nThat is what it's about.\nWe're cutting that off.\nNow, I drip an amendment and it's on your desk\nand we're not gonna vote on it\nbecause it wasn't approved by the rules committee\nbut I wanna talk about it for a second.\nI've been peddling this amendment.\nThere was a bill just like this that was originally a house bill,\nand I was trying to get it changed, but then they moved the Senate bill.\nAnd then this came up fast, and so I took my amendment to rules.\nAnd all my amendment does is just clarify what I just told you.\nIt makes sure that we keep incentives in place for industry to still tell consumers.\nThat's all it would do.\nIt wouldn't interfere with the regulatory simplification that the proponents of this bill\nhave said they want, which I have no problem with.\nIf you just want to report to one regulator, that's fine.\nMy amendment doesn't touch that.\nAnd if that was the purpose of the bill and not to provide some later protection, not\nto take away incentives for consumer information, there should have been no problem with my\namendment.\nBut I just want to use this as a moment to talk about why are we so afraid of considering\namendments, ladies and gentlemen, this is a modified structured bill so I can't propose\nan amendment to you unless the Rules Committee approves it.\nI didn't ask the rules committee to approve the amendment\nto change the bill before it got to you.\nI simply asked the rules committee to allow me\nto put it on your desk and let us vote on it.\nEssentially, ladies and gentlemen,\neven though we are a co-equal branch of government,\neven though we are a deliberative body,\neven though our friends across the hall debate amendments\nall day every day, we effectively cannot.\nThey won't even let me put it on your desk to be considered.\nSo I put it on your desk so you can read it.\nI put it on your desk because I think it's sad.\nI think it's sad that we cannot be trusted and empowered to debate and make changes to legislation in this body.\nAnd I wish that we could because I think we could have made this bill better.\nAnd that's unfortunate.\nSo because we can't do that, all I can do is ask you to please join me in voting no to Senate bill 144.\nThank you, Mr. Speaker.\nI yield the well.\nThe lady as you to the well, that concludes our minority report.\nNow we'll have the chairman's time, chairman of the committee from which this came.\nAgriculture and Consumer Affairs, chairman Robert Dickie is recognized to speak to the bill.\nMr. Chairman, you have up to 20 minutes and however you would like to allocate that time.\nThank you, Mr. Baker colleagues.\nI don't come up here often.\nI don't come up here often to have to defend bills, but I'm mad as I can be right now.\nSo folks are coming after agriculture, coming after your food supply.\nThey've sued everybody else in this state, these attorneys, and big from out of state,\naround the country, and then they see an opportunity to go after agriculture, go after our food\nsupply and I'm not going to stand here and let it happen. I'm tired of hearing\nmistruse from emails and mistruse and wrong statements in this chamber. I'm a\nfarmer and I know what it takes to farm and it takes these plant protection\nproducts that I depend on to be able to be successful to be able to grow crops.\nhouse. I'm going home hopefully sometime this afternoon. To put plant protection products\non our peaches, I can't weed a thousand acres of peaches. I'm going to put plant protection\nproducts on my strawberries. I can't sell them with mold and middle of them. This bill\nis critical for agriculture and for this nation's food supply.\nWe have the number one industry in this state is agriculture.\nAnd we have to have, I can fight, I can fight the weather, I can fight bad markets, I can\nfight disease, but I can't fight the courts with taking away our plant protection products\nin this state.\nYou know, I don't think we'll start the death in this country, but if you want every\nbetter your food imported from Mexico, from South America, go down this road without\nplanning protection products, and that's what will happen.\nWe are the bread basket of the world.\nI'm wearing a corn tie right here.\nYou know what, 100 years ago, in the 1950s, corn production was 100 bushels per acre.\nYou know what it is today, 400 bushels per acre.\nYou know what all those chickens you eat, they eat corn.\nWe have to have food in this country, it's a national security.\nYou think egg prices went up, you wait till we can't get food in this country.\nWhen our production starts going down, the world population is going up.\nYou better hold on to your wallet, nobody can afford the food prices.\nYou know, we're in a world market, all my plant protection, a lot of my plant protection\nproducts come from overseas.\nAnd if that's disruptions, if I can't put the right fertilizer, the right pesticide,\nthe right fungicide, we'll lose our crop in a week's time.\nContproducers have to have products, or weeds would absolutely consume the fields just\nin a matter of months or weeks.\nWe have to have consistency in agriculture.\nWe can't be relying on foreign products and foreign food in this country.\nAnd this legislation is a small avenue to guarantee that companies build a confidence to sell\nthese products in our country and our state.\nWe have the most affordable, abundant, safest food supply of any country.\nYou know what our life expectancy has done in the last 100 years?\nAnd our food production increased our life expectancy has increased.\nI just, I just so frustrated here, listen to some things I've heard and get away from what we need to do in this state.\nWe're talking about economic development.\nWe're talking about being the number one state to do business.\nWe've got to have a legal environment in this state that encourages it and encourages\nagriculture.\nWe've got great strengths in this state in our agricultural industry.\nIt's not just the growing, it's the ag businesses, the producers and the processors and the\ntransportation and all that we do in this state, environmental.\nWe've got to make sure that stays strong in this state, do not let the courts pull down\nour great economy in this state, our great ag economy.\nWe had Secretary of Agriculture Brooke Rollins here yesterday.\nWe met with her and asked her for a lot of things.\nWe talked about trade, we talked about research, we talked about farm income and the farm\nbill.\ny'all this is what we can do in our state pass this bill we can't depend on\nwatching them for everything this is something we can do right here in this\nstate to strengthen our ag economy and I and I food economy you know I know many\nof you ready to go home I am too and I said I'm going home and look at those\npeace blossoms but they're very vulnerable and I've got to help a\ntechnology, energy supply, labor, good weather, the Lord bringing sending rain and the good\ndirt in the sunshine. But we've got to have these products. I've got to have a supply\nof them. I can't, I can't just wait weeks to get something from somewhere else. I hope\nthe weather will, we're under attack.\nYou see it, this, this the litigation is coming after agriculture.\nAnd this is the first blow in my mind that I've seen it\nwitness his firsthand.\nWe got to fight back folks.\nYou got to stand up for your food supply for the cost\nthat we don't depend on foreign food.\nYou know, a lot of you are wearing green today.\nall the wearing the lucky charms and all that.\nYou know why we were celebrating St. Patrick's Day?\nBecause all the Irish moved to this country in 1850s.\nA million of them started to death in Ireland.\nAnd another million got on boats and came to this country\nto be able to find food.\nAnd I don't want my children and my grandchildren\nhaving a word about food.\nThat's why we need this bill.\nI hope you'll vote for it and support your food supply\nand my food supply.\nThank you, Mr. Baker.\nMr. Chairman, you're going to yield some time.\nIs that remained of the, Mr. Chairman,\nyou're going to yield the remained of your time?\nI'll yield the remaining of my time.\nChairman Leveritt, I think the chairman\nhad designated you to speak to the bill.\nThank you, Mr. Chairman.\nChairman Dickey has you were the well representative\nof the liberty is recognized to speak to the bill.\nThank you, Mr. Speaker, ladies and gentlemen,\nI want to just very briefly address a few issues\nthat have been discussed at great length\nwith regard to this bill.\nI obviously cannot talk to the need for the availability\nof these sorts of products.\nI think not the previous speakers have addressed that\nvery passionately and eloquently, they live it every day and so they know those issues better\nthan I do. What I want to just simply was to address is what I view to be the legal scope\nof the bill. So I do not view this as an immunity bill. I do not view this as a bill that\nreally limits many of the kinds of claims you would have as a user of a product. Products\nliability claims. The only claim that I, in my view, this bill adversely would impact\nis the failure to warn.\nAnd that space, to some extent, is already regulated\nand controlled by the federal government\nthrough that FIFRA, the federal insecticide,\nfungicide, and rodenticide act.\nThat already provides that manufacturers\nhave to register these products.\nThey have to disclose information to the EPA about them.\nAnd then they have to use on that product\na specifically approved label.\nAnd as some of the other speakers addressed,\nSome of this came because other states have been trying\nto require them to use different or additional labels,\nwhich puts the manufacturer in sort of a catch 22.\nThey have to use the federal label, nothing more,\nnothing less if they put something else on it there\nin violation of federal law and subject penalty.\nSo that's part of the issue we're addressing here.\nAnd as part of that, we're saying that as long as you're\nusing the federal label, you can't be found liable\nunder a failure to warn theory.\nThat's the only theory that this bill impacts.\nAnd if it's later determined that the company didn't disclose\nall the information that it had about the product,\neven that protection goes away.\nSo it doesn't prevent you from suing in negligence.\nIt doesn't prevent you from suing in strict liability\nand other kinds of claims that you could assert.\nAnd so admittedly, this does impact claims you could file.\nit does. But I believe you heard from the other speakers how on balance that is needed\nand I think given the limited scope of that impact, there are still other claims that\nare available, it's not like companies will never have to answer if they have put a dangerous\nproduct out into the use of the general public. So I would encourage you to vote for this\nbill because I believe it is a reasonable response to a problem that is being encountered in\nan agricultural business to preserve the use of these products because you've heard people\ntestify who know, who live it every day, how useful they are and how needed they are.\nAnd they're still as a source of recovery if people feel like they have been harmed\nby them.\nSo I would encourage you to vote for this bill and to the extent I have any additional\ntime left, Mr. Speaker, I'd like to yield it to Chairman Minks who sponsored similar\nlegislation in the house like this one the gentleman is you the well there is\ntime left on the chairman's time representative meeks is recognized to come\nback to the well thank you mr. Speaker\nyou know we've heard a lot of debate today about what this bill doesn't\ndoesn't do who it might or might not protect and ladies and gentlemen I\nstanding in this well, and when I speak to each of you, I look you out of eye. I'm not\nwilling to look you out of eye until you something that I don't believe. And then for one\nminute, I thought that this bill would weaken you, the one setting by you, the one in front\nof you, the one behind me or our families. I wouldn't be standing here. If it would\ntake away any right of you to take any calls of action, if it would lessen the\ncompany's ability to provide you information that you're supposed to get, so\nthat you can make an educated decision on whether or not to use a product. I\nwouldn't be standing here.\nComment was made earlier about products coming to the market, whether you know\nit or not is $350 million to put a product on the market and 12 to 14 years of\nresearch and I've spoken to our wheat scientists at University of Georgia who\nmakes the recommendations on the mixtures that we spray and that's not just\ncoming from the companies that's coming from EPA that's coming from researchers\nat research institutions that we value in our state such as University of\nGeorgia College of Agriculture and Environmental Sciences.\nI want to reiterate that if a company willingly withholds any information, ladies and gentlemen,\nit's federal law.\nYou've heard that.\nIt is the case.\nThey will, they will never again be able to register a product because they lied to the consumers.\nThey lied to you.\nThey lied to me.\nThat was made earlier about Dachamba drift.\nYes, that's right.\nIt happened.\nIt got pulled from the market.\nYou know why?\nBecause people in one state, not in Georgia, was not using the product as it was labeled.\nAnd because it was not labeled correctly, we have lost that as a tool in our toolbox\nto effectively manage weeds at others' walls.\nSo guess where we are now with the exception of one product is hand, we pull them by hand.\nTwo additional things and I'll close, Mr. Speaker.\nThe EPA regulates the label states regulate use of the product.\nA few moments ago when swapping with some text with one of the authorities in our state,\nI want each of you to know that in the state of Georgia,\nunder the pesticide control act,\neach of these products are registered annually\nin the state of Georgia.\nThat means our commissioner of agriculture, who you know,\nif he sees a problem with it, he can pull that product.\nHe can pull that label.\nBut ladies and gentlemen,\nI stand here to say that we're removing\nthe responsibility of a company to be forthright\nwith consumers, I couldn't stand here and look you\nin the eye if I thought that was the case.\nI would ask you to support House Senate Bill 144\nand continue to support our agriculture industry\nthat will continue to support and provide\nthe safest, most affordable, most abundant food supply\nof anywhere in the world.\nAnd without Mr. Speaker, I'd urge favorable consideration\njust set up bill 144 and ask for your green vote.\nWith that, Ms. Speaker, you're the well.\nGentlemen, as you were the well,\nthat completes Chairman's time.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the pastor of the bill?\nHere in the other report, the committee has agreed to.\nShall this bill now pass, all in favor of the passage of the bill?\nWill vote yes, all those opposed?\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nhave all members voted. All members voted. All members voted. If so, Mr. Clerk, will you\nlock the machine? On the passage of Senate Bill 144, 144, the A's are 101, the A's are 58.\nBill Hammers see the requisite Constitution majority is therefore passed.\nThat completes our rules calendar we're moving on to afternoon orders.\nmembers I won't give you a heads up on who has an afternoon order. I'm going to ask you\nto hold your afternoon orders to one minute. If humanly possible, humanly possible. I think\nYou can do it.\nChairman Ballinger, you're going to be recognized first.\nChairman Ballinger, it was not feeling well.\nAnd she's not here.\nSo I'll make that announcement after an order in just a moment.\nBefore you all leave, I'll go ahead and do it right now.\nMembers, we have several announcements. I want to make this one before I do one that we\nalso need to hear. But tomorrow, the 14th of this month would have been Speaker David\nRolston's birthday. And it is his birthday. His family will celebrate it. This\nhouse will celebrate the passing and the service of a good good man. So I\nwant to remind all of us, let's I'm think of the speaker Rolston on tomorrow as\nwe think about him. Remember him and think about his birthday and all the\ncontributions he made to this great state. I'm going to ask some of you\nI'm going to ask you to remain standing.\nRepresentative Park Cannon.\nRepresentative Park Cannon's recognized for an afternoon order.\nThank you Mr. Speaker and thank you members.\nToday I come to recognize Black Midwives Day in the state of Georgia,\nwhich is typically celebrated once a year in every state\nand to specifically talk about the eradication of black midwives and the good\nwork that we're doing in Georgia to bring attention to them. We do have a\nnumber of black midwives at the Capitol today and they are specifically here\nwearing white in honor of two midwives who passed away. One is known as\nMama Nazra. She was well known to this house and visited many times. She was\nthe best friend of former representative Abel Mabel Thomas and so you might\nremember seeing her with her best friend so we do miss Mama Nazra and those are\nthe members there who are here to be honored at the door Mr. Mr. Speaker so\nthat they can hear that we are speaking about them Mr. Speaker I think\nthat okay don't keep you can open the door but they're holding them there\nbecause we're having this announcement.\nYes, sir.\nI appreciate that.\nAnd so in honor of Mama Nasra,\nand then also Ms. Titi, who unfortunately has passed away\nas well, these black midwives are here.\nAnd I just thank you members for taking the time,\nwould ask for a moment of silence\nfor these two amazing black midwives\nwho serve Georgia families.\nThank you very much.\nThank you, Representative Cannon.\nRepresentative Mathis has recognized for an afternoon order.\nThen we'll have Representative Wade,\nRepresentative Owl, Representative Bell,\nand Representative Leveritt.\nRepresentative Danny Mathis.\nBoy, you need to do this one.\nRepresentative Danny Mathis, look over there.\nWe have-\nThank you, Mr. Chair.\nPlease screen.\nThat's my mother-in-law.\nShe turns 100 tomorrow.\nAnd she says I'm her best son-in-law because I'm the only one, but my wife, Ellen and her\nbrother are the only two children, Mrs. Lutley.\nMrs. Lutley was married to Mr. Billy F. Persher for 72 years, and he died back in 2015.\nSo I'm so proud of her.\nShe's doing well, she broke her hip a few weeks ago, but she came through it fine, we're\njust trying to get her back to where she was at that home.\nSo if y'all are pray for, I appreciate it, but she's been an inspiration to all of us\nin our community.\nAnd I'm going to keep this short, Miss Speaker, but I do appreciate it.\nAnd I'm glad to hear that Speaker Rofton's birthday is on the 14th, too.\nSo thank you very much for y'all's attention and support, and God bless y'all.\nI yield away.\nI think you can go home now to talk about my own law.\nSounds like she's a good one.\nHappy birthday.\nRepresentative Wade, recognize for an afternoon order.\nThank you, Mr. Speaker.\nI'd like to want to rise this to school board appreciation\nweek across Georgia.\nAnd I want to specifically highlight my hometown,\nDawson County, the school board members there.\nTwo of those members have served 20 years.\nAnd one other member is at 16 years, and then the other two\nin their fifth year but my special shout out is also that Dawson County School Board\nmade the decision to accept what the voters voted on on House Bill 581 and they opted\nin along with our county and our city to recognize that they still have milled rate that they\ncan use to just five increased revenues when needed but they are going to cap the rising\ncost of home ownership and keeping that cap based on what this legislature has passed\nin the citizens voted for. So shout out to Dawson Kenny School Board and go Tigers, thank you.\nThank you. Go Tigers, Representative Owl. We're giving blood again, Doc.\nAll right, let's hear about it. Thank you, Mr. Speaker. Just want to remind people that you still have\ntwo and a half hours to donate blood at our blood mobile. It is right outside the capital\nin the usual spot. I also got permission to share from Representative Reese's mom that she had\nalso received a blood transfusion during her time with us at the hospital and she\nwanted me to convey to you how important that was to her and that in donating\nblood you could also be part of someone's happy ending and a good story so\nthank you so much for donating thank you mr. Speaker I yield the well you\nmean I got to go do it today what time are they leaving all right that was ten\nyou just gave me five thank you representative is important I'm gonna do my best\nto get out there.\nRimsley-D-Bale, recognized for an afternoon order.\nThank you, Mr. Speaker, for the recommendation.\nColleagues, if you will help me wish, Monday's Mill High School Air Force J-R-O-T-C-G-A-2-0-0-5-2,\nthe Flying Tigers, a well-wish as they represent the state of Georgia as the only Air Force\na J-R-O-T-C program at the Air Force Nationals,\ndrill meat competition right now in Cincinnati, Ohio.\nThe flying tigers will compete against teams\nfrom across the nation and one, including Germany.\nTheir team members include cadet lieutenant colonels\nand mere peoples, cadet major,\nSeneta B, cadet captain, Emanuel Lopez, cadet lieutenant,\nCadec, Cadec, Cadec, Cadec, Lieutenant, the Sean of Grants, Cadec, Cadec, Cadec, AF1,\nJanai Niel, and Cadec, Amy L.\nL. Williams, they are led by senior master sergeant towards McGee and they're watching\nlots of you can wave and say, go Tigers!\nI yield the will, Mrs. McGee.\nI yield the will.\nI'm going to interrupt after the orders here just for a moment because a lot of people\nstepping out. I want you all to remember this and be looking your best on Tuesday.\nWe come back in session. We're going to do our panoramic excuse me.\nOur panoramic on photo. So be looking for your best on Tuesday and we'll get\nthat done. We come in session. We've not done it this year. So we'll do it on\nTuesday. So a couple of people left. We'll put it on the website and some of\nthe email out but remind all of our colleagues. We'll be doing that on Tuesday.\nRepresentative Leveritt, Chairman Leveritt is recognized right after an order.\nThank you Speaker, ladies and gentlemen. I just want to I'm proud today as I can\nbe because I have my Elberton staff with me here today. Aaron Butler and Casey\nPeters, if you all will stand up in the gallery, they're impatiently waiting up\nthere. So you can welcome to the Capitol. I'm so proud to have them working with me\nand it happens to be Aaron's birthday today. So I have some firepower with me\nwhere to go, there is, if Representative Sharper will lead us in a rendition,\nsing Aaron Happy Birthday.\nHappy Birthday to you.\nHappy Birthday to you.\nHappy Birthday dear Aaron.\nHappy Birthday to you.\nThank you, ladies and gentlemen, thank you, Representative.\nThank you Aaron and Jason, thank you for speaking.\nChairman Leverett, they told me a little earlier\nwhere we were talking about when we were speaking together\nabout who does all the work in your office.\nThere you go.\nYou'll be fine.\nJust keep your own board, whatever.\nI'd get a little bit more pay after today.\nAsk for a raise.\nReps the Decarter.\nRecognize for announcement and friends, I think.\nDo you have friends coming with you?\ncome on down ladies. Thank you, Mr. Speaker. If you all would take, I shouldn't, I wish I could have made that picture bigger, but anyway, this is my oldest living cousin.\nWe call her cousin Lila, but her name is Mary Morgan, and her birthday is tomorrow, and the last time she was here at the Capitol, she was actually here,\nand to the picture with Speaker Ralston\nbecause they share the same birthday.\nBut if you guys would indulge me,\nwe're gonna celebrate her Saturday.\nI wanna play this video of you all seeing\na happy birthday to my cousin, Leela.\nAll right, these ladies.\nOh, a same bird.\nCome on, y'all got it, yeah.\nCrazy.\nHappy birthday to you.\nHappy birthday to you.\nHappy birthday to you.\nHappy birthday, Cousin Leela.\nHappy birthday to you.\nWoo!\nHappy birthday, Cousin Leela.\nThank you.\nHow old is she 97 reps in baseball was baseball where she you gotta she's blocking\nYeah, nice blog, Representative Miller, Representative Baysmore.\nNo.\nThank you, Mr. Speaker.\nAnd can I have all of the South Folkton delegation up here, please, with me, that's left.\nSouth Folkton.\nEverybody.\nIt doesn't have to be the, it's not the city, but it's south-folded.\nCome on.\nCome on.\nThank you.\nCome on.\nOkay.\nJust wanted to acknowledge the fact that south-folded day was today,\neven though they have left for the day, we wanted to recognize that they were here in their house.\nSo thank you, Mr. Speaker.\nThank you.\njob. South Bolton. Reps that you're hearing, say change your hearings recognize.\nThank you, Mr. Speaker. I'm sorry, I didn't mean to cut you off. My daughter, Zayn\nGwyneth, turned 20 last Friday, but she was studying health care systems and the\nDominican Republic. So we're going to celebrate her birthday this weekend and I\nI just want to say happy birthday, Zion.\nShe's 20 years old today.\nWell, last Friday.\nHappy birthday, baby.\nLove you.\nMama's proud of you.\nCheerleader Lynn Smith is recognized for an afternoon order.\nThank you, Mr. Speaker and members of the House.\nSo if you'll turn and look up in the balcony,\nwe gave these students from the County School System\none of the best debate procedures\nyou could see firsthand.\nOur capital had a difficult issue,\nand we handled it with the Corm and good debate,\nand they got to see what it was like.\nSo welcome to your state capital\nwhere a bunch of awesome folks.\nThank you.\nThank you.\nThank you all for being with us.\nWe appreciate y'all.\nWe're Representative Hilton.\nWe're recognized for an after-nord\nand then Representative Reese.\nThank you, Mr. Speaker.\nJust a quick message for our Senior US Senator.\nWhile you may have failed to defend Israel's right\nto defend itself, while you may have failed\nGeorgia's female athletes, please do not fail\nour federal workers.\nPlease vote yes on the continuing resolution\nand do not shut down our government tomorrow.\nThank you Ms. Speaker, I yield the well.\nRepresentative Reese is recognized for an afternoon order.\nThank you, Mr. Speaker.\nMr. Speaker, I appreciate this opportunity\nto say happy anniversary to my wife.\nyesterday we celebrated nine years she was in Columbus I was here in Atlanta but\nI'm here at home this weekend\nscuffier little Luther Vendron's plan I saw what I'm saying I year the wheel\nDr. Reese is a beautiful lady I bet we spent some time together and she told me\nsome of your secrets I won't be sharing them\nThat concludes our announcements.\nOther than this one, a former member of this house,\none of the most beloved members of this house,\nhas a birthday ceremony as well.\nChairman Don Hogan,\nDon, happy birthday brother,\na good man, a good Georgia Southern guy.\nMuch beloved gentleman.\nNow we have some announcements.\nRepresentative Berry is recognized for an announcement.\nThank you, Mr. Speaker.\nIt's one of our mind folks that a land allegation will be meeting after a\nGerman at 3 o'clock PM and cap 216.\nThank you.\nRepresentative Adina.\nRecognized for an announcement.\nThank you, Mr. Speaker.\nColleagues, the Atlanta Caribbean Carnival brought some food with them.\nI don't want them to go back, they have some nice rice and peas, curry goat, curry rice, curry, everything is down in\nCap one two three get them because they don't buy three o'clock. So in a way, I'll grab a plate\nThank you, mr. Speaker\nChairman Parsons\nRecognize foreign announcement\nThere will be a meeting of the Energy Subcommittee of Energy Utilities and Telecommunications\nupon adjournment in 341 and I know some of you are here so we need to have you down there\nupon adjournment.\nThank you.\nAnother big birthday.\nI don't know which one this is but it's got around numbers all around it but Chairman\nMartin Newton has a birthday on Monday, say Patrick's Day, heavy birthday, Mr. Chairman.\nThat concludes our announcement, are paid.\nMajority leaders recognize for a motion.\nThank you Miss Speaker, I move that this house stand adjourned until 1 o'clock PM on Tuesday, March 18th, 2025.\nThat fits the day after same Patrick's Day.\nOn the motion of the majority of that this house stand adjourned until 1 p.m. Tuesday, March 18th, 2025.\nAll those in favor will say aye.\nI think you have it. All those opposed. Please say no.\nYeah, it was clear. The eyes have it. We're turning to 1 p.m. Tuesday, March the 18th.\n",
  "updated_at": "2026-02-12T17:55:42.431348+00:00"
}