{
  "video_id": "hHFEHtSbBpM",
  "url": "https://www.youtube.com/watch?v=hHFEHtSbBpM",
  "title": "Morning Proceedings Under the Gold Dome | Georgia House 2026 - Day 2 AM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": null,
  "duration_minutes": 54,
  "summary": "Here is a structured summary of the Georgia House 2026 - Day 2 AM Session:\n\n**Overview**:\nThe morning session featured opening remarks, introductions, and resolutions. No major legislation was acted on, but several bills were introduced for first reading. The focus was on kindness, community, and commemorating important anniversaries.\n\n**Key Actions**:\nNo bills passed or referred.\n\n**Bills Introduced (First Reading)**:\n- **HB 934**: Act to amend Title 7 and 45 relating to banks and finance\n- **HB 935**: Act to authorize a technology fee for the Thomas County Probate Court \n- **HB 936**: Act to authorize a technology fee for the Berlin Municipal Court\n- **HB 944**: Act to amend code section related to safe operations of motor carriers\n- **HB 945**: Act to amend Title 7 relating to banks and finance\n- **HB 946**: Act to amend Title 27 relating to game and fish\n\n**Notable Moments**:\n- Opening prayer and remarks focused on kindness, forgiveness, and love\n- Introduction of the new President of Mercer University\n- Recognition of the Korean-American community in Georgia\n\n**Votes**: \nNo recorded votes.\n\n**Attendance**:\nQuorum present, all members asked to come to the floor.\n\n**Adjournment**:\nSession adjourned, next session date not provided.",
  "transcript": "You\nThank you.\nWell good morning.\nYou\nYou\nAll members, all members, please come to the floor.\nor we're going to have the morning row call, just a minute ago.\nWe're going to have the morning row call.\nAll members, all members will please vote green to signify your presence in this chamber.\nMr. Clerk, will you unlock the machines?\nYou\nYou\nRepresentative Rice.\nHi.\nGood morning, everyone.\nIt is my distinct honor and pleasure to be here this morning and I'm going to start off\nfirst by introducing our new president of Mercer University.\nShe is a double bear and has been working with the University of Mercer University for\nthe last 25 years.\nSo it's a very distinct honor to get to represent her, and we have Dr. Penny Elkins, can you please\nstand?\nSo thank you very much, and we're very excited to have you here.\nAnd next is our chaplain of the day, ironically, does not need much introduction.\nAs we were waiting for this to begin, only two people crossed our path that they're not\nI already know, Dr. Jimmy, Dr. Jimmy.\nYou\nYou\nsharing a word and a prayer in my faith tradition.\nBut the truth that share is universal.\nI remember as a child that one of the first Bible verses\nI ever learned, and that's the one I want to use today,\nwas from Ephesians 4, 32.\nAnd be kind one to another, tenderhearted,\nforgiving one another, even as Christ, God for Christ's sake,\nhas forgiven you.\nYou know, kindness and forgiveness, those are universal truths.\nAnd that passage had an impact on my life from the very beginning, even to the point because\nit helped me gain a perspective on how to deal with people.\nof it, I have a love for it.\nYou\nYou\nStudents in creative writing because of the masterful way that it was written.\nAnd even Oprah Winfrey has praised Theo of Golden as one of the best books she ever read\ndescribing it as epic and transporative.\nAnd she notes that her favorite quote for 2026 comes from that book.\nFor anything to be good, truly good, there must be love in it.\nWell, I ask myself why in the world would this book from a man in Hamilton, Harris County,\nGeorgia, one of your constituents, how in the, or what do y'all's constituents, how in\nthe world with that book have such meteoric rise and so much interest on the part of people\nacross the country.\nLevi's book, I believe, is quenching a thirst that people have.\nYou\nYou\nAnd we're busy, and yes, we are a lot of times self-centered.\nYou\nYou\nYou\nYou\nIt would be satisfied every day, just a sip, just a moment, looking another person's face.\nAnd as you begin your legislative journey in 2026, I would urge you to remember to be\nkind one to another, tender-hearted, knowing that for anything to be good, truly\ngood, there has to be love in it. You do a remarkable job of representing the\npeople of the state of Georgia. I am so grateful for your service. My\nencouragement to and prayer for you is that the kindness that is the desire of\nyour hearts and of your being will dominate your spirit throughout this\nsession and in all things that are part of your lives. May God bless each one of\nyou. Each one of you as I look into your faces. Each\nYou\nYou\nThank you for reminding us about kindness and hope we'll see more of that in this house.\nThank you again for being here.\nYou\nYou\nYou\nMembers, you may greet brother Jimmy over the South Andy room.\nHe'd love to speak to you and offer you encouragement.\nSo we'll encourage brother Jimmy to go over the South Andy room.\nYou\nYou\nYou\nThank you very much.\nYou\nYou\nHere in none, the reading of the journal is the spits where there is an objection to the\nconfirmation of the journal.\nHere in none, the journal is confirmed.\nMr. Clark, will you read the resolution\nestablishing the order of business for the day?\nRepresentative, extension of 104th news,\nfollowing me establishes the order of business\nduring the first part of the period unanimous consent.\nIntroduction to bills and resolutions,\nfirst reading and reference of house bills and resolutions,\nsecond reading of bills and resolutions,\nfirst reading and reference of Senate bills\nand resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nHearing none, the resolution is adopted.\nYou\nYou\nMr. Clerk, House Bill 934 by Representative Williams, the 148th frustration 104th Williams into the 112th Jones of the 47th purchase of the 176th, the bill will be titled act to amend Title 710 and 45 of the fiscal to Georgia annotated relating to banks and finance.\nBanks and banking House will 935 by ribs and can in the hundred seventy second Taylor the hundred seventy-third\nThe bill be taught on act to authorize the assessment and collection of a technology fee by the probate court of Thomas County\nIntergovernmental coordination\nHouse will 936 by ribs and of can in the hundred seventy second of bill be taught on act to authorize the assessment and collection of a technology fee by the municipal court of the city of Berlin\nHand for government coordination.\nConstable 937.\nMy revison Brigadier.\nThe soft君.\nparticle strength.\nYou\nYou\nNow House Bill 944 by Rosenmick Donald 26 crow the 118th Hitchens London 61st and Lumps\ninto the 12th Bill be taught an act of men code section 41 8 of the physical to Georgia\nand annotated relaying the safe operations of motor carriers.\nMotor vehicles.\nThat's about 945.\nI represent a Williamson in the 112 Williams, the 148th and Chastain in the 7th.\nBill B. Todd and Acto.\nMen, title seven.\nThe official go to Georgia and say to relay in the banks and finance.\nBakes and banking Houseville 946 my reps I've flipped into the hundred thirty first rows the hundred twenty four\nThirdly the six Kelly the sixteenth cannon the hundred and seventy second and others\nThey'll be titled act to amend titled twenty seventy the physical to Georgia annotated relaying the games and fish\nYou\nYou\nThe sacredness of America's 250th anniversary, the Declaration of Independence on July\n24th, 2026.\nSpecial rules.\nHouse resolution 1,000 by\nReps and a Vestration 104th\nWilliams, the 148, Tickley, the\n134th Williams, 168th, Buckner,\nthe 137th and others.\nA resolution proposing an\namendment to the Constitution\nso to eliminate the ad\nValorum tax assessment of\ncertain timber at sales or\nharms.\nWays and means.\nHouse resolution 1,000 by\nRebsland of Bell 75 Sanchez to the 42nd.\nRomano the 97th, Holly the 116th,\nbetween the 61st and others.\nA resolution expressing support for the ethical investment\nof all state funds and public resources.\nSpecial rules.\nHouse resolution 2007 by Rebsland of Jones\nthe 25th out over the 84th scope field.\nThe 63rd, Dempsey the 13th.\nYou\nYou\nOkay members, you need to take part of these conversations to the any room.\nThat was empty, and that one is too.\nThank you.\nYou\nYou\nMr. Clerk, will you read?\nHouse Bill 932 by represent Sains of the 180th Ballard of the 147th Bonner of the 73rd needing to know the 127th to load to the 167th and others.\nbill relating to tax credits for business enterprises in less developed areas, three second\nWe have no report from standing committees, so we'll move on to morning orders.\nWe're welcome down, Representative Davis, but now,\nRepresentative Sheila Jones, Representative Jackson.\nYou\nYou\nHere we go.\nWe are a friend!\nYou\nYou\nYou\nYou\nThe influence of Korean Americans may be observed in all facets of American life from politics\nto industry, entrepreneurship to volunteerism, the arts, sports and education.\nJanuary 13th, 1903, 102 Korean Americans first immigrated to the United States. Currently\nmore than 100,000 Korean Americans call Georgia home and Korean is the third most spoken language\nin Georgia. We have several members and leaders of the Korean community here up in the gallery\nIf you can stand up, and if we can all give them a round of applause.\nThank you, and thank you.\nYou\nYou\nI think the Susan Jolly Foundation, the Georgia Cancer Controls Consortium, and cancer pathways\nfor the exemplary contributions to cervical cancer education and awareness in Georgia.\nCommending Delta Sigma Theta Sorority Inc., there are 113 years of service from recognizing January 13th,\n2026, is Founder's Day, recognizing the Rustin Lord Community Breakfast,\nand for other purposes that completes the reading of the Privilege Resolutions.\ncomments.\nYou\nYou\nThe recognizes representative Willis for an afternoon order.\nChair recognizes representative Crawford for an afternoon order.\nThank you, Madam Speaker, Pro-10.\ntoday is with sadness that I stand to remember the greatest woman that I've ever\nknown, my mother, who left this earth that there a long battle with breast cancer\nand she passed on December 29th, 2025. We've said our goodbyes on January 10th. I\nwant to thank everyone who called, sent text messages and came to support my\nfamily. She was an incredible, captivating woman. She and my father met when they were\nin college at Florida NM. She would come down and you know just surprise me. That picture\nthat you see was on my father's birthday. They surprised me one day. If you met her,\nyou loved her. And I know many of you in here met her when they surprised me. She and\nmy father would watch every single session together. So I know my father is watching right\nnow that I want you to know that mom is still with us.\nRemember your marching orders that she gave us as she passed\nand that was for us to continue to love each other\nand continue to work out that, get your miles in.\nI know that I will.\nI know that I'll remember miles for mom.\nCancer guys is a very ugly disease\nand I'm asking you that cancer took my mother from me.\nI want you guys to help me to fight cancer.\nif you would please pause for a moment of silence.\nThank you.\nMs. Carolyn Crawford, you are the greatest woman\nthat I've ever known.\nWe'll always love you.\nThank you.\nGood job.\nThank you.\nThank you.\nThank you Madam Speaker, colleagues, I just want to come to this spot today to do what\nWe could not do yesterday because we had so much going on yesterday, but yesterday Chris Bruce and the ACLU and invisible came for their advocacy day and normally we would have recognized.\nYou\nYou\nI've got to ride a monster truck a couple years ago so congratulations Shannon Henry and\nsafe house and all the folks at the Bank of Day. Thank you.\nChair recognizes Representative Mitchell for an afternoon order.\nThank you Madam Speaker.\nI come today before you to recognize one of our colleagues that is doing some great things nationally.\nOver the summer he was named, elected the National President of the National Council of legislators from gaming states.\nStates. He is our chambers recognized authority on gaming issues and that is some\nfeat considering that we haven't got there yet. Would you help me\nYou\nYou\nThe chair recognizes the majority leader for a motion.\nThank you, Madam Speaker.\nI move that this house stand adjourned until Wednesday, January 14th, 2026 at 11 o'clock AM.\nOn the motion of the majority leader, this house stands adjourned and please note 11 AM,\n11 AM, tomorrow, Wednesday, January 14th, 2027, all those in favor say aye.\nAll those opposed will say no.\nThe eyes clearly have it and this house stands adjourned.\n",
  "updated_at": "2026-02-12T11:03:10.279296+00:00"
}