{
  "video_id": "hhpmCFndW1g",
  "url": "https://www.youtube.com/watch?v=hhpmCFndW1g",
  "title": "3/21/23 Committee on Banking & Financial Institutions",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 25,
  "summary": "Here is a structured markdown summary of the Georgia 3/21/23 Committee on Banking & Financial Institutions session:\n\n**Overview**\nThe committee discussed the recent failures of Silicon Valley Bank and Signature Bank, and heard from the Georgia Department of Banking and Finance on the state of banking in Georgia. The discussion focused on how Georgia's banks differ from the failed institutions and are in a stronger position.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The committee chair proposed appointing a subcommittee to work with Representative Barrett over the summer to \"perfect\" his bill.\n- The chair introduced Tony Hears, who provided an overview of the state's banking regulatory oversight and contrasted the failed banks with Georgia's more diversified and prudent institutions.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present, though specific attendance numbers were not provided.\n\n**Adjournment**\nThe meeting adjourned, with no mention of the next session date.",
  "transcript": "You\nYou\nSo we'll move, we'll move our, we'll, we'll open the meeting here.\nRepresentative Barrett, Carter Barrett, how are you, sir?\nWe're glad to have you today.\nRepresentative Barrett, if it would be the pleasure of this committee if you would allow us\nto appoint a subcommittee on your bill and work with you over the summer to get this\nbill perfected.\nThis bill's got a lot of good parts in there and I'd like to appoint a subcommittee if\nthat sounds good to you and we'll move your bill that way.\nThat's, let me see your own number two.\nIf you're on number two, if anything,\nyou want to say to us what I point to setting me to anything?\nNo, I'm just delighted at that idea.\nIt's a great idea.\nAnd given the unusual circumstances in the economy\nand banking today, the timeliness is perfect.\nSo thank you, folks.\nAbsolutely.\nI really appreciate you working with us.\nAnd we're trying to obviously come to a great bill.\nI'll appoint Senator John F. Kennedy\nas the chairman of the subcommittee,\nSenator Sonja Halpren and Senator Mike Hodges, if you three will, you two will serve on the committee and get this thing done here and\nHopefully we'll bring something back to us and we'll be able to\nHave us good bill very good sir. Perfect. Please stay with us because we're fixed have something very enlightening here from our\nOur resident person who knows about banks. Mr. Boefears is gonna come talk to us about the state of banks in Georgia\nI can't think about a more interesting topic. Thank you representative. Thank you so much\nThank you, gentlemen. Thank you. Come on up, Mr. Fears. Hey, Tony. How you doing? Thank you. Thank you.\nMr. Fears, it is wonderful to see your smiling face here today. Thank you for making changes in your schedule to accommodate us. I apologize about us getting pushed back. And I apologize by always getting seems like we are schedules get kind of cramped up together.\nBut I think it's extremely apparent\nthat we hear from folks that knows about the banks,\nunderstands about the banking conditions,\nwhat's going on in the United States today in some areas,\nand tell us how strong our banks are in Georgia.\nAnd if you don't mind, I'll turn the floor over to you, sir.\nWell, thank you, Mr. Chairman.\nI appreciate the invitation and the opportunity\nto address this committee and talk about the state\nof banking in Georgia.\nIn light of the recent failures of Silicon Valley Bank\nin California and signature bank in New York.\nThere is, I think, there is fear and uncertainty\nin the market, and that's really understandable\nwhen you see what's playing out,\nhow it's being presented in the national press,\nand also what I would probably term\nas a dangerous speculation on social media.\nHowever, notwithstanding how it's being portrayed\nin certain circles, the state of banking overall\nthis country is very strong, and that's especially the case in the state of Georgia.\nThe department, for those of you who are unaware, we have two primary business lines, and the\nfirst is the non-depository area where we regulate money service businesses, which include\nmoney transmitters and check cashews.\nWe regulate mortgage lenders and mortgage brokers, and we regulate small dollar lenders.\nThe other side of our business is the supervision side, and we regulate banks and credit unions.\nAnd so part of that regulatory oversight involves routine regulatory examinations, where we go\nin, us and our federal partners, and we look at the condition of our banks and credit unions.\nAnd sort of the examination, what we do, it's called, there's a camel's rating that comes\nout, and that stands for, we're looking at the institution's capital, we're evaluating\ntheir assets, we're evaluating management, we're evaluating earnings, and as relates\nto kind of what specifically is happening right now we look at liquidity and we look at\nsensitivity to market risk so we look at interest rate risk and we do that with our federal\npartners and then when we're not conducting examination though we're getting routine\nreports from our banks and we are making sure that there's no outliers there's no issues\nin those reports and if we see anything that causes any concerns we reach out to our\ninstitutions and we work with them until we feel that we have we understand the\nreason for that outlier and we do that until we're satisfied. So that's kind\nof the general overview of what we do. Specifically as it relates to Silicon\nValley Bank and Signature Bank because they are chartered in New York and\nCalifornia. They're not chartered by us. I do not have any special insight on\non those institutions.\nI do, you know, I'm able to look at what is publicly available\nand look at that data and so I'm able to determine\nand the department has been able to determine certain\ncharacteristics that are present at those institutions\nor were present at those institutions\nthat are not present, those characteristics are not present\nin our state chartered institutions.\nAnd I'll just try to identify a couple of those\nfor the committee but first before I do that,\nI do want to emphasize a very important point is that deposits are insured by the federal\ngovernment.\nThe FDIC insures deposits.\nAnd a penny of insured deposits has never been lost in this country's history.\nAnd so the deposit amount, typically people will reference there's a $250,000 deposit\namount, FDIC insurance, but your bank relationship and the FDIC, that relationship can be structured\nso that you get greater coverage than the $250,000.\nSignature and Silicon Valley Bank, it's important to recognize that they had a number of uninsured\ndeposits.\nI think the signature bank was roughly 90% was uninsured according to public reporting.\nSilicon Valley Bank was higher than that, and that's a high number.\nBut the federal government, even though those were uninsured deposits, the federal government,\nthe FDIC, the Treasury, the Federal Reserve, and President Biden determined that these\nbanks posed a systemic risk.\nAnd so all the deposits, whether are insured or uninsured, were covered for the depositors\nof those two institutions.\nSo kind of stepping into, so going and looking at the characteristics of these institutions.\nThe first is both of these banks focused on providing services to technology-type companies.\nSo fentex or the venture capitalists who support those fentex or cryptocurrency companies.\nThey had a concentration in that area.\nIt's important to remember that within the last year or so, those companies have struggled\neconomically, and there's been a number of layoffs and FinTech companies in the crypto\nspace and a number of those entities have filed bankruptcy.\nIn Georgia, we don't have that concentration, right?\nWe're much more diversified, I'm unaware of any Georgia state chartered bank that even\nbanks a crypto company.\nSo we do not have that concentration.\nA second distinguishing factor is the level of uninsured deposits.\nAs I indicated, those uninsured deposits, according to some publications, were 90% or more,\nthere is no Georgia State Chartered Bank that even comes close to approaching that number.\nAnd so because of that, those deposits have a tendency to be volatile, especially if\nthere's any loss and confidence in the institution.\nSo what appears to have happened with Silicon Valley Bank is that information was disseminated\nby social media, the depositors lost confidence in there, and they withdrew their funds, fearing\nthat they would lose access to the funds in the uninsured deposits, and that the bank\nwould fail.\nWhat happened, though, is that was a self-fulfilling prophecy, because they withdrew the funds\nthan they failed, even though that bank had assets far\nin excess of its deposit liabilities.\nSo it was technically solvent by $40 billion,\nbut it was a liquid.\nSo that caused that failure.\nAnd the final distinguish, the final piece\nwas the security portfolios of these institutions.\nAnd so what has happened during the pandemic,\na number of banks, they were flush with deposits\ncoming into their bank.\nBut there wasn't a lot of loans to be made\nbecause all these PPP loans were made to these institutions.\nAnd so they were flush with capital, and they were forgivable.\nSo there's no reason to borrow from a bank,\nbecause you already have this money.\nAnd the banks needed somehow to deploy it,\nso they put a lot of those funds into securities.\nAnd when the interest rates were relatively flat,\nthat was fine.\nBut within the last year when there\nhad been the interest rate raises,\nthat's created unrealized losses.\nSo essentially paper losses in the bond portfolio, right?\nAnd so with Silicon Valley Bank, I think that on Wednesday,\nso two days before it failed, it\nannounced that it had liquidated a portion\nof its securities portfolio, roughly $20 billion.\nAnd it had to realize of loss of $1.8 billion.\nAnd that was made publicly available.\nAnd that's what fueled the crisis, or fueled the run.\nI think it's worth noting that currently most banks\nhave unrealized losses in their securities portfolio.\nBut that's very important because it's unrealized losses.\nThey're not recognized.\nAnd there's still worth the same thing\nwhen they actually redeem them.\nAnd our banks have done a very good job of accounting\nfor that interest rate risk by hedges or other mechanisms.\nSo they do not have that same exposure.\nBut I think what's very important to emphasize\nis because the Fed recently issued a,\nthe Federal Reserve, I apologize,\nissued a liquidity facility in light of these recent failures.\nIt's the bank term funding program.\nAnd what it does is if a bank pledges\nthat securities, the securities at collateral, as collateral,\nthe fund, the facility will provide funding\nin the face amount or the power value of the securities\nas opposed to market market.\nSo if the security is say $1,000,\nthey'll get $1,000 back instead of the haircut at $900.\nAnd so what that means is if this facility\nhad been in place two weeks ago, Silicon Valley Bank\nwould not have had that significant loss of 1.8 billion and my hypothesized that neither\none of these banks would have failed and so they would have been around for years if that\nhad happened.\nSo based on those three characteristics, we don't have those in our Georgia State Chartered\nBanks and so I'm very confident in the safety and the strength of the banking system in\nthe state of Georgia.\nWith the parameters you all have in place, is my understanding, you know, you could almost\nforesee a bank that's not, you know, working or getting their job done before it would\nfail.\nYou'd be able to know in Georgia because we have these parameters in place.\nYeah, so I think there's, if you look at Georgia, like if you look at our history right\nduring the Great Recession, we had a number of banks that failed, right?\nAnd but those none of those were liquidity failures, those were all capital failures.\nAnd so you have an incredibly long runway for lack of a better word.\nUnder federal law, it's prompt corrective action.\nOnce a bank goes drugs below two percent tier one common equity capital, the FDIC has\nto take possession within 90 days unless that institution is able to raise its capital.\nSo because of that, if you look kind of good to step back to the great recession, even\nthough we had a number of state charter banks fail, the FDIC was able to find acquires,\nwe was called a whole bank purchase, right?\nAnd so both the insured and the uninsured deposits were acquired.\nWe had a handful of banks, I think it might have been three, where the uninsured deposits\nwere not acquired, but because we had that long runway, bankers would work with their\ncustomers to structure their deposits so that very, very few Georgia\ncustomers, I mean, 10, approximately, in this 81 banks failing, lost any\nfunds. So to that extent, we do. With a liquidity failure, you know, that's,\nyou know, at least if you look at Silicon Valley Bank, right, and you look at\nsignature. It's a Silicon Valley bank. It's social media fuel, right? So this is\nsomething that we didn't see during the Great Recession. This is something that's\nthat is very different. I think another thing that's important, so it's it's\nthat social media driven and and so that creates some concern about how how that\nand this certainly plays out the run on the bank the run on the banks for\nexample and so part of it because it is social media fueled and it's also the\nthe change in banking like mobile banking so you know if you look at it it's a\nwonderful life everyone wants to kind of make the run the bank they talk to\ntheir banker their banker discourages them right explains how safe the\ninstitution is how you can structure deposits well that doesn't happen now so\nin Silicon Valley bank I believe there was an effort to withdraw 42 billion\ndollars in one day, so which is pretty significant if you're $160 billion in deposits.\nSo that's kind of hard to anticipate that, but there are, again, if you have access to\nliquidity, and I think the Federal Reserve's liquidity facility that I just mentioned,\nright, where you can get your securities at par of value, as well as other, you know,\nHLB lines, the Federal Reserve discount window, when you have access to that, there is adequate\nliquidity in the system.\nWell, the concern was that, you know, people, 2007-2008, and we had the big issue with,\nyou know, the meltdown, whatever you want to call it, back in those days, where people\nwent underwater in banks, obviously, with lots of banks in town, it's an entirely different\nsituation that we're facing today.\nI mean, they're not the same animal is the real state being in a water which created\nall this landslide effect.\nYes.\nAnd I think that, and I do agree that it's different, but I think the reality is you're looking\nat massive, unsure deposits of these institutions, right, which we do not see.\nYou're looking at having to recognize losses in the securities portfolio, which we would\nBut not have to do now, and because of A, steps that have been taken by the banks, but\nB, the Federal Reserve's liquidity facility.\nAnd C, you've got massive concentrations in industry that is having significant economic\nissues right now.\nAnd we do not have that.\nWe don't see that concentration, so it's very different.\nWell, I think it's extremely important that people at Georgia realize that Georgia Bank\nand Commission and Georgia, the politicians in Georgia, Georgia State, the whole people\nWe support the banks, I mean, our banks are in great shape,\nand I wanted people to hear that.\nI wanted people to know it.\nAnd I only got any questions from the committee.\nAnd I want to ask some questions.\nI want you all to know.\nExcuse me.\nTen.\nTen.\nThank you, Commissioner, for giving us that report on Georgia\nbanks and the charter.\nWhat about those big banks operating Georgia that\nare not Georgia charter banks?\nFor example, Truace as an example,\nthat's a North Carolina charter bank.\nYeah.\nSo, again, I don't have any unique insight into those banks.\nWe do not regulate them.\nState of North Carolina regulates them\nor say Bank of America they're regulated by the OCC.\nWhat I, those institutions overall,\nI think that they're equally strong\nbecause they do not have those concentrations,\nthey wouldn't have to realize those losses.\nWhat I would say is that we have been in daily contact, sometimes multiple times with\nregulators, both at the state level and at the federal level, discussing the banking\nenvironment in this country and what they're seeing and concerns they're seeing.\nAnd I can say overall in this country that regulators are not that concerned about what\nthey're currently seeing in the institutions, it's especially true in the southeast.\nAs it relates really to the bigger banks, the report that we are hearing is that they're\non the whole, that there are net inflows of cash instead of outflows of cash.\nSo I think what's happening is you're seeing customers of Silicon Valley Bank and Signature\nand maybe other banks that are maybe Fintech focused or crypto focused, they're taking\ntheir funds and they're moving it into what they view as safer banks, more diversified\nbanks.\nThank you.\nThank you.\nThank you.\nNumber eight.\nThank you.\nSenator Hodges.\nThank you, Commissioner Fair.\nThe instance that you were talking about earlier during COVID there was a lot of money put\ninto the bank system, a lot of federal money.\nAlmost all the banks were flush and you were right, loan demand was terrible because of\nthe PPP loans. So there was a lot of investing, an awful lot of investing, most banks, some\nbanks didn't, some banks stayed short, approved to be smart, but a lot of banks bought\nTreasury's bought agencies and with rates going up, I mean you can see the issue when there's\nliquidity, you know, liquidity run or liquidity demand and you have to sell some securities\nthat you have a loss in, which is what happened with Silicon Valley.\nMy question to you is the banks in Georgia that what is the availability of that Federal\nReserve liquidity facility to the banks in Georgia that most of the banks that you\nregulate, I'm sure there's some non-member banks there, you know, non-holding company\ntype situations. So, is everybody, can any bank, every bank in the United States, can\nget into that facility and they just basically, if they've got, like you said, a $1,000\nbond and it's because it's at a higher interest rate or a lower interest rate, it's now worth\n$800. You can get $100. You can get $1,000. You get $1,000. That's wonderful, isn't it?\nIt is a wonderful facility.\nAnd also, I'll ask you to mention again how you're working with other regulators, you're\nworking with the FDIC, you're talking because again there aren't just small banks in the\nstate.\nThere are some large banks.\nCorrect.\nYes.\nSo we're working with the FDIC, the Federal Reserve, the office of the Comptroller of the\ncurrency. We have daily calls with you know it's hard to say that it's every\nstate regulator but every state regulator is invited and you know we're\ndiscussing trends that we're seeing outflows and flows of deposits and you\nknow facilities what we can we're I mean we're having conversations about\npotential acquires for institutions. So it's a very far-reaching discussion.\nOne last question. Do you happen to know the percentage of uninsured deposits in\nGeorgia? I think that the so that's a tricky question. And the reason I say it's a\ntricky question is, A, when you sometimes when you pick up uninsured deposits, so\nif I have $251,000, right, that's even though only 1,000's uninsured, it's\ngoing to pick up the entire amounts $251,000. I think also the call report, as you know,\nis incredibly detailed information and it goes into liquidity and it pours into that.\nBut it does not necessarily capture everything. And I think as the commissioner has frequently\nhe said, is liquidity is more an art than a science.\nAnd so, for example, we look at the data,\nwe'll see what's reported as the uninsured amounts,\nand then we'll reach out to our institutions.\nAnd we'll find out, well, let's say that it shows\nthat they have 30% uninsured deposits.\nWe'll reach out to them when we determine, well,\n10% or 15% is collateralized because they're public funds\nand they're fully collateralized.\nSo we've got to pull those out, or that they use intrafi or C-dars, which are programs\nwhere you can take the deposits and send them to other banks so that you get fully insured.\nAnd so it's hard to quantify, but it nowhere approaches 90%.\nOkay.\nMr. Chairman, I just one final comment is that in almost 50 years in the banking business\nI've been through a number of really scary times and I think the recession 2009-10 was probably\nthe scariest time.\nI commend the state regulators and federal regulators for putting our banks on a path to not\nbe in that position again, to have better capital, to have better reserves, to watch our\nliquidity and I appreciate as a banker and as a bank customer, as a bank shareholder,\nand a regulator, and excuse me, a legislator or a good job that you guys have done.\nThank you so much.\nThank you.\nMr. Fears, thank you.\nThat was in the state of the states of banks.\nWe'll call it in Georgia.\nThere you go.\nWe needed that.\nIt was good to hear.\nIt's refreshing to know that it folks like you are watching over, so make sure they're\ndot-nies and crossing tees. Thank you. That's what it matters. I like to take this moment. Thank\nthe committee for our for our year this year. This is probably our last meeting unless something comes\nup and I don't know about in our in our time frame. Wednesday night is our committee dinner,\nsupper and night. Pure talk of Rhea. Please know that's 6 p.m. Is that right? 6 p.m. I want to thank\nMs. Emily and Ms. Sarah. They make everything happen in our office. You can't ask for any better\nfiner people than these two girls right here and whatever happens to them. I hope they\ncome back with us next year. I really do. I like to recognize our state treasurer, Steve\nMcCoy, Steve. He's been exciting working with you. I've learned a lot from you. I can\ntell you right now you confuse me every time you tell me something. So I just want you\nto know that. But I really appreciate your knowledge and your intelligence on that\nlevel. But thank you kindly, sir, and that. And last but not least, you know, he's been\nIt's been fun chair in the banking committee.\nI've met a lot of friends.\nI've learned a lot of new things.\nAnd I hope that we continue next year\nand hope we're as positive this time next year as we are again.\nAnd once again, thank you for rearranging your schedule\nto come and speak with us, Mr. Fears.\nIt was very kind of you.\nThank you very much.\nAnd I appreciate the opportunity.\nMeeting adjourned.\nThank you.\nWell done, Mr. Chair.\nThank you.\n",
  "updated_at": "2026-02-12T03:21:41.143795+00:00"
}