{
  "video_id": "hI03ViZkSGk",
  "url": "https://www.youtube.com/watch?v=hI03ViZkSGk",
  "title": "Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": null,
  "duration_minutes": 52,
  "summary": "Here is a summary of the Georgia Joint Appropriations Subcommittee 2026 - Day 8 AM Session:\n\n**Overview**\nThe session focused on presentations from the Georgia Department of Transportation (GDOT) and provided an update on the state's transportation budget and infrastructure costs.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The GDOT Commissioner recognized the work of GDOT employees and other state agencies in responding to recent winter weather events across Georgia.\n- The Commissioner highlighted the challenges with the federal transportation budget process, including the current continuing resolution and the potential impact of a government shutdown on project funding and delivery.\n- The Commissioner presented data on the significant inflationary pressures impacting transportation construction costs, which have increased by around 70% since 2021.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe session appeared to have a quorum, with both the Subcommittee on Appropriations Chair and the Transportation Policy Committee Chair present and participating.\n\n**Adjournment**\nThe session adjourned, with the next meeting scheduled for a later date.",
  "transcript": "Good morning. This is the subcommittee on transportation appropriations meeting jointly with the transportation policy committee.\nSo appreciate everybody being here. Feel free committee members to move up to the front with the packets right on the table.\nIf you don't have one in front of you there on the first three rows or first two rows, it looks like appreciate our staff.\nDavid and Danny, getting those, making those available to all of us, and like I said,\nI'm John LaHood, Chair of the Subcommittee on Appropriations.\nGood to be with you. We're going to hear presentations today from the DOT and CERDA, and I've got\nChairman Rick Jasper's with us, and I want to ask him to, if he has any remarks.\nJust real quick, thank you members for being here so early.\nThank you, Chairman of the hood, for putting us together.\nI'm able to help Russell, Janine, with their time,\nnot have to come to another committee meeting.\nGo ahead and knock this out.\nI just want to recognize, we have a DOT board member,\nJoe Stein, from Versailles County.\nJoe, you can stand up so they can see\nand welcome you if you'd be in here today.\nAnd members, I want to also recognize Danny Nichols.\nDanny's right down here on the end.\nYou can stand up so I can see you.\nYou know, she's our policy analyst, you know, this year,\nand we're glad to have her.\nThank you, Mr. Chairman.\nBack to you.\nThank you, Chairman.\nThank you, Chairman.\nI second what Chairman Jasper has said.\nYou know, we lost Abbey Day, who has been here for...\nfor it. I had to call her out. She was a wealth of knowledge to me as my first year in this\nrole last year, but Danny and David have really picked the ball up and I don't think we\nskipped a beat. Obviously you prepared us all very well, so thank you. We will go ahead\nand get started. We have an hour. We're already seven minutes into it because rules is meeting\nhere at nine. So Commissioner McMurray, if you'll go ahead and come up and present your\nshow us your presentation.\nTo both Chairman, thank you for combining this. We do appreciate that. Nothing like efficiency.\nSo thank you all for pulling this together. But I do want to take a point of privilege just\nfor a minute to thank the women and men of GDOT and of all state government. In fact, for the\nwork that's been going on since last Thursday to Friday, where we started getting\nready for this winter weather and they did a fantastic job, dedication and\ncommitment of the men and women of Gidas, outstanding. We had people that left\nhome on Friday morning and some of those are just going back home today. So we\nbring you up our crews from Tifton and Jessup districts anytime there's a\nof winter weather event across Metro Atlanta. They come up and they're actually, you know,\nbrining and plowing. The interstates here in Metro Atlanta and our other districts work\nour way north. So they did a fantastic job. I've yet to get to final numbers, but we put\nover two million gallons of brine out. And at one point we were about 3,500 tons of\nsalt 2500 tons of aggregate spread and again 12 continual 12 hour shifts this\nmorning and they're still I believe as of the report I had this morning I think\nseven state routes that are still closed at some point those hardest hit\ncounties still Habersham white union towns Ravens sort of that north east\nGeorgia corner we call it the Golden Triangle from where I'm from a beautiful\nplace, but still dealing with that, power lines, trees and power lines, but working to\nget those roads open.\nAnd also a big shout out to our GEMA team who leads that there's a quarterback, GEMA\nfor leading this and the Department of Natural Resources and Georgia Forestry Commission\nfor their chainsaw strike teams.\nThey've been working very hard to get the trees out of the road so we can get the roads\ncleared out.\nSo just wanted to acknowledge that.\nWhat I want to do today is walk you through some important data points relating to transportation\nand the cost to do in business because we really need to understand those costs as it\ninforms us in the budgeting process and I want to also share some of the outputs and some\nof the outcomes from a couple of two budget years, the current budget year and last budget\nyear to show you how we're deploying the resources that you have afforded us when you\napprove the budgets and then finally I'll just jump into this budget, this\namended budget year FY26 and when I spoke here to joint appropriations I talked\nabout acknowledging some realities so one of the realities I need to acknowledge\nis what's happening on the federal front because the federal funding to\nGeorgia DOT is still very important at somewhere around 1.5 to 1.6 billion\nbillion dollars a year. And we all know that the federal budget year begins on October\n1st and I think everybody is aware at the federal level that we're operating under a\ncontinuing resolution to January 30th. When we work under continuing resolutions federally,\nthe way it happens, the way the money flows from the federal government is they give you\na daily pro-rata share of your total budgeted amount.\nAnd so you get 1,365th share for the days\nto get us through January 30th.\nWell, that's really not a way to run a business\nbecause when we do a project,\nwe need to fully fund a project.\nI can't daily give a daily pro-rata share to a project.\nNow, I think everybody has seen at Congress\nlast week the house passed a mini bus\nthat had four big budget programs in it.\nAnd that included the U.S. Department of Transportation\nwhich has the federal funding in it.\nThat did pass the house.\nI think you've seen the headlines recently.\nThe Senate seems to maybe want to decouple\none of those budget programs out of that minibus\nthat's passed.\nAnd so I'm not sure what that means,\nbut it means we're getting really close\nto September, I mean to January 30.\nAnd if it doesn't happen, then they're potentially again\na government shutdown or the stop of money.\nSo we're watching that very closely.\nThe other thing we do every year is the federal government\nallows you to do a IOU.\nAnd so basically, you can pay it forward with a Georgia dollar\nand when the federal budget passes,\nthe federal government will reimburse you\nfor the money that you expend it.\nThey approve everything along the way except the money.\nThey just say, here's an OU.\nAnd when we get to this point of the calendar year,\nwe pay it forward to keep projects moving.\nWe want to keep projects moving as fast as we can\nand not delay projects.\nBut we're using our state budget to do that.\nAnd at this point of the year, we've\nused and consumed our state budget, which should be federal,\nand our state budget to do state funded projects.\nSo we're about to, we don't want to get ahead of our skis\nand expend all our money waiting on the federal dollar.\nSo it gets to be a tricky point of delivery.\nVery complicated budgeting process,\ncertainly a accounting process,\nbut just wanted to highlight that\nbecause if there's a shutdown at this point\nor this gets delayed more,\nit will impact our ability to advance projects,\neither design right away,\nand certainly for construction phases\non federally funded projects.\nSo if that's not good news enough on this next slide,\nI'm going to take you a deep dive early in the morning\nand into a chart here that I've shown both the subcommittee\nand the transportation committee over the last few years.\nAnd it's really the inflationary cost related to transportation.\nSo this chart, this complicated chart\ncomes from Federal Highway Administration.\nAnd the red line tracks actually the cost\ndoing business from around the nation for highway construction. So they index the cost of highway\nconstruction from actual bid data from every state. And so you can see that's the red line.\nAnd since 2021 it's increased to by about 70%. So the index has gone up 70%. So you can say there's\n70% more on average across the nation than it did in 2021.\nThe CPI that we're all everybody knows about and understands is that blue line.\nSo I think it's pretty staggering when you see what CPI is doing compared to what the\ncost of construction is.\nThe other index here is the dashed sort of yellow line across the bottom sort of gold,\nmaybe sort of orangey.\nthat's the employment cost index. So that's another index of the cost of\nemployment. And then the green line is called the producer price index, which is a\nkey indicator for inflation based on the production of level of goods like\nfrom mining, manufacturing, and ag as well. So those are again or sort of the\nindicator. But what's interesting about this is, as you can see that the red\nline, the highway construction cost index outpaced all those others, especially\nfrom about 2022 on. So what does that mean locally here in Georgia? We're probably\na little better than average on a few things and worse than average that red\nline on some and let me just talk through a couple of those. This chart looks\nback to FY21 to FY25 and just simple resurfacing a two-way road has\nincreased in cost by 51%. So right now to do a two-lane road, it's about $251,000 a mile\nto do two lanes, one lane in each direction. Widening from two lanes to four lanes,\neither if it's urban or in a rule setting, our actual blow bid pricing has increased 99%\nfor urban and about 90% for rural widening. So basically double, practically doubled in cost\nover those last four budget years.\nAroundabouts, we talked about roundabouts,\nJeremy Powell and I were just talking about roundabouts,\nyou can see that they've increased about 47%.\nAnd we just, we compare that to the paved surface.\nSo, you know, over those last four years.\nIn bridges, bridges are important to everybody.\nI'm gonna talk more about bridges.\nBridge replacements increase by about 93%.\nSo, you can just see in those four years\nthis really increased cost.\nDown at the bottom of the small table at the bottom\nis some of the breakouts of the components\nof these projects, such as asphalt, aggregate,\nstorm drain pops, bridge beams, and guardrail.\nAnd you can see they range from 90% on pops and things\nlike that to a low of about 35% for guardrail metal.\nAnd that number actually has come down.\nStill, still prices were really high back at the beginning\nafter COVID, and they have retreated some back.\nSo again, I'll just show you this to show you, as we think about budget,\nis how far does the money go?\nWhat are we using it for?\nYou can sort of see the realities of that.\nThis next chart, as we took that red line from that first chart,\nI showed you, and then index the budget, our state budget,\ncompared over that same time frame.\nAnd it's no surprise, but basically what I told you is,\nconstruction costs have gone here, and our budget has increased.\nThank goodness for that, over the years.\nSo the inflation nationally is increased\nby for construction about 70%, our budget about 30%,\nso that gives you the difference of the loss of buying power,\nif you will, to do what we need to do.\nSo what does this really mean and translate?\nAnd I showed this at joint appropriations\nand Janine Miller's here, who you'll hear from in a little bit,\nbut working through the planning process in her role\nas the planning director, we have to live\na four-year, physically constrained budget process of physical constraint versus\nprojects. So when project costs go up, what happens is we have to take a project\nand move it from the current year it's in to a neck to the next year is usually\nwhat we do. And then when you do that, you just push another project out of the\nnext year because you were already constrained, physically constrained, that line\nacross the middle of those boxes is physical constraint. So this increase cost is\njust calls us to cascade projects out and I sort of joked around it during\nappropriation saying I'm pretty sure each of your projects the most\nimportant project in the state in your district more so than your counterpart\nnext to you so y'all can debate that later but I got a fill in your projects\nnumber one so it's never fun when we have to come say you tell you that well\nwe're having to shift your project out or year or two and simply because of the\nfunding situation of these increase cost with even again increase revenue at\nthe state level federal levels the whole another story I won't get into at\nthis moment but that's sort of the process we have to go through which is never\nfun and of course anything we can do to advance projects sooner than later\nnow here's the good news story I want to go back because again with a sincere\nthank you to both the House and the Senate and the governor's budget the last\ntwo years with the state general fund infusion in amended $24 of $1.5 billion in $1 billion last\nyear as amended budget. You can see now that our budget line went above the national highway\nconstruction cost index for the last two, which means we're we didn't lose ground that we\nactually maybe gained a little bit of ground on these last two budget years. But the difference\nbetween there on 2020 to about 2023 where we're below means we still have more projects\nready to go than we have budget for. But I just can't say enough about those last two\nbudget years for leadership from the House, Senate and the governor to put that money in\nthe budget to do what it's going to do. So let me show you what that money's done. Again,\ntrying to set the table as we look forward on the on the amended 26 budget. We look back at those\nwas amended budgets 24 and 25 and this is where the money went.\n98 million dollars went to airport aid.\nWe always have about three times more request\nthan we have funding for airport aid.\nAnd so this was a big, big step.\nAbout half of that money,\nthey went to a replacement airport\ndown in Griffin, Spalding County.\nThat if we did not have the money,\nthe Federal Aviation Administration\nwas gonna take back their commitment of funding,\nwhich was a big part of that.\nSo we were able to get, secure that FAA funding\nand leverage those state dollars\nand also do a tremendous amount of work\naround our local airports across the state.\nThe local roads funding is that money to cities and counties,\nthat's El Miglac that most of you are familiar with,\nEl Miglac money, we send this money out by formula\nto cities and counties based on population in road miles,\n$250 million and $265 million respectively,\nwhich basically doubled their LMIG amount.\nAnd again, putting it into this budget category\ncalled local roads admin,\ntook away the match component\nbecause LMIG has a statutory match component\neither 10% if you're in a tier region,\nwhich many of you are in.\nAnd if you're not in a tier region, it was a 30%.\nBut that local roads admin did not require match.\nWe got that money out very quickly in both years.\nAnd most all that money was used\nby cities and counties for resurfacing.\nAgain, state of good repair.\ntheir reality has been the same as ours increased\npaid in cost.\nThe next bucket there is the freight program,\nwhich is a big program at 500 million each year,\nwhich was a new program that was stood up\njust a couple of budget years ago,\ncoming out of the freight and logistics plan that we did,\nwhich came through the Chairman Jasper's Committee,\nand basically moved forward to establish\na new freight budget program for us.\nI'm gonna come back to that one in a moment.\nThe next is the capital construction, 593 was an amended 24 to address the very thing\nI just showed you, where we had to cascade projects out into the future because we didn't\nhave money.\nIn fact, out of that $593 million, we were able to advance 44 projects, 25 of those\nprojects, the 44 were ones that were just delayed, they were ready to go, we just needed\nthe money.\nAnd in fact, when we did those 25 projects from where they were budgeted,\nwe sped them up by 40 project years.\nSo if a project was sitting in two physical years out and we moved it in,\nwe call that two project years.\nSo 25 projects accelerate it by 40 project years, which is amazing.\nAnd we know the longer you wait, the more it costs as well.\nAnd we also added 19 project phases that we know we need it to be working on,\nbut we just didn't have money to get started.\nSo that's where that money went.\nCapital maintenance was 50 million and amended 24\nto address that resurfacing numbers.\nI was telling you about it being 51% more.\nSo that helped us there.\nAnd last and very importantly, as I'll talk about\nRepresentative Taylor just a minute ago,\nthe 200 million for Hurricane Helene and Debbie cleanup\nand the storms we had in Southeast Georgia\nwent into our maintenance budget.\nAnd without that money, we would absolutely have been\ndevastated in Hurricane cleanup.\nIn fact, still, I dealt with a talk to Columbia County\nthis yesterday where we had a request from Columbia County\nstill dealing with those impacts or those costs\nthat are still out there.\nAnd as I told you on appropriations so far,\nwe've had about $48 million from FEMA reimbursement.\nAnd so here we are, a year and a half or so,\npost that and still working on reimbursement.\nSo this money was very, very important.\nNow, that's what you appropriate,\nand that's where we're gonna use it.\nLet me show you how it's been utilized.\nThe maintenance money, this is expended.\nSo these are dollars in and actually paid out to contractors.\n100% of that money's been done.\nThe capital construction, that 593, 69% of that outlay\nhas gone out, meaning work has been done.\nAnd then the last two categories are the freight,\nthat 500 million in each year.\nAs you can see, those numbers are sort of lagging a little behind, but there's a reason\nfor that.\nAgain, that was a new budget program, and we're advancing a lot of projects there that\nwere freight ready, and then several of the big ones on the next slide, or what I call\nthe big three out of that, are projects that we will bid this calendar year.\nSo these projects will come to bid this calendar year.\nThe first one is I-16, which is roughly $516 million, which is a combination of\nof amended 24 funds and amended 25 funds\nto widen 31 miles of I-16 from I-95 there\ndown in Savannah, at least up to the Hyundai Meta Plant.\nOur goal is to do a variable,\na fixed-price variable scope contracting.\nSo we say this is how much money we have\nand the contractor bids how far they can go.\nSo a very innovative way to try to make sure\nwe maximize these dollars.\nAs we all know, I-16 has tremendous amount of trucks,\n23% trucks in that area.\nAnd we know adding this third lane down there\nwill reduce delay by about 56% now and in the future.\nSo again, very important for our economic opportunity\nthat comes out of the port and everything is moving,\nthat freight moving up I-16.\nSo that's one project.\nThe next one is I-95, $74 million\nto Y995 from I-16 to South Carolina.\nSouth Carolina is currently under construction\nto build eight lanes on their side.\nWe have six lanes on the Georgia side.\nSo we're sinking those up.\nAgain, with traffic volumes down there,\nthey'll continue to expand and grow\ndue to all the freight commerce that comes out of the port.\nAnd lastly, out of the big three is 135 million\nto complete the last segment of State Route 96,\nwhich is that connection from I-75 to I-16 South of Macon.\nThere in Houston and Twigs County,\nwe have this project ready to bid.\nIt's about nine miles with a major river crossing\nin there too, so those are sort of the big three\nthat consume most of that freight budget.\nThat's why those numbers are lagging a little further behind,\nbut you can see that this calendar year\nwill be getting that work out the door\nand seeing those dollars used.\nNow, Mr. Chairman, let me get into the mended 26 budget\nfrom the governor's recommendation.\nAnd again, I'm super excited and very grateful\nfor the governor putting in roughly $2.3 billion\nof additional state general fund money\ninto the G.DOT budget.\nAnd so let me walk through sort of the big buckets\nor where that's going, starting with $100 million\nto address rural bridge replacements.\nAnd so we have literally, you know,\nhundreds of millions if not more bridge projects\nthat we know we need to do,\nbut we don't have the funding to do.\nAnd so this $100 million is gonna be used strategically\nto support ag and timber industry\nin the rural parts of the state.\nSo we're going through the process now\nof doing a triage of where are these bridges?\nWe're trying to make sure they're tied directly\nto some ag production or some timber facility production\nthat we're replacing bridges strategically.\nSo it's taking us a little bit of time.\nI know I wish I could give you the list\nof what that is today, but we're working through that\nbecause we're doing several SIVs and analysis\nto say, okay, what does this one serve?\nWhat's this bridge?\nSo this will be a combination of county bridges\nand state route bridges, but really try to again,\nstrategically advance those and our goal would be\nthat we would deploy these bridges\neither in this budget year or next budget year to be bid.\nNot put them all out one time,\nbut make sure we could be strategic\nabout getting these bridges $100 million\nof strategic bridge investment out\nover this budget year and next.\nNext was $200 million to the 316 corridor.\nFor the last six to seven years,\nwe've been really focused on trying to improve safety\nalong state route 316 in Gwinnett,\nBarrow in Oconi counties, roughly 40 some odd miles between Athens and sort of Metro,\nAtlanta there in Gwinnett.\nWhat we've been doing is trying to address the safety concerns that exist.\nI'll get into that by replacing intersections that have traffic lots with either interchanges\nor overpasses or making some kind of other access improvements along this very critical\ncorridor.\nAnd our focus at first was where the traffic signals are because that's where the most\ncongestion is, that's where you have a lot of crashes, and so we've been underway.\nAnd on this next slide, you can sort of see all the intersections from left to right,\n32-some-odd intersections along 316, where the traffic really varies greatly from about\nalmost 30,000 vehicles per day up to 108,000 vehicles per day with 12% of those being trucked.\nSo it is a freight corridor, but the staggering number here is there's about 1,300 crashes\nper year on this segment.\nIn our 10 years of data, we went back 10 years,\nso there's been 65 fatal crashes on this corridor\nin the last 10 years.\nIf you do that math, that's six and a half per year,\nthat is not where we want to be.\nIn fact, the crash rates, we look at rates,\nso that sort of equalizes things around the state.\nSix of the intersections are in the top 50,\nworst offensive intersections for crashes,\nand three more are in the top 100.\nSo you got nine out of the top 100 worst intersection locations on this core door, and the other\nthing we look at is crash severity.\nSo you have a crash, how bad is it?\nSo the most severe crashes, the ones you don't want to have for the intersections are higher\nthan the statewide average, and one is double the statewide average.\nSo you can see the crash issue we're dealing with from a safety point of view.\nThe good news is 18 of those intersections are actively being addressed or have been\nBut this last $200 million, this $200 million will go a long way to continue sort of the 12 to 13 remaining intersections that we just really didn't have funding for.\nIf you look down at the bottom right for the legend, I know it may be hard to see, you have yet sort of the yellow is intermediate and long term.\nThe yellow intermediate means that we may have light design underway, but we didn't have construction funding or ride away.\nThe black is long term meaning it's just not funded so you count those up\nThere's I think 12 or 13 of those that this $200 million will absolutely allow us to start addressing\nSo we end up with a core the entire corridor that is not only improve safety\nBut also mobility in a growing area especially in the Barrow and O'Coney County areas\nNext out of the state general fund and the governor's budget was the $250 million of local roads administration again that L\nbig lock Monday. I can absolutely tell you that I've heard from ACCG and GMA. They're\nfully supportive of this, cities and counties. And I've had no city or county complain about\nthis money by the way. So I think you got unanimous consent that everybody locks the cities\nand counties. Again, they're facing the same realities we face with increased costs.\nAnd the other thing is we get this money out very quickly. We would open, we would open the portal\nis probably as soon as the budget is passed and then shut it off right before\nGUI-1 so that the money is committed in this physical year in the cities and\ncounties that can have use use of it immediately all right next this is a really\nbig one I shared this same slide at joint appropriations these are state\ngeneral fund money that is listed under our budget item payments to SIRTA\nyou're gonna hear from Janine Miller the executive director of SIRTA in just a\nlittle bit who will provide a lot more detail about some of the data points on\nI-75 South Express lanes. But what I can say about this is just probably been the\nmost popular budget item that I've heard about from many of you and many of my\nfriends from the announcement the governor made at eggs and issues. It appears\nthat everyone is really a big fan of this project because I do think it has\nsuch statewide in fact it affects everybody if you live south or north it affects you one way or\nanother you know I asked during joint appropriations did everybody did anyone ever think the express\nlanes were going in the wrong direction and it got a pretty big chuckle so I'm assuming that meant\nyes but what I can tell you when the direction that they're going in most people criticize us saying\nthose lanes don't look like they should be going the other way well when you open up two more\nlanes where it's two lanes wide, you add at 67% more capacity, which then makes the normal\nlanes look more empty than they were because that's the benefit of having those two additional\nlanes. So it's amazing to see the difference and they are always going the wrong direction\nfrom you if you're going the direction when they're not open, correct? And oh, by the way,\nIt does take us some time to reverse them.\nIt takes an hour or two to go through to make sure there's nobody in them, make sure it's\nsafe, and then you have to flip them around.\nSo that's something we have to deal with.\nWell this funding absolutely does some critical things that says on this slide.\nIt's going to, one, we're going to get rid of the directional, the, we're reversible lanes\nand make two lanes barrier-separated, mind you, meaning there's a concrete barrier between\nyou and the other lanes, the entire 12 miles, that's foundationally what this money is going\nto do, which gives us the money to do the design work that we have to do, to do the right-away\nacquisition that we have to do, the environmental work that we have to do, this will be a federal\nenvironmental document.\nAnd then it's going to go to help support the overall construction cost, which will still\nneed a form of finance and through SIRTA. And that form of finance can come in many\nforums. It can come through the USDOT Tiffy alone. It can come from toll revenue bonds.\nBut it's going to take more money to do this and to get that objective of two lanes\nin each direction. Not only that, Chairman Hatchett asked, well, how far will these go?\nI'm not sure I answered appropriately.\nI said, Dublin's probably a good place,\nbut the point is, I think you all know that you get stuck.\nIf you're coming north, you get stuck down in Locust Grove\nat Bill Gardner Parkway.\nThat's where traffic stops.\nAnd so we know that we need to go further south\nwith these express lanes.\nSo this amount of money is what we need as a minimum\nto make sure that we can leverage to do two lanes\nin each direction in the 12 miles,\nbut also like I mentioned on I-16,\nwe'll make it very innovative\nthat we're gonna make sure the money goes\nas far south as possible to try to, again,\nbecause we know you're stopping\nbefore you even have the opportunity\nto get in the express lane.\nSo that's gonna be our,\nthat's gonna be our tact and strategy to do that.\nSo just again,\ndid you need, we'll have a lot more data points\nabout how the system operates today\nand sort of the data behind it.\nAnd we can talk about that one a little bit more\nafter she does her presentations.\nNow let me just jump into the budget itself.\nSo you've got your track sheet in front of you.\nBut before you get there, if you pull that track sheet up,\nyou're going to see the total back on page three\nof the Mendit budget.\nAnd so I always want to remind everybody\nin the Mendit budget year, the $71.6 million\nincrease in exercise comes from the audit collections from last year's motor fuel collection.\nSo that gets into our mended budget. So motor fuel is forecast but then adjusted in the\nminute year for the actual audit collections from Department of Revenue that comes into\nus. That's why there's no change in transportation trust fund fees or the transit trust fund\nfees in the mended budget. Those two budget items look back two years. It takes two year\nlook back is what we get appropriated in the year. So those would be an\nadjustment next year. In the state general funds, $2.3 billion, I just\nhighlight it the biggest part of that. But that shows you that brings our total\nbudget to $5.2 billion. Again, very thankful for that state general\nfund money. This table is sort of a summary of what's on your track sheet.\nWe've aggregated a couple of those budget programs together to show you\nwhere the funding is actually used. And so I always like to show this chart,\nOf course, the payments to SIRTA is the big one there.\n1.8, there's a few other things in payments to SIRTA\nbeside the 1.7, 9.6 billion.\nThen capital projects, capital construction\nand capital maintenance at 1.77 billion dollars.\nThen you have our routine maintenance budget.\nThat is, hey, that's snowing ice right now,\nbut a preparation and response,\nbut that's the taking care of the roadside.\nI always say that's the taking care of the house,\nif you will, of doing that, including a lot of maintenance contracting.\nThat's our staff, but also tremendous amount of maintenance contracting to do what we need\nto do.\nThen you can see the LMIG and LRA combine there, and then our general operations of the\ndepartment, which in this case we've aggregated many budget programs together, like department\nadmin, traffic operations, program delivery administration, planning, and data collection.\nSo that sort of run through the department altogether, there is some of the traffic operations\nthat do things.\nWe have bond debt, I'll talk about in a minute, we have our intermodal, which is aviation\nrail waterways and aviation rail waterways transit.\nSo that's where that money is, and then pavements to the ETL.\nSo on the next slide, if you want to get your track sheet, we've just taken your track\nsheet and put it in a tabular format here for the presentation.\nAgain, I'm going to start by saying a big thank you to the governor for recognizing the\none-time payment of $2,000 for state employees.\nWe certainly appreciate that.\nI'm not going to go line through line on those items, but that total is about $8.6 million\nto GDOT across all the budget programs where people are, and that is so appreciated.\nWe really do appreciate that.\nSo let me start at the top of this table, and I'm just going to highlight a few things.\nThe Geobond debt, I think it's really important to talk about.\nThe good news is you can see that was about $1.1 million reduction in bond debt, meaning\nthat our debt is reduced for geo bond debt, but our total debt from various kind of bonds\nis still $1.13 billion.\nSo we still have a pretty good credit card balance there that we're paying down from\nprevious bond packages.\nI just want to make sure you're aware of that.\nNext is capital construction.\nI'm going to highlight that one because again, that's where, that's where things\nget built. That increased excise number that you saw in the last slide. We put 36.9 million\nof that into the capital construction and then the other plus up was to 200 million in\nstate general fund money for 316. So that increased that $266 million ad that circle.\nThe next circle there is a capital maintenance which is line 47.3 on your track sheet. In\nthe capital maintenance, there's the $100 million\nadded for the bridge replacements,\nrural bridge replacements I talked about.\nWe'd ask for your support to actually get that\nin budget alignment with the capital construction program.\nSo if we could shift that up into capital construction\nprogram, that would be an alignment\nwith the budget requirements there.\nAnd then that was the big change there,\nwhere we put that into capital maintenance.\nGoing down to Elmig, Elmig is a minimum of 10% of the excise tax.\nSo with the increased excise for motor fuel collections,\nwe made that $7 million adjustment to the Elmig program.\nAnd then of course the big circle there is local roads admin\nthat I've already talked about at $250 million.\nIf you want to jump on your track sheet over to line 4712 or so, then you can see routine\nmaintenance.\nI want to talk about that again, very important taking care of the house, as I said.\nWe increased, took some of the excise, 21.8 million of the excise, we added in the routine\nmaintenance just to deal with the increased cost.\nThose increased costs on construction go right into maintenance, it's the same materials.\nAnd also to help with some of our equipment, keeping our equipment up to date as it ages\nout.\nAnd so that's where that's going and plus some money for the $2,000 supplement.\nSo that gives us the $26 million ad in routine maintenance.\nLastly, circle there's payments to SIRTA that we talked about as relates to the I-75\nSouth express lanes.\nSo with that, both Chairman, thank you for this opportunity.\nAgain, I want to thank Governor Kemp for his continued third year in a row for leadership\nof increasing the transportation investment that absolutely keeps George in moving ahead,\ntrying to keep our stance of the number one state to do business going on the 13th, trying\nto go for the 13th year in a row and this additional funding actually will make lives\nbetter for George in all across this vast state, not just in Metro, Atlanta, but across\nthe entire state.\nSo with that, be glad to entertain any questions at your pleasure.\nThank you, Commissioner.\nVery thorough report.\nAnd appreciate you stewarding these resources for the state and keeping us safe on the road.\nAnd $2.4 billion added to your amended budget, that's a lot.\nAnd most of it looks like it's going to the express lanes.\nAnd we're a little bit tight on time, so we're going to be brief on the questions and just\nto ask you to be available to the committee, you know,\nyes sir, afterwards.\nBut if you could just explain, you know, briefly,\nthe express line, the original project, when was that?\nWhen was the speech, the express lines put in\nand how does it relate to today's, this new project?\nYeah, so thanks for that question.\nIt was bid in 2013 and opened in 2018.\nIt seems like yesterday, but it's been a minute,\nso going on eight years this summer, being open.\nThe original cost was pretty good bargain,\nit was about $216 million, sort of all in,\nbut I remind you that what we had then was a median\nthat we basically filled in,\nand there was only a couple of over,\nthere was one interchange over pass\nthat was redone and one bridge over I-75\nthat had to be redone.\neverything else squeezed in.\nSo you go back to those numbers and you say,\nwow, why can't we do it for that cost?\nWell, I look back at that national highway construction\ncost index nationally.\nAnd over that time, from 2013 to 2024,\nthere was 111% increase in construction cost.\nNow, if you multiply that out, it's still\nsouth of the total dollar amount.\nbut these are two very different projects\nof what we are trying to eventually accomplish.\nAgain, where that we've already filled up the median,\nthe means we're gonna have to go to the outside,\nby right away, you know, do more construction,\nand then I remind you to, the south end of that project\nis only one lane, and it's squeezed in the middle,\nand it's only one lane wide, so we're gonna have to do,\nbe very innovative, which means probably more bridges,\nmore aerial to limit right away impact\na very constrained corridor. You get into more bridges, high-level kind of things,\nbridges that fly over and back into the middle. So our goal is, again, to use the existing\nright-away and real estate we have, and there's some wide areas there at Eagle's Landing,\nHudson Bridge, down sort of on the south side. There's some, or excuse me, on the northern\nside, there's some wide right-away that we absolutely use, but there's a lot that will just be\nYou read total interstate reconstruction,\nthere'll be a very complex.\nAnd if I understand right, the one point,\nroughly at 1.8 billion added to the amended budget\nis just getting you started.\nBut there will be more money borrowed\nand that debt will be serviced through the fees, correct?\nThat's correct.\nOK.\nCambridge Astros, do you have anything\nfor the commission?\nYou know, I know your guys are very available to us.\nI know a lot of members have gotten texts to questions.\nBut one that comes up the most commissioner is on resurfacing.\nAnd you know, it's what we all in here see every day.\nWe get the complaints about.\nAnd I guess what is the pit up demand?\nI know that we check our roads every other year.\nWe know the grade of them and we've got increased money\nfrom paving.\nBut I think members want to know what's the demand?\nBecause I'm always trying to ask for more money.\nand sometimes don't have real accurate numbers,\nbut I'm sure like to know what to mean,\nand I don't know if you can answer that right now.\nYeah, I'll let me give you sort of just a ballpark answer there\nis I'll go back to that data point\nof resurface increased by 51% over the last four years.\nSo we got, I think you'd agree\nthat most of our conditions are pretty good.\nWe sort of, we have key performance indicators\nfor all our roads.\nAnd we're almost hitting some of the targets,\nsome of the targets were right on.\nSo we're sort of close to where we need state of good repair\nin a system, but that we got there several years ago.\nSo if you've got 50, if your money's going half as far,\nthat's going to tell you that's about what we need.\nSo on average, we're somewhere around $370 to $400 million\na year to resurface state routes and interstates.\nSort of the other concern though is our interstates.\nI like to say all of them have a knee replacement.\nthe hip replacement and are eligible for Social Security.\nA lot of the original interstate pavement has lived\nits life and we're having to spend significant amount\nof money just as award of warning,\nwe are rebuilding I-285 from the airport on the west side\nup to Cobb County, up through Cobb County this summer.\nSo don't go over there.\nAll right.\nStay away.\nYeah.\nBut the point is that pavement is worn out.\nWe're having to rebuild it.\nBut I think the antidotal answer is pretty easy, 51% cost increase.\nWe were pretty good on our state of good repair sort of where we are, but that means you\nabout need to double the budget, right?\nI mean, so you need that, you know, where we are at 375 or 400, you probably need to be\nlike, you know, 800 million a year.\nThank you.\nCommissioner appreciate you and members, I'm sorry, we're just short on time.\nSo I'm going to ask Director of Planning Janine Miller to come up and give us her presentation.\nand probably just hit the highlights so we can make best use of this last 10 minutes.\nYes, sir.\nI've got a lot of data points, but I will go through them quickly.\nGood morning. It is great to be with you all here today.\nThank you for your time and your attention to transportation,\nwhich we know is the arteries of our economy, of our communities, and our families.\nQuickly, the sort of budget, the 2026 budget included money for the infrastructure bank as\nit does every year through the Transportation Trust Fund.\nWe are excited to have reported that we have awarded all of those dollars to 13 projects\naround the state, including the northwest corner, Cherokee and Cumberland CID around Truist\nballpark to support movement there around that economic center all the way down to Seminole\nCounty and the iron city there as well as Twin City in a manual county and up and over\nto Athens Clark County. So we have been able to award 13 projects around the state thanks\nto your investment there. We also have our current round is open. So there is a card\non your desk with with a QR code there for your local communities to apply for for those\ndollars through February 13th. So we'd love to get more applications from around the\nstate again this year. As the commissioner said, I'm going to talk about the I-75 South\nQuarter, but I always have to start with in transportation our logistics enabled businesses.\nSince Governor Kemp took office, there have been $113 billion of announcements in private\ninvestment throughout the state, and 88% of those announcements have been in logistics\nenabled companies.\nIn other words, there is a requirement for inbound cargo, for the company to operate\nand employ Georgians and outbound goods to market and consumers.\n$74 billion or 65% of the total dollar amount.\nThat is, over the past six, seven years has gone towards logistics enabled businesses\nemploying over time as these projects roll out 157,000 jobs throughout the state.\nSo this is a critical, a critical industry for the state of Georgia that relies on our\ntransportation system all day, every day.\nI want to talk about congestion in Metro Atlanta, I think you all have probably felt it, if not on your way to and from the capital here, but throughout the year.\nIn fact, last year, the most recent publication of a company called Enrex, this is a world-renowned data analytics company for transportation, ranked Georgia as number seventh in the country for worse traffic and delay.\nThat is 16th in the world, is Atlanta.\nThat's incredible.\nThat's a 23% increase in the hours lost to traffic\nin the past few years.\nThe third most increase in the US.\nAnd the other metro areas that had worse traffic growth\nthan Atlanta were Baltimore and Philadelphia.\nAnd those were for one time events, you may recall,\nthat the unfortunate bridge collapse in Baltimore\ncaused a great deal of congestion there,\nas well as there were issues with the Philadelphia transit system safety, significant safety issues\nthat shut that down. We're not for those very unique one-time events. Atlanta would have had the\nworst traffic growth in the country since 2023. Last year, people sitting in Atlanta traffic lost\n75 hours. That's 50 percent higher than the U.S. average. What does that look like on our\nroadways. On the left is red to green. Since 2019, we have had basically the population of the\ncity of Newark, New Jersey moved to Metro Atlanta and the roads got worse. Some of them got better,\nthey're in green on the left, but all the rest of them got worse. On the right, you can see the\ndegree to which they got worse. And this corridor, I-75 in the south metro area, the lifeline to\nNorthern Georgia through Metro Atlanta had the worst traffic and this is midday. This is middle\nof the day. This is not rush hour and these are the times as the commissioner mentioned when we\nare reversing the direction of the lane. Express lanes are a choice, great choice for Metro\nAtlantis or anyone traveling through Georgia. Since 2011 when we opened the I-85 corridor we have had\nsignificant growth in fact in the last two years since we've gotten those really bad\ntraffic numbers and data we've had a 12.6% increase in the use of our express lanes that's\nsystem wide. A little zoom in here on the I-75 South corridor, 5 million trips. We've\nhad an 84% growth in trips since fiscal 18 when it opened. It is currently 12 miles\nlong, although as the commissioner said, it's only two miles for portions of it and one\nlane in each direction for a couple of miles on the cell.\nThis is what it looks like to the average traveler who's doing a Google Maps search\nchallenge isn't going to take me to get through the corridor.\nIn the morning, northbound, the lane is going in the northbound direction.\nAnd using the toll lane, it would take 10 to 16 minutes to get through there.\n80% increase, though, if you're trying to get through that corridor in the afternoon.\nAnd you might say, well, 10 minutes is not that big of a deal.\nWell, actually, that lane would provide a 21 mile an hour increase in speed through\nthat corridor if that lane were going in the northbound direction.\nAnd you multiply this, this might just be what you see on your phone for your trip.\nBut you multiply this by the number of people every day who cannot get into the lane, average\nabout 100,000 people every day who cannot get in to the express lane.\nSo we have something in transportation analytics.\nThis is how it looks to us as transportation professionals, a road report card, levels\nof service.\nIt's an A, B or C, you're doing well if you're an F, you are failing.\nAnd these general purpose lanes are failing Metro Atlanta travelers, and by 2050, this\nis all day.\nDo you see that red all day long?\nThis is an all day model.\nThere is not a way to get through this corridor at any hour of the day in 2050 with any ease\nor speed.\nThat is all we can predict, but of course we cannot predict crashes.\nSo compound onto those data points, the growth in traffic and the delay.\nWhat is caused by the slowdowns that are caused by unpredictable crashes is quite severe\nthroughout this court or particularly on the northern side.\nSo there is no way to get around these crashes when the lane is going in the other direction.\nBy the numbers, this is the real data.\nThis is the roll-up of a most recent month of data we were able to gather in December\nof 2025, time and money lost by the numbers,\n$193,000 average vehicles per day.\nThat is $334,000 vehicle hours of delay\nin just the month of December.\nEvery person lost 9.3 hours that month\nto traffic on that corridor.\nAnd so you have to budget 80% additional more time\nto get through that corridor on schedule.\nAnd the cost to the economy is real.\n$15.5 million is the cost of that unreliability.\nBut what's very interesting is where those cars and trucks\nare coming from and going to.\nThe darker the gray, the more trips originate\nand depend on that corridor there\nin the center of the state to get through.\nSo it's not just the express lane,\nit's all of the general purpose lanes\nthat are dealing with this traffic.\nAnd once we have a lane going in both directions,\nThere will be 70% more vehicles that can pass through this corridor.\nAnd I say vehicles, it's not just cars.\n18% to 20% of the vehicles getting through this corridor,\nattempting to get through this corridor, are trucks.\nThey carry $620 million a day of freight value.\nIn a year, that's $226 billion.\nThat is roughly 25% of the value of freight moving in Georgia\ngoes through this corridor and sits in that traffic.\nThis corridor has also been named\nby the American Trucking Associations\nas the worst freight corridor bottleneck in the country.\nIt's number 12, one through 11 are all interchanges.\nThis is the number one worst corridor\nin the country for trucks.\nDirector, we're getting some looks on time at the back door\nAnd rules chairman has come in.\nAnd so we're going to clear this room.\nBut thank you for that quick presentation.\nAnd we may ask you back to either this committee\nor chairman Jasper's to so we can have time\nto ask you some questions.\nAll right, thank you.\nHey, members, if you would take your packets with you\nwhen you go to...\n",
  "updated_at": "2026-02-12T01:25:26.9543+00:00"
}