{
  "video_id": "hp6H0TzZw4A",
  "url": "https://www.youtube.com/watch?v=hp6H0TzZw4A&list=PLIgKJe7_xdLWzQfq8TfCl8PKoQfW7VZJF&index=13",
  "title": "Georgia House - Day 33 (2026-06-18)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 33,
  "video_date": "2026-06-18",
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured the introduction of several bills, including SB 171 and SB 295, as well as discussion of procedural matters and a devotional message from a guest chaplain.\n\n## Key Actions\n**SB 171**: [No description provided]  \n**SB 295**: [No description provided]  \n\n## Bills Introduced (First Reading)\n- SB 171\n- SB 295\n\n## Notable Moments\n- Devotional message delivered by guest chaplain Dr. Don Hadaway\n- Representative LaRickia introduced Dr. Hadaway, highlighting his background and service\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe session began with a roll call to establish quorum.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "You\nThe hour of convening, having arrived, all members of this house will please report to\nthe floor of the house, the gallery, or room 341, all members, Mr. Clark, send out the\nWell, all members, please take your seats.\nmembers, please take your seats. We are about to have the morning roll call.\nOkay, we're going to have the morning roll call. All members present will please answer\nyes or here loudly to signify their presence in the body.\nThe clerk will unlock the machines and call the roll.\nAlexander, Anola Woods, Bar, Barton,\nBelton, Bennett, Bentley,\nBeverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper,\nCorbett, Dempsey, Dickie, Dollar, Drenner, Dubnik,\nEftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli,\nHarold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes,\nHouston, Hugley, Jackson M, Jasper's, Jones J,\nKelly Kendrick, Knight, LaHood, LaRickia, Lomston, Martin, Mathiac, McCall, Morris G, Newton,\nNick's, Oliver, Parish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge,\nSkoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey,\nStevens R. Tancersley, Tanner,\nTarvan, Taylor, Thomas E.\nTramble, Washburn, Watson, Welch,\nWorkhizer, Weedower, Williams A.,\nWilliamson, Yurda, Allen,\nPhase more, for now, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDryer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland,\nHolly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V,\nKaush, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell,\nMore B, more C, more S M, Nelson,\nGwen, Paris, Prince, Pullen, Robyshow,\nSaints, Scofield, Scott, Shannon,\nSharper, Smith M, Stevens M, Steven Sin, Thomas A.M., Turner,\nWalensky, Wilkerson, Williams MF, Williams N, Wilson,\nBeasley Teague, B-C-T, here.\nBonner, here.\nBuckner, here.\nfor chat. Here. Call well. Call up. Here. Campbell. Here. Can't trail. Can't trail. Here.\nDickerson, Duce, Dukes, Duce, Gamble, Gaye, Here, Gillierd, Here, Gordon, Here, Green,\nHere.\nGullard.\nHere.\nJones, J.B.\nJones, G.\nHere.\nKirby.\nKirby.\nLot.\nLot.\nHere.\nMathis.\nMathis.\nHere.\nMathis.\nMathis.\nMom-to-han, mom-to-han, park, park, here, pruit, pruit, rogers, roms, singleton, stowall,\nSo, Williams R, Williams R, Martin R, Beverly, Bodie, Dempsey, Dollar, Dryer, Dukes,\nHopson, Houston, Hutchinson, Jones V, Kirby, Knight, Lopez Romero, Mets,\nWen, Petrie, Rogers, Smyrie, Stovall, Thomas A.M., Wilkerson, Wilson.\nRemember should look at the board and make sure that if you're here, that you are shown\nas being here, this part where you lock the machines.\nMore keepers will please close the doors and keep them closed.\nGood morning.\nWhat a beautiful day out there this morning.\nlegislative day 33. We will begin our day with scripture reading and prayer by the\nchaplain after which we will pledge allegiance to the flag of our country. Our\nchaplain this morning will be introduced by the gentleman from the 169\nHouse District representative or Rickia representative or Rickia thank you so\nmuch mr. Speaker and as always thank you for allowing us this time for\nscripture reading and devotional and I think everybody would agree right now\nthis is a much needed time good morning colleagues and it is truly an honor to\nintroduce my friend and pastor, Dr. Don had a way. I'm blessed to serve and\nworship under his ministry and his leadership at First Baptist Church of\nDouglas. And as I was prepared to introduce him, I literally had feelings of\nbeing unworthy to even introduce the man that has the opportunity to share\nwith us God's word this morning. God has truly been at work in Brother Don's\nlife, all of his life. One of the stories that I love to tell is in the sixth grade in 1975 when I was\nstill in daycare. Brother Don's teacher gave them an assignment and question number five on that\nassignment was what are your goals and are you going to accomplish them? And so the way he answered that\nAs a sixth grader was I want to finish high school and I want to become a preacher and he still has that assignment paper today.\nIt was October the 6th, 1975.\nAnother story that I enjoy was one of his dear friends as another guy, Pastor William Pope.\nPastor William shares a story that when they were in high school and a lot of young people were driving around the dairy queen and maybe not up to all good\nall good that the brother Don and brother William would go to a park and get on their knees\nand pray for God to do a work in that community.\nAnd brother Don organized as a senior in high school at 16 years old, organized a youth\nrevival, subsequently leading several young people to faith in Jesus Christ.\nNow, I certainly don't want to eat up his time with all of the good things that God has\ndone through his ministry, but I'm telling you he is a true man of God. You know\nBrother Don's been married to Miss Sonja, his wife, for 25 years they have three\nwonderful children, Daniel, that's 21, I'm sorry Nathan, that's 23, and Anna Lane\nthat's 19. He holds a Bachelor of Music Education from Bruton Parker. He has a\nMaster of Divinity and a Doctor of Ministry from New Orleans Baptist\ntheological seminary. Dr. Hadaway is a former president of the Georgia Baptist\nConvention and some of you have probably met him through that. He has served in\nministry and pastor for over 30 years and thankfully God called him to come\nback to First Baptist Church of Douglas and one of the things that I\nrecognized immediately that he stands firm on the teaching of the an errant\nan infallible word of God and he is a true believer that God changes lives, that to change a man you've\ngot to change his heart and when you change his heart you change his family and when you change\nhis family you change the world for eternity. Pastor Don had a way.\nThank you so much Mr. Speaker, distinguished members of the House. I want you to know how much\nI appreciate this opportunity I counted as a tremendous privilege and honor to be before you this morning.\nMany people would define peace as the absence of conflict. However, life is filled with adversity\nand hardships. Living in a world without conflict is impossible. Yet there is a peace that is\navailable that transcends times of difficulty and pain. This piece that does not\ncome in a bottle or peel, it does not come through being borrowed or bought. It\nis not gained through anything that we can do on a personal level. It comes\nthrough a relationship with God. After Jesus told his disciples about his impending crucifixion,\nthey were deeply troubled. He reassured then with a promise that is recorded in our scriptures,\nJohn chapter 14 verse 27, peace I leave with you, my peace I give to you, not as the world gives\ndo I give to you? Do not let your heart be troubled nor let it be fearful. Like the disciples,\nwe also face troubles that can cause us to despair. The good news is that the peace Jesus promised\nto His disciples is also available to us. The question is how can we experience this peace?\nBefore we can have peace from God, we must first of all have peace with God.\nRomans chapter 5 verse 1 tells us how,\nFor if while we were enemies we were reconciled to God through the death of his son, much more\nhad it been reconciled we shall be saved by his life.\nwe do not see ourselves as the enemies of God. But sin is rebellion against him.\nWe find in the scriptures of Romans chapter 3 verse 23 for all have sinned and fallen short of\nGod's glory. God is holy and we are sinful in that we've violated His commands. Just look at the\nworld, the hatred, the injustice. It seems to be everywhere in growing. These are\nbut symptoms of a deeper problem. The problem is sin in the human heart and\nwe have been infected by it. All of us. While in our sin God reached out to us in\nlove. He sent his son, the Lord Jesus, to pay the penalty for our sins and to\nforgive us and then to reconcile us to Himself. Christ has made peace with God\npossible and of course that's what John 316 tells us for God so loved the\nworld that He gave His only begotten Son that whoever believes in Him\nshall not perish but have everlasting life. We can have peace with God by\nacknowledging our sin and believing in Christ when we yield our lives to Christ\nsin no longer separates us from God, and we have peace with Him. After we make peace with God,\nwe can have the peace from God. This means that when we encounter life's problems,\nwe have the power and presence of God that gives us calm assurance that all is well.\nOne of the verses in the hymn, it is well with my soul, beautifully reminds us of God's\nperfect peace.\nWhen peace like a river, attendeth my way, when sorrows like seed billows roll, whatever\nmy lot thou hast taught me to say, it is well, it is well with my soul.\nof God's peace. Today we too can say it is well, it is well with my soul. Would you please\npray with me. Heavenly Father, we desperately need peace in this broken world. Our sins\nhave separated us from you and from each other. Thank you for sending your Son to pay our\nour sin debt so that we could be forgiven and reconciled to you, and so that we can be\nat peace with you and others. I pray that each person here today will find your peace.\nAlso that we will be peace makers with those around us. In Jesus' name I pray, amen. Would\nDo you join me in the pledge?\nI pledge allegiance to the flag of the United States of America,\nand to the republic for which it stands,\none nation under God, and indivisible,\nwith liberty and justice for all.\nDoorkypers will unlock the doors.\nDoorkypers will unlock the doors.\nThe chair recognizes Chairman Hogan, the chair of the Committee on Information and\nAudits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits read the previous proceeding and previous legislative\nand found them be correct. There's a saying, well done, it's better than well said.\nAnd Representative Tray Rose did not say that, but it's Benjamin Franklin.\nI'll tell you, I'm enjoying and learning from the report every morning.\nChairman Hogan, the chair of the Committee on Information and Audits, reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none in the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Bradson, who's following me establishes the order of business during the first part\nthe period unanimous consents, introduction of bills and resolutions, first reading and\nreference of House bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, first reading and reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day. The chair here is not in the resolution, is adopted. First reading of bills\nand resolutions, the clerk will read.\nHouse Bill 1219, members and the Williams, the 145th Bill Betonon Act, to amend the\nNAC, creating the Central State Hospital Local Redevelopment Authority.\nThe Intergovernmental Coordination.\nHouse Bill 1225, representatives of Smith, the 41st Bill Betonon Act, to amend chapter\none of Title 46, the official go to Georgia,\nannotated relating the general provisions\nregarding public utilities and public transportation.\nEnergy, utilities, and telecommunications.\nHouse Bill 1221 by reps of Kelly,\nthe 16th and Cook of the 18th,\nBill Nitton and Act to Menon Act\nto provide a homestead exemption\nfrom Paris and County School District\nat Valarim taxes.\nEnter governmental coordination.\nHouse Bill 1222 by reps of Cooper,\nthe 43rd of Bill Nitton and Act to men,\nTitle 43, the official go to Georgia,\nWe're relating to professions and businesses health and human services house bill 12 23 of our version of Watson the hundred and seventy second\nCampbell the hundred and seventy first. They'll be taught on active men and act establish an airport authority for Colquid County\nIntergovernmental coordination house bill 12 24 of our resident of Gertler the eighth or one of the 28th\nThey'll be taught an active men and act to amend revised consolidate and supersede several acts incorporating the talent to Louis Falls\nIntergovernmental Coordination House Bill 1225, Arras, a Gertler of the Eighth Building\nTonneau NAC to Methon NAC to provide a new charter for the City of Young Harris.\nIntergovernmental Coordination House Bill 1226, members of Shannon the 84th\nBeverly, the 143rd Jackson 64th, one of the Canon and the 58th and others.\nBill be Tonneau NAC to Methon arc 4, chapter 4, title 17, the official go to Georgia\nWe're leaving the rest by private person judiciary non-civil house bill 1227 by\nReps and a chocus the 138th built me town in act authorize the governing\nauthority of the unified government of Chattahoochi County to live in an\nexcise tax pursuant to subsection B of code section 48\nIntergovernmental coordination house resolution 1551 by Reps and turn of the\nthe 21st Williams, the 168th call well the 20th,\nstill all the 74th Clark, the 47th and others,\na resolution creating the national\nStatuary Hall, collection, replacement,\nrooms, House Resolution 1552 by Rufsen,\na park of the 101st, Williams of the 37th,\nWilliams of the 8th, Wilson of the 80th,\nGnard of the, Canada of the 102nd,\nClark of the 100th and 8th and others,\na resolution urging all Jordans\nto participate in the 2020 census.\nGovernmental Affairs, House of Resolution 1589 by Representative Dempsey, the 13th\nScotland, the 14th Lumpston, the 12th Resolution honoring the life of Mr. Carl Evans and dedicating\nan intersection in his memory.\nTransportation.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 1198 by Reps of Powell, the 32nd Bill to amend and act to provide a home study exemption from Hart County,\nAdvalorn, Texas, House Bill 1199 by Reps of Powell, the 32nd Bill to amend and act to provide a home study exemption from Franklin County,\nAdvalorn, Texas, House Bill 1200 by Reps of Williams, the 148th Bill to amend and act to create a Board of Elections and Registration for Wilcox County,\nHouse Bill 1201 by Representative McLaren of the 51st, Dryer of the 59th,\nof the 62nd, Jackson of the 64th Scofield of the 60th\nand others, a bill to re-establish the Board of Elections\nand registration for a Fulton County.\nHouse Bill 1202 by Representative Clark,\nthe 51st dryer, the 59th Boat of the 62nd,\nJackson of the 64th Scofield of the 60th and others,\na bill to amend and act to create\nBoard of Elections and registration for Fulton County.\nHouse Bill 1203 by Representative Galliard\nof the 162nd, Bruce of the 61st Hogan of the 179th.\nBoat of the 62nd, Oliver of the 82nd and others,\na bill relating to the rest of our private persons.\nTest Bill 1204 by Representative Scott with 76,\ngo field with the 60th for now, the 77th.\nRemember leave the 143rd base, more to the 63rd,\nand others are bill relating to employment\nand training of peace officers.\nHouse Bill 1205 by Representative Scott with 76,\ncloud of the 100th and 50th.\nRemember leave the 140th, go field with the 60th,\npeacefully take of the 65th,\nthe bill relating to general provisions\nregarding law enforcement officers and agencies.\nHouse Bill 1206 by Representative Scott with 76,\nremember leave the 143rd,\ngo field with the 60th,\nDavis of the 87th, will cloud with the 105th,\nand others are bill relating to law enforcement officers and agencies, House Bill 1207.\nMy represent of Scotland 76, Hutchinson to the hundred and seventh,\nFebruary of the hundred and forty-third, Smire of the hundred and thirty-fifth.\nHe would leave the hundred and thirty-six and others,\na bill relating to law enforcement officers and agencies and state tort claims.\nHouse Bill 1208, by represent of Scotland 76,\npronounce the seventy-seventh, but bow to the hundred and fifth.\nHutchinson to the hundred and seventh,\npays more of the sixty-third and others,\na bill relating to the Georgia Uniform Civil,\nfor Chair Procedure Act.\nHouse Bill 1209, by represent of Tramble of the hundred and thirty-second,\nI believe in the hundred and forty-third Thomas of the fifty-sixmeyer of the hundred and thirty-fifth hugely of the hundred and thirty-six others\nAbel with lighting to searches with four unskilled twelve ten by represent Tramble of the hundred thirty-second\nMitchell of the eighty-eighth one cloud of the hundred and fifth Douglas with seventy-eighth Davis of the eighty-seventh and others\nAbel with lighting to pretrial proceedings\nHouse bill twelve eleven by represent Hutchinson of the hundred and seventh for now the seventy-seventh phase more of the sixty-third\nDavis of the eighty-seventh inspiring the hundred thirty-fifth and others Abel with lighting to state flying\nCiel and other symbols House Bill 1212 by Representative Hutchinson of 107th\nKenner to the 102nd February of the 143rd Kendrick of the 93rd Bennett of the 94th and others of bill relating to the state flag\nCiel and other symbols House Bill 1213 by Representative Jones of the 167th of bill relating to arrests by private persons House Bill 1214\nby Representative Tramble of the 102nd more of the 95th Clark of the 108th Probe Show of the 48th Evans of the 83rd and others\nWe'll be relating to general provisions regarding district attorneys.\nHouse Bill 1215 by Representative Jackson of the 64th Basement of the 63rd\nBonner of the 72nd Singleton of the 71st Mathiac of the 73rd.\nThe bill to provide for the creation of one or more community improvement districts in the city of Fayetteville City.\nHouse Bill 1216 by Representative Jackson of the 64th Basement of the 63rd Boat of the 62nd.\nBeasley's Heak of the 65th, the bill to provide a home site exemption from the city of the Union City of Advalorem,\nTexas, House Bill 1217, by Representative Jackson of the 64th,\nbaseball of the 63rd, Bruce of the 61st,\nBowdie of the 62nd, measly T, of the 65th,\nBill to amend and act to create the Southful municipal\nwater and sewer authority, House Bill 1218,\nby Representative Powell of the 32nd,\nthe Bill to amend and act to recounce the Board of Education\nof Hart County, House Resolution 1525,\nby Representative Gallup of the 19th,\nthe resolution creating the House Study Committee,\non remote online notarization, House Resolution 1548,\nRepresentative Jasper is in the 11th roster of the 7th part of the 5th England of the\n116th and Smith of the 134th resolution honoring the life of Johnny Meadows and\ndedicating interchanging his memory House Resolution 1549 by representative of the\n94th Spire of the 135th Gordon of the 163rd Frazier of the 126th Bentley of the\n139th Resolution supporting the policy recommendation set forth by the\nGeorgia Legislative Black Caucus Legislative Advisory Group regarding\nCOVID-19 House Resolution 1550 by Representative Gordon of the 163rd\nbeasley take of the 65th Williams of the 168th\nminutes with the 94th, Dickerson of the 113th\nand others of resolution urging all governing authorities\nof this state to adopt solutions to address\nsystemic racial inequalities and police use\nof force in economic empowerment for your second graders.\nReports of standing committees, the clerk will read.\nRepresentative Chaffer, registration of 104th\ndistrict chairman of committee on judiciary\nnon-civil submitted to following report.\nTo speak to your committee on judiciary non-civilism and on the consideration following bills of the Senate that's just talked to me to report the same back to the House to following recommendations\nSenate bill 344, do pass Senate bill 435, do pass Senate bill 446, do pass\nrespectively submitted by the Senate of Chuck Administration and the other board district chairman\nRepresentative Lynn Smith, the 70th district chairman on committee on natural resources and environment submitted the following report\nMr. Speaker, your committee on natural resources and environment.\nIt has a consideration of filing bills in the Senate to struck the media report same back to the House of filing recommendations.\nSenate Bill 123, do pass by committee substitute, Senate Bill 426, do pass, Senate Bill 445, do pass by committee substitute,\nSenate Bill 473, do pass, Senate Bill 474, do pass, respectfully submitted, representative.\nLynn Smith, the 70th District Chairman,\nthat completes the reading of the Reports of Standing Committees.\nYou\nYou\nYou\nOkay, we're going to take up some business, we're going to take up some business, we're\nbusiness here. We have a couple of\nreconsiderations that will be before the body.\nHouse will come to order.\nOn Wednesday, June 17, this House passed\nHouse Bill 1029, the gentleman from the\none hundred and thirty-second district, the minority\nleader of this House, served notice of a\nmotion to reconsider the action of the House and giving House Bill 1029, the\nrequisite majority. Now is the time for the gentleman to pursue the motion if\nhe so desires. Chair recognizes Representative Trammell for his motion.\nMr. Speaker, pursuant to rule 143, I move this House reconsider its action on the\nprevious legislative day on House Bill 1029.\nGentlemen has moved that this House reconsider its action in giving House Bill 1029 a requisite\nmajority.\nOn the gentleman's motion, all those in favor of reconsideration will vote yes, those\nopposed will vote no, and the clerk will unlock the machines and call the roll.\nAlexander Onola Woods, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly,\nBlackman, Bodie, Bruce, Burns, Carpenter, Carson,\nChokus, Clark H, Collins, Cooper, Corbett, Dempsey,\nDickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton,\nGravley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley.\nJackson M, Jasper's, Jones J, Kelly Kendrick, Knight, LaHood, LaRickia,\nLomston, Barton, Mathyak, McCall.\nThis house will come to order.\nWe have a number of items today that we're going to be voting on, and the clerk's office\ncannot hear responses.\nSo I'm going to ask you to cease all conversation during a roll call so that they can hear members\nAs a respond accurately, my proceed.\nLohood.\nLarickia.\nLomston.\nMartin.\nMathiac.\nMcCall.\nMorris.\nNewton.\nNix, Oliver, Newton, Nix, Oliver, Parish, Parsons,\nPetri, Perkle, Powell, Reeves, Rose, Rich, Riddling, Rutledge, Skoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V, Smirrey, Stevens R,\nMeckersley, Tanner, Tarvan, Taylor, Thomas E, Trammell, Washburn, Watson, Welch,\nwork-hizer, weed-hour, Williams A, Williamson, Yurda, Allen,\nBaysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook,\nDavis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier,\nGilligan, Gertler, Henson, Pill, Hogan, Holly,\nHobson, Howard, Hutchinson, Jackson D, Jones S,\nJones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McLaren, McLeod,\nMeeks, Mitchell, more B, more C, more M, Nelson, when Paris, Prince, Poland, Robucho,\nSaints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas\nA.M., Turner, Wollensky, Wilkerson, Williams, M.F., Williams, N. Wilson, Beasley Teague, B.C.T.,\nYes\nNo\nYes, perchette\nNo, call well\nNo, Campbell\nNo, can't trail\nNo, Dickerson\nYes.\nDukes.\nDukes.\nYes.\nGamble.\nGah.\nNo.\nGilear.\nGilear.\nYes.\nGord.\nGord.\nYes.\nGreen.\nGreen.\nNo.\nGullet.\nGullet.\nGullet.\nNo.\nJones.\nJB.\nJones.\nJB.\nNo.\nJones, JB.\nJones, G.\nKirby.\nKirby.\nLot.\nLot.\nNo.\nMathis.\nMathis.\nMetz.\nMetz.\nYes.\nBob Tehan.\nBob Tehan.\nno. Park. Yes. Prood. Prood. Rogers. Rogers. No. Singleton. Singleton. No. Stovall. Stovall.\nYes, Williams are\nNo\nBentley\nCooper\nDollar\nDrenner\nDryer\nFleming\nGardener\nGilligan, Holcomb, Holland, Hauston, Jones J.B., Jones T, Jones T,\nLeonard Kirby\nMcLaren\nHullen\nSmirry\nTarvan\nTurner\nBut ask members to take a moment and look at the board and make sure that it is accurate.\nThe clerk will lock the machines on the gentleman's motion that this house reconsider its\naction in giving House Bill 1029, the requisite constitutional majority, the\neyes are 63, the nays are 95, the motion is lost, and this house has failed to\nreconsider its action. On Wednesday, June 17, the House passed House Bill 1030,\nThe gentleman from the 132nd District, the minority leader of the House, served notice\nof a motion to reconsider the action of the House in giving House Bill 1030 the requisite\nmajority.\nNow is the time for the gentleman to pursue the motion if he so desires.\nThe chair recognizes leader Trammell own his motion.\nMr. Speaker, would ask unanimous consent to withdraw a motion with respect to House Bill\n1030.\nThe minority leader has asked for unanimous consent to withdraw his motion for reconsideration\non House Bill 1030.\nIs there objection, Chair, here's none, and it is so ordered and is withdrawn.\nWe will now go home to morning orders.\norders. What purpose does\nrepresentative Williams rise?\nParliamentary inquiry. Is it not true\nas a speaker that has a point of\npersonal courtesy? I usually vote\non reconsiderations. I believe that to be true. Is it not further true that Senator David Lucas\nsponsored this bill, Macon and had the bill come up, I would have voted yes, I have a great\nrespect for him and his local leadership. I believe the gentleman is truthful about that which he\nstates. Morning orders are a total of 10 minutes for all of the morning orders. The chair recognizes\nRepresentative Bonner for a morning order. Thank you, Mr. Speaker. This morning I rise to recognize\na special group of Georgians. The motto for this group is always ready, always there. Since early\nMarch, the men and women of the Georgia Army Guard, Air Guard, and State Defense Force have\nbeen activated and mobilized throughout the state to fight against COVID-19.\nAnd let me share with you just a few things that these incredible individuals have been\ndoing for us.\nDuring the course of that time since early March, they have conducted 50,000 COVID-19 tests.\nThey have disinfected 720 state nursing homes.\nSome as many as six times, all at no cost to those homes.\nThey have packaged and delivered 948,000 meals for the Atlanta Public Schools System and\ndelivered those meals.\nThey've worked at a total of 10 food banks, packaging 65.2 million pounds of food, and\nprepping 34.3 million meals.\nIn addition, they've augmented our state hospitals.\nThey have assisted our various agencies.\nIn fact, there are 3,100 guards been currently mobilized\nthroughout the state of Georgia doing exactly\nwhat they've been called to do.\nAlways ready, always there.\nThese men and women are serving,\nregardless of race, creed, and color.\nThey swore a note to the Constitution, the State of Georgia,\nand to the Constitution of the United States.\nAnd they are doing so and providing a great example\nto each and every one of us.\nIn addition to what they've done for COVID-19,\n1,600 personnel have responded to the civil unrest.\nWith the National Guardsmen on site at Linux Mall,\nwithin 15 minutes of Governor Kemp signing\nan executive order authorizing them to do so.\nThese are our constituents.\nThese are our neighbors.\nThese are our friends.\nThese are Georgians that have set everything aside\nto not only defend us, but to do so without prejudice.\nAnd so today, Mr. Speaker,\nI'd like to offer a sincere thanks\nto Major General Tom Cardin,\nCommand Sergeant Major Marsher,\nand the entire command staff\nand all the men and women of the Georgia Department\ndefense for all they've done for us over the last few months.\nWe thank you and God bless and wish you Godspeed.\nThank you, Ms. Stringer.\nApplause\nChair recognizes representative Kendrick\nfor a morning order.\nThank you, Mr. Speaker.\nThese are unprecedented times.\nThese are times that have left us confused and scared in part\nbecause we simply don't know when it will all end.\nWhile all this is no doubt at least in part true for all of us, the burden of it has fallen\ndisproportionately upon our black friends and colleagues.\nThis is not okay.\nMeanwhile many of us have for the most part state silent.\nThis is not okay either.\nSo what now?\nWhat do we do now that issues always present but seemingly bundling below the surface\nthere squarely in the face?\nWhat we do is rise.\nissues have risen, so we rise to meet them. But we don't rise alone. See in my eyes we are a family,\na family of 52,000. These are not my words, but the words, the departing words of Attorney\nDarrylson, the outgoing president of the State Bar of Georgia, at last week's meeting.\nAnd I am proud to be one of those 52 members of the State Bar of Georgia. Thank you, Mrs. Speaker.\nChair recognizes representative Abel Mabel Thomas who promised to get on\nearly today but we ran out of time on her yesterday.\nOkay, thank you Mr. Speaker and members of distinguished bodies.\nThis is a time in history that we really can't just step past.\nSo I want to start off saying to the protestors for them to be safe,\nbe nonviolent and continue to be persistent,\nmarch on to the playing columns.\nOtherwise, we will go back to normal.\nAccording to Reverend William Barber,\nwho found him on Monday,\nthere are 140 million folks in poverty,\nbut that's why Brown et cetera.\nWhat he states is he wants to build\na multiracial democracy fight against systemic racism\nin poverty.\nHe states that there's a cost for inequality.\nSo on Saturday, this Saturday, the 20th,\nhe's coordinated summit on poverty\nand is a virtual conference due to the pandemic.\nIt was supposed to be like a march on Washington.\nSo he states that this is just not about police brutality\nand misconduct.\nThis is about structural racism and white privilege.\nI'd like to also commend Tamika Mallory for her voice\nin this matter of revolution and for raising\nand elevating the name of Brianna Taylor\nin the climate of injustice.\nRachel Brooke's sleep in the drive through ends up dead.\nThe guy in South Carolina killed nine people\nin an enemy church pretending he wanted to pray.\nHe gets a chance to go to Burger King,\ntaken by the police, the price of a hamburger.\nI'm here to tell you that going back to Reverend Barber, he said we can't deal with poverty\nalone.\nIt's always the interlocking, interjustice of systematic racism, ecological devastation,\nthe war economy, and the distorted moral narrative of religious and naturalism.\nOur basic demand is the reconstruction of local state and federal policies to address\nthese interlocking injustices.\nThis is a time in history, we cannot step past it.\nThis is an opportunity for us to all be in this together, not by being kinder to each\nother and speaking to each other, which is a start, but for us to begin to really look\nat the structure and the foundation for which our democracy has been based upon.\nIt is time for systematic change to make sure that people of color or respect it, people\nSo we'll call it have the type of rights as everybody else and it's just not about police\nbrutality.\nIt is much deeper.\nThank you very much.\nMr. Speaker, an idea of a will.\nChair recognizes Chairman Allen Powell for a morning order.\nThank you, Mr. Speaker and ladies and gentlemen.\nWilliams. I made an announcement about multiple members in the well on Monday and I have to be\nconsistent with that. We'll let you sit up here on the front row. I know you have a great interest in this.\nGentlemen may proceed. Thank you, Mr. Speaker and ladies and gentlemen of the House.\nYou know, I'd like to ask everybody to stand in honor of one of our own, the man who\ncouldn't stand for the last 22 years, Rusty Kid.\nA lot of y'all that had the great pleasure of knowing Rusty and serving with him, from\nO9 to 17, Rusty was a unique character, and I say character because he came from a line\nof characters.\nHis daddy was the famous Culver Kid, the great fox of the Senate.\nRusty learned this, he learned politics in the early life.\nWhile his daddy was a 50-year veteran of the legislature, Rusty was a lobbyist in our\nearlier life, and a businessman for their business in Millageville.\nUnfortunately, around 98, Rusty was injured at a motorcycle accident, quite, quite humbly\nto see a man of his physique, a man who played football at Tennessee, a man of his\nwho was active, but, you know, that motorcycle put him in a wheelchair.\nAnd I remember going to Shepard to see him.\nThere was no way that he should have ever been able to survive.\nBut nothing more than sheer willpower of being his character.\nHe survived. He learned to breathe again.\nHe learned to motivate that wheelchair that we all knew of Rusty.\nRusty kid had character ladies and gentlemen.\nran as an independent. He was like a lot of us. He didn't like either political parties because neither parties always right\nneither parties always wrong. But he stood for that principle of representing his constituency in Millageville, Georgia.\nSo I'm not going to yield a jazzy because everybody knew that New Rusty knew what a guy was and what a big heart he had.\nwhat a big heart he had he gave more to people that needed things that\ncouldn't afford it because of what he had because of the life that he was\nable to lead he lived because he had the opportunity to survive for another\n22 years. Rusty died on June the 2nd. I'm gonna tell you something when the\nclouds peeled back for us to come up there to be with a lot of the old\ntimers include and call them. It had to be a shaken and bacon session in heaven.\nLadies and gentlemen, pay honor to the famous Rustic yet.\nThank you very much, Representative Powell.\nWe have used up our 10 minutes for today, the members wish to be heard tomorrow can sign\nback up. We're going on now to the rules calendar. Going to the rules calendar, the clerk\nwill read the caption to Senate Bill 372.\nSenate Bill 372 by Senator Tillery, the 19th,\nBerkeley 11th, Miller, the 49th, Watson, the 1st, and others,\nbe taught on act to amend various titles,\nthe official code of Georgia annotated,\nso as to modernize, clarify, and update provisions\nrelating to public health.\nI refer to the committee on health and human services that committee recommends that this bill do pass\nChair recognizes the chair of the House health and human services committee chairman Cooper to present the bill\nThank you mr. Speaker ladies and gentlemen of the House I bring to you Senate bill 372 this is a public health\nclean up bill to reduce unnecessary or duplicate administrative burdens and to\nupdate the Georgia Code to match what DPH is actually doing. For example, there\nhas never been a kidney disease advisory committee appointed in 20-something\nyear so this bill does away with that advisory committee. It does do two major\nthings that I will point out to you. It updates the rules on the lock\nwhich is the antidote for drug overdoses is it makes it possible for our first\nof our first responders to be able to get an eloxone from the manufacturers at\na much less cost. It also there and there's some of you may have had questions\nover people who like to do hereditary checks in genealogy. We have many\nMany Georgians living beyond 100 years of age used to, at 100 years, the records went\nand were put over in the archives, making them available to anybody that wanted to go\nthrough.\nThat would be their birth certificate, death certificate and all.\nAnd so, in abundance of caution, because we have people living beyond 100, they will\nno longer send those records to the archives until 25 years have passed to, it's 125.\npeople will be able to get the records of deceased individuals by contacting the department and\nthere will be a fee unfortunately to go with that but they're protecting our elderly citizens.\nMr. Speaker that is the end and I would ask your favourable vote if there's no questions I will yield\nthe well. You may have a question you do have a question. I will take one.\nLadies, we'll take one question.\nThe chair recognizes representative Stovall in room 341.\nOkay.\nDoes the lady yield?\nYes, I will.\nDoes this bill have anything to do with a merger being created\nfor the new public health district with Clayton County and eight of the counties.\nNo, ma'am, it does not.\nYou do not appear to have any more questions.\nThank you, Mr. Speaker. I yield the will and ask the members for their positive vote.\nThank you.\nWe have a member that wishes to speak on the bill.\nchair recognizes representative Vernon Jones to speak on the bill thank you\nmr. Speaker members of the Georgia House I didn't get a chance to ask the\ngeneral lady a question I didn't have enough time to get up to the gallery but\nwhat I wanted to say if I'm not mistaken this bill deals with vital records and\nI'm fine with that but you have a lot of people young people and others who\nlike to do family trees. And as a part of that you have to seek a lot of records\nthat's important, death certificates and other types of documents. In this\nparticular piece of legislation let's I'm incorrect. Those fees are going to be\ncharged by third party. So if I'm a student and I'm in college and I want to\ndo some research. To get a death certificate that's over a hundred years old is\ngoing to cost about a hundred dollars. Who's setting that fee? That could be\nreal expensive to each and every one of us who needs to go out and do their\nfamily tree. That's just simple. Who's going to set those fees? And if a private\ncompany set those fees, it can go up anytime they want to increase those fees.\nSo I'm all about paying for services.\nSo if I'm incorrect, just I just want to make sure that it is correct.\nAnd I'm sorry to generate.\nI didn't give a chance to answer your I'm getting chance to ask you a question.\nLet's speak out.\nYou have any questions at this time.\nYou have a question from Chairman Cooper.\nDo you're right?\nThank you for the gentleman.\nYes, ma'am, I do.\nOkay. Thank you for saying that you did not hear it. The fee will be $25 and I guess I can't. And who says to fee?\nIt would be the people in the vital records public health department.\nWhich is not right. You all have this way. You can go back and ask her when you leave the well.\nI'll go. I'll come back and ask. That's not prohibited. Yeah. You have another question though. If you yield.\nI yield Mr. Speaker chair recognizes representative Bentley to your left for a question. Thank you Mr. Speaker\nThere's a gentleman you I do isn't not true that\nBeing a part of the funeral industry I deal with death certificates on a regular base\nYes, ma'am and people are dying to get to you. Yes, ma'am. You're right. Thank you for noting that is enough\nHer the true that is correct to what chair lady\nCooper stated death certificates are twenty five dollars and five dollars for each additional\ncertificate requested by any individual if that's to what if that was the if\nthat is what the latest states then I I appreciate her answer yes sir thank you\nvery much thank you miss speaker okay is there any objection to the previous\nquestion being ordered the chair here's none the previous question is ordered\nis there any objection to agreeing to the report of the committee which was\nfavorable to the passage of the bill. The chair here is done. The report of the committee\nis agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill?\n372 will vote yes. Those opposed will vote no and the clerk will unlock the machines and call the\nroom.\nAlexander Anola Woods, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly,\nBlackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette,\nPepsi, Dickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming, Frye, Gaines,\nGardner, Glanton, Grabley, Harold, Hatchet, Hawkins,\nHawkins, Hitchens, Holcomb, Holms, Hauston, Hugley, Jackson M, Jasper's, Jones J, Kelly,\nKendrick, Knight, LaHood, LaRickia, Lomston, Martin,\nMathyak, McCall, Morris G. Newton, Nick's, Oliver,\nParish, Parsons, Petrie, Perkle, Powell, Reeves,\nRoads, Rich, Ridley, Rutledge, Scoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V, Smirrey,\nStevens R, Tankersley, Tanner, Tarman, Taylor,\nThomas E.\nTramble.\nWashburn.\nWatson.\nWelch.\nWorkhizer.\nWeedower.\nWilliams A.\nWilliamson.\nYerda.\nAllen.\nBaysmore.\nBernal, Canon, Carter, Clark D.\nClark J. Cook, Davis, Douglass, Dreyer,\nDunno who, Fairheart, Evans, Frazier, Gilligan, Gertwer, Henson, Hill, Hogan, Holland, Holly,\nThompson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez\nRomero, Marin, McClaren, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson,\nWhen, Paris, Prince, Pullen, Robucho, Saints, Skofield,\nScott, Shannon, Sharper, Smith M, Stevens M,\nSteven Sun, Thomas A.M., Turner, Wollensky, Wilkerson, Williams M.F., Williams N. Wilson,\nEasily teag, teag, yes, boner, boner, yes, buckner, boner, yes, perchad, perchad, yes,\nwell. Yes. Campbell. Yes. Can't trail. Yes. Dickerson. Yes. Dukes. Yes.\nYes.\nGamble.\nYes.\nGilliard.\nGood.\nGordon.\nGordon.\nYes.\nGreen.\nYes.\nGreen.\nYes.\nGullet.\nGullet.\nJones, J.B.\nYes.\nJones, J.B.\nYes.\nKirby.\nKirby.\nYes.\nYes.\nKirby.\nKirby.\nKirby.\nYes.\nMathis.\nYes.\nYes.\nYes.\nPark.\nYes.\nthrough it, Rogers, Yes, Singleton, Yes, Stovall,\nWilliams R, Yes, Burnow, Carter,\nJenner, Dreyer, Gillyard, Jones J, Kelly, Kirby, Night, Powell, Skoggins, Smirings,\nTankersley, Welch.\nmembers will check the board and make sure that it is accurate Mr. Clerk we\nlock the machines on the passage of Senate Bill 372 the eyes are 157 the\nand these are two.\nThis bill having received the requisite constitutional majority\nis therefore passed yesterday.\nSenate bill 295 was postponed until the next legislative day.\nIt is called at this time, the clerk will read the caption\nto Senate bill 295.\nSenate Bill 295 by Senator Wilkinson, the 50th Gooch, the 51st walker, the 20th mullets, the 53rd\nand others to be titled an act to amend titles 15 and 48 to the fiscal to George Anitator\nRelay and courts and revenue and taxation respectively, so as revised the cost of living\nin general performance based increases to take an account the increases provider for in\n2020 this bill ever referred to committee on government affairs that committee recommends\nthat this bill do pass by committee substitute.\nChair recognizes representative Earhart to present the bill.\nThank you Mr. Speaker and members of the assembly.\nI present to you Senate Bill 295 for your consideration.\nThis bill is essentially a cleanup bill for a bill we passed last session, Senate Bill\n171, that granted our constitutional officers in the state of Georgia, the first substantial\npay raise they've received in more than 15 years.\nOur probate judges, clerk, court tax commissioners and sheriffs all received newly established\nand competitive base salaries for the first time since 2005.\nWhat does SB 295 do?\nIt does three things.\nIt protects the 2020 state cost of living, 2% increase that was granted to our Georgia\nConstitutional Officers this year.\nAt the time of the original writing of SB 171, that particular COLA was not foreseen\ncould not have been anticipated, was not an effect yet.\nSo SB 295 basically tightens up that language to protect that 2020 cost of living that\nwas granted to them, keeps it intact, without this change to the current law.\nwould lose that 2020 cost of living that was granted this year.\nThe second thing that does is it adds language to sort of tighten it up to ensure that there\nis no possibility of double dipping with pay raises for 2020.\nWhile the 2020 2% COLA, what were made in effect, specific language has been added to\nensure that no previous COLA's, previous compensations can be added to the newly established salary\nstructure.\nSo kind of protecting that from double dipping.\nThere was a committee substitute also to include the word state prior to the phrase cost\nof living allowance to clarify that this bill refers only to the state cost of living\nallowances has no bearing or effect on any sort of local supplements that the counties\nmay put in place.\nTowards noting the bill, which is the result of collaboration between COAG and ACCG, just a simple housekeeping bill, I ask for your favourable consideration.\nMr. Speaker, if there are no questions, I will yield the well.\nYou do not appear to have any questions.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of Senate Bill 295 will vote aye.\nThose opposed to vote no in the clerk will unlock the machines and call the roll.\nWhat do you got?\nAlexander Manolo-Witz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly,\nBlackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar,\nDrenner, Dubnick,\nAbstration, England,\nIrwin, Fleming,\nFrye, Gaines,\nGardner, Glanton,\nGrabley, Herald,\nHatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasperce, Jones\nJames J. Kelly, Kendrick, Knight, LaHood, LaRickia, Lomston, Martin, Mathyak, McCall, Morris\nBruce G. Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes,\nRich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie,\nStevenson R. Tankersley, Tanner, Tarvan, Taylor, Thomas E. Trammell, Washburn, Watson,\nWelch, Workhizer, Williams A, Williamson, Yerda, Allen,\nBaysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDryer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland,\nHolly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd,\nLopez Romero, Marin, McLean, McLaren, McLeod,\nMeeks, Mitchell, Moore B, Morris C, Morris M, Nelson,\nWhen Paris, Prince, Pullen, Robucho, Saints, Scofield,\nScott, Shannon, Sharper, Smith M, Stevens M,\nSteven Sin, Thomas A.M., Turner, Wolensky, Wilkerson,\nWilliams, M.F., Williams, N. Wilson,\nEasily teag, easy teag, yes, boner, boner, yes, boner, boner, yes,\nFor Chet.\nYes.\nCall Well.\nYes.\nCampbell.\nYes.\nCantrell.\nYes.\nDickerson.\nYes.\nYes.\nYes.\nYes.\nCampbell.\nYes.\nYes.\nGillard.\nGillard.\nGordon or green. Yes. Yes. Yes. Yes. Jones J.B. Jones J.B. Yes.\nYes.\nKirby.\nKirby.\nLot.\nLaw.\nYes.\nMathis.\nMaths.\nYes.\nMetz.\nMetz.\nYes.\nMom-to-han.\nMom-to-han.\nYes.\nPark.\nPark.\nYes.\nProod.\nProod.\nRogers.\nYes.\nProved.\nProved.\nRogers.\nRogers.\nYes.\nSingleton.\nSingleton.\nStovall.\nStovall.\nYes.\nWilliams R.\nWilliams R.\nYes.\nBlackman.\nDavis.\nGilliard, Gravley, Hogan, Jackson M, Kirby,\nPerkle, Singleton, Stephens R, Taylor, Thomas AM, Weed Hour, Wilson.\nOkay, members, we'll look at the board\nand be sure that it is correct.\nMr. Clerk, you may lock the machines\non the passage of Senate Bill 295.\nThe eyes are 159, the knees are zero.\nThis bill having received the requisite constitutional\nmajority is therefore passed.\nYou\nWe'll read the caption to Senate Bill 377.\n7 Bill 370, Senator Jones, the 25th, Berkeley, 11th, Mulles, the 53rd Robinson, the 29th\nCropatch, the 32nd, and others to be titled an act to amend Code Section 8202, the official\ngo to George annotated, relating to inspections, so as to reduce the number of required annual\nElevator inspections this bill have referred to the committee on insurance that committee recommends this bill do pass\nby committee substitute\nChair recognizes chairman Lomston to present the bill\nMadam Speaker members of the House I bring to you Senate bill 377 the bill that comes as a request from the state insurance\nCommissioners and the builders association\nThe bill has three basic parts.\nFirst, the insurance commissioner is by law responsible for a variety of functions related\nto buildings, record keepings, printing, mounting of license, testing and inspections.\nThe inspections and licensing of elevators, escalators, moving walkways and similar people\nmoving devices is one such process handled through the insurance commissioner's office.\nCurrently, Georgia law calls for all of these devices to be inspected every six months.\nThis requirement dates back many decades because of advances in technology, most of the\nolder type elevators no longer exist.\nMost other states have a 12 or 18-month inspection cycle.\nThe reality is that only about 35% of the existing devices can be inspected within the existing\nsix-month timeframe with our existing certified inspectors.\nSo by changing the requirement to 12 months, it would allow the department to better focus\nits resources in areas that are already identified as needing more frequent inspections\nor accommodate those who want their devices inspected more frequently.\nSince most elevator devices are maintained and serviced by commercial companies under\ncontract, an inspection schedule in line with other states seems reasonable and poses\nno increased safety concerns.\nSenate Bill 377 changes the time frame for inspections from six months to 12 months.\nSecondly, it also changes shall in line 39 to May.\nIn many areas, the Department of Insurance\nuses third-party vendors to provide various services\nsuch as record keeping, licensing, testing, printing,\nand so forth.\nSo by changing shall to May, it enables\nthe department to renegotiate contracts\nand change the current process to a more traditional approach\nthat should provide savings to taxpayers\nand transparency in the process.\nThirdly, the other part of this bill\nputs into code an executive order issued by the governor during the pandemic, which allows\nlocal governments to use private plan review and inspections for all building types including\nhospitals, ambulatory health care centers, nursing homes, jails, airports and high rises.\nThird party plan review and inspection is already a common practice, but not for all building\ntypes.\nDuring the pandemic many local government services were impacted because key personnel\nwere prevented from performing their jobs and in the case of a construction projects without\nplan review and inspection, construction would come to a halt.\nThis simply permits a process that is already in place to be used in the construction of\nsome previously excluded building types.\nSo in short, the bill does three things.\nIt changes the inspection frequency for elevators from six months to twelve months.\nIt changes chow to may and it codifies an executive order that expands the type of structures\nthat private plan review and inspection may be used for.\nMadam Speaker, that is the bill.\nI'll be glad to answer any questions.\nIt does not appear to be any questions on the chamber floor.\nUp there is a question.\nIs there a question from the gallery?\nIs it the bedenna view?\nI do.\nI just have a question about the inspection period.\nWe are reducing the number of inspections of elevators\nthat we're doing.\nCurrently, the law states six months\nas the inspection process.\nBut as I noted in my comments, this date back many decades\nand was primarily geared at those types of elevators\nthat existed at the time the law was put in.\nSince then there have been many advances in the way\nand the elevator design and technology surrounding that.\nSo it simply recognizes the situation\nthat things have improved and it provides the department,\nthe ability to focus its attention on those areas\nwhere they know problems already exist\nand can better utilize the limited resources\nthat they have to make sure that the safety is in place.\nthat's a generally further yield. I do. Have you ever been stuck in an elevator? I have not.\nOkay well I have and it's very scary and if that happens when inspections are\nhappening happening every six months, I'm just fearful of what might happen if\nthese spread those inspections out in being part of. The reality is only about\nAbout 35% of the elevators in the state are being inspected every six months because the\ninsurance department does not have adequate personnel inspectors to carry out that every\nsix months.\nIn fact, if we were to be able to carry that out every six months, we would have to add\n20 new inspectors to make that happen.\nBut what we have is a situation where the newer style elevators, technology, it would\nmake much sense to inspect a brand new elevator every six months since they seldom present\nproblems early on. It's usually much longer in their life before they start having problems.\nThank you.\nYes. There are a couple more questions if you care to yield. The chair recognizes Chairman\nKnight for a question. I'll take one more.\nThere's a gentleman yield. How are you?\nI really appreciate you bringing this bill, and I want to, again, go back to seeing the\ncomments, and isn't it true that many other states have already enacted their laws state\nthat it's 12 months or 18 months of inspection?\nThat has already changed their laws to reflect on the newer technology and the newer\nThat is great.\nFor the words and the truth, as you've alluded to, this will allow the department to focus\nits resources, as you've said, on the older elevators and focus with the commerce officer\nof the regional lady, whenever I have that experience again.\nI agree fully.\nThank you.\nMadam Speaker, I yield the well.\nThe gentleman has yielded the well for what purpose does representative Lopez Romero rise?\nStature inquiry\nUnfortunately, the office kept away, but I would want to know if our elevators will now be inspected on the yearly basis as well.\nBy hours I'm here.\nThe chairman doesn't know the answer, but certainly can ask the author of the bill that's carrying it here.\nThere are no more questions.\nIs there any objection to the previous question being ordered?\nThe chair here is not in the previous question as ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is not in the committee substitute as adopted.\nIs there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nChair here is not in the report of the committee as agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill will vote yes.\nAll those opposed will vote no, and the clerk will unlock the machine and call the roll.\nWell it's Andrew, Anola Woods, Bar, Barton, Belton, Bennett, Bentley,\nBenton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins,\nCooper, Corbett, Dempsey, Dickey, Dollar,\nTrenner, Dubnic, Abstration, England,\nIrwin, Fleming, Frye, Gaines, Gardner,\nGlanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes,\nHouston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Night, LaHood,\nLarickia, Lomston, Martin, Mathiac, McCall, Morris G, Newton, Nicks, Oliver, Parish, Parsons,\nPeatry, Perkle, Powell, Reeves, Roads, Rich, Ridley,\nRutledge, Skoggins, Setsler, Silcox, Smith-L, Smith-R, Smith-V, Smirrey, Stevens-R,\nTankersley, Tanner, Tarvan, Taylor, Thomas E, Trammel, Washburn, Watson, Welch,\nWe're Kaiser, Weed Hour, Williams A, Williamson, Yurda, Allen,\nBayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDryer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland,\nHolland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Kaush,\nLeonard Lopez Romero, Marin, McClaren, McClaren, McCloud,\nMeeks, Mitchell, more B, more C, more SM, Nelson, when Paris, Prince, Pullen, Robucho,\nSaints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven Sin, Thomas\nA.M., Turner, Wolensky, Wilkerson, Williams, M.F., Williams, N. Wilson, Beasley Teague,\nYes, boner, yes, buckner, yes, perchette, call well, Campbell, can't trail, can't\nYes.\nDickerson.\nDukes.\nYes.\nDukes.\nDukes.\nYes.\nGamble.\nGamble.\nYes.\nGillard.\nGillard.\nGordon.\nGordon.\nYes.\nGreen.\nGreen.\nYes.\nYes.\nGoat.\nGoat.\nYes.\nJones J.B.\nJones J.B.\nYes.\nKirby.\nCurry.\nYes.\nLot.\nLot.\nYes.\nMathis.\nMets.\nYes.\nMets.\nMets.\nYes.\nBob Tahan.\nBob.\nYes.\nPark.\nNo.\nProof it.\nProof it.\nRogers.\nRogers.\nYes.\nSingleton.\nSingleton.\nYes.\nStovall.\nStovall.\nYes.\nWilliams R.\nWilliams R.\nYes.\nBeverly.\nBoatie,\nBirchette,\nCannon,\nCarter,\nDunahoo,\nGilear,\nJones J,\nBirchette,\nKelly,\nLomston, Oliver, Ridley, Smyrie, Williams A.\nThe chair asks that all members review the board and assure that it reflects your intention\nas to how to vote.\nIf it does and all members have voted, the clerk will lock the machine.\nOn the passage of the bill, the a's were 134, the a's were 27, the bill having received the requisite constitutional majority is there for a path.\nClerk will read the caption to Senate bill 144, Senate bill 144.\nSenate Bill 144 by Senators, Anderson, the 24th Miller, the 49th, almost the 53rd stone,\nthe 23rd, and others being taught in the act to amend Chapter 11, Title 48, the official\nof the Georgia annotator relating the taxes on debacle products still survive for the\nissuance of special event debacle permits to license dealers.\nThis bill ever refer to the committee on ways and means that committee recommends that this bill do pass\nChair recognizes chairman Fleming to present the bill\nThank you, madam speaker ladies and gentlemen of the house Senate bill 144 is a bill that passed with the unanimous bipartisan\nConsent out of the Senate and support it deals with the sale of\nof tobacco products at a special event.\nYou are probably, for me, with going to a festival\nof some sort and someone will be a local vendor\nwith already a license and they'll set up a tent\nand sell alcoholic beverages at that event.\nThere is a process for that.\nThere is not a similar process for us\nto allow the sale of tobacco products at a special event.\nThis would allow a person that is one of your local\nbusinessmen who has a tobacco shop, for example,\nto get a special permit to sell.\na festival or an outdoor event or something of that type. All the same\nrestrictions that have to apply to the cell of tobacco anywhere will be an\napplication here. If there are any violations of those that person stands to\nhave their license revoked. Madam Speaker, that is simply it. I would be\nhappy to answer any questions from members of the house.\nThe Chair does not observe any questions.\nThank you, Madam Speaker.\nI yield the well and ask for your favor.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe Chair here is none of the previous question is ordered.\nIs there any objection to the green to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe Chair here is none of the report of the committee has agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill will vote yes, all those opposed will vote no and the clerk will unlock the machine and call the roll.\nAlex Andrew, Anelowicz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly,\nBlackman, Bowdie, Bruce, Burns, Carpenter, Carson,\nChocus, Clark H, Collins, Cooper, Corbett, Dempsey,\nDickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming,\nFrye, Gaines, Gardner,\nGlanton, Graveling,\nHarold Hatchett, Hawkins, Hitchens, Holcomb, Holmes,\nHouston, Hugley, Jackson M. Jasperce, Jones J. Kelly,\nKendrick, Knight, Lohood, Larickia,\nLomston, Martin, Matthew, McCall,\nMorris G, Newton, Nix, Oliver,\nParrish, Parsons, Petrie, Perkle, Powell, Reeves, Rose, Rich, Ridley, Rutledge, Skoggins,\nSetsler, Silcox, Smith L, Smith R, Smith V, Smirrey,\nStevens R. Tancersley, Tanner, Tarvon, Taylor, Thomas E.\nTramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, William Sun, Yerda,\nAlan Bayesmore, Bernard Cannon, Carter Clark D, Clark J. Cook, Davis Douglas,\nDryer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holly, Holland,\nThompson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd,\nLopez Romero, Marin, McLean, McLaren, McLean, McLean, McLean, McLean,\nMeeks, Mitchell, more B, more C, more SM, Nelson, when, Paris, Prince, Poland,\nRoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven\nWilliamson, Thomas A.M., Turner, Wilinski, Wilkerson, Williams M.F., Williams M., Wilson,\nBeasley Teague, B-S-T.\nYes.\nBonner.\nYeah.\nBonner.\nYes.\nBuckner.\nYeah.\nBonner.\nBurchette.\nBurchette.\nYeah.\nYes.\nCall well.\nYeah.\nCall well.\nYes.\nCampbell.\nYeah.\nCampbell.\nYes.\nCantrell.\nYeah.\nCantrell.\nNo.\nDickerson, Dukes, Dukes, Gamble, Galeard, Gordon, Green, Gullet, Jones J.B.,\nJones J. Yes. Kirby. Yes. Lot. Yes. Mathis. Mathis. No. Metz. Yes. Lamptaha. No. Park. Yes.\nit. Rogers. Yes. Singleton. Yes. Stovall. So. Yes. Williams R. Yes. Bennett.\nBuckair, Cannon, Yes.\nGillard, Jasper's, Jones J, Kendrick, Powell, Pullin,\nThomas AM Chair asked that all members review the board and assure that it\nreflects the way you prefer to vote. If so, the clerk will lock the machine. On the\npassage of the bill the yeas were 152 the nays were nine. This bill having\nand receive the requisite constitutional majority\nis therefore passed.\nYou\nIf you want to change a vote after the machines have been locked, the procedure is the same\nas it normally is, you can come to the clerk's office down here and register that.\nOtherwise we are giving time after the vote for you to look at the board and that's what\nit's for.\nto look at the board and make\nsure Senate Bill 249 will be\npostponed until the next\nlegislative day.\nWhat purpose does the\nmajority leader of the House\nrise?\nwould like to be recognized make a motion state your motion this\nspeaker out make a motion that we move Senate resolution 19 from the\nTransportation Committee to the Rules Committee both chairman or in agreement\nclerk will read the caption Senate resolution 19 by senator beach the 21st\nGucci the 51st Watson the 1st mill is 49th and others creating the Georgia\nCommission of Freedom Logistics.\nOn the gentleman's motion that Senate resolution 19 be removed from the Transportation Committee\nand committed to the Rules Committee, is their objection?\nIs their objection?\nThe chair here is none and it is so ordered.\nThe clerk will read the caption to a group of privileged resolutions.\nThis morning, the 2020 Juneteenth Freedom Day Unity Celebration.\nCongratulations, the Heritage High School Five Star Dance Team for winning the 2020 G.H.S.A. Class 3A-4A State Dance Championship.\nrecognizing and honoring James Nicholas Chotis.\nCommending High Hope Service Center on a 60th anniversary of\nsupporting individuals with intellectual and developmental disabilities.\nCommending and congratulating Bonner Broadnax.\nHonoring Christine Miller-Bets Executive Director of the Lucy Craft Lainey\nMuseum of Black History on her retirement.\nand for all the purposes that completes the reading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions the chair here's none and the resolutions are adopted?\nYou\nWhat purpose does Chairman Green rise to make a motion?\nyour motion. I move that the rules of the House be temporarily suspended for the\npurpose of introducing a bill to be read and assigned to committee.\nMark will read the caption. A number of House bill by Rep. Greene and\na hundred fifty-first and others will be tunneled and I create the G. Hall Park\nauthority approved April 11, 1979.\nOn the gentleman's motion that the rules of this house be temporarily suspended to allow\na bill to be read for the first time in a signed committee, is there objection?\nIs there objection?\nAre you objecting on a local bill?\nOkay.\nIt'll be on the first readers tomorrow morning.\nUnbelievable.\nWe're going out now to announcements.\nGoing to announcements.\nChair recognizes Chairman Newton for an announcement.\nThank you, Mr. Speaker the House special committee on access to quality health care will meet today at two o'clock and room 406\nC-L-O-B two o'clock. Appreciate everybody being there\nchair recognizes chairman Hitchens for an announcement\nThe public safety and Homeland Security Committee will meet tomorrow morning eight o'clock\n606 C-L-O-B. We have four Senate bills to consider\nchair recognizes representative Henson for an announcement\nGood afternoon.\nThe Working Families Caucus will be having a Zoom meeting today, immediately after we\nget out of session.\nYou should all have received an email.\nIt would be coming from Elizabeth Appley and it will be for the Working Families Caucus.\nSo please join us on your Zoom.\nThank you.\nChair recognizes Chairman Barr for an announcement.\nGood afternoon, y'all.\nThis is for the Code Revision Committee.\nWe are having our meeting today at 2 o'clock in 4.03.\nCode Revision Committee, the annual Code Revision Bill is up.\nThank you to the speaker.\nChair recognizes Chairman Lumsden for an announcement.\nHouse insurance committee will be meeting today at 2 o'clock room 341.\nWe have one bill on the agenda chair recognizes the majority caucus whip\nrepresentative Kelly for an announcement.\nThank you, Mr. Speaker.\nYour committee on access to the civil justice system will meet at 4 o'clock today in room 132.\nThat completes our announcements.\nthe chair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I'm honored that this House stand in recess until 4 p.m. today and then stand\nadjourned until 10 a.m. Friday, June 19, 2020.\nThe majority leader has moved at this house, stand in recess until 4 o'clock p.m. today,\nwhereupon we would be adjourned until Friday, June 19 at 10 o'clock a.m. on Friday. All those\nin favor of the motion will say aye. Those opposed will say no. The eyes have it in this house\nwill be in recess until 4 o'clock p.m. today and we will reconvene tomorrow morning at\nto the AM.\n",
  "updated_at": "2026-02-12T13:08:00.414347+00:00"
}