{
  "video_id": "Hq2FAzJ-jUk",
  "url": "https://www.youtube.com/watch?v=Hq2FAzJ-jUk",
  "title": "Sen. Hickman Press Conference on Education Reform | 03/07/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 20,
  "summary": "Here is a summary of the key points from the Georgia Sen. Hickman press conference on education reform:\n\n**Overview**\nThe press conference focused on literacy and education reform efforts in Georgia, particularly around the Georgia Early Literacy Act (HB 538) and Senate Bill 464. There was a strong emphasis on the importance of high-quality assessment tools and universal screeners to identify struggling readers early.\n\n**Key Actions**\n- **HB 538**: The Georgia Early Literacy Act, which mandates the use of evidence-based literacy curricula and structured literacy instruction. \n- **SB 464**: A related bill focused on literacy assessments and screeners.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced during this press conference.\n\n**Notable Moments**\n- Rep. Bethy Ballard, the sponsor of HB 538, discussed the importance of early identification of struggling readers and providing intensive instruction.\n- Sen. Clint Dixon emphasized the decline in student achievement scores and the need for better assessment tools to empower parents.\n- Sen. Hickman proposed an amendment to SB 464 to require a universal, free screener to be used by all schools statewide for consistency and comparability.\n\n**Votes**\nNo votes were taken during this press conference.\n\n**Attendance**\nThe press conference was well-attended by members of the media and other interested parties.\n\n**Adjournment**\nThe press conference concluded, and no specific next session date was provided.",
  "transcript": "We're good, we're good afternoon. How y'all doing?\nWell, there's been a lot of people in the capitol today and of course there's still a lot of people in the capitol now.\nI just want to thank y'all for being here. This is kind of a moldy purpose of press conference today.\nWe're going to talk about literacy and we're going to talk about literacy and we're going to talk about literacy.\nOkay, and so first of all, I would like to like to introduce to the\nrepresentative, Bethy Ballard, who is the mother, the mother of House Bill\n538, the Georgia Early Literacy Act, and she's going to talk a little bit\nabout that, and then I'm going to turn it over to Senator Clint Dixon to talk\nabout Senate Bill 464, and then I'm going to talk about our amendment to that\nBill, and then Mr. Scott Johnson, who was chairman of Georgia Council of\nLiteracy, will talk about the Council's involvement in this. So, Representative\nBallard. Thank you. In the last legislative session, I was proud to sponsor\nHouse Bill 538, the Georgia Early Literacy Act, which mandates that schools\nuse a literacy curriculum that's aligned with the science of reading and\nand structured literacy.\nAnd this requires a return to the foundational principles\nof literacy that are evidence based\nand have been proven to work,\nto teach our kids to read.\nTo do this, one of the things we need to do\nis be able to identify these struggling readers\nearly in their school careers\nso that they can get intensive instruction\nin order to be proficient by the end of third grade\nbecause by the end of third grade statistics tell us\nthat that is when students need to be proficient\nso that they have success in later life.\nIf they don't have proficiency\nby third grade statistics show,\nthey will not be successful.\nWhat this means is we have to have quality assessment tools.\nWe have to have assessment tools that measure\nwhat we want them to measure\nand that tools that give us accurate data\nfor comparison within our districts and across our districts,\nto make sure our children are learning what they need to learn.\nOur state's teachers are very excited about House Bill 538.\nI hear them.\nThey come up to me at home.\nThey're so excited.\nBut what they need is our support.\nThey deserve the very best tools to help them\nserve their students well.\nAnd I look forward to working with all\nof our literacy partners across the state\nto make sure this happens for our children.\nThank you.\nGood afternoon, everyone.\nThank you all for coming.\nToday, my message is that status quo in education\nis no longer acceptable.\nAll of us should be concerned when we look at the recent\npublished CC RPI data that was provided\nby the Georgia Policy Foundation.\nOur scores here in Georgia on an average,\nelementary schools are scoring at 75.9%,\nwhich is a 5% decline since 2019.\nFurthermore, middle schools are scoring at 70.8%,\nwhich is an 8% decline since that same year.\nHigh schools are scoring at an average of 73.5%,\nwhich is a 6.8% decline since 2019.\nLooking at all the scores, only 26.6% of our schools\nare scoring above and 80% average.\nMeanwhile, spending per pupil is increased by 27.5%\nsince that same year.\nWhen my children come home with a grade that's a C or below,\nI'm concerned, my wife is very concerned,\nand we make sure that we do things differently.\nToday, we're continuing to send a message\nthat we expect the Department of Education\nand our school systems to do things differently.\nWe continue.\nLiteracy is one of the Georgia General Assembly's\nprimary priorities and has been for two years now.\nBefore I hand it over to Senator Hickman,\nI want to speak directly to the importance\nof K through three screeners.\nAnd let me express why I think this is critical\nto have the best quality screeners\nthat we can possibly have here in Georgia.\nIf you look at House Bill 538,\nthe most important purpose is the screeners,\nproviding the information to parents,\nstarting in kindergarten because we all know\nearly detection with literacy issues\nor any learning issue with a child.\nThe earlier we catch it, the quicker and easier\nwe can have that child recover from that issue.\nAnd we must not forget the important role of parents\nand this empowers parents to understand\nwhere their kids are.\nI believe in school choice, as many of you know,\nand our parents need to be informed\nif their children are getting the support that they need\nand make sure that they're staying on grade level\nwith reading.\nAnd with that, I'd like to call my dear friend\nSenator Hickman up next.\nThank you.\nThank you, Senator Dixon.\nAfter Senator Dixon passed the House Bill\nexcuse me, Senate Bill 464 or before he passed it, I went to him with a friendly amendment\nconcerning the screeners.\nWe felt like it was very important that we are able to measure Chatham County against\nWinnett County against Fulton County against Versailles County all across the state.\nVery important to have one universal screener that all schools in the state of Georgia\nused.\nThey can use other screeners in addition to that, but it's very important that every school\nget measured against every school.\nSo we took this thing very seriously.\nThe President of Council, Scott Johnson, I talked about this a good bit.\nHe and I got an amendment drafted and we'll go over that in a minute too.\nBut before we did that, I went and talked to several of our senators.\nSenator Tillery was one of my talk too.\nI didn't read them, but he was satisfied with it.\nSenator Dixon, I let him read it.\nHe was satisfied with it.\nI went to Lieutenant Governor's office\nand let them read it, and they were satisfied with it.\nI don't think we can forget that in 2010,\nour children were reading on a higher grade level in 2010\nthan in the world in 2019,\nand then we had the pandemic.\nWe can't take this stuff lightly, people.\nThis is not a marathon.\nThis is a 100-yard dash,\nand we got to take a serious, and we got to move fast.\nAs representatives of the ballroom said,\nmany times, this is a matter of national security.\nIf our students and children can't read,\nthey can't protect us.\nThat's why Senate Bill 211 came about\nand House Bill 538 came about.\nWe want every school to use the same free streamer.\nSo let me talk a little bit about how we did this.\nSo this amendment that I sponsored, Senator Dickson signed it, Senator Hillary signed it,\nSenator well the members of the Senate signed it.\nThis amendment addressed the issues that have arisen around universal screeners.\nNow keep in mind if you don't know what a screener is, a screener is based a test.\nSo don't get a screener confused in something like that's a test.\nHaving multiple universal screeners makes it impossible to compare data from school system to school system.\nThis amendment remedies this problem\nby requiring that all school system\nuse the free, free of charge, universal screener.\nSystems, as I stated earlier,\nsystems may use a different screener\nfor other reasons, but we want every school system\nto use the same universal screener.\nWe noted DOE is developing a free screener.\nHowever, the screener will not be operational\nif we have told until all of us in 2024,\nAnd it's ripped into battle until you,\nthat's basically with school starts.\nAnd her bill requires children to be tested\nabout that time.\nWe also do not know the reliability\nif a stringer is being developed right now,\nwe don't know the reliability of that stringer.\nWe don't know it's gonna be beta tested, all that kind of stuff.\nYou know, you know, I'm an accountant, CPA.\nWe never develop our own software in today's world.\nWe depend on other people that have developed software\nthat had been tested and retested before we use it.\nWe also know that the free streamer has been developed\nby a company by the name of CRDRC.\nAnd from my understanding, our understanding,\nDRC has never developed a streamer in the past.\nSo as the background of 538 required\nto state board education to publish a list\nof qualified streamers, the nation of board\nprovided 16 streamers.\nAnd then we have to deal with the council,\nhave to deal center to do us to do a psychometric analysis of these\nstringer 16 stringers and they basically graded these stringers from best\nto worst.\nSo that's going to be after that the State Department of Education came in\neliminated three of those stringers, so now it's down to 13.\nSo what we've got if we don't drop this amendment and get this thing\nthrough the house and then Governor signs it, there'll be 13 different\nstringers used in the state of Georgia by all these different schools. There's nowhere,\nno way of comparability when you're doing this. So, so the state board dropped it down\nto three. House Bill 538 required the DOE to provide a free stringer by August 1. That's\nin the bill. August 1, 2024. The same day that schools and districts must begin stringing\nInstitute. Our great governor, Brian Kemp,\nprovided over $5 million in the budget.\nI've seen it in the budget.\n$5 million in the budget is recommended for the DOE\nto provide a free universal strainer.\nThe free strainer is not guaranteed to be available\nuntil August 1, 24 by the DOE.\nAnd it's not tested.\nAdditionally, this strainer of being developed\nhas not been evaluated for effectiveness.\nI have taught in the Senate, we've got Senator Tillery's on the Council, Senator Dixon's\non the Council, Senate Estimates on the Council, Senate Sims is on the Council myself, and\nI've taught all these senators on this before I drop this amendment.\nAnd they believe that the state should invest in a known commodity, a cleaner that has\nbeen analyzed for effectiveness, and one that is on the state contract winds up being\ncheaper. We've got to announce on it that the\nstringers that the deal center of analyze is actually\ncould be very much cheaper than what the deal we\nis having to build. We believe the early estimates of the\ntop five stringers analyze the deal center will produce a\ncontract that is definitely less than a one being\ndeveloped by DRC. You know we always look at other\nstates as y'all we're doing and you know I hate to say\nthat but I shouldn't say that but you all y'all know we\nWe are now looking at how Mississippi did their literacy program.\nMississippi initiated literacy program years ago, we just did it last year.\nBut along with that, we know that North Carolina, a citrus state, thought this way from us,\nuses one screener for all schools to test all children, one screener.\nAnd I think some people have told me Florida does the same thing.\nSo let me tell you a little bit about the memo.\nThe memo is not very long, so it has the definitions or\nincluding the standard deal center and the council leaders.\nBy May 15, 2024, the state board of education shall approve\nthe memorandum of agreement between the council and the Georgia\nDOE for a free universal reading streamer, for use by public\nschools and local school system, and part of their comprehensive\nliteracy programs, which meet the criteria of House Bill 538, by June 1, 24, now keep\nin mind some people kind of got kind of freaky on this, but we're talking about\nscreeners that have already been developed and tested. So by June 1, 24, the DOE\nshall publish on his public website, the Free Universal Reading Screener,\nprovided by the Georgia Department of Education, that each public school and\nand local schools system shall adopt the Ministry in order to comply with the requirements\nearlier this year.\nPlease remember that I said one universal screener for all the schools and then if schools\nwant to use another screener they can do that.\nBut it's one universal screener for all the schools.\nIn also the council in collaboration, collaboration, collaboration, the council in collaboration\nwith the Deal Center, the Office of Planning and Budget,\nshall identify a universal reading streamer\nthat meets the criteria established by the State Board\nof Education as provided by the Georgia\nEarly Leadership.\nThe Council, and that's the Georgia Council\nliteracy shall enter into a Memorandum Agreement\nwith a DOE to make such universal reading streamer available\nfor each free of charge to public schools\nand local schools system.\nSo in this bill, it's got a provision, it's an amendment\nthat the stringer that would be recommended\nwill be a collaboration with the Deal Center,\nOPB and the Georgia Council of Literacy.\nAnd this amendment would be effective\nupon the Governor's signature.\nSo I'm gonna now turn it over to Mr. Scott Johnson,\nwho is our chairman of our Georgia Council of Literacy.\nThank you, Senator Hickman.\nAnd thank you, Senator Dexon,\nfor Senate Bill 464, which an important part of that says,\nwe're gonna support our teachers.\nAnd the dollars they spend to support their classroom,\nwe're not expected to for them to suck it up out of their own pocket,\nbut the state is gonna support them for that.\nAnd thank you for that.\nWe should do nothing less as Georgians and supporting teachers.\nWhen I had the honor of chairing the State Board of Education,\nI opened my meetings by saying two things.\nOne, teachers are my heroes, and I mean that.\nAnd none of us would be doing what we're doing today\nif it weren't for great teachers in our lives.\nBut also said one more thing, it's all about the kids.\nIt's all about the students.\nThat's why we're doing, that's why teachers\nare in the classrooms.\nThat's why you're gathered here today.\nAnd that's why last year, the General Assembly passed\nto Bill, Senate Bill 211, and House Bill 538,\nthe Georgia Early Literacy Act, that ensure\nthat we're not going to keep doing what we've been doing\non literacy because we haven't changed\nour trajectory in a decade.\nSo I have the honor of chairing the Georgia Council\non literacy with 30, a total of 30 outstanding people\non that council and a whole lot more folks giving input\nto the work that we do.\nNow, when it comes to House Bill 46,\nme the Senate Bill 464 and the amendment that addresses the screeners, here's why I think\nis important.\nOne, it doesn't supplant local control because districts can still use other screeners.\nIf you want to use multiple screeners, that's fine.\nIf a district has a contractor, wants to create a contract, they can continue to do that.\nBut it would provide one free screener statewide for portability, for comparison.\nSo we'll know.\nSo the General Assembly can know if what they gave us the Georgians the ball to do is being\neffective.\nThat's very important.\nIt's our tax dollars.\nAnd secondly, it's for informing parents.\nParents need to know where their child is.\nYou know, it's no longer, we've all heard the stories about,\nyou know, Johnny or Jane is not reading on,\nit's not reading like they should be,\nbut don't worry, we think they'll pick it up.\nWe get data to inform those decisions.\nThat's what we need, and that's what we will have.\nSo, let me, so, and another important part of it\nis the fact that this free screener would be available\nto every district in the state,\nand would be uniformly used throughout the state.\nSo if a child is in one district this year\nand another district next year,\nwe can compare those results.\nWe can compare progress.\nAnd that's important information for parents to be aware of.\nAnd that free screener that would be determined, now under this amendment, by the Georgia Council\non Literacy in conjunction with a deal center on literacy on early learning and OPB would\nbe formative, it would address dyslexia and literacy.\nwould be universally applicable.\nWe need that.\nAnd let me tell you a story about,\njust before I walked up here,\na testing director for a school district in Georgia.\nCall me and said,\nScott, we're worried because we got a train folks on,\nif there's a new, if there's a screener\nwe're required to use or if it's available,\nAnd we need to be able to train our people.\nWe need to be able to do that.\nAnd I said, if this amendment passes, and we're able to see this, then we're not going\nto wait until August, because there, you know, another option appears to be, or the plan\ncurrently appears to be, we're going to, we're going to do this from what we're told.\nWe'll deliver the free screener in August.\nAnd it's not tested.\nnot try it, we don't know what the psychometrics of this test is. That's not a good decision\nwhen you've got other options. We have other options. We have screeners that are deliverable,\nimmediately. They have been through psychometric testing. They have existed so they've been\nperfected and Georgia can provide those at a cost. I believe even less than the $5.2 million\nthat is allotted for them. We need to make good decisions. We need to support our teachers\nwith an early delivery of that so they can be trained and support our districts. I'm\nabout supporting our teachers and our districts. I am about, but I'm not about bureaucrats making\ndecisions that aren't in the best interest of our teachers and our districts and our citizens.\nAnd I'm serious about the fact that we need to, we need to pass this amendment as part\nof this bill.\nI support it, and I hope you will too.\nThank you, and Senator, it's yours.\nWell, I thank y'all for understanding our passion, and I thank y'all for understanding\nour concern, and we appreciate y'all being here, and we will end the press conference.\nThank you.\nYou\n",
  "updated_at": "2026-02-12T19:23:26.46746+00:00"
}