{
  "video_id": "HQz6prr9aFg",
  "url": "https://www.youtube.com/watch?v=HQz6prr9aFg",
  "title": "House AM Meeting for Day 40 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 128,
  "summary": "Here is a summary of the Georgia House AM Meeting for Day 40 of the 2025 Session:\n\n**Overview**\nThe session featured a prayer by the chaplain emphasizing the challenges and burdens faced by the legislators during the 40-day legislative session, drawing parallels to biblical figures like Noah, Moses, and Jesus. The chaplain offered words of encouragement and an invitation to find rest and peace amidst the demands of the job.\n\n**Key Actions**\n* **HB 567**: Passed\n* **HB 582**: Passed\n* **HB 197**: Referred\n* **HR 328**: Passed\n* **HR 7**: Passed\n* **SB 218**: Passed\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\nThe chaplain's prayer provided a reflective and inspirational start to the legislative day, touching on the personal and professional challenges faced by the representatives.\n\n**Votes**\n* **HB 567, HB 582, HR 328, HR 7, SB 218**: Passed with votes\n* **HB 197**: Referred with no explicit vote mentioned\n\n**Attendance**\nThe speaker noted that all members were present and instructed them to vote to signify their presence.\n\n**Adjournment**\nThe session was held on the final, 40th day of the legislative session. The next session date was not provided.",
  "transcript": "Well good morning. Friday morning last day of the work week. Unless it extends in the Saturday. I'm not sure about that. All members, all members, all members please come to the floor. All members. Very good. Well good morning members, big calls. We're all good morning members because a good Friday, I think it's day 40 last I checked, which I've been looking for this one for a day or two. Because we know that the hour for competing having arrived, all members will please take their seats. Mr. Clerk, will you ring the bell? Well, good morning again. We're going to have the morning roll call. Morning roll call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? All members voted. If so, Mr. Clerk, will you lock the machines? Well, good Friday morning again. Doorkeepers, will you please close the doors and keep them closed? As is our custom here in the house, we will begin our day with Scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Good morning, I have the great honor and distinction to bring you our chaplain of the day. He's my pastor, Jay Williams. Jay is accompanied by some very important people in his life. And they're sitting right here, right down to my right. One of his daughters, he has two daughters. One of them is paging today and y'all will see Annabelle. She's a beautiful young lady. She'll be here. No, there she is right there. I'm sorry. She joined the sunflower, Annabelle. I hadn't seen you this morning. But the other light of his life is sitting with Miss Dale, as a young lady named Lily Grace. Two other important ladies are with him. One of them assures that his life goes pretty smoothly. And that's his mother-in-law. Molly Scott. Thank you, Molly, for being here. But his dear wife and one of the leaders in our church is his wife, Mindy. A health care professional who takes care of many folks up at Scroving County Health Systems in Sylvania, but also as a caretaker of many folks, slides spiritually and physically in our church, down at Misba, down in the Clio community down in Northern F and Him County. Let me tell you about our pastor today. He actually grew up with Chairman Matt Hatchett. He turned out pretty good in spite of that. But he and Matt were pretty close neighbors down in Dublin when they grew up. I'll tell you a lot about Jay from the standpoint of his service over the years. And in the South Georgia Conference, and now with us at Misba, he served with distinction, he served with passion, and compassion to his flock. He's been a teacher in the public school system, but he's been a leader in God's house his entire life. Like many of us, he's had a time or two getting started, and he had to get the right direction, but he's accomplished that, and he's made a difference in his own life and his family's life, and in many, many other people's lives. My family, that have attended this 159-year-old church. No, I haven't been there all 159 years. Thank you very much, Al. But he's made a difference in our church. He's grown our church. He brings God's Word, and that's what it's all about. So without further ado, my pastor, Pastor Jay Williams, that's our chapter of the day. Jay? Thank you. And the distinguished representatives of this beautiful state of Georgia. I want to begin by telling you, thank you so much. It's an immense honor to be before you today in this place, and at this time. I also want to express a deep gratitude for all that you do here. I can't even begin to fathom what you've juggle to serve our state, or your personal sacrifices that you give to be here. Jay, understand the basics of the legislative process, but the entirety of the experience, the weight of it, it's astounding to consider. You serve the great state of Georgia in your district, and all matters, as it applies to state and government. Now, I know what that really means is you have thousands of people telling you what they want you to do, and you can't please them all. You also live in a fishbowl. You live in the under the scrutiny of the press, your peers, and the truth of the matter is, is none of us are perfect. You face acceptance, rejection, and conflicting ideas every day, and you shoulder all that while still managing the business of this state. And on top of that, you have the complexity of your own lives, your own internal struggles, your own family lives. It's a greater undertaking than anyone can understand at just a casual glance that being said, it's important to have a 40-day session, and more importantly, it's important to have an ending day of a 40-day session. So just like that, I want to tell you this, it's important because this is an all-consuming job. And if you didn't have a 40-day session, there's no telling where we may end up. I will just like here, the number 40 is significant. There are many 40-day periods that are mentioned in Scripture. There are usually periods of trial, testing, and preparation. Let's look at some of them. Know about the grace of God endured the flood for 40 days. Moses was on the mountain top, receiving the law for 40 days. And Jesus was in the desert, tempted by Satan for 40 days. And Jesus was after his resurrection, and after his crucifixion, death, and resurrection, he walked the earth and before sending into heaven, he walked the earth for 40 days. I'm sure some of you can relate. Some of you like Noah having endured a flood of challenges over the past 40 days. Although it's not quite over, the dove is up. Some of you like Moses have been on the mountain top, and you've received your legislation, and the people didn't quite respond the way you wanted them to. Some of you feel like you've literally been in the desert with the same guy that Jesus was. I pray that you pass the test, and that you didn't give into his trap. And some of you are simply waiting for the end of day 40, so you can go to that little place of heaven called home. This is what I want to say to you today on this final day, that there's hope in this session, and there's hope in the signy die. There's hope in the end, and they ended the 40, and they're adjourning. There's hope in the remainder of this day, and the possibilities that it holds, and there's hope in the promise rest in its end. I can't begin to understand the weariness that comes from your schedule. The pressures de pleas the masses, and the looming thread of being replaced if you don't. And then there's the necessity of staying true to what you know as right in the process. It's in this complex context that our state brings its problems to you. While you have protocols to address these problems, what about the ones that are too big for even this house? The ones that are beyond your reach with implications that are far too heavy to bear, yet the decisions still have to be made. And what of your own burdens, the ones that are too heavy to carry alone? An old hymn comes to mind. There is a place of quiet rest, near to the heart of God. Scripture says it like this, Jesus said, Come to me all you who are weak and are heavy laden, and I will give you rest. Forty is the number of days in this session, but forties also a metaphor for life. It's a time of trial and testing and preparation. There's a promise for those that will respond to Christ's offer. We don't have to face it alone. There's one greater in whom we can rest. The promise is that if we walk with Him, we can have internal rest during the session. And at the end of it, we can have ultimate rest in our own personal, signy die. As we move through today and toward the close of this session, I say, Thank you so much for the work that you've done and the work that you're still doing. I invite you to find peace in knowing that you're not alone in this journey. Whether you carry the burdens of this state or your own personal burdens, there's an invitation to pause. An invitation to respond to Jesus is called a rest and someone that is trustworthy, someone that is greater than us, someone that is greater than our circumstances, to rest in the one who holds it all together and let Him direct and care you throughout this day. Again, I thank you for all that you do and all that you endure for this state. I pray that as you find rest in the nearness of God that you do so in this final session, I also pray that you do it in your lives out beyond this session. I pray that you're blessed in the journey, most immediately in the journey of this session, but more importantly, as you prepare for your ultimate and final home going. There's hope in the session and hope in the signy die. Thank you so much for the opportunity to speak here today and thank you for the chance to share the truth of God's Word and for the privilege of proclaiming the hope that's found in the name of Jesus. I pray that you rest in it in the rest of this session and also in the signy die. Let's pray. Father, as I stand before these people in my heart, it's heavy. Father, they have worked so hard. They have done their best, Father God, to please their constituents, Father, and to do what's right. And Father God, I know it's a huge job. I pray today that as they go through this marathon day, Lord, that you're in the middle of it. And Father God, that you anoint them to walk in peace and love with one another, and Father, I pray that you will be done. Father God, I thank you so much for the fact that you put them in the place that they're in today. Father, use them for your glory. Father God, and for the betterment of this state. Father God, thank you for their leadership. I pray you bless them in Jesus' name. Amen. Please join me in the pledge of leading. I pledge allegiance to the flag of the United States of America, and to the Republic for which stands one nation that God has been visible, who liberty and justice for all. Excellent. Well, folks, I was a little concerned there, the preacher in Boach, signy, die several times. I'm glad you didn't have the papers ready to go. We'd have been out of here. Jay, thank you, and family, Mendy, and family. Thank you for being here. It's a four-hour drive up here, so we appreciate you all making this commitment. Doorkeeper, you may unlock the doors. Members, you may join Brother Jay in that south any room in his family, and thank him for his service. Till that's here today. Thank you. Thank you. Thank you. Both Lord be 36. niż members we have two doctors of the day our first one is will serve us from nine until 2 p.m. today and that is Dr. Kisha Collins Collins and that's Dr. Collins was invited by Representative Tanger Haring. Thank you Representative Haring from two o'clock till adjournment will be Dr. John Gleason. Dr. Gleason has been here before he's invited by chair lady Debra Silcox thank them for their service to us they're down in the eight station if you need them. Chairman Hilton the chair of the committee on impression audits has recognized chairman Hilton. Thank you mr. Speaker last day best day let's make it a good one appreciate the opportunity to be your chair on information on its we have reviewed the journal it was a long one mr. Speaker but we've reverted reviewed the journal the previous legislative day and we found every word to be correct. Well I can tell it's been a long a couple days of some bags under your eyes thanks for doing your job. Chairman Hilton reports and every word is correct. The chairman of the committee on impression audits reports that this journal of the previous legislative day has been read and found to be correct is there objection dispense with the reading of the journal. I certainly hope not. Reading the journal is dispensed with this any objection to the confirmation of the journal. Here in the journalist confirmed. Mr. Clerk will you read the resolution establishing the order of business for the day. Representative Strachan the 104th moves following me establishes the order of business and her first part of the period unanimous consent. Introduction of bills and resolutions first reading and reference of House bills and resolutions second reading of bills and resolutions reports of standing committees. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day. Here in none the resolution is adopted. First reading the bill and resolutions, Mr. Clerk will you read. House will late 97. I will allow the 50th. You believe the 141st part of the 176th miller the 62nd fry the 120 second and others. Bill B. Todd will act to amend chapter 4, title 49. The fifth go to Georgia and Tate relating to public assistance. Public and community health. House bill 898 by representative Iowa the 50th. You believe the 141st part of the 176th miller the 62nd fry the 120 second and others. Bill B. Todd will act to amend chapter 4, title 49 and fifth go to Georgia and Tate relating to public assistance. Public and community health. House bill 899 by representative Jenkins the 136th bonner the 73rd. Lever to the 123rd and camp the 135th. Bill B. Todd will act to amend chapter 17 to title 44 and the physical to Georgia and Tate relating to transfer on death deeds. Judiciary. House bill 900 by representative Carson the 46 and C. Vol. 34. Bill B. Todd will act to amend Code section 47 2364. The physical to Georgia and Tate relating to transfer funds from the employee retirement system of Georgia. Retirement. House bill 901 by representative carparker the 93rd mentally 88 Davis the 87th the scope field the 63rd. Bill B. Todd will act to amend part 111 chapter 2, title 21 of the physical to Georgia and Tate relating to general provisions regarding preparation foreign and conduct and primaries and elections. Governmental affairs. House bill 902 by representative Jones the 25th parent of the 24th Williams 148. Nuck most is 78th and Kelly the 16th. Bill B. Todd an act to amend title 33 the physical to Georgia and Tate relating to insurance. Injurance House bill 903 by reps and a pile of 33rd work highs of the 157th target the second Jasper to the 11th and a McDonald's third of the 26th. Bill B. Todd an act to amend article on chapter 13 to title 50 the physical to Georgia and Tate relating the general provisions regarding administrative procedure. The governmental affairs. House bill 904 by reps and a silcox the 53rd and Cooper the 45th. Bill B. Todd an act to amend code section 31 647 of the physical to Georgia and Tate relating the exceptions from the certificate of need program. House bill 905 by reps and a Richardson of the 125th gone through the 8th lever to the 123rd. Abstration to the 104th. Perch at the 176th and others. Bill B. Todd an act to amend code section 47 23 64. The official go to Georgia and Tate relating the transfer funds from the employees retirement system of George. Retirement. House bill 906 by reps and I'm Smith of the 41st to build the title an act to amend article 3 chapter 8 and title 31. The official go to Georgia and Tate relating the long term care on the Baudsman program. Human relations and aging. House 907 by reps and a Jones of the 47th burns of the 159th Duke Nick of the 29th and the 14th. House bill 908 by reps and a Smith of the 41st to build the title an act to amend the 12th and the 13th. House bill 908 by reps and a Smith of the 41st to build the title an act to amend some part 2 part 1 of article 16 and chapter 2 a title 20. The official go to Georgia and Tate relating the compulsory attendance. Education. House bill 909 by reps and a general 85th Scott of the 76th Davis the 87th scope field of 63rd and a member of the 98th. The bill be taught an act to amend titles 12 25 and 33 of the fish go to Georgia and Tate relating the conservation and natural resources. Public safety and homeland security. House bill 910 by reps and a patchy to the 150th of the bill be taught an act to amend title 50 the fish go to Georgia and Tate and relating the state government. Higher education. House bill 911 by reps and a coming to the 39th bill be taught an act to amend chapter 5 a title 51 of the fish go to Georgia and Tate relating the libel and slander. Judiciary. House bill 912 by reps and a Wilkerson to the 38th Smith and the 41st card of the 93rd ballad of the 147th Cox the 28th and others. Bill be taught an act to amend part 9 of article 6 chapter 2 titled 20. The fish go to Georgia and Tate relating the grants for educational programs. Education. House 1913 by reps and a plumbing of the 114th go over the 19th hole come of the 101st Reeves the 99th crop for the 89th. Bill be taught an act to amend part one of article 3 chapter 5 a title 50. The fish go to Georgia and Tate relating the general authority duties and procedures. House bill 914 by reps and a lupton of the 83rd Campbell the 35th coming to the 39th and the limit of the 98th. Bill be taught an act to amend chapter 5 a title 34 of the fish go to Georgia and Tate relating the sex discrimination and employment. Industry and labor. House bill 915 by reps and a lupton of the 83rd and the limit of the 98th. Bill be taught an act to amend the 35th and the fish go to Georgia and Tate relating the law enforcement officers and agencies. Public safety and homeland security. House bill 916 by reps and a lupton of the 83rd and the limit of the 98th. Bill be taught an act to amend Article 2 chapter 5 a title 15 and the fish go to Georgia and Tate relating the judicial counsel. Judiciary. House bill 917 by reps and a jones the 25th and hilton the 48th. Bill be taught an act to amend chapter 2 a title 20. The fish go to Georgia and Tate relating the elementary and secondary education. Education. House bill 918 by reps and a hilton of the 48th and jones the 25th. Bill be taught an act to amend Part 13 of Article 6 a chapter 2 a title 20. The fish go to Georgia and Tate relating the organization of schools and systems. Education. House bill 919 by reps and a p tree the 166th and built me taught an act to amend chapter 6 a a title 12. The fish go to Georgia and Tate relating outdoor stewardship. Game vision parks. House bill 920 by reps and a robber's the 52nd park of the 107 Jones the 143rd after the 130th miles the 126th and others. Bill be taught an act to amend chapter 8 to tile 35 the fish go to Georgia and Tate relating the employment and training of peace officers. Public safety and homeland security. House bill 921 by reps and a park of the 107th between the 61st very 56th. Howard the 129th, Harry the 145th and others. Bill be taught an act to amend Article 2 a title 20. The fish go to Georgia and Tate relating the state board of education. House resolution 905 by resident of Canada 58th. Willis the 55th base more than 69th. Jackson the 68th and Queen the 61st and others. Resolution urging the Department of Education. Education House resolution 947 by reps and a jaspers the 11th. Resolution creating the House study committee and five point marvastation permit issuance. Transportation House resolution 948 by reps and a steveens the 165th. Cali the 16th hawk was the 27th. Buck during the 137th of the 127th. Resolution creating the House study committee and pharmacy bench. Menace. Hilt. That completes first readers. The second reading the bill and resolutions occurred. Will read House bill 883 by reps and jaspers of the 11th. The bill relating to electric vehicle charging stations. House bill 884 by reps and a candidate of the 58th. The 63rd here leads 111st. The bill relating to the Department of Public Health. House bill 885 by reps and a candidate of the 58th. The 63rd park and 107th. The bill relating to the Department of Public Health. House bill 886 by reps and a 57th. More than 69th. The 62nd. The 63rd. The bill relating to general provisions regarding state government. House bill 887 by reps and steveens of the 164th. The bill relating to electric vehicle contractors. Conditioned air contractors. Leveled to contractors. Utility contractors and residential and commercial contractors. General. House bill 888 by reps and carpenter of the 4th. The bill relating to education. House bill 889 by reps and steveens of the 42nd. Park and 107th. The 177th. Barrier. The 56th. The 110th. The bill relating to general provisions regarding law enforcement officers and agencies. House bill 890 by reps and carpenter of the 46th. Martin of the 49th. Blackburn of the 146. The bill relating to exemptions from sales and use taxes. House bill 891 by reps and volumes of the 148th. Hatchet of the 155th. Carson of the 46th. Mix of the 178th. Roads of the 124th and others. The bill relating to general to the Georgia state employees. Pension and savings plan. House bill 892 by reps and a welcome of the 101st. Buckner of the 137th. Miller of the 62nd. Evans of the 57th. Barrier of the 424th. A bill relating to massage therapy practice. House bill 893 by reps and a welcome of the 48th. Jones of the 47th. Pallard of the 147th.\n\nThe rise of the 139th of the 29th, the bill relating to education, House Bill 894, by represent the home of the 101st Black, 146, a bill relating to procedure for sentencing and imposition of punishment. House Bill 895, by represent the density of the 150th, the bill relating to the Georgia Legislative Retirement System. House Resolution 882, by represent hatchet of the 150th, or one of the 32nd. The resolution provides a amendment to the Constitution, so it's provided that local school systems can be collected sales and use tax for maintenance operation expenses. House Resolution 883, by represent Stevens of the 164th Gamble of the 15th, see well the 34th Park of the 100th St, the 180th and others. A resolution creating the House Study Committee on making Georgia the number one state for tourism. House Resolution 884, by represent, gains of 120th chaspers of the 11th, Hilton of the 48th, Green of the 154th, Dempsey of the 13th. A resolution urging increased state autonomy to allow for the creation of animated solutions to work disincentive and reform the essential safety network programs. Through second readers. Reports of standing committees, Mr. Clerk, will you read? The House is a full submit to the Founding Report, but speak to your committee on rules. As I've done under its consideration, following resolution of the House, it's a start to meet reports say back to the House following recommendations. House Resolution 885, due pass, respectfully submitted. The House reps that have parished the 158th District Chairman that completes the reading of the reports of standing committees. The House will come to order. The House will come to order. As we complete our 40 days, House will come to order. As we complete our 40 days, a lady that I've invited to come spend a few minutes with us. The second organizer is our new Labor Commissioner, Barbara Rivera-Homes, who's taken on their responsibility and supported our state and supported all the folks in our state. The House will come to order. The House will come to order. The House will come to order. I'm looking forward to working with you. I just want to express my gratitude to our speaker, to the Governor, to Mrs. Kenpin, to all my officers for their support. We're very excited about this role. I'm proud to serve our state alongside you and we'll look forward to your support today, tomorrow, and 26, so that we can continue doing the work for our hardworking Georgians. Thank you. Thank you so much. The Commission, we look forward to working with you. The House has always supported and been proud to be a part of what you do at Labor and a great job for you. Thanks for taking it all. Thank you. Thank you. Members, we'll move on to morning orders. Members, we're ready to move on to morning orders. Members, we'll please take your seats out and if you can't take a seat, we have a very special morning order. I'm going to ask the members if you'll take about a minute for your morning order this morning, we're going to give some more time to the first morning order, Representative Carter. It's going to be recognized, not yet. I'll ask the folks that are handing out the passing out the budget right now if you'll just pause for just a minute. Members, I need your attention and your respect for this morning order. All members cease conversation. Representative, we're ready to move on to morning orders. April 4, 1968. The lady was a spend just for a moment. The lady was a spend just for a moment. Thank you. We're going to announce the assassination of Dr. Martin Luther King Jr. We want to remember him and if we would take a moment, we have a video that we would like to share with you and then acknowledge some guests. We want you to know the night that we as a people will get to the promised land. So I'm happy tonight, I'm not worried about anything. I'm not fearing any man. My eyes have seen the glory of the coming of the Lord. We know that will be his last speech. We want to share with you and we have some guests in the audience that joined us today for this memorial. We would stand and be recognized. Thank you. We're going to be recognized. We're going to be recognized. We're going to be recognized. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you, Mr. Speaker. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you. Thank you. Chairman Tyler Paul Smith and at least one friend. Thank you, Mr. Speaker. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you, Mr. Speaker. Thank you, Mr. Speaker. This morning, colleagues, I want to come to the well to recognize the Spalman College Glee Club. I want to thank the Spalman College Glee Club. I want to thank the Spalman College Glee Club. I want to thank the Spalman College Glee Club. Thank you. Thank you. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you. Thank you. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker.\n\nThank you so much. And let's do a brief moment of his, a moment of silence, people. Thank you. Thank you, and thank you, Speaker. Thank you, Representative Dexter, Sharper. To the family, I will continue to know that this is our prayers or with you. Sorry for your loss. And hopefully that this house stands behind that legislation. Hopefully it gets across that finish line. But we'll keep working. Thank you all. Take care. Representative Chaz Cannon has recognized for a morning order. Give the gentleman your attention, please. Thank you, Mr. Speaker. Thank you, Mr. Speaker. I just want to quickly recognize my two girls and I'm all lovely alive just back from spring break. I just turned 15 and 14 last week. So happy birthday to you all. I'm going to see you. Wait to be home with you next week. Love you. You're a lucky man. General will suspend just for a minute. Representative Martinez, if you'll step back just for a moment. Members, I think you're going to like this one. You've had several great morning orders honoring some offering condolences. So I want to ask all of you to give your attention to Representative Martinez. As he acknowledges a very special guest. Now some people are going to join you in the well. Representative Martinez. Who would they be? Veterans and some for the happiness. Veterans and friends. Representative Martinez has recognized for a special morning order. Thank you, Mr. Speaker. It is with distinct pleasure. And he is here amongst us up in the gallery. Wait, Mr. Davis. Distinguished pleasure to recognize James L. Davis, who was born March 31, 1923. This past Monday, Mr. Speaker and colleagues, he turned 102 years old. Woo! Woo! Woo! Woo! Hey, hey, that's one talking about... 102. Not only that, colleagues, I'm Mr. Speaker, Mr. Davis served in the US Army as a World War II veteran. They lently and courageously protecting fellow Americans during World War II. Receiving numerous awards for outstanding service and retiring in the rank of sergeant. During the civil rights movement, James L. Davis was broadly recognized for his leadership in bringing fair housing to black residents in St. Louis, and he continues to serve faithfully in the Patriarch of the Church of Family and Community. Again, speaking colleagues, help me congratulate World War II veteran 102 years young, Mr. James L. Davis. Thank you. Thank you. It's been a long time since we've been sitting here for so long. Thank you for being with us, Mr. James. Thank you for your service. Thank you for your longevity and being engaged. It has paid dividends for lots of folks. Thanks for being with us today and congratulations on many more good years as well. Thank you members. Representative Eric Bell and friends is recognized for a morning order. One second while my friends get here. Thank you Mr. Speaker. Colleagues, friends. Y'all know what today is. It is officially 404 day and if you don't know that's the story area code for Atlanta and the Metro Pilots and area. And what you say and it is. So we are honored to be privileged and joined with the group of Atlanteans who are taste makers both in civil rights or education and culture and music. They are here in the gallery. If you would please stand while we briefly say your names and give you the flowers and under we have Charles Black, one of the original signers of the appeal of human rights. Kilo Ali, Pastor Troy, young Jack and before I go home I'll have to get the microphone to my amazing sister that share one of the Atlanta delegation. Very quickly Atlanta is how Atlanta is how old grounds. We recognize each of you today for your contributions to our culture as well as to our environment from every space that you're in. I'd like to recognize Mr. AJ Callaway Howard University man to media mogul environmentalist to thank you for being here. Donna Matthews, thank you for being here with us today. We recognize again our youngest farmer in the country if she still up there will she please stand and wait for her. Nina Packer, my sister, my friend. Thank you. Nina Packer, family ratler. Michelle Willis, Michelle Willis. Where she? There you are my sister. Welcome to 404 Day. We introduce this to the body where we recognize just how special the city of Atlanta truly is. But as we continue to produce excellence worldwide. Thank you Mr. Speaker. We yield the well. Ladies, you to the well. Is that is that really your sister or your sister? Not your baby sister. A different kind of system is to speak. I thought that was your sister. She is a sister. My sister just the same. I yield the well. It works. Additionally, join us in Liberty Plaza for the 404 Day block party celebrating. Signy, diet and all these great people we just said. See you in Liberty Plaza y'all. Gentlemen, it's yielded the well. Good morning order representative. Cannon is recognized for morning. Give the lady your attention, please. Thank you, Mr. Speaker. Good morning, everyone. If you have ever attended an Atlanta Hawks game. I know you were up out your seat on that dancing meter. I know you were having a good time. And that is probably because of Mr. Hanky. He is the in-game producer for the Atlanta Hawks. He also cares a lot about the community and always gives back. We just want to thank you for mentoring young artists. We want to ask you to stand and ask you to continue doing the work that you are doing in this competitive music industry here in Georgia. We honor you and we celebrate you today. Thank you, Mr. Speaker. Congratulations. Thank you, Ripon and Cannon. Thank you. Cool experience going to the Hawks game by men. So it's thanks for what you do. It's a great experience. Thanks for what you're doing in the community as well. Thank you. Thank you. Members, we're going to take up some agrees. And maybe even some disagrees. Representative Bruce Williamson has recognized for a motion. Thank you, Mr. Speaker. I move that the House accept the Senate substitute to House Bill 586. Mr. Clerk, will you read the caption? House Bill 586 to be tied to a men article 3, chapter 6, title 48. I believe if you go to Georgia and Tady will lay the intangible recording tax, so as to revise the note for which such taxes imposed. Chairman Williamson has recognized to explain this Senate substitute to House Bill 586. Thank you, Mr. Speaker. Colleagues, if you recall House Bill 586, simply let me back up a second. So right now under the current Georgia code, if you borrow money, you're secured by a deed to secure debt for over three years, there's a $3 per thousand recording tax. This bill simply moves that exemption period from three years up to 62 months, which is five years and two months. The happy to answer any questions, if not, Mr. Speaker, I'll yield the will. Jim has no questions. Thank you. All the gentlemen's motion that the House agree to the Senate substitute to House Bill 586, House Bill 586, all those in favor. But yes, those opposed. We'll vote no in, Mr. Clerk, will you unlock the machines? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? All in the gentleman's motion, the yeas are 161, the days are zero, and this House has agreed to the Senate substitute to House Bill 586. Chairman Rees is recognized for motion, gentlemen, excuse me, representative Rees, I'll give you a promotion. Thank you, Speaker Burns. I move to agree to the Senate substitute for House Bill 131. Mr. Clerk, will you read the caption? House 131 to be entitled, act to amend Article 5 of Chapter 4, title 10 of the fiscal to George Anitetti relating to self-service storage facilities. Representative Rees is recognized to explain the Senate substitute to House Bill 131. Thank you, Speaker Burns. House Bill 131 unanimously passed the House. This bill brings the self-storey industry in line with 30 other states. There were some articulate business women who came in and represented the 15 self-storey units. The Senate Committee made a minor amendment pertaining to boats and RVs and campers and vehicles that are sometimes at storage units. That's it. That is the only change. It was grievelled all parties involved. Now it would request your favorable support. You have a couple of questions if you'll take them. I will, Mr. Speaker. My nori leader, Hugh Gleet, to your left out front is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? To the leader I do. Thank you so much. I've got a concern that was sent to me in the true that if three independent bidders attend the sale at the time and place advertised, it's need to be commercially reasonable. Is that still in this bill? It is. The three bidders that was that is longstanding law. The sale cannot be finalized until you have at least three bidders. Also, all of the notice provisions, the due process, to the delinquent customer, those are not changed whatsoever in this bill. This bill merely adjusts the advertisement procedures to bring in line with 30 other states. And what is the advertisement requirement if you don't mind? To commercially reasonable so you can run a newspaper ad, you can run online, you can do social media, you can do advertising through placing signs out there for regular sales. So there are a variety of ways it's done, but they've got to get at least three bidders for the sales. Mr. Speaker, if there are. Mr. Speaker, if there are. Rimsley Park, Kenon. Mr. Rick and I have a little question. All right. Thank you, Mr. Speaker. Do you yield? To the representative I do. Thank you. What impact does this have on urban business owners? It has a positive impact on urban business owners as well as the customers of self-storage, because this outdated procedure that Georgia has on the ads, if you have a delinquency in a unit, it delays filling that unit up to a paying customer. And also if you think about the customers of self-storage, you have senior citizens, people who have gone through to divorce, students, other people who are on the move, and this red tape that we've got in this area that 30 other states have improved on, that will save money if we change it to bring it into national standards. It's good for consumers. Thank you. Rimsley, if you have Lisa Campbell's recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? To the representative I do. Thank you. I just wanted to clarify, it looks like one other change to me online, 116, that the notice of advertisement actually has been reduced to once versus once for two weeks. Correct. Absolutely. And that is something to clarify for boats, RVs, vehicles, things like that that you've got to give notice for. There still is a newspaper ad required one time. Thank you. Thank you. Gentlemen, has there further questions? Are you the well? Jim was you the well. On the gentleman's motion, the House agreed to the Senate's substitute, the House Bill 131. All those in favor will vote yes. All those opposed will vote no, and the clerk will unlock the machines. Mr. Speaker, I request to be excused from this vote according to rule 133. The gentleman has that right and the gentleman will so reflect, have all members voted, all members voted if so, Mr. Clerk, where you lock the machine. All the gentleman's motion, the yeas are 163, the nays 1, the House has agreed to the Senate's substitute, the House Bill 131. Representative Rob Leveritt is recognized for a motion. Chairman Leveritt. Thank you, Mr. Speaker. I was hoping to have the cheat sheet up there on the screen, but I believe what I'm doing is moving to a greater the Senate's substitute, the House Bill 36. Mr. Clerk, will you read a caption, House Bill 36, correct? House Bill 36 to be entitled, an act of entitled 29 of the Fisher go to George Antony, related to guardian and ward, so as to revise the list of providers who are authorized to participate in the processes for appointment of a guardian for an adult. We're representative Leveritt has recognized to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen, this is the bill that would add a number of professions to the list of those that can provide an evaluation in a guardianship or a conservatorship proceeding. You remember there was a lot of drama on the floor as the representative Evans-I had an interesting exchange on this bill. I believe House Media Service is going to set that video to doling banjos to make a good soundtrack with it, but I believe I've addressed all of her concerns. What I have done is added provisions that make it clear that the proposed ward, that is the person who would be the subject of the guardianship or conservatorship, can at any time challenge the qualifications, experience, or manner of the performance of the evaluation during the hearing or at the outset of the proceeding to stop it from going forward. Additionally, for the Council on Developmental Disabilities, we added some language that made it clear that developmental disability itself is not a reason for granting a guardianship. And finally, in the Senate they made an amendment that removed marriage and family therapists from the list of those who can do the evaluation, so that profession is no longer included in the bill. We believe this is essential legislation. We really want to get it passed this year so that the backlogs in these cases can be addressed, and the appropriate judges can find qualified people who perform these evaluations, so I'd ask for your favorable consideration in the bill. Gentlemen, you, yes, Representative Evans, Stacey Evans, so your left is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, I do. Isn't it true that I really appreciate you working with me and us being able to work through some changes to make this bill better? I would hope that's the case because that's certainly how I feel. I appreciate your engaging on it with me. Thank you. Will you yield for one more? Yes ma'am. Isn't it also true that throughout this process, I think we've both learned, or at least I have learned, that our probate judges need a lot more support from us and help, and I look forward to working in the off season to try to help their job be a little bit easier for the citizens of Georgia. The lady knows of what she speaks, and I look forward to that collaboration also. Thank you. Thank you. Representative Park Cannon, thank you. Does lady have a question? Thank you, Mr. Speaker. Do you yield? Yes ma'am. Thank you for this legislation. Would you agree that this does not expand the scope of practice of a nurse practitioner, but it does recognize their expertise? Absolutely. That is precisely correct. Thank you for that question. General Houser for the question. Thank you, Mr. Speaker. Ladies and gentlemen, I ask your favor, support of the motion with the guard to the House Bill 36. On the gentleman's motion, that House agree to the Senate's substitute to House Bill 36, all those in favorable vote? Yes, those opposed? We vote no. And Mr. Clerk, will you unlock the machines? All the gentlemen's motion, the yeas are 165, the nays are two. This House has agreed to the Senate's substitute to House Bill 36. Representative Leverd has recognized for motion. Hello again, Mr. Speaker. I'll move that the House agree to the Senate's substitute to House Bill 37. Mr. Clerk, will you read the caption? Yes. House Bill 37 to be entitled, and act to amend subpar 2, part 6 of Article 6 of Chapter 2, titled 20, the physical to Georgia, and to relate to conditions of employment in elementary and secondary education. Chairman Leverd has recognized to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen, this was the bill from last year that we try to get this year that simply requires school districts to provide notice to employees concerning whether self-security is being withheld. Because as you may recall from the initial discussion, school districts are not required to participate. Some of them do, some of them don't. There's different practice across the state. We're trying to make sure that our school district employees aren't met with any unpleasant surprises upon retirement. Over in the Senate, they did make one change. They added a provision concerning that is not mandatory. It just authorizes school districts who are providing insurance to their board members that they can also provide family coverage to those board members, you know, under whatever terms, requiring the family to pay in or the board member to pay also. It's not mandatory. It's simply permissive, and it's intended to provide statutory authorization for a practice that's already in existence. So we're fine without amendment. I will ask you to support the motion. Gentlemen, answer your question. Gentlemen, has a question or two represented to Barry of the center aisle just to your left. Gentlemen, recognize. Thank you. Does the gentleman, thank you for speaking to the gentleman you? Yes, sir. Is this done anywhere else in the country? It's kind of beer credit, got burden of reporting every five years that they're anywhere else in this country, or is this just the first nation trying to be injured? I'm sorry. I cannot understand the question. Was this, is this kind of law done anywhere else in this country, or is this just a Georgia-specific issue? I'm not aware that other states have the original law that was in the original bill. This was, I guess, this is our innovation. Okay. Thank you. We're up to the board now. To your left is also a recognizable question. Ladies recognized. Thank you, Mr. Speaker. That's gentleman you. Yes, ma'am. Now, when would they have to let the employees know? Well, the bill is, tries to be fairly specific. Upon hiring, they have to be notified whether the school district is going to be withholding. If they do not, they have to notify the employee of some other available plans that would provide, you know, sort of a replacement, if you will, for security, additional retirement plans. Then they've got to give them notice periodically through employment every five years. And then at termination, they have to say whether they withhold or not. Thank you. So we're hoping they'll get the message of this one. Gentlemen, you for one more historical question. Gentlemen, was there when they created Social Security to your left. Representative Williams has recognized for a question. Thank you, Mr. Speaker. And I appreciate you letting me in the door when I got there. Appreciate it. Well, the gentleman yielded. Yes, sir. Is it not true, then? Over the last 20 or 30 years, though there was some initial resistance, minimum tide teachers are very glad that they signed up for Social Security because those that didn't left a lot of money on the table. I'm sure that's the case. Thank you for the question. Gentlemen, has there further question? And that gentleman knows of what he speaks to just ask that question, for sure. I want a serious note. Yes. Mr. Speaker, I just asked the body's fate. Will consideration all yield the well? Gentlemen, is yielded the well. All the gentleman's motion that the House agreed to the Senate's substitute to House Bill 37. All those in favor will vote yes. Those opposed will vote no, and Mr. Clerk, will you unlock the machines? Have all members voted? All members voted if so. Mr. Clerk, will you lock the machines? All the gentleman's motion, the yeas are 163, the nays are zero. This bill, Henry, and the House has agreed to the Senate's substitute to House Bill 37. Representative Fleming has recognized for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate's substitute to House Bill 150. Mr. Clerk, will you read the caption? House Bill 150 to be entitled to amend part two of Article 2, Chapter 3, Title 20, the official code of George Ants and Arlaying the University System. So, sir.\n\nOur report quarterly reports regarding certain funding received from individuals or entities related to China. Representative Flamie is recognized to explain the amendment. Thank you Mr. Speaker. As y'all recall House members, HP 150 deals with funding that comes from foreign countries of concern to our higher education institutions. Requires institutions to report to this body, the Senate and the governor, what those funds are and where they come from. In the Senate, they changed the reporting dates from quarterly to twice a year to align with other reporting that the USG system schools have and set the cap at $1,000 for any contribution of $1,000 be reported and explain for what those dollars are for. This to remind y'all this does not pertain to any tuition from individuals from these countries is just other funding. And with that Mr. Speaker, I have you taking questions or I'll yield the will. Gentlemen's has a couple questions for you. You'll yield. Yes. We'll park right in front of it to your left. It's recognized for a question. Thank you Mr. Speaker. Does gentleman yield? Yes sir. Is it not true that I am concerned about the Senate amendment that reduces the amount from 50,000 to 1,000 precisely because in committee we were talking about the burden this would put on our USG, TCSG institutions in which case due to this amendment I would encourage all members to vote no. Is that not true? I know you're concerned. Yes sir. Thank you. Gentlemen, you will rip the remind up to Senator Al to your on the left. Just a quick last request. Thank you Mr. Speaker. Is it a gentleman yield? Yes sir. Is it you know one thing that we have been discussing about this bill is my concern that when we keep our focus so narrow we might actually miss the force for the trees. In this particular instance by only focusing on a few countries we actually don't have an idea of where any other foreign investments might be coming from and that my hope is that bills like this would be more broad to actually deal with the issue at hand here. Yes, lady not to discuss that. Thank you. Mr. Speaker, I'll yield the will. The Rep. Jasmine Clark was recognized for a question already had her button pushed if you don't mind. Yes sir. Ladies recognize. Thank you Mr. Speaker. Is it gentleman yield? Yes ma'am. I guess to add on to the question asked by my colleague with Park what was the Senate's reasoning for decreasing the cap from 50,000 which we thought was reasonable because it would not be as burdensome to our USG systems to the 1,000 which could probably trigger a lot of work administrative work for someone in USG. Or if you recall my original bill that was in committee we didn't have any cap on it. It was zero cap so it had been any any figure coming from any funding coming would be happy reported. I'm not so sure what they're reasoning for but my original bill had had no cap on it. Thank you. Jim has no further questions. Thank you Mr. Speaker. I ask for your favorable consideration for Hp 150. Thank you. Thank you for your explanation. On the gentleman's motion that House agree to the Senate substitute to House bill 1,000, 150, all those in favor will vote yes. Those opposed will vote no. Mr. Clerk, will you unlock the machines? All members voted. All members voted if so. Mr. Clerk, will you lock the machine? On the gentleman's motion the yeas are 98 the nays are 64 and the House has agreed to the Senate substitute to House bill 150. Chairman Todd Jones has recognized for a motion. Mr. Speaker, I move that the House agree to the Senate amendment of House bill 156. Mr. Clerk, will you read the caption? House bill 156 to be entitled to amend Chapter 1 Title 6 of the Fishercoded George annotated relating the general provisions relative to aviation so as to provide the Department of Transportation with authority over bird reports. Chairman Jones has recognized to explain the Senate amendment to House bill 156. The gentleman's recognized. Thank you Mr. Speaker. Members, this is a simple amendment that the Senate add on to the on 156, 156 voted out 162 to 7. The Senate as amended voted out 53 to 0. The base bill effectively put bird reports into the code. The amendment allows for the local tax development authority to be able to expand the use of that tax into air service product expansion basically looking for a second airline into the Brunswick Airport. That is the amendment Mr. Speaker and I'll stand for any questions. Chairman has no questions. Thank you, sir. I yield the will. All in the general's motion that the House agree to the Senate amendment to House bill 156. All those in favor will vote yes. Those opposed will vote no. And Mr. Clerk, will you unlock the machines? All members voted. All members voted if so. Mr. Clerk, will you lock the machines? All the gentleman's motion. The yeas are a 159. The nays are three and the House has agreed to the Senate amendment to House bill 156. Representative Wade is recognized for a motion. Thank you Mr. Speaker. I make a motion that we agree to the Senate substitute to House bill 105. Mr. Clerk, will you read the caption? House bill 105 to be entitled back to amend code section 45978. The district will the Georgia antenna relating to payment of indemnification for death or disability. The representative Wade is recognized to explain his agreement to the Senate substitute. House bill 105, the general's recognized. Thank you Mr. Speaker. Ladies and gentlemen, this is Governor Kimps, one of his priority legislation, the indemnification fund where we increase teachers from the 75,150. The Senate wanted to ensure that we had new language that essentially will direct the state board of workers' compensation that each law enforcement agency of the state to notify an injured peace officer of the Georgia State Indignification Fund so that we had those two agencies communicating. That's the Senate amendment. The Governor's an agreement until my ask for your favorable consideration. Gentlemen, has no questions. Thank you. Gentlemen, as you will to the will, on the general's motion, the House agreed to the Senate substitute. House bill 105, all those in favorable vote yes. Those opposed will vote no. Mr. Clerk, will you unlock the machines? no. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. Have all members voted? What purpose of representative panic tries? Oh, they pressed the wrong button. One, two. They're sitting on your button, I guess, because your lights lit up. Unless your neighbors did that to you. That happens on day 40. Have all members now voted? If so, Mr. Clerk, will you like the machines? The only gentleman's motion, the A's, or 164, the Nays, or zero? And the House has agreed to the Senate's substitute to House Bill 105. Chairman, Tower Paul Smith has recognized for a motion. Thank you, Mr. Speaker. I'll move this House agree to the Senate's substitute to House Bill 179. Mr. Clerk, will you read the caption? House Bill 179, to be titled back to event article 2, Chapter 6, Title 5 of the Fish Go To George Anitetti Related to Impellic Practice, so it's the revised for the digital recording of certain trial proceedings. Christine Smith, will you explain the Senate's substitute to House Bill 179? Certainly, Mr. Speaker. Ladies and gentlemen of this August, I bring to you this substitute. The only change that was made was to remove the language that would have allowed for digital takedown of depositions. That's it. So, Mr. Speaker, if there are no questions, I'll yield and ask the test House agreed to the Senate's substitute. Gentlemen, has no questions. Thank you. Gentlemen, yield to the will. On the gentleman's motion, the House agreed to the Senate's substitute to House Bill 179. All those in favor, will vote yes. Those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted if so. Mr. Clerk, will you unlock the machines? On the gentleman's motion, the yeas are 167, the nays are zero, and the House has agreed to the Senate's substitute to House Bill 179. Chairman Hawkins has recognized for a motion. Mr. Speaker, I'd like to ask for HB197 agreed to the Senate's substitute. Mr. Clerk, will you read the caption? House 197 to be entitled to men code section 33, 46, 6. The official go to Georgia, Antietta, Relay New Requirements for Certification, Utilization of Nationally Recognize accreditation standards. Chairman Hawkins has recognized to explain the Senate's substitute to House Bill 197. Thanks, sir. You know, 197 passed Senate Committee, House Committee, the House floor, Senate Committee, and Senate floor unanimously in all four bodies. The Senate has added, and that was a pair to pair, the Senate has added a prior approval, which also increases access and decreases delayed a health care. That passed the Senate with only one vote against this House floor in its present, in its SB form, with only two votes against, asked for the House to adopt the, in a grade to the Senate's substitute of House Bill 197. Gentlemen, I was a question if you're yielding. I will. Rep. Jasmine Clark to your left is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Thank you, Mr. Chair. My question is on section two since that was added, and I don't know if it, if we actually got to vote for that on that House floor, can you kind of just expound what exactly does the prior authorization language do in this? Would you repeat the question? I couldn't quite hear you. Yes. In section two, you said that the Senate voted it out, but I don't know if you said that we voted on section two of this bill in the House. Yes, we did. That was Senate Bill five, Senator Kruppathric's bill, and it passes House floor with one descending vote. Okay. Thank you very much. Two descending votes, excuse me, two. Thank you very much. Thank you. The House will have no further questions. You have no further questions. You can yield well. He's yielding well. It's a good thing on day 40. On the gentleman's motion, the House agreed to the Senate substitute to House bill 197. All those in favor of vote? Yes, those opposed? We'll vote no, Mr. Clerk. Will you unlock the machines? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? On the gentleman's motion, the A's are 162, the Nays are zero, and the House has agreed to the Senate substitute to House bill 197. Will Representative Hong recognize for a motion? Representative Hong. Thank you, Mr. Speaker. I move that this House agreed to the Senate amendment to House bill 217. Mr. Clerk, will you read a caption? House bill 217 to be entitled back to amend Article 60, Chapter 4, Title 20, the Efficient Go to Georgia and Attended, relating the dual achievement program. Will Representative Hong recognize to speak to the Senate amendment to House bill 217? Thank you, Mr. Speaker. The Senate amendment adds two different provisions. One has to do with immediate family members serving on local boards, and there's a specific date when it comes to current enrollment for waiver of that. We're essentially deleting that and making sure that the current count is the current count. The second provision has to do with the promise scholarship accounts and allowing the Education Savings Authority to gather information directly from the Department of Revenue when it comes to the relevant income threshold. I ask for your favorable consideration. I agree. Ladies, no questions. Thank you. I hear the well. Ladies, you're the well. On the ladies' motion, that the House agreed to the Senate amendment to House bill 217. All those in favor will vote, yes, those opposed. We'll vote no. And Mr. Clerk, will you unlock the machines? No. Have all members voted? All members voted. Take your time. All members now voted. If so, Mr. Clerk, will you lock the machines? On the ladies' motion, the A's are 143. The A's are 22. And this House has agreed to the Senate amendment to House bill 217. Who are representative Cliff, who is recognized for a motion? Representative Rob Clippen. Thank you, Mr. Speaker. My motion is to agree to the Senate amendment for HV308. Mr. Clerk, will you read the caption? House bill 308 to be entitled to amend Title 40. The Fish and Co. to Georgia Antony relating motor vehicles and traffic. So, as a review for the operation of miniature on-road vehicles on certain highways. Representative Cliff, who is recognized to explain the Senate amendment. Jim was recognized. Thank you, Mr. Speaker. Ladies and gentlemen, we're back with the mini-truck bill. The Senate, and it's all of its wisdom, decided to add a few pieces to this bill. The first is current law states that if you are caught road racing or, I believe they called it, doing donuts, reckless driving. Law currently allows your vehicle to be impounded permanently or crushed. This amendment, however, allows the judge's discretion to add a governor device to your car that limits you to only 20% over the current speed limit. The other amendment in here is a representative's amendment from our bill earlier that allows it for when people are pulled over for speeding, for a de-escalation aspect of the law to not have to sign the ticket. They will put on their refusal to sign, and that is the general of the amendment. The gentleman has a couple of questions if you are yielded. Yes, sir. I will yield for one question. Chairman Parsons was first to your left. Is the gentleman asked for a question. Thanks, Speaker. Is the gentleman yielded? Yes, sir. I would just like to ask, I think he said to one of the changes they made to the Senate, was they had a provision that a driver could add a go-der device to his car. Is that correct? The judge's discretion instead of having their car impounded permanently or again crushed and destroyed, they can have a governor added to it so that they can get their car back but will be limited to the speed that they can drive. Would you further yield? Yes, sir. I'm just curious, is it true? How available or what kind of process do you have to go through to get a governor? I've never looked for one, but are they readily available? Are they very expensive? I'm not aware, but I do believe that anything would be better than having your car lost forever. If the cost of the product is more expensive than the car itself, you're more than welcome to decline and have your car taken away from you. But this is just another option in order for people to keep their car instead of having it taken away. I would just...is it true? It just seemed like before we vote on something, we should know what kind of expensive it would add to somebody in case that they did have to or if it made some kind of a problem for a family or whatever. There's not just the individual or his individual family, but his parents and grandparents have to pay for these things. It's not true. Thank you. Yes, sir. Jim, will you yield one more question? I think I can get the answer to that question. Yes, sir. I'll probably yield one more question. Will the representative, Jason Ridley, have some experience here limiting his speed. I think he might know how much it costs. Jim, would you recognize for a question? Is Jim when you yield? Yes, sir. Is it not true that the device is a new device that just came out almost kind of like the one that they do on a DUI where you do a breathalyzer. But what this right here does is it's attached your car and it's a couple hundred dollars a month that most and what that does is the judge could make you make you have it on there for three to six months and then you can be able to keep your car and be able to get back to the port to work. Absolutely. Again, this is an alternative instead of having your car gone forever and never having it back. This is alternative to being able to keep your car and drive a limit speed limit. Thank you. Thank you, sir. With that, Mr. Figuerole, you'll do well. Jim, and you'll do the well. On the general's motion, the House agreed to the Senate of Amendment to House Bill 3.8. All those in favor will vote yes. I suppose no, Mr. Clerk, will you unlock the machines? Have all members voted for what purpose is represented knee or rise? Probably, I'm sure. It's not true that it is a pleasure to partner with the author on this bill to add the Travis signature bill that passed out of this house unanimously, not too long ago. I want to agree with the lady. I didn't hear everything she said, but I do agree with her about 99% of the time. So I'm sure the lady knows of what she speaks. Have all members now voted? All members voted. If so, Mr. Clerk, will you lock the machines? On the general's motion, the yeas are 104. The maize are 60, and the House has agreed to the Senate of Amendment to House Bill 308. The chair of the House is voted. The chair of the House is voted. The chair of the House is voted. Thank you, Mr. Speaker. I move that the House agreed to the Senate substitute to HB 567. Mr. Clerk, will you read the caption? House Bill 567 to be entitled to amend Article 2, Chapter 11, Title 43, the Fish Go To Georgia, and it's related to licenses for the practice of dentistry. The representative's density is recognized to explain the substitute. The only change that was made in this was made in committee and made by the House, actually, to a small amendment to support the work of the Department of Public Health, the work that they are doing in safety net locations today. This is the bill to authorize and regulate the practice of teledentistry by Georgia, licensed, dentist, and hygienist through the Board of Dentistry. It passed the House 175 to 2. So I ask that you agree to this as written. The lady has no questions. Thank you, Mr. Speaker. I yield the well. On the lady's motion, the House agreed to the Senate substitute to HB 567. All those in favourable vote? Yes, those opposed. We all vote no, Mr. Clerk, will you unlock the machines? I have all members voted. All members voted this side. Have all members voted this side, Mr. Clerk, will you lock the machine? On the lady's motion, the yeas are 165, the nays are two, and the House has agreed to the Senate substitute to HB 567. The representative Gunther is recognized for a motion. Chairman Gunther. Thank you, Mr. Speaker. I move the House agreed to the Senate substitute to HB 582. Mr. Clerk, will you read the caption? House Bill 582 to be entitled back to event title 1617 and 24 of the fiscal day of the Georgia and attended relating to crimes and offenses, criminal procedure and evidence. Chairman Gunther is recognized to explain the Senate substitute to HB 582. Thank you, Mr. Speaker. This is the bill that gives defendants who are victims of abuse, the opportunity to present that evidence in defense of the crimes that they are charged with. We worked with the prosecutors and made changes that satisfied them. And then the Senate added House Bill 384, which passed out of here, I think unanimously, which was defining the violation of oath for police officers to only felonies and misdemeanors of high and aggravated nature. Stand for any questions. Chairman, have some questions. Okay. No questions? No questions. No questions. You do a great job. On the gentleman's motion, that the House agreed to the Senate substitute to HB 582. All those in favor will vote. Yes, those opposed will vote. No, Mr. Clerk, will you unlock the machine? All members voted. All members voted this suit. Mr. Clerk, will you lock the machine? On the gentleman's motion, the yeas are 164, the nays are zero, and the House has agreed to the Senate substitute to House Bill 582. Chairman, Jasper's has recognized for a motion. Thank you, Mr. Speaker. I'd like to make a motion to agree to the Senate substitute to HR7 as amended by the House. Mr. Clerk, will you read the caption? House resolution number seven, or resolution honoring the life of Mr. George, a C. True Lock Jr. in dedicating a road in his memory. Chairman, Jasper's has recognized to explain the Senate substitute and the amendment as amended by the House. Okay, thank you, Mr. Speaker. If you look on your desk, you'll see an amendment with my name on it, 11. Wednesday, you heard our Chairman, Prince, read off our road, naming Bridge Bill, had 19 on it. It should have had 20. I forgot one. HR 328, by representatives of Bernal. And I apologize, and I'm asking you to amend HR7 by adding her language into that bill. HR 328 honors chief Jeffrey E. Turner, by naming a portion of I-75 in Clayton County in his honor. Thank you, Mr. Speaker. I hope you'll vote with me to fix my mistake. We all do it, Mr. Chairman, every then, then. You don't do it very often, but. No, tell Mr. Jasper's. I understood. Jim was yielded the will. He had no questions. Is there any objection to adoption of the House amendment? Hearing none, the House amendment is adopted. On the gentleman's motion, the House agreed to the Senate substitute to House Resolution 7 as amended by the House. All those in favor will vote yes, all those opposed. We'll vote no, in the clerk where you unlock the machines. Have all members voted? All members voted if so, Mr. Clerk. Will you lock the machine? On the gentleman's motion, the A's are 166, the Nasers 0 and the House agreed to the Senate substitute to House Resolution 7 as amended by the House.\n\nRift these sands is recognized for a motion. Representative Sains. Thank you, Mr. Speaker. A motion to agree to the Senate amendment to the House amendment to the Senate's substitute of House Bill 266. Mr. Clerk. House Bill 266 to be entitled to amend Article 2, Chapter 7 of the Title 48. The fiscal year goes to Georgia and it's going to be in the impositionary computation exemptions and credits for state income tax. Rift these sands is recognized to explain the Senate amendment. Thank you, Mr. Speaker. Nothing is changing with the first section of the bill, which this House and many members have worked on to virtually fully eliminate veteran income tax in this state. But there's one number change online, 92 of this bill. It deals with the police foundations that we've also added to this bill. It just modifies 75% of total tax liability for that credit to eliminate 50% and back to 75%. That is the only change in the bill, Mr. Speaker, and I'll yield. The gentleman has no questions either, so he can yield. On the gentleman's motion, did the House agree to the Senate amendment to the House amendment to the Senate's substitute to House Bill 266 as he explained? All those in favor will vote yes. Those opposed will vote no in the clerk will unlock the machines. All members voted for what purpose is the chairman press rise? Make a motion. Mr. Big axe, excuse me when the vote reference House will 133. The gentleman has that right and the journal will so reflect for what purpose is represented black men rise elementary degree. Stay tuned, Quarry. Mr. Speaker, isn't it true that we actually raise this in more than double what exempts our military retirees on their retirement income? That's how I read it. Thank you, Mr. Chairman. I appreciate the work of the committee and of the representative and of this House to honor and take care of our retirees. So now all members voted. Mr. Chairman, if so, Mr. Clerk, were you locked the machines? On the gentleman's motion, the A's are 167, the nasor zero, and the House has agreed to the Senate amendment to the House amendment to the Senate substitute to House Bill 266. Thank you, members. For what purpose is the chairman gullet rise? Make a motion. State your motion. Move the re-commit Senate Bill 218 to rules. Mr. Clerk, were you read the caption? Senate Bill 218 by Senator Robertson, the 29th to be titled, Natto amend, title 15, the fifth to go to Georgia, and Tate related to court. So as to provide the prosecuting attorneys, qualifications commissions shall be assigned for administrative purposes only to the administrative office of the courts. On the gentleman's motion, the SB218 be recommended to the rules committee, his or her objection, hearing none is so ordered. Representative akkor. From and to see. five I'll send you more. Members, we're going to be in the posture of taking a break for lunch. I'd have to represent you more. It makes her announcement. Hey, Corey. Thank you, Mr. Speaker. Colleagues, today would have been my mother and her twin brothers, Birthday. So in honor of that day, I made their favorite cheesecakes. They were twins, male and female. They could never decide on one cheesecake. So I always had to make two. So I made one set for one side and one set for the other. Choose blueberry and caramel. As soon as I can get somebody to help me bring them out the car, they're very heavy. And it's a lot of them. You are good and you're volunteers. And happy birthday to my mother and my uncle. And they're heavenly, peaceful home. Thank you, Representative Moore. It's a great honor to honor someone. They're going to help you. Representative Parrish, Chairman Parrish has recognized for the announcement. Thank you, Mr. Speaker. I'd like to ask the members of the Rooms Committee to meet me in room 341 at 130, room 341 130. Thank you. Members, we have two additional announcements. But if you have a page, if you have a page today, join us down front. After we complete our announcements, when we go into recess, cheerleading camp will recognize for an announcement. Thank you so much, Mr. Speaker. The Intergovernmental Coordination Committee will be meeting upon our lunch adjournment in room 406 in CLAB. We're going to be taking up a substitute on one bill. Thank you. Cheerleading Miller is recognized for an announcement. Thank you, Mr. Speaker. The Georgia House Democratic Caucus will be meeting upon adjournment in CLAB 605 for lunch and a presentation. See you all there. Representative Parrish, Canada has recognized for an announcement. Thank you, Mr. Speaker. On your desk, you'll see that we are having the first annual Sci-Di Block Party today in Liberty Plaza from 1 to 6 p.m. All members are invited. All members can speak on the mic and just welcome guests to the Capitol. So please join us in Liberty Plaza any time today from 1 to 6 p.m. We do have a lot of different performers. Maybe y'all are familiar with Young Jack or Pastor Shoy or Rich Kids, but they will be performing. Thank you so much. See you there. Chairman Williamson, recognize for an announcement. Thank you, Mr. Speaker. The majority caucus will have lunch in room 403 immediately on adjournment for the lunch break. Thank you, Mr. Speaker. That completes our announcement. Thank you for your attention this morning. All members, this House will stand in recess until 2 p.m. today. 2 p.m. This House will come back in session 2 p.m. Everyone enjoy the lunch break.",
  "updated_at": "2026-02-13T13:04:35.472336+00:00"
}