{
  "video_id": "HtvskbRTdsk",
  "url": "https://youtu.be/HtvskbRTdsk",
  "title": "Georgia House - Day 38 (2026-03-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-03-25",
  "duration_minutes": 163,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 38 (2026-03-25) session:\n\n**Overview**\nThis session focused on the introduction of several new bills, including legislation related to various topics such as the criminal justice system, sales and use taxes, professional licensing, and transportation. While no major legislation was passed, the proceedings included a prayer by a guest chaplain and routine parliamentary procedures.\n\n**Key Actions**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- **HB 809**: Relating to the criminal justice system\n- **HB 810**: Relating to sales and use taxes\n- **HB 811**: Relating to professional licensing\n- **HB 812**: Relating to zoning procedures\n- **HB 813**: Relating to mass transportation\n- **HB 814**: Relating to zoning procedures\n- **HB 815**: Relating to annexation\n- **HB 816**: Relating to the Department of Community Affairs\n- **HB 817**: Relating to eligibility determinations\n- **HB 818**: Relating to various topics\n\n**Notable Moments**\n- Opening prayer delivered by Pastor David Brunson\n- Remarks by Rep. Chuck Eftration introducing Pastor Brunson\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, as all members reported to their assigned seats and voted to signify their presence.\n\n**Adjournment**\nThe session adjourned, with the next session date unspecified.",
  "transcript": "They are of convening having arrived. All members of the House will please report to their assigned seats. All members of this House will please report to their assigned seats. The clerk will ring the bell. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. All members voted. All members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning. We will begin our day with scripture reading and prayer this morning by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 104th House District Representative, our Chairman Chuck Eftration. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I have the great privilege of introducing today a respected pastor in my district and great friend of mine, Pastor David Brunson. Pastor Brunson is the founder and senior pastor of Trinity Life Church in Decule, Georgia. And he served in that role since 2002. Pastor Brunson takes his praise and worship in scripture reading very seriously and he begins every day with a morning Bible reading. We're also very honored to have here with us today Pastor Brunson's wife, Tara Brunson, who's here at the Capitol and is watching this proceedings right now. And I'd ask that we please recognize her at this time. Pastor Brunson has said that his ministry conviction comes from 1 Corinthians 9-16, for though I preach the gospel, I have nothing to glory of, for necessity is laid upon me. Yay, woe is unto me if I do not preach the gospel. If you would, well, it's my great honor to, at this time, recognize Pastor David Brunson. Good morning. First I want to thank Speaker Beloved Rauston for this invitation. And then I came to encourage you all with this thought, the legacy of great leaders. Salman was considered the wisest earthly king that ever lived, and Proverbs 13-22 looking at the common English Bible that says, good people leave an inheritance for their grandchildren. Good people leave families and leave legacies behind. All of you are leaders and families and certainly great leaders of our state. And so I'd like to acknowledge your outstanding leadership. Salman understood the importance of leaving a legacy to future generations. And I'd like to say to you that your work impacts lives of Georgians now and into the future. Great leaders are three things to me. They're consistent, they're caring, and they're hopeful. You're great because you exhibit a pattern of exceptional leadership. As you deliberate on behalf of your consistency, be consistent concerning the health of this great state. As you legislate, seek to do the right thing with passion. Govern fearlessly with transparency and honesty. Great leaders are great because they genuinely care. They care about the citizens they represent. You serve the people today and the future of the people of our tomorrows. Your work is not easy and many may not understand the waitingness you carry. But for the health of our collective futures, continue to care. And then finally, in this short devotion, great leaders remain hopeful. In the face of adversity, remain hopeful. Our state, our nation, and our world experience the horrors of an unforeseen pandemic. Unfortunately, there are no crystal balls that we can use to predict what's going to happen in our future. No one knows what holds tomorrow except our God. But great leaders fear God above all else. And so remain dependent on the God that blessed America as he continues to bless this great state of Georgia. I'd like to ask you to stand with me as we go into a word of prayer. Lord, we give you thanks for the gift of life and opportunities to serving capacities that impact our world. Thank you for the legislators of this great state. We pray that you shower them with wisdom and courage as they serve and represent their constituents. And God, we ask that you may always protect them and their families. Amen. May we recite the pledge of allegiance together, our pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. The papers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous Legislative Day and found it to be correct. And furthermore, Mr. Speaker, four things you can't get back. A stone after it's thrown, a word after it's said, the occasion after it's missed, the time after it's gone. Thank you. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous Legislative Day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. Clark will read the resolution establishing the order of business for the day. Mr. Burns, on the 59th, the following will be established as the order of business to earn the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read House bill 8.0.9. I'm over. The 87th scott of the 76th, the 50th and 91st, the 60th bill of the entitlement code section 1632. The official go to Georgia and it's a really in the conditional discharge. Judiciary non-civil. House bill 8.10 by reps of buckner, the 137th, the 64th, the 73rd and the 40th. The scoffield of the 60th and others, bill of the entitlement chapter 8, the total 48th, the official go to Georgia and it's a really in sales and use. Ways and means. House bill 8.11 by reps of Cooper, the 43rd, bill of the entitlement, the total 43th, the official go to Georgia and it's a really in the professions and businesses. Helt in human services. House bill 8.12 by reps of the limit, the 99th, the 50th, the 6th, the Lopez, the 86th, bill of the entitlement, the 6th and total 36th, the official go to Georgia and it's a really in the zoning procedure. House bill 8.13 by reps of the limit, the 99th, the 56th, the Lopez, the 86th, bill of the entitlement, the article 19, the chapter 19, the total 32, the official go to Georgia and it's a really in the general provisions or all of the mass transportation. Transportation. House bill 8.14 by reps of the limit, the 99th, the 56th, the 86th, bill of the entitlement, chapter 66 and the total 36, the official go to Georgia and it's a really in the zoning procedures. Go to mental affairs. House bill 8.15 by reps of the limit, the 99th, the 20th, the 21st, the bill of the entitlement, the actual three chapter 36 and the total 36, the official go to Georgia and it's a really in the annexation. Go to mental affairs. House bill 8.16 by reps of the limit, the 99th, the 76th, park of the 101st, the 86th and the 56th, the bill of the entitlement, chapter 8, the total 50, the official go to Georgia and it's a really in the department of community affairs. Judiciary. House bill 8.17 by reps of the limit, the 99th and the 56th and the 86th, the bill of the entitlement, code section 34, 8, 192, the official go to Georgia and it's a really in the initial determination and a re determination of eligibility. Industry and labor. House bill 8.18 by reps of the limit, the 99th, the 76th, park of the 101st, the 86th, the bill of the entitlement, chapter 7, the total 44, the official go to Georgia and it's a really in the landlord and tenant. Judiciary. House bill 8.19 by reps of the limit, the 99th, the 56th, the bill of the entitlement, the 7th, the 14th and the total 44, the official go to Georgia and it's a really in the foreclosure. Judiciary. House bill 8.20 by reps of the Mitchell, the 106th, the bill of the entitlement, part 7, the total 7 of the chapter 3, the total 20, the official go to Georgia and it's a really in the hope scholarships and grants. Higher education. House bill 8.21 by reps of the baller with 163rd, the eighth, the 73rd, gains the 117th, the 74th and more the 95th, the bill of the entitlement, the 3rd chapter 7, the total 48, the official go to Georgia and it's a really in the tax returns and furnishing of infertile. Raising means House of Resolution 452 by reps of Cooper, the 43rd, a resolution urging the Georgia Department of Public Health to take action to increase child and adolescents immunization rate. Health and human services that completes first readers. Second reading of bills and resolutions, the clerk will read. House bill 782 by reps of Mallow the 163rd, Stevens of the 164th, Hitchens of the 161st, Petrie of the 166th, the bill to amend and act creating the Chatham area Transit Authority, House bill 783 by reps of Stevens of the 164th, Mallow the 163rd, to authorize the governing authority of the city of Savannah, Chalevi and X-size tax, House bill 784 by reps of a corn of the 51st, the 90th, the 97th, the 57th, the 101st, the 95th and others, the bill relating to Brady Law Regulations, House bill 785 by reps of the 50th, the 56th, the rent of the 96th, Lopez of the 86th, the rent of the 99th, Thomas of the 65th, the bill relating to elections and primaries, House bill 786 by reps of the 56th, the bill relating to elections of primaries, House bill 787 by rep. of the 89th Park of the 101st, the 99th, Lopez of the 86, Marin of the 96, a bill relating to emergency communications authority. House bill 788, by reps of Park of the 101st, the 89th, the bill relating to Brady Law regulations. House bill 789, by reps of the 99th, the win of the 89th, Park of the 101st, Lopez of the 86, and Marin of the 96, a bill relating to employment and training of peace officers. House bill 805, by reps of Carpenter of the 4th and Clark of the 147th, the bill relating to alcoholic beverages. House bill 806, by reps of Paris of the 142nd, Thomas of the 39th, Davis of the 87th canon of the 58th, Mitchell of the 88th, the bill relating to health. House bill 807, by reps of Cooper of the 43rd, by real relating to medical and other confidential information. House bill 808, by reps of Scofield of the 60th, Scott of the 76th. Now, the 77th Davis of the 87th, McLeod of the 105th, the bill relating to labor and industrial relations. House resolution 427, by reps of Airheart of the 36th, the 6th, howell of the 32nd, Barton of the 5th, Melton of the 112th and others, a resolution creating the House Study Committee on Public Funding, Transparency and Membership of the State Bar of Georgia. House resolution 428, by reps of the 117th, we dour the 119th, Dempsey of the 13th, Jones of the 25th, Maynard of the 56th, a resolution creating a House Study Committee on mental health and substance use disorder. House resolution 429, by reps of Maynard of the 56th, howell of the 111th, Thomas of the 65th, Bowdie of the 62nd, Lem of the 99th. Resolution recognizing the presence of historically black colleges and universities, and dedicating a bridge in their honor. House resolution 430, by reps of Scott of the 76th, Scofield of the 60th, Davis of the 87th, for now the 77th, McLeod of the 105th, the resolution urging the governor to remove the commission of labor for neglect and derelicts in a duty. Senate bill 285, by Senator Jones of the 10th, the bill to amend an act creating the Henry County Water Authority. Senate bill 297, by Senator Miller of the 49th, the hatchet of the 50th, the bill to amend an act to providing a method of compensation for members of the Board of Education of Hall County. Senate bill 298, the Senator Miller of the 49th, the hatchet of the 50th, the bill to amend an act creating the Board of Commissioners for Hall County. Through second readers. Reports of standing committees, the clerk will read. Representative Matt Dubnick of the 29th District Chairman of the Committee on Education submitted the following report. But speak to your committee on education, Senator consideration, the following bill of the Senate. Just struck me to report same back to the House with the following recommendation, Senate bill 153, due passed by substitute respectfully submitted. Representative Matt Dubnick of the 29th District Chairman. Representative Barry Fleming, the 121st District Chairman on the Special Committee on Election Integrity submitted the following report. But speak to your special committee on election integrity, is that in consideration following resolution of the House. And this is struck to me to report same back to the following recommendations, House of Resolution 98, due passed by committee substitute respectfully submitted. Representative Barry Fleming, the 121st District Chairman. I would say, a rough, a chuck, Martin of the 49th District Chairman of the Committee on Higher Education submitted the following report. And speak to your committee on higher education, is that in consideration the following bills of the Senate. Just struck to me to report back to the House with the following recommendations. Senate bill 81, due passed, the Senate bill 204, due passed by substitute respectfully submitted. Representative Chuck Austration. Chuck Martin of the 49th District Chairman. Representative Petrie, the 166th District Chairman on Committee on Human Relations and Aging submitted the following report. To speak to your committee on human relations and aging, is that in consideration following bills of the Senate. Just struck to me to report the same back to the House with the following recommendations. Senate bill 215, due passed by committee substitute respectfully submitted. Representative Petrie, the 166th District Chairman. Representative Jan Tancersley, the 160th District Chairman on Committee on Intergovernmental Coordination Locals submitted the following report. To speak to your committee on intergovernmental coordination local. Has that in consideration following bills of the House and the Senate. Just struck to me to report the same back to the House with the following recommendations. House bill 709, due passed, House bill 744, due passed by substitute. House bill 762, due passed by substitute. House bill 8712, due pass, House bill 778, due passed, House bill 7692, due passed. House bill 794, due pass, House bill 79 felony passed, House bill 796, due passed. House bill 799, due pass. House bill 800, due pass, House bill 801, due passed, House bill 802, due pass, House bill 803, due pass, House bill 804, due pass. Senate Bill 294, due passed by House substitute, House bill 797, due passed. Respectfully submitted, Representative Jan Tancersley, the 160th district chairman. Representative John Corber to the 174th district chairman of Committee on Motor Vehicles submitted the following report. And speaking of Committee on Motor Vehicles, the saddened consideration of following Bill of the Senate in the district committee reports saying back to the House of the following recommendation. Senate Bill 115, due passed by Committee substitute, respectfully submitted, Representative John Corber to the 174th district chairman. Representative Rick Jasper, the 11th district chairman of Committee on Transportation submitted the following report. And speaking of Committee on Transportation, a saddened consideration of following resolutions of the Senate. And just to talk to me to report saying back to the House following recommendations. Senate Resolution 39, due passed by Committee substitute, Senate Resolution 102, due passed by Committee substitute. Respectfully submitted, Representative Rick Jasper's of the 11th district chairman. That completes the reading of the report to stand in committees. We're going on now to the local calendar. Third reading and passage of uncontested local bills. What purpose does Chairman Martin rise? I'm sorry. What purpose does the Speaker Proteam rise? I'm sorry. What? Here you go. I got it. Make a motion. Make a motion. State your motion. I'd like to move that House Bill 798 be removed from the local calendar and sent back to the committee from which it came intergovernmental coordination. The Lady has moved that House Bill 798 be recommitted to the intergovernmental coordination committee. And I think there was an objection. There is an objection as the Lady moved. I move. Lady moves. The Lady's motion is that House Bill 798 be recommitted, removed from the local calendar and recommitted to the intergovernmental coordination committee. All those in favor of her motion will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Stacy Evans rise? Parliamentary inquiry. State your inquiry. Isn't it true that House Bill 798 meets all the requirements for a local bill to be passed in this chamber? I'm not sure, but I'm sure if the Lady's so states that she believes that to be true. What purpose does the Speaker Proteam rise? Is it not true that members of the Parliamentary inquiry? Yes, or parliamentary inquiry? State your inquiry. Is it not true that members of the Fulton County delegation were never informed of this local legislation that triples the salary of the County Commission chair and doubles the salary of the other County Commissioners an action that they can do for themselves and wouldn't take effect until they run again for election. I'm sure the Lady believes that to be true. All right, one final parliamentary inquiry. What purpose does Representative Stacy Evans rise? Parliamentary inquiry. Is it not true that this bill was in fact shared with all members of the Fulton County delegation per our local rules and isn't it further true? That less than three legislative days ago, this body voted unanimously to raise the pay of the County Commissioners of Coutus County in a way that would be that would make them more than triple, I believe, but also Fulton County were to raise their pay for its commissioners at the same scale that we did for the Coutus County Commissioners. The Fulton County Commissioners would chairman would be making $250,000 a year. This bill simply asks that he makes $130,000 a year, which would put him on par with other Metro County County populations of the size of Fulton County, isn't it true? So, ladies and inquiry addresses itself to the judgment of each and every member. Have all members of this House voted? Have all members of the House voted? If so, the clerk will lock the machine on the Lady's Motion. The eyes are 98. The Nays are 65. The Lady's Motion has been adopted. This bill will be removed from the local calendar and recommitted to the committee from which it came. Okay, we're now going on to the local calendar without House Bill 798. One bill on the local calendar relates to home state exemption and requires a recorded two-thirds roll call vote for passage. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. House Bill 709, I represent in the Luriki of the 169th Waycross Judicial Circuit. House Bill 744 by substitute by rep. Nullow, it is the 42nd City of Smirna. House Bill 762 by substitute by rep. Nubainer of the 56th Fulton County. House Bill 771 by rep. Thomas of the 39th City of Allstead. House Bill 778 by rep. Hill of the 3rd City of Ringgold. House Bill 790 by rep. Cameron of the 1st City of Chigamanga. House Bill 791 by rep. Wulkesh in the 38th Cobb County. House Bill 792 by rep. Senate of the 178th Wayne County. House Bill 793 by rep. Senate of the 168th Wayne County. House Bill 794 by rep. Senate of power to the 124th Richmond County. House Bill 795 by rep. Senate of Jackson. The 128th Glasker County. House Bill 796 by rep. Senate of Gaines. The 17th Athens Clark County. House Bill 799 by rep. Senate of the 29th by rep. So the journey of the 85th City of Clarkston. House Bill 800 by rep. So the purple 155th Ben Hill County. House Bill 81 by rep. So the 20th Stevens County. House Bill 802 by rep. So the 20th Stevens County. House Bill 803 by rep. So the Rosson 7th Fanon County. House Bill 804 by rep. So the 33rd City of Hall. Senate bill 294 by house substitute by senator Harold of the 40th City of Sham. The 17th Athens Clark County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative fry rise? Parliamentary and clerk. State your inquiry. Mr. Speaker, isn't it true that in the memory of the clerk of the mayor and commission of Athens Clark County, this is the first time in 40 years that the local delegation has tried to pass a homestead exemption without being requested to? If the gentleman so states, I know he knows his history. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the local calendar without House Bill 798 or 108th and these are 56. These bills having received the requisite constitutional majority are therefore passed. What purpose does the majority caucus will representative Kelly rise? Make a motion. State your motion. Mr. Speaker, I would make a motion that we are served notice for reconsideration on House Bill 797. The gentleman is served notice of his intent to seek reconsideration on House Bill 797. The gentleman is served notice of his intent to seek reconsideration on House Bill 797. The gentleman is served notice of his intent to seek reconsideration on House Bill 797. The chair was in error. That bill needed a constitutional two thirds majority. So it did not pass. But the motion is to reconsider the action by this House and failing to give it the requisite.\n\nConstitutional majority. Okay, since we're now in the last three days of the session, the motion will be taken up at this time. All those in favor of the motion for reconsideration will vote. What purpose does the majority caucus whip rise? I miss Speaker, I knew that we table House bill 797. Yeah, they'll have to be reconsidered. Yes sir. They'll have to be a majority vote to reconsider and then I'll recognize you again for that motion. All right, all those in favor of the gentleman's motion to reconsider this House's action on House bill 797 will vote. I those opposed to reconsideration will vote no and the clerk will unlock the machines. He doesn't have to move. He doesn't have to move to table it. It's basically just. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion at this House reconsider its action. The eyes are 101. The days are 60. This House is reconsidered its action on House bill 797. What purpose does the majority? He waves. That bill will just remain on the local calendar. Okay. We are now through with the local calendar for today. We're going on now to morning orders. Going on to morning orders. Chair will remind the sizeable number of members who have signed up of the 10 minute time limit for morning orders. The Chair recognizes representative Leveret for a morning order. Chair recognizes the dean of this House, Dean Calvin Smiley and Chairman Chuck Martin for a morning order. Mr. Speaker, ladies and gentlemen, I know it won't have about a minute, but I just want to get your attention for a second. We have a resolution that's coming, the chairman and I, along with the speaker and members of the House, honoring Steve Riggley, the Chancellor of the University of Systems of Georgia, who's retiring. And I've known Steve Riggley for a long time and the resolution talks about his helping guide, Zell Miller's efforts to improve the level of education with the hope scholarship. And he served as Chancellor of the University of Systems of Georgia for four years, which time the agency won the exceptional agency award from the State High Education Executive Office of Association for excellent leadership. And whereas the University of Systems of Georgia experienced record enrollment reaching an all-time high of 341,000 students. And it goes on and on talking about the number of degrees offered during this COVID period of 70,800 degrees, the most in the University System history. And I just think we ought to give a round of applause and thank Steve Riggley for his service to the State of Georgia, not only here at the Capitol on the Governor Miller, but also during this time at the University of Georgia and here in the University of Systems of Georgia. So we'll have the resolution this afternoon. So please, if you all would recognize the service that Steve Riggley has given to our State and let him know how much we appreciate this contribution to the State of Georgia. Thank you very much, Steve Riggley. We appreciate you and thank you. And on behalf of this House, congratulations on your retirement. Thank you. Now the chair recognizes Representative Lebritt for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen of the House, it's my distinct pleasure and honor today to stand before you to recognize someone that I believe everybody in this House has admired and respected. And that is Tom McCall. I think everybody who ever knew Tom in this body and he didn't pass away so you don't have to stand. I don't think he would like that. But Tom would appreciate that gesture. I'm sure. And by the way, I think we all know that Tom will absolutely positively hate the fact that I'm doing this. He is going to hate the fact that I've got a privilege resolution that will be approved today in his honor. But I think that I have never known a man, more humble, who had no reason in the world to be humble whatsoever. He is one of the most capable and intelligent and dedicated people I know. And he has made only one who is more dedicated to remembering in this body the people that we represent back home and making sure in everything we do and every piece of legislation we pass that we always would ask how it affects them and their everyday lives. And Tom did that through a relentless scrutiny of every proposed legislation with his uncompromising common sense. I am told, although I was not had the pleasure of serving with him, that if you stood in this well and he stood to ask you a question and began it with the words, you mean to tell me that you didn't feel real good about the chances of your legislation passing. I appreciate so much the opportunity to recognize Tom. I know we don't have a lot of time. I would just like to remember some of his famous, famous wisdom. Don't forget where you came from. Agriculture is on the front of the seal of the Great State of Georgia and the Senate is on the backside of the Capitol. Thank you, Mr. Speaker. I yield the well. I don't know of a more decent or honorable person who ever served in this body than Tom McCall. And I'm still missing. Chair recognizes Chairman Chokus and Chairman Eftration for a morning order. Thank you, Mr. Speaker. Members of the House. I've got to say some things about Greece. With the fall of Constantinople in 1453, Greece ceased to exist as a nation. Massacre and enslaved the Greeks endured 400 years of tyranny and persecution at the hands of the Muslim Ottoman Turks. The oppression was so great that even the Greek language and the Christian faith had to be taught in secret schools throughout what was formerly Greece. Even today, the Christian Greek minority living in Turkey are forced to overcome obstacles put in place by the Turkish government simply to practice their faith. The Greek Orthodox seminary in Halke was closed by the Turks 20 years ago. In a year Sophia, the largest Christian cathedral until Saint Peter's was built in Rome, was turned into a mosque in 2018. So on March 25, 1821 began a revolution against oppression that led to a free and independent Greek nation. Supported by fililines from around the world, such as Lord Byron, Greeks from the villages and towns took up arms and began their war of independence. The Greek revolution was inspired by our very own war of independence. In George Washington, one of our founding fathers is praised in Greece for his bravery. Over the last 200 years, Greece has been a loyal ally to the United States in every major conflict. And even facing overwhelming firepower and manpower, the first victories of the Second World War were achieved by the Greeks against the Axis powers of Hitler and Mussolini. Winston Churchill once said, heroes fight like the Greeks. So today, the ancient land that created Plato, Aristotle, Socrates, and many more great thinkers and philosophers, and the land that gave birth to democracy celebrates the 200th anniversary of its independence. And to my Greek American brethren, chronia pola laida, zito eléferia, which means many more years to Greece, and praises to freedom. Thank you. The chair falls back to this Greek. Oh, because it's... Yeah, I broke it. Yeah, that's the thing. You want all the pieces going? Thank you, George. Mr. Chairman, I thought that a little outburst of Greek there was... You were putting into Greek. I moved that we this house adjourned, signing die. Chair recognizes Chairman Houston for a morning order. Thank you, Mr. Speaker. Today's woman in history that I would like to recognize is Eunice Lassington-Nix-Mixum, also known as Miss Eunice. And if you lived in South Georgia, you have probably heard her name or met her or she talked to you. Miss Eunice was a farmer's wife, a teacher for 30 years, a non-paid political consultant, a community leader, a participant in television programs and movies, and she even made a national TV commercial when she was over 80 years old. Miss Eunice's involvement in politics began in 1974 when she served as Governor George Busby's Tiff County Campaign Chairman. And thereafter, she worked with Governor Joe Frank Harris, Zell Miller, and Roy Barnes. And she was friends with every governor since 1974 until her death on 2018. Miss Eunice served for many years on the State Democratic Party Committee, though if you had to classify Miss Eunice for being with any particular party, she was the South Georgia Party. And she promoted Tiff County and South Georgia every day of her life. Miss Eunice served in over 15 state boards and commissions. They included the Heritage Trust Commission, the Georgia State Elections Board, the Agarama Foundation Board, the Georgia Student Finance Commission that she served on for 23 years, and she also served on the Georgia State Bar Displenary Board. And when she retired from the Georgia State Bar Displenary Board, they did a scholarship in her honor. Miss Eunice served on so many local boards. If I named them all, I would run over at my time. So if you would like to read more about Miss Eunice and her accomplishments, you can go to the University of Georgia, Richard B. Russell Library for political research, and all her papers were archives in Athens. If you have time and you want to read about other great Georgians and politics, go to the Richard Russell Library of political research, and be sure to look up Miss Eunice Smith, some shoes of friend, and love by people in South Georgia. Thank you. Time for morning orders has expired. Those of you who had signed up, if you wish to be put on the list for Monday, then please see the messenger. You can be up by today. What GIRL motion. State your motion. Mr. Baker, I move that Senate Bill 46, Senate Bill 95, and Senate Bill 219 be recommitted to the Committee on Rules. The chairman has moved that Senate Bill's 46 95 and 219 be recommitted to the Rules Committee. Mr. Clark, can you read the caption first to Senate Bill 46? Senate Bill 46. My senator Burke of the 11th Watson, the first hatch of the 50th, me titled an act to amend title 31 of the fiscal to George annotated related health, so it's authorized certain medical personnel to administer vaccines during the public health emergency. On the gentleman's motion, that Senate Bill 46 be recommitted to the Rules Committee, is there objection? Is there objection that Chair here's none and it is so ordered? Mr. Clark, would you read the caption to Senate Bill 95? Senate Bill 95, I send it again to the 47th, beats the 21st albors, the 56th Senate of Barthay, the 31st Capatric, the 32nd to be entitled an act to amend title 50, the fiscal to George annotated related state government, so it's certified conditions for meetings and public hearings to be held by teleconference. On the gentleman's motion, that Senate Bill 95 be recommitted to the Rules Committee, is there objection? Is there objection that Chair here's none and it is so ordered? Mr. Clark, would you read the caption to Senate Bill 219? Senate Bill 219 by Senator Ginn, the 47th albors, the 56th, most of the 53rd parent of the 42nd, we entitled an act to amend title 3, the fiscal to George annotated related alcoholic beverages, so it's a revive for regulation and the manufacturing distribution sales of malt beverages. On the gentleman's motion, that Senate Bill 219 be recommitted to the Rules Committee, is there any objection? Is there objection that Chair here's none and it is so ordered? Those bills are back in the Rules Committee. We're going to be at ease a moment while the clerk's office repairs the damage inflicted on the well by the chairman of Small Business Development Committee. What ho what a What purpose is the chairman's Stevens to make a motion? State your motion. I'd like to move that Senate Resolution 135 and Senate Bill 142 go back to the rules committee. Chairman Stevens has moved the Senate Resolution 135 and Senate Bill 142 be recommitted to the rules committee. Is there objection? Clerk will read the caption. Senate Resolution 135 by Senator Mulles of the 53rd and Cows of the 46th, a resolution proposing a amendment of the Constitution of the State of Georgia to be proposed to provide for a sports betting in this state. Senate Bill 142 by Senator Mulles of the 53rd and 49th Jones of the 22nd to be entitled and act to amend Chapter 27, Title 50, the fiscal to Georgia and it's a really not lottery for education so is to provide for the lottery games of sports wagering in this state. All in the gentleman's motion that Senate Bill 142 and Senate Resolution 135 be recommitted to the rules committee. Is there any objection? Is there objection? The chair here is none and it is so ordered. We're now going on to the rules calendar. Moving on to the rules calendar, the clerk will read the caption to Senate Bill 202. Senate Bill 202 by Senator Burns of the 23rd and 49th to be in the 30th and get into the 47th and the 24th and others being entitled and act to amend Chapter 2, Title 21 of the fiscal to Georgia and Tate of the League and elections and primaries generally so to provide that versus or entities that mail absentee ballot applications. Shall mail such applications only to eligible registered electors who have not only requested. This bill then referred to the special committee on election integrity that committee recommends that this bill do pass by rules committee substitute. Before I recognize Chairman Fleming, I want to make an announcement that there are two rules committee amendments to this bill and before you start saying you don't have it, you don't have it because they're outside the chamber on the tables. So at some point you may want to pick those up the rules committee amendments to Senate Bill 202. There recognizes Chairman Fleming to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I bring to you today Senate Bill 202 which is a combination of measures dealing with elections either already passed by the House or Senate or measures are already considered or passed by the two committees of each House dealing with obviously election matters. This House has already debated and passed the majority of the provisions in the contents of Senate Bill 202 so I will focus during my time on the matters which are new. First of all, I would bring to your attention two provisions in the bill that I refer to as county accountability. The Senate sent over to us two different versions of the ability for our State Board of Elections to have some oversight of necessary of counties who continuously have problems with their elections. And in this legislation in front of you as a combination of those providing basically two types of remedies. The first one is one that was requested by the Association of County Commissioners and that deals with the ability for a review panel to be put together. Election workers from other counties and state election officials to come in and study what may or may not be going wrong in a particular county with a Board of Elections and making recommendations for changes. If that doesn't work, there is another provision in the bill whereby the State Board of Elections after findings and due process and hearings can actually step in and make changes themselves to the problematic county Board of Elections that is at issue. This follows the constitutional path which has been laid out in prior legislation regarding school systems. As many of you know and has been discussed in our committees quite often in Georgia, if there is a school system for example, this about to lose their accreditation. And their kids can't even get into college with the diplomas from that school system. There are provisions in our law where after due process and certain hearings changes can be made to help those school systems get back on track. It is a temporary fix so to speak that ends and the control does turn back over to the locals after the problems are resolved. Another new provision in the bill regards the prominent posting of changes to precincts when there has been an old precinct that has to be closed and a new precinct is open somewhere else. The requirement comes from Senator Merritt's bill in the Senate whereby at the old precinct you have to make a prominent posting to be sure that voters who may come there by mistake know where to go to the new precinct. There is also provisions in this bill which help deal with the problem that so many of us faced and heard from our constituents dealing with multiple absentee ballot applications. In this bill there is a requirement that if you are going to send out an absentee ballot application to a voter you first must do a very common check which is already done by some groups to see is has this voter already voted number one have they already requested an absentee ballot if they have done that you don't send another to them cutting down on the confusion. The bill also makes some changes to the prior house version dealing with drop boxes. Now there is a provision that if there is a pandemic or a emergency type situation you can move those drop boxes outside of the early voting precinct. Also in the bill is an expansion of weekend early voting. There has now always been one Saturday required in law now there will be two Saturdays required in law and there will also be two optional Sundays where the counties can make a choice of that. Also in the bill is an audit power for absentee ballots and absentee ballot applications it will exist for two years after the election. Additionally as a new measure is guidelines for judges who have to take into consideration whether or not they should extend voting hours there has been no guidance in our polls for that power that they have traditionally had. There is guidance in here now is to exactly how they would utilize that. Also in the bill is a provision that allows for a water if necessary to people who are in line to vote within that 150 foot area. Within the 150 foot area outside that area there aren't restrictions generally speaking on your interaction with voters. However this bill puts that in place. There also in the bill is there is an allowance for if you do vote at the wrong precinct within the last two hours of voting you will be allowed if you make a statement that you don't have time to make it back to your precinct that you can vote provisional ballot and it will be counted in the last two hours of voting. Also in the bill is something I commonly refer to as denominator language but this is something in the state of Florida does. The voting precinct will report and the counties will report when the polls close how many people early voted, how many people voted absentee and how many people voted day of so you get a number that the count ultimately works toward. In the bill also is a requirement that once the counties begin counting they not stop until they are finished with their actions. That also will be held by other provisions of the bill which speed up the tabulation.\n\nprocess and get it done faster so we can hopefully be like other states who tend to get their elections in own election night. There is in the ballot for the first time a requirement that if a voter wants to see the scanned images of ballots they can actually do that. They can make a request and they can see those scanned images so if you want to go to the county commission district five in your county and actually look at the votes and count them yourself you would be able to do that going forward. That is a part of a bill that we brought in by Representative Shay Roberts House Bill 659 or a version of that. The speaker did mention there are two amendments to the bill which are will be outside. They are what I would say one is certainly a technical type of amendment. The other one is very close to that. They do two things. The first amendment simply says that in the requirements in the bill for counties to post things on websites that they have to if they don't have a website they simply have to post it in a prominent location. That is the first amendment. There are some small counties in Georgia. ACCG requested this. They still do not have websites that are accessible where they can make changes. This would allow them to post it in a prominent place if they don't have a website. The second one simply requires that the name of the precinct be put on an absentee ballot application of where the voter would be registered to vote. That is already done when you go vote in person. When you get your ballot and look at it it not only has the number of the precinct but the name up there. The absentee ballot simply has the number of this amendment will place the name of the precinct there. As I mentioned those are new sections in the bill since we previously passed legislation of the House dealing with this issue. I have not covered those prior measures because we have debated them at the link here in the House. Lazyngem and the bill greatly expands accessibility of voters in Georgia and greatly improves the process of administration of elections. While at the same time providing more accountability to ensure the integrity that vote is properly preserved. Mr. Speaker that is the basics of the bill. I would be happy to answer any questions. You do have some questions if you care to yield. Yes sir. Chair recognizes Chairman Oliver to your left for a question. Does the gentleman yield? Yes, Councillor, I would be happy to. Lines 402 and 402 and 1403. Tell me which section you are in. In section 28, page 55. I am sorry, I say the lines for me one more time. 1402 and 1403. I believe this requires the voter to put his or her birthday on the outside of the envelope. No, it does not. Well, it says it requires him to put it on the inside of a sealed envelope where nobody can see that date. In relation to that requirement whether it is. Hold on one second. Representative Parkman's speaker seems to have a question but she is not letting Representative Oliver ask hers and I am having trouble hearing Representative Oliver. Representative Cannon, I am sorry. One member at a time is recognized to represent it. Isn't it true whether or not. I apologize, I just couldn't hear you. Thank you. Isn't it true whether or not this birthday requirement is inside or outside that this matter has been litigated in federal courts and has been questioned in federal courts and declared to be problematical? Isn't it true sir that it reinsertion of this requirement is further putting our local counties in peril of additional expensive federal litigation? No, ma'am, you are incorrect and here is why. You are correct that it has been litigated but it has not found to be improper. So if someone wants to bring a lawsuit which many are brought about election matters, it could be litigated again but so far the courts have found that it is proper. The final question if ma'am. Yes ma'am. The burden of litigation over this bill which creates a enormous number of additional legal challenges. The financial burden of that is essentially going to fall upon our counties. Isn't that true sir? Yes ma'am because your party constantly sews us in the counties. The winds sir. Yeah, constantly winds sir. They constantly lose because they are wrong. Chair recognizes Chairman Petrie to your left for a question. Does gentleman yield? Yes sir. Representative, is it not true that the absentee ballot identification requirements in this measure is similar to states all over this country? Absolutely. And do you further yield? Absolutely. Is it not true that that list actually even includes the states of California and New Jersey? It does. Identical. Very similar. And do you further yield? Yes. And is it not true that that information for some reason has not been shared by the press as it should be? I would agree. Is that not true? I would absolutely agree. Thank you sir. Do you continue to yield? Yes sir misspeak I'll take a few more. Chair recognizes representative Bruce to your right for a question. Really gentleman yield? Yes sir representative. On lines, is it not true that on lines 1436, section 28, sorry. Section 28 on line 1436. In 1438, that the early voting period for a general runoff will be as short as three days when if this happens during the week of Thanksgiving. The gentleman is wrong and here's why. If you look at section 1436, the subsection B, it says as soon as possible prior to the runoff, that section, that language goes to early voting and runoff. In a county can possibly have it sooner, they can do it. Well, gentlemen, further yield. Yes sir. Is it not true then more than two million voters cast their ballots during early in person voting during the 2020 season? In which state are state you're talking about? Yes. I don't think it was that high but I know it was high. Thank you. Yes sir. Do you further yield? Yes sir I'll take one more question. Chair recognizes Chairman Knight to your right for a question. To the gentleman in the well to you. Yes sir. I just want to refer back to the prior question that you took regarding section 28 and the issue in regarding the birth date. Saying that it's been litigated. Isn't it true that under Georgia law that the official list of voters in Georgia is the voter certificates which contain the name, the address and the birth date? That is part of the official voter registration process and Georgia, yes sir. So why would we litigate trying to take the birth date off of this voter certificate which is signed the everyone signs and oath that that is who you are? And you are in fact voting. So I would say that there is quite a mystery as to why much of the litigation has been filed by the left against some of our voting practices. Highlighting what you have said would be the litigation where they actually sued us in the state of Georgia to do away with signature verification on absentee ballots. Now that we are doing exactly what they sued us and asked us to do, they are fighting us on the bill to do it. So if the gentleman is pointing out irony or inconsistencies with the opposition to voting and voting rules and regulations, he is exactly right. Isn't it further true that we have had instances in the Spalding County where voter certificates were not completed and people are not officially recognized as having been voted. I know from talking to the gentleman, the other representatives from your area that you indeed have had such problems. Thank you and I want to thank the gentleman for exemplary and hard work on this bill. You have truly put a lot of hard work into it and I appreciate it on behalf of Georgia and thank you for what you have done in the time you have taken this year. Thank you Mr. Chairman, I appreciate that too and Mr. Speaker, I yield well. Gentlemen has yielded the well. We have a number of members who wish to speak to the bill and the rules committee has limited debate to one hour. I will allocate equal time to both sides. So beginning with those that are opposed to the measure, the chair recognizes the dean of this house, Dean Smirie, to speak to the bill. Mr. Speaker and ladies and gentlemen, the house I rise to oppose Senate Bill 202 and I want to thank Mr. Speaker for giving me the privilege and honor of serving on the special committee of the election integrity. I have served on a lot of committees in this house and over my years here in the General Assembly in this house. I can't think of anyone that has been more important than the one that I am serving on now. I have taken it in a very serious manner and I want to thank both sides of the aisle and the committee of the chairman and members of the Republican caucus and the Democratic caucus. I want to thank both of the leaders. I have had conversations with you all and because this is the most fundamental and sacred right and the right to vote. So I come today, I spoke on SB 531 and I am here again, they have asked me to speak on SB 202 and I thought about it last night and I was in a very solemn mood. I talked to a lot of people and my thoughts went to Primus King who was born in Columbus, Georgia. He was born in 1900 and I remember Primus King was an ordinary person. He was really not brought up there, read it and he didn't much of that. He became a barber and then one day he wanted to vote and he was turned away and not allowed to vote. I remember going to his funeral and remembering that aspect of it and Primus King died as a hero. When I think about Senate Bill 202, I think about some of those rights that Primus King were confronted with and in this bill there are so many sections to it. We started off but it's a 94-page bill with new language in all but two pages and 52 sections and a lot of my members are going to be speaking on the various sections of the bill. I was asked to say a few words on the section dealing with the election period, early voting and the election period during the general and during the runoff. I stress mostly for uniformity in our state. The uniformity and the fact of the amount of that are our states, our counties and throughout the state is one of those areas that we wanted to make sure that people got the right to vote and early voting. On behalf of my caucus, I just want to say this to you all as members of that and closing, we as state legislators, our aim is to ensure that all voters, particularly voters of color, have full, meaningful and non-birdish access to the one-file mental right and that is the pressivation of all of the rights and that's the right to vote. That is the right of citizens to access the ballot box and elected candidates of their choice. Our vote is both a tangible measure of what and what we are and aspire to be as a state and as a nation. For these reasons and others, the Georgia House Democratic Caucus has taken a position and for these reasons we oppose Senate Bill 202 as presented by the ROOS Committee substitute. Thank you Mr. Speaker, you're the well. Chair recognizes Representative Eric Atomis to speak to the bill. Thank you Mr. Speaker. Knowing that we are in the civil rights capital of the world, I would be remissed not to get up here and to do an excerpt from one of John Lewis's Congressman John Lewis's speeches. Brothers and sisters, do you want to go back or forward? Your vote is precious, almost sacred. It is the most powerful, non-violent tool that we have to create a more perfect union. Not long ago, people stood in unmovable lines that had to pay poll tax. They had to pass a so-called literacy test. In another occasion, a woman who was asked to count the number of jelly beans in a jar to stop her from voting. It is unbelievable that there are still some people that are trying to stop people from voting today. You are changing the rules, cutting the polling hours and making more requirements to vote. That's not right, that's not fair, and that's not just. Too many people fought, blood, and died for our right to vote. So you asked me, why do we rally? Why do we protest voter suppression? It's because our ancestors are looking down right now on this house floor, praying and believing that our fight and that their fight was not in vain. So we call on the strength of Congressman John Lewis in this moment because right now history is watching. Mr. Speaker, I yield the well. Chair recognizes representative Alexander to speak to the bill. Thank you, Mr. Speaker. I rise today in opposition to the voter suppression bill, otherwise known as SB202. A bill that severely lacks integrity despite passing out of a committee that was supposed to deal with election integrity. We cannot undermine three and fair elections in Georgia because of baseless and I'm proving claims of fraud. Those who have echoed election fraud conspiracies without evidence under the guise of election integrity for years have laid the groundwork for this culture of fear and intimidation. However, over the course of the next few minutes, I will pose a series of questions. I would you I believe are relevant to the debate in which this body is now engaged. Now represent Paul didn't that was counting. But I believe that the other 157 should be protected and advocated as well. This ledger of voter suppression would have a negative impact on counties from Katusa all the way down to Camden. And this body has repeatedly chosen to ignore this. It was one of my chief concerns with HB531 and it continues to aid in my annoyance with SB202. Now we have heard testimony from county election officials from the ACCG that more time is needed to fully understand the physical and logistical impacts the provisions in these bills would have given these substantial changes we be making with this legislation. Why not take more time to get county input on the proposed legislation and take this up next session. In this bill we're requiring counties to pay for new security paper. Why don't we have a sense of what additional cost that would be because this is an unfunded mandate on our counties. Based on testimony heard from ACCG and estimates from a similar proposal in Arizona, this could be double the current cost to counties potentially over a million in additional costs. They've asked the state to take this additional cost and this is something the state is prepared to take on. They asked that question, is this something that the state is prepared to take on. And if so, shouldn't the physical note be attached to this legislation? Additionally, we know the security paper required in SB202 and SB62 had increased costs from 12 cents per ballot to about 25 cents per ballot. Elections security recommendations from the Bremen Center note the state should print enough paper ballots for 100% of registered voters plus provisional ballots for at least 35% of registered voters. These are election failsafe contingency recommendations in the event of a massive voting machine or poll book failure. There currently 7.3 million active registered voters in Georgia following the Bremen Center's printing quantity recommendations at 25 cents per ballot. The additional cost to counties would be 1.2 million. Again, this is unfunded mandate in our counties. SB202 will require ballot drop boxes to be constantly monitored by a poll worker, police officer or security guard located inside advanced locations. A resource from National Vote at Home Institute estimates that the average election worker is paid 16 an hour. Now, because Atlanta is the whipping board, we go take their figures. In Atlanta, the rate of an officer is about 28 and 92 cents per hour. Using these figures as a range, we estimate the average labor cost for drop box security at 22 an hour. For a party that preaches fiscal responsibility, running up a bill and then expecting counties to pay for it, is about the most fiscally irresponsible thing that one can do. I would advise my Republican colleagues to pay their bills. Mr. Speaker, I yield the will. Chair recognizes representative Lopez to speak to the bill. Thank you, Mr. Speaker. I rise today in opposition of Senate Bill 202. Moch has been said about how this bill is about transparency and restoring confidence in our elections. It is not. Close to 2.5 million Democrats voted in the general election in 2020. Those voters are represented in this chamber. Yet, Democrats in this house were left out of any meaningful input into the drafting of this bill. Democrats also represent a vast majority of the minority voters in this state. Their voices silence by this one-sided process. How is that transparent? If this bill was truly about restoring confidence for voters, we would have worked together to get this bill right. Because we all want fair, accessible, and secure elections. The false narrative of election fraud is what's behind this bill. Here's a fact from the governor's office of planning and budget. By their population projections, it will roughly take 10 years for Georgia to become a minority majority state. I've never been afraid of change. I lost a lot early in my life and that made me resilient like my community. The residents of House District 86 sent me here and are asking me to take a stand against this bill. In my county of the cap and House District 86, voters overwhelmingly adapted to change by voting absentee and utilizing the very popular drop boxes. Not only are drop boxes convenient, but they gave great confidence to voters that by directly depositing their ballots at a secure location, they didn't have to worry about their ballots getting lost in the mail. There were 33 secured and monitor drop boxes in the cap for the November 2020 election. This bill would reduce them to around 9. For something that works so well for voters, why are we now taking it away? We know that they work well for voters. The truth is that this bill targets a county like mine and minority voters because we have the votes to change elections in the state of Georgia. Lastly, I also represent the 1 million Latinos living in this state. A 96% population increase from 2000 to 2010, currently making 9% of Georgia's population. We are a complex segment of this great nation because like all of you, we are complex human beings. But I can assure you that as we mature into Georgia's electorate, we will choose those who stand with democratic values. We will choose those who do not refer to human beings as illegals. We will choose those who stand with DACA Georgians. We will choose those who oppose separating fathers and mothers permanently from the US citizen Jordan children simply because they committed a traffic infraction. We will choose those who embrace change and progress. And while we might not have the votes to defeat this bill today, that won't be for long. Thank you, Mr. Speaker. I yield the will. Chair recognizes representative William to speak to the bill. Thank you, Mr. Speaker and good day fellow members. This is my first time speaking at the well. And it's not lost on me the privilege I have to be here. I didn't imagine I'd be in this position back in February 2009. I'm noting because it was actually the first time I gave testimony to members of this body regarding my experiences with Georgia's election laws. That time it was in front of the House Governmental Affairs Committee where I engaged with and answered questions by several people. Some of you revered deeply. A former representative now Congressman Austin Scott, then representative Alicia Morgan. And even one predecessor in the position I currently hold, the late youth Lloyd. And I told them all what I'm about to tell you something that unfortunately remains relevant 12 years later. As an immigrant from the Philippines, I proudly became an American citizen in 2007. The very next year, I tried to vote in the November 2008 elections in Gwyneth County where I've resided since 2001. And participating large crowds on election day, I sent an absentee ballot application over 30 days before. But about two weeks later, I received a letter from the Secretary of State saying wrongfully and inexplicably that I was not a citizen and asking me to present voter ID, particularly my proof of citizenship. At the time I thought simple enough and as pure luck would have it, I had a couple weeks to fix the problem. Turns out I'd need every single second. I ended up having to fax my voter ID upwards of four times to the Gwyneth County Board of Registrations and Elections. Even then, I didn't get confirmation that they counted the provisional ballot I cast until weeks later. That's why I rise today to stand in opposition to SB202. My own experience has shown it doesn't matter even if folks are able to send acceptable voter ID with their absentee ballot applications and completed ballots. It's unavoidable that voter ID laws will still flag many of them. Now perhaps you believe voters should have to work a little to cast their votes. But that hard? Then imagine the legitimate voters who don't vote until later and who won't have the time or technology to cure their materials once they're inevitably flagged. I think that's likely flagged not just once but as in my case repeatedly by a county board that no matter how they've been reconstituted or not reconstituted will no longer have the resources under this bill to properly process the materials they've been inundated with. All of these provisions could ultimately also violate the Help America Vote Act which prohibits the act of challenging voters on mass to prevent them from voting in an election. It's these folks I ask you all to think up. Whatever instances of voter fraud you see please recognize SB202 will do far more harm to good people who are trying to do something we consistently ask of folks in our democracy and that's simply being gauged. And I would hope particularly those of you who know me personally you count me among those good people. Someone who despite my experience continued to remain engaged refused to become cynical and also remains steadfast that others regardless of our differences are good people to to wit while campaigning I repeatedly touted the fact that as an advocate I poured proudly and productively with members such as representative Ed Settler who would carry amendments for me on civil rights bills and even became friends six years ago with someone I'd eventually join as part of this year's freshman class that is representative Tyler Paul Smith. We disagree on things sure but we still see infinite value in one another as human beings. And ultimately that's what I'm asking you to do today to see the value in me and other voters like me even if you vote yes on this bill I share my story and hopes that for the next 12 years and beyond we can at least dialogue better about our election laws and I hope you can at least start to see when we pass laws like these we're taking the promise of American democracy away from well meaning hard working legitimately voting Americans like the Americans. Like me Mr. Speaker thank you sincerely and I yield the well chair recognizes representative butler to speak to the bill. Thank you Mr. Speaker. Where is the need for the bill coming from the former president who wanted the election fixed and thrown out even when Georgia leadership told him they couldn't do it if they wanted to. Most of us receive thousands of emails saying they don't trust the Georgia election claiming it fraudulent in an attempt to share with you the rural perspective of this bill and how it affects election offices and rural voters I talked to several election workers in several counties and most of them had telling responses such as why are you doing this when you can't prove there is rampant fraud. What I'm about to tell you is their stories their comments.\n\nFirst was, do you trust election officials in Georgia? I find it very interesting that people on both sides of the aisle wanted me to steer clear from saying our current Secretary of State did some things right in the 2002 election. In last spring, when there was more unknown about the pandemic than known, most of the poll workers in my area were in the risk age group for COVID. The primary election was unique with new election machines, postponement of the primary and the decision to mass mail absentee ballot applications, which was intended to be a protective measure for the poll workers and Georgia voters. Implementation of the primary was rough. Lots of complaints due to lines and glitches regarding operation of the new equipment. Remember, in the spring, people were scared, nervous and frustrated. In the summer, there was increased training for all poll workers and November 2020 election was smooth. Shorter lines with people voting on average in three minutes are less. More voters than ever, the new machines worked, recounts, recounts, risk limiting audit and a GBI audit came back clean. All of this in a historic worldwide pandemic. So how does this build help to build voter trust and confidence? The bill has had so many changes. The House website couldn't even keep up. The name, Election Integrity Act, the use of opinions, not facts, unproved allegations, assumptions that we did not do. Our job is highly offensive to those of us election officials on the local forefront. And it suggests that we do not have integrity. Making changes to the early voting times, the last day to turn in absentee ballots, Sunday voting, promoting uniformity statewide, removing local control and flexibility, requiring new supplies, procedures that are redundant. What are the costs? There's no fiscal note. Nobody knows. Dropboxes go away. They come back. They're put inside. They go outside. Absentee proof, verification, picture ID, just a number. What number? Provisional ballots. Do they count? When did they count? The bill adds up to more burdens and cost and returns to all practices that were abandoned years ago for security, convenience, and safety. Regarding the appointment of a civilian to head the state board of elections, who can ultimately take over the local election boards that they are underperforming, what does that mean? If a county increases from the usual customary 23% voter turnout to 43%, is that underperforming? Because the percentage is too small. Or is it underperforming because it's suspicious? Or is it really overperforming that some people just don't like? If there is a problem, why not use the Secretary of State's legislative arm? There are already judicial remedies in the code and aren't the courts the ultimate nonpartisan decision making branch of government. I suspect we would all swear our elections were honest, especially since we're sitting here today. Yet SB202 says we were elected in a time of significant lack of confidence in the Georgia election systems. And there was rampant voter fraud. In the words of a long-time poll manager, where's the proof? We were in a worldwide pandemic and the system worked. Systematic change is unwarranted. And what happened in 2020 is not a baseline to use. It is an outlier for years to come. We should not overhaul the fundamental part of our democracy based on an outlier. Please vote no. Thank you, Mr. Speaker. I yell well. Chair recognizes representative Al Williams to speak to the bill. Thank you, Mr. Speaker. I did something that I rarely do. I've got it down a few notes. I rise today in opposition to SB202. It's fascinating to me who are this right to vote, which is held and high esteemed by everybody. Because vote vote in the state pennant. Because vote vote in calls from Mar-a-Lago now dictates what Georgia does. Because vote vote in the call from Mar-a-Lago is paraded by a reality and then becomes an obsession. Lindsey Graham back when he was about right until he fell wrong again said he wanted to see 10 proven fraudulent acts in his state and he couldn't find any. Couldn't find any here. Why are we here? We're here to hold the hand of a sobbing, fetal position ex-president. We're here because he crossed the legal line, threatened an elected secretary of state who I guess you call used to be a Republican. Threatened his staff, cajoled and promised. And so in response, we wanted to find something wrong. We should have a sheer day for the greatest turnout in the history of Georgia instead. We're upset and mad about it. It ruled Georgia. I hope to understand this. Tell folks to vote is so important. When they vote, they accuse of being crooks. Election boards. They're doing a good job. Every day, I look at the morning, we're moving another election committee out. Something had to be wrong because the guy from Florida shouldn't have lost by 11,000 votes. But ask the two senators that lost by huge amounts. Georgia was tired of him. And I hope he runs again. He wants to run again where you can go ahead and dissolve the whole thing and give it to him or a silver platter regardless of what the people say. But I contend to you. The down where I'm from, stripping used to be all destructive. Just everything came, going on board, like you threw over board dead. Then we put safety holes in where things could get out and wasn't supposed to be in there. There's a funny thing about a safety net. Certainly works good. But when you put a net like I see in 202, everything dies. And so I end with this. Weapons aimed at Democrats can be used to take out Republicans. Mr. Speaker, you'll do it. Chair recognizes Chairman Allen Powell to speak to the bill. Thank you, Mr. Speaker and ladies and gentlemen of the House. I want to give my thanks to a few folks. Normally I hadn't seen a whole lot with the agreement with Chairman Fleming much over his career in mind over the years. But I do agree with him on this and I compliment him on a job well done and his temperament, as well as the members of the committee for the job well done. Now let me preface my comments for something. The legislative process, not the legislative event. That's what this is about. We come into this Capitol on the second Monday of every January to pass legislation to fix problems that need to be fixed to repair legislation that needs to be repaired. And yes, my good friend from the coast where he disappeared to was right. He talked a little bit about the politics of November. But I always talk about the politics of two cycles in Georgia. In 2018 it was about the buzz word was suppression. Oh my gosh, nothing worked right. It was about suppression. You all remember that? You folks is about here talking today. Remember the word suppression in the 2018 elections. 2020 is about concerns about fraud. So that made it a valid issue that we needed to deal with. And one of the things that we looked at was a system that's broke. The Georgia election system was never intended to be able to handle the volume of votes that it handled. Because of that age old belief in local control, we have a state that is growing. It's diverse. It's metro versus rural. It's white, black, brown, red, very diverse state. But there's a lot of distrust. Partisan distrust. A lot of philosophical distrust. And because of that, the last two election cycles in Georgia have been running full bore. So we saw this past election or after the election that we have a system that needs to be revamped. When I spoke about local control, 159 counties, ladies and gentlemen, and there's not that much uniformity. We saw a system because of the pandemic this year. We saw some elections boards in some counties that did things that were different than others. And that's not healthy and that's what led to so much of the distrust, ladies and gentlemen. But I talk about this process. I have seen in 32 years or 31 years, I've seen a tremendous number of hot button issues up here. But I don't think I've ever seen one as divisive. And I mean divisive from a different reason. What is this about folks? This is about politics. This is about a group called Fair Fight that has got more money than any other institution or any other political action group. They raise money. The pipeline was full going into the elections. The pipeline is full now and it's still going. They put out 8 million, 10 million, whatever it was to put out a publicity issue about voter suppression. Let me tell you, those of us that were appointed to this special committee do not think that we don't understand the rules of the game. Do not think that we don't understand about people's constitutional rights to vote and they shant to be abridged because if they are, the federal courts will rule. We laid quiet and got our work done because we couldn't say certain things. We couldn't talk about it during the process. I'd fear that it was going to be used or misused. I tell the story about a couple of months ago that we had a Friday meeting. The committee was there. And there was a nice lady who was testified and she continued repeatedly to use that same word about suppression and about your picture ID, which there was no picture ID in the bill. She was about going to the numbers off of a driver's license. And I politely reminded her that that wasn't in the bill. But also reminded her that there was no proven fraud from November. He was only in the minds of a lot of people. And theirs were the just was. Well, lo and behold, I left the capital at 5 o'clock and before I could drive to Hartwell, Georgia. It was already out on the on the YouTube that Fairfax, Georgia and some of those groups had taken my comments and basically had little editing job. They didn't say anything about proven. They said Republican lawmaker says there was no fraud. Folks, that's politics. We all know how the games played. Every one of us in here, we stand and we know how this game has played. The press has not duly reported the facts because I continue to tell them, read the bill. I gave an interview to a TV station last week. I think five seconds of it showed up what they wanted it to be heard. I've called people back and I especially call the people that leave me messages that threaten me to remind me where they know how to find my home. Because I damn well hope they do and they don't have to look on internet. That's how dangerous this issue is gotten folks. That people have gotten so emotionally involved because it has been played to the hilt. This is about keeping the money flow going for one organization. It's about the 2022 elections to keep people fizzled and whipped into a frenzy. Ladies and gentlemen, this is dangerous times. Well, I came to this well on the last on 531. I said at that time, folks, there's one color in its red. The same color that runs through my veins runs through the same color blood runs through my friend, our Williams veins. And it's time to take a chill pill, folks. It's time to read the bill. Don't just listen to what you're being told. Actually read the bill. I've answered questions. I want to thank a guy from Jasper County that made an attempt. He called me several times in his name's Elliott. Nice guy. But he called ask me why were we trying to suppress his vote? And I said, well, tell me what you know. You read the bill. He said, no, I know what I've been told. And we talked about the voter ID. And when I explained to him that we're getting away from the subjective nature of a signature match, this hard to match when you got so many today that are done with digitalized signatures and all, I said, we're going to use your driver's license number to identify who you are. Is there a problem? No. He said, well, tell me about the drop boxes. And I said, well, let me give you a little history. Have you ever heard the term ballot harvesting? Well, he had never heard of that. Well, I said, well, let me explain to you. There's a difference between ballot harvesting and voter harvesting. Voter harvesting is what we call politics. Ballot harvesting is the actual process. And I said, once upon a time in this state, and probably in most other states, even though they don't like to acknowledge the fact that whoever the king of the hill was or the boss man that prior to, they used to go and tell everybody that worked for them or those people that they felt they could control, we want you to sign this to get your absentee. Somehow their absentees all got marked by one person. And they all carried one time. Just ballot harvesting, folks. That's ballot harvesting. And it's not right. Because if you believe that everybody has a right to vote, then that person has got the right to vote their ballot and not just pass it over to somebody else. But that was a just to the drop boxes. So that drop boxes could be secured to eliminate or to put another obstacle in a way of ballot harvesting. But I listened to some of the opposition to this bill. And all of a sudden, history is repeating itself. The very thing that the Voting Rights Act of the 60s did away with is what you like now because you want to go back to being the new boss man. Is that right? True statement's been said is what Brother Al William said. The rules of the game will apply to all. They're going to apply it all. But what we've done in this bill in front of you is we have cleaned up the workings, the mechanics of an election system. We've tried to put in every opportunity, lock it into the iron, into the steel framework of the law. This is how it works. When a guy asked me, when Elliot asked me about the absentee voting, you're trying to do away with it? No. Did you realize that you could file for an application for an absentee six months before an election? Six months. Folks, we've had some folks that are being investigated because they filed an application. They voted and went back and voted later because they thought they had voted in another election. This bill is about making a system work, retooling the mechanics of an election system so that whether you're from Harder Franklin or photon or to cab, the system should work the same for every voter. That's what this bill is about, ladies and gentlemen. That's what it's about. But you continue to listen to the politics. You continue to listen to the PR work that's being done. That's being done for somebody that's making a ton of money. Somebody's making a ton of money by cranking the wheel of dissension, racism, the ugly word, this ugly word, but it's being used just as much on one side if not bored today than on the other side. This is dangerous, ladies and gentlemen. Absolutely dangerous to divide not just the nation but the state because a lot of the calls that I have gotten, ladies and gentlemen, aren't just from the state of Georgia. And believe them not, I'll call them back just as quick, just to ask them one question. Have you read the bill? Show me where there's suppression. There is no suppression in this bill. Now I doubt that the press is going to say that even though I did see a couple of the publications in the last couple of days have dared to breach the subject. I read one this morning that said GOP suppression. Gosh, that's funny. They actually increased the number of days on the weekends. That's pretty interesting. That's pretty bold coming from a publication, ladies and gentlemen. Pretty bold coming from the Wall Street Journal article the other day. Generally, I don't care much for newspapers, but the Wall Street Journal has always been one. They've always editorialized pretty badly. But when you see an issue that's gotten so serious that they perpetrate extortion, of the corporations, to blindly follow, that we're going to protest your business if you don't follow behind. That's dangerous folks, because it leads to economic extortion. When we see a member of this legislature who is called to the carpet by clients to tell them that we're going to have to dismiss you and ask for your resignation because you're doing your job whether somebody else agrees or not. Are the senator over there who was dismissed, some early dismissed? Is that not the same thing that Y'all have talked about fighting for years about? You're perpetrating the same poison. Absolutely. What's the difference in that and what you used to say that white man did to Y'all? Not a lot of difference. History repeats itself. So I would encourage you, read the bill. Read the bill. We're all brothers and sisters and citizens of the state, but because of the politics, because of the next year's election. More important because of that terrible thing called the political money tree to keep it churning. That's what's creating so much dissension. To those people who might dare to hear what we're saying here today. I would encourage you to read the bill. Don't just listen to me. Not just listen to my friend James Beverly or my friend, Dahl Williams. Read the bill. Use part of what all this money we've spent for the educational system of Georgia to teach you to do. Read it. Understand it and make your own decisions. Mr. Speaker, I yield the well. Mr. Speaker recognizes Chairman Bonnie Rich to speak to the bill. She waves. All right. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report. All right. We have a minority report and then we'll have the chairman's time. Twenty minutes total for the minority report. Chair recognizes Representative Bernal to speak to the minority report. Thank you, Mr. Speaker. Last November in January, Georgia made plans to vote. Then they made history. They voted absent T by mail. They voted early in person. They voted at the polls on election day. Georgia's turned out in record breaking numbers because they could access the ballot. As upon lies were told about our elections in response and now this bill is before us. Built on those same lies. My message to all Georgians is to make your voter plan right now for November 2022 and prove that the last election turnout is the new normal. In making your vote plan, you as a Georgian have three ways to vote. First, absent T by mail. Georgians who are seniors or disabled account for more than half of all absent T voters. Instead of celebrating the fact that these vulnerable Georgians could vote safely and securely during the pandemic, SB202 makes it harder for them to vote. It would burden absent T voters without a Georgia license. It would force absent T voters on the rollover list to receive their ballots 20 days later. It would create an 11 day cutoff or applications that would have prevented even Governor Kemp from voting in November. This bill would also remove the ability of seniors and Georgians with disabilities to return their ballot to a convenient ballot drop box. Even though these ballots would now require sensitive personal information. SB202 is the work of those who don't care about accessibility, safety or convenience that absent T voting provides many vulnerable Georgia voters. If you are a senior or a Georgian with a disability, if you depend on absent T voting for any reason, make a vote plan now. Ensure your voice is heard. For Georgians that vote early in person, your lines will be longer because of the time limits on absent T ballots and limit the number of drop boxes. Your January 5th runoff 2.1 million Georgians voted during these three weeks of early vote. SB202 would cut the early voting period for runoffs down to at most a single week. With no weekend voting days. For the last runoff, this would have meant three days of early vote during Thanksgiving week, a week when more Americans travel than any other week. If you vote early, make a plan to vote now. This theme of SB202 of votes loss extends into election day voting. Many Georgians disproportionately black cast out a precinct provisional ballots on election day. They do so for any number of reasons, including not being notified of changes in polling location and the fact that they can vote anywhere in the county during early vote. SB202 would disenfranchise most of these voters and throw their ballots out. We know that communities of color are disproportionately affected by bills like these. Just look at our state's history. If you belong to a community of color, make a plan to vote. Urge your neighbors to do the same. SB202 is a work of voter suppression. It's fundamental objective is to keep you the voters of Georgia from making yourself heard. If you believe that your voice is vital to this state's democracy. If you believe that we only move forward when every vote counts, then use your ballot to say so. Today, once again, make a plan and come next election. Let's vote absentee by mail. Vote early in person. Vote on election day. Make your voice count to keep Georgia on their mind. Thank you, Mr. Speaker, for allowing me to be a part of the committee. I yield the will. Chair recognizes representative Houdeli to speak to the minority report. Thank you, Mr. Speaker. The anti-voting rights bill, SB202, would be a disaster for democracy in Georgia and adversely impact the ability of eligible voters, particularly voters of color, from exercising the right to participate in a free and fair election. In addition to taking power from voices of everyday Georgians, this bill will increase legislative power over elections by stripping authority from the Secretary of State. There are more sections on legislative elections power grabs than any other voting topic in the bill. The majority of these have never been debated on this House floor. These machinations will lead to severe voting access restrictions and place county and state election certifications in unprecedented jeopardy moving forward. If passed, SB202 would dramatically move power over election authority to the Republican control state legislature. The stripping of Secretary of State's power in Section 4, remains.\n\nThe Secretary of State as a voting member and chair of the State Election Board. And Section 5 requires the Secretary of State to provide any and all necessary support and assistance to the State Election Board at the State Election Board's sole discretion. Section 4 also creates a new State Election Board chair appointed by the State Legislature, given the Republican Control State Legislature, the power to appoint three out of five members of the State Election Board. Section 2 allows only two State legislators to initiate a State Election Board Board of Election takeover process by allowing the State Election Board to appoint an individual to replace and an entire County Board of Election. Section 5 grants the State Election Board power to suspend any Board of Election and fire any Election staff following a petition. And Section 6 grants any County Commissioner the power to petition the State Election Board for complete Board of Election takeover. Further, SB 202 will require the State Election Board and the Secretary of State to notify the State Legislature five days prior to entering. Any consent agreement settlement to consent order. And it allows the State House and Senate committees on judiciary to overrule any State Election Board emergency rule under Section 49. This so-called Election Integrity Act of 2021 lacks one major thing. Integrity. It's built on the big lie that election officials told citizens over and over again and now we have this sham of a bill. Which in some respects is nothing more than a prescription on how to get away with stealing an election. So let's be clear about what this is. This is an partisan power grab done in response to the electoral defeat in 2020 election cycle. For record numbers of black and brown Georgians made their voices heard in their power known at the ballot box. We will not stand outly by and let Jim Crow 2.0 roll back the clock on our new Georgia. Mr. Speaker, thank you. I yield the well. Chair recognizes representative Wilson to speak to the minority report. Thank you, Mr. Speaker. Colleagues, we've covered a great deal on the merits of these rewrites. So I won't take you point by point on my objections. But I will say as the only person here who represents both Fulton and CAB counties that the state take over portion of this behemoth of a bill is deeply wrong headed. And it's been stated that the impetus for these provisions is Fulton and CAB. So that makes this a potential muzzle on the voices of my constituents in counties that coincidentally cast hundreds of thousands of votes. For candidates from my party. But I'm sure that's just a coincidence. There's a larger conversation here that I think we need to have. So let's take the time today to have it. Because I feel blessed. Well and truly blessed to have lived in a time where I could meet heroes like my late Congressman John Lewis and serve in this chamber with Dean Smirie and representative Williams. Men and a whole lot of women too who stood shoulder to shoulder with those who fought and bled and died for the right to vote. That's who I listen to when we come here to talk about voting. When we and the minority party speak up for our communities to tell you about the inevitable disparate impact on democratic participation this will cause. And get nothing but endless what about ism in response. All I can conclude is that there are certain people you don't want to vote. I actually don't even have to draw that conclusion when I can just find it in the evidence. Members of the majority have stated they don't want to see vote harvesting. That ideal voters should be invested enough to go out of their way to vote. That isn't democracy. One person, one vote. Not one educated person with free time and an ID card. People don't skip the polls because they don't care. They can't make it because they're busy struggling to survive out there. So with that said, let's talk about what we're really talking about here. Some of you feel that this body has to pass something because of how the people feel. But why do they feel that way? We know why. It's because they've been fed a steady diet of lies and propaganda for decades. On the first day of this legislative session, the speaker gave us all a charge to underpin our work, saying we must tell our citizens the truth. So let's tell them the truth. Let's talk about the history of our country. We can say enthusiastically, there was no fraud in Georgia. There was nothing improper about the way our elections were run. There were no mass-coordinated campaigns to get felons, non-citizens or deceased folks to vote. The reason people feel like our elections were insecure is the non-stop toxic torrent of lies and misinformation spread by Republican politicians through conservative media to voters. All of this work done to supposedly build the public confidence. All 95 pages of it has been done because of one man in his Twitter account. This is about losers complaining to the referee. Passing this bill is capitulating to the big lie. That's no way that the people who are guilty of the fraud are guilty of the fraud. Passing this bill is capitulating to the big lie. That's no way to run our state government. Many who will vote for this bill will justify the lies because it tilts the scales and allows the majority to retain power. That's what this bill does. But I'm not okay with that. And you shouldn't be either because the people who send us here deserve better. They deserve their democracy. Mr. Speaker, I yield the vote. Chair recognizes Chairman Mitchell to speak to the minority report. Mr. Speaker, colleagues, our US Senator Reverend Raphael Warnock gave his first speech on the Senate floor last week. His comments were profound and seem so fitting to close this debate that I am going to use much of his words here. I understand that he is watching and I hope to do his words of justice. For he was honored on a few occasions to stand with our hero and his parishioner John Lewis. He was his pastor but Reverend Warnock said he was clear that John Lewis was his mentor. On more than one occasion they boarded buses together after church services as part of the souls to the polls program, urging the Ebenezer Church family and communities of faith to participate in the democratic process. Now with just a few months after Congressman Lewis's death and I may add the same John Lewis that was given the rare honor of having his body lie in state in this very capital. There are those in the Georgia legislature, some who dare to even praise his name that are now trying to get rid of Sunday souls to the polls or making it optional, preventing those who pray together to get on a bus together. I think that is wrong. As a matter of fact I think that a vote is a kind of prayer for a kind of world we desire for ourselves and for our children. To be sure we've seen this kind of voter suppression tactics before. They are part of a long and shameful history in Georgia and through our nation but refusing to be denied Georgia citizens and citizens throughout our country brave the heat, the cold and the rain, some standing in lines for five hours, six hours, ten hours just to exercise their constitutional right to vote. Young people, old people, sick people, working people, already underpaid force to lose wages to pay a kind of poll tax while standing in line to vote. And how do some politicians respond? Well they're trying to make it a crime to give people water and a snack as they wait in the lines that will obviously make lines longer by their draconian actions. Think about that. They are the ones making the lines longer through these draconian actions and then they want to make it a crime to bring grandma some water while she's waiting in a line that they are making longer. Make no mistake. This is democracy in reverse. Some politicians did not approve of the choice made by the voters voters in a hard-fought election in which each side got the chance to make its case to the voters and rather than adjusting their agenda rather than changing their message they are busy trying to change the rules. We are witnessing right now a massive and unabashed assault on the voting rights unlike anything we've seen since the Jim Crow era. Since the January election some 250 voter suppression bills have been introduced in state legislatures all across the country from Georgia to Arizona from New Hampshire to Florida using the big lie of voter fraud as a pretext for voter suppression. The same big lie that led to a violent insurrection at the US Capitol the day after Reverend Warnox election within 24 hours we elected Georgia's first African American and Jewish senators and hours later the Capitol was assaulted. We see in just a few precious hours the tension very much alive in the soul of America and the question before all of us at this very moment is what shall we do to push us in the right direction. Surely there ought to be at least a majority in any legislative chamber who believe as I do that the four most important and powerful words uttered in the democracy are the people have spoken. Therefore we must assure that all the people can speak but if not we must still protect voting rights the right to vote is preserved to vote of all other rights it is not just initial alongside other issues it's a it's foundational it is the reason why any of us has the privilege of standing here in the first place. It is about the covenant that we have with one another as an American people e pluribus unum out of many one it is above all else and it must be protected and closing let me say that as a man of faith I believe the democracy is the political enactment of a spiritual idea the sacred worth of all human beings the notion that we all have within us a spark of the divine and the right to participate in the shaping of our destiny. John Lewis understood that and was beaten on a bridge defending it Amelia Boyton like so many women not mention nearly enough was gassed on that same bridge a white woman by the name of Viola Luisa was killed Medgar Evers was murdered in his own driveway. The Schwerner good minute chainy to were Jewish and an African American standing up for their sacred idea of democracy also paid the ultimate price and we in this body would be stopped and stymied by partisan politics short term political gain legislative procedure instead of passing this legislation I urge my colleagues to support a resolution urging Congress to pass the John Lewis voting rights act among others to strengthen the political agenda of the state of the state. The government is helping and lint in the courts of our democracy thereby securing our credibility as the premier voice for freedom loving people and democratic movements all over the world and win the future for our children and with that Mr. Speaker I yield the well. As yielded the well and that completes the time and speakers for the minority report under the rules of the House the chair has 20 minutes for the chairman's time and the chair recognizes chairman Fleming for the chairman's time. Thank you Mr. Speaker I yield the first balance of my time to the speaker pro Tim chair recognizes speaker pro Tim Jones for the chairman's time. Thank you chairman Fleming well I won't repeat the many good additions to this package of election reforms that will increase accessibility increase transparency and increase the election integrity I will though try to provide a little context we'd like to make a few quick responses first number one ballots printed on security paper are worth 25 cents each rather than 12 cents if it makes them more secure. Number two 47 counties only offered one Saturday of weekend voting Senate bill 202 will require every one of these 47 counties to offer two Saturdays of early voting. Number three a fiscal note is required for state costs not local costs but I remind you that the greatest increase in election local elections cost contained in this bill will be the requirement to standardize longer voting hours for early voting and two Saturdays of early voting. I would hope no one here would suggest we eliminate that because of the increase burden of cost to our local elections officials. And finally before I have a few other remarks I'll mention that from 2003 to 2020 last year 59 bills on elections gain passage in the Georgia General Assembly at least one elections bill every single year. This is a common operating procedure in this general assembly. I will also mention that just for the record Sunday voting is optional now and if this bill passes it will continue to be optional. But do remember only 16 counties chose to take advantage of that and I hope more will in the future but 16 counties in the November election. I guess how many in the January runoff six I honor souls to the polls I hope more churches do that but the reality is most of souls to the polls is an absentee voter effort. It's not taking buses to early voting precincts because many of your churches like mine members come constituent members of the church come from many counties. You can't just take them to one early voting place because they wouldn't just be out of precinct they'd be out of county and their vote would not count. And finally I must say something about this the water business. You would think that 150 feet of your currently protected space from campaigning activities was like the three miles to walk and snow to school that my father always talk me about but just to be clear in the bill it allows for water for grandma. I would like to return to the parable of the turtle on the post. But first many of you read as a child or read to your children the children's book series Franklin about a charming young turtle facing the challenges of growing up such as dealing with sleeping in the dark or making a trip to the hospital. Franklin in the series is the one who solves whatever issue he's confronting with the guidance and support of his friends and parents. I'd like to think that Franklin could could solve how to scale down from a post after an uncharitable stranger strands him there leaving him to expire from thirst baking in the scorching sun. As he views the the cool stream he was trying to reach on the other side of the road. But we know he could not he couldn't achieve it on his own it would take a charitable soul to help him solve the dilemma. Well I'd say the same for our state election system that was stressed in a manner unseen and modern history in 2020. It won't improve on its own without action it won't address the concerns brought up in 2018 and 2020 and 2018 by the supporters of the losing candidate for governor and president. Without action concerns over elections accessibility transparency and integrity won't be addressed. The pandemic has been thoroughly dreadful but there are glimmers of silver linings one of them is a deep dive into our elections processes by the House Committee on Elections Integrity so that we can modernize it improve it and make it more resilient and adaptable. Senate Bill 202 reflects this deep dive and improvements to our election system some of the stressors that are addressed are the following a sixfold increase 600% in absentee ballots flooding into the postal and elections offices raising concerns not just about security but about the many ballots that never arrived or were never successfully voted because voters had relied on unrealistic time periods and rules that were in place in person election lines growing ever longer because of the 20,000 out of precinct voters over burdening poll workers as they ballot by ballot figure out which elections pertained to which voter in the wrong precinct and which elections do not. The process disenfranchises every out of precinct voter for the down ballot elections that did not pertain and just keep in mind this is not a long standing issue in 2016 there were only a few hundred out of precinct votes in 2018 there were 7,000 in 2020 there were 20,000. The change in the election system like I believe there are a couple states that do it where everything is like early voting where anyone can vote anywhere in the county but that's a major overhaul and maybe that's worthy of a future discussion but that's not how our election system is set up today. The elections officials carefully set out precincts with a certain number of poll workers a certain number of machines so that elections can flow more successfully and voters don't get tired of waiting in line and go home and never vote. Additionally we had 500,000 absentee ballot requests that were subsequently counseled by voters that voted in person. Many of these ballot requests were made for five even six months out before the November election and they forgot that they had requested them in the long time period. Thousands of thousands of stranded absentee ballots that were never received by voters in time to cast a ballot because they ordered them too late to logistically make the turnaround. Some as late as 5pm on the Friday prior to the election that's ridiculous and to say we're shortening the time we're making it more relevant so that voters votes will actually count. Long lines because elections officials were not required to split precincts or add voting machines or poll workers in large precincts that had long lines the previous election that's fixed in this bill. There was anxiety statewide because counties weren't required to begin scanning absentee ballots prior to election day and this is not a criticism of elections officials because our state had never seen such an enormous increase in absentee ballot. The bill lays out reasonable processes so that these ballots are processed in time and voters throughout the state and frankly the nation can know what's going on in Georgia. Senate Bill 202 mandates more in-person voting hours throughout the state. It's utterly not true to suggest otherwise. 134 counties out of 159 counties will offer more in-person voting hours than ever before because of more uniform voting hours to required Saturdays of early voting and two optional as we have now. Sunday voting are in early voting will be called out for the first time. Additionally we will have we're changing the start and end dates for absentee ballot applications another form of early voting so that it more logically coincides within person early voting and frankly this is how many other states do it. This change will increase the likelihood of a voters vote being cast successfully. It will decrease the likelihood of voter forget six months out that he or she ordered an absentee request. I keep this in mind 90% of absentee ballot requests made greater than 10 days before the November 2020 election were successfully voted. In contrast 50% of absentee requests made fewer than 10 days before the election were not voted successfully. That alone requires a change if we really want more votes to be cast successfully. It takes a pandemic, maybe once in modern history, to take an absentee ballot delivery model used only once ever in the Georgia general election, so called drop boxes, and this bill puts it into law. Now you would think from some of the discussion these things these animals had been here for many decades one election cycle. But now instead of an expired one time emergency order that remember was put in place to address social distancing concerns by elections officials these receptacles will be required in every county. The bill establishes a secure chain of custody and a uniform manner for their use. They will be even more secure by placing them inside voting sites, early voting sites, now that social distancing unless we have another pandemic and there's a provision in the bill to accommodate that. If that happens again, they'll be more secure. Additionally remember there were 38 counties that did not offer a single drop box. They count to and they will be required to offer one. You know I would hope that someone would come along and Franklin the turtle were left stranded on that fence post because he couldn't accomplish it on his own. And our stressed election system won't be enhanced by ignoring it or asserting that it will result in things that are not contained in the bill and absolutely will not be a result of it. I encourage you to vote for Senate Bill 202 which makes needed improvements to our elections following newly installed elections machines and entire new process throughout the state. We've learned where we need to make improvements, a pandemic that stressed our elections and may have changed voters preferences on how they want to vote. I honor that. The bill honors it. It just puts better processes in place. All of these factors, Maritid the Deep Dive and I want to thank Speaker Ralston for creating the Committee on Injections, Elections, Integrity and for making it such a priority. And I encourage you to vote for a bill that absolutely addresses concerns over transparency, integrity and absolutely allows for more accessibility for every Georgia voter. Thank you, Mr. Speaker and I yield the well. Chair recognizes the majority caucus will representative Kelly for the balance of the chairments time. You know, Mr. Speaker, there's a saying that says a lie can travel halfway around the world before the truth can even get its pants on. There's a bustle of lies that's made its way around halfway around the world today. And when it's perpetrated by the media, apparently it's been perpetrated on the Senate floor of our US Senate. Those lies now been perpetrated in our house and I don't even think the truth has been able to make it out of bed because of the help we've seen of perpetrating these lies from a US Senator, a former failed governor, Governor candidate, and the media that is done nothing but misrepresident the contents of this bill. But here's the truth. Elections should be accessible and secure and measures that we pass at deal with elections should help make them more accessible and secure. We've heard the lie that this is about the 2020 election. Let's remember who started the conversation about elections in 2018. Made a career out of it. We started this process back in June. We started having conversations with the Secretary of State back in March about some of the concerns that we saw. The fact that anyone would try to make this argument solely about what happened in November or January is just downright false. We began this conversation in June because we saw there was problems with our primary election process.\n\nUnfortunately, this body didn't have a chance to come back together in Fixos before the November election. So yes, some of the same problems we saw in June happened in November and they happened in January as well. And now we have the opportunity to come back and address that. But what we're doing in Senate Bill 202 is greatly expanding access for Georgia voters. For the first time in Georgia history, we are making provisions in our code to allow for Sunday Vending. For the first time in Georgia history, we are making provisions for drop boxes because we want to expand access. So we can tell the Senator, don't worry, the buses can still be cranked. But there will still be sitting there, but the candidates just won't be able to hand it to. Mr. Speaker, we have a responsibility to Georgia's. First to be honest with them. And second, to make sure that they're right to vote as accessible and secure. And that's what we've done in Senate Bill 202. And I ask for favorable consideration. And I'll yield the balance of the time to Chairman Fleming. Chair recognizes Chairman Fleming for the final three minutes of the Chairman's time. Mr. Speaker, there have been a lot of interesting questions asked here today and some of you have already been referenced. One member asked the question about isn't just this, this just the loser complaining to the referee after the game, but I wasn't sure it was at the 2018 game he was talking about after the 2020 game. Also there's been a question of here, why do we need to change the rules just because you didn't like it? Well, why then did Democrats in this legislature introduce 25 bills or more changing our election laws? Maybe somebody else recognizes that a few changes needs to be made. I would suggest to you if you're looking for more questions about why we're having this debate and some of the things that have been said, you look at a Wall Street Journal article today. It's entitled Blue State Voter Suppression. And then it talks about the voting laws in states like Maryland, New York, New Jersey, California, even the District of Columbia, how much bluer than that can you get. And it says, where is the outcry over Democrats earlier, a poll closing hours and ID rules because those states have some of the same laws we do and some of the same ones proposed in this measure. And what do you hear from Democrats complaining about those? The silence is deafening. Ladies and gentlemen, the problem with this bill is it provides a method for somebody to start a campaign in 2022. And what we're trying to do is address the problems in 2018 and 2020, so the 2022 campaign can be run well. This bill you have in front of you today, Senate Bill 202, it does do a few things and it does them very well. It improves access of the voters to the polls. It improves the administration of elections for the people who have to run them in our counties. So I would say to you this, unfortunately, you are about to have the chance to vote on the largest expansion, just one example, the largest expansion of weekend voting we ever have had in the state of Georgia when it comes to the laws in our code. And sadly, I predict Republicans will vote yes on that and unfortunately the minority party will vote no. But the only question is what's new about that? We have heard Jim Crow, we have heard poll tax and I will remind you when those things came up, Democrats voted yes and Republicans voted no continuously. So history just seems to repeat itself. You're about to have the chance to make voting better in Georgia and also make voting in Georgia more accessible. I would encourage you to vote yes on Senate Bill 202, Mr. Speaker, I yield the well. Gentlemen, as yielded the well, there are two amendments that you have for consideration, both of which were offered by the committee on rules. The first amendment is AM281868. Is there any objection to adopting the amendment offered by the committee on rules that being AM281868? Chair, here's none in that amendment is adopted. The second amendment is also offered by the committee on rules and that is AM281870. AM281870. Is there any objection to adopting the amendment offered by the committee on rules? Chair, here's none in that amendment is adopted. Is there any objection to withdrawing the committee substitute? The Chair, here's none, the committee substitute is withdrawing. Is there any objection to adopting the rules committee substitute as amended? The Chair, here's none, the rules committee substitute as amended as adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none in the report of the committee. Is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Owl Williams rise? Parliamentary inquiry. State your inquiry. Is it not truth or just for the record? He's been spoken about many times. I'd like to say I'm a proud member of the Board of Directors of Fairfights. If the gentleman so states, what purpose does Chairman Rich rise? Parliamentary inquiry. State your inquiry. Isn't it true that Senate Bill 202 represents our value of our absentee voting process by providing for basic security that the vast majority of all Georgians want in their votes, including ID requirements, chain of command, and bipartisan review of the absentee ballot duplication process. That is the Chair's understanding. What purpose does Representative Anola Woods rise? Parliamentary inquiry. State your inquiry. Is it not true that within hours of the insurrection at the Capitol, the Trump campaign withdrew their lawsuit against the state and the Secretary of Georgia that was predicated upon lie after lie that was presented to members of this General Assembly into the public at large? If the ladies so states, I'm sure she believes that to be true. What purpose does the minority caucus who will represent of Wilkerson rise? What is the state your inquiry? Is it not true that our side of the aisle probably agrees with a lot of the statements that were made regarding falsehoods, etc. We may disagree somewhat slightly on where that was coming from. It might have been a self-reflection that people were trying to push us when they started talking about a bus and lies and coming back around. I don't know, but that's my problem with your inquiry. Thank you. I'm not sure if the gentleman so states, I'm sure he believes that to be true. What purpose does the representative win rise? Parliamentary inquiry. The state your inquiry. Isn't it true that the former one-term president's attorney, Sidney Powell, is currently being sued for defination in the court of law for spreading lies and conspiracy theories? Isn't it further true that her defense is that no reasonable person should have believed those lies because facts were not being presented? Isn't it further true that Republicans in this chamber and all across our country have peddled these lies and conspiracy theories? Isn't it further true that this bill is a response to those lies and is nothing but Jim Crowe but 2.0 in will impact black and brown voters across this chamber, which is why every single black member in this body is voting no. This is not a pep rally. Justice is a legislative body. Members will conduct themselves in proper decorum. There was a lot in your parliamentary inquiry. So I'll make that observation. What purpose does the representative camp rise? State your inquiry. Is it not true that the reason some members repeatedly use the words voter suppression is because it is a poll tested phrase utilized by democratic fundraising entities to that end even when there's no factual basis in Senate Bill 202? I'm sure the lady believes that to be true. One more parliamentary inquiry. What purpose does representative Bays more arise? Parliamentary inquiry. Mr. Speaker, isn't that true that not one Democrat was invited to that June discussion with regards to planning for this bill? A June discussion. I don't know about a June discussion. All right. If all members voted, have all members voted. So the clerk will lock the machine on the passage of Senate Bill 202. The eyes are 100. The nays are 75. This bill having received the requisite constitutional majority is there for past. Chair recognizes what purpose does chairman Fleming arise? Make a motion. State your motion. There this bill be immediately transmitted to the Senate. Is there any objection? There is objection. All those in favor of immediate transmittal will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted, have all members voted. If so, the clerk will lock the machine on the passage or on the gentleman's motion. The eyes are 100. The nays are 74. And this bill is on its way to the Georgia State Senate. Chair recognizes for an announcement representative McLean. Representative McLean, you have an announcement? I think we can hear you up there. Reading family caucus lunch in room 310? 310, okay. Chair recognizes the chairman of the minority caucus, chairman Mitchell for an announcement. Thank you, Mr. Speaker. There will be a lunch in room 216 for the Democratic caucus upon our recess here. 216 in the Capitol. Thank you, Mr. Speaker. Chair recognizes the chairman of the House Rules Committee, chairman Smith for an announcement. Thank you, Mr. Speaker. The Committee on Rules will meet at 2 o'clock, 341. Thank you. All right, I have an announcement, a bipartisan announcement. Please be sure to return your tablets to the clerk's office for charging over the lunch break before you leave. Return your tablets to the clerk's office. The House will be in recess until 215.",
  "updated_at": "2026-02-13T23:04:45.494848+00:00"
}