{
  "video_id": "HUsM6BxlTi4",
  "url": "https://www.youtube.com/watch?v=HUsM6BxlTi4",
  "title": "Georgia Legislators discuss bills to ban Lab-Grown Meat and pausing Data Centers | Lawmakers 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Here is a summary of the key points from the Georgia legislature floor session transcript:\n\n**Overview:**\nThe discussion focused on two bills being introduced - one to ban lab-grown meat and another to pause the development of data centers in the state. There was also discussion of potential property tax reform and education funding.\n\n**Key Actions:**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading):**\n- Bill to ban the production, distribution, and sale of lab-grown meat\n- Bill to pause the development of data centers for one year\n\n**Notable Moments:**\n- Senators discussed concerns over the public's trust in institutions and the need for more education and transparency around new technologies like lab-grown meat and data centers.\n- Senators expressed interest in pursuing property tax reform and updating the state's 40-year-old education funding formula.\n\n**Votes:**\nNo recorded votes were mentioned.\n\n**Attendance:**\nNo quorum notes were provided.\n\n**Adjournment:**\nThe transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "Joining us is Republican Senator Jason Dickerson from Senate District 21,\nrepresenting portions of Cherokee and Fulton Counties. His committees include\nbanking and financial institutions, public safety, government oversight and veterans,\nmilitary and homeland security. Also here is Democratic Senator Jaha Howard of Smirna,\nwho represents parts of Cobb and Fulton Counties. His committees include agriculture and\nand consumer affairs, government oversight, higher education, and state and local government\noperations.\nWelcome to Lawmakers, to your first time.\nThank you.\nWe're going to have you back, of course.\nSo we'll get to know you a little bit better.\nAnd I'm going to start with you, Senator Dickerson.\nTell us a bit about yourself.\nYou co-founded, among other things, an overhaul, a long haul, Trump Trump company, a long\nhaul trucking.\nPeople out there for a long time on it.\nThat is correct.\nYes, ma'am.\nIt was some of the lifelong resident,\nCherokee County, started my first company\nwhen I was 15 years old, which was a transportation company.\nBy the time I graduated, I had five employees.\nOver the years, I've had about 22 different companies,\nthe smallest five employees, the largest 550 employees.\nAgain, just love the community of Cherokee County,\nlove North Fulton, and just love everything about it.\nIt's been an absolute honor.\nThat first one, was it bikes and transportation?\nWhat was it?\nIt actually, it was a three car hauler.\nI can't transport cars back to Florida.\nOh, wow, at 15 years old.\nLet's talk a little bit about one of the bills\nthat deals with trucking that you are looking to introduce\nreally soon on CDL driver's license.\nThat is correct, unfortunately.\nThat is correct, the driver's license.\nAnd so one of the things that we've kind of seen here\nin the public over the last several years\nis that we've had some accidents\nand some of those drivers, for the most part,\nThey may not have been able to speak English\nor even read English.\nA lot of times they've been able to drop the truck.\nAnd so one of the bills I'm looking to introduce\nis that if you're a non-US citizen\nand you're here on a visa,\nthen your driver's license will aspire\nthe same date that your visa expires,\nwhich is not currently the case.\nOkay, well we'll find out more about that\nonce you drop that bill.\nAll right, Senator Howard,\nlet's learn more about you, you're a dentist,\nand you also served on a Cobb County board for a time.\nWhat's about that a little bit?\nWell, yeah, I'm a pediatric dentist in Vinenings, I grew up in Atlanta, Mays High School, I'm\na church deacon in Bible study teacher in the city of South Poulton, and I live in Smyrna,\nand it's just excited about representing all of those wonderful parts of the district\n35.\nOkay, well, I have you.\nThere's something that came out with the EPA today dealing with investigating, looking\nat what is going on with fluoride and water.\nWe know that the recent administration is making a lot of changes based on sometimes\noutsized fears, and some there's some legitimate conversations that we have to have with\nthe public.\nWhat I try to tell our parents, and the same thing with our constituents, is that there's\na difference between water flow ride, topical flow ride, like toothpaste, and supplements.\nBut oftentimes when we're in a political warfare, people are just using words and using terms\nand throwing them around for a political gain.\nWe need to make sure we're trusting our medical professionals, our dental professionals\nto have that more nuanced conversation.\nSo the topical kind is the kind we may see in what to face than that kind of thing.\nAnd it has wonderful benefits.\nWe do want to have a more nuanced conversation about systemic fluoride.\nOkay.\nWe've been talking about this bill dealing with lab-grown meat.\nThat is correct.\nAnd tell us what that's all about, much above all.\nWell, so it's, you know, this is something that came forth by one of my constituents.\nAnd every year, you know, what we've looked at is, of course, I always have things that\nare passionate to myself and my family.\nBut at the same time, I always want to do what's best for the people in my district.\nAnd this is one of those items that came up.\nAnd it just made a lot of sense all the way around.\nYou know, and-\nSo what's the part that makes sense?\nAre we want to ban it?\nI do want to ban it.\nAnd so, you know, right now is the FDA basically approved this in 2023.\nSince then, we have seven states that have banned\nthe production, distribution, and sale of lab\ncreative meat.\nHere in the South East, we have Texas, Mississippi,\nAlabama, and Florida that have all banded as well.\nWow.\nAnd so at this point, it's basically taking a little bit\nof animal stem cells and that kind of thing,\nand making meat out of it.\nThat is correct.\nAnd right.\nAnd, uh, and, and, and pork.\nAnd chicken.\nAnd that is correct.\nThat is correct, yes ma'am.\nWow.\nSo your, your bill, you, you feel pretty good about it.\nYou said it's a talker.\nIt is a talker.\nIt's not one of the things I thought\nwould get a lot of press on,\nbut the last couple of days in the media,\nit is definitely take it off.\nOkay, well, we're gonna find out how that goes.\nLet's switch gears a little bit to another talker.\nAnd that's data centers.\nYou have interest in a bill\nand introducing a bill dealing with data centers.\nTell us about it.\nVery much so our campaign ended mid-December\nand it was one of the number one conversations\nthat data centers.\nA lot of people are just now finding out\nwhat data centers are.\nWhen we have a conversation, no matter if they're a 20-something year old or 80-something year old,\nwhen they realize we have just blocks and blocks and blocks of warehouses full of servers\nthat are going to be in your backyard, people want to have a deeper conversation.\nThey want to understand that connection between what the data centers are in our water, our\nnoise pollution, energy is the big one, so people want to have a real conversation.\nSo on the campaign trail, we talked about pausing data centers for one year.\nIt's not that we're anti-progress, we want to welcome progress, we want to welcome technology.\nBut just like with the conversation about lab-grown meat, technology is great, but we can't\ndo anything without trust.\nAnd I think we can all agree that the trust in our institutions is at an all-time low.\nAnd if we want to do wonderful things with technology, but we can't do it without public\ntrust, let's take a pause.\nLet's make sure that we're educating one another, let's know what we're walking into.\nnot just have a short-term goal, but what's our meeting and long-term goal for data centers?\nOkay, before we're breading out of time, but I want to get something in that it is important.\nWe talked about tort reform and all last year a lot in the legislature.\nYou want to do something with insurance reform?\nWell, specifically for me, it comes down to a property tax reform from that standpoint.\nAnd for me, you know, it's just like in District 21, as in the rest of the state, I mean,\nWe've seen astronomical property increases,\na lot of property tax increases over the last four to five years.\nAnd we've just become unsustainable for anybody\nthat's in the district, whether you're in the South Georgia,\nwhether you're in North Georgia, it doesn't matter.\nSo we definitely want to look at some property tax reform\nthis year, and we've already put forth one bill\nto help the people in Cherokee County District 21.\nOkay, and real quick, tell us about your interest\nin education, and because you've been\non the Cup County School Board,\nwhat are you interested in seeing happen?\nYeah, I think folks will be surprised\nthat our funding formula is 40 years old.\nAnd we've tinkered around the edges.\nWe're barely making progress.\nWe've had many years where we've underfunded\nour public education.\nAnd oftentimes we're quick to demonize our public schools.\nWe need real champions for public education\nand also make sure that we're leaving room\nfor some creativity through our public charters.\nI'm not a big fan of running over to private education.\nWe wanna make sure that no matter where you are in Georgia,\nyou want your public schools,\nwhere they're a traditional public,\nor public charter schools to be strong.\nOkay.\nWell, how's it going so far real quick?\nOh, it's been great.\nYou like it?\nIt's been fantastic.\nIt's been good.\nWell, I'll ask you that.\nYeah, have us back in a few weeks.\nAnd you're soft.\nAll right, thank you so much for coming to us.\nThank you, Donna.\nAppreciate it.\n",
  "updated_at": "2026-02-12T01:25:00.82822+00:00"
}