{
  "video_id": "hYOSVeSF92Q",
  "url": "https://youtu.be/hYOSVeSF92Q",
  "title": "Georgia House - Day 13 (2026-11-19)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 13,
  "video_date": "2026-11-19",
  "duration_minutes": 74,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 13 (2026-11-19)\n\n## Overview\nThis was a routine legislative session with no major bills discussed or actions taken. The session focused on a devotional prayer and the Pledge of Allegiance.\n\n## Key Actions\nNo bills passed or referred.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Dr. Benny Tate, a pastor from Milner, Georgia, was introduced and delivered the devotional prayer, emphasizing the importance of gratitude and thanksgiving.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum was present, with all members reporting to the floor.\n\n## Adjournment\nThe session adjourned after the Pledge of Allegiance. The next session is scheduled for the following day, November 20, 2026.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nI also stand at ease until 10-15.\nI also stand at ease until 10-15.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nthey are of convening having arrived all members of the house will please\nreport to the floor of the house and take your seats all members will report to\nthe floor of the house Mr. Clerk would you ring the bell\nthe\nthe\nmembers, please take your seats.\nWe're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nAll members voted have all members voted if so the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nSo a good morning, welcome to Friday, because we're in session tomorrow, but only for technical\nreasons.\nMajority leader will explain that a little more later.\nWe will begin our day with scripture reading and prayer by the chaplain, after which we\nWe will pledge allegiance to the flag of our country.\nOur chapel in this morning will be introduced by the gentleman from the one hundred and\ntenth House District Representative Clint Crowe, Representative Crowe.\nThank you, Mr. Speaker, good morning, colleagues.\nI have the distinct pleasure today to welcome Dr. Benny Tate.\nDr. Tate has served for over 30 years as a senior pastor\nof Rock Springs Church in Milner, Georgia.\nThe church has grown from 80 and attendance\nto more than 8,000 under his leadership\nand has seven campuses.\nThe following ministries are part of Rock Springs Church.\nRock Springs Medical Clinic.\nRock Springs Christian Academy.\nThe Potter's House for Women and Impact Street Ministry\nto care for the homeless.\nDr. Tate serves as president of the Congregational Methodist\nDenomination, and has served many times as chaplain\nfor the United States Senate.\nThe United States House of Representatives\nof Washington, DC, here at the Georgia Senate\nand here in this house.\nDr. Tate is authored five books most recently\nto file the odds, which hopefully you all\nhave gotten a copy of.\nIf you haven't, please let us know.\nVinny and his wife Barbara have been married for over 35 years\nand have one daughter, Savannah Abigail,\nand they currently reside in Versailles.\nAnd I cannot overstate how much he means personally to me\nand my family.\nPlease welcome my pastor and my friend, Dr. Benitez.\nGood morning.\nThank you so much for giving me this opportunity.\nI have been coming to the Capitol for decades in speaking.\nPerhaps you'd say, Pastor Benny, I've never heard you.\nIf you've never heard me, would you just slip your hand up?\nSay, I've never heard you, yes.\nI say to this group, what Elizabeth Taylor said\nto her eighth husband, I'm not going to keep you long.\nAmen?\nBut I would like to share a scripture that I think\nis appropriate during this season.\nIt's in 1 Thessalonians, 1 Thessalonians chapter 5, verse 18.\nIt simply says this, in everything, give thanks.\nCertainly not for everything,\nbut in everything, give thanks\nfor this is the will of God in Christ Jesus,\nconcerning you.\nIn everything, give thanks.\nI just wanna take a few moments\nand I wanna talk to you about thanksgiving day every day.\nday. Thanksgiving day, every day. I want to say three quick things. First of all, it's\nthe will of God. It's the will of God. The Scripture says in everything, give things.\nThat means the good, the bad, the winds, the losses. In everything, give things. Sometimes\nI think we're kind of like Snoopy. Snoopy the dog gets up on Thanksgiving day and he\nlooks in the window and he sees the family having Thanksgiving.\nHe looks in there and he sees Turkey and he sees dress and he sees pumpkin pie.\nSnoopy's outside the window and he says, my goodness, here I am outside the window eating\ndog food. They're inside having turkey and dress and pumpkin pie. He said, this is terrible.\nThen he thought for a moment and he said, you know, it could be worse. I could have been born a turkey.\nAnd Speaker Ralston, this is what I've come to realize. From the day of your birth to the ride\nin the hearse, things are never so bad that they couldn't be worse. Amen? So when everything\ngive thanks because this is the will of God. But I'll tell you, ladies and gentlemen,\nI appreciate you so much. It's not only the will of God, but it's, it's the wish of God.\nIt's the wish of God. There were 10 men in the Bible that were healed of leprosy. It's\na terrible skin disease that the fingers and toes would literally rot off. It was terrible\ndisease and I want to elaborate much on the story but Jesus healed 10 men and one\nman turned around and said thank you and Jesus said this he said where are the\nnine where are the nine all I want to say is apparently this omnipotent\nomniscient, I'm not present, God notices when we're not\nthankful. Apparently, this God who didn't begin when the\nbeginning began, but the one who began the beginning notices\nwhen we're not thankful. It's the wish of God. 73 times, the\nBible says, to meditate, Clint Crowe in this wonderful\ndelegation to give thanks. I really want to be like that\nlady that got up one morning and she had three hairs on her head. And she said,\nyou know, I believe I'll braid my hair today. Beth, she got up the second morning\nand she had two hairs on her head and she said, you know, I believe I'll\npart my hair in the middle today. She got up the next morning, she had one hair\non her head and she said, you know, I believe I'll wear my hair in a ponytail\ntoday. She got up the next morning and she had no hair on her head and she said,\nthank God I don't have to do my hair today. There's always something to thank\nGod for, but if we're not careful folks, we'll be grumbly hateful instead of\nhumbly grateful. See, it's it's the will of God. It's the wish of God, but I'll tell\nyou something else. It's the wisdom of God. Let me give you something to think\nabout. Ten men were healed and one man gave thanks and Jesus said to that one\nman, go thy way, thy faith had made thee whole. Now wait, ten more healed but\nonly one was whole. And we're only whole when we live lives of gratitude. And it's in our\nbest interest. It's a proven fact. Medical field tells us we'll sleep better if we're grateful.\nWe'll live longer if we're grateful. We'll have better relationships if we're grateful.\nAlbert Einstein said there's only two ways to live life. He said one way you can\nlive life is nothing is a miracle and the second way you can live life is\neverything is a miracle. Everything is a miracle. The Bible says but thanks be\nunto God which giveeth us the victory through our Lord Jesus Christ. So\nSo during this season, perhaps we could just say, thank God for dirty dishes, for they\nhave a tale to tale, while others are going hungry, we're all doing pretty well.\nWith home health and happiness, we should not make a fuss by the stack of evidence\nbefore us.\nGod's been very good to us.\nLet's pray.\nLord, I want to thank you for this day.\nI want to thank you for this delegation.\nI thank you for Speaker Ralston,\nand I pray God that you're blessing\nand leadership and wisdom upon this special man.\nI pray for every one of these men and women.\nThey're good people.\nThey sacrifice for people like me.\nThey sacrifice to serve this wonderful state\nstate that we live in. And whether it be the leaders, whether it be brother\nBurns or God, all through the delegation, I just pray that you would help\nevery one of them that you would just give them your guidance and your wisdom\ngive them a wonderful, wonderful thanks given season. Would you bless them and\nkeep them, make your face to shine upon them, be gracious and to them, lift your\ncount at Sponum, may they experience your peace. And I pray this in Christ's name. Amen.\nI pledge allegiance to the flag of the United States of America and to the Republic for which\nit stands. One nation under God, indivisible with liberty and justice for all.\nThe doorkeepers will unlock the doors.\nmutants.\nChair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nThe Committee on Information and Audits has read the journal of a previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, with all its sham, drudgery, and broken dreams, it's still\na beautiful world. Be cheerful and strive to be happy. Representative Stephen Sains.\nOh my goodness. Is there any objection? I'm sorry, Chairman Hogan, the Chair of the Committee\non information and audits, reports that the journal of the previous legislative day has\nbeen read and found to be correct.\nIs there any objection to the confirmation of the journal that Chair here is done and\nthe journal is confirmed?\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, only 159 moves.\nFollow me.\nEstablishes the order of business that are first part of the period unanimous consent in\nIntroduction to bills and resolutions, first reading and reference of Senate bills and resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nThe chair here is none in the resolution is adopted.\nWe're going on now to morning orders.\nMorning orders.\nI know we have several that are waiting to greet Benny Tate, and I don't want to interrupt\nthat, but if you just kind of keep the volume down a little bit, we're going to move forward\nhere a little bit. All other members will give attention and respect to the\nmember in the well. The chair recognizes the dean of this house, Dean Smirey, for\na morning order. Two minutes each for morning orders today.\nMr. Speaker, ladies and gentlemen of the House, I wanted to come this morning and you all\nknow that I've been under consideration and one of the gentlemen that has been so helpful\nto me with the Secret Service, I got a call on a text and I mentioned it to Chairman Smith\nthat he had passed away and I remember when he called me and I asked the speaker if he\nHe would do an interview for me and this gentleman was so good to me.\nI didn't know him, I just met him.\nHe came to see me for five times and assisted me through on charter waters, areas where I\nnever been.\nAnd you're always grateful when you meet people and they're good people.\nYou don't even know them.\nAnd that's just a blessing.\nAnd I pray for Mr. Gita, Thomas Manning Gita's family.\nI never met him, but I am going to, and I just wanted to, as you all do, keep his family\nin your prayers, and, oh, he just said when he so much, it gave me so much wisdom, and\nI just want to come, this morning, Mr. Speaker, ladies and gentlemen, the house, just to say,\nthank you to him, and I said, he is a rest in peace, so thank you, Mr. Speaker, for\ngiving me this moment to come and just said thank you. Always believe in the\nfact that in life we ought to plant seeds to trees for the shade we may never\nsee and that's what he did. He planted a seed in me for the shade that he may\nThank you, Mr. Speaker.\nAlmost exactly half a year ago on May 21, 2021, we lost Marissa McCall Dodson.\nShe died unexpectedly at the age of 37 while playing basketball with her son.\nShe was the public policy director for the Southern Center for Human Rights.\nShe worked in this building with us.\nThe newspaper will tell you that she was instrumental in passing the first citizens\narrest repeal in the country and we're proud of that and that's true, but she was and\nshe is so much more than that to us.\nHeartbroken does not begin to describe the effect of her passing on the community of people\nwho suggests this in this building.\nShe was a mother to AJ, a basketball coach, a daughter.\nHer mother is here today, came to call Perry\nwith her husband, Paul.\nShe was a sister and a friend of many,\nand I miss her dearly.\nI know y'all understand this.\nShe had a love-hate relationship with this building.\nI think we all do.\nShe saw its ugly side.\nAnd she carried that ugliness for us.\nand the CLOB in the halls of the capital when we were not able to,\nbecause she believed that the work that she was doing was worth it.\nYou know, we often think of making an impact in here in terms of passing bills,\nbig old floor speeches, but I think the place where public policy is transformed\nis in the heart of people like Marissa Dotson.\nBecause it's holding that tension of a broken and unjust world that is the real work,\nand it's the work we all have to do\nif we want to see progress on any public policy\nas she we care about.\nShe went to meetings and listened to us,\nacted fool and not know what we were talking about\nand she sat there and she smiled,\nbut she gave it right back to us\nand she told us when we were wrong.\nWe didn't deserve her.\nGeorgia did not deserve her.\nSo I'll end my comments before Representative Nguyen\nspeaks to her as well by just saying,\nshe would want me to say this up here today.\nThat we need to end cash bail.\nWe don't need to have a wealth-based system of detention.\nWe need to end the death penalty.\nIt's expensive.\nIt's arbitrary.\nAnd it's applied in a racially discriminatory way.\nThese were her wishes that she gave her life for in this\nbuilding, because she believed in them deeply.\nShe touched my heart.\nI hope she touched yours.\nWe will remember her forever.\nThank you for your time.\nChair recognizes representative Wynne for a morning order.\nThank you, Mr. Speaker.\nJust a few weeks before we lost Marissa, my family took a vacation\nfor the first time, post-pandemic.\nAnd I had just returned from the beach.\nAnd my sister said she had a phone call with Marissa.\nThe Fountain County District Attorney\nhad just made a decision to seek the death penalty\nin the Atlanta sponsored shooting case.\nAnd my younger sister shared with me\nthat Marissa wanted to get some guidance\non how she could voice her opposition to the death penalty,\nbut she also wanted to respect the varied viewpoints\nwithin the Asian-American community.\nAnd especially when it came to those\nwho were directly impacted by the tragedy.\nAnd I think of this moment often\nbecause it captures so well this delicate ballot\nand stat we hold, which is the human instinct\nto rely on the criminal justice system for closure,\nbut also recognizing that same criminal legal system\nis also used as a weapon,\nespecially when it comes to black and brown communities\nand to poor people.\nMarissa had moral clarity on this.\nShe never ever confused accountability for justice,\nand she dedicated her life to guiding us\nto that same moral clarity.\nAnd she called upon us to have the grace, courage,\nand audacity.\nShe reminded us that justice isn't measured by incarceration, and that true liberation\ncan only be achieved through eradicating poverty, dismantling systemic racism, and leading\nwith humanity first.\nMy sister told me that Marissa ended the call by asking if we could all get together for\na celebration, because the work that she did in this building and outside of this building\nwas so emotionally heavy.\nShe did have a love-hate relationship with us here, but she always knew what the assignment\nwas, which is she put aside herself and her feelings and she carried that burden for\na greater cause.\nBut she was eternally optimistic because she believed we could build a Georgia where\nher little boy could play basketball and grow up and live in his own greatness.\nWe never had a chance to find some time to celebrate because shortly after that, Marissa was\ncalled home.\nSo in honor of Marissa, let's all find a little time for celebration, even in our moments\nof darkness and grief.\nAnd as we celebrate Marissa, let's also recommit ourselves to building a better Georgia for her\nson, AJ, and for all of the people that she fought for, and if we could just have a moment\nof silence in honor of Marissa McAuliffe-Dotson.\nThank you, I yield the well.\nChair recognizes representative Wade\nfor a morning order.\nGood morning colleagues, I appreciate the opportunity, it's a beautiful day, nothing like\na good Friday.\nAnd often we have the opportunity to hear folks recognize those very worthy citizens that\nhave already gone on.\nAnd I think that's an important thing.\nBut today I'm actually here and I believe there is nothing that doesn't happen for a purpose.\nIn the message we heard today, you heard a discussion of thanks in America and I want\nto share with you a story of my county and the county that Speaker Ralston represents\nDawson County. There is a miracle story going on in my community that you won't probably\nnot see from a Hollywood movie or see on the channel two news. But there's a young man\nnamed Rodney Castleberry. On August 6th, Rodney was admitted to the hospital with COVID.\nHe has a wife named Jessica, who is a paraprofessional in our schools.\nHe happens to be a cattle and poultry farmer, but we refer to that as he raises cows and\nchickens.\nThey've got two beautiful daughters.\nHis journey has been nothing but miracle after miracle.\nHe fought to stay off the ventilator, and these are many of the words of his wife she\nshared with me.\nOn August 18th, he took a term for the worst and they said we have to put him on a ventilator.\nRodney is in his mid-40s like myself.\nThen they had to sedate him and he started running a high fever.\nHe became septic.\nHis chances continued to decline.\nThey couldn't keep his blood pressure.\nThroughout the day, didn't even have an improvement because folks in Dawson County are fighters.\nHe wants to raise those girls.\nThis continued on, but then they were told we've got to get him on an ECMO machine and\nthey didn't have any.\nYou guys know that we've had trouble with supplies.\nThey get a last minute call before she had to make the decision no wife wants to ever\nmake, we have one, another miracle. While all this was going on, my community, now everyone\nin here has utilized signage for your campaign, right? Well, we have rally for Rodney signs\nin my community. Folks that don't know Rodney put them in their yard. There's an amount\nof money that has to be raised when you get to the stage\nthat Mr. Castleberry is in because he now is fighting\nto go through PT.\nHe's here in Emory, in Atlanta.\nAnd this is why we're all connected.\nThe nurses that cared for him to get him to the place\nwhere he is now in consideration of having a double lung\ntransplant.\nBut he had to raise a little over $15,000 to qualify.\nShe shared with me the miracle of when a stranger\nreached out and said, I want to help you.\nI want to sell these signs for you to raise money.\nThe first fundraiser that they had after they got every sign\nthat they printed sold that probably\nshould have only yielded about $5,500.\nThe lady called Jessica and said, we've raised $15,030.\nanother miracle.\nI'm very proud of my community.\nSpeaker Ralston, I know you're proud as well.\nDawson County are people that love their neighbor.\nAs they're my believe, we're all called to do.\nAnd the miracle is, and the lesson for us is to never,\never, ever give up.\nThis young man has two daughters and a wife\nwho are going to be served, and I believe\nthat he will receive those two lung transplants.\nHis journey is not over, but I ask you, if you would,\nbecause I believe in miracles,\nall that would say, hallelujah with me,\nand then I will be done.\nHallelujah.\nWatching out for your Rodney, thank you, sir.\nAppreciate it.\nChair recognizes representative Burt now\nfor a morning order.\nThank you, Mr. Speaker.\nToday, Representative Davis, Johnson, Jackson, we would like to welcome the ladies of Delta\nSigma Theta Sorority Incorporated.\nWe are starting our 55th Annual Convention here in Atlanta at the World Congress Center,\nwhich means that they're going to spend a lot of money and we just want to welcome them\nhere and hope that we have an outstanding convention. Thank you, Mr. Speaker.\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits\nfor a Morning Order.\nThank you. Thank you, Mr. Speaker, members of the House. I'm announcing today that\nAnd our PGA tournament, our SM started just today on St.\nSimon's at C. Island golf courses.\nAnd we have 11 bullet oaks competing in that tournament.\nSo go bullet oaks.\nto recognize his representative Seba for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nIt's my first time in the well.\nI'm Devin Sebaugh, the proud new representative from District 34, and today I bring greetings\nfrom Cobb County, Georgia.\nAs many of you know, I was sworn into office in July of this year to take the seat of buzz\nthe Georgia Tech mascot and his alter ego, but it reaves for whom I have great aberration\nand respect.\nWith that being said, I think it is important for the record the following be noted.\nSince my swearing in, Kenosal Mountain High School in District 34, under the leadership\nof a principal, Nathan Stark, Athletic Director, Philip Matthews, and Coach Caleb Carmine,\nmade it to the region tournament in football, and they won the region, and they've advanced\nto the second round of the state football championship.\nAnd for the first time in school history, they've made history in that school.\nIt's been 20 years, and Coach Carmine played on the first football team at Kennesall Mountain\nhigh school, so I want to congratulate Principal Stark,\nAD Matthews, Coach Carmine, and the entire Mustang Nation\non their success this season.\nAlso since my swearing in, our Atlanta Braves\nthat now call Cobb County Home has won the National League\nChampionship and been crowned the MLB World Series Champions.\nAlso since my swearing in to replace Buzz\nin this general assembly, sports\nIllustrated has recognized UGA 10 as the number one mascot in all of NCAA football.\nAnd finally, since my swearing in, our beloved Bulldog football program, hailing from the\ngreat University of Georgia and Athens, are undefeated at 10 and 0.\nMr. Speaker, it could all be just a coincidence.\nAnd I yield the will.\nWell, I don't know.\nYour predecessor now is employed by a school who's football team is what, three and eight.\nOne winner, one not so much.\nrecognizes Chairman Chokas for a morning order.\nThank you, Mr. Speaker.\nGood morning, everyone.\nToday is a great day, and this weekend is a great weekend.\nI have two daughters and a son, and after this weekend, I will have two daughters and\ntwo sons.\nMy oldest daughter is getting married this weekend, and I will be an instant grandfather.\nMy future son-in-law has two daughters, Savannah and Tegan.\nAnd so they will be welcome members of our family.\nSo I'm really excited.\nI just wanted to share that with you.\nThank you, Mr. Speaker.\nClark will read the caption to a group of privilege resolutions.\nHonoring the Life and Memory of Sam Thomas, Honoring the Life and Memory of Uteen,\nEloise Schuman, Recognizing and Commending Kimberly Ballard, Washington, commemorating\nthe 25th anniversary of the National Museum of the Mighty Eighth Air Force, Commending\nand congratulating Darryl Peter on her A, acknowledging Mrs. Matthews who coax him for her work\nin public education, recognizing commending Mrs. Karen P. Jones, recognizing November 30th,\n2021 as Monroe by Centennial Celebration Day, commending all Vietnam error and Vietnam\nmore veterans and their families,\nrecognizing commanding Timothy C.\nResard and for other purposes\nI can please the reading of the privilege resolutions.\nIs there any objection to adopting\nthe privilege resolutions that Chair here's done\nand the resolutions are adopted?\nChair recognizes the majority leader of the House\nfor to speak to a resolution.\nMr. Clerk, would you read the resolution?\nSenate resolution number 48EX by Senator Dugan of the 30th,\na resolution relative to meetings and\nadjournments of the General Assembly.\nChair recognizes the majority leader to speak to the resolution.\nThank you, Ms. Speaker.\nAs Representative Bentley would say, happy Friday, yes.\nWe passed a scheduling resolution earlier, and we need to make some adjustments here, so\nI'll go into what those are, Mr. Clerk,\ncould you put the resolution on the board?\nMaybe not, I'll explain it then.\nIt's on your desk.\nUnder this resolution, on Saturday, tomorrow,\nNovember 20th, the speaker will gable this house\nin the session for a special session day 14.\nWe will be convening for procedural purposes.\nRoe call will be dispensed with, and members are neither required or expected to attend tomorrow.\nThis simply follows the President set by this House that's been in place for any number\nof years as we tend to the business of this House.\nOn Sunday, November 21st, this House will be in adjournment.\nNovember the 22nd. Monday we will have special session day 15. And on Monday I\nam hopeful this house will be able to complete some ported business we've been\nabout for the last few days. Of course if we are unable to complete that\nbusiness on Monday we will return the following day. I believe that\nthoroughly explains about what our posture is and what our process here is in\nin the House as we tend to the important business\nfor the people of this state.\nMs. Speaker, I'll be very glad to answer any questions\nif there are any.\nIf not, I would ask for this body's favorable consideration\nof SR-48EX.\nWe could adopt it.\nYou don't appear to have any questions.\nThank you, Ms. Speaker.\nAre you the well?\nThe procedure tomorrow, the reason we neither expect\nrequire people to be here will be much the same as we did on day 29 of the 2020\nsession after the pandemic suspension when we convened to do first readers of\nbills coming over from the Senate and then we also did that in 2018 with the\nHurricane Michael special session and on a Saturday so that members could get\nout and attend the funeral former rules chair Meadows, so there is precedent for what we're\ngoing to do.\nI will be here.\nYou don't have to be tomorrow.\nSo I think that's about as clear as I can put it, hope you have a good weekend.\nI'm hopeful that we will finish Monday.\nBut that requires some fair dealing on both sides of this building.\nWe have some announcements.\nIs there any objection to the adoption of Senate Resolution 48EX?\nHearing no objection, that resolution is adopted.\nrecognizes the Minority Caucus Chair,\nRepresentative Mitchell for an announcement.\nThank you for your patience, Mr. Speaker.\nThe Democratic Caucus will have a very quick meeting at 11.15 in room 216 here in the Capitol.\nThank you so very much.\nChair recognizes Chairman Cooper for an announcement.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House, outside the chamber, both chambers, some upstairs\noutside the balcony.\nI have left packets of cards about the pharmacy that I talked to you about yesterday.\nThe one that we passed the bill in 2016 to create, they take good, in-date, excess medicines\nfrom drug companies and other places, and then people in our state who are low income\nor having trouble paying for their medicines can access those medicines and they will be\nto them. They have been very successful, but they can do a lot more, and we have a lot\nof people in this state that can use help with paying for their medications. The cards tell\nyou how to do it. When I let the chamber yesterday and went up to my office, I'd already had\na call from the Cobb County School Board and somebody listening to our proceedings and\nsaid that she had sent out the information to all the social workers in the Cobb County\nschool district. Miriam told me in my seat one of my close seat mates that she's\ngonna give it out tomorrow when she gives out turkeys to the needy. Someone else\nhas a diabetes walk. Please pick up a packet if you haven't already done it\nthey're outside the chamber in a box and get the word out about this wonderful\nresource we have that you helped create. Thank you Mr. Speaker. Chair recognizes\nChairman Darlene Taylor for an announcement.\nThank you, Mr. Speaker.\nThe legislative and congressional reapportionment committee will meet tomorrow Saturday, November\n20th.\nThis is a virtual or in-person meeting and it will meet at 9 a.m. to 11.\nThat's the congressional and legislative reapportionment tomorrow at 9.\nAnd it's going to be in room 406.\nThank you.\ncompletes our announcements. This house will be in recess till 6 p.m. this evening. You can\nleave immediately when we leave here. We're staying open for the chair to come back in and\nfirst read any bill that is passed out of the Senate by the Senate today. So that's the only\nreason for keeping it open. House will be in recess to 6 p.m.\n",
  "updated_at": "2026-02-12T12:36:30.65732+00:00"
}