{
  "video_id": "I4f-9x24WYE",
  "url": "https://www.youtube.com/watch?v=I4f-9x24WYE",
  "title": "01/22/2024 Sen. Butler & Rep. Beverly Press Conference Commemorating Roe v. Wade Decision",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 22,
  "summary": "Here is a structured markdown summary of the key points from the Georgia 01/22/2024 Sen. Butler & Rep. Beverly Press Conference Commemorating Roe v. Wade Decision session:\n\n## Overview\nThe press conference commemorated the 51st anniversary of the Roe v. Wade Supreme Court decision that protected the constitutional right to abortion. Democratic lawmakers discussed how the overturning of Roe v. Wade has stripped Georgia women of reproductive freedom, and outlined their efforts to restore those rights through legislation and political action.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\n- **HB 75**: The Reproductive Freedom Act (filed last session but not given a hearing)\n- **SB 15**: The Reproductive Freedom Act (filed last session but not given a hearing)\n\n## Notable Moments\n- Democratic lawmakers shared personal stories about the importance of abortion access and the impact of Georgia's near-total abortion ban.\n- Rep. Beverly discussed her own experience having an abortion for medical reasons and the devastating impact the ban would have had on her family.\n- Democrats accused Republican leadership of silencing citizens and refusing to allow a hearing on the Reproductive Freedom Act.\n- Democrats announced they will hold their own public hearing on HB 75 across the street from the Capitol, since Republican leadership won't allow them to use a committee room.\n\n## Votes\nNone detected.\n\n## Attendance\nNo quorum notes.\n\n## Adjournment\nNo adjournment details provided.",
  "transcript": "Good afternoon, and hello to my Democratic colleagues who have taken the time out of their\nbusy schedule to join us today, to observe the anniversary of Roe versus Wade.\nFifty-one years ago, on January 22nd, 1973, the Supreme Court issued a landmark decision\nin Roe versus Wade protecting a woman's constitutional right to choose.\nThe case reaffirmed basic principles of equality reinforced the fundamental right to privacy\nand enabled women in this country to make deeply personal decisions, free from political\ninterference.\nSince Roe was overturned by the Supreme Court justices that were handpicked by Republican politicians,\nwe've seen countless horrifying stories of women across this country, denied life-saving\ncare and doctors threatened with prosecution for simply doing their job.\nThis should not be happening, not here in Georgia, not anywhere in this nation.\nWho would have thought that our granddaughters would be worst off than their grandmothers?\nThe state of reproductive freedom in Georgia at this particular time is untenable.\nThis is about our freedom to decide when, where and with whom to have a family.\nI for one believe that a woman has a right to make that decision for herself.\nRepublicans believe politicians have the right to make our most personal decisions based\non their values.\nWe believe in a freedom to make our own decisions based on our faith and our values.\nA woman forced to deliver a baby is over 10 times more likely to die.\nOne in 50 pregnant women who have an ectopic pregnancy could die because the fetus has\nimplanted itself somewhere where it doesn't belong.\nLook, call me pro-life, pro-choice or pro-commonsense.\nI just believe the government should not be telling a woman or a couple when they should\nor shouldn't start a family based on someone else's interpretation of the scripture.\nThey believe fertilized eggs are people and they call themselves pro-life, but vote against\nthe lives of real babies and children.\nAlways voting against help for families to cover child care calls.\nAlways blocking laws preventing gunmen from killing children in our schools.\nMake that make sense.\nDemocrats believe that life is more than a slogan and we will stop.\nWe will stop at nothing to restore reproductive freedom.\nNow, while Republicans are running their anti-freedom agenda and taking away rights and dictating\nwomen's private health care decisions, Georgia Democrats are committed to making sure\npeople have more rights, not fewer.\nThat's what will be on the ballot this November, and we're going to continue to make sure\nthat every single Georgian knows the states, I'll bring to the microphone our treasurer\nShe wrote.\nThank you, Leader Beverly.\nHello, everyone, and thank you for joining us this afternoon.\nToday, we commemorate what would have been the 51st anniversary\nof the Roe v. Wade decision, a decision that correctly\nrecognized the right to abortion as a fundamental liberty.\nIt is still jarring as we stand here today\nto realize that Georgia women no longer\nenjoy the same reproductive freedom we did\nfor almost five decades.\nWe are going backwards and Republicans\nunder the gold dome are too blame.\nRepublican politicians in our state\nenacted a near total abortion ban\ncompletely stripping Georgia women of the right\nto make their own health care decisions.\nThis issue is personal for so many Georgians.\nIt's really personal for me.\nWhen I made my decision to terminate a pregnancy\nfor medical reasons, I was 37 years old.\nMy husband and I were thrilled when we found out\nwe were pregnant, but a little apprehensive\nwith the extra caution required when you're over 35.\nAfter a 12-week ultrasound, we received a call\nfrom our doctor, a blood test indicated\nthat the fetus had triced me 18, a chromosomal disorder,\nmy physicians classified as incompatible with life.\nAfter receiving all the facts from my physicians,\nthey explained that essentially,\nmy pregnancy would end with the death of our child.\nMy husband and I had to decide what to do\nwith this devastating news.\nWhat would the non-viable pregnancy do to my body\nif we did not take medical action?\nIs it worth risking my own life\nand possibly leaving my children without a mother\nonly to delay the inevitable.\nI knew what I had to do and scheduled the abortion.\nI have absolutely no doubt in my mind\nthat it was the right decision for me\nand my family, including my unborn child.\nAn impossible decision, I pray my daughters,\nnever have to make.\nIt is absolutely devastating to think\nthat the freedom to make these exact same healthcare decisions\nhas been revoked in the state of Georgia.\nHad this happened to my family in 2024,\nif I, like many Georgia women,\ncouldn't afford the costs of seeking care\nin a state with reproductive freedom,\nI would have been forced to stay pregnant,\nforced to give birth against my own will\nand at great risk to my own life.\nI would have had to endure forced birth,\ndespite trained physicians recommending the contrary.\nGeorgia's near total abortion ban interferes\nwith a doctor's care, period full stop.\nAnd even worse, many Republican politicians\nserving under this gold dome right now\ndon't think Georgia's near total abortion ban is enough.\nThey will stop at nothing to ban all abortions\nwithout exceptions for rape,\nincess or to save the mother's life.\nThis is a five alarm fire and we will not remain silent.\nI refuse for my daughter's generation\nto be the first with fewer rights than their mothers.\nAnd Georgians agree.\nMost Georgians believe women should be able\nto make their own health care decisions.\nIn fact, 77% of Georgia voters support reproductive freedom.\nTime and time, again, it is clear that Republicans\naround the wrong side of this, but they still dig their heels in.\nAnd Republican politicians are who are competent to make health care decisions for Georgia women.\nThey will pay at the ballot box in November.\nMeanwhile, Georgia Democrats will continue to fight to ensure we can all make our own\nhealth care decisions.\nStay tuned for this legislative session.\nWe will stop it nothing to restore reproductive freedom.\nThat means using every tool in our toolbox, including enshrining fundamental protections\nfor reproductive freedom into Georgia law, repealing harmful abortion restrictions that create\nbarriers to care and making it easier for all Georgians to get the care they need.\nLast session, the House and Senate filed HB 75 and SB 15 the Reproductive Freedom Act\nthat does all of those things and more, yet Republicans still refuse to give it a hearing\nThis is part of a pattern with Republicans under this gold dome.\nAmerica was founded as a representative democracy, but they are not representing the people.\nMy Republican colleagues are ignoring the facts and silencing the Georgia citizens who elected them.\nSince they won't let the people speak on this issue, Georgia House Democrats will hold its own hearing on Wednesday at 2pm across the street of the Presbyterian Church.\nYes, you heard that correctly.\nRepublican leadership will not allow us to use\na committee hearing room in this house,\nthe people's house, even when no one else is using it.\nAgain, Republican politicians are doing everything\nthey can to silence the people,\nand they were elected to represent them.\nSo my call to action today on this anniversary of row\nis please contact the House Public Health Committee chair\nand members, the speaker, the lieutenant governor,\nGovernor Kemp and demand they stop silencing the citizens of Georgia and give HB 75 a hearing.\nThank you all for standing with Georgia legislators today, and thank you for fighting with us\ntomorrow to protect and restore reproductive freedom for Georgia for good.\nGood afternoon, I am Representative Carl Gail Yara, the chairman of the Georgia Legislative\nBlack Caucus.\nAs my colleague said, it is an issue in this defining moment for we to people.\nIt's a constitution that says we to people in order to form a more perfect union, what\nbetter union than to give a woman the right to choose.\nEstablish justice, ensure the message tranquillity,\nwhere would justice have we gotten\nwhen the people have spoken up\nthat they have a right to choose over their own bodies,\nensure the blessings of liberty to our self,\nto our prosperity, do ordain and establish\nthis constitution of the United States of America.\nAnd if America and Georgia establishes\nsomething for the people, then it should be the right\nto choose and not the right to abuse.\nThe woman that is standing in her position\nof either choosing whether to or not to,\nso many times we've been under these gold domes.\nAnd as we represent over three million constituents\nacross Georgia with over 74 senators\nand state representatives,\nit isn't all that our colleagues must listen\nto the voice and the will of the people.\nRemove party lines and focus on human lines.\nThose are human beings of those women\nwho should have the choice and the right to decide\nover their own body.\nAs a father of daughters, they have a right to choose.\nAnd as a husband to my wife, it is always essential\nthat we don't go through what they go through.\nAnd so on today, the Georgia Legislative Black Caucus\nstands in unity with our caucuses in the Senate\nand in the House.\nAnd today, we represent we, the people.\nGood afternoon, I'm Senator Gloria Butler, I'm the leader of the Georgia Senate Democratic\ncaucus. Today, we gather to recognize the anniversary of Roe v. Wade. Not so long ago,\nour gathering would have been a celebration. We would celebrate the decision that allowed\nwomen to make choices about their own bodies and to determine the direction of their own\nlives. We would celebrate the hard work that granted the honor of leaving our children,\nour grandchildren, and our great-grandchildren with more freedoms and greater opportunities\nthan we had. Two years ago, the dogs overturned rope. It was a dark day for women in Georgia\nand around the country.\nAll of us, from great grandmothers to great granddaughters,\nfelt anger at this loss.\nThe loss of our agency, our body, autonomy, our choice.\nWe could no longer tell future generations\nthat we're leaving behind a better world\nthan we've been given.\nIt was heartbreaking, but in days following\ndog's decision, women did something amazing.\nThey turned their anger, their grief, their sadness\ninto action.\nThey continued fighting.\nThey continued organizing and demanding the fundamental\nrights to which women are entitled.\nIf the Supreme Court says that the states are capable\nof making these decisions for themselves,\nwe, women in Georgia, and in every state in the U.S.,\nwe are never going to stay silent to paraphrase.\nOver the last two years, we have persisted,\nand we have protected our rights to reproductive freedom.\nall over the country, in Michigan, Ohio, and Kansas.\nWe put abortion rights on the ballot,\nand let those who are deprived of their rights\nhave their voices be heard.\nAnd we want, every time, this year, voters in New York\nand Maryland would do the same in other states, including Georgia,\nRepublican governments have spent millions of taxpayer dollars defending unpopular and\noverly restricted abortion laws and courts.\nLast year we joined this fight to elevate the voices of the people and do whatever we\ncan to ensure our voices are heard and honored.\nThat is why I introduced Senate Resolution 136, which will allow Georgians to decide\nwhether we want to protect reproductive freedom\nby enshrining in our state's constitution.\nThis fall of a long tradition of protecting our patients\nrights in Georgia.\nIn 1876, we were the very first state in the union\nto recognize the right to privacy in one's own medical\ndecision-making.\nWe seek to uphold that legacy of respect and dignity\nin health care by allowing women and their families\nto decide what is best for themselves.\nThat is why we are proud to hold heartedly\nsupport the measure of putting reproductive rights\non the ballot, to let the people and women decide\nwhat they want for themselves.\nBecause we actually trust the people of Georgia\nto do what is best for themselves and their families.\nUnfortunately and unsurprisingly,\nRepublicans ignore Senate Resolution 136.\nThey silence Georgians and allow this resolution\nto sit untouched, unheard, and unconcited for one for a year.\nWhy?\nBecause Republicans don't want the people to make the rules.\nRepublicans want everyone to live by their rules,\nby their moral codes, to acquire you to walk the path\nthat they think is best for you.\nIt is Democrats, not Republicans, who defend\nthat most cherished and American ideal of freedom.\nThis afternoon, let us celebrate all women across our country\nwho continue demanding the rights owed to them\nunder the Constitution.\nIn honor of the women who fought so hard to make\nrole possible, let this be the legacy it leaves behind.\nThen when those in positions of authority\ndeny women the power of their own bodies,\nlives and our futures they ignite a discipline and energy and a fury in our\nspirits that has for centuries guided women to do what we do best get the job\ndone to all those who have stood beside us and fought to restore the\nfreedoms guaranteed by roll to those who have spoken up and demanded the\nthe voices of the people be heard,\nI want to say sincerely to you, thank you.\nGod bless the women of this state who keep fighting\nand God bless the women of this country that keep fighting.\nThank you.\nI stand before you with the heavy heart yet fiercely determined.\nI am proud to be the youngest woman to serve in the Georgia Senate.\nThis has often afforded me a unique perspective, not just on reproductive rights, but on all\nissues facing Georgia families.\nI am speaking out to ensure that women's stories and relived experiences remain at the\ncenter of this conversation.\nToday should have been a day of celebration, the 51st anniversary of GroVee Wade, a landmark\ndecision that empowered millions of women and families across our nation.\nAnd instead, we find ourselves in throws of a relentless war on women and families waged\nby our governor and a Republican-led legislature, Helbet, on turning back the clock on our rights.\nWe cannot allow ourselves to become numb to the real consequences that are unfolding across this\nstate. Many of my GOP colleagues are comfortable turning a blind eye to these issues of reproductive\nfreedom because they are out of sight and out of mind. But let me tell you that these\nissues are front and center if you're a woman in Georgia right now. Over the last two\nyears, women and girls, my peers, my constituents and friends across the state have shared their\nstories with me. The woman who came to Georgia for vacation from out of state and started\nto miscarry at eight weeks, she flew home bleeding rather than seeking care here. The woman\nwho found out she was pregnant at six weeks and one day because it took her so long to\nget her health insurance.\nThe woman who miscarried and started to become septic at Atlanta hospital while doctors\ndebated when and if they were legally allowed to intervene to help her.\nThe teenage girl, not a woman, a girl who had to figure out how to apply for a grant\nto be able to afford to get on a plane for the first time so she could end a pregnancy\nshe could not have.\nThree over a century ago, the first woman was elected to the Georgia State Legislature,\nand since then, women have fought tirelessly in these halls for the rights and well-being\nof women and families.\nYet, today, we are under siege, access to safe abortion care, family planning, sex\neducation, and even basic medical facilities is being systemically dismantled.\nGeorgia now bears the shameful burden of having one of the nation's worst infant and\nmaternal mortality rates.\nOur counties are devoid of essential OBGYN care,\nand doctors are fleeing our state,\nfear and criminal prosecution,\nfor providing necessary medical services.\nThis is not absurd.\nIt's a crisis.\nThis must stop.\nI love Georgia, and I refuse to sit by and raise my family\nin a state that does not value the women, girls,\nand families that form its backbone.\nWe are on the brink of change.\nSince adopts decision every time the people have been given a vote on abortion rights, it has led to expansion, not restriction.\nPoliticians have been ousted, bans blocked, all by the will of people.\nThe majority in Georgia believe in safe legal abortions.\nThey believe in a family's right to make decisions without government interference.\nWhat the GOP has done in Georgia is a step too far, and we will not stand idly by.\nWe stand on the shoulders of those who fought for Roe v. Wade, women who believed in the\nsanctity of personal privacy in the control of their own bodies.\nAnd we will not let their fight be vain.\nWe will not let our medical infrastructure be frozen in the 19th century, and we will\nnot stand by as extreme laws but women's lives at risk.\nThis is our call to action.\nThis is our moment to stand up, to fight back, to ensure voices are heard.\nWe will not be silenced.\nWe will not be sidelined.\nWe will fight for our rights, for health, and for our freedom.\nWe must protect our democracy, our rights, and our bodies.\nAnd the GOP may have won a battle, but they cannot win this war.\nWe are resilient, we are powerful, and we are many.\nWe will persist, and we will prevail.\nThank you.\nWe have a couple of questions, do you have a question?\nYes, sir.\nGive our legislation and resolutions a hearing.\nLet the people actually come and speak in the people's house\nhouse and tell them how they want to be represented.\nThank you.\n",
  "updated_at": "2026-02-12T20:08:02.533194+00:00"
}