{
  "video_id": "I5pSCaP6hbY",
  "url": "https://www.youtube.com/watch?v=I5pSCaP6hbY",
  "title": "Gold as Legal Tender? Lawmakers Weigh the Idea",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia legislative session on \"Georgia Gold as Legal Tender? Lawmakers Weigh the Idea\":\n\n**Overview**\nThe session discussed a Georgia Senate bill (SB424) that would recognize gold and silver as legal tender and create a state-approved bullion depository. This would allow people to make payments through a system similar to a debit card, providing an alternative way to transact using a hard currency.\n\n**Key Actions**\n**SB424**: Bill to recognize gold and silver as legal tender and create a state bullion depository.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- Senators Marty Harbin and Sonia Halpurn, the bill sponsors, discussed the rationale and mechanics of the proposed legislation.\n- The ability to fractionally purchase and use gold as a hedge against inflation was highlighted as a key benefit.\n- The plan is for the state to oversee the depository rather than build its own, using private providers like Brinks.\n\n**Votes**\nNo recorded votes mentioned, but the bill was discussed and appears to have bipartisan support.\n\n**Attendance**\nNo quorum issues noted.\n\n**Adjournment**\nNo specific adjournment time or next session date provided.",
  "transcript": "A Georgia Senate bill would recognize\ngold and silver as legal tender and\ncreate a state approved bullion\ndepository. You would be allowed to make\npayments through a system much like a\ndebit card. Joining me is the sponsor of\nthe bill, Republican Senator Marty\nHarbin of Tyrone. He is chair of the\ninsurance and labor committee committee\nand vice chair of retirement. And his\nother committees include finance and\nethics. Also here is one of the bill's\nmany co-sponsors, Democratic Senator\nSonia Halpurn. She is Senate Minority\nCaucus Vice Chair. She is vice chairman\nof the Urban Affairs Committee in the\nSenate and her other committees include\nfinance, appropriations, education, and\nyouth. Welcome to lawmakers for this\nyear. Good to have you both here. Now,\nlet's talk about this. What problem does\nthe bill solve?\nWhy should we should the average person\ncare about gold right now?\n>> Well, gold is a commodity that has been\naround for six 6,000 years.\n>> Yeah.\n>> If you look at it, where we we look at\nthe power of what we're doing is through\nthe US Constitution. Our founding\nfathers had a lot of wisdom back in\nthose days. And article one section 10\nsays that states cannot create currency\nbut they can have gold and silver\ndepositories that are regulated by the\nstate. Therefore, if you want to put\ngold and and back in the 1800s that was\ndone, you would have money that was\nplaced there under state supervision and\nyou and I I could write a check to you\nfor a gold check. You could go to the\nbank and get your gold. And gold has\nbeen recognized for years. It's also\nbeen a hedge against inflation and it's\na it's it's a commodity if you will and\nuh here you know another part is that\nfor banks it's a tier one asset for\nbanks. Banks buy gold for a reason and\nthat is it is a stabilizing force if you\nwill in their portfolio. Now it goes up\nand down just like any other commodity\nbut the average person does not have the\nability to\ntransact business that way. Okay,\n>> here's here's a here's a coin.\n>> That's a gold coin, huh?\n>> That's a gold coin. That coin's per\nworth right at5,000 $5,000 today. The\naverage person can't come up with $5,000\nin that respect. And so what we're\nlooking at is you can buy this via a\nfintech technology. You can buy $100 or\n$50, hold it in your gold account, and\nthen through a fintech transaction,\nwhich would be a like a debit card,\nwhich is here. This technology is\navailable today. I can swipe my card,\nbuy my Chick-fil-A or my Coca-Cola, and\nthen it fractionally\ntakes my money from my gold coin.\n>> And when you look at that, this is gives\nthe how do I say any investor the\nability to invest in something that he\ncouldn't get to before. And really, it's\njust another way to pay. We have someone\nasked me, he says, \"Well, how about um\nBitcoin?\" I said, 'But Bitcoin is not\nconstitutional. And that was the issue\nthat I I look at is is it\nconstitutional? We have five states that\nhave already passed legislation. Texas\nhas its own depository. They were the\nfirst to have a depository where gold\ncould be stored. Florida, Arkansas, and\nLouis uh Louisiana, those states have\nalready passed legislation to do that.\nSo, they see that. And like I said, it's\nanother way to pay, but it's a way for\nyou to have something that's a hard\ncurrency just like this. Someone once\nsaid, land by land because they're not\nmaking any more of it. And gold has held\nits value again up and down. But\ninflationary, as we've seen inflation\noccur, and a lot of that is because\nthis, they can tax you, tax me, print\nmoney they don't have that makes your\nmoney and my my money worth less. But\ngold has been a great hedge for\ninflation. And what this does for the\ncitizens of Georgia is it gives every\nperson the opportunity to invest in\nsomething they could not otherwise\ninvest. The bill number is SB424.\nI'll say this, it's for Georgia and it's\n24 karat.\n>> I see. I had a feeling there was\nsomething to that. I love that. I love\nwhen the when the bill numbers have\nsomething cool. You you have signed on\nto this. I have. Tell tell us why.\n>> Well, you know, I just like so many of\nmy colleagues uh continue to hear from\nfamilies about affordability and uh\ninflation is pressure against their\nmoney. There are so many Georgians that\nare doing the right thing, saving money.\nThink about a family that is saving $50\na month. Well, that money, you know,\nwith the cost of groceries going up and\ngas going up and rent going up, that\nsavings actually is not growing at the\nsame pace. But the ability to\nfractionally buy gold, which has held\nits ve its value steady over the years,\nis really an interesting way for people\nto be able to protect their money that\nthey've worked so hard to earn and save\nand still have the ability to spend it\nif they need to.\n>> Yeah. and it doesn't fall apart like\nmoney does like tear or anything.\n>> And don't get me started on pennies not\nbeing around anymore. So let's talk a\nlittle bit about what the depository\nwould be about and how that would work.\n>> What we have looked at is we don't\nbelieve that Georgia needs to spend the\nmoney to build a depository per se. And\nwhat we would do is there would uh under\nthe bill we would have a committee led\nby the treasurer of the state of\nGeorgia, an appointment by the governor,\none two members by the house and two\nmembers by the senate. And they would be\nthe regulatory authority that would\noverlook the the depositories. The\ndepository could be Brinks. Brinkx is\none of the ones we've talked to. They\ncould do that instantly. So we don't\nhave to spend any capital for the\ndepository. And then the state would be\nresponsible to do the audits to make\nsure that they're handling that money.\nBut your money would be your money.\nUnlike a a bank today, your money is on\ndeposit and you are a creditor. This is\nyour money that if you wanted to do it,\nyou could go to the depository, take\nthat money out because it's yours and\nyou would pay a fee for storage and\ntherefore it's not going to cost anybody\nanything except the initial startup cost\nwe see from that standpoint.\n>> Yeah. So that's what I was going to ask\nyou. Is there a fiscal note on this?\n>> Yes, we've ordered one for it. What we\nthink will happen, you'll need maybe one\nperson to help get it started up that\nwould work for the treasury or for the\ntreasur. And basically, they would do\nthe RFP uh for the storage and the RFPs\nfor the fintech technology to do the\ntransactional goal from that standpoint.\nAnd it's up and running right now. Um,\none of the companies that's up and\nrunning and does a really good job thus\nfar has been uh um Glint and they are in\nEngland and that's where my money\ncurrently I have gold there and I can go\nin and swipe my card and buy Chick-fil-A\nwith gold. What a what a novel idea.\n>> So it it wouldn't be a different card or\nor anything. No special card similar to\nwhat we're used to using.\n>> Yeah, it's I mean this is an actual card\nright here,\n>> right? and I could take that and buy\nwhat I want to buy and then fractionally\nthey take it off of my gold account\n>> and they charge that. I believe that\nthat's something that can be negotiated\nwhere the fee should actually be less\nfor this possibly because it's backed by\ngold. It's not a credit card. It's\nbacked automatic. So I think that's a we\nwe would do this. We we'll do an RFP\nfrom the state to say who who what are\nthe prices and we could have multiple\nstorage facilities but what we want is\nyou want to be constitutional. We need\nthat to be regulated by our treasur and\nthe and the board there and then have\nvendors that we could do to do do our\ntransactions with from that standpoint.\n>> Okay.\n>> It's just another way to pay.\n>> I I see that. So So some places have\nsaid this is kind of symbol symbolic.\nWhat do you say?\n>> I say it's not symbolic at all. I mean\nat the end of the day people are feeling\nthe pressure. Their money is not going\nas far. And really think of this as like\nthe piggy bank for the modern economy.\nUm and gold holds its value. So over\ntime, gold has steadily held its value.\nIf I were to have saved $400 in um the\n20s and could buy a suit, a belt, a\nshirt, boots, and a hat. Well, that same\n$400 today can't do that. But if I had\nthat same $400 in the whatever the\nounces of gold would have been at that\ntime, I could still in fact buy all\nthose things today because the gold\nholds its value. And even though it can\nfluctuate, it holds its value over time\nagainst inflation.\n>> Yeah. So we talked, let's talk about the\nfluctuation the other day. It made the\nnews because it dropped dramatically.\n>> Yes. I said this, if you bought it last\nweek, you're sad. If you bought it last\nyear, you're happy because it has\nmaintained its value. I mean, if you go\nback a year ago, it was in the 28 $2,800\nan ounce. Uh, it closed today in the\n4,900s. So, I mean, it's it's still been\nthere. And if you look at it, it's uh\nit's still a stable value that you hold\nthat has a value that's uh not like a a\ncompany can go bankrupt, a stock can go\nbankrupt. It's something that's there.\nAnd it's like I said, 6,000 years of\nhistory is backing up that people desire\ngold and it's a value.\n>> So, do you expect like a a gold rush?\nLike people are just like gonna grab\ngoamn like you know.\n>> How about this? There there's gold on\nthe gold dome. There's 80 oh 80 plus\nounces there. So I say if the dome\nshould be covered with gold, the people\nof Georgia should have their own gold.\n>> Okay. That's the slogan going there. You\nagree with that? That's the slogan going\nforward for all of this. So yeah, you\nguys you get you got a lot of interest\nhere.\n>> We want to make Georgia gold. We believe\nthat it's a good thing and that's that's\nwhat's happening. It gives and it's like\nthis this is not this is not for rich or\npoor. It opens the door to people that\ncouldn't get in otherwise. And I think\nit's just good economic sense to be able\nto have diversification.",
  "updated_at": "2026-02-14T14:46:28.783415+00:00"
}