{
  "video_id": "I9l8wO63nXU",
  "url": "https://www.youtube.com/watch?v=I9l8wO63nXU",
  "title": "House Day 39 of the 2025 Legislative PM 2 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 189,
  "summary": "Here is a summary of the key points from the Georgia House Day 39 of the 2025 Legislative PM 2 Session transcript:\n\n**Overview**:\nThe session focused on routine procedural matters, with the main action being the consideration and passage of a bill related to annexation dispute resolution procedures.\n\n**Key Actions**:\n- **HB 155**: Revised procedures for the selection and objection to arbitrators in annexation dispute resolutions. The House agreed to the Senate's substitute with a House amendment.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- There was some parliamentary inquiry and discussion around a local bill (HB 862) that was being reconsidered, with members questioning the voting procedures.\n- Discussions around the need for local delegation members to be provided copies of local bills prior to consideration on the floor.\n\n**Votes**:\n- HB 155: Passed the House 130-35 after agreeing to the Senate substitute with a House amendment.\n- Motion to reconsider HB 862: Failed 67-96.\n\n**Attendance**:\nNo specific quorum notes.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned. The next session date is not provided.",
  "transcript": "Okay members, I think the rules committee has finally made its way back home. We do have a supplemental local calendar that has one bill on it. We sent several bills back to committee but only one has returned on the local calendar. Third reading passage of uncontested local bills of a local bill. If there's no objection we will vote on the local calendar as one bill this on it with the recorded vote. Hearing none it is awarded. You're fine. Mr. Clerk will you read the local calendar? HV 862 by Representative Jackson of the 68th Fulton County. Is there any objection to the previous question being ordered on the local calendar? Hearing none the previous question is ordered. Is there any objection to agreeing to the report of the committee which is favorable to the passage of the bill? Hearing none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machines? Have all members voted? Have all members voted? Yes, sir. Mr. Clerk will you lock the machines? On the passage of the supplemental local calendar the yeas are 63 the nays are 88. The purpose is represented by the huggler. Reconciteration, Mr. Speaker. The lady has made a motion that we reconsider House Bill 862 on the lady's motion that the House reconsideration and giving and failing to give House Bill 862 required majority. All those in favor of reconsideration will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machines? For what purpose is representative Jackson rise? Parliamentary inquiry. Mr. Speaker. My inquiry Mr. Speaker is we have been voting yes on all local bills. So why are we voting in the opposite right now on this local bill? General Monos I have one vote and you have to take that up with the member, sir. The purpose is representative registration rise. Parliamentary inquiry Mr. Speaker. Mr. Speaker is not true that hb 862 proposes to make one share of the highest paid share of in Georgia, disproportionate to other office holders across our state. I'm sure the gentleman knows what he speaks for what purpose is representative hugely rise. Parliamentary inquiry Mr. Speaker. State your inquiry. In that you're Mr. Speaker, this is a local bill and we have been showing courtesy to local bills all session long. And what we're asking in this moment is for this bill to be reconsidered for to come back up later and the locals can have an opportunity to try and work it out with the members as we have been doing all year. I'm sure the lady believes that that to be true and I think there's some proof of that. The minority leader, Hugh Glee, the information that I receive is it procedurally since we had already moved in the reconsideration that that's not a stop possible later to pull it back now at this point in time. We'll have to continue with the vote, finish the vote on the reconsideration. I'll take two more parliamentarians, one's from Representative John Jones, Representative Jones, to recognize for what purpose is later your eyes. Parliamentary inquiry. State your inquiry. Is it not true that as a member of the Fulton County delegation, it is a key provision of our rules that before a local bill is put on the floor, every member of that delegation shall be provided a copy. And although I can only speak for myself, I never did receive a copy and that is why I will explain my note. I'll take one more parliament inquiry from taking explain his local legislation. This will be the last parliament inquiry from RIPPing Jackson. Parliamentary inquiry. State your inquiry, sir. Is it not true, Mr. Speaker, that I fulfill the obligation in accordance with Fulton County delegation? I provided the chair of intergovernmental chair, a copy and I've also provided a copy to Fulton County delegation. Those are the two requirements in accordance with our delegation rules. The gentleman, I'm sure the gentleman is doing everything he said, that's why the chair, the speaker put it on the calendar day has local legislation. The rest of that is up to you guys. Now if all members voted, all members voted, if so, Mr. Clerk, will you lock the machine? The motion to reconsider the ladies' motion to yeas are 67, the nays are 96, the motion is lost and then the house is failed to reconsider its action. Okay, members. House will come to order. We're waiting for a couple bills to come on the, get on the floor, get ready to put on the floor. We'll be on your voters shortly. We're going to take up a couple of, agrees, disagrees. Okay, members. Representative Anderson is recognized for a motion. Thank you, Mr. Speaker. I move that the house agree to the Senate's substitute to House Bill 155 as amended by the House. Mr. Clerk, will you read the caption? House Bill 155, by Representative Anderson, attend to being titled, act to amend Article 7 of Chapter 36 and Title 36 of the fiscal to Georgia and it's headed relating to procedure for resolving annexation disputes. So it was the revised procedures for the selection and objection to arbitrators. Representative Anderson is recognized to explain the substitute, Senate substitute at the House amendment. The gentleman's recognized. Thank you, Mr. Speaker. Colleagues, we voted out House Bill 155 and Senate to the Senate. This was a follow-up to a 2022 bill. We had an annexation dispute resolution, the original bill expanded the pool and expanded the opportunity for DCA to appoint the resolution arbitration panel. The Senate, we worked with the Senate with a substitute that included the inclusion of House Bill 318. House Bill 318 passed out of committee this year, was considered in committee last year, made a lot of changes and improvements to it. It made it into our rules, but wasn't able to get it out of there on the crossover days, so we included that. What it does, again, it's a follow-up to a 2022 bill, which, excuse me, dealt with permitting and it allows special administrative permits to go back to its pre-2022 methodology to allow them to truly be administrative. The second thing the Senate did was they added a provision that takes the last option in code for a, what we call a spoke annexation, which is a municipal annexation provision, it's kind of an obscure provision in code, and added a further provision in there that would require a countywide referendum for that to go into place, only for that scenario. The amendment we're making in the House adjusts that last part, where that provision was put in by the Senate, it would catch a few scenarios that we didn't want to catch, we only wanted to cover the spoke annexation, so the House amendment limits that referendum provision to only the spoke annexation portion. Mr. Speaker, I'll yield for any questions. Someone has a question to your left. Representative Park, can I ask for a question? Is it not true that $50 million were taken out of Fulton County schools this year by a legislation? Does the General Lady ask me to yield? Thank you, Mr. Speaker. Do you yield? Yes. Is it not true that there were $50 million taken out of the Fulton County education budget this year? I am not sure. I'm sure the General Lady knows what she speaks, but I'm not familiar with that. The General has no further questions. Thank you, Mr. Speaker. I'll yield the well. Thank you. The General is yielded the well. Is any objection to adoption of the House amendment? Here he learned the House amendment is adopted. On the General's motion, the General's motion to the House agree to the Senate's substitute to House Bill 155 as amended by the House, all those in favor will say yes. Those opposed will say no, Mr. Clerk, will you unlock the machines? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machines? On the General's motion, the Yezard 130, the Yezard 35 in the House has agreed to the Senate's substitute to House Bill 155 as amended by the House. Representative Martin Newton, German Newton has recognized for a motion. Thank you, Mr. Speaker. I move that this House accept the Senate's substitute to House Bill 136 as amended by the House. Mr. Clerk, will you read a caption to House Bill 136? House Bill 136 by Representative Newton, 127th and others to be entitled to amend Chapter 7 of Title 48. I leave fiscal to Georgia and it's ended related to income taxes, so it's expand the tax credit for contributions to foster child support organizations. Chairman Newton has recognized to explain the Senate's substitute and the House amendment. Thank you, Mr. Speaker. House members, we did pass House Bill 136, 172 earlier this year. This is this supports organizations that assist our former foster youth as they try to navigate the transition to adulthood. They wanted to strengthen and streamline the program to help with tuition, housing and food transportation. The Senate did add some good changes. They recognized another problem we have is the cost of raising children in today's and the cost of childcare. They added Senate Bill 89, which also passed the Senate 49 to nothing. It was a revenue-related policy, so it deals with adding a tax credit, increasing the tax credit for childcare, increasing up to $250 extra dollars for children under age six, and then an incentive plan for corporations who contribute to local childcare organizations to help with their employees to deal with just the skyrocketing childcare cost. The House amendment does one thing. It does return to 80% the amount that passes through to the student of the money donated in the foster support organization from 90% that the Senate had changed it to. So that's the bill, that's the addition with the Senate and the House amendment to get it back to what it is now. 80% of the money must pass through to the youth. That's the bill, Mr. Speaker. Gentlemen, has a first couple of questions with a yield? Certainly, yes, sir. We're going to say Stacey Evans to your left is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. My first question is about the amendment on lines, 333-351-373. I read this to say that we are now going to allow these organizations that were providing the foster services to use up to 20% on administrative costs as opposed to direct services instead of the 10, which is what the bill was when it passed the House, which was very appealing to me, and I was wondering why they changed. Actually it passed the House at 80% and that's what the current requirement is in the program that exists, the Fostering Success Act. We did send it over and it got amended in the Senate to raise that to 90. We had discussed that. It was recognized that supporting these foster, former foster children, even though they're no longer children, there's a lot of background checks, there's a lot of organization assisting with Pell grants and other things the youth may be eligible for in place of tuition, assisting with transportation, nutrition, housing, that does require a little more organizational support. All the organizations who do this really needed that maximum of 20% to be eligible for administrative cost so as to meet all those demands for assisting young people in this and in otherwise dangerous and complicated time. Would you yield for a follow-up on that point? Wouldn't that be direct services though if you're actually working on the Pell grants and the transportation, all that, administrative to me is like overhead, lights, buildings, things like that. Why are we wanting to have that be at a higher amount? The biggest part of the overhead for these organizations is the trained staff that are assisting with the organizations of arranging mentors to meet with these youth for arranging all those other items that I mentioned. So that is considered overhead, the staff salaries is part of the overhead of these organizations. 80% of the money, and that's a minimum, 80% has to go to the places directly for the student like housing, nutrition, transportation, tuition and things like that. A maximum of $100 a month can go to a mentor, which is a crucial part of this because obviously many of these foster kids have been in multiple homes and they need some adult supervisor. That's helpful. Will you yield for a question on another area of the bill? Yes ma'am. Online, 125, and I acknowledge this was in the original bill. It's just something that I didn't catch the first time around. The way I read this bill, including the definition at line 125, I know an individual can get, there can be tax credits for this, but it looks like the only business eligible, is an insurance company, why is that? Okay, that's a good question. It is not the only business entity. Entities that pay income tax are eligible for this income tax credit. This line 125, you're referring to the new definition in this for business enterprise, are companies that do not pay any income tax. They are not taxed in that way. They're taxed through premium taxes. This allows them, just like an organization or a corporation that pays income taxes, it allows them to get the same credit, but against their premium tax, since they don't pay any income tax. So they won't get any more in the last, there's just a different kind of tax? Absolutely. Okay, very helpful. Thank you. Thank you for your questions. I appreciate your support helping our foster children and our parents and our employers who are trying to keep our employees child care expenses reasonable. Thank you, Mr. Speaker. Gentlemen, yielded the well. Is any objection to adoption of the House Amendment? We're adjourned to the House Amendment is adopted. On the gentleman's motion that the House agreed to the Senate's substitute to House Bill 136 as amended by the House, all those in favor? We'll vote yes, all those opposed. We'll vote no way, Mr. Clerk, will you unlock the machines? All members voted. All members voted if so, Mr. Clerk, will you lock the machines? On the gentleman's motion, the yeas are 163, the days are four, and the House has agreed to the Senate's substitute to House Bill 136 as amended by the House. We're representing Chaz Cannon's recognized for a motion. Thank you, Mr. Speaker. Will you read the caption? House 129, my reps of Canada, 170 second to be entitled next to the man code section 485, 7.4, the fiscal to Georgia annotated relating the preferential assessment for bona fide conservation use property. Members of the House, if you can recall, earlier last month, we passed House Bill 129, which addresses some allowances for the leasing of farm land by non-family farm entities, as long as that remains in agriculture or use. I'm trying not to use the work of, I told my folks I wouldn't use the work of. Added section 1 of the bill. The Senate added in section 2, which re-incorporates the post-production film tax credit as a quick refresh on the post-production film tax credit. It passed this body in 2017 and an extension to the original credit passed this body in 2022. The key provisions of the new language in section 2 of the bill do about three things. It extends the sunset for the credit out to January 1 of 2031. It caps the credit at $10 million and it requires that any post-production activities and the post-production company be located in Georgia to be eligible to receive the credit. There's also some additional what they call up lifts for post-production if it takes place in more of our rural areas, specifically in our tier 1 and tier 2 counties. As you speak, that's the summary of the changes of section 2. The Senate substitute now will stay in for any questions.\n\nThe gentleman has no questions. I will yield the will. Thank you, Mr. Speaker. All the gentleman's motion that the House agree to the Senate's substitute to House Bill 129. All those in favor will vote yes, those opposed will vote no. Mr. Clerk, were you in lock the machine? For what purpose is represented Carson rise? For students who rule 133, I asked to be excused for this vote. The gentleman has that right and the general will so reflect. Mr. Clerk, were you in lock the machines? Have all members voted? All members voted. Mr. Clerk, were you in lock the machine? All in the passage. The yeas are of House Bill 129. The yeas are 149. The nays are 13. The House has agreed to the Senate's substitute to House Bill 129. For what purpose is represented Anderson rise? The motion. I move that Senate Bill 12 be recommitted to rules. Mr. Clerk, were you in the caption? Senate Bill 12 by Senator again, of the 47th to be entitled to amend Article 4 chapter 18 to title 50, the physical to Georgia and to relate the inspection of public records. All in the gentleman's motion, that Senate Bill 12 be recommitted to the rules committees. The objection. Here he noted is awarded. The motion. The motion. The motion. Back on the rules, calendar, Mr. Clerk, were you read the caption to Senate Bill 2020? Senate Bill 20 by Senator Patrick. The 30th to be entitled to amend Article 7 of the chapter 3 to title 20 of the physical to Georgia and to be entitled to amend Article 7 of the chapter 3 to title 20 of the physical to Georgia and to relate the scholarships, loans and grants. The motion. The motion. The motion. Thank you, Mr. Speaker. The motion. The motion. The motion. The motion. The motion. The motion. The motion. The motion. The motion. The motion. The motion. The motion. A line 2 15 through line 2 23. As we speak about the specific issues, the specific permanent injuries, where did these specific permanent disabilities come from? That's a great question. So what I'm going to do, I'm going to allow Chairman Peacher, he's going to come up after me. This is part of his bill that he worked on incredibly hard, House Bill 56 that passed this House unanimously. Again, sections one through three are House Bill 56. The one Senate bill I'm 20, I'm referring to, begins in section four. Okay, so I'm sure he's going to be glad to speak to that information after me. Okay, do you yield for another question? One more question. Awesome. Line 396, speaking about the board, adopting rules as are reasonable and necessary. What types of rules and regulations are you speaking to in this last line of the bill that you're very well aware of? Sure, yeah. I think this is consistent with any of the boards that we have. In fact, it's a great segue. I know we've got a bill that's been floating around here, Senate bill 28. It's going to look at a lot of the rules and regs that are promulgated by our boards and give the legislature to opt for any to opine on those. But this is no different than any other committee and commission in the state that promulgates rules and regs based on the legislation that we pass. Respectfully, if you yield again, I'm asking related to these veterinarian texts, can you please address specifically the rules or regulations that you have put into this legislation that you're saying that the board will adopt in this legislation. Other than not speaking of another bill, we're not on that bill. We're on this bill. I'm guessing I outlined the question again before we add. Line 396, the board shall adopt such rules and regulations as are reasonable and necessary to implement their provisions of this part. What are those rules and regulations? The board will come up with those as appropriate. Mr. Speaker, I know we're late in the evening. Go ahead. I'll take one more if you'd like. You got a lot to do with the gentleman. The gentleman can do with the police as he has a lot of questions if we have a speaker on the bill. I know we've got a speaker who can address the first three sections of the bill, so I will yield the well to him to address those. Thank you, Mr. Speaker. The gentleman is yielded the well. We do have one speaker on the bill. Chairman Petrie, and I'll give you up to five minutes. Up to you. Thank you, Mr. Speaker. I think I can be very brief. My friend, House Bill 56, we passed in this body twice last year and this year is now incorporated in SB 20. Unfortunately, it wasn't pulled in the Senate, and so we're trying to save this bill. This is a bill as a reminder that adds spouses to our public safety memorial grant for individuals killed in the line of duty or permanently maimed in a lot of duty. That includes police officers, firemen, correctional officers, officers, etc. And it also has, as a question was alluded to earlier, a new section that we added to capture public school employees that might be killed or permanently disabled in the line of duty as well. But this grant does in both instances is the same thing. It provides tuition, free tuition to the children, and now the spouses of those individuals. That very simply is what you voted on before, unanimously, and that is what is now incorporated into SB 20. If there are any questions, I'm glad to answer the Mr. Speaker. Okay, the gentleman yield represent the Hewglie. Leader Hewglie has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Is it true that I want to thank you for incorporating teachers, our school personnel, and to this bill is sad that we live in an era where that would need to be required. But I'm certainly appreciative that it is included in this bill. Is that not true? Yes, ma'am, and I thank you so much for your strong support and effort. It was a great ad. Gentlemen, yield? I yield for one more, Mr. Speaker. Let's see if you're going to take one more representative, Martin, excuse me. Representative Reeves was ahead of Representative Martin, representing Matt Reeves. Yes, sir, are you? Isn't it true that this bill will help recruit and retain more young veterinarians by alleviating their debt burdens they can afford to work more in public service such as animal shelters and helping low-income pet owners? Yes, sir. Representative, that is my understanding, however, that is a portion of the bill that came out of the Senate, not in my 56. But I do believe you to be correct. Mr. Speaker, if that is all I'm going to yield the bill. Well, thank you. Gentlemen, yielded the well. Is there any objection to the previous question being ordered? Hearing none of the previous questions ordered. Is there any objection to adopting the substitute offered by the Committee on Rules? Hearing none of the Rules Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? Hearing none of the report, the Committee's agreed to. Shall. This bill now pass all in favor of the passage of the bill. Will vote yes, all those opposed. Will vote no. And Mr. Clerk, will you unlock the machine? All members voted. All members voted for what purpose is representative Jackson, Derek Jackson, rise. Thank you, Mr. Speaker, parliamentary inquiry. Station inquiry, sir. Mr. Speaker, isn't that true? Since this body is very concerned about salary and money, online 147-148, it says no person shall be eligible to receive a grant, not to exceed $72,000. None of the speakers that presented this bill, Mr. Speaker, told us how many individuals will be eligible for that grant and is there fiscal note. So if we have 100 Georgians to apply for this grant, will all 100 Georgians get $72,000? Is that not true? I think the gentleman read that correctly and there will be grants, will be to eligible students for what purpose is representative Barnes, rise. Parliamentary inquiry. Station inquiry. Is it not true that with the increase of veterinarians in this bill that we will need vet techs as well? I think the lady knows about veterinary medicine evidently, so we need vet techs too. I would agree with the lady. For what purpose is representative Martin, rise. Parliamentary inquiry, Mr. Speaker. Station inquiry. Is it a true Mr. Speaker that to qualify for the grant, the gentleman just question a person would have to lose their spouse as a public safety officer to death or disability to provide for this? And is it further true, Mr. Speaker, this bill in its current form helps the families of those people we saw earlier today that we asked, we named those intersections and rose to do, it is a further not treatment speaker that this is something that we are doing for them and there is a fund that is well funded to do that. So is it not true? I'm sorry, Mr. Speaker. One more inquiry. Yes, sir. Is it true, Mr. Speaker, that I stand here today glad that every Georgian is not eligible for this grant? I'm sure the gentleman believes of everything he just stated. Have all members now voted? Mr. Clerk, where you locked the machine? On the passage of Senate Bill 20, the Yees are a 160, and the age are five. Bill Henry C. DeRec was a constitutional majority. Is there for a past? Mr. Clerk, will you read the caption to Senate Bill 46, 46? Senate Bill 46 by Senator Harbin of the 16th and others to be entitled. Back to men chapter 1, a total 50, the fiscal to Georgia and the general provisions relative to state government. So to improve government service delivery in this state, this bill haven't been assigned to the committee on budget. The fiscal affairs oversight that committee recommends the dis bill do pass. Representative Bonner has recognized to present the bill. Representative Bonner. Thank you, Mr. Speaker. Colleagues, today arise to present Senate Bill 46. The government serves the people act. This bill aims to improve government service delivery by embracing modern practices and technology found in some of Georgia's leading companies such as Delta Airlines, Home Depot, Chick-fil-A, UPS, and Coca-Cola. These companies recognize that being customer centric is more than providing a good product. It is being responsive to feedback and implementing corrective action. Senate Bill 46 operates under the principle that you can't manage what you can't measure. The bill has three main goals. First, it creates a state government services delivery lead within the Georgia technology authority to oversee efforts to enhance interactions between citizens, businesses, and other state agencies. Second, it requires each state agency to designate a senior official to be responsible for internal service improvements to ensure a more seamless experience for Georgians. And then third, it requires an annual report to the governor and general assembly on all current and future government service delivery improvements that are planned. Taken together, this bill would lead to more efficient and effective delivery of government services. When you think of companies that I mentioned oftentimes and you have an interaction with that company on the phone, there's a survey that's offered that round two. Round two. Here we go. I can't talk much faster. So when you deal with some of these companies, there are often times there's a survey after your initial interaction. Other companies use somewhat more passive technology to determine weight times, how fast calls are dukkated things like that. So this will provide the opportunity within the Georgia technology authority to work with our other state agencies to make those improvements and make those recommendations. So at the end of the day, our delivery is a lot more efficient and more of our constituents are getting served in a faster manner. With that, Mr. Speaker, I will answer any questions. The gentleman has a couple of questions. Representative Bernal to your left. Thank you, Mr. Speaker. Does the gentleman you? I do. Does this mean that the state of Georgia will be updating their technology because we know that when he came to unemployment and the SNAP benefits that one of the problems was that they could not get online, they could not get answers. So is this going to put the money in and update our services? How come? So there is money projected for those types of improvements. What we will receive from that first annual report of this, what's being created is feedback on what technologies to implement so that we can provide faster customer service. So answer question yes, but I can't say exactly what that technology is going to be right now. We're going to have to study it to make sure we get the right things in the right agency. Does the gentleman you? I do. So in the meantime, we're still not going to be given those individuals in unemployment and SNAP benefits the service that they need until after we do a survey. Well I would say this is a necessary first step in that improvement. Being in this bill however prohibits every individual state agency from already making their own improvements until such time as we get a consolidated picture across the state. Thank you. Gentlemen, you all to a question? Well, you represent your home. Represent your home. Director, I ask your question. Thank you Mr. Speaker. Does gentlemen you? I do. I'm just curious about lines 59 and 60. In states collect and report qualitative and quantitative information or data on government service delivery through existing reporting mechanisms. The first question is can you describe I'm not familiar with it. What are our existing reporting mechanisms? So I would say that those are any technology we currently have to monitor how much time people spend on hold, the length of a particular call and then the number of constituents that are served in a given period of time. Okay. In terms of the qualitative and quantitative information, I suppose that the quantitative would be along those lines and then the qualitative might be surveys on customer satisfaction. I would say that's definitely an option. Also I think you can put in that qualitative category whether or not these issues are actually getting resolved. Okay. Thank you. All right. With that Mr. Speaker I'll yield the well and ask for your favorable consideration. Gentlemen as you will the well. Is any objection to the previous question to be in order? Here in none the previous questions ordered. We do have a minority report. Minority report is waived. Is any objection to a green to report of the committee which was favorable to the passage of the bill. Here in none the report of the committee has agreed to shall. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. Will you unlock the machine? Have all members voted. All members voted. What purpose is represented Campbell rise? Thank you Mr. Speaker. Mr. Parliamentary inquiry. Mr. J. Gouard. Is it not true that in committee when the technology association of Georgia was asked to testify that they in fact encouraged that hold on this and that more planning be required. And is it also not true that the fiscal note for this was less than $500,000 with $120,000 allocated for the actual technology that is described as my colleague mentioned online 59 through 62. And is it also not true that this is one additional layer on top of the layer we already have in the technology association of Georgia which has an annual strategic plan that is already engaged in this work. I'm sure the lady was in the committee meeting. I wasn't so I'll take your word. What you heard in committee for purposes represented Gouard rise. Parliamentary inquiry. Mr. J. Gouard. Isn't it true that this bill just brings transparency and accountability to how state agencies treat Georgia citizens and businesses? I'm sure the gentleman believes what he speaks. Have all members now voted. Yes. So Mr. Clerk will you lock the machine. All the passage of Senate bill 46 to 8 or 128. The nasa 35. The bill has any requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to Senate bill 3636. Senate bill 36 by senator Satslour the 37th being titled an act to amend title 50. The office goes to Georgia and it's a related state government. So it's to provide for the preservation of religious freedom. This bill I refer to the committee on judiciary that committee recommends this bill do pass. Representative Tyler Paul Smith has recognized to present the bill. Thank you Mr. Speaker. We'll get evening members of this most august body. I wanted to make sure I didn't leave that out earlier. I wanted to make sure you're august in my mind and in my heart. And so the way of the time I get up here. But I'll get to it. Today I bring to you Senate bill 36 otherwise known as the religious freedom restoration act. Senate bill 36 protects ordinary folks in our state from unfair state and local government intrusion by exactly marrying our bipartisan federal referral law in a way that protects people from unfair federal government intrusion. Under the federal referral law that was passed almost unanimously in 1993 the United States Supreme Court ruled in 1997 however in the borne case that federal refer only protected people from unfair federal government intrusion and would not protect people from unfair state or local government intrusion. As then 39 of our 50 states have adopted their own refer laws or seen their high courts adopt state refer protections by judicial ruling to protect people from unfair overreach by state and local governments. In 2017 our attorney general confirmed that without a refer law on our books Georgians do not have those full religious protections allowing state and local governments to infringe on people's faith for any rational basis. Since 2021 eight states have passed state refer laws South Dakota North Dakota Minnesota West Virginia Utah Iowa New England and Wyoming most would bipartisan and many would near unanimous votes. While the first amendment freedom of speech press and assembly receive full legal protection in our state without a state level refer law free exercise of religion and Georgia currently receives the lowest level of legal protection. Other laws provide full legal protection to people of faith on military bases within our state and also within our state prison system. Granting conviction fills a higher level of legal protection for their religious rights and then law of Biden citizens here in the state of Georgia. Refer puts the first amendment right of free exercise on same level as the first amendment right of freedom of speech similar pressed by creating a balancing test to weigh a person's right to practice their faith versus the government's power to limit their actions. I would note members that there's been a lot of discussion on this and I've had a lot of questions on it and I appreciate every question I appreciate all the conversations we've had even with those that may still oppose this. I appreciate the conversation so far. I want to make very clear this is not a license for private citizens to discriminate against private citizens. This prohibits the government from burden religious burdening religious exercise in our state. I'll go through if you look in line 29-339 I'll go over this test. It says that the government cannot substantially burden religious exercise even if it's via a neutral generally applicable law unless a specific exception applies. Burdens on religion are only allowed if there is a compelling government interest and it's done in the least restrictive way possible. This would also provide standing for individuals to assert this law in quarters either claim or defense when this is a government. I'll say it again a government burden on a person's free exercise of religion. Put it another way the government must show it has a compelling interest in burdening someone's religious practice and second it must prove that it's doing so in the least restrictive way possible. I'll note your attention real life application always like that always like to give anecdotes. Courts have held that the government could not force a men and women honor of a Pennsylvania wood products manufacturing company to purchase and provide for drugs and devices for employees that violated its faith. Another example would be Mary a 60-year-old grandmother from Kansas who qualified for a liver transplant was a devout Jehovah's Witness faith that forbids blood transfusions. She'd Medicaid refused to pay for a lower cost liver transplant out of state and the brisket where it could be done without blood transfusion. Without state refer a protection she would be denied the ability to receive a liver transplant and unfortunately died after the years long judicial process in Kansas courts. Another example, Philharmonen Holmes faith-based halfway house for prisoners was allowed to continue offering its ministry after the local City Council changes the cities zoning law to try and shut down the home. Another example just to the south of us in Florida we had a Muslim woman who had refused to remove her full face veil for a driver's license photo and that it was alleged refer it required her full face to be shown but she allowed for the photo to be taken in a private room with a female photographer which would not violate the tenants of her faith. I would say that refer does not determine outcomes but ensures that people do have a fair consideration when the state or local government action impacts their faith. Miss Speaker I know there's going to be a lot of speakers to this and I don't want to belabor it I don't want to give everybody their fair time and I would yield for a couple of questions if there are any. Okay gentlemen yields for a couple of questions we can do that. Sir to your left, Representative Hethner has recognized for a question. Thank you Mr. Speaker to the gentleman yields. To my friend yes. Sir is it not true that I am a first generation born with the right to vote military veteran? I believe that would be true. Does the gentleman for the yield? Oh you for no. I am the third generation of my grandfather who was a World War II air and Navy veteran and my father who was a Vietnam Army veteran. So what I'm going to read to you is an excerpt from the oath that you take when you enlist. I do solemnly swear that I will support and defend the Constitution of the United States against all enemies foreign and domestic and that I will bear true faith and allegiance to the same and that I will obey all orders of the President of the United States and all the orders of the officers appointed over me. That bearing true faith means that everybody that I am defending and protecting has the right to express their faith is that not correct sir? That is correct and I would appreciate the General Ladies family and your service as well to our great country. I would note that this law protects whether your Christian, Muslim, Buddhist, Hindu, Jew, Rostrpharian, it protects all of those. Will you give me one more moment sir? I will follow. What I've stated to you means that my father and my grandfather served in what a uniform of a country that did not allow them to vote. They protected and defended with their life because it was the right thing to do. Thank you sir. Thank you for the question. I would like to give one more. Give one more representative Lynn Smith of the Center Island, representing Smith.\n\nThank you, gentlemen, you. To my friend across the great Chattahooji, yes. So is it not true that my question is to clarify something I've been hearing? Yes. And in this particular instance, there is fear that someone with a criminal intent can form a church under the guise of religious freedom and get away with that. Do the laws of the state apply to a church, even under the name of religious freedom? They would, the church would not be exempt to do harm to persons. If you'll find in our state constitution, we take the protection of persons in this state very seriously. So this would not thwart the protection of persons in our state. And I thank the general lady for her question. Miss Speaker, I know that the hours late and we have a lot of speakers. So I will yield this oil to allow others to speak and ask this body's favorable consideration. The gentleman is yielded the well. Members, we have a number of members signed up that are speaking to opposed to bill. We're going to allow up to 30 minutes total for those members to speak to the bill, 30 minutes total for those to speak. We'll begin with Representative Ramon. Representative Ramon is recognized to speak to the bill. Is that 30 minutes for a speaker? Is that 30 minutes for each of us? No, no, you have about six minutes. You've got to police yourself on this. Thank you, Mr. Speaker. Our colleagues today arise in strong opposition to Rifra as we are now colloquially calling it or Senate Bill 36. In the early 2010s, this body lost its ever loving mind when people found out about the Muslim faith apparently is the best way I can explain it. And what we saw around the country was a flurry of bills desperate to deal with this issue that everybody started putting on every mailer and every ad. And everywhere I looked about, Sharia law has come to America. I was surprised because for me, Sharia law is Islamic jurisprudence. It's not a country's legal system. It is my faith traditions calling to us to do things like feed the hungry. Help the poor. Visit the sick. Don't do interest because it's bad. That is what Sharia law was. And for years on end, there were actually some cases where various versions of these anti-sharia bills passed accidentally nullifying people's marriages. This body actually considered bills like that in 2012. House bill 242. So imagine my surprise when I start to hear my faith and my people being used as justification for this bill. Genuinely and deeply shocked. Because to be honest, the only reason I remember what happened 13 years ago is because I and other kids like me, because of things we do in this body, got relentlessly bullied for it constantly. The thing is, kids might not be watching the live stream that we have here going on. But their parents do. Their parents repeat what we say. Their parents repeat what's going on. The news repeats what's going on. They're exposed to that kind of language. So when I see a bill like this one, and I'm told, you know what, you're religious minority. This is good for you. It is deeply, deeply shocking to me. What part of it is good for me? Are you telling me that after this bill passes, as we start to enforce our religious faith on everybody, we're going to have kids doing the five daily prayers every day? Is that what's going to be happening? Are we going to have Ramadan for everyone from now on? I don't think so. To me, that is not how you practice your faith tradition. Practicing your faith tradition is not forcing other people to comply with what you want. Because let's be clear, we heard that this bill is not discriminatory. If it's not discriminatory, why was the amendment to ban discrimination rejected in committee over and over and over again? In fact, there was a whole process trying to amend this bill to ensure that discrimination and issues of discrimination would be addressed. I just can't. Today has been such a fascinating day to me because frankly, I'm at a point I'm speechless. But let me also say this. Right now, in our state, when we talk about protecting people's religious freedom, our prison system that we talked a lot about today forces Muslim prisoners to starve until civil rights organizations sue those prison systems to allow them to eat at sundown during Ramadan. Ask me how I know. Ask me about my uncle that came out 40 pounds lighter because he was picked up by the immigration system for a while, a year actually, in 2014. The other thing I will say is that speaking about religious freedom and religious minorities, it's ought to me that this bill in particular is being brought by those who say that all they care about is protecting life. And I know you all thought I was joking when I was explaining that in my faith, in the Muslim faith, a woman's life is prioritized when she is pregnant. I am required if I am pregnant and I fall ill. It is a requirement upon me. My body is a commitment that I make to God to take care of. And if God forbid I get pregnant and something happens, I am required to seek the medical care needed to save my life regardless of where I am in that pregnancy. This bill says the least restrictive. That was not a talking point. I actually said that as a fair and honest warning that there are now laws and cases being tried around the country related to this. So yeah, maybe I should rename this the reproductive freedom act restoring reproductive freedom. Apparently that's what we're doing today. I know that's not a joke by the way. I'm not making this up. I've talked to several lawyers about this. We cannot keep doing this. We cannot keep messing with people's lives like this. But for God's sake, please do not ever, ever use my people for this. I am not selfish. I will not be voting for this. Even though it will absolutely benefit my community, but not in the ways that you think and not in the ways that you would support. Thank you, Mr. Speaker. I yield the one. The lady is yielded the way. A rep's a limb is recognized. Speak to the bill. Reps a limb. Thank you, Mr. Speaker and good evening, everyone. I rise to oppose SB 36. I wanted to begin by saying I understand what it is to feel so deeply about something that is so antithetical to your faith, your belief, your values and your identity that you cannot imagine yourself doing it. I think we all can. I grew up in Catholicism and it has been a wellspring of how I treat others. This religion and my parents are primarily what taught me to try to understand others. It informs how I conduct myself here, as you all know, including my acceptance that notwithstanding concepts like free will or personal responsibility, people are the way they are and believe as they do for a reason. At the same time, I know we all also accept, at least to some degree, that while we are allowed to believe as we choose, we have to respect the way that others believe and don't impose our values on others, especially when it causes harm. I'll give an intuitive example. No matter how sincere any person's beliefs, American society and the law have chosen to decide that a government clerk cannot refuse to issue a marriage license to a couple because that couple comes from different races and that God intended the races to be separate. Now, of course, you can say, in that case, and consistent with this proposed rifer framework, there is a compelling government interest of preventing racial discrimination and requiring people to engage in what is to them, sincerely a morally indefensible behavior. You can also say that it is, quote, the least restrictive means to engage and further that anti-discrimination objective. The challenge is, as I'm sure most lawyers here, I'm asking you all to think back to one, I'll constitution a law can admit, what is compelling and what is least restrictive are pretty fungible concepts. A person can still, indeed today, very deeply feel in their heart, in their soul, that in fact, people of different races should not associate and certainly not marry, but then wouldn't the least restrictive means actually be allowing a government clerk who issues these licenses to opt out and let someone else do it, because we could easily create a regime, a matrix of clerks that say, I won't marry X-rays to Y-rays, find someone else to marry these couples, and in the end, no one would even know. And certainly the couple would know that anyone was discriminating at all. You could shield that from open records, but our society and our law in America have settled this and accepted that government cannot have the imprimatur of discrimination on it, which just goes to show to mean that this framework can be pretty inconsistent and dicey. And I also say that in disclosure, I someone who has litigated these cases around the time of Hobby Lobby. And unlike more classic riffer cases from the 90s, when Democrats and Republicans did come together to pass riffer in Congress, today's desired invocations of religious objection also come down to someone not wanting to do something required by government, as opposed to that person being prevented from doing something they wished, which highlights, again to me, what's missing from this framework, the fact that in these modern day examples, people will be hurt on the basis of something deeply held in their own beliefs, identities, and souls. Religious abjectors are not being required to accept these people deeply at all, but allowing their objection to basic transactional services means being okay with others feeling cast out of our society. It rejects the reality that, yes, we can believe deeply, but we have to exist in our social contract, pops, lock, whatever philosopher you should choose, objectively and dispassionately as well, or some people don't get to believe or exist at all. We can't choose some people's deep beliefs over others, which is what this bill would do. So what is the way forward, understanding what the alleged problem is? To me, it is again, going back to my own values, seeking to understand, including those who were different from us, even those at whom we might intuitively recoil. One reason this bill is unnecessary in Georgia is legally and truthfully, we don't have the robust anti-discrimination protections as other states do. I was tempted to read the entirety of government deal speech when he explicitly stated that while vetoing RIFRA in 2016, and nearly 10 years later, it has not changed. Despite efforts on both sides of the aisle to their credit to change that, we have become a fantastic place to do business. We say that all the time in spite of that, because we attract businesses that without being legally required to do so, tell the value of different identities coming together in the workplace. Private entities have chosen to value different people if nothing else because they know this is necessary for our economy. But today, though, SB 36 seeks to pass not more anti-discrimination protections, but a law that can be used as not just a shield from compelled behavior, but a sword to slash at the gains and justice people have made. We've seen similar two steps forward, one step back, time and again in our American history with respect to race after Civil War, Jim Crow, after Brownby Board with refusal to desegregate with any real deliberate speed, and then moving to private segregation with private schools. And of course, after the Civil Rights Act of 1964, with yes, invocations of religious objection until courts put a stop to that. And that is exactly what we're doing today, regardless of your personal intentions and beliefs and motivations. So the way forward to me is not this bill. It is to realize that despite the gains our society has made, we are still repeating the same mistakes. We have failed to recognize what history should have taught us. The compelling government interests we have is to face the societal challenges that threaten us all, some of which are human-made, but others of which are not. We've seen that during COVID, for example. And the least restrictive means of meeting that interest is to do it, not by clawing at each other, however tempted we are, including tonight, but to do so together. We don't have to light each other or believe the same things another person does to do that. There are no laws in Georgia requiring a baker to make a cape for a gay couple or an immigrant or whomever. But these are the very people we know we need in our labor force, in our communities, solving problems together with us, not receiving blame or moral division. I still personally believe it doesn't have to be this way, regardless of whether we pass this bill or not. We can get the better of ourselves. I truly think that. And once more, try to understand each other. That might be naive, I realize, even delusional, but that is my deeply held religious belief. Thank you, Mr. Speaker. I yield the well. Thank you, the General Manager of the well, Representative Willis, has recognized and speak to the bill. Ladies recognized. Thank you, Mr. Speaker, for the recognition. Good evening, colleagues. While the protections of religious freedom is a fundamental pillar of our democracy, this bill in its current form poses significant risks to the rights and freedoms of far too many Georgians. Now, two weeks ago, we passed legislation aimed at protecting the interests of businesses. And now, we're not considering their best interests at all. Now, I'm not simple. I'm certainly not slow, but I am baffled by the brazen hypocrisy and circus of contradictions in the legislative priorities of this session, implementing a state level rifer without accompanying civil rights protections, positions us to upset the delicate balance between safeguarding religious liberty and preventing discrimination. It's very simple. In 2016, a similar bill was vetoed following widespread backlash from the business community, which feared negative impacts on the state's economy and reputation. This is a state and this city that we sit in now where we have superbows, world cups, big things. We want more. We attract business. We want to remain the number one place to do business. As we continue to say again and again and again. Delta Airlines is here, headquarters. And guess who all of these companies have working with and for them? Gay people, straight people, all kinds of people, uphold the infrastructure of these wonderful organizations that make our state great. I stand before you today not in opposition to faith, but in support of the principles that underpin our diverse and inclusive society. Our nation was founded on the belief that all individuals are created equal, each and doubt with unalienable rights, which I find fascinating in this moment because this bill risks it all. So how is it that we speak to these tenants in one breath and cut liberty from under citizens in another? It's the hypocrisy for me. Such legislation could allow for the refusal of services, employment, even medical care to our fellow citizens in each one of our districts, by the way. So my question for this session is how much hate does it really take for you to make this quota? I'm not sure where it's coming from. I'm not sure what it is, but I do know that it's unfair and that it is quite ridiculous. You don't have to believe me. Let's go to case law. Your employment, Bostic versus Clayton City, 2020, found that employment discrimination was in fact present as a result of a riftra. The US Conference of Catholic Bishops versus the EEOC, issues with pregnancy-related conditions and pregnant workers. This impacts pregnant workers. First care, Burwell versus Hobby Lobby, riftra was used to permit discrimination against minority groups and I could go on and on and on. So there is case law that displays exactly what happens when we implement laws like this. So all of these corporations are against it, but I'll leave you with this. You know who's for it? The Satanic Temple. They put a letter on my desk. Now this is what hate produces. So they are overjoyed that they'll now be able to have their ceremonies, their rituals freely and in abundance. But this can be the unintended consequence of what you bring when you bake a cake full of hate. And I'll ask you this lastly, how much hate does it take to make this quote we are trying to hit in this session? It's unfair. This discriminatory and the first amendment remains sufficient. And with that, Mr. Speaker, I yield the will. The lady is yielded the will. Reps of the bar, excuse me, represent the panace. Reps of the barons, I think this, comes into the moddy barns. The lady is recognized. Thank you, Mr. Speaker. Well colleagues, I stand here in opposition of SB 36. Thank you for allowing me to speak with you. I know the hour is late. So you all won't listen, but I'm going to speak anyway. While framed as a protection of religious liberty, this bill opens the door to dangerous consequences, particularly for the civil rights of marginalized communities across our state. Before I get into the meat and potatoes, I'm just going to start with a personal situation that you guys maybe can relate to. So let's see. So basically this policy could directly affect me because who I choose to love. I'm pretty cordial with everyone in here. So you actually do know someone in the LGBTQ community who you can relate to. You can talk to who you can work across the aisle with. Imagine it's the start of the pandemic. Right when COVID hit none of us knew anything about COVID. This where COVID was in the lab that I work in before even you all even knew about it pretty much. Imagine the start of COVID and you got COVID and I with my degree in biology, my degree in chemistry, my degree in clinical science, my degree in public health and my soon to be hopefully by time we get back in January, PhD in public health. Imagine I come with all those credentials and you have COVID and I'm the person that they asked to help you. Would you discriminate against me because I'm a lesbian and you have COVID and you have no idea about COVID but I have those four or five degrees and I'm an expert in COVID and how it's transmitted and how it may affect your district and your community. Would you discriminate against me because of who I choose to love and you're about to die from COVID that you have no idea about? That's a personal situation that I'll put in your head and ask you to think about this is what this affects. I could not be hired because who I choose to love despite those five degrees that I worked hard for. That's not fair and that's what this bill does. Do I even want to talk about the meat and potatoes or do I just want to give you a personal story that we can all relate to? Well, let's not be hypothetical. This is not hypothetical. In other states, individuals have used similar laws to discriminate and argue and to deny services to people like same-sex couples, refuse contraception which is ironic because in my public health committee this week we just passed the contraceptive law for all women and this would discriminate against some women so somewhere we're butting heads. I want to share that if you were to discriminate against a certain group of people, you might be going against the things that you believe. You might be hurting yourself. You might be hurting a family member because someone from the LGBTQ community, someone from a religious group who you're hating against may be the person that's going to care for you. I want you to think in those aspects about this bill when you're voting on this bill. I won't even get into the meat and potatoes. I'll leave you with that personal story and I want you to think on that. Thank you. I yield the well. The lady is yielded the well. Reps and penic. I can speak to the bill. Colleagues, I ask for your attention. What I have to tell you is important and I am the only voice from my community that can do it. I urge a no vote on RIFRA. This bill would have serious and foreseeable consequences for our state that we cannot ignore. RIFRA does not protect minority religions. It does the opposite. When I hear the author of this bill, the sponsor said we protect minorities, how would you know there are no minority religions in your party? There are no LGBTQ people in your party. Don't you dare tell me as a religious minority that you are doing me a favor. When you don't know what it is to live as a religious minority. When you don't get the death threats that I got yesterday because I stood up for Jewish women and Jewish religious liberty. In Jewish tradition, a mother's life takes precedence over a fetus, a teaching spanning thousands of years, Exodus 21, 22 through 25, establishes different penalties, a monetary fine for causing a miscarriage, but life for life if the woman is harmed. Judy isn't doesn't believe that life begins at conception, but rather at birth. Just look at Israel. Israel's permissive approach to abortion reflects this understanding that has guided Jewish medical ethics for centuries. Bridges abortion ban prevents Jews from practicing our core religious beliefs. Excuse me, I would really like my colleagues to hear this. A genuine religious freedom law would protect my right to make healthcare decisions according to my faiths teachings. You may not agree with Jewish law, but my religious liberty deserves equal protection and my religion has been here longer than any of yours. We cannot claim to value religious freedom while dismissing millennia of Jewish religious tradition. This Jewish teaching should tell you exactly what Rifra would protect. Yet this bill isn't about protecting minorities. It's creating a pathway to discrimination under the guise of religious liberty. It's about anti-discrimination language present in the federal statute and when they say this mirrors the federal statute that is misleading, it does not mirror because it does not include the anti-discrimination provisions that exist in federal law. And if they didn't want to discriminate, they'd have no problem adopting the any of the amendments presented that said to not discriminate against anybody else. But they refused. That's how you know it's a license to discriminate. You might vote yes, but you can't say you don't know what you're doing. Second, this bill will undermine HB30, our anti-Semitism bill. When we established Georgia's anti-Semitism definition through HB30, it was one of the most meaningful moments of my life. I have publicly spoken out and defended the majority party and sent the majority party for causing it to pass. But this refer threatens to undo all that progress. Refer would create a loophole for religiously-framed anti-Semitism. You believe that Jews killed Jesus? You believe that you have some foundation for that in the Bible? That's your license to discriminate against Jews. Justice organizations, including voucher, religious schools that are state-funded with our voucher money, could distribute anti-Semitic material and claim refer protections. Religious schools receiving tax dollars could teach theologies to give Jill a delegitimizing Judaism while claiming religious liberty protection. And my community called me and asked me, who should I vote for in my district? The first thing I did was look at the votes on HB30. For better or worse, I was an honest broker and if you supported it, you had my support. Now when they call me to ask me the same question, I will be looking at this refer vote. You are taking two steps forward. You are now taking two steps back. This conflict will force the courts to conduct complex case-by-case analysis, costing millions of dollars of legal fees, none of which are going to be paid by the sponsor of this bill. It will need to determine the line between protected religious expression and prohibited anti-Semitism where that line falls. But each case will require an expensive analysis of whether anti-Semitism expression is truly motivated by sincere religious belief. The result is that secular anti-Semitism faces consequences while religiously motivated anti-Semitism receives protection. Contradicting what our governor has said that hate has no home in Georgia. We are stating the Jewish position on abortion in one of these hearings. I received a death threat. Jews I was called demonic for being Jewish. These are the people.\n\nthat will use Refra to discriminate against the Jewish community. This bill will make my community any less safe, and you need to know that. Third, Refra may overturn George's heartbeat bill. So let me appeal to your base political instincts. Here is the calculation you have to make. If passed, Refra would allow Jewish women to claim religious liberty violations by George's abortion ban. Similar Refra challenges exist in multiple states, and they are succeeding. I put one of them on your desk. When this happens, and it will, Georgia will spend millions arguing contradictory positions, defending the abortion ban while claiming to protect religious liberty. It's hypocritical and fiscally irresponsible. Our state will essentially be arguing against my religious liberty after passing a law supposed to design to protect it. Indiana's Court of Appeals ruled their abortion ban by Elates Refra in a case brought by plaintiffs, including a Jewish woman. The court recognized that when determinate a pregnancy involves religious questions, different answers, different religions answered differently. The case is on your desk. To those opposing abortion rights, good luck explaining how you knowingly undid Georgia's abortion ban. My, I told you so party will be spectacular, but I will take no joy in it because of the harm this bill will cause. Sometimes you have to look at who your friends are to decide if you're on the right side of history. This a tannic temple, you heard about it, you read about it, they can't wait. So the minority communities are going to be asking, who do you support more? The rights of the C-tannic temple? Or the rights of your religious, diverse communities? And your gay communities? Who do you support more? Is that a question you really want to pose when the satanic temple people are doing their rituals out in public? Vote no on this bill, it is the right thing for Georgians. The Jews is not worth the squeeze to satisfy one senator who won't be paying for Georgia's litigation. Thank you, I yield the well. The lady has yielded the well. That completes the discussion on SB 36. Is there any objection to the previous question being ordered? Here none, the previous question is ordered. We now will take up our minority report and the chair's time. The minority report and the chair's time will both have 20 minutes total for each, 20 minutes total for each to be allocated by the will of the representatives and of the chair. Someone recognize represent Stacy Evans to speak to the bill. So first speaker on the minority report, representative Evans. Thank you, Mr. Speaker. Good evening, colleagues. Rising in opposition to Senate Bill 36, it's like deja vu. Remember being here in 2015, we did this. 2016. I feel compelled from the jump to let you know, I'm religious, I'm a Christian. I'm a member of a Methodist Church here in Atlanta. I was raised Baptist. I'm married to Catholic. Methodist seemed like a pretty good compromise for our family. So that's where we landed. My Southern Baptist preacher married me and my husband. I spent a lot of my childhood at tent revivals. Like a lot, a lot. I was baptized in a really, really cold creek. I pray. I pray a lot more in the first quarter of the year than I do the rest of the year. Because I find I need more strength and I draw it from above. I want to protect religion. And luckily, I don't need to pass a law to do that. The federal constitution, the state constitution, do that for me. So I'm starting, well, I started with that. I'm going to go second to this. The name of the bill is so confusing to me, the Religious Freedom Restoration Act. Restore what? What have we lost that we need to restore? Where is the evidence that we have lost any religious freedom? I was on the committee, the judiciary committee where we heard this. Speakers were asked over and over. What did they want to do that they think they couldn't do now that they could do if we passed this bill? Crickets? Nothing. It was all about, well, something could happen preemptive, but no even explanation of theoretically what it would be. The author mentioned two cases and he said, showed the author of the bill in the Senate, in the committee talked about these two cases where the courts laid out. If we don't have a state riftra because George isn't have a state riftra, they lose. I read those cases. No, they didn't say that. There was a lobbyist from the Baptist Association that waved this page of cases, lots and lots of cases, waved a matis in the committee and I asked if he would hand it to me so I could read the cases. I'll think about it. Never got it. So I don't know. To those that say this is just the federal riftra and Bill Clinton is your hero today, would you stop? Would you please just stop? It's not honest. We all know if we're being honest, the federal government gives us civil rights protections that we do not have in this state. So that federal riftra is balanced against those comprehensive civil rights protections that we have from the federal government. And don't tell me about all the other states that have similar riftras and it's okay because the sky hasn't fallen there because you know what? They do too. Year after year we have come down here and said please pass comprehensive civil rights. If we did that, I probably wouldn't have a problem with this bill. But we don't. So this is different and don't let anybody tell you otherwise and I think you know that. So I can't tell you what you're going to be able to do after this bill that you can't do now because nobody in committee can tell me. And it's sort of like this theme for this session we're especially today where we've made up all these problems and if we were if it was like flies we'd look like we're swatting at all these problems but they're but they're not there. We would be institutionalized y'all that's what we are doing. We are swatting and imaginary flies and I'm sick of it. Here's what I know because I don't live in the theoretical I live in reality. The reality is that the states that have passed some of these similar laws they have lost business. They have lost tourism. They have lost big games that we all like to go to. They have lost talent because young people don't like this stuff y'all. They don't like it. Indiana 60 million laws North Carolina 3.7 billion laws Texas 8.5 billion laws Mississippi, Arizona. The list goes on and on and on. We spent so much time. So much time on short reform. And it was supposed to protect business because we got to do this because we're losing business. We can't attract business all this stuff and I didn't understand it at the time because again I didn't see any evidence. You know we're like swatting these imaginary flies. Maybe I get it now. We knew we were going to dig a hole for ourselves with riftra. We knew we were going to hurt business. So we had to make up for it. I don't actually think that's true because that doesn't really make sense. But if you care about business, if you care about tourism, if you care about growing our state, why are we doing this? Because y'all, I don't get it. Going back to the theoretical versus reality. Here's some more reality. This bill will make it easier to discriminate. Period. The author's setting committee and in the media that the purpose of this bill was not to discriminate but yet he doesn't want an amendment that protects against discrimination. The rules committee doesn't either apparently. I tried y'all. I put it on your desk. It's an amendment that I can't move because the rules committee didn't approve it. Simple. Nothing in this chapter shall be construed to allow discrimination and violation of a federal or state civil rights law or a local civil rights ordinance or resolution. That's it. I tried to get it in the bill y'all. I tried to give you all a chance to vote on it. But we're not going to get to do that. If it wasn't about discrimination, if no one wanted this bill to be used to discriminate, why can't we say so? I was taught that you say what you mean and you mean what you say. So when you tell me you don't want this bill to discriminate but you want to allow us to say it, I just can't believe you. I love all my fellow Georgians too much to vote for any bill that will make it easier to discriminate against them. You know, I think the theme of today should be just because you can, doesn't mean you should. Wisdom, justice, moderation. We aren't showing very much of those three great words in our state motto today. And it makes me sad. You know, before I came down here as a representative a long time before, I was an intern down here for Robert Rickert. Some of y'all might have served with him from making. And I saw this house. I saw this house be strong. I saw this house stand on its own priorities and not bend to the governor and then bend to the Senate. It did what it thought was important. And big things like that made a big difference in our state. I don't think there has been a companion, Rifford Bill in the house since 2015. And the next year the house passed another Senate Rifford Bill and Governor Deal vetoed it. Yet here we are. Letting a Senate priority take over us that will discriminate and hurt Georgians. How about we stand up and show Georgia that we are independent, this house is independent what we want matters, our priorities matter. But here we are bending again and put aside the separation of powers for just a second. Why don't we trust ourselves? Why can't we vote on this anti-discrimination amendment? Why do our house rules not allow us to just do it anyway? Think about those things and please join me in voting no. Mr. Speaker I yield to the next speaker on the minority report, Carly Jenner. If that's okay with you, Mr. Speaker. Yes ma'am, that's the plan. We're going to recognize Rifford Jenner. Thank you, Representative Evans. Rifford Jenner is recognized. Thank you. Thank you, Mr. Speaker. Wow, I don't even know what to say about today. I have gone through my notes. I've written, I don't know how many speeches. I know that nobody in here is listening to me. But I do want some of my Democrats to listen to me, okay? Thank you. Because I came in, this is my 25th year. You believe that 25th year here. I have seen a lot. I have been through a lot. You know when I first came here, people would not ride the elevator with me. They would not. I would. The doors would open, they would look at me and they would say, I'll take the next one. Because I'm gay and I didn't, you know, I told the truth. I remember my mom saying I had no idea that I had no idea. I just ran for office. I'm not even from Georgia and I won. My mom's like, why don't you tell everybody who cares what goes on in your house. I said, mom, I cannot lie about that. Somebody had put the New York Times on her porch with me on the front page. In Charleston, West Virginia. Now think about that 25 years ago, that was a big deal. I served in the majority party with Speaker Murphy. And this is what I remember about Speaker Murphy. He ran this house. He ran it. He didn't capitulate to the Senate. He was a strong leader. And he held their bills hostage, hostage until the budget got done. This year we have let the other chamber that's running for governor run our chamber over here from my perspective. We've done all these terrible bills from my perspective. Now I was here in 2004 and the Democrats were in charge. And the Republicans wanted to put same-sex marriage on the ballot. And the Democrats said, yes, we too hate gay people. And we put it on the ballot. And guess what? We lost 23 seats. Even though members voted in favor of it. That's what this bill is. So for all you new members out here, you got to know. That this is what people do when they know they're getting ready to lose. This is a losing bill. These bills are not going to help them back home, even if they voted for it. You know why? Because people know what these bills are all about. Now in my doctoral dissertation I picked very non-controversial subject, which is same-sex marriage. Because they told you, your chair told you that look, you need to pick something that is dynamic and fluid. I'm like, okay, marriage wasn't even legal then. So I had lots of bad bills to write about. So right after RIFRA in 2017, I was interested. I have always been interested in who introduces what bill. And why do you do it? And so you know what? I wrote a book entitled, Impacts of Faith-Based Decision Making on the Individual Level Legislative Process. And you know what? There's a book was about. I looked at every single RIFRA bill across the country. And you know who introduced them? Republican men. Yes. And here's, in conclusion, let me just say this. This is what I said in 2016. That's what I'm going to say to you today. I must know that the irony of debating the bill that licensed prejudice against my community in the city too busy to hate is not lost on me. I opposed, back then, was House Bill 757 today. It's Senate Bill 36. I oppose it for any number of reasons. It says that my rights under the Constitution, under the law and under God are not inalienable. But rather are subject to the opinions of others. Freedom is an all or nothing principle. There are no shades of liberty. And when I'm not as free as my neighbor, when guess what? We all lose. Thank you vote no. And ladies, you will represent the, the park is recommended. Will park is recognized and speak to the minority report. Representing Sam Park. General is recognized. Thank you, Mr. Speaker. You know, my heart breaks that we are debating this piece of legislation that will cause so much pain to so many people across the state. It is my deep honor to be elected the first openly gay man ever to the Georgia State Legislature in more than 200 years. But that was not an easy journey. When I was 13 years old, what I was told, what I was taught from culture, from our society, is that if someone finds out that you are gay, then you're going to be killed. Because that's what happened in Matthew Shepherd. Why are we moving back in this manner that would cause so much harm, not just to Georgians across the state, but to members here in this body? This letter from Georgia Faith and Freedom Coalition says that this has led, that this has been implemented without leading to harmful discrimination. That is a lie. It's been said earlier that this only applies to the government yet online. 50. It says government is to find as other person acting under the color of law, which includes private entities or individuals carrying out the programs thereof. This is a harmful piece of legislation. I want to speak to the public and to voters and to maybe LGBTQ folks and other marginalized communities across the state that it does not matter who you are, that every single person is made an image of God and is loved unconditionally, no matter what legislation like this may say, no matter what a full church may say that uses the Bible as a sword against the most vulnerable among us. All of us stand equal before our maker. And I know that full well, certainly when I experience the death of my mother and taking care of her for three and a half years, when I was faced with the question, to whom can I turn to? I turn to my faith. There is power in faith, but not power in discrimination and using faith to discriminate against others, which is what the majority party is doing here today. Now I also want to thank the majority party for making clear to the people of Georgia who they really are. The Republican Party, the Party of Lincoln, has become the party that's embraced racism. Discrimination and hate that still lives within our nations and our state's population. We've seen that time and time again, based on the actions taken by the Republican Party here in the state of Georgia and across this country, rather than address the needs of everyday Georgians, Republicans' revel continued to revel in their white identity politics of fear and hate. Republicans have blocked access to health care for their own constituents allowing their rural hospitals to shut down. They've defunded their own rural school districts, denied women access to basic reproductive health care. They passed legislation to drive marginalized transgender children to commit suicide. That is what y'all are doing and continuing to do. We have passed earlier today a racist neo-Nazi license plate that forced members in our body to relive their traumatic past despite overcoming the challenges of segregation and the deep stain of this country. Republicans here in this body have lied about foreign threats regarding our food supply. And earlier this year voted to protect a foreign pesticide company from liability. And now this broad license to discriminate based on one's religious belief. It has unfortunately become clear to me that there is no wisdom, justice, or moderation left in the Republican Party. They have no solutions to the problems we face. Based on the actions y'all continue to take, there is only fear and hate, extremism and cowardice. What does it say about Republicans who have to discriminate against the most marginalized if they want to overcome and get through their Republican primary to run for higher office? That the people see y'all for who you are. Now I know that there are good people in the Republican Party. I consider some of y'all my friends. It is also clear that y'all are unable to stand up to the extremism in your party. It is heartbreaking that we are here in this moment. Nine years ago a moderate Republican voted for refer in 2016 similar to this discriminatory piece of legislation. She's no longer here. Georgia voters knocked her out of her district because unlike the Republican politicians, here pushing this hate, Georgia voters want better. They know better and they will get better than this hate. Thank you, Mr. Speaker. I yield the well. Gentlemen, zero to the well. We won to the chair's time now. Chairman, we'll have up to 20 minutes speak to the bill. Chairman Gunther's recognized to speak to the bill. Thank you, Mr. Speaker. I'm all yield my time to represent Kelly. Gentlemen, has that right? Representative Drake Kelly has recognized to speak to the bill. Thank you, Mr. Speaker. Gentlemen, you allocate time between yourself and these other speakers. Yes, gentlemen's recognized. Thank you, Mr. Speaker. Before I get into the merits of this legislation, I think something needs to be addressed. About what's been said about this body and what has been said about our speaker. He doesn't know that I'm going to do this and he certainly hasn't asked me to do it. But I've seen our speaker leading away that when he feels something's the right thing to do, he doesn't care who gets the credit for it. That's the way we should all govern here. Our house is led on important issues. We've done it this year when it's came to school safety, when it's came to disaster relief for our hurricane victims, when it's came to codifying IVF as a practice in Georgia. And I think it's the spicable for the minority party to degrade this house and take cheap shots out of speaker who I think is a lot too fair to y'all. But if we want to get into the merits of the legislation, I appreciate what my friend said about theoretics and swatting flies. Because the only theoretical flies I see in swatted are by the minority party when they try to find theoretical problems in common sense legislation. The Democrats this year, their theme is finding searching for problems in common sense legislation. We talked a lot about history today. Here's your history lesson. In 1993, in a bipartisan, almost unanimous manner, Rifford was championed by a Democratic president. It was sponsored in the house by a judge Schumer who is now the highest ranking Jewish officer to ever hold elected office in our country. And it has been adopted now by 39 states. In 1997, a court case said that the federal riffed in applied to state level. So now 39 states have adopted that. What this measure simply looks to do is codify the same balancing tests for our exercise of religious freedom that the other four First Amendment rights have. This should be something that we can agree to. We got a lot we can fight about. This should be something we need to agree to. Mr. Speaker with that, I'm going to yield the well and turn over the time to Chairman Tyler Paul Smith. Gentlemen, yielded the way of Representative Tyler Paul Smith has recognized, speak to the bill. Representative Smith. Thank you, Mr. Speaker. You know, it's good that we can come in here in this country and have this kind of debate. And you know, we might not disagree, but you'll always have an advocate in me to defend your right and to say your opinion here from this well. So I do want to point out that I appreciate the discussion we've had. I emphasized this earlier. I got a little frustrated over there while I was listening. This is dealing with government burdening the free exercise of religion in this state. This is not a license for private citizen to use this against another private citizen. I'm going to yield what remaining time we have here in just a second. I will there. I've had to represent people who believe totally different than I do. And I was a zealous advocate for them. When I was in a part of this state that people will not take the elevator with them. I'm worried about jury biases against my client because they've got a different lifestyle. So I will dare. This does not give the license to discriminate against those people. I'm sorry, but that's intellectually dishonest. I will leave you with this. If you still got your copy of the Constitution, I know a lot of my friends do that keep it on their desk. If you're a term with me, I think it's page one of their paragraph four. Religious opinions, freedom of religion. I think this will help some of the questions we have had presented. No inhabitant of this state shall be molested in personal property or be prohibited from holding any public office or trust on account of religious opinions. But the right of freedom of religion shall not be so construed as to excuse acts of illicitousness or justify practices and consistent with the\n\nPeace and safety of this state. Mr. Speaker, that was pen before I was even in my mother's womb and I'm going to leave it at that and yield there. Remaining bounce of my time to floor later, Wade. The gentleman's yielded the well. Reps of the will. Wade is recognized. Speak to the bill. Reps of the way. Thank you, Mr. Speaker. Colleagues, first I want to rise and tell you this. I love you. I hear you, my friend. I want you to know that because I had a father who was a theologian and he passed when I was a freshman in this building. And he taught me the teachings of love thy neighbor and to know even sometimes you're going to love people you disagree with. And we disagreed some today. Mr. Speaker, I rise today to champion Senate Bill 36. The Georgia Restoration Freedom Act. This measure reaffirms a bedrock principle that no Georgian should have their sincere, religious, exercise substantially burdened by the government without a compelling reason. Modeled on the federal rift that Congress passed nearly unanimously. Yes, in 1993, by a president named Bill Clinton and also voted on in the Senate by great Georgian Sam Nunn. Yes, beat 36 simply insurers that at the state and local level, the same standard applies. Under this bill, if a law or government action significantly encroaches on someone's faith practice, the government must show a compelling interest. And it's done in the least restrictive way possible. That is a high bar as it should be when fundamental liberty is at stake. What does this mean in practice? It means a small business owner won't be forced to violate a deeply held belief unless truly necessary for public welfare. It means a zoning rule cannot arbitrarily shut down a house of worships outreach ministry without strong justification. At the same time, SB 36 contains important clarifications. It does not allow anyone to break general laws with impunity or discriminate unlawfully. It's remained the referees weighing each case as facts. The bill explicitly notes it does not affect the establishment clause. We respect the separation of church and state even as we protect the free exercise of one religion. Mr. Speaker, Senate Bill 36 simply gives people of all faiths all faiths. Their day in court, if they believe the government has overreached. Half of the states we've heard it today, 39 now, we could be the 40th. It is time that Georgia provide the same safeguards that 39 other states in our country have for their citizens. Sir, we're a state very rich in diversity. I think it's what makes it better. I want to read this. This is a message from my dad. He taught me this when I was learning about his youth. When in 1969, he was a part of a movement that many that looked like me disagreed with. He said, son, America's commitment to religious freedom not only protects our individual right to live out our faith. It also strengthens us collectively by allowing voices of conscious to flourish, to pursue virtue and promote the common good. People of faith, houses of worship and religious organizations must be free to believe. Pray, proclaim, and act on their religious convictions without the encroachment of government. Mr. Speaker, our Constitution enumerates religious liberty first among our freedoms. Let us uphold that promise. Vote yes on Senate Bill 36 and stand up for our innately right for every Georgian to live and worship according to their faith. I please ask you to search your soul, your heart, and your mind and vote yes. Thank you, Mr. Speaker. I yield the well. The gentleman is yielded the well that concludes our comments on SB 36. There you have just you to agree to a report of the committee which was favorable to the past year of the bill. Here in under report of the committee has agreed to. Shall this bill now pass all in favor of the past to the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, you will unlock the machine. On the passage of Senate Bill 36, the yeas are 96. The nays are 70. This bill haven't received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read a caption to Senate Bill 255255? Senator Councillor of the 46th to be entitled to act to amend chapter 1 of title. 28th, the official go to Georgia annotated relating the general provisions regarding the general assembly. So it's the codify process for the authorization of statutory and vesticatory powers to certain committees in the general assembly. This bill haven't been referred to the committee on rules that committee recommends that this bill do pass by committee substitute. The repressivant lever is recognized to present the bill. Chairman lever it. Thank you, Mr. Speaker. Ladies and gentlemen, the Senate Bill 255 is a bill that would simply establish some processes and procedures by which we as a house and the Senate separately or jointly house and Senate as the entire general assembly would exercise our investigatory powers that are inherent to our existence constitutionally as the general assembly. So the bill basically confirms that we can constitute committees either separately or jointly or by our own rules. We can establish committees and establish these procedures and that we also can through that have the ability to compel testimony, compel protection of documents and then enforce those as well. And there's a procedure providing for enforcement by allowing the committees to file a proceeding in a spare court to enforce any kind of subpoenas that they may issue. There's also a lengthy paragraph at the end just confirming that anything in here is simply setting out procedure does not abrogate or diminish any of our rights or authority that we have. I think you'll agree it's very important that we as a general assembly and as separate bodies by camera we have the ability to exercise these kind of powers. This bill just simply sets some guardrails and processes in place so that we all know how those procedures are to be exercised. So that in essence is the bill and I'm glad to stand for any questions. Gentlemen has a couple of questions and then we have some speakers on the bill representing representative Draper to your left is recognized for a question. Thank you Mr. Speaker, does the gentleman yell? Yes ma'am. All right thank you so my question is about the subpoena power that we would have as committees and as you know as an attorney the subpoena can be legally challenged and there can be motions, costly legal battles. So my question is who is to incur that cost on the part of the state? Is that the taxpayers? Well yes I think every cost we incur up here would be incurred by taxpayers. I would assume these costs would come out of the funds of either if it was a joint committee out of the general assembly as a whole or if it was a committee of one body out of that particular bodies budget. Does the gentleman further yield? Yes ma'am. So would there be any kind of cap on the number of subpoenas that can be issued? Yes ma'am there is not in this statute that's something that could be imposed by a rule of either joint rule or rule of the separate body. Thank you. Thank you for the question. Gentlemen yield yes sir. Represented rise to your left is recognized for a question. Thank you Mr. Speaker. Does the gentleman yell? Yes ma'am. Thank you. Is it not true that SB 255 does not expand legislative powers but rather outlines how they may be exercised by committees in a way that we're going to be able to recognize. Respects both transparency and due process. Yes ma'am that is my understanding. This does not expand anything. It just simply sets some guard rows in place. Gentlemen yield for another question. Oh you have one more Mr. Speaker. Representative Jasmine Clark to your left is recognized for a question. Thank you Mr. Speaker. Does the gentleman yield? Yes ma'am. Who are we trying to investigate? Nobody I think this is just trying to confirm that we have this authority. And also I think sets some confirm what the process would be if we did you ever determine to do that. Does the gentleman further yield? Yes ma'am. So on the other side of this building there have been lots of people trying to investigate district attorneys in certain counties that they don't necessarily like or former candidates for governor. Is this bill just trying to carry their water and make it easier for them to do those things because right now they really don't have the power to do that. There's kind of doing it because they want to. Well I would say for myself that is not the purpose of the legislation. And I would argue that they already they have that authority as do we this is just simply trying to confirm the way that would be exercise going forward. Thank you. Thank you for the question. I understand there are other speakers and I allow us late I will yield the well but ask your favor consideration of Senate Bill 255. Gentlemen's yielded the well. We have several people signed up to speak that are opposed to the bill then we will have a minority report and the chair's time. About about five minutes each for those of speaking opposed. Will you want to go first? Will Sam Park is recognized to speak to the bill? Then chair Miller you'll be next. Thank you Mr. Speaker. The bill is authorized today in opposition to Senate Bill 255 which provides partisan legislators the ability the subpoena power and the ability to investigate through legislative committees. Parties and legislative committees. Under this bill the House or Senator both together can authorize a committee to issue subpoenas for documents or testimony. Require people to testify under oath. Take depositions and force subpoenas in superior court and keep the entire process confidential if the committee chooses to do so. This is not a mere matter of codifying and existing power. This is not simply about legislative oversight. This is about giving partisan politicians more power. This is about giving political committees. The power of a prosecutor without the oversight of a judge and without the protections for those being investigated. So what can this look like in practice? Well we can see an investigation of political opponents as we saw the majority party utilized last year against district attorney willis. The majority party forms of voter integrity committee. Subpoenas election workers, nonprofit leaders, poll observers demanding their private emails and phone records. These individuals never committed a crime but now they're forced to testify under oath and spend thousands on legal defense. This could target reproductive health providers. The committee on family values, subpoenas reproductive health clinics, probation records, staff communications and internal protocols. Even if the clinic has done nothing wrong. This risk them getting pulled into a government investigation for purely political reasons. That again would also put patients privacy at risk. How about silencing student activities? We've seen many bills from the majority party try to do just that this year. Again, imagine a committee investigating campus safety and subpoenas university students who protested legislative activity. The man's social media content, attendance lists from rallies, testimony from student leaders, all under oath, all legal protest chilled by government investigation. As the majority party just passed legislation to attack and discriminate against the LGBTQ community and other marginalized communities, this committee or this legislation would authorize partisan politicians to investigate the misuse of public funds targeting LGBTQ nonprofits. It may subpoena internal board minutes, donor lists, financial records without a shred of evidence. The process alone becomes punishment. How about local government? We've seen the majority party certainly ignore their principal and allegiance to local rule, local control. We wouldn't surprise me if we saw partisan investigation on a city manager and their emails. Not for evidence, but to send a message that you should either fall in line or will investigate you. The point is this, SB 255 does not have any meaningful guardrails, read the legislation. SB 255 does not require bipartisan authorization. It does not require probable cause. It does not provide protections to the people being investigated. There's no guarantee of notice, no clear process for quashing a subpoena, no consequences for misuse of this power for partisan politicians. We are simply codifying a process where a handful of politicians can investigate whomever they want in secret under oath and with court-backed subpoena power. That is not how oversight works in a democracy, though clearly and as demonstrated by members of the majority party, maybe democracy isn't what they're into these days. Maybe authoritarianism is in part the purpose of legislation such as this. So I would ask you, would you want to be subpoenaed by a political committee that doesn't have to explain what it's doing that has no real guardrails that doesn't have to tell the public what they're doing? This is a bad bill, this is a dangerous bill, and I urge members of this body to vote no against SB 255. Thank you, Mr. Speaker, I yield the well. General, as you are to the well, cheerleading Miller is recognized to speak to the bill. Representative Tony Miller. Thank you, Mr. Speaker. I just wanted to pose a couple of real world questions to my colleagues who seem to be rushing to do this. It was represented to us in the rules committee by the proponent of this bill that this process has rarely been used in our history. I asked the gentleman who had been serving for at least 16 years, have you ever needed to do this, aside from Fannie Willis? He said he could not remember us ever needing to do this. And then he also said he couldn't really imagine us needing to do it in a future in heck. We may not even need this for another 10 years. So again, my colleagues, what are we doing? Let me just talk to you a little bit about how investigations work. There are many of my colleagues here who have been prosecutors before, who have been in law enforcement before, so they also can speak to this issue. The manner in which the government seeks to dip its hand in its eyes and itself into your personal life is actually pretty regulated. It's done with oversight. You ever had somebody, Sapina, all your text messages? All of them. You ever had somebody, Sapina, your cell tower records to see where you were at a certain day and at a certain time? What are the rules for doing that? Can we investigate other members? Can the Senate decide there's someone in the house that they want to investigate? And they want to see their emails? Can they sell records? Sapina, people close to them? Based on rumor? Where are the guardrails here? Because it ain't no fun when the rabbit gets the gun and what I'm telling you guys here is that you are opening up with all of this Trump vengeance machine, a can of something that I don't think you understand how far it can go and how it can be weaponized. You see law enforcement, district attorneys, police officers, the folks, inspectors general, folks who are trained in this, who have protocols and procedures, who have supervisors looking over what they do, who have a process for citizens to complain. Those are called guardrails. So what we're giving to ourselves here is the power to do all that law enforcement can do. Include for someone to come in and testify. Do they get the right to counsel if you're asking them something that has a tendency to incriminate them if so who pays for it? This is again my colleagues, more silly season. It's being handled. Trump is president. The DA has been disqualified. You know, can we move on to more pressing things? Because this is again a solution. Don't see my colleague. It's search of a problem. So I want y'all to really think about, because I will tell you this, having been a prosecutor for the feds, having been a prosecutor at the state level, that when the government wants to crawl up in you and find something, oh, they will find it. That is why when you give this kind of power to someone, you do not do it willy nilly. You do not rush it through committee. This didn't even go through judiciary. My missing something, did this come through judiciary? Did it come through Judy Nonsyville? Oh no, they just brought this to the rules committee. Okay? So I am urging you my colleagues, if we want to do something like this, let's take the time to draw up processes, protocols, procedures, rules, things that will guide us before we start issuing subpoenas for people's bank records, for people's text messages, for people's location data, geo location data, do you know how much information is in your phone? I appreciate the opportunity to speak against this bill. It may or may not be a good idea, but we're not ready to do this yet. And for that reason, I ask you my colleagues to vote no on SB 255. Ladies, you're doing well. Representative Teddy Reese has recognized to speak to the bill or representative Reese. Thank you, Mr. Speaker. Mr. Speaker, colleagues, I rise today to speak in opposition of SB 255. I want to say we've heard a lot about this bill, but in actuality, we have not. One, because it didn't go through the normal process that's been pointed out. This bill went straight to the rules committee, which is very reminiscent to what happened with the tort reform bill. There seems to be an effort here to prevent detailed discussion and a detailed review on what this bill will actually do. I remember when I was elected, and I spoke with the former dean of this House, Calvin Smiley, he said to me, the most important thing that you are sent to do in Atlanta, and the one thing that you are constitutionally required to do is not swap flies, but to pass a budget. And we haven't even done that yet. But here we are, expanding powers of a legislative body, which seems to have the theme this year of let's go after everybody we possibly can. And this is going to open the door to do much more. For all the constitutional lovers in the room, what happened to separation of powers? What about the courts? What about this thing that's called judges? Did we have a big ceremony in here yesterday where it was filled with people sitting in our seats as we saw in a new chief justice? And now we want a single handedly give power to a committee to decide at any moment, at any time that they're going to investigate someone. And subpoena records, subpoena documents, subpoena books, financial records, phone records. Where would it end, Mr. Speaker? Where would it end, colleagues? And what's going to happen in a couple years when the Democrats take the House? I guess we'll be calling a special session to carve back all these things like they did in North Carolina because it's going to be a little bit too much power for the minority party, which will soon be the majority party. I don't care to look into your business. I don't care to know who you're calling. If it matters that much, we can go through the current existing process to get that information. What are we doing? Are we passing laws? Are we trying to criminalize people? I don't come down here much, not doing this time. Speak a lot and more than others. But this bill just really rubbed me the wrong way, colleagues. And I'm speaking to all of you respectfully. Think about it right now. If somebody in the Senate decided they wanted to subpoena your phone records and connect it to your job as a legislator, how many of you will be running to the restroom right now trying to see how much you can delete before they pull the actual record? Who have you actually been texting with? Who have you been calling? Who have you been emailing? What conversations have been transpiring prior to? I just want you to think about it. My grandmother used to say all the time, when you dig a hole for somebody else dig one for yourself. Because you're going to be the next person to fall in it. And it's just good old fashioned common sense. Y'all, we got to stop this gotcha politics. We've heard the testimony here today, women are dying, giving birth. Our children are dying in the streets for a necessary gang violence. Senior citizens trying to determine, do they pay a light bill about it prescription medicine? Look girls, stand home from school because they can't afford period products. But yet we want to give certain committees and certain people the opportunity to dig into somebody else's business. But something must be wrong with my life because I don't have that much time. After I spent three months up here making cornbread, their official bread of Georgia, when folks don't have bread in their pockets, and you know what kind of bread I'm talking about. When all this economic development that we're talking about is not reaching every aspect of our state. Mr. Speaker, I just noticed that your sign is red. I think I've made my point. You guys, this is not good for us right now. Let's do something better for the people. If we got to be here at 10, 20 at night, let's be here doing something productive. I'll hear the well. Gentlemen, you'll do the well. Thank you for your comments. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. We'll move on now to the minority report. End of chair is time. Minority report has up to 20 minutes. Representative Stacy Evans is recognized to speak to the minority report. Representative Evans. Good evening again, colleagues. A couple of sessions ago, I had gotten this desk for the first time. There was a paper sort of stuck in the back and I pulled it out and it was a sign that told me former representative Sharon Beasley T used to have that desk and I pushed my button and told the speaker, Mr. Speaker, I'm tired because that's what Sharon Beasley T used to tell us and that's when we knew it was time to go. I'm tired, y'all. I am tired of being in this well. Believe it or not, I don't love the sound of my own voice. I don't come down here because I like to preach at y'all or talk to y'all or yell at y'all or zealously advocate to y'all however you want to characterize it. I've heard it always. I'm just trying to do my job y'all and when I see these bills, I'm just sad. I'm sad that we're spending so much time on these things. I'm sad that it's not even good law for what we're trying to do. I'm sad that we can't even try to make these things better because we get cut off in committee. I'm going to talk about that in a minute. We can't amend in here. We can't even get the rules committee to approve an amendment for y'all to potentially vote on. That's how little we are able to participate in. We are elected. There's only 180 of us in this whole great big state. Last I checked, eighth largest state in the country. We just cut ourselves off like that. Senate Bill 255, full of trivial memory lane, the Senate, open an investigation against\n\nThey issued some subpoenas to her, Governor Barnes, represented, Fannie Willis, he made an argument in court that the Senate is not authorized to launch an investigation. The legislature is authorized to launch an investigation and they went over to court about whether the Senate by themselves can be the legislature, whether we needed both of us to do it, whether we needed a new law. The trial court sided with not with Governor Barnes and Fannie Willis and said that it was enough. I haven't been able to confirm this, so I want to be honest with you all, but that case was appealed, or at least in the paper they said it was going to be appealed, and that was in February. So I think that's still pending. And so I can't help but think this might have something to do with that and what might happen with the Court of Appeals. Again, I haven't been able to confirm it, I want to be honest with you, but when Governor Barnes tells me he's going to appeal something, I believe it, and so I'm pretty sure that that's being appealed. So that's something, I think we're trying to meddle in some court cases that I don't understand why we want to do that. The other reason I think that is because if you look at this bill, ladies and gentlemen, it creates a new code section, hang with me, I know, y'all, I know it's so late. But we're only here for 40 days. I think we can hang in a little longer and do our job for the good people of Georgia. So this bill creates a new code section, but it also preserves the old one. I don't know, that just I'm curious about why we're trying to meddle in another case. My colleague, Chair Lady Miller brought up a really interesting point that I want to follow up on for a second. What if the Senate wants to investigate you? What if the Senate wants to investigate us? I don't think there's anything in this bill that limits that. It's so broad. And I raised that because I can't help but take another stroll down memory lane. It was 2021. I had just gotten back here and this body passed and the governor signed Senate bill to 21. That was the bill that created the leadership packs. Raise money, daring sessions, spend, spend unlimited money, spend, raise, spend, whatever you want to do. And I came down here to the well and y'all can look it up if you want to. I thought about trying to play it for you, but I'll just summarize it. I said, are you sure? Are you sure you want to give your leadership the power to raise all this money? Because they might use it against you if you step out of line. I said, are you sure you want to do that? I think that there are some members in this body that assured the members of the majority party. No, no, no. We're not going to use that against you. That's not what this is for. But I'm pretty sure there's colleagues all throughout this place that had some little flyers, mailers, sent out to their districts paid for by leadership committee against you. So if you think that body across the hall won't come for you, or maybe your own body might not come for you, take a look, get sent a bill to 21 and think about how that's been used. Now this bill, it's been said, didn't go to judiciary, didn't go to judiciary, non-civil, didn't go to governmental affairs, didn't go to any, what I call the substantive committee, not the gatekeeping committee, which is what I think of rules as. This one went straight to rules. We had one hearing, we heard from the author, we got to ask him some questions. No testimony, no witnesses, because that's how rules usually work. So we didn't do that. I asked a few questions to the author about, would you be opposed to making sure, at least, that the makeup of these investigatory committees are bipartisan, and you don't have to talk about Democrats and Republicans to say, we're always going to have this many of the majority, this many of the minority. So no matter what happens, everybody's going to have equal treatment, wouldn't that be nice? He didn't really love that, but he said, we would probably do that anyway. Then I offered a couple other ideas, would you mind if we had some requirement that if you're going to have an investigation, you've got to state the purpose. So everybody knows why we're actually doing this, you've got to put it up there up front, what you're doing. And also, make sure that we had a requirement, these investigatory committees issued findings, because we want to make sure this wasn't just a parade of our friends and people across the state that we actually told people what we did, and that we were going to use that to do something, not that we weren't just investigating to investigate, we were investigating to find out something and then do something from it, and we should tell the public what that is. Well, I think we would do that anyway, the author said, but I wouldn't be opposed to an amendment like that. Then I tried to make amendments, not even recognized, in the committee, in the committee, y'all, but in the committee. Couldn't make amendments in the committee, couldn't even try. So it's another opportunity to go, why are we so afraid of ourselves? 180 people in here, y'all, that's it for the whole state. We don't get to amend. Sometimes we don't even get to try to amend in committee. Are we so sure that our friends across the hall got it so right that we don't even need to change a comma? Do we seed all of that to them, and we don't even try? I'm just sad, I'm just sad, because it shouldn't be this hard to do my job. And let the chips fall where they may. I know y'all are smart, y'all are all smart, and you're good, and we have so many people with so many diverse backgrounds and so many professions, and we're not on every committee. So we can't vet everything in the committee with everybody. So when we get in here, the rest of us should have a chance, y'all. But on this one, we didn't even get to do it in committee. So why are we falling away from being able to do our jobs, and why are we letting it happen? So I just use this bill as another example, ladies and gentlemen, of how we are just. We're just, we're just a train monkey could vote yes or no. We don't need to come down here for that. We could do that on Zoom. It could be an email. Let's do the work. Talk more. Let's deliberate. Let's make some changes, and I bet you we make some better law. And I bet you we'd all we collaborate more. We would get better law, and we probably wouldn't have as many clean up bills. I urge you to vote no. And more than that, ladies and gentlemen, can we all lobby to get to do our job? Thank you, and I yield the well. The lady has yielded the well. That completes our minority report. We'll move on to the chair's time. Chair of the committee of rules, chairman Parrish is recognized to speak to the bill up to 20 minutes, Mr. Chairman. Thank you, Mr. Speaker. I'd like to yield my time to lead your frustration. The gentleman has that right. The gentleman has yielded his time to lead their frustration. The gentleman's recognized. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I know the hour is late. But before you, Senate bill 255, this legislation is very simple and straightforward. Currently, constitutionally, this body, the legislative branch of the legislative branch, the legislative branch of government, has rights, has constitutionally recognized rights to do already what this bill covers. That is recognized in courts of law. But what we don't have in statute to answer the question, what we don't have in statute, is it clearly laid out how we are to use these rights and abilities that we have. We need clarity in the code for use to assert our legislative authority as a co-equal branch of government. This is a very reasonable measure when we recognize and accept that we have responsibilities on behalf of our constituents, we have responsibilities as a legislature. And the constitutional authority is simply being codified here with particulars as the process by which the House would and the Senate would through resolution authorize a special committee to administer oaths and issue subpoenas for testimony and documents. SB 255 simply enables committees to exercise these authorities with proper authorization and consent from the chambers and a legal foundation that would be found in law. And previously investigative committees have operated with uncertainty, relying on ad hoc procedures or informal interpretations of House or Senate rules. SB 255 would replace that ambiguity and provide a clear statutory framework. Additionally, this bill will ensure responsible handling of sensitive or confidential records such as whistleblower identities or proprietary information. This kind of care protects both the integrity of the investigation and the rights of those involved in the process. The bill does not expand the legislature's power. It affirms and provides organization around it. All of the current immunities and privileges for legislative authority remain intact. SB 255 adds clarity. A defined process for how investigative powers can be exercised at the committee level. And it ensures the same rules apply whether the issue at hand is potential mismanagement at say an agency misuse of funds or a breakdown in delivering for our constituents, the people of Georgia. Finally, transparency is being maintained here. These powers are only granted through a resolution by the body laying out the circumstances in which these subpoenas are to be issued. And specifying the committee where this is to be part of an open process available to the public. Ladies and gentlemen of the House, SB 255 strengthens our ability to seek the truth on behalf of the Georgians that each of us represent. And it gives the legislative investigation committee potential for the future, the structure and legitimacy needed to ensure that there is cooperation that we can get the answers that we need and that we can preserve confidentiality when necessary under those circumstances. And actually deliver results for the people of our state. I urge you to support SB 255 so that our legislative body can continue fulfilling its duty to provide rigorous and oversight and accountability. But doing so when necessary with constitutional authority we have under a statutory framework. I hope that we pass tonight. Thank you and I yield the well. The gentleman is yielded the well that completes our discussion on Senate Bill 255. The minority report in the chairman's time. Is there any objection to adopting the committee's substitute? Here in the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report of the committee's agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Yes. Mr. Clerk, will you lock the machine? All in the passage of Senate Bill 255, the yeas are 91. The nays are 67. The bill, having received a requisite constitutional majority. The constitutional majority is therefore passed. Mr. Clerk. The representative of the council is recognized for a motion. We're on to an agreed. We're about to the end of the road here. The representative of the council is recognized for a motion. Mr. Speaker, ladies and gentlemen, I move this House agree to the Senate amendment to the House substitute for SB 40. Will you read the caption? SB 40 by Senator Hatch. The 50th and others to be entitled to amend Article 14 to Chapter 1 and Title 10 of the EFISCO to Georgia and Attain to Related to Secondary Mental Recycling Sows to provide for applicability of the definition of the term used detached catalytic converters. Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Is there any objection to adopting of the Senate amendment? Is there any objection to German move? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? Mr. Clerk, would you like to ask a question? All those in favour will vote aye. Those opposed will vote no. Mr. Clerk, on lock machine. Mr. Clerk, on lock machine. All members voted. Mr. Clerk, would you like the machine? The House has voted to agree the A's or 91, the days of 63, to the Senate amendment, to the House substitute. Now we'll vote. That's final passage of this House agreed to the Senate amendment. House has agreed to the Senate amendment to the House substitute to SB 40. For what purpose is representative Jasper Ryes? To make a motion. To make a motion. The rules of the House be suspended so bill can be read for the first time in the Senate committee. Mr. Clerk, would you read a caption? A number of House resolutions by representative Jasper, the 11th creating a House study committee, and five points of our station permit issuance. All the general's motion that the rules of the House be tipper is suspended so bill can read for the first time in the Senate committee is the objection. There is objection to gentlemen move. For what purpose is representative Jasper Ryes? Here. Thank you. I'd like to withdraw my motion. Thank you. Thank you members. We'll move on to something you've been wanting to hear all afternoon. It's not afternoon orders. It's almost. We're going to start recognizing some folks. We have some folks. Representative Sharper. Representative Hagen. Chairman Petrie. Members, we need your attention. We have several members who need to express condolences. Members, give your attention to the member in the well. Representative Sharper. Do you have something going up on the screen? Representative Sharper is recognizing friends. Thank you speaker. Members of you will stand. Thank you. All right today. You guys today my heart is heavy as I share the passing of my friend and fellow EMS professional Bruce Phelps. After a courageous fight with cancer Bruce went home to be with the Lord. Bruce wasn't just an EMT. He was a true serving of God who touched the lives of everyone he met. He had a way of bringing joy to every room he entered. And his kindness and compassion were felt by all who had the privilege of knowing him. Whether on the job or in everyday life, Bruce's genuine love for people shown through every day. He truly embodied what it means to serve with a heart full of grace and dedication. Working alongside Bruce for several years, I saw firsthand the unwavering commitment he had for helping others. His smile, his laughter and his selflessness made the tough days a little bit easier. And the good days even better. Bruce loved deeply, served faithfully, and left a mark that will never be forgotten. To Bruce's family and loved ones, know that he was cherished and admired by so many. We are praying for comfort and peace during this difficult time. Rest easy, Bruce. You made a difference in this world. And your legacy of kindness and service will live on in our hearts. And also last year, he won EMT of the year in Georgia. And last conversation with him was last year when he said, Dexter, cancer is taken over my body. He said, but instead of me taking the meds and the treatments and getting sick and not being able to take care of my patients, he said, I made peace with the Lord. And I made peace with my man, you know, coming man, the women. He said, I'm okay. And I'm going to be okay. And that's the kind of love we have to have in our hearts and the love we have for each other and the love for God. So we're going to miss him. He's a great servant. And let's please have a moment of silence for him. Thank you, colleagues. Thank you. Thank you. Members of your remains standing. Chairman Petrie has recognized for condolence. Thank you, Mr. Speaker and colleagues. I rise today to recognize a great man, a great friend, a native Sivanian, longtime, Tobi Island resident, Barry A. Brown, who served on Tobi City Council for many, many years, planning commission, marine rescue squadron. He actually grew up. His daddy was a contractor. My granddaddy was a bricklayer. They were close friends. And I saw our families go way back. He was a great man. His greatest love in life, his greatest treasures, his wife's sonny, his lovely wife's sonny of over 50 years. We lost him recently and his greatest treasures is children. His daughter Lauren, his son Brandon, and his grandchildren Colby Tyler, Braden and Phoenix. He was a great friend to Tobi and I'd ask for just a quick moment of silence. Thank you. Thank you, Mr. Speaker. Thank you, members. You may be seated. We have a couple of afternoon orders. Gripsley Park, Kenan's recognized for an afternoon order. Ladies recognized. Thank you, Mr. Speaker. Thank you, members. I know many members are rushing out the back. I know you have long commutes and I want to thank everyone for being here today. It's interesting being a member who's been here for a little while but is still young. It's like watching your uncle do something really weird and then expect you to just like look past it. I've experienced over these past 10 legislative sessions. What's considered gaslighting? I just wanted to talk about it a little bit. It's basically when something happens to someone and someone else tells them no it didn't. You were wrong. You perceived it incorrectly and then uses their power like literal actual fire power to squash that person. For many people today, you have gaslit us. I'd like to respectfully ask, please stop doing that when we come back on Friday. I just want to close with some questions. Maybe we can think about before we go home and come back. Do you have to agree with someone to defend them from injustice? When did you first experience powerlessness? How many Georgians have to suffer for you to succeed? Do you believe in karma? What was the last time you cried? Did you think for yourself today? How will history remember you?\n\nWhen you were told you offended someone today, did you reflect and or apologize? Who do you think of when you hear the word worthy? Thank you, Mr. Speaker, I yield. We're representing Miller. Chair Miller has recognized for an afternoon order. Thank you, Mr. Speaker. Earlier today, unfortunately, was not in the chamber. I was outside the chamber with my colleagues talking to the people of Georgia. But I'm told that there was a reference made about me in the chamber when I wasn't here. So I want to make sure I address that reference to my colleagues into anyone who wishes to address me or my position or how I represent my constituents. If I want to vote no on something, I vote no on something. None of you all define for me why I do what I do except the people of House District 62. I'm taking a position of support for taxpayer funded sex changes of state prison. I know what I told you was. I was tired of y'all playing and wasting our time on problems that don't exist for five imaginary people. So if you're going to talk about Tanya, run till that. I'm going to leave the room. I'm going to leave the room. Thank you, Mr. Speaker. I'm going to leave the room. Thank you. We're going to leave the room. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. I rise because this past weekend, a Dunwoody Police Officer, was involved in a head-on collision. He is recovering and recovering well. He is recovering. He is recovering. He is recovering. He is recovering well. And so I just wanted to wish him a continued speedy recovery and for us to recognize just how dangerous that profession is. Thank you, Mr. Speaker. Chairman Sains, the recognize from the afternoon order. Thank you, Mr. Speaker. I know the temperature in here is pretty cold. So I figured it'd be a great time to invite folks to the beach on Jack O'Lall and one of the most beautiful treasures of our state, the foundation that supports our authority that does a great job being a welcome mat for. Georgians and non-Georgians alike will be having their gala on May 2nd through 4th, the Guilded for Wildlife. And they wanted to make sure that all the legislature was invited. If you have questions on it, there's a QR code on your desk. Thank you. Leader, if stress is recognized for an afternoon order. Well, thank you, Mr. Speaker. I know it's been a long day and it's late. I also feel I've been in this well a lot today. So it really pains me to have to come back. I really just want to share what's on my heart at the moment today. I believe that this is a very special place. And what we do is a very important job. I believe that we shoulder tremendous responsibility when we come here for these 40 days. It takes a great toll on us personally, professionally, but we do it out of a sense of public service. That we have great protections in the law that are well-founded from many decades of court interpretations, of a legacy of legislators who have served in this chamber, served under this gold dome, and brought forward traditions for us to consider. What we say and do in this chamber is entitled to certain legal protections is allows us to have free and open debate, ultimately, to put a vote up on the board and reflect our convictions and our constituencies in the way that we believe, most appropriate to do so, and that we believe is effective on our constituents' behalf. What is unfortunate to me is after a day of debate where the issues have been debated that we were here to, we were elected to come here to the Capitol and debate and discuss, that names are then called, that folks are then members, distinguished members of this body are then asserted that there is alterer motives and that questions are posed put forward as if members did not give adequate consideration to their action here today. What's further concerning is deciding to media reports when the member wasn't present in the chamber. What I would just say is I respect this body immensely. I respect each and every one of you, even if I do not agree with you. But I do think being here serving in this general assembly, being a member of this house is a special thing that we cannot take for granted, that our constituents, the people of Georgia, and I think the traditions that we have here require that we be willing to step forward and put up votes that we make our voice heard and reflect our constituents. Game playing and then calling it gas lighting is not the answer. Walking out of a chamber and playing games doesn't advance policy to the betterment of all Georgians. So I feel strongly enough to come here in afternoon orders to let you know how I feel. And I hope that there will be a return to a policy focus in this chamber where there's a good faith debate on issues and members who have the courage to actually put up a vote. And thank you, Mr. Speaker, I yield a vote. We have a couple of announcements and in one last afternoon order, Representative Corbett, members will pay attention and give the gentleman in the well your attention for an afternoon, excuse me, for an announcement. Gentlemen's recognized for an announcement. Thank you, Mr. Speaker. The rule caucus will have our last meeting tomorrow at lunch. We will be frying fish, all the tremens, everybody's invited. Y'all come join us, let's break bread and have a good time. Chairman Peres is recognized for an announcement. Thank you, Mr. Speaker, on a little lighter note, we will not have a rules meeting in the morning at nine o'clock. So you can all get a little extra rest in the morning. We will meet Friday morning at nine o'clock this morning. Thank you. Thank you, Mr. Chairman. We have one, we have a couple of announcements and we have another announcement. Chairman Hilton is recognized for an announcement. Thank you, Mr. Speaker. I'd just like to announce that the braves are currently winning five to three. Should they hang on, that will represent their first win of the season. So let's all go home and watch the braves and help pull out that win. All right, go braze. Okay, members, we have pages that have been with us all day for a long day. Let's give our pages a hand. Where are our pages? Senator, our page is in, please. I think they finally gave up, went home. I think they finally gave up, given up and gone home. So members, there's one last afternoon order. And that's mine. We've had a long day. For different members, it's been a good day. Some are not so good day. The emotions have run high all day. Mine has. I have attempted to give great latitude to every member of this house. To make their comments, their heartfelt comments. I've also made every attempt to follow the rules of this house. That you and me, the members of this house voted on. Now, I have not heard, now I don't hear everything, but I've attempted to listen. Not heard anyone be called out in violation of our rules of this house. There's been a lot of things said today on both sides of the aisle. Today is in the record book. It's in the history book. We have a budget to pass. They benefit the people of this state. I'm going to look forward. I'm going to have a conversation with those that were for and against. And do my best to understand everything we did today. And the impacts for years to come. I hope you do what we'll do the same. Thank you for your service today. Thank you for your time. Thank you for our doorkeepers. This day with us all day. Thank you. Thank you. Appreciate it. Each and every one of you.",
  "updated_at": "2026-02-14T03:37:01.467781+00:00"
}