{
  "video_id": "ICQ4REUC9cs",
  "url": "https://youtu.be/ICQ4REUC9cs",
  "title": "Georgia House - Day 39 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-03-29",
  "duration_minutes": 11,
  "summary": "Here is a structured summary of the key events in the Georgia House session transcript:\n\n**Overview**:\nThe session included the adoption of several commemorative resolutions honoring the lives and service of notable Georgians, including county officials, military veterans, civil rights leaders, and HBCU presidents. The bulk of the session was dedicated to the presentation and adoption of these resolutions.\n\n**Key Actions**:\n**HR 269**: Dedicating the intersection of State Route 101 in Floyd County as the Private Carl Clifton Evans Memorial Intersection\n**HR 393**: Dedicating a portion of State Route 78 in Haralson County as the Commissioner Bradley Scott \"Brad\" Vines Memorial Highway\n**HR 429**: Dedicating the bridge on Interstate 20 in Fulton County as the HBCU Presidents' Hero Bridge\n\n**Bills Introduced (First Reading)**: None noted\n\n**Notable Moments**:\n- The House recognized and honored several notable Georgians, including county officials, military veterans, civil rights leaders, and HBCU presidents, through the adoption of commemorative resolutions.\n- The session included a moment of silence to honor the individuals recognized in the resolutions.\n\n**Votes**:\n- The resolutions were adopted unanimously, with no recorded opposition.\n\n**Attendance**:\n- A quorum was present, as indicated by the lack of any notes about attendance or lack of quorum.\n\n**Adjournment**:\n- The House stood at ease until 3:15 pm, but the transcript does not indicate a formal adjournment time or the date of the next session.",
  "transcript": "The House will come to order, the House will come to order.\nThe clerk will read the caption to a group of privileged resolutions, honoring the life\nand memory of Ralph Lowe, honoring the life and memory of Tyler Mayor Studsell, honoring\nthe life and memory of Billy Franklin Payne, honoring the life and memory of Michael Hart\nCampbell.\nCommending the Clayton County Chamber of Commerce and recognizing February 10, 2021 as Clayton\nCounty Chamber Day at the State Capitol, recognizing commanding Pamela Stevenson, recognizing\ncommanding the accomplishments of the John's Creek Chamber of Commerce, recognizing\ncongratulating the Carol L. Comer upon the grand occasion of her retirement.\nCommending the Big Haines Creek Nature Center located at the Georgia International\nHorse Park, recognizing commending Cam T. Ashling, recognizing and commending coach Lloyd Pierce,\nand for other purposes that completes the reading of the privilege resolution.\nIs there an objection to adopting the privileged resolutions?\nThe chair here's none, the resolutions are adopted.\nClerk will ring the bell.\n.\n.\n.\n.\nDid the caption to Senate Resolution 39, Senate Resolution 39.\nSenate Resolution 39 by Senator Dixon to the 45th,\nGooch to the 51st, Beech to the 21st, Miller to the 49,\nThompson the 14th and others.\nA resolution recognizing the honorable Charlotte Nash in dedicating the intersection in her honor.\nresolution have been referred to the committee on transportation that committee recommends that\nthis resolution be adopted by committee substitute. The chair recognizes Chairman Jasperce to present\nthe resolution. Thank you, Madam Speaker. As we, our state representatives, we have a great\nhonor and responsibility to honor Georgians, either through their service to our state,\nthe sacrifice they made or some honor.\nI have the opportunity now to read 15 resolutions, I'm not going to read them all, but tell you\nabout a little bit about what these people are.\nIf we'd all stand in their honor, I would appreciate it.\nIt's our 39, did the case of intersection at State Route 316 in Gwinnett County to Charlotte\nNash intersection.\nCharlotte Nash served the Gwinnett County Government for 27 years and most recently\nas County Commission Chair.\nHouse Resolution 220, a portion of State Route 125 in Bury in County, as the Homer C. Sumner\nMemorial Highway, home or some some are died in action at the Battle of the Bulge while serving\nas country during World War II. House Resolution 221, dedicating state route 125 in\nBury and County to Charles D. Rogers Memorial Highway. Charles Rogers served as the guardian\nof the nation's freedom with the United States Navy during World War II.\nHR 269. Dedicating the intersection to State Route 101 in Floyd County as a private\nCarl Clifton Evans Memorial intersection. Private Carl Clifton Evans\nKirch courageously served to protect his country during World War I. House\nResolution 270. Ded came a portion of US 27. The Georgia Tennessee line to\nCarroll County line as a Georgia Grown Trail 27.\nAs we know, Georgia Grown Trail serves a tool\nfor economic development that is ripe with agrotourism.\nHouse Resolution 283 declaring the intersection\nof US 29 in Hart County as the American Legion Post 109\nintersection.\nThe American Legion Post 109 in Hart County\nis committed to serving the community\nand show an appreciation for this nation and its veterans.\nHouse Resolution 284,\ndedicated to the portion of State Route 281\nin Madison County as a Judge Donald Hoppy,\nRoyston Highway.\nJudge Donald Hoppy, Royston,\nserved in the Madison County as a probate judge\nand as the election superintendent for 32 years.\nHouse Resolution 285,\nthat indicates a portion of US 29 in Hartwell\nas the Veterans Memorial Highway.\nThe United States Military Veterans\ndemonstrated a deep personal commitment\nto protecting democracy.\nHouse of resolution 286 that indicates a portion\nof state route 108 in Pickens County\nas Dr. Tom and Jean Boswell Memorial Highway.\nDr. Boswell served in the United States Air Force\nduring World War II, listing after the bombing of Pearl Harbor,\nas wife Jean served him later as a nurse\nand his practice as an obstetrician.\nHouse Resolution 353, dedicated to Bridge\non state route 166 in Fulton County\nas a General Larry Platte Bridge.\nGeneral Larry Platte began his activism in 18\nand alongside Dr. Martin Luther King and Hosea Williams\nwho gave him the nickname General,\nas efforts on behalf of Civil Rights Movement.\nHouse Resolution 354, dedicated Interchange at Interstate 516\nin Chatham County as the Mayor Edna Jackson Interchange.\nMayor Edna Jackson was the first African-American woman\nto be elected mayor of Savannah.\nHouse Resolution 355, dedicated Interstate Interchange\non Interstate 16 in Chatham County\nas the representative Bobby L. Hill interchange.\nRepresentative Hill served as a member\nof the Georgia General Assembly for 14 years\nand found the National Legal Network.\nHouse Resolution 392,\ndedicated to portion of State Route 81 in Newton County\nis the M. Master Sergeant Mark Allen\nand Sergeant Mike Stokeley Memorial Highway.\nMaster Sergeant Mark Allen and Sergeant Mike Stokeley\nserve their country in Iraq, both paying the ultimate sacrifice in separate instances,\nalways committed to the selfless service to this country.\nHR 393, dedicated in the portion of state route, 78 in Herylson County as a commissioner\nBradley Scott or Brad Mines Memorial Highway.\nBradley Scott vines devoted numerous hours of his time in the energy toward the betterment\nof this community as a county commissioner.\nAnd lastly, HR 429 dedicated the bridge on Interstate 20\nin Fulton County as the HBCU president's hero bridge.\nHistorically, black colleges and universities\nhave been educating, giving opportunities\nand installing values to minorities for more than 100 years.\nMadam Speaker, that's a road dedication.\nI would take a moment of silence and honor\nall these great Georgians thank you gentlemen has yielded the well is there any\nobjection to the previous question being ordered the chair here's none the\nprevious questions ordered is there any objection to adopting the committee\nsubstitute the chair here's none the committee substitute is adopted is there\nan objection to agreeing to the report of the committee which was favorable to\nthe adoption of the resolution the chair here's none the report of the\ncommittee has agreed to show this resolution now be adopted. All in favor of the adoption\nof the resolution will vote yes. All those opposed will vote no and the clerk will unlock\nthe machine.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the adoption of the resolution the yeas were\n147 and the nays were zero.\nThe resolution having received the requisite constitutional majority is therefore adopted.\nthe chair recognizes the rules chairman for an announcement.\nThank you, Miles Speaker.\nRules committee will meet at 245-245.\nThe House will stand at ease until 315.\nYou\n",
  "updated_at": "2026-02-12T13:16:20.733795+00:00"
}