{
  "video_id": "iEvpoo6rKTQ",
  "url": "https://www.youtube.com/watch?v=iEvpoo6rKTQ",
  "title": "Rules PM Meeting for day 28 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for day 28 of the 2025 Session:\n\n## Overview\nThe session covered several bills, including HB384 on standardizing police officer oaths, HB57 amending the Insist's Law, HB35 increasing pay for special prosecutors, HB471 on water safety for infants, HB704 transitioning to an annual reporting dashboard, HB675 creating an offense for terrorist financial attacks, HB133 allowing religious studies off school premises, HB101 mandating insurance company rebate reporting, and HB285 providing a process to remove involuntarily committed individuals from criminal background checks. The main focus was on a rule substitute for HB521 related to annexation.\n\n## Key Actions\n- **HB521**: Rule substitute LC 473531 passed, relating to annexation requirements.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Discussion and passage of the rule substitute for HB521 on annexation.\n\n## Votes\n- HB521 rule substitute passed with no opposition.\n\n## Attendance\nNo quorum notes mentioned.\n\n## Adjournment\nNo adjournment or next session date provided.",
  "transcript": "If you would, come on in, let's close the back door and we'll get started.\nOkay, come on up.\nThank you, Mr. Chairman.\nHouse bill 384 peace officer Oathville this bill complies there's two key\nobjectives it establishes uniform standard eyes oath for all peace officers in\nGeorgia and second ensures that officers can only be prosecuted for violating\nthe specific terms of this standard eyes of 384\nIt came out of committee this morning. It's not only blue sheet go ahead and tell us what it's about since you're here\nSo this this standardized house bill 384 standard eyes is the oath that our police officers take throughout Georgia\nAnd second it ensures that officers can only be prosecuted for violating the specific terms of this standardized oath\nright now these those include aspirational language the different departments\nput in there of this just standardizes those for law enforcement throughout\nGeorgia okay those any questions if you would tell us where it is on the blue\nsheet please\ngood afternoon sir my bill is not on the blue sheet it passed out of committee this\nthis morning, it's HP 5.7, LC481361.\nThis bill passed previously two years ago out of the house.\nIt's, all the thing it does is amends the incess law in Georgia\nto add step-grandparent, step-grandchild relationship.\nThese are not on the blue sheet yet,\nbecause we just came out this morning.\nSent to here, let them go ahead and tell us about it.\nHouse Bill 57, right?\nYes, sir.\nExcuse me.\nThank you.\nThis bill amends the Insist's Law of Georgia\nto add step-grandparent step-grandchild relationship.\nIt previously passed the House two years ago\nand went to the Senate, but we have to go back and do it again.\nOK.\nSame exact bill.\nDon't see any questions.\nThank you, sir.\nYes, sir.\nThere's a really.\nThank you, sir.\nI bring the House Bill 35.\nIt passed out of the same committee this morning\nwith the resident of Cameron and Seaball.\nIt increases the pay for special prosecutors.\nCurrently, special prosecutors are capped at $66.87 an hour.\nThis raises up to 250 for attorneys\nand up to one ten an hour for staffers and set by PAC.\nAnd it's adjusted yearly for inflation.\nOkay, no questions.\nThank you, sir.\nRepresentative Chokers.\nThank you.\nI've got one on the blue sheet 471,\nwhich emphasizes water safety for infant children\nIt's at the bottom of page four the second one is not on the blue sheet\nAnd this was a house bill 704. It was introduced last year by Clay Perkel and it\nThis measure requires the departments of audits to transition from an outdated monthly report to an annual updated report\nThat's going to be dashboard searchable on open Georgia website and it's an agency bill\nNo questions. Thanks, sir\nThis bill also came out of committee this morning, it's House Bill 675, which is LC number\n481580 ERS.\nThis bill creates an offense and penalty for materially, intangible and financial terrorist\nattacks, therefore allowing local prosecutors to hold people accountable that are propping\nup terrorism.\nOkay.\nNo questions.\nThanks sir.\nThank you.\nThank you.\nAbsolutely.\nClark.\nThank you.\nThank you, Jim and members of the committee.\nI'll bring in House Bill 133.\nIt's page two.\nSecond from the top.\nAnd it just allows local school agencies saying that they may create policy to allow at least\ntime for religious studies off school premises and it falls in line with the 1952 Supreme\nCourt ruling.\nAnd would I take any questions?\nNo questions.\nThank you, Chairman.\nYes, sir.\nThank you, Mr. Chair.\nHouse Bill 101 is the third from the bottom\non the first page, House Bill 101.\nAnd basically, this is a bipartisan transparency bill\nthat mandates all health insurance companies\nand promising benefit managers of Georgia\nreport to the state of Georgia their findings.\nSo the state health care benefit plan\npublic school teachers health care plan and the public school employment\nhealth plan. They say they take all our rebates and we don't know our premiums\nkeep going up and we just want them to account for the money that they say\nwe're saving on our rebates. That's about it. Okay don't see any questions\nthanks sir. Thank you sir. This is House Bill 285 it reported out of GD\nnon-civil this morning, and what this bill does is provides a procedure for people who\nare involuntarily committed to the hospital to be removed from the criminal background\nchecklist rather than a computer purging.\nIt would be a process.\nOkay.\nNo questions.\nThank you.\nThank you.\nOkay.\nOkay, I'm going to call on the administration to speak to the rule substitute for House\nBill 521.\nThank you, Mr. Chairman.\nSo I present to you a proposed rule substitute, the HB521.\nThis was originally Chairman Anderson's bill and the language from Chairman Anderson's\nbill remains in this legislation with respect to the annexation. There is a section that is added\nin section 2 which would apply to Pauline County which includes the language captured in B which\nwould require any annexation that is to occur. Be by consent of the county and the city would\nonly apply to Pauling County, but ask for your favorable consideration.\nAnd this comes with the support of Chairman Gullet.\nOkay.\nYou've heard the explanation of entertain a motion, second motion, and second that do pass\nany opposition.\nOkay.\nIt passes.\nOkay.\nNow, let's set up a calendar.\nwill be our supplemental calendar for today House Bill 54 moving second any\nopposition it's on House Bill 56 in the opposition it's on House Bill 161\nin the opposition, it's on hospital 224, in the opposition, it's on hospital 250, in\nposition. It's on. House Bill 331. In the opposition. It's on. House Bill 433.\nIn the opposition. 433 is on. House Bill 439. Move in second. In the opposition.\nSecond any opposition it's on House Bill 521 by room substitute LC 47 3531 is\nMoving second any opposition it's on\nI spill 535\nAny opposition it's on I\nSpill 571\nAny opposition it's on\nSo, House Bill 593 in the opposition being green says he voted for it so, House Bill 614 in the opposition it's\nSo that's bill 618 in the opposition. It's on that's bill 627 in the opposition. It's on that's bill 638 in the opposition. It's on house bill 718\n",
  "updated_at": "2026-02-12T18:20:23.059443+00:00"
}