{
  "video_id": "IhaDrMAlyGo",
  "url": "https://www.youtube.com/watch?v=IhaDrMAlyGo",
  "title": "Sen.Merritt Press Conference on GLBC Priorities | 02/02/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 21,
  "summary": "Here is a structured markdown summary of the Georgia Legislative Black Caucus press conference on their 2026 legislative priorities:\n\n## Overview\nThe Georgia Legislative Black Caucus (GLBC) held a press conference to unveil their 2026 legislative priorities, which were shaped directly by the voices, needs, and lived experiences of the communities they serve. The priorities focus on key areas like economic justice, healthcare access, housing, voting rights, education, and criminal justice reform.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The GLBC chair emphasized the caucus' commitment to advancing justice, equity, and opportunity for all Georgians.\n- Rep. Jasmine Clark discussed the importance of the Georgia Civil Rights Act of 2026 (HB 670/SB 320), which aims to strengthen civil rights protections in the state.\n- Christopher Bruce of the ACLU of Georgia spoke passionately about the need to defend civil rights and liberties in Georgia.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nNo specific quorum notes.\n\n## Adjournment\nThe press conference concluded, but no specific adjournment time or next session date was provided.",
  "transcript": "Okay. Good afternoon and thank you all for being here. I want to welcome members of the\npress, our community partners, advocates, and mostly importantly, the executive board\nand members of the Georgia Legislative Black Caucus. I am deeply honored to serve alongside\nthis dedicated group of legislators who represent communities across our state and who are\nunited by a shared commitment to justice, equity, and opportunity for every\nGeorgia. Today we gather to officially kick off Black History Month by unveiling\nthe Georgia Legislative Black Caucus, because Black Caucus is 2026\nlegislative priorities. Priority shaped directly by the voices, needs, and\nlived experiences of people that we served.\nIn October 2025, members of the Georgia Legislative Black Caucus identified legislative initiatives\nand critical to constituents.\nThe Georgia Legislative Black Caucus members are committed to supporting legislation that\nfocuses on these combined members responses.\njustice in access to wealth. That includes protection and aid for black land owners and\ntheir heirs. Expand contracts and access to credit for minority-owned businesses. Advocate\nfor the use of a percentage of the surplus to strengthen economic growth. And lastly\nto increase the minimum wage.\nOur next priority health access and equity,\nexpand health care options based on income eligibility,\nexpand options for maternal health care,\nrequirement for prostate screening, protections,\nand increase options for rural Georgians,\nmore than adequate funding for mitigating food deserts,\nand ensuring school-aged children\nand their vulnerable populations are properly nourished.\nOur next priority will be housing access.\nAs we know, housing is probably one of the top issues\nthat I keep hearing.\nSo we want to advance fair housing initiatives\nin dismantle barriers that perpetuate\nresidential segregation.\nEliminate source of income discrimination in Georgia\nincluding a source of income as protected class in Georgia in the Fair Housing\nStatute. Established tenant protections and create eviction standards statewide.\nProtect homeowners from selective discriminatory enforcement by HOAs.\nNext we have voting and civil rights. Supporting consistency in election\nadministration across all 159 counties in the state of Georgia.\nIncreased civic participation through standard K through 12 initiatives.\nEnsure the proper funding is in place for counties to run their elections.\nMandate that counties serve as centralized election administrators for\nmunicipal elections. Clear audit authority and transparency measures for the\nSecretary of State. Next, we have education. Prioritize expansion of funding for K-12. Prioritize\nexpansion of funding for HBCUs. Create extensive workforce pipelines, and a continued focus to\nexpand early literacy programs. Next is criminal, just criminal justice reform, excuse me.\nTrust-based policing and public safety standards to support constitutional and\njudicial protections for all Georgians. We will continue to uplift reentry\nprojects that support jobs, housing, and stability to cut recidivism. At the heart\nof our agenda is a clear and urgent commitment protecting civil and\nand constitutional rights while expanding access\nto economic opportunity.\nQuality health, safe and affordable housing,\nstrong educational pipelines,\nand a comprehensive criminal justice reform.\nAdditionally, as current events threaten\nthe safety of Georgians,\nthe Georgia Legislative Black Caucus\nwill stand in the gap.\nThe GOBC's priorities are not theoretical.\nThey are community driven, evidence-based,\nand rooted in the realities facing families across Georgia.\nCentral to this work is our full support\nof the Georgia Civil Rights Act of 2026.\nThat's going to be, that is House Bill 670\nand Senate Bill 320.\nThis legislation represents a cornerstone of our agenda\nand a necessary step to close gaps in protection,\nstrengthen accountability, and ensure that civil rights\nin Georgia are not optional, but are guaranteed.\nToday, we will hear from legislative leaders\nand community voices who will speak to the urgency\nof this moment, the Legal and Moral Foundation\nof this work, and the collective action required\nto move these priorities forward.\nThis is about more than policy.\nIt's about power protection and legacy.\nIt is about connecting legislation to the lives of people.\nThe Georgia Legislative Black Caucus exists\nmore than just during the legislative session.\nWe are committed to leading Georgia 365 days a year.\nTo keep up and follow our work,\nplease visit us at www.GeorgiaBlackCockets.org.\nThank you for being here.\nWe look forward to working together.\nOh, I'm going to call up Representative Clark and she will be introducing and speaking\non House Bill 670, our civil rights legislation.\nThank you so much Madam Chair.\nAgain, my name is Dr. Jasmine Clark and I represent Georgia's House District 108, which\nis located in the Lillburn area of Gwyneth County and I am the sponsor of House\nBill 670 or the Civil Rights Act of 2026. In a state that produced prominent\ncivil rights leaders like Martin Luther King and John Lewis, Andrew Young and\nJosea Williams, and so many others, it is actually shameful that the state of\nGeorgia has less protections against discrimination than some of our Southern\nneighbors like Mississippi, Tennessee and Texas. For example, at the state\nlevel in Georgia, there is no law barring discrimination due to race or religion\nin public places. The same is also true for employment in the state of Georgia.\nThere is no state-level law that protects people.\nAnd in both of these instances, a person does have federal protections,\nbut having to fight for your civil rights at the federal level can be intimidating,\nit can be expensive, and it can feel out of reach for so many Georgians.\nAdditionally, this bill will require the state of Georgia to collect data on racial profiling\nand traffic stops by law enforcement.\nBelieve it or not, once again Georgia is behind other southern states in this endeavor.\nAs this is already done in states like Texas and Louisiana, North Carolina and Virginia.\nWe as a nation are watching the unraveling of civil rights happen right before our eyes\nall across the country.\nWe have top level officials in this country that are attacking diversity, equity and inclusion\nas if they are dirty words.\nWe have people at both the state and federal level that have been doing all that they\nthey can to deny, rewrite, or just straight up remove\nan accurate telling of our nation's history.\nThe Civil Rights Act of 2026 is a reminder\nthat freedom is always a work in progress.\nIt's like a group project that we all\nmust participate in in order to make our state a better place\nfor everyone to live and to protect the rights\nof all who call our state home.\nAnd so that is why I am pushing\nthe Georgia Civil Rights Act of 2026, House Bill 960.\nThank you.\nThank you so much hey you didn't ever know I was like hey back it off oh there you go\nget afternoon thank you for saying that I do appreciate it because this is a great afternoon\nto talk about what Georgians need.\nHi, my name is Christopher Bruce.\nI am the deputy executive director\nfor the American Civil Liberties Union of Georgia,\nan organization that is dedicated to defending your civil rights\nand liberties in this state.\nNow, I have prepared remarks, but state representative\nJasmine Clark did so well laying out\nthe comprehensive civil rights bill.\nI'm going to take up from what she had said.\nand really emphasize and talk directly to the people\nabout what's happening right now.\nYour rights are being trampled on.\nI don't know another way of saying that.\nYou have an administration that is literally killing people\nin the streets without any type of accountability.\nYou have a time when journalists are being arrested,\nYour entire constitution is at stake.\nYou do have state protections in other states.\nBut for some reason, in the birthplace of our civil rights,\nthe home of Dr. Martin Luther King,\nwe are woefully behind here in the state of Georgia.\nWelfly behind our other southern states,\nespecially when it deals with public accommodations,\nwhen it deals with housing,\nand it would deal with other racial justice issues.\nSo laying out a very simple, plain language,\nGeorgia comprehensive civil rights bill will do what?\nIt will give you the rights that you deserve.\nThe rights that have already been enshrined of you\non the federal level, but guess what?\nYou cannot depend on your federal government anymore.\nThere have been so many changes that have been happening\nwith this administration.\nIf you do not understand that, it's too late.\nYou must demand from your state senators\nand your state representatives\nto pass the Georgia comprehensive civil rights bill\nand you have to demand that they pass it now.\nThank you.\nThank you.\nGood afternoon, good afternoon. My name is John Moe. I'm the Senior Director for Policy\nat the Urban League of Greater Atlanta. And we're here today because of the fierce urgency\nof now. I stand here today on behalf of the Urban League alongside the Georgia Legislative\nblack caucus at a moment that calls for clarity, courage and collective action. We're here\nbecause civil rights in Georgia cannot be taken for granted. This must be protected,\nstrengthened and advanced, not only by the leaders standing behind these microphones, but\nby you the people whose lives and future depends on the laws passed under this gold dome.\nToday I want to speak directly to our community. This time, this is the time to mobilize. This\nThis is a time to stand publicly and unapologetically in support of a strong civil rights bill for\nall Georgians.\nThis is a time to make it clear that discrimination has no place in our state.\nNot in housing, not in employment, not in public accommodation, not anywhere.\nThank you.\nBy passing this bill, it won't happen by hope alone.\nwill happen by through action, through you, through us, through we the people.\nI urge every Georgian who believes in fairness and dignity to contact your state legislators.\nTell them you expect them to protect your rights, your family, and your future.\nTell them you are watching, that we are watching, and you will remember, you will remember\nwho stood on the side of justice.\nShow up at committee hearings.\nYour presence in these rooms matter.\nAnd lawmakers see roles of constituent students and parents and business people and faith leaders.\nThey understand that this is not an abstract policy debate.\nThis is about real people.\nUs, we, the people, real lives in real consequences.\nSo I ask you to educate your neighbors, educate your networks, talk about what this bill\ndoes, why it matters, and what's at stake.\nSaving engagement is not a one-time act.\nIt's a culture.\nWe build together.\nThis is how we protect our communities,\nit's how we honor those who fought before us.\nCivil engagement is power,\ncivil engagement is protection,\nand civil engagement is legacy.\nNow is the time to act.\nThank you.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nOkay.\nAll right.\nAnd with that, we are done.\nI don't think we took up too much of your time.\nBut just to be clear,\ncomprehensive civil rights legislation. This is a bipartisan issue and it is\nabsolutely something both of these chambers can come together and work on. So\nwith that I'm going to open it up to questions for anybody that might have any.\nOkay, oh yeah the house probably we have not taken a position on it yet as a\ncaucus but we will be looking at that legislation to see how it impacts our\ncommunities you know we're we're always concerned with how it's gonna impact\nblack communities. So once we take a look at that, we will put out a statement on how we\nfeel about that legislation.\nYes. He was asking about the property tax bill, not the income tax bill.\nmy overall message was your first question yes our overall message my overall our our our\ncaucuses overall messages let's work on those policies that actually address the the issues\nthat Black Georgians are care about.\nI think our comprehensive civil rights legislation is kind of one of our key pieces of legislation.\nSo my message there is, hey, all my colleagues on both side of the aisle, please work with\nus to pass that legislation.\nThere is no reason we should have it.\nWhat was your second?\nRight. So that's coalition building with a lot of our advocacy groups. Yes, we absolutely\nneed to raise the minimum wage. Companies are, you know, are making all of the money yet\nworkers don't have enough money to even live. So that is again is another policy that\nI would love to have bipartisan support for her, and it's no reason we should not have\nalready raised the minimum wage.\nPeople are having trouble just buying groceries, you know, child care we know as an issue.\nYou know, we have some tariffs, some bad policy on tariffs that are affecting people's\naffordability, and of course we do have a housing crisis to where people, there's not\nenough housing and what's out there people can't afford it.\nSo I think raising the minimum wage would kind of stop the bleeding and help there, so\nSo I look for bipartisan support on that.\nThere's no reason why we shouldn't have legislation raised\nin minimum wages this time.\nYeah.\nSo we can see some of the election bills\nin our policy.\nWe're going to need policy specifically\nto get the concerns out of you.\nAnd those bills are going on in the end of March.\nHow is the end of March?\nYeah.\nYeah.\nI think we're seeing again, our policy is always,\nas the Georgia Legislative Act caucus,\nis protect voting rights, full stop.\nWe know we have a history of our ancestors\nbefore us, fighting for voting rights.\nWe want to continue to adhere to that fight,\nto make sure that we are protecting voting rights.\nAnd then the other part of your specific terms,\nabout the post is to line up in the park, zero rights.\nYeah, so the only thing I'm going to say about,\nwe don't know, I guess the concern right now\nis how much is that going to cost\nand is that the right policy right now?\nI think we're already in the 2026 election.\nI think trying to roll that back at this time\nis concerning, as well as we don't know the overall effects\nand we don't even have a fiscal note\nabout how much this will cost.\nSo that is another piece of legislation\nthat we'll be looking at closely\nand we will make a statement.\nYes.\nWe support black businesses, full stop.\nWhether that be hemp legislation, we support black farmers.\nSo I think full stop for the legislative black caucus.\nWe would be supportive.\nWe haven't digested all the legislation that's out there,\nBut I would say at this time that that is our goal to always support black businesses and black farmers\nYes\nSo the full county delegation will be taking the lead on that I can tell you right\nRight now that we are concerned as this is a voting rights type of bill and any attacks\non our election and setups to interfere with our election, we take very seriously in\nthis legislature and we are asking our colleagues on both sides to take these attacks very seriously\nbecause this was just full and county today but this could happen in anyone's county.\nAll right.\nOkay, thank you all for joining us.\n",
  "updated_at": "2026-02-12T01:33:08.974369+00:00"
}