{
  "video_id": "Il02n4GrVkg",
  "url": "https://www.youtube.com/watch?v=Il02n4GrVkg",
  "title": "Georgia Senate 2026 - Day 3 AM Session 2",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": null,
  "duration_minutes": 38,
  "summary": "Here is a summary of the Georgia Senate 2026 - Day 3 AM Session 2 session:\n\n**Overview**: This was a routine morning session with no major legislative actions taken. The focus was on excusing absences and a prayer by the chaplain.\n\n**Bills Introduced (First Reading)**: \n- **SB 389**: Amend Code on General Provisions\n- **SB 390**: Amend Code on Homeland Security  \n- **SB 391**: Amend Code on Criminal Offenses\n- **SB 392**: Amend Code on Public Officers and Employees\n- **SB 393**: Amend Code on Property\n- **SB 394**: Amend Code on Motor Vehicles and Traffic\n- **SB 395**: Amend Code on Health\n- **SB 396**: Amend Code on Judiciary\n- **SB 397**: Amend Code on Judiciary  \n- **SB 398**: Amend Code on Crimes and Offenses\n- **SR 563**: Urge Georgia Secretary of State to comply with DOJ voter registration request\n- **SR 567**: Express support for Willie Syndrome awareness day\n\n**Notable Moments**:\n- Chaplain Reverend Britt Madden gave the morning prayer, discussing stories about Admiral Rickover and President Kennedy.\n\n**Attendance**:\n- Several senators were excused for business inside and outside the Capitol.\n\n**Adjournment**:\nThe session adjourned, with no next session date provided.",
  "transcript": "Good morning, good morning, time for convening has arrived, the Senate will come to order.\nAt this time I will ask all unauthorized personnel to exit the building or the chamber I should\nsay.\nYou can stay in the building.\nThat sounds good to me.\nRecognize a senator from the six for a good word of wisdom.\nGood morning, Mr. President.\nI heard you did a fine job this morning.\nSorry I couldn't be there.\nBut I'm sad to report we have no pages today.\nBut that's okay.\nSo I'll take this opportunity to remind all our senators to please promote the page program back home\nAnd let's get these young and\nIntroduce to our great government here in the great state of Georgia\nMr. President the journal has been read and found to be correct. So I move that we dispense with the reading of the journal\nThat sounds good\nNow, we got a chaplain today, if y'all saw, my chaplain was here earlier, and he wasn't\nhere to pray over me.\nWe forgot to pay his preridium, so chaplain, that's something we sort of got now, I'm just\nkidding.\nWe didn't do that, just playing.\nIs there objections, confirmation of the journal?\nHearing none, the journal is confirmed.\nAll Senators who have bills and resolutions introduced, please bring them to the Secretary's desk at this time.\nFirst reading and references the Senate bills and resolution.\nSecretary.\nSenate Bill 389 by Senators Jackson of the 41st and\nothers of the being titled an act to amend Chapter 1 of Title 35 of the Official Code of Georgia Annotated.\nA link to General Provisions, consent to Senate Bill 390 by Senator Jones second of the 22nd.\nto be entitled to an act to amend Part 1 of Article 1 of Chapter 2 of Title 38.\nThe difference is Homeland Security.\nSenate Bill 391 by Senator Parks of the 7th and others.\nBill to be entitled to an act to amend Article 5 of Chapter 11 of Title 16.\nYou're not sure.\nSenate Bill 392 by Senator Albert of the 56th and others.\nBill to be entitled to an act to amend Part 1 of Article 4 of Chapter 12 of Title 45 of the Official Code of Georgia Annotated.\nknown as the perpetrator.\nSet a bill 393 by Senators Kim of the 38th and others.\nA bill to be entitled to an act to amend Article 6 of Chapter 3 of Title 44 of the Official Code of Georgia annotated.\nPublic safety.\nSet a bill 394 by Senators Pairn of the 44th and others.\nA bill to be entitled to an act to amend Chapter 2 of Title 40 of the Official Code of Georgia.\nPublic safety.\nSet a bill 395 by Senators Kirkpatrick of the 32nd and others.\nA bill to be entitled to an act to amend Chapter 2A of Title 31 of the Human Services.\nSenate Bill 396 by Senators McLean, the 14th and others.\nA bill to be entitled to an act, to amend Chapter 134 of the Official Code of Georgia Annotated.\nJudiciary.\nSenate Bill 397 by Senators McLean, the 14th and others.\nA bill to be entitled to an act, to amend Chapter 151 of the Judiciary.\nSenate Bill 398 by Senators, Hatchet of the 50th and others.\nA bill to be entitled to an act, to amend Part 1 of Article 3 of Chapter 11.\nJudiciary.\nSenate Resolution 563 by Senators Robertson of the 29th and others.\nA resolution urging the Georgia Secretary of State to immediately and fully comply with the request of the United States Department of Justice to securely produce Georgia's voter registration list in compliance with Georgia's public case.\nSenator is a solution 5 6 7 by senators Kirk Patrick of the 32nd and others a resolution expressing support for the designation of a state parade or Willie syndrome awareness that you miss president that police the order.\nIt is now time for the morning roll call either the emotions to excuse.\nWe're going to ask Senator from the 41st.\nGood morning Mr. President and thank you so much.\nI ask for unanimous consent to excuse the senators from the 5th, the 7th, the 10th, the 17th, the 33rd and the 36th.\nDoes it might miss a memo?\nI'm playing Senator's objection.\nHearing nuns, we excuse the senators from the 5th, the 7th, the 17th, and the 33rd, and the 36th.\nWell, we don't get some things done today.\nAll right, any other motion of Senator, I recognize Senator from the 29th.\nThank you, Mr. President, I ask for unanimous consent to excuse the senator from the 37th for business outside of the Capitol without\nObjects and send from 37th to the skews recognize senator from the 49th\nThat's it my ice 48th\nApologize speaking on behalf of the senator from the 49th good morning, Mr\nPresident\nAsk unanimous consent to please can please excuse the senator from the 47th for business inside the Capitol\nAll right, the object is sitting from the 47th as the skews recognize center from the 43rd\nRockdale, can he's fine as\nAnd the cab and Gwyneth and Newton\nThank you, Mr. President. I ask for unanimous consent to excuse the senator from the 55th\nWithout Jackson Center for the 55th is excused recognize senator from 30th\nAsk for unanimous consent to excuse the center from the face of 51st\nI have Jackson Center for the Feet You First, is Excuse.\nAny other motion is Excuse.\nHearing none, secretary one lock machine.\nYou\nYou\nYou\nIt is now time for the morning, morning devotion, all senators, please take your seats and\ncease all conversation.\nI would ask the doorkeeper, secure the chamber at this time.\nI'd recognize a senator from the 31st.\nIntroduce our pastor today and lead us in our play.\nSenator?\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands\none nation under God, indivisible, with liberty\nand justice for all.\nI pledge allegiance to Georgia flag\nin the principles for which it stands, with the justice, moderation, courage.\nGood morning, Georgia Senate.\nI have the honor to introduce one of our beloved families from the 31st Senate District,\nReverend Britt Madden.\nReverend Britt Madden is a long life resident of Poe County, where his family has resided on the family farm\nfor three and soon to be four generations.\nBrett is the pastor of Cedar Town,\nfirst United Methodist in Cedar Town, Georgia,\nwhich is also the church he grew up in\nand started his relationship with Jesus Christ.\nHis family, including his wife of 17 years,\nAmy, she's here, along with his two daughters,\neight year old Anna and six year old Lily,\nwho were here today to show their love for him.\nWhile being a pastor, Brett has served his congregation\nover 24 years with 24 years of experience in the pulpit.\nThe 22 years was where he served\nas a bi-vocational pastor and congregations\nall over West Georgia.\nHe also worked with his father in the accounting\nand tax evaluation practice, which pastor Matt\nand I will tell you, you may have to come back up here.\nWe're eliminating the income tax,\nso maybe you can help us do that.\nAnd also too, bread has been a leader\nin the education space where he just served his eighth year\non the Polk County School Board\nand recently just ended his term\nas the chair of the Board of Education.\nWith that, I'll introduce to you, Reverend Madden.\nThank you, Mr. President.\nThank you, Senator Anvatarte,\nfor this wonderful opportunity.\nAnd I say to the room, good morning.\nGood morning.\nI bring you greetings and glad tidings,\nthis pastor of the wonderful congregation in Cedar Town,\nGeorgia's Cedar Town First Methodist Church.\nAnd I also put those same greetings\nare extended from our God who is with us on days.\nI tell you that it rains and on days\nfill a glorious sunshine in whom loves us\nwith a love that desires us and moves him to seek us.\nto seek us. I share with you this morning of two stories, rooted with strong ties to\nthe God talked about by the Psalmist in Psalm 29. The first story goes back to the\n1960s and as I look across the room a few of you definitely remember that time.\nBut there was a moment that I want you to know that occurred that really struck me.\nIt was a moment when Admiral Harmon Rickover gave then President John F. Kennedy a small\nbrass plaque and it was engraved with a prayer.\nKennedy liked it an awful awful lot and he used it actually at the dedication of a memorial\nto the people who were lost missing at sea.\nAnd the prayer on that memorial actually said, oh God, thy sea is so great and my boat\nis so small.\nAnd as I've had the short opportunity to stand before you this morning and look across\nthe wonderful representatives in this room who go and represent communities from all around\nthis state.\nAnd as I look around and see you this morning, as you populate these beautiful tables that\nare historic in nature, I see, too, that you are in a boat just pretty small.\nBut not as small, though it was a life raft of a man by the name of Alex Friedman, whose\nstory was actually published in the Atlantic just a few months ago. The first\ntime commercial fisherman, this is his first run after going through the\nCoast Guard Loot Course they sent you to local community college where he got\non a boat for the first time to try to be a commercial fisherman. Well the first\ntime he went out with another captain on just him in the boat off the\nWashington State Coast a massive storm came in and he found himself in a\nlife raft, no bigger than a kiddie pool with a tent on top of it.\nMr. Friedman with limited supplies, he went through an overdeal and saw him go through\nall types of emotions of which the psalmist in that 29th psalm reminded us of throughout.\nHe pleaded aloud for God, Friedman did, to save his physical self while all the while\nthe battering of waves were occurring on that little kitty poo. After a few days, he then\nstarted apologizing to God for every past transgression, for every injustice. He admitted\nallowed to break in the Ten Commandments, and he simply just asked his God, our God, for forgiveness.\nAnd I pause this story at this very moment for you to think for yourself.\nA moment just to ask your own self, what would you do if you were lost at sea?\nNow, that phrase lost at sea can be replaced as what would be more relevant to you.\nI can only imagine sitting where you sit.\nThe questions where you might be lost at your proverbial sea when you're trying to figure\nout how this bill, this before you, helps people the best.\nOr maybe the question can come about, am I voting the vote based on helping my people in\nin my district or am I voting on helping the people\nwho just simply elected me.\nLet's go back to the story though of Mr. Alec Friedman.\nAfter resolving in his own mind that he was going to die,\nhe shared to the writer of the article\nthat he didn't fall into despair,\nbut he found and he made an incredible statement\nand I quoted for you this morning.\nHe said, he found a piece I hadn't known to look for, and it found me.\nPeace my friends found him, because you see when we're lost at sea overwhelmed by the\nchaos of life, God finds us and gives us peace.\nthe very next morning. I like woke up and saw a boat and it was getting closer. He\nhollered out and with his last flair lit and burning in his own hand. He was\ncrying out. And then he heard a voice from that very same boat that he saw was\ncoming toward him. And the voice from the boat said, we see you. We're coming. We\nWe see you.\nThe promise of Scripture, my friends, is that God has power over the watery chaos of\nlife.\nWhen we are confused or perplexed, I will share with you the comforting news that God is\nsearching for us.\nWhen we are feeling lost, when we are feeling bewildered, disoriented, God hears your\nprayers. When we are facing the most complex of situations, and I know this room can put\nout some bills that look pretty complex. But I tell you this, my friend's God offers\nus peace. Let us pray.\nOh, wonder's God. I thank you for this opportunity to be in this place. Oh,\nloving God, I tell you, it's amazing. The historical significance from which I\nstand in this very moment, but you know all about it. And Lord, you know about\neveryone in this room and you know the sea that they're traveling on right\nnow. And some of them might think the area is just nothing to see at all from\nmy little boat. But oh God, help them realize that they aren't alone. We aren't alone and\nhelp us to realize, oh Heavenly Father, that is your love and your grace that searches\nfor us. And we are so, so thankful. I pray that when we are found, bless this room, bless\nthe work of this body and bless us all. In your glorious name I pray. Amen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nWe have a doctor of the day we need to recognize and always appreciate our physicians coming down here and volunteer in their time, and to introduce our doctor of the day, I call on the senator from the 38th.\nI'm going to get that down at one point and four so with it and that right senator from the 41st\nCenter from 38\nGood morning colleagues. I am honored to welcome back to the chamber our doctor of the day from\nSenate district 38\nDr. Kelly grat de Grafen Reed who is a physician program director of appointment\nexcellent and auxiliary access for Kaiser Permanente of Georgia.\nShe is a specialist in adult medicine who believes that our bodies, minds, and relationships\nall have an effect on our health and encourages our patients to take time to celebrate their lives.\nDr. DeGraffnery is a native of Indiana, so I'm sure is happy about what's going to happen here next week.\nShe is a graduate of Purdue University with a pharmacy degree, and then she went on to complete her medical degree at Case Western University, which is in Ohio, and her residency here at Emory University.\nShe is also very active in the Medical Association of Georgia as President of the Medical Institute of Excellence in Medicine and former Task Force Chairperson, and is one of the board, is on the board of the Medical Association of Atlanta.\nso I am very honored to welcome back to the chamber,\nDr. Kelly DeGraffin-Ree.\nAll right.\nThank you.\nThank you, Mr. Speaker.\nYou've been on my TV lately.\nI don't know.\nIt's about commercials.\nI'm sorry, sorry, sorry.\nI also want to thank the Medical Association of Georgia\nfor providing an opportunity for me to hang out\nwith Ms. Julia today and provide what I believe\nas part of my civil service.\nI'd also like to give a shout out to the Medical Association of Atlanta, who supported me in doing this new program for me called Georgia Physicians Leadership Association,\nwhich there are over 200 plus graduates, where our physicians who are really interested in doing this work of creating policy for the state of Georgia.\nQuickly, I'm reminded of two things,\nas a permanent take physician,\nour medical director reminds us\nthat we live in a vuka world,\nvolatile, uncertain, complex, and ambiguous.\nI know you all know a little bit about that.\nAnd physicians are uniquely trained\nfor this vuka environment.\nWe deal with it every day in the exam rooms\nas we deliver health care.\nI was also raised by my grandma,\nso I'm reminded of something she said\nthat it takes all kinds.\nand our physician training teaches us\nthat we need different specialties.\nWe need different support with nurses,\npharmacists, associate practitioners.\nAnd so I want to say that we physicians\nare happy to join you guys as you serve\nthe citizens of Georgia and creating policy.\nYou'll see us in force on February 4th\nat Physicians Day of the Capitol,\nbut we want to offer us as resources to you all\nto help as you're creating this policy.\nSo again, thank you to all of you for all that you do.\nMy fellow colleagues in the profession,\nDr. Karpaktrick and Dr. Watson appreciate you\nallowing me to be here to serve you today.\nLet me know if there's any other way I can serve you.\nThank you.\nAll right.\nThank you.\nThank you so much.\nYou did a good job.\nYou did a good job.\nYou did a good job.\nOh, let me turn this thing.\nAre there any unanimous concerns?\nall right any Senator which rise on the point of personal privilege we're gonna\nSenator from the 40th.\nFellow senators, today I rise with a heavy heart to honor the life of a remarkable woman,\nconstituent, a supporter, and a friend, and Eisenhower, and her beloved son, Max Potowitz.\nAnn was a highly respected public relations professional, trusted by journalists,\nadmired by colleagues, and known for her integrity and her generosity. She made time to mentor\nyoung professionals, opening doors, connecting people and lifting others up. What\ntruly set Anne apart was her heart. She believed deeply in human rights, in\ndecency, justice, and the power of civic engagement. She lived those values\nevery day and she taught them to her son Max. Together they worked for causes\nreflected their shared compassion and commitment to their community and was\nalways 200% in, giving her time, her energy and her whole heart. I remember Ann\nshowing up to one of my meet and greets at my last primary campaign. She didn't\nhave to. She knew me well already. When I showed her a draft of my final\ncampaign piece. She took it, she marked it up, and she handed it back to me. Way better\nthan it had been before. She wore my campaign t-shirt all over the country and sent me pictures\nof her in that t-shirt wherever she was. She showcased a four-foot by a-foot campaign banner\nin her front yard tied to trees on a very busy Dunwoody intersection. But Anne's greatest\njoy was her beloved son Max.\nOut long ago Ann wrote, everything I did was for him.\nAnd every moment with him was joy.\nMax was a freshman at NYU, full of promise and creativity,\na talented guitarist with a gentle spirit.\nHe shared many passions with his mother,\nincluding travel and a deep love of bunnies.\nTogether, Max and Anne were members of the Georgia House\nRabbit Society, bonded by their compassion for small creatures.\nMax's life was suddenly a tragically cut short in early December.\nThe grief Anne carried was simply too profound,\nand she could not imagine a path forward without him.\nThe only way I know how to make sense of this loss\nof both Anne and Max is to live by their example.\nTo remember their love, their generosity,\nand their belief in a better tomorrow.\nI ask that we as a Senate honor Anne and Max today\nand that we all recommit ourselves to the values\nthat they lived by dignity, justice, and care for one another.\nWould you please join me in a moment of silence?\nAs soon as I ask, everyone stand and join us in a moment of silence.\nThank you, Mr. President.\nI yield the well.\nDo you have a consent calendar before you a privilege of resolutions does any senator wish remove resolution from the consent calendar?\nChair, is there objection to the adoption of the resolution on the consent calendar?\nChair, here's none, and the resolution on the consent calendars are adopted.\nSenator from the 41st, work purposes, do you rise?\nI ask for unanimous consent to excuse the senator from the 39th.\nWithout objection, the senator from the 39th is excused.\nAre there any motions that would draw or commit?\nI recognize the majority leader for motion.\nThank you, Mr. President.\nI got for my new floor leader from the senator from the 42nds, trying to throw me off over\nhere.\nYeah, for now until you're going.\nI'm Mr. President, I move that the Senate stand adjourn until 10 a.m. Thursday, January 15th.\nThe majority of the leaders move. Secretary, read the announcements.\nThere are no announcements, Mr. President.\nMajority leader has moved. Recognize the Senate from 24th, what purpose do you rise?\nMichael, now.\nCome on.\nThank you, Mr. President.\nYesterday I left it on your desk and tomorrow we'd love to have you to come down on the\nsecond floor and let's keep Georgia wild day and see some people from DNR.\nWe'd love to have you out tomorrow, between 8 and 11.\nThank you.\nIt's always a good day.\nAppreciate you letting everybody know that, Senator.\nRecognize the center from the 19th.\nYou wave.\nOnce again, I'll let you.\nOkay.\nAll right, your light was on.\nSome of your neighbors are playing with you over there, I guess.\nAll right.\nAny other announcements?\nAlso, remember tomorrow is tomorrow is the state of the state.\nSo it will be tight on time.\nObviously, we've got to go to the house chamber for that.\nSo, but just remember, it's more as a say to the state.\nSo, the majority of the leader has moved that we stand to\nadjourn until tomorrow at 10 a.m.\nAll those of favor the most will stick to five by saying aye.\nAll those opposed, no.\nDye is clearly heavy, you'll have a good day.\n",
  "updated_at": "2026-02-12T01:28:21.469424+00:00"
}