{
  "video_id": "IlZWgwA8wPw",
  "url": "https://youtu.be/IlZWgwA8wPw?t=1966",
  "title": "Georgia House - Day 33 (2026-03-22)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 33,
  "video_date": "2026-03-22",
  "duration_minutes": 107,
  "summary": "Here is a structured summary of the Georgia House session on 2026-03-22:\n\n**Overview**\nThe session included a scripture reading and prayer by Pastor Aaron McCulley, followed by a discussion about the importance of maintaining a strong relationship with God amidst the busy responsibilities of public service.\n\n**Key Actions**\n- **HR 668**: [No description provided]\n- **SB 3331**: [No description provided]\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative Bill Yerda introduced Pastor Aaron McCulley, who shared a message about not getting so \"burdened\" by work that one neglects time with God, using the biblical story of Martha and Mary as an example.\n- Pastor McCulley encouraged the representatives to make time for prayer and scripture reading, despite their busy schedules.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nThe session began with a quorum call to ensure all members were present.\n\n**Adjournment**\nThe transcript did not provide information about when the session adjourned or the date of the next scheduled session.",
  "transcript": "\n\nyou you you you you you you you you you you you you you they are convening having arrived all members of this house will please report to the floor. All members will please report to the floor. Clerk will ring the bell. All members will please report to the floor and take your seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. All members voted. All members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Well, good morning. Another beautiful day out there today. Better enjoy it, I guess, while we have it. We will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 152nd House District Representative Bill Yerda, Representative Yerda. Thank you, Mr. Speaker. I'm pleased to have today pastor Aaron McCulley and his lovely wife Candace was today. Aaron has been the pastor at Faleemarode Baptist Church in Leesburg for almost five years. He actually passed it his first church at the age of 18. You know, one of the best things about this job is you get to meet really fine people that you otherwise would not have had the opportunity to meet. And I believe that's what I have today in Aaron McCulley. My first year here after a special election was 2020. And I was living in a house with eight other representatives. By the way, I love all you guys and I wouldn't trade it for anything. Except three of us had to share a bathroom. But, you know, some refer to it as a fraternity house, actually. But it's some of my roommates knew being away from home probably the longest away from Rome since I went to the University of Georgia from South Georgia. I got a little homesick. Some of my Mr. Speaker thought I might even go back to the semester. But, uh, no, I stuck around and around that same time. Uh, I got a call from from Aaron McCulley inviting me to pastor's day here at the Capitol. And I still remember the first thing he said to me when we first met. I pray for you every day. I pray for you every day. And what a what a difference that made. What a difference that made to me. A short time later if you remember we suspended the session and everything was locked down. And my wife and I really enjoyed the virtual services that uh, Aaron gave it. Philema Road Baptist and it certainly meant us a lot a lot to us at that very difficult time. In addition to pastoring you might find Aaron giving out chick-fil-a-gift certificates to police officers or going to Louisiana to to carry supplies to hurricane victims. I can tell you that with Aaron's leadership Philema Road Baptist Church in Leedsburg is growing and making a real difference in the community. Welcome to the half, Aaron. Hey, man, it is my honor and my privilege to be able to say a few words of encouragement to you today. I'm also honored to be able to serve the great state of Georgia with you and alongside of you as a representative Yerda has already mentioned our church and us. We pray for you and those that are in authority every day and I challenged my people to do the same as well. As I was asked to be able to say a few words this morning, God laid a few verses on my heart and I want to share these with you this morning. Luke chapter number 10 in verse number 38. Jesus is speaking to Martha and and in verse number 38 he says this, now it came to pass as they went he entered into a certain village and a certain woman named Martha received him unto her side and she had a sister called Mary which also said at Jesus' feet and heard his word. But Martha was combered about with much serving and came to him and said, Lord, does thou not care that my sister has left me to serve alone? bid her therefore that she helped me and Jesus answered and sent into her Martha Martha. thou art careful and troubled about many things but one thing is needful and Mary had chosen that good part that which shall not be taken away from her. You know, I think about where we live at there in South Georgia there are many things that when you come to South Georgia you would probably say, Hey, you cannot miss this or you've got to see this there in our town or in our community. I would take you places through the Flint River and try to let you catch a showbash or something of that nature. I say, you can't miss the best part about Lee County or about our South Georgia area or our great state or our great state. Jesus was speaking to Mary and he uses Martha's name twice. There's two there's ten times in the word of God when the Bible mentions a name back to back. If you remember, he says Simon Peter, Simon Peter, you remember Jesus was on the cross. He said my God, my God and here in verse number 41 he says Martha, Martha. Martha was so combered about the Bible. The Bible begins to tell us the word combered in the Greek means to be drawn away here and there to be twisted or to be wrapped around or to be distracted. I know in my life as I am a pastor I sit down at the supper table and I get a phone call. I have people everywhere that I go. I am distracted by this and before I walk into the pulpit on Sunday morning people are trying to tell me this or try to tell me that and a lot of times they begin to I begin to find myself missing the best part of my relationship with Christ. It's not that I'm not doing good things as you are up here. You are doing awesome things and you are doing so many things but I hope that we're not missing the best part of our relationship with the Lord Jesus Christ. You know as a pastor and as a representative you're super busy. I know we have so much things to do and we have so many things but here in this text we find two different types of people. We find one as Martha she was she was so combered about with everything that she was doing. She forget she forgot to take just a little bit of time and spend with the Lord Jesus Christ. As I have asked myself this week and I hope that you challenge yourself as well is that I encourage you to take a look at your life and ask yourselves are we so busy that we've scheduled our relationship with God out of our lives and I encourage you to have that prayer time to have that time and reading of God's word that you don't miss the good part of your relationship with Christ. You know as I begin to say and I'm done with this and they should that it's hard to give a bad just preacher five minutes but as they I'm done with this is as we don't miss the good part of life the good part is we can go to Christ and leave our burdens there. We can go to Christ and leave our troubles there. We can go to God and leave everything that is around us in the pressures of life and we can spend the good part of our life with him. I'm thankful that we can talk to God this morning. I'm thankful that his word speaks to us and I don't want to miss the good parts of spending time with the Lord Jesus Christ. Let us pray. Our de heavenly Father, Lord we thank you so much for allowing us to be able to say just a few words of encouragement to these great people for our great state in the great country that we live in. Lord I am honored to be able to serve with them this morning. Lord to be able to challenge them to help us not to miss out on the good part of spending our time with the Lord Jesus Christ. Lord he did we know that you did not tell Martha the quid serving or the quid doing good things but you told her just to make sure that she wasn't missing the good part of her relationship with Christ. Lord I know I have been so busy and I'm a pastor and Lord I know that I have missed my relationship with you and I have messed up in many ways but Lord I'm glad you're faithful to bring us back today. Lord as these representatives here in the house as they make decisions and as the speaker begins to do all the things that they begin to do. Lord I ask you to give them wisdom as they do those things. Lord give them understanding. Lord help them to remember that there is an importance of their relationship with Christ and their relationship with God. Lord I thank you for allowing us to be able to put our faith in trust in you and be able to just speak to you and lay our burdens there and be able to take a time away from everything that's going on and spend time with you and Lord we'll be sure to give you all the praise and all the glory for in your name we ask it and all God's people said amen. Let's place a legion through the flag of the United States of America and to the Republic for which it stands one nation under God and the visible with liberty and justice for all. meat pork keepers will unlock the doors. Members may greet the chaplain in the south, any room? Chair recognizes Chairman Hogan, the chair of the committee on information and audits. Thank you Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. And furthermore Mr. Speaker, drive carefully on this road called life, because people will switch lanes on you without a signal. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none in the journal is confirmed. The clerk agreed the resolution established establishing the order of business for the day. Members 159th, who has followed me establishes the order of business during the first part of the period unanimous and sets, introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none in the resolution is adopted. First reading of bills and resolutions, the clerk agreed. House Bill 1580, by reference of kindergarten and the second crow, the 110th park, the uttered first lumps into the 12th, more than 95th. There will be an act of men article 8 of chapter 2, title 35. The official go to Georgia Anciety Relay in the office of public safety support. Ways and means. House Bill 1585, by reference of Cantrow will be 22nd fall into 23rd bird of the 20th Carson, the 46th Thomas, the 21st. Bill being taught an act of men and act to create state court and chair to get the governmental coordination. House Bill 1586, by reference of camp of the 131st. Bill being taught an act to provide a homestead exemption of an absent county at the law. House Bill 1767, by reference of Jasper, the 11th. The resolution honoring the life of Mr. NC Lowe Jr. in dedicating a bridge in the house of the resolution 1048. The resolution of the 8th, by reference of J. Barrow, the 136th. Jones, the 47th, Duke neck of the 29th. Ninth and the 130th are one of the 28th and others. The resolution for creating a house study committee on education accreditation. Education. That completes for the streeters. Second reading of bills and resolutions of Clark, or read. House Bill 1576, by reference of when of the 89th, body of the 62nd. The claim of the 100th Wilson of the 80th, Canon of the 58th and others. Lowe leading to labor practices of public officers and employees. House Bill 1577, by reference of Davis of the 87th. Drener of the 85th, Benin of the 94th. Evans of the 83rd, Taylor of the 91st and others. The bill to amend the act creating the state court of the cab county. House Bill 1578. By reference of roads of the 120th Williams of the 145th, homes of the 129th, the 144th. A bill to provide for the designation of the chief judge of the Oakmogic judicial circuit. House Bill 1579, by reference of bachelor of the 137th, the bill to provide a new charter for the city of Woodland. House Bill 1581, by reference of the 6th. Carpeter of the 4th, tarvon of the 2nd. A bill to amend the act to provide a new charter for the city of Varnal. House Bill 1582, by reference of the 17th, the gollet of the 19th. A bill to amend the act to provide a new charter for the city of Dallas. House Bill 1583, by reference of the 17th, the gollet of the 19th. A bill to authorize the governing authority of the city of Dallas to love you and excise tax. House Bill 1584, by reference of the 17th, the gollet of the 19th. A bill to authorize the city of Dallas to exercise redevelopment and other powers under the redevelopment powers law. House Resolution 1042, by reference of the 17th. The same Collins of the 68th, Maynard of the 56th, gains of the 117th, we now are on 119th, the Resolution creating a House Study Committee on Unsheltered Homelessness through 2nd Readers. The bill to amend the act to provide a new charter for the city of Dallas to work with you and your family. Reports of Standing Committees, the clerk will read. Senate registration of the 104th District Chairman on Committee on Judiciary, submitted the following report. And speaking of Committee on Judiciary, its own consideration following bills in the Senate as the struck committee report. Same back to the House following recommendations. Senate Bill 332, passed by Committee Substitute. Senate Bill 438, passed Senate Bill 500, due pass respectively submitted. Representative Strachm, the 104th District Chairman. Representative Mike Chokus, the 138th District Chairman on Committee on Small Business Development, submitted the following report. And speaking of Committee on Small Business Development, is then a consideration following bill in the Senate as the struck committee report. Same back to the House following recommendation. Senate Bill 531, due pass respectively submitted. Representative Mike Chokus, the 138th District Chairman. The completes the reading and reports of Standing Committees. Senate Bill 531, due pass respectively submitted. Senate Bill 531, due pass respectively submitted. Senate Bill 531, due pass respectively submitted. All right, we're going on now to morning orders. Members of this House will please take your seats. Give attention and respect to the members in the well for their one minute each morning order. Chair recognizes Representative Brad Thomas for a morning order. Thank you, Mr. Speaker. Today I rise an appreciation of this body for the passage of HR668, dedicating the Sixes Road interchange to our following officer, Joseph W. Berson, who died in light of duty on June 17th, 2021, a night where his life was tragically cut short on a routine traffic stop. Officer Berson was highly regarded by the citizens of our community and state and local government officials as a person of unquestioned integrity and dedication to the sound principles law enforcement. On a personal note, he was known as a voracious drummer. He actually played it for his church in the local band, Rustid Soul, and he had the undisputed reputation as the best drummer in the city of Atlanta. Chair G. Cownian, the city of Holly Springs, continues to mourn his loss. One of the most distinguished citizens what we've had, and now we can ensure his memory will not be forgotten with the memorial that will be put up. In the anti-room, we'll have the family officer, Berson visiting us, his wife Mary Kate Berson, his father John Berson, his mother Frances Berson, his brother John Berson, along with the chief and deputy chief of Holly Springs. We appreciate if you all want to come by. Please feel free. And without a yield, well, thank you. Chair recognizes Chairman Bicki for a morning order. Thank you, Mr. Speaker, and a few of my ag colleagues are probably going to join them to hear it. Today is National Ag Day, and this entire week is Georgia Agricultural Awareness Week. And this is our annual week-long celebration highlighting the communities and the products that make Georgia a great agricultural state. Agriculture contributes 73 billion annually to Georgia's economy. One in seven Georgians working agriculture, agriculture, agriculture, and forestry. And Georgia is blessed with a climate fertile soil, abundant water, that we can grow just about any crop in our great state. We're consistently number one in production of peanuts, chickens, pecans, sweet onions, absolutely have the best sweet peaches, and North Georgia apples, Mr. Speaker, along with cotton and some great vegetables. Chairman Hogan reminded me that there are many first in Georgia agriculture history. We had the first agricultural experiment station established in 1735, he tells me, and he and his good friend Eli Whitney invented the first cotton gin in 1793. And of course our great first land grant university, UGA was established in 1785. And we were first to create a state department agriculture. This week we encourage our communities to take part in activities that help promote agriculture, being in our largest industry, their opportunities in every corner of our state, whether it's getting outside and visiting agritourism, the grocery store, Georgia grown, every Georgian has a chance to participate and learn a little bit about the food on their table, the clothes on their back, and the products that built their home. Thank you, Mr. Speaker. The pecans, brothers and pecans. Chair recognizes representative Hugley for a morning order. Well, thank you. And I was there looking for you. We were in 65, you probably went to 65. Mr. Speaker, I'm being joined this morning by women in this chamber because this is women's history month and we are making history. So I'm this morning to stand in solidarity for our support of the Supreme Court nominee, Katangi Brown, Jackson. It's been 233 years in the making. There have been 115 justices on the court. But this is the first time an African American woman is being nominated for the court. And so we stand this morning to pray for her patients. We pray for God's mercy and grace on the members of the U.S. Senate that will be asking her questions today because we know that she's qualified. And we look forward to her taking her rifle place on the highest court in these United States because we too are Americans. Yes. Chair recognizes representative Angela Moore for a morning order. On this Wednesday, I ask you to join me and millions of other children and their parents as we bear witness to celebrate six-year-old Kendall Ray Johnson as Georgia's youngest farmer during agricultural week and on agricultural hero day. Kendall has been recognized by Good Morning America, CNN, the likes of Ellen Togeneres and her show. And where Nickelodeon and Nickelodeon News will be here at the Georgia State Capitol tomorrow to film her ceremony. They will also interview our representatives here in the house. More information will be available shortly after her ceremony. At 12.30, we will meet at the Port of Co over by room 216 where we are joined by the Agriculture Cultural Commissioner to give you treats. Please join us. And I would be remiss if I didn't tell you I'm getting ready to give everyone a view of the very first Georgia cookbook. Thank you. I yielded well. Chair recognizes Chairman Corbett and Chairman Hogan's son-in-law representative Stephen Sainz. Thank you, Mr. Speaker, for that overdue recognition. Please join Chairman Hogan and congratulating the hard work and perseverance of the NJROTC cadets who came in as the national champions for the 2022 Navy NJROTC Marksmanship Award. We also had two specific individuals who competed individually. Abigail Swain and Jordan DeHassouz who came in second and fourth respectfully in Marksmanship. Thank you and congratulations. What purpose does Chairman Hogan rise? I can't stand him. Mr. Speaker, I'm going to have that conversation offline with Chairman Hogan. Take that debate out in the hall or outside or somewhere. All right, we are now going on to the rules calendar. Going on to the rules calendar.\n\nClerk, a read the caption to Senate Bill 340. Senate Bill 340 by Senator Trafattrick, who was 32nd, Watson the First, Berk of the 11th and others to be in Tava, the act. To amend Code Section 31795, the fish go to George Ante, relating the funding of medical education provided by hospital authorities and designated teaching hospitals. This bill I refer to the committee on Health and Human Services. That committee recommends that this bill do pass. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, of the House, I bring you the Senate Bill 340. First of all, I would like to say that this bill was put forward by LaSharn Hughes, who was the director of the Georgia Board of Healthcare Workforce. No one was more committed to having access to improving access to healthcare in Georgia than LaSharn, especially in the rural areas. Unfortunately, she died as we've been in session from complications, from an operation, and she is sorely missed in this area. So I hope as you go through to know how much one of our state employees made a difference in finding healthcare for rural Georgians. This bill does two things. First of all, the AMA does not credit medical education programs. So it puts in the right people, the ACGME, the accreditation council for graduate medical education, is the people or the group that credits residency programs. And then for some reason, the state of Georgia had said that all the residency programs had to have at least 50 residents in them. And we have hospitals that can't handle 50 residents, but might be able to handle a residency program for 10 OBS or five psychiatrists. And so this is an arbitrary number. The accrediting agency does not have any number that it requires, and it takes away that artificial number. That is the bill, and I would ask for your favorable consideration. And Mr. Speaker, I'll yield the well. Do you have no questions? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. What purpose does represent your sharper rise? Paul Manningion-Carrie? Mr. Secretary-Encarrie. Is it not true that I'm in support of this bill, and it's something that I've been working on for a few years here to get these type of things in place, and I wish with everybody we already see a support in the bill. Thank you. Have all members voted? Have all members voted? If so, the clerk will unlock the machines on the passage of the Senate Bill 340. The eyes are 161. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 346. Senate Bill 346 by Senator Voles, the 53rd hatch of the 50th Anderson, the 24th, and others being titled the Natto Men Part One of Article 3, Chapter 5, and Title 50. Any fish going to Georgia, and it's either willing the General Authority duties and procedure the Department of Administrative Services. This bill there, I'm for the Committee on Government Affairs, that committee recommends that this bill do pass by committee substitute. Chair recognizes Representative Mom Dahan to present the bill. Thank you, Mr Speaker. Members of the House, today I rise to present Senate Bill 340-6. Senate Bill 340-6 will help the State of Georgia protect its residents, government agencies, infrastructure, financial institutions, and more from technology, technological threats posed from the people's Republic of China. The great fact is, is technology products made by companies owned or operated by the Chinese government, or prevalent in our homes and our businesses across the state. The level of risk use of China's own technology presents to our national and economic security is so high that it is restricted by the U.S. military, the State Department, our intelligence agencies, and elsewhere. This bill is needed because, while Federal policy derangs information security for federal agencies, states determine their own information security standards, leaving Georgians at risk. This bill, however, does not affect our friend and our Taiwan, or officially known as the Republic of China in any way. They are a beacon of hope and democracy in that region, and they are an important trading partner. Specifically, this bill will prohibit companies owned or operated by the China government to bid or try to submit a proposal for a state contract. If the U.S. Department of Defense, the Air Force and the Navy, have stopped the use of this technology due to the threat state posts, then I think in the state of Georgia, we should do the same. With that, I ask for your favor of consideration to Senate bid 346, and I'd be happy to take a few questions. You have a few questions to you, Yield. I yield. Chair recognizes Chairman Bershit to your right for a question. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Does this bill have anything to do with driving schools? No, sir. Nonetheless, it's a Chinese driving school. Thank you. Do you further, Yield? I yield for one more, Mr. Speaker. Chair recognizes representative Meeks to your right for a question. Thank you, Mr. Chair. Mr. Speaker, does gentleman yield? I yield. Just wanted to make sure that I heard you correctly and saying it does not affect our trading partners. That's right. It's not going to affect. That's right. You know, we've got a trading partner in Taiwan, which sent you known as the Republic of China. And like I said, during my presentation, there are beakin' of hope in that region, there are important allies of ours, and we want to make sure that the Thurneye effected by this prohibition. I thank you, Mr. Speaker. Thank you. And with that, Mr. Speaker, I yield the way up. Is there any objection to the previous question being ordered? The Chair, here's none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair, here's none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the Committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. have all member's voted they've all any members voted If so, the clerk will lock the machines on the passage of Senate Bill 346. The eyes are 119. The nays are 45. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 211. Senate Bill 211 by Senator Summers of 13 to begin title. Title of the act to provide that future elections for the Office of Judge the Provecord of Chris County shall be nonpartisan elections. This bill ever furthered the committee on intergovernal coordination. That committee recommends a disbilled due pass. Chair recognizes Chairman Williams to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I rise today for Senate Bill 211. Simply, it is a request by my county to make the probate judge a nonpartisan judge ship. And that's all the bill does, and I would appreciate your favorable support. You've got a couple of three questions, you've. I'll take a couple, Mr. Speaker. Let's see, Chair recognizes Chairman Corbett. Do you write for a question? Thank you, Mr. Speaker. Does gentleman eat you? I do. Can you read the first line of that bill for me? I believe I just did. Thank you for the bill. Thank you. Do you further you? Yes, sir. I'll you for one more. Chair recognizes Representative McLauren. Do you write for a question? Thank you, Mr. Speaker. It's a gentleman yield. I do. Would the gentleman support a statewide measure to make all probate courts nonpartisan? Well, I guess that would be up to each and every representative. I represent the House District 148 in my county was adamant, looming this, brought before this August body. And it's been asking me for three years and we finally got it through. I'm going further yield for the question. Sure. Thank you. Is there any discernible principle that the author is aware of that would make it important to have nonpartisan probate elections in one county, but not another? I think you know the answer to that question. But thank you for the question. I think so too. Thank you, sir. Mr. Speaker, I'll yield the will. Gentlemen, is yielded the will? Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye those opposed to vote no and the clerk will unlock the machines? One purpose is representative Ken and rise. Parliamentary inquiry. Is it not true that there are some counties in Georgia that do not have a board of elections and probate court judges serve as the official in those measures? I think the lady is accurate. I think there's about 30 that were the probate judge serves. As have all members now voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 211. The eyes are 101. The nays are 63. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 331. Senate Bill 331, Senator Alvers, 56, and the 53rd, and the 30th and others to be entitled an act to amend chapter 4. Title 34 of the fiscal of Georgia, antenna really in a minimum wage law. Social prohibit the regulation of employee work hours scheduling and output by local government entities. This bill never for the committee on industry and labor. That committee recommends a dis bill do pass. There recognizes chairman Ballinger to present the bill. Thank you, Mr. Speaker. I rise today to present Senate Bill. The meat of the bill occurs on lines 46 through 54 to parse it all out. Basically it prohibits local jurisdictions from regulating the hours or schedule of an employee of a private employer. So it constrains local governments from dictating the hours to a private employer that their employees can work. That is the bill, Mr. Speaker. I'll be happy to answer any questions if there are none. I'll yield the well and ask for your favorable consideration. Do you yield for questions? Sure. Chair recognizes chairman Parsons to your left for a question. Thanks, Speaker. It's lady yield. Yes, sir. I just want to make sure it's not true. But this language doesn't affect anything related to minors working. Minors? Am I N-O-R-S? No. It does not. No. Who does regulate that? Where is that regulated for minors? Those are federal regulations. Just like the federal minimum wage. Is there nothing at state in state statute about that? There may or may not be something in state statute. However, this bill has nothing to do with minors. Thank you. Appreciate it. Do you further yield? Yes, sir. Chair recognizes representative Bodie to your left for a question. Thank you, Mr. Speaker. That's a lady yield. Yes. Isn't this not true that this bill, this SB3331, would actually impede on local control and now allow our local legislative and elected officials to make this determination on output hours for employees? It would and that it does prohibit local governments from telling private employers and telling private employers what hours their employees can and can't work. However, it has nothing to do with local ordinances regarding opening and closing of businesses. That sort of thing. If that's what you're implying. That's a gentleman for the year. Yes, sir. So is not true that this is a pre-it the bill? I suppose. I mean, and I would say it's a preventative bill and allows for free markets to continue and free workplaces to continue in the state of Georgia. Thank you. Thank you. With that, Mr. Speaker, I will yield the well and ask for your favorable consideration. We have some other members who wish to be heard on the bill. The chair recognizes representative Shannon to speak to the bill. Thank you, Mr. Speaker. This bill is, this is the second time we've seen this bill. I remember in 2017, a very similar bill came before the House and it was actually the first time I ever came down to the well to speak against the bill. I have the same concerns that I had in 2017, which is that this body is going out of its way to put its foot on the neck of working Georgians. And that's really ridiculous considering that Georgians are at work right now and we are using taxpayer money to come down here and find ways to work against them. Just recently, you saw in the AJC that Wallet Hub does an annual ranking of best states to raise a family. And we see Georgia continue to be at the bottom. We were 42nd for affordability. We were 35th for socio-economics. And for the percent of families in poverty, we are 41st. And this is not new. Since 2017, we have consistently been one of the worst states to raise a family. And the reality is we continue to be ranked poorly for what it takes to raise a family and the resource, having available resources to raise a family. Because we continue to move forward with regressive policies like we're saying now. Regressive policies have shaped a harsh reality for far too many Georgians, particularly working Georgians. And it's bills like this that are the prime example of why things are so hard for working families in this state. Furthermore, this bill is completely schizophrenic to the majority party's values. Over and over again, we continue to see Republicans put up cities for us to pass and advance more local control. Tell me this, exactly what is the point of creating new cities? If you're going to then turn around and at any point the general assembly gets ready, the general assembly will supersede local control and tell you what you can and cannot do. What is the point of advancing these opportunities? Again, I say, as Ruth Bader Ginsburg said, please just get your foot off of the neck of us. I hear the well. Chair recognizes representative Stacy Evans to speak to the bill. Thank you, Mr. Speaker. Good morning. I think it's still morning. I rise in opposition to Senate bill 331. Try not to repeat my colleague who said a lot of the things that I was feeling. This is a preemption bill. Again, we already tell local governments you can't set minimum wages within your jurisdiction. That's us. We know better. We already say you can't even control the standards by which you would award contracts for projects within your own jurisdiction that your local government is paying for. We preempt that. We know better. And not to be a complete echo, but we spent a lot of time down here creating local governments. What is the point? If we're going to do everything, we know better. But more than anything, I wanted to come down here and say, where did we lose so much trust in the voter? What happened to democracy? We want these local governments because I think we all agree just like we think we're better than the feds because we're closer to the people, right? Well, the local governments are the closest to the people. And I think anybody in here that served in local government will tell you that. I didn't do it because I knew I'd never get through the grocery store and I like getting through the grocery store. But the voters know exactly what their local elected officials are doing and if they don't like it, they will tell them. Why do we refuse to let the voters have that voice? Why do we always want to rip it back and think that we know better? And not to get too paternalistic about it, but I think about what my mom or my dad would say to me, how would you like it if they did it to you? How does this body react when the feds tell us what to do? I'm pretty sure I know. You get all mad. You don't know better than me. This is our state. We're not California. We're not New York. You shouldn't be telling me what to do. Well, every local area in this state is not the same. And if local governments see fit to protect their workers, because that's what this is about, ladies and gentlemen, what about the workers? I don't know how many people in here have had the pleasure of serving in the service industry I have. Waiting tables. Working jobs where you're not guaranteed a certain number of hours and you can't play it and you can't predict and you can't plan for child care and you can't plan financially. All local governments are trying to do is try to give that predictability, that ability to control destiny for workers in their areas. Why would we be against that if they and their wisdom being the government closest to the people have decided, you know what? I think we need to give our workers some predictability. We need to say, you know, if you're going to keep people on the line, if you're going to say that people have to be on call to come to work, you need to pay them. You need to give them a guaranteed number of hours if you want them to be available for you and not go off and work a second job, which they probably have to do because you're not paying them enough. Local governments trying to take care of their people and create a standard of living in their community. Why? Why would we ever be against local control, but especially when it's just trying to help working people? That's it. Why do we always have to say we know better and we are not going to let you protect the people that you see every day at the grocery store. I hope you'll join me in voting now. Thank you, Mr. Speaker. I yield well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Well, vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does chairman Setswood rise? Parliamentary agreement. They sure inquiry. Isn't it true that there's businesses all around our state who make massive investments in communities with the expectation that they can run their business, hire employees, and this simply prevents local governments. If there's wins of political change, I'm completely wrecking the investment these folks have made by making trying to control the very hours in which they can employ their employees. If the gentleman so states what purpose does representative Mayner rise? Parliamentary inquiry. Is it not true that I hate when people get away from the well because I have a question and the question I wanted to ask was based on lines 46 through 47 is saying governments can't control business hours. If a government doesn't control a business hour and a business says I want to close at 5 p.m. but a single working mother can only work past 5 p.m. By not voting on this bill, we're preventing actual workers from working the hours that businesses are allowing them to. Is it not further true that one thing I definitely do not want to happen is the labor union to put my phone number on the internet again and have strange men calling my daughters. Is that not true? If that's happening, I would certainly understand that to be true. All right, we're going to do one or two more here. What purpose does chairman Carpenter rise? Is it not true that this bill will allow companies to operate across city and county jurisdictions in a uniform fashion across the state of Georgia? And is it not further true that this bill would only preempt city and county governments for making poor decisions? What purpose does representative Stacy Evans rise? Mr. Speaker isn't it true that my problem with the bill lies in lines 46 through 48 where we will not allow a local government to say to a local business that is making its employees stay on the hook to be available that they will not allow the government to say you need to if you're going to do that you need to pay or if you're going to do that you need to have a job. There's a certain number of hours so that there is certainty in working men and women that they will know that they have a certain number of hours so that they don't have to go out and get a second job. And isn't it true that if the lady had a concern, I would have been happy to talk to her at my desk. I'm sure the lady believes that to be true. Have all members voted? Have all members voted? So the clerk will lock the machine on the passage of Senate Bill 331. The eyes are 99 and the nays are 67. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative cannon rise to make a motion? State your motion. I'd like to move on reconsideration on the next legislative day on Senate Bill 331. Lady has the right to serve a notice of intent to seek reconsideration and that will be put on the calendar tomorrow. All right, we have one. I'm going to ask all members of this house to take your seats. All members of the house, please take your seats. That was special order coming up. Chair recognizes representative Tom Kirby. Thank you, Mr. Speaker. It has been an honor to serve. It's been an honor to serve with all y'all. First off, I've got to thank my wife Rosemary. I couldn't know this world asked for a better partner. She's my rock that builds my foundation. You don't see her down here. She really doesn't like politics. She basically thinks we're all crazy for being here to begin with. She may be right half the time. But she believes in us, believes in me. And I'd like to say I love you and I have more time to spend with you. I like to thank my girls. Courtney Leslie Payton. You know, a couple of them were still in school when I was first elected. That's a little tough. You go to out to dinner and people talk to you. And everybody in our district doesn't like everything we do 100% of the time. And then girls, they got to hear what they got to say about us. It's tough on them, but they handled it all, living in that little fishbowl. I want to thank the speaker. Not only for everything you see around here, but I really want to thank him for appointing me to a standing committee on SLC. If you're not involved in SLC, I would certainly encourage you to do that. Those of you coming back. It's pretty cool to know I'm influencing some legislation in some other states in that committee. It's not really a very partisan at all in those meetings. It's a lot of fun. Meet some really dynamic people from all over the southeast. I still call them every day or every chance something comes up here. I may call somebody in Louisiana, like an Indiana's. A Democrat from Louisiana. Great guy. He'll tell me straight what he thinks. I want to thank Spiro. Thanks, Spiro. The guy we don't talk about too much. You know, to me, he's kind of like the guy on the back of that white water raft. Most of the time, he just stands back here and we don't worry about it. But we're getting some classified rapids. He's the one that kind of stirs to that calmer water. And does a lot for us. I've got to thank my teammate in Walton County, Bruce Williamson. Couldn't ask for a better teammate to represent our home county. He never talked to him by any smarter on banking and finance and insurance and the things that are in his will house and Bruce. He ever having questions. I could spend a lot of time talking about members and former members, but I'd leave somebody out. But the one I don't want to forget the last one is chairman England. I like chairman England's job. Most of the time was keeping me out of trouble. You know, I'd have some great ideas and I'd run them by Terry or chairman England. And he kind of give me that folksy look of his and say, I don't think you want to do that. They were great ideas, but they just weren't maybe the right time. I mean, the minority leader knows I have great ideas. Maybe my time is off. I think you're hit. People, you know, they don't ask me what I'm going to if I'm going to miss that they tell me you're going to miss this. Well, there's some of them going to miss. There's some of them that I'm not going to miss. I'm going to miss you all. I'm going to miss you all.\n\nfamily. You ever set back and thought how few census state Georgia has become a state have gotten to serve in this body as a percentage of their total population. We are a very very small percentage and we're family. Oh yeah there's couple that may be like crazy aunt and uncle that you pray don't come to Thanksgiving dinner but what they do you hope grandma has a big house you find a place to get away take them out to the football games come on you know but this family is important some of you may recall I've lost both my dad and my brother since I've been down here I can't tell you how to appreciate the support I saw from the family you know I've always done the little I'm sorry comments on Facebook or whatever when you're on the other side of those comments you realize they are important a little harder than I thought it'd be today I'm not going to miss knocking on doors I know that this year I know if you ever saw it online I had a picture of my Justin Roper's where I wore holes in both both the souls knocking on doors one year I had a lot of campaign to do I've had enough political barbecues to to ask me lifetime by the way you know why there's barbecue political of Emson Georgia the Baptist took all the chicken you know the Baptist bird by the way now this is a rumor so I probably shouldn't share but mr. chairman Stevens you realize that we heard this rumor that at large Baptist events there's often an organized wagering pool so attendees can wag your on which restaurants gonna serve the chicken of course I'm a I'm a Kentucky fried chicken supporter if I was there but I understand Chick-fil-A is normally the two to one I favored on the morning line so but let's get back to what's important people have asked me what's the best thing that you've been involved with or done you know it's nothing about the 40 days it is the constituents we've been able to help as their representative those that have fallen through the clock cracks those have gotten tied up in red tape to be able to help them makes it all worthwhile people have asked me what's the most disappointing thing you know it's not legislation it's not something I didn't like that it couldn't stop or something I like that didn't pass but I'll tell you this and I want to talk a minute or two on this and the most disappointing thing this last couple of years it seems to have gotten more swampy down here using the term we prefer to talk about DC and wish you would go back to DC it's not good for us I don't think it's good for constituents not good for Georgia when we get too swampy we don't need to be there yeah I've been told and heard for many years that government you govern in the middle or at least good governments in the middle yeah I may be center right something maybe center left at center there's not much room for a swamp when we get way right way left there's a lot of swamp gravity between and I think we got to get back to that center I hope Tom's going forward dude there's only the second time I've ever brought notes down here to the well and career so I'm not used to this you know I did some research some of you in this room probably aren't surprised that I would actually do some research even for a fair well address I'm willing to get in the weeds on about anything but I wanted to make sure I was right on this and I looked it up and did some statistical numbers and everything else so I could tell you when it comes to being the representative we are a republic you know whether you call it a representative republic a constitutional republic we own the words attributed Franklin Ben Franklin most of the time we're giving you a republic if you can hold on to it we're not a democracy that's my rule why they rail against democracies we're republic you know as Neil Bort used to so elegantly say on his radio in a democracy two wolves in a sheep or discussing dinner it doesn't work too good for that sheep well that's why we're a republic you represent all your district and the research I did tells me this there is not one member of this body not one not the guy behind me not the majority leader not the minority leader not me not anybody in these chairs that was elected by majority of the people in their district they represent you were not elected by most of the people you represent you were elected by the majority the people went to vote on a particular day but you represent them yes you represent everybody voted for your opponent whether is in a primary or a general you represent everybody that didn't vote you represent everybody that's too young to vote we got to get to the middle get rid of the swampiness represent our district everybody there are people in my district way left to me and there are people way right to me believe it or not but I got to represent them all and I hope hope we do that going forward a little more you know as represented in Gile your career where's Carl when he was passed to the day he said a saying that no only another person I've ever heard say this was my wife when he talked about somebody being thinking they're all that in a bag of chips why challenge you to this next time you think you're all that in a bag of chips think about all the people you represent who did not vote for you and ask yourself what am I doing to represent them today and I want to share one story with you way back after the runoff of the special election it's a couple days after it's over one evening my wife looked at me she said are you okay with all this I said well yeah why she said well you're not as excited as I thought you'd be can I share with her a story the last hour or 45 minutes before the polls close I had no idea what I was doing and what I should be doing mind racing a mile a minute butterflies and the stuff you know the whole bit you've been there so I was on a street corner up off highway 20 in Grayson back that was actually the one of seven district there's great big church it's way off the roads so you're far enough way you're not violating any campaign election laws waving at people they Hong Kong horns they'd holler at you some of you say holler something nice you know how it is but it's a big enough church that when they come out they're parking lot and they're driveway there's actually a stoplight right there and some people after they vote they may say something or they didn't about five minutes for the polls closed this elderly lady drove up and she rolled down her window and just one lane ten foot away or so got my attention and all she said was Mr. Kirby please don't let us down sometime after midnight takes Gwinnett County a lot of camp votes I finally realize I want and the first thing that came to my mind was that lady and I've tried to work every day to not to let her down don't know who she is don't know her name I'd hope if somebody did and ask her she would say yeah I made a great with everything it did but he didn't let me down that would be a good day people ask about going forward what's going forward for me when my French is horrible there's a native Frenchman you probably have a heart attack listening me speak it but going forward Losset Laid bomb tom roulet and with that I yield the well I You brought a lot of credit on that ugly Kentucky blue. Clerk will read the caption to a group of privilege resolutions. Honoring the life of memory of Dallas Franklin Gay Jr. recognizing commemorating the successful water conservation of management efforts of the past and present members of the general assembly. Congratulations and commending Sutton Tire, recognizing commending Julian Ideal CPA, recognizing commending and a lot of Myers Taylor. Congratulations Dr. Kathy Kat Schwag for being named the president of Kennesaw State University. Commending Kendall Ray Johnson as the younger certified farmer and Georgia in recognizing March 23, 2022 as Kendall Ray Johnson Day. Congratulations commending Young Men's Christian Association of Athens, Georgia for its 165 years of service and recognizing the low THC program revenue allocation and for other purposes. That completes the reading of privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here is none and the resolutions are adopted. Thank you. Okay, we're going on now to announcements. If you have signed up for an announcement, make your way to the front of the chamber. Chair recognizes Chairman Rich for an announcement. Thank you, Mr. Speaker. The majority caucus will meet upon adjournment in room 403 and lunch will be served. Chair recognizes Chairman F. Strachan for an announcement. Thank you, Mr. Speaker. House Judiciary Committee will meet at 130 in room 132. Chair recognizes Representative Ridley for an announcement. Good morning. Today is the day. How many times have I heard from the speaker and from members of this house? Ridley, where do you come from? And I'd like to meet the people that elected you. Well tonight, you're not. We're having Mary County night over at the Friday poll from 43630. We're having a meeting over in Seas. We don't have any rugs to get away because we don't make them there, but we've got a good handshake, a slap on the back and a good meal. So come over and say everybody. Is the meal from Edna's? Chair recognizes Representative Anoloids for an announcement. Thank you, Mr. Speaker. I also don't have any rugs to give away, but the women's legislative caucus is going to meet today. We are going to meet at noon. You will have a Zoom link in your email. You may pick up your lunch in room 216 between 1130 and 12 o'clock. We have a great speaker today with mothers and others for clean air. Thank you. Chair recognizes Representative Wilson for an announcement. Thank you, Mr. Speaker. Colleagues, our friends from Black Voters Matter are here with us at the Capitol today. They will be on the South Steps at 1230 for a group photo. If Black Voters Matter to you, you're invited to join us. Thank you. Chair recognizes Chairman Parsons for an announcement. Thank you, Mr. Speaker. Energy utilities and telecommunications will meet today at 3 p.m. and 403 upstairs here. And I don't see Chairman Meeks. Chairman Meeks is chairman of the Telecom Subcommittee of Energy Utilities and Telecommunications is having a subcommittee meeting at 2 p.m. I'm pretty sure it's in 403 also. You'll need to check with him. We should have got an announcement. So we're having subcommittee meeting at 2 p.m. at 3 p.m. at 3 p.m. Thank you. Chair recognizes Chairman Noel Williams for an announcement. Thank you, Mr. Speaker. I'd like to remind members of the banks in banking committee tomorrow morning room 506 at 8 a.m. 506 CLOV 8 a.m. Thank you. Chair recognizes Chairman Collins for an announcement. Thank you, Mr. Speaker. The Public Safety and Homeland Security Committee, the subcommittee of Gerald Green will meet at 1 o'clock in CLOV. It may be just a few minutes late because of a majority caucus meeting, but we'll be at 1 o'clock CLOV. Chair recognizes Chairman Dickie for an announcement. Thank you, Mr. Speaker. My members of our course can summarize the committee in the morning 8 o'clock CLOV 4.6. Thank you. Chair recognizes Chairman Lumsden for an announcement. Thank you, Mr. Speaker. There will be a member of the meeting of the full House Insurance Committee in the morning 8 a.m. CLOV 606. We have two bills. Thank you. Chair recognizes Chairman Cooper for an announcement. Thank you, Mr. Speaker. Health and Human Services Committee will meet today at 2 o'clock in room 606 in the L.O.V. In room 606 at 2 o'clock. Thank you. Chair recognizes Chairman P. 3 for an announcement. Thank you, Mr. Speaker. We will have a human relations and aging committee meeting today in 341 in the capital at 3 o'clock. Chair recognizes Chairman Setsler for an announcement. The Setsler Subcommittee of Judiciary Non-Sovil will meet in room 415 today, 415 at 1 p.m. take up two bills. Chair recognizes Chairman P. 3 for an announcement. Chair recognizes Chairman P. 3 for an announcement. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 10 a.m. On Wednesday, March 23rd, 2022. The majority leader has moved that this House will be adjourned until Wednesday, March 23rd at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it this House will be adjourned until Wednesday at 10 a.m.",
  "updated_at": "2026-02-13T03:44:43.765674+00:00"
}