{
  "video_id": "iMdOx9-j15s",
  "url": "https://youtu.be/iMdOx9-j15s?t=400",
  "title": "Georgia House - Day 39 (2026-04-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-04-02",
  "duration_minutes": 127,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**:\nThe session featured a prayer and remarks by Rabbi Hershey Minkowitz, who discussed the significance of Passover and its timing in the spring. The session also included the daily opening procedures like roll call and the Pledge of Allegiance.\n\n**Key Actions**:\nNo substantive legislation was passed or referred during this session. The focus was on the religious observance and opening formalities.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Rabbi Minkowitz gave a 2-minute explanation of why Passover is celebrated in the spring according to the lunar calendar.\n- His prayer reflected on the themes of renewal, liberation, and hope that come with the spring season and Passover observance.\n\n**Votes**:\nNo recorded votes took place.\n\n**Attendance**:\nThe speaker noted that all members were present and should come to the floor to signify their attendance.\n\n**Adjournment**:\nThe session did not adjourn, as it was the start of the day's proceedings.",
  "transcript": "All members, all members, please come to the floor. Good Wednesday morning. Good to see you all this morning because the hour, the hour, the convene, have it arrived. All members will please come to the floor. All members come to the floor and take your seats. Mr. Clerk, will you ring the bell? Good morning again. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? All members voted. All members voted. All members voted. If so, Mr. Clerk, will you lock the machines? Doors keep us. We will begin our day with scripture reading prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 48th House District, Representative Scott Hilton. Chairman Hilton. Thank you, Mr. Speaker. Your committee on information, sorry, I've got the wrong. That's the wrong thing. Hold on. Good morning, colleagues. God is good. Amen. The Hebrew word for peace is Shalom, and with two days remaining in the legislative session, there is no better person to bring us some Shalom than Rabbi Hershey Minkowitz. I'll say he shared with me in his house they have 11 children. So I'm guessing he has very little Shalom in his house, but he's going to bring some to this house today. In the summer of 1998, Rabbi Hershey Minkowitz was sent to Alfreda by the Chabad movement. Lady from the 51st, I'm getting a thumbs up. Thank you. A subsection of the Orthodox Jews to establish a Jewish worship and educational center for a growing Jewish community in North Fulton. Rabbi Hershey, as he's affectionately known, leads the Chabad of North Fulton until this day. Their center has become a primary address where Jews of all walks of life and religious backgrounds gather for Jewish enrichment and inspiration. Colleagues, please join me in welcoming Rabbi Hershey. Thank you. Good morning. A friend of mine recently told me that he took one of those private space tours to go see the moon. And when he came back, he told me, would you believe it? They even have a restaurant out there. I asked him, how was the food? He said the food was delicious, but the atmosphere was terrible. I hope you won't mind if I'm going to give you a brief two-minute spiel about the moon. I'm not an astronomer. There was not in the bio that Representative Hilton just read. It's just that next weekend we're going to be celebrating Passover. On April 12th, the Jewish community is going to be celebrating Passover. Interestingly, last year in 2024, Passover began on April 24th, 12 days later than this year. And in 2023, Passover began on April 5th. So why does it fluctuate? Let me quickly tell you the last five years since 2020 and see if you can detect the pattern. 2020, Passover started on April 8th, March 27th, 22nd, April 15th, 23rd, April 5th, 24th, and this year, April 12th. Every year Passover gets 11 or 12 days earlier than the year before, and then every two or three years, it gets set back a month ahead. Why is that? Well, in the book of Exodus, chapter 12, just before the Jews were leaving Egypt, God told the Israelites that from that point forward, they would begin keeping their calendar based on the cycle of the moon. Every month when a new moon appears, it's a new moon appears, it's a new month. Passover is always going to be on the 15th day of the first month when the moon is the fullest. And then in Exodus, chapter 13, verse 4, as the Jews are leaving the shackles of bondage behind, God says to them, and I quote, today you are going out in the month of spring. Rather than focusing on the name of the month, God is focused on the season, the fact that we're going out in the spring. So much so that later in Deuteronomy, just before the Israelites are about to enter into the promised land, God gives them a very firm reminder about how important it is to keep the holiday of Passover in the month of spring. Deuteronomy 161, you shall keep the month of spring and make the Passover offering to the Lord your God for in the month of spring, the Lord your God brought you out of Egypt. Sounds easy enough. However, to just one small problem, and that's why the holiday date varies every single year. You see the lunar calendar, the calendar that goes according to the cycle of the moon has 354 days, 11 days less than a solar calendar of 365 days. So every year Passover is going to get 11 days earlier and 11 days earlier. But hold on a second, God told the Jewish people that they have to keep the Passover in the spring. How is that possible if every year it gets 11 days earlier? So after a few months, Passover will end up being in the winter and then in the fall and then in the summer until it came back around again to the spring. Therefore, the Jewish calendar has a very complicated system where every few years we add a leap year, but not a leap year like in the regular calendar where it's one extra day, we add a full month. We end up with a year that has 13 months in a leap year instead of 12. All for this one reason, because Passover always has to be in the spring. So the million dollar question, and that will be the entry point into our prayer today, is why? Why did God care so much that Passover should always fall in the spring? To the point that we tinker with our calendar, to make sure that it stays in the spring, that the holiday of liberation should be always in the month of spring. Well, I'd like to ask you all to rise for prayer now as we pray and reflect on this idea of the spring. Mr. Speaker and the esteemed members of the Georgia State House, our Father in Heaven is teaching us something extremely important about freedom and liberty, the foundations upon which our great republic was founded. What does the spring represent? Honourable Speaker and esteemed members of the House. As we gather today in this chamber, I offer a reflection rooted in the spirit of renewal and hope that comes with the season of spring and the observance of Passover. Passover, a time of remembrance and freedom, invites us to reflect on the journey of the Israelites from bondage to liberation. It is a season that marks not only the liberation of people, but also the renewal of life itself. Just as the plants awaken from their winter rest in the spring, blossoming into vibrant new growth, so too can we embrace the opportunity to renew our commitments to justice, peace, and the well-being of our people. Spring reminds us that from the coldest and darkest of times, life finds a way to bloom again. It is a time to sow seeds of kindness, compassion, and progress for the future. Just as the earth comes alive with new growth, let us also plant the seeds of positive changes in our hearts and in our work, nurturing them with wisdom and care. So let us pray that we in our roles as leaders and servants of the people, draw inspiration from the season of renewal, embracing the promise of new beginnings and the hope that each day offers. Let this time of Passover remind us of our shared humanity, our capacity for transformation, and our duty to lift up those in need. May our work in this house be guided by the spirit of liberation, renewal, and growth, and may it be a fruit for the prosperity and peace for all Georgians, amen. And now please join me in reciting the Pledge of Allegiance. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. Thank you, Rabbi Hirschby. We appreciate your presence here with us and appreciate your service to your community and to the state. And thank you for that lesson this morning. We're all about history in this historical place here, and we're looking forward to a wonderful Passover. Doorkeepers, you may unlock the doors, memories you may join the Rabbi in the south any room for a photo. And thank you for his service to us here today. Thank you. Thank you. Thank you. Members, our doctor of the day is brought to us on this Wednesday, on this 39th day by representing Sheila Jones, Dr. Kelly, the graphic read. I'm sorry. Is downstairs in the aid station if you need, Dr. Reffin reads, assist us. You should be more than glad to help you. Thanks for serving with us today, Dr. Reffin reading. Chairman Hilton, the chair of the Committee on Information Audits has recognized. Thank you, Mr. Speaker. Now's the right time. Your Committee on Information Audits has read the journal the previous legislative day, and we have found it to be correct. Chairman Hilton, the chair of the Committee of Information Audits reports that the journal the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal, hearing none the reading the journal is dispensed with? Is there any objection to confirmation of the journal, hearing none the journal is confirmed? Mr. Clerk, will you read the resolution establishing the order of visits for the day? Mr. Clerk. Representative Astrachion of the 104th booth following me establishes the order of visits to the first part of the period unanimous consent. Introduction to bills and resolutions, first reading of reference of house bills and resolutions, second reading of bills and resolutions, third reading of passage of uncontested local bills and resolutions, first reading of reference of senate bills and resolutions, warning orders. Is there any objection to the resolution establishing the order of visits for the day, hearing none the resolutions adopted? Members, I have a mission for you if you don't want to hear first readers. So in this out there any room, I just want to take a second to recognize there's a large poster there that some of you came in the south any room saw that poster. This poster is the official FIFA World Cup 2026 poster for the city of Atlanta and the great state of Georgia. Sometime this morning, if you're having a conversation, it would be a great time to do it right now. Police take a few seconds to grab this out the any room inside the poster and grab a sharpie out there and you can be able to put your join Henry on that poster. So an ad bill appropriate time. First reading the bills and resolutions, the clerk will read. Hospital 883 by reference of Jasper to the 11th Bill B. Tyler Nack to men article 88 at chapter 1 and title 10 of the E. Fiskota Georgia and T.E.D. related electric vehicle charging stations. Police then means hospital 884 by reference of Canada 58 scope. 63rd you believe the 141st, better than 94th. Smith of the 18th. Bill B. Tyler Nack to men chapter 2 a. Title 31 of the Fiskota Georgia and T.E.D. related the department of public health. Public and community health. Hospital 885 by reference of Canada 58 scope field 63rd Park, 117th Crawford of the 89th Smith of the 18th. Bill B. Tyler Nack to men chapter 2 a. Title 31 of the Fiskota Georgia and T.E.D. relating the department of public health. Public and community health. Hospital 886 by reference of the 11th of the 57th base more than 69th Bill in the 62nd. Schofield the 63rd can in the 58th. Bill B. Tyler Nack to men chapter 1 a. Title 50 of the Fiskota Georgia and T.E.D. relating the general provisions regarding state government. Public and community health. Hospital 887 by reference of Stevens 1164. Saints of the 180th Hitchinson 1161 and Ballot of the 147th. Bill B. Tyler Nack to men chapters 14 and 41 of the title 43. The Fiskota Georgia and T.E.D. relating the electrical contractors. Hospital 886 by reference of the 57th base more than 69th Miller the 62nd Schofield the 63rd can in the 58th. Bill B. Tyler Nack to men chapter 1 of the title 50 in the Fiskota Georgia and T.E.D. relating the general provisions regarding state government. Governmental affairs. Hospital 887 by reference of Stevens 1164. Saints of the 180th Hitchinson 1161 and Ballot of the 147th. Bill B. Tyler Nack to men chapter 14 and 41 of the title 43. The Fiskota Georgia and T.E.D. relating the electrical contractors, plumbers and air conditioner contractors. Regulated industries. Hospital 88 by reference of Carpenter the fourth of Bill B. Tyler Nack to men title 20. The Fiskota Georgia and T.E.D. relating the education. Higher education. Hospital 889 by reference of Sanchez the 42nd Park of the 107th Santos of the 117th. Barry the 56th and Dina the 110th and others. Bill B. Tyler Nack to men chapter 1 of the title 35. The Fiskota Georgia and T.E.D. relating the general provisions regarding law enforcement officers. Public safety and homeland security. Public House Bill 890 by reference of Carpenter the 46th. Mark to the 49th blackman and the 146th. Bill B. Tyler Nack to men. Go section 483 of the Fiskota Georgia and T.E.D. relating the exemptions from sales and use taxes. Ways and means. House 891 by reference of Williams the 148th hatch and the 155th cars in the 46th. Meeks the 178th roads the 124th and others. Bill B. Tyler Nack to men article 10 of chapter 2 to the title 47. The Fiskota Georgia and T.E.D. relating the Georgia state employees pension and savings plan. Retirement House Bill 892 by reference of Holcomb of the 101st. Buckner 137th Miller the 62nd happens to the 57th and the Barrett of the 24th. Bill B. Tyler Nack to men article 1 of chapter 24. A. Title 43. The Fiskota Georgia and T.E.D. relating the massage therapy practice. The Regulated Industries. House 893 by reference of Hilton in the 48 Jones the 47th baller the 147th rice the 139th. Duke of the 29th. Bill B. Tyler Nack to men title 20 the Fiskota Georgia and T.E.D. relating the education. Education. House Bill 894 by reference of Holcomb of the 101st and blackman of the 146th. Bill B. Tyler Nack to men article 1 of chapter 10 of title 17. The Fiskota Georgia and T.E.D. relating the procedure for sentencing an imposition of punishment. Did you do Sherry non-civil? House Bill 895 by reference of Sinson the 150th ability to act to men chapter 6 and title 47. The Fiskota Georgia and T.E.D. relating the Georgia legislative retirement system. Retirement House of Resolution 882 by reference of Hatchy to the L.A.D.\n\n155th the resolution proposing an amendment to the Constitution. Ways and means. Resolution 883 by Representative Stephenson on 64th Campbell 15th Seaball 34th Clark the 100th Saints of the 180th and others. The resolution credit a House study committee. I'm making Georgia the number one state for turns. Economic development enterism House resolution 884 by Representative Gaines of 120th Jasperus 11th Hilton 48th. Green in the 154th and MC the 13th. Resolution urging increased state autonomy to allow for certain creative creation of innovative solutions. Special rules. That completes first readers. Second reading the bills and resolutions the clerk will read House bill 874 by Representative Huddleston of the 72nd Chastain of the 7th Clemingham the 114th Jones of the 25th McCall of the 30th. A bill relating to general provisions relative to Adrenaline Taxation and Property House bill 875 by Representative Florida of the 74th. Howard of the 129th Beckles of the 96th Census of the 117th Niel of the 79th and others. A bill relating to dispossessory proceedings House bill 876 by Representative Florida of the 74th. Dawson of the 65th Jones of the 143rd Hearing of the 145th Fri of the 122nd. A bill relating to landlord intended House bill 877 by Representative Jackson of the 68th base more of the 69th. Bonner of the 73rd Mathiac of the 82nd. A bill to provide a new charter for the City of Fayetteville House bill 878 by Representative Pended of the 94th. Coggins of the 14th. A Q-leave the 111st Hawkins of the 27th Cooper of the 45th and others to bill relating to holidays and observances House bill 879 by Reps and Parsons of the 44th Parten of the 5th McCall of the 30th. Coggins of the 14th and others. A bill relating to duty of driver of the vehicle meeting or overtaking school bus reporting violations, civil monetary penalty or violations captured by school bus camera. House bill 880 by Representative Black, one of the 146th Kelly of the 16th Stevens of the 164th Newton of the 127th Martin of the 49th and others. A bill relating to imposition rate computation exemptions credits relative income taxes and management budgetary and financial affairs. House bill 881 by Representative Campbell of 35th, you believe in the 141st Gen to the 16th Roberts of the 52nd Mitchell of the 88th. The bill relating to holidays and observances House bill 882 by Reps and Parsons of the 72nd Anderson of the 10th Dickey of the 134th. A bill relating to landscape architects. House bill 896 by Representative Clark of the 100th, due to the 29th Hawkins of the 27th, cox of the 28th, hung on 103rd and others. A bill relating to authorizing the governing authority of Paul County to let me an excise tax House Resolution 859 by Reps and limit the 98th up to the 83rd Resolution creating House Study Committee on inclusive educational settings for students with disabilities of resolution 885 by Reps. Anderson of the 10th Thomas of the 21st Flaming of the 114th Lever to the 123rd Resolution creating the House Study Committee on election procedures. House Resolution 886 by Reps and Parsons of the 180th Resolution honoring the life of Mr. Rachel Hodg, dedicating an intersection in her memory. House Resolution 887 by Reps and Parsons of the 16th and are one of the 32nd Resolution creating the House Study Committee on reducing and prioritizing mandates for public school administration. Senate Bill 352 by Senator Williams of the 25th, Anderson of the 24th. A bill to provide a home study exemption from Jasper County School District Adlor in taxes House Senate Bill 356 by Senator Invarx, the 31st. A bill to provide a home study exemption from Polk County School District Adlor in taxes Senate Bill 358 by Senator Jones of the 10th, Carol LaFordia of the Mangame of the 5th, Anderson of the 43rd parents of the 44th and others. A bill to amend and act for advising Superseeing, consolidating the laws relating to the governing authority to Cab County and creating a chairman and board of commissioners for said County. Senate Bill 359 by Senator Jones of the 10th, down in part of the 17th, straight under the 42nd Williams of the 25th. A bill to amend and act to provide a new board of commissioners for Henry County through second readers. Senate Bill 359 by Senator Jones of the 25th, Anderson of the 25th, Anderson of the 25th, Anderson of the 25th. Senate Bill 359 by Senator Jones of the 25th, Anderson of the 25th, Anderson of the 25th, Anderson of the 25th. Okay members, if you'll come to your desk, we do have a local calendar this morning. But I guess we'll do committee reports where we do a local calendar, trying to get their attention Mr. Clerk, which has been a little bit difficult this morning. Okay, Mr. Clerk, if you're ready, we'll have reports of standing committees. Mr. Clerk, will you read? Representative Chris, we're one of the 32nd District Chairman of the Committee of Education submitted the following report. But speak your committee on education has had under its consideration following bills and resolutions of the House and Senate. The minister reported the same back to the House with the following recommendations House resolution 887 to pass House Senate Bill 179 to pass by substitute House resolutions 711 to pass Senate Bill 152 to pass by substitute respectfully submitted. Representative Chris Erwin, one of the 32nd District Chairman. Representative Hawkins, the 27th District Chairman of the Committee on Health submitted the following report. But speak your committee on health has had under its consideration following bills of the Senate is instructing me to report the same back to the House with the following recommendations Senate Bill 91 to pass by substitute Senate Bill 39 to pass by substitute respectfully submitted. Representative Hawkins, the 27th District Chairman. Representative Jesse Petrie, the 166th District Chairman of the Committee on Human Relations and Aging submitted the following report. But speak your committee on human relations and aging has had under its consideration following resolution of the House is instructing me to report the same back to the House with the following recommendations House resolution 816 to pass by committee substitute respectfully submitted. Representative Jesse Petrie, the 166th District Chairman. Representative Beth Camp in the 135th District Chairman of the Committee on Intergovernmental Coordination Locals submitted the following report. But speak your committee on intergovernmental coordination locals had under its consideration following bills of the House and the Senate is instructing me to report the same back to the House with the following recommendations House bill 825 to pass Senate Bill 328 to pass Senate Bill 329 to pass Senate Bill 340 to pass Senate Bill 344 to pass Senate Bill 347 to pass Senate Bill 347 to pass. Senate Bill 336 to pass Senate Bill 355 to pass respectfully submitted. Representative Beth Camp in the 135th District Chairman. Representative Tyler Paul Smith, the 18th District Chairman of the Committee on Judiciary Non-Sivil submitted the following report. Representative Smith, the 18th District Chairman of the Committee on Judiciary Non-Sivil has added the RIDGE consideration following bills of the Senate as instructing me to report the same back to the House with the following recommendations Senate Bill 218 to pass by committee substitute Senate Bill 268 to pass by committee substitute respectfully submitted. Representative Tyler Paul Smith, the 18th District Chairman. Representative Sharon Cooper, the 45th District Chairman of the Committee on Public and Community Health submitted the following report. To speak your committee on public and community health and sat under its consideration following bills and resolutions of the House and the Senate as instructing me to report the same back to the House with the following recommendations House resolution 304 to pass House resolution 593 to pass House resolution 847 to pass by committee substitute Senate Bill 101 to pass by committee substitute. Representative Sharon Cooper, the 45th District Chairman. Representative Hagen, the 156th District Chairman of the Committee on Rural Development submitted the following report. To speak your committee on Rural Development has added under its consideration the following resolution to the House and as instructing me to report the same back to the House with the following recommendations House resolution 753 to pass. Representative Hagen, the 156th District Chairman. Representative Jones, the 25th District of the Committee of Technology Infrastructure Innovation submitted the following report. To speak your committee on technology and infrastructure innovations had under its consideration following resolution to the House as instructing me to report the same back to the House with the following recommendations House resolution 817 to pass by committee substitute respectfully submitted. Representative Jones, the 25th District Chairman. Representative Rick Jasper, the 11th District Chairman on Committee on Transportation submitted the following report. To speak your committee on transportation has added under its consideration the following resolutions to the Senate as instructing me to report the same back to the House with the following recommendations Senate resolution 8 to pass by committee substitute Senate Resolution 231 to pass by committee substitute respectfully submitted. Representative Rick Jasper was the 11th District Chairman that completes the reading of the report to standing committees. All right members you may want to get closer to your seats. We're going to take up the local calendar. We'll take up the local calendar. Okay members two bills on the local calendar relate to homestead exemption and will require a two-thirds roll call vote for passage. Third reading of passage of uncontested local bills. What purpose does Cheryl the lady can't rise to make a motion? I make a motion to remove from the local calendar Senate bill 336 and Senate bill 555 and send them back to the Intergovernmental Coordination Committee. Mr. Clerk will you read the caption Senate Bill 336 by Senator Moore the 53rd date county Senate Bill 355 by Senator Anna Navarte the 31st Paul Dinkamp. On the ladies motion that Senate bill 336 and Senate bill 355 be recommitted to the Intergovernmental Coordination Committee as their objection hearing none of this ordered. What purpose does chairman Crow rise to make a motion? State your motion. I move that House bill 825 be removed from the local calendar and voted on separately. Mr. Clerk will you read the caption House bill 825 by Representative Washburn to the 144th Monroe County. On the Jimmers motion that we remove House bill 825 that we can pool 825 from the local calendar voted separate is the objection hearing none of this ordered. Mr. Clerk we have a motion to remove House bill 825 and move it separately. That's the motion. Mr. Clerk we have a motion to remove House bill 825 from the local calendar vote. Mr. Clerk we have a motion to remove House bill 825 from the local calendar vote. Mr. Clerk we have a motion to remove House bill 825 from the local calendar vote. Mr. Clerk we have a motion to remove House bill 825 from the local calendar vote. Mr. Clerk we have a motion to remove House bill 825 from the local calendar vote. For what purpose does Chairman Crow rise? Mr. Speaker I'd like to withdraw my previous motion to remove House bill 825 from the local calendar. The gentleman motion is so granted he's withdrawn his motion to remove House bill 825 from the local calendar. For what purpose does Chairman Crow rise? To make a motion. Stay at your motion. I move to remove House bill 825 from the local calendar and remit it back to the Intergovernmental Coordination Committee. Mr. Clerk we are here to caption to House bill 825. House bill 825 I wrote a letter of Washington in the 144th Monroe County. On the ladies motion the House bill 825 be recommitted to the Intergovernmental Coordination Committee as their objection. Hearing none it is so ordered. If there is no objection we will vote on the local calendar as they hold with a recorded vote hearing none of this ordered. Mr. Clerk let me get this quiet down just a little bit. This local calendar is imported to a few people in here. So if you have in conversation you take it to the any room. Mr. Clerk will you read the local calendar? Senate bill 328 by Senator Strickland in the 42nd Henry County Senate bill 329 by Senator Strickland in the 42nd Flint Judicial Circuit Senate bill 340 by Senator Watson in the first city of Ty B. Island Senate bill 344 by Senator Kennedy 18th. The Senate bill 345 by Senator Kennedy 18th Crawford County Senate bill 347 by Senator Hodges III Glint County City of Brunswick. Okay members some of you were not listening earlier so we pulled and sent back committee Senate bill 336355 and House bill 825. Is there any objection to the previous question being ordered on the local calendar hearing none the previous questions ordered. Is there any objection to a green to the report of the committee which was favorable to the passage of the bills hearing none the report of the committee has agreed to. The bill is now passed all those in favor of the passage of the bills on the local calendar answer those three I just mentioned will vote yes all those opposed will vote no. The bill is now passed all those opposed will vote no. Have all members voted. All members voted this so Mr. Clerk were you locked the machine. All the passage of the local calendar the years are 168 the nays or zero this vote is without House bill 825 Senate bill 336 and 355 these bills have received the requisite constitutional majority and they're therefore passed. Okay members we have a whole slew of morning orders. We could be here to lunchtime with morning orders but here's a posture. The red light won't be a warning the red light will be a cut off so I strongly encourage you to recognize these good people that in the gallery that are here celebrating with us today and welcome we appreciate you all being here. I'm going to give you the list a couple of folks representing Oliver you're recognized to begin our morning orders. Representative Scott feel representative Barry you are on deck. Let's make sure they're going to give you attention just for a moment. Okay members that South any room is wide open so if you're on the floor and you need to have conversation. Take it out to the South any room or the front door or we're going to pause if lady will suspend until we get attention. Thank you. Thank you Mr. Speaker representative Crawford and I are happy to recognize Decatur Presbyterian Church that was founded in 1830 1825 three years after the United States signed a treaty with the Indians. It has been a founder of kindergarten a founder of sunny school for the cab county it is a leading entity in our world of the cab county we're very grateful to have them with us today. Thank you for all your service including for the last 15 years a global village school for international teenage girls which initially was founded hundreds of years ago with Agnes Scott College. Thank you ladies and gentlemen. Great to have you with us and thank you for what you're doing in the community. Did they stand you wouldn't you all want to stand so we can recognize you. Here they are to the left roughly. The replica scope. She can talk fast she's formally from New York but she's a Georgia now the ladies and gentlemen friends keep it moving Kim thank you Mr. Speaker colleagues I rise today in honor of exemplary leadership in this and this chamber. I'm recognizing it with house solution or house resolution 738 contributions made by meteorologist and feature reporter Paul Milliken Paul stand up as I talk about you Paul is so dedicated every day to making sure that he's promoting Georgia businesses. I'm introducing you Georgia's beautiful landscape parks I learn music dance cultural things because of Paul Paul you've made a great impact in our community you will forever be known in Georgia history. That's one. All right thank you everybody stand up and get Paul ahead you see him every day on good day Atlanta. All right my next one is thank you Mr. Speaker for that one colleagues I actually want to tell you just a little bit story about this I'm going to have Mr. Eric straighter from Atlanta W a Atlanta news verse to stand up and be recognized several years ago I started a program called Pledge of Allegiance and listen up because this is for you. Every day on CBS Atlanta we highlight middle elementary schools that are doing the Pledge of Atlanta three times in the morning and I started this and we launched it in November and it's been going to the end of the year so if you're interested in having your school your students to recite the Pledge of Allegiance and it's featured on the TV please let me know. Eric where are you Eric thank you for you and your amazing team we talk about ethics we talk about civil thank you Eric W Atlanta news first thanks a lot meet me in the animal guys let's take some pitches. I'm out of here Mr. Speaker you did pretty good. Good to have you all you did good on that part you didn't talk as fast some other people I know from New York but that's the ones representative Barry is recognized now I want you all to give the gentleman your special attention. Reps. A co-ye at your next and then representative butner. All right thank you. Thank you Mr. Speaker you all know I'm no greater privileged and serving people at the 56 but my greatest honor that I have in this life is being a teacher and it is my great great great pleasure to welcome the mighty mighty wolf Pat from young middle school my class to the Capitol today. That's my seven graders they they are annoying they smell but we love them. I'm inviting everyone in here today to join us in Capitol 230 at round noon for lunch with us if you want to come down to meet my students they're great you're they won't bother you I promise that's about me but thank you all for me here today excited who helped you out the Capitol love you all. Thank you. Reps. A co-ye recognize for a morning order you can do it talk fast. Represent for you and friends. Thank you Mr. Speaker. I'll let us in gentlemen I rise this morning to recognize a gentleman who is always there come rain come shine cold or warm greeting people guiding them around and helping the elderly's time go through the steps. He and he always gives you a smile though you won't see it because he's so bearded you don't see the smile but let us gentlemen. Westfield learning can you please stand up. I have a solution for you feel come on down to the until for pictures thank you Mr. Speaker. Phil you're a fixture man we appreciate you thank you for your good will. Remafiated Buckner recognize for a morning order.\n\nThank you, Mr. Speaker. On your desk amongst all of the paper is a thank you note. It may be the only one you get today, so be sure you look for it. This is from the people in Warm Springs, and they are very grateful for the state appropriation that was given back in 2022 to do the infrastructure of the pools in the past. They could only be open on Memorial Day and on Labor Day. And now because they have been fixed, they will be able to be open from Memorial Day to Labor Day. So thank you, thank you, thank you for the public and private funding that helped give jobs to Georgia companies and Georgia workers to fix our very special historic pools in Warm Springs. Thank you. Warm Springs, warm place to be, a beautiful place. Thanks to this House for supporting. Chairman Hilton, Director of the Morning Order, then we're going to have Pro Tem Jones and her team. I'll name them off when they come up. Chairman Hilton. Thank you, Mr. Speaker. I rise to recognize Head Coach Keith Maloof, who recently retired after his retirement at nearly 40 years of head coaching. From 1999 to 2025, Coach Maloof was head coach at Norcross High School. Over the course, he never had a losing season. Him and his wife are up there in the gallery. Please recognize them. Give them a big round of applause. Keith Maloof, congratulations on your retirement. Come on down and join us for a picture. Thank you. Welcome to the People's House. Speaker Pro Tem Jones, Representative Neil, Yasmin Neil, Representative Cooper, Representative Stevens, Representative L Williams for Resolution. Well, thank you. Well, thank you, Mr. Speaker. Please join us in honoring for the 25th legislative session, Wesley Nichols. It's his 25th year as a member of the Capitol Press Corps. He serves as lead Capitol photographer for Georgia Public Broadcasting Lawmakers and has helped countless of us with coverage on the formation of laws throughout the legislative process. He personally knows many of you from his two and a half decades of exclusive interviews, press conferences and live hits. And we are thrilled to honor Wes on his quarter century career milestone capturing Georgia politics. And Wes, we'd love to ask you to meet us in the annual room so that we can have pictures with you. Thank you and congratulations. Congratulations. If you're joined in this out there in Representative Trey Kelly, please recognize for a morning order. Give the gentleman your attention, please. Thank you, Mr. Speaker. Colleagues, I'm honored to get to welcome back to the Capitol, the Cedar Town High School Game Day cheerleaders. We're having them back, Mr. Speaker, because they are the back-to-back state champions for a Game Day cheerleading. They're here with their coaches, Shade Dyer and Shannon Allen. They're up in the gallery. We're so proud of them in Cedar Town. And so we just want to help welcome them to the Capitol if y'all are staying to let us recognize you. Applause Thank you, Mr. Speaker. Did you say state champions back-to-back? Congratulations. That's awesome. Proud of y'all. Thanks for being here with us. Representative Crawford has recognized for a morning order. And I think you have some friends with him. Representative Crawford. Thank you, Mr. Speaker. These friends today, I rise to support two different groups of athletes, as you know I love sports, because they bring communities together. But I'm here to represent people who have done amazing things breaking barriers. First, I'd like to acknowledge Drew Charter School for being the first acknowledged Drew Charter School for being the first all-black golf team to win a state championship in our state. Please stand and be recognized. Applause And I would also like to recognize the parents of Pilar King who was the first to win a gold medal in swimming. First black and also the first from South with the Cav High School athlete. Applause Thank you for breaking barriers. Guys, come and meet me in an anti-roll just so we can take pictures. We're proud of you. Thank you. Thank you, Mr. Speaker. I yield the well. Thank you, Representative Crawford. That's quite extraordinary. Thank you all for being here. Appreciate it. I'm sorry, Representative Adinia. Draconized, do you have friends with you as well? Yes, you do. Representative Adinia and friends, give the gentleman your attention, please. Thank you, Mr. Speaker. Mr. Speaker, please extend the women's month to this month because there's so many women have accomplished things and we don't have enough months in the year. I want to recognize if she can please rise, Mrs. Ego Undukwe, who is the chief operating officer of another chance customized services that provides disability services for people in our community. She also was on the governor's committee for disabilities and she also provides a nonprofit in Nigeria that also provides support for people with disabilities. She is recognized and she's passionate about what she does and I like to recognize her for this April's month, women's month, and recognize her for the work she does. Thank you. Big round of applause. Welcome to our house. Thank you, Mr. Speaker. Thank you. Welcome to the people's house. Representative, we all wait. Representative, we wait and friends. You do have friends, I'm surprised. I've got a couple. There you do. Gentlemen's recognize. Now they all went back to their seat, just kidding. Thank you, Mr. Speaker. Colleagues, if you'll all rise, we have the honor today to recognize our friend, I'd like her to go and stand up. The Georgia teacher of the year for 2025, Miss Holly Witcher, White County at Testity Elementary School. She works with K through second grade special needs children. And let me tell you, she loves being the teacher of the year to represent our state, it costs this country. But she told me, and I got to hear her tell our first lady and the governor, she can't wait to see those children back in August. But we welcome you to the house and congratulate you on your excellence in education. God bless you. Thank you, Colleagues. Thank you, Mr. Speaker. Thank you, Holly. Congratulations, what a achievement. Representative Reese and the Columbus delegation, Representative Teddy Reese and the Columbus delegation are recognized for a morning order. Thank you, Mr. Speaker. Mr. Speaker, we are excited to have with us today, Mr. Risha Lawrence. If you would please stand by. While we acknowledge the music and entertainment council, and we welcome to Columbus the inaugural Maw Fest. This fest is in recognition of Marraini, who was from Columbus, Georgia, and will also recognize other women within the historical perspective of our musical history right here in the state of Georgia. We are very excited about Maw Fest. We are excited about Miss Lawrence. We're leading us on this venture in Columbus. And we invite all of you to come to Columbus, Georgia, May 10th through the 11th for Maw Fest, where we are guarantee to have a good time. Thank you, Mr. Speaker, year-to-year. Well. Representative Kendrick and friends, the lady is recognized for a morning order. Good morning, Colleagues. Thank you, Mr. Speaker. It is a great day in Georgia to recognize and commend the Atlantic Institute. Many of you may have went to their inner faith dinner that they had last month. But let me tell you a little bit about them. The Atlantic Institute is a Georgia-based nonprofit organization committed to fostering dialogue, education, and cultural understanding. And they promote mutual respect and peace by increasing public awareness of diverse cultures, belief, traditions, and perspectives. And through their many initiatives, the organization has had a significant and positive impact on this communities. So if they will stand up, or they're already standing up, if you can stand up and give them a round of applause and thank them for the work that they're doing here in the state of Georgia, if you can come down to the anti-Rome so that we can take a picture with you will have your resolution. But thank you, Mr. Speaker. A representative, Holly, is recognized in friends and representative, bail your next. All right, by Henry County folks, come on up here. Henry County delegation. Well, Mr. Speaker, the day is the day the Lord is made, we shall rejoice and be glad in it and have in our presence the wonderful students of Eagles Landing Christian Academy and the gallery. There we see, go rise up. Thank you. We have Ed Master, Dr. Curley, as well as our region five athletics here. My colleagues, I know you all are busy, but if you love the Lord Jesus Christ and the good that he's doing in Elkwood, can you all rise and give a round of applause to these students? All right, Brad, too. I can't believe it. Thank you. Thank you, you the well. Where they moving? Thank you. Representative Del ring Carter, recognize for a morning order. Representative Carter. Good morning. Thank you, Mr. Speaker. Good morning, colleagues. On Monday was the last day of Women's History Month that we had some individuals that we wanted to honor and we were not able to honor them Monday, but we wanted to acknowledge them today if they're in the gallery. We were asked Ms. Christine Conrado and Ms. J. Gibbs, if you all will stand. Okay, okay, they're over there. Yay. So these ladies are a part of the pocketbook brigade. What they do is empower and teach women about how to best use and grow their money. Thank you, ladies, for being here. Thank you for what you do, because you all know I love financial education. So if you guys would, members, would you welcome the pocketbook brigade to the Georgia State Capitol. Thank you, I yield the wealth. Thank you. Representative Gaines has recognized for a morning order. Representative Houston Gaines, give the gentleman your attention, please members. Thank you, Ms. Speaker. This morning, I'm proud to recognize the North O'Connie Titans basketball team that's here. They're back-to-back Class 4A State Champions. Last two seasons have a record of 60 and five. They beat Pace Academy 60 to 51. And this recent State Championship over the last two seasons, two state titles, two region titles. We're honored to have the team as well as that leg director, their head coach and assistant coaches. If you all wouldn't mind staying up recognized so we can recognize you. Thanks so much for being here. Appreciate it. Congratulations. Applause. Representative Park Cana has recognized for a morning order. Representative Cana. And friends. Yes. Yep. All right. Thank you, Mr. Speaker. Today is Paranatal Provider Appreciation Day. We are honoring Michelle Riggs, if you will stand, on your retirement of 25 years of service to well-star as a director of women's health, education, and patient and support services. We're honoring Dr. Paula on her work with the Spanish speaking communities. Thank you for all that you do. And Dr. Bird, for your studies on HPV and your expertise in minimally invasive gynecology. Thank you to the small talk team that is also here, for all you do to provide for little ones to hear good stories while in the womb. It is also AMR Day at the Capitol. They have ambulances outside if you have not seen. And I would love to ask you to stand. Lance, Chris, Derek. Thank you so much for all that you and your workers do for the emergencies in Georgia. Thank you to the birth responders. Thank you to the group that is over here as well. Please go visit them outside and please come join us for a photo in the South Antirune. Congratulations. Thank you, Mr. Speaker. I hope. Thank you, Representative. Great to have you all. Thanks for what you do. Representative James Barchett. And friends, you have some Georgia Southern folks with you, Representative Barchett. Yes, sir. Representative Barchett, be joined by his Georgia Southern folks if you'll join them. Please, Representative Barchett. Gentlemen, suspend. Thank you, Mr. Speaker. Suspense just for a minute. Let's get some attention. Thank you. Where's Brad at? You have some friends from Georgia Southern who want to join. You'll see one more. He's coming down. You've got to graduate from Georgia Southern. Dean Green, did you graduate from Georgia Southern? Come on down then. It's been a day or two. Gentlemen, recognized. Thank you, Mr. Speaker. Colleagues, I have a great honor of introducing a Georgia Southern University Clay Target team who has, for the fourth time, one in the national championship. And five years, this team has won four national championship under the leadership of a close and person to me and my stepfather, Marty Fisher, has taken this team to San Antonio for four years and completely dominated the American Clay, the American sports, or overall, excuse me, ski shooting championship. I'll say that out of 1200 students, this team has had the opportunity to set an overall high record. I want to recognize some of these members on the team. Tate Skipper shot a 100 out of 100 in American ski. Andrew Cohen shot a 100 out of 100 high overall ski champion Blake Reed shot a perfect score in American trap and Miss Cheyenne Anderson shot second overall. And they're in the gallery with us. I'd ask you all to stand up and be recognized for this high and great honor national champions four years in a row, unprecedented, and that's just fantastic. Very much appreciate you. Thank you, Mr. Spiger. Thank you, Representative Burcett. Four years in a row? Wow. Way to go, Georgia Southern. Y'all make us proud. We appreciate you. And to my dear friend, childhood friend, Marty Fisher, thanks for your great instruction and great leadership in your friendship over the years. Appreciate you all. Representative Bell. This will complete our morning orders. Representative Bell is recognized for a morning order. There we go. General was a spend just for a moment. Excuse me, I have some friends joining. He feels a spend just for a minute. Members, this is our last morning order. And then we have an invite resolution. So members, if you will, come to the floor and board at conversations need to go to the any room. Representative Bell. Good morning, colleagues. It gives me a pleasure to announce that the Morehouse College Intercollegiate Boxing Team is the first HBCU to everyone in the national championship. Applause. This team was started by Jacobi Bell in 2012 and they produced hall lots. Often he would get chastised for doing so until Chief Prescott took it upon himself to be the first mentor and officially charter the club. Through the years of hard work and loyal dedication, the Morehouse Boxing Club has been able to compete in the 2025 US IBA national championship last week. Through a lot of adversity, we were able to leave the two belts earned from the national champions from Caleb Hudson and Elijah McLean. We'd like to thank the USB. And there's my time. Also, we'd like to thank the members, Evan Stevenson, Alaliya Goliath, Joshua Callahan, Elijah McLean, Evan Sufia, and Breon DePri. If they're in the chambers right now, can you please rise and give them a round of applause? Applause. They were here. They're moving a little slower. Thank you, Mr. Speaker, I yield the well. Congratulations, Joan, quite their accomplishment. Members, we have an invite resolution. So have your attention for the gentleman I'm getting ready to recognize. Mr. Clerk, will you read their caption to a resolution, House resolution, 8, 7, 8, 878. Mr. Clerk. House resolution, 878 by Representative Oswade of the ninth, stillcocks the 53rd, clipped into the 131st, Willow's the 55th, Chastain of the 7th and others, a resolution, commanding the 988 Suicide and Crisis Lifeline. Members, this has been a priority of this House. Over a number of years, appreciate the House's support on this important issue. And I former member of this House Commission Tanner, he's here with us as well today. But I'm gonna let the gentleman who sponsored the resolution acknowledge all of our guests who are here, Representative Willow, Wade is recognized to speak to the resolution. Thank you, Mr. Speaker. I appreciate that very much into my colleagues. I think it'd be appropriate if we could rise because we have the honor today to welcome George's First Lady, the best First Lady in these United States, Ms. Marta Camp. Thank you. Amen. It's also my true honor to be able to recognize one of our colleagues, our former member of this body, my predecessor, Kevin Tanner, the Commissioner and Department of Behavioral Health and Disability Services. I'm gonna read this briefly and then I wanna just make a comment and then turn it over to our First Lady. So we are committing the 988 Suicide Crisis Lifeline, whereas behavioral health conditions, including mental and substance use disorders or critical public health issues. And 988 was established to improve access to crisis services in response to the country's growing suicide and mental health crisis care needs. Our First Lady has led in this effort as so is Kevin Tanner. And I also wanna mention the efforts around human trafficking and sex trafficking, the impact of children. That is a contributor to mental health crisis as well. And those folks, those survivors, have finally had a voice and I couldn't be more proud than to let you hear from our First Lady. Thank you. Well, thank you so much. I appreciate all of you. And thank you. I wanna personally thank you for passing the 10th piece of legislation for human traffickers. Not only to help them, but to have harst your penalties on the perpetrators. And I was very honored that Commissioner Tanner asked me to help put the word out on 988 to let everyone know it's okay to not be okay. And I think that's what we would need to remind people everywhere because these tough topics that are hard to talk about, we need to talk about. And every one of you has supported that. And I wanna tell you, from the bottom of my heart, thank you so much for helping so many hard work and for having Georgia and so appreciate all of you. Thank you. Sorry, turn it over to my great buddy, Commissioner Tanner. Thank you, Representative Wade, Speaker. First Lady, I just wanna again echo the thanks for this body for the work that you've done over many years to make this possible. We receive over 20,000 calls a month just in the state of Georgia to the 988 center. We dispatch over 5,000 mobile crisis teams every single month in the state. So, and we have a disproportionate number of those calls coming from rural Georgia and from our agriculture community. So this is something she used throughout the state. In 2023, only 16% of Georgians had heard of 98. A poll that we did recently, 84% of Georgians have now heard of 98. And a lot of that is because of the work that the First Lady's done helping us spread the word. She's obviously very well known in our state and has really led on a lot of key issues. But we're very thankful that she decided to engage on this and Georgians lives are gonna be saved as a result of these efforts. So, First Lady, thank you. Thank you, Representative Wade. And thank you to the Georgia General Assembly for all your work. Thank you. Thank you. You're welcome. I just want to echo First Lady Marty Kemp, your dedication to the people of Georgia in so many different ways does not go on notice. But especially on 98, 98, 88, working along Commissioner Tanner. And to commitment from this house and to mental health services, the commitment of Governor Kemp. We just can't thank you enough. and have impactful that is to every corner of this state. Every light is say no matter which is zip code, 988, 988 is there and is it ever making a difference. So thank you. House members, thank you all for always supporting these initiatives when it comes to mental health. They couldn't do without us, we couldn't do without them. So thank you all for y'all's commitment as well. Thanks for being here with us this morning. Okay members, as we go through these last couple of days, we just need to remind our friends across the building across the building of a couple of facts. You wanna come up here? Are you going down there? You're closer down there or you could probably bring your members easier down there. So we have a little announcement to remind you of and remind the Senate of. So with that, I'm going to recognize the finest golf team in America, the house golf team right here. So and the gentleman that the champions of golf team and I think he's the coach and the player, your player coach, aren't you? Your player coach, Chairman Powell. Aren't you a player coach? You a player coach on the golf team? Sure. I think the answer's yes. He's a player on about the coach, but he is. Chairman Powell is recognized and our golf team from the house, the gentleman's recognized. Ladies and gentlemen of the house, we are proud to present to you the members, the cup from the governor's cup, that the house is now one for five consecutive years. Oh! Oh! Oh! Just a brief history to this. This was a tournament that was started back in the 90s and it was the Senate versus the House versus the governor's office versus the engineers of Georgia. And we've been playing this continuously around the state in different golf courses. Now, when I say you should be proud of this, your house members and we all take sports very serious, but we have won this trophy more times than not. And this says a lot for one of the greatest sports that's ever been invented and that's the game of golf. This is one of those sports that can be played individually or is team play to be competition or for nothing more than just get out into nature. Because you're not playing against anybody in those people that I've included. The golf is a game that you can cheat on your wife, you can cheat on your taxes, but you don't cheat it golf. Because you're only cheating yourself about playing against par. I think you need to give all the members of the House golf team a round of applause. And for any of you members who play that would like to be put on the waiting list, we'd like to know who you are. And here's to the Senate, the losers again. Some things never change. Kickball, golf. I won't go any further. I didn't say I just said loser again. Thank you members of our golf team. Appreciate y'all's dedication for bringing home the governor's cup again. Absolutely. I know it was a tough job. Y'all really hated going in and playing golf. Thank you members for your attention. We'll move on to the rules calendar. We will on to the rules calendar. Mr. Clerk, will you read a caption to Senate Bill 5? SB 5. Senate Bill 5 by Senator Capatric. And a 30 second. Another is the Meantime Act to amend chapter 46 of title. 33 of the official go to Georgia antenna relating a certification to private review agents. So it's a provide for health insurance,\n\nA Tainary Program that allows for the selective application of reductions. This bill ever furthered the committee on insurance. That committee recommends this bill do pass by Rules Committee Substitute. Representative Lee Hawkins, chairman Hawkins is recognized to present Senate Bill 5. Thank you, Mr. Speaker. You have on your desk Senate Bill 5, Substitute is Rule Substitute. These are two bills that you've heard before and have passed through this house. Last year we did what was termed the gold card bill. This is a bill that each and sure shall utilize a reduced requirement for prior approvals. This is based on the history of the provider. The second bill is the Pans and Panda Bill. Thank you all for me with this. This requires insurance coverage for Pans and Panda, which is a very terrifying disease for our young children. Right now, Chela is actually doing clinical studies on this issue. I wish to give a shout out to them and also shout out to Jesse Weithington, who's a director of the healthcare Alliance of Georgia. That Georgia Healthcare Association, rather, for his work in agreement with the words in these two bills. Mr. Speaker, the no questions, are we yield the well? Gentlemen has no questions. Wait, he did have a question last, I represent a lease of Campbell to your left. Gentlemen, we'll take a question. Representative Campbell, yes. Thank you, Mr. Speaker. Does the gentleman yield? He does. I'm just trying to clarify. You said we had a change on our desk for this bill. No. You had this fellow on your desk, will substitute. Okay, thank you. I misunderstood. Thank you. Okay, thank you. Gentlemen has no further questions. Thank you, sir. Gentlemen, is yielded well? Is there any objections to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to withdrawing the committee's substitute? Here in none, the committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? Here in none, the rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes, those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Attorney for the 那個枕 我ila指示,您求訊息教授也太遊行手. Have all members voted? All members voted if so? Ms. Clerk sorry. Where you lock the machine on the passage of Senate Bill 5, the yeas are 169, the nays are two. This bill having to see the requisite Constitution majority is there for past. Congratulations, Chairman Skoggins. I know this meant a lot to you and thank for your work on this bill. It's a very important bill. Mr. Clerk, we're year in the caption of Senate Bill 173, 173. Senate Bill 173 by Senator McClaurth, 14th and others to be titled. Now to men are three chapter 11, title 9 of the fiscal to Georgia and state of related pleadings and motions, so to authorize move ants to file notices of uncontested motions and spirit courts and state courts. This bill ever further committee on judiciary, that committee recommends to spill due pass by committee substitute. Chairman Stan Gunther has recognized Senate Bill 173, representative Gunther. Thank you Mr. Speaker. Senate Bill 173 addresses judicial inefficiencies by creating a process to deal with uncontested motions. Specifically, if a proper pretrial motion is filed and no objection is filed within 60 days, a notice of uncontested motion can be filed with the judge. If the judge does not rule on that motion within seven days, the motion shall be deemed granted and entered. 173 allows a tolling of that mechanism if a hearing is scheduled by the judge and also allows the chief judge of the circuit to conduct a review if a judge in their circuit does not rule multiple motions within a specific time frame. Finally, Senate Bill 173 requires parties to provide copies and motions to courts as well as to require courts to provide instructions on how parties should provide those copies to the courts. That is the bill. I'll stand for any questions. Gentlemen, have no questions. Thank you. The gentleman is yielded well. Is there any objection to the previous question being ordered? Here he none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here he none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here he none, the report of the committee is agreed to. Now, this bill now pass all of those in favor of the passage of the bill. Will bill yes, all of those opposed? Will no, and Ms. Clerk, will you unlock the machine? Have all members voted? All members voted this, so Ms. Clerk, will you lock the machine? All the passage of Senate Bill 173, the yeas are 168, the nays are zero. This bill, Henry, see the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 1717? One seven. Senate Bill 17 by Senator Anna Navarte, the 31st in others to be entitled to amend Article 11 of Chapter 2, Title 20, and Article 10 of Chapter 3, Title 38 of the fiscal to Georgia and Senate relating to public school property and facilities, and statewide first responder building mapping information system. This bill I refer to the committee on education, that committee recommends this bill do pass by rules committee substitute. Representative Holt, first thing is recognized to present the bill, representative person. Thank you, Mr. Speaker. This is a rule substitute on Senate Bill 17. I'm also known as Ricky's and Alyssa's Law. This is just clarifying language online 57 under the verification for accuracy for the mapping. We just added relevant public safety agencies, school safety personnel and school administrators on the list of people that can sign off on the accuracy annually, so that they've just recently adopted mapping that they can go ahead and sign off on that again. That's the change in the bill and just ask for a favorable consideration and I'll stand for questions. Representative Ramon, up the center out to your left. Thank you, Mr. Speaker. Does it jam a meal? I will. Thank you. Just really quickly, have there been any providers of this kind of technology and how has it worked in other places? We currently have this in our school safety plans. This is just clearing up language to make sure that if they just recently adopted their mapping that they're using now that's required under our school safety plans, I believe we passed in 23 that the school administrators can sign off on that if there's been no change in the building. Does it do them for their yields? Yes. Just to clarify, so is it the same sort of contractor provider for all of the schools or is it multiple and we're just trying to get them to talk to each other better? I believe the schools can hire different agencies depending on who they want to use. It's probably put out for our RFP. Got it. Thank you. The representative, Chairman Parsons to your left has recognized for a question. Thanks, Speaker. It's a gentleman yield. I do. Yes, I wanted to ask you about section four. It says here that the school systems, each school system will implement this mobile panic alert system capable of and it describes what it's capable of. And then, on the last page, if I can find it here, the last page that it has 74 through 80, it says that the local board of education, the local school systems, local governments and agencies and it goes on saying employees of school boards and education, local schools, schools, and so on will be exempt, will be immune for many civil liability for any damages arising out of the creation of this. I'm just curious, I mean, how serious is it that we would have to provide immunity for them for actually even using it using this mapping that has to be that they are mandated to create? I think if there's any unidentified error in the mapping, it's just helping give coverage to if there's something that something is missing the error in the mapping. Okay. If I may ask one more question. Sure. On the section two part four. I had, and later July 21st, 2026, each public school shall implement the system. And it talks about then says, and then just this is alert and shall integrate with technology used in each public, each local public safety answering point included, including but not limited to next generation 911. I know that we passed legislation earlier this year that allows the state creates the ability for the state to use that, but it has not been actually designed. We haven't done anything in code to say exactly what that 911, the next generation 911 system actually is. We've got a study committee, I think that it's pending to be created for the summer, but it says it'll be, we don't even know what that is, how do we put that in code? It's going to integrate with that if we haven't even described what it is yet. I think it's, I think this is looking forward in case that passes or gets done that this will already be covered. All right. Well, thank you. Thank you for answering that. Gentlemen has one more question. What part did you have a question? Gentlemen's recognized for a question. Thank you, Mr. Speaker. Does gentlemen yield? I do. To the author, I appreciate the intent of having a school mapping data. One question that did come to mind is how is this information going to be secured? Just because we're creating critically important information, which if by a hacker, if they access that, could that then expose the school to additional vulnerability, speaking again to the immunity aspect of it? Can you provide any additional context with respect to how this information would be protected after it's compiled? Well, it's already protected. This is already, this is, we passed this in the school safety bill. This is just a amendment and cleanup, but all that information protected at the local agencies. I get everything is vulnerable. Additional encryption requirements, things of that nature. That's not written into the bill. I'm sorry. I don't think it's written into the bill, but that's. This is currently happening from our school safety bill. The school safety plans would pass in 23. So whatever is in 23 would be what a pause. Just a note there, then, you know, perhaps again to ensure that this information is protected. Whether it's by rule regulation or additional legislation, that again, we are taking action to ensure that this information cannot be easily accessible. Well, I know, I know it's not subject to open records request. Of course, thank you. But George Lee left, Strasius, recognize for a question. Thank you Mr. Speaker. Is it Jim and Neil? I do. Sir, is it not true that school records, particularly student records and school security records are subject to protections already? What are the benefits of that information that the school has in the school that's been in the past, which are implemented at the local level to ensure that data, that sensitive records that security information, is secured to the extent that's possible under IT standards from hack or from falling into the wrong hands? That's that. And isn't it true that SB 17 is an effort to make sure that law enforcement and emergency personnel have the information that they need to effectively do their jobs? Bill, you know, is what he speaks. I've never heard of their questions. Thank you. Gentlemen, is he old enough to see, take another question. Are you the well? Gentlemen, is he old to the well? We do have a speaker on the bill. Representative Betsy Haaland is recognized to speak to the bill. Representative Haaland, give the lady your attention please. Thank you Mr. Speaker. Colleagues, I rise today in support of SB 17. As most of you know, I have a middle schooler at home. And many of you got to meet him on Cross Over Day when he was living his best life as a page all the way till 11 o'clock when we got to go home. having a middle schooler gives me a different perspective on school safety measures. Fire drills and tornado drills were the norm for most of us growing up. Active shooter drills and lockdowns have been the norm for him since kindergarten. I can't explain what the emotion is when you're on a group text with other school parents. And someone text and says the school is on lockdown. Does anyone know why? And it doesn't feel like you breathe until somebody responds back and says it was a false alarm or I've heard the all clear. When the shooting happened at Appalachia High School last fall. When the shooting happened last fall, I waited a day or two before I asked my child if he had heard the news and asked him how it felt. I asked him if it made it feel scary or if it made him feel anxious. And he said no mom, that school only had one resource officer. Our school has two when an active shooter comes we're going to be better prepared. That was the day I realized that my child uses the word when, not if, when he thinks about an active shooter coming to his school. I sometimes have heartburn about the details in these school safety bills but I've put that aside and hoping I can just tell my child that we will make sure his school is prepared as possible if a bad actor comes on campus. I wish with all my heart I could go home tonight and say what we did today was past meaningful gun safety reform to try to prevent school shootings in the first place. But we'll get there. We're just not there today. Instead I'll go home and say once again we did everything we could to try to make sure his school was safe if a bad actor should ever come on campus. I will be supporting this bill and I ask you and join me in doing the same. Thank you. Thank you. The lady is you and the well. Is there any objection to the previous question in order. Here in none your previous questions is ordered is there any objection to withdrawing the committee substitute here in none the committee substitute is withdrawn? Is there any objection to adopting the substitute offered by the committee own rules here in none the rules committee substitute is adopted. is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? All in the passage of Senate Bill 17, the yeas are 171 to nays or zero. This bill, I have received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read a caption to Senate Bill 131, 131? Senate Bill 131 by Senator Hodges III, another to be titled an act to amend chapter 10 to title 49. In the fish go to Georgia and attend it, relate the Georgia Board of Healthcare Workforce. So, as a reply for the establishment of the Georgia Healthcare Professional Status System. This bill, I would like to read the committee unregulated in the streets. That committee recommends this bill do pass by rules committee substitute. Chair, lady Keef's, Katie, excuse me, Katie, I know you. Katie Dips is recognized to present the bill. Ladies recognized. Thank you, Mr. Speaker. You have on your desk rules substitute to Senate Bill 131, the language from the previous bill has been replaced. This is the exact language, exact measure that we voted on on March 3rd and passed this House by a vote of 170 to 2. It was House Bill 612, which deals with parity, a very important issue to this House always. It does two things, basically. It will add the commissioner, the insurance commissioner, as a member of the Behavioral Health Coordinating Council. And it will also establish a parity compliance review panel of 10 who will be able to help us move the ball forward on parity. There is great concern that reports are not reaching the place where we need them to be. So, it will serve as data collection and have the opportunity for this panel to develop the reporting system that will actually help them evaluate the reported concerns. Mr. Speaker, that is what it does. If there are any questions, I'll be glad to take them. If not, I will yield the well. The lady has a question, will part to your left right in front. The gentleman is recognized. Thank you, Mr. Speaker. Chair Lady Dems, I look forward to voting yes for this bill. A quick question that on lines 95 and 96 as I've been doing an additional review. It says this new panel will have no authority to impose financial penalties. I recognize the effort to create an incentive to report as opposed to a penalty. However, in the event that we continue to see a lack of reporting even with these sorts of incentives and efforts to encourage, is there some sort of enforcement mechanism or a state agency that could proceed with enforcement if, again, parity is not being met? The panel will be under the auspices of the behavioral health system. As I understand it, they will be reviewing and trying to move that forward. I do not believe that they will establish the procedures and policies when they get started. So, that is how I understand the measure. Yes, ma'am. Thank you. Thank you. Thank you, ma'am. I would like to ask a lady for another question. Yes, ma'am. Representative Oliver to your left. Does recognize for a question? Does the lady you? Yes, I certainly do. The purpose of this bill is to highlight and bring forward real data. We're not getting that data in a consistent way from the insurance commissioner as we mandated in 10-13. So, this is a good step forward, isn't it, true? To bring the data forward, we can really understand who is going to compliance and who is not in compliance with true parity as required by law. The lady is correct and knows exactly of what she speaks. Thank you. Lady has no further questions. Thank you, Mr. Speaker. I yield the well and ask for your favorable support once again to move this ball forward. The lady has yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to withdrawing the committee's substitute? Here in none, the committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on the rules? Here in none, the rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote yes, those opposed. Will vote no, and Mr. Clerk, will you unlock the machine? No. No. No. No. Have all members voted. All members voted if so, Mr. Clerk, will you unlock the machine? All the passage of Senate Bill 131, the yeas are 166. The nays are three. This bill, I understand, is a constitutional majority, is therefore passed. Members out, hope you'll help me welcome a former member of this house, Ripsley-Franmalar. He did go to the dark side. He did go to the dark side, but he's still a pretty good guy, so let's make, let's make Fran welcome back to the chamber he got. He will initiate in the end right here. Hope reigns eternal. He came back to his roots, never doubt about that, let's see. Members, we'll take up a couple of, um, agrees and disagrees. This one would be in a agree. Representing McCollum is recognized for a motion. Representing McCollum. Thank you, Mr. Speaker. I approve that the House agree to the Senate substitute to 8B575. Mr. Clerk, will you read a caption, please? House will 575 by Representative McCollum of the 30th to be entitled, next to amend Title 32, the fiscal to Georgia antenna related highways, bridges and ferries, those to authorize. Notice of certain public hearings both as a Department of Transportation by Electronic Publication. Her representative McCollum is recognized to explain his motion and the Senate substitute. 8B575 is the exact bill that we passed out of the House except for they changed in committee lines 109 to 1111. The Senate decided to change the language which impede the flow of traffic is determined and requested by the Department of Public Safety law enforcement and designated fire department personnel, the Department agreed. I'll stand for any questions. The gentleman has no questions. Mr. Speaker, I just wanted to say I didn't have to get any help from the gallery this time or freeze up. As I told you last time, we're both the working progress. Yes, sir. And I yield the well. Gentlemen, yield to the well. Good job. On the gentleman's motion, the House agreed to the Senate substitute to House Bill 575. All of those in favor will vote yes. All of those opposed will vote no. And Mr. Clerk, will you unlock the machines? Yes. Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the gentleman's motion, the yeas are 167. The nay is one and the House has agreed to the Senate substitute to House Bill 575. Representative Lomston is recognized for a motion. Chairman Lomston. Mr. Speaker, I move that we agree to the Senate substitute of House Bill 94. Mr. Clerk, will you read the caption? House Bill 94, by the way, Representative Lomston to the 12th being titled an act to amend chapter 24, title 33. The fish go to Georgia, Antietta, relating insurance generally so as to require coverage for certain expenses for standard fertility preservation services. Representative Lomston is recognized to explain the Senate substitute to House Bill 94. Chairman Lomston. Mr. Speaker, members, House Bill 94 is a bill that we passed out prior to crossover. It's the fertility preservation bill. The only change that was made in the Senate was they removed all state plans from the coverage, which we thought we had that cover when we sent it over to them. There was something that was found there. So the Senate substitute simply removed the coverage in the state plans. Gentlemen, yield. I yield. Will Park is recognized for a question. Thank you, Mr. Chairman. Chairman Lomston. Can you thank you for explaining the change? Can you help me understand why state plans were removed for purposes of this health benefit? Generally, when we are dealing with insurance related coverage, particularly as it pertains to the state of Georgia, the cost to the state of Georgia, that had not been worked out. So the private plans are okay with this. So all this is doing is applying to the private plans. We'll work on that part of it as we go into the next session. Thank you, sir. Representative Silcox. Chair Lady Silcox, right up the center aisle. On your right is recognized for a question. Does the gentleman yield? I do. Isn't it true that this will allow him and who have suffered terribly from all kinds of cancer to still have children? Yes, that's the entire purpose. Thank you so much. I appreciate you bringing the bill. Mr. Speaker, how you'll well? One more question. Would you yield for representative Allen? Dr. Allen's. Representative Allen's. Representative Allen's for a question. You're left in the back. Yes. Thank you. Does the gentleman yield? I did. This is a clarification to the Whips question. So you said that the bill is amended by the Senate no longer manages state health benefit plans. It only applies to private health insurance plans. Correct. In my understanding of how a RISIL law works, do we have the power to regulate private? Yes.\n\nIt's not a risk of plans. Non-risk of plans. OK. Thank you. How you overweat? Gentlemen, gentlemen, the well. On the gentleman's motion that the House agreed to the Senate's substitute to House Bill 94, all those in favor will vote. Yes, those opposed will vote. No, Mr. Clerk, will you unlock the machine? No. Have all members voted? All members voted, if so, Mr. Clerk, will you lock the machines? All the gentleman's motion, the yeas are 162, then days are three, and the House has agreed to the Senate's substitute to House Bill 94. The representative of the Lumston has recognized for a motion. Mr. Speaker, I move that the House agreed to the Senate's substitute of House Bill 182 is amended by the House. Mr. Clerk, will you read the caption? House Bill 182, my grep, said, of Lumston to the 12th to be titled an act to amend chapter 25 of Title 33 of the official go to Georgia annotated relating life insurance to prohibit a policy of group life insurance from excluding or restricting liability for certain deaths occurring while an individual's on active duty. Who represents the Lumston has recognized to explain the Senate's substitute and the House amendment? The gentleman's recognized. Mr. Speaker, House Bill 182 is the same as House Bill 410, which is a Department of Insurance. Clean up bill, this is a bill that we passed out unanimously a few weeks ago, 164 to 0. We removed the original portion of 182 and the amendment is the same as House Bill 410. And the only change that in the amendment was surrounding the language around the confidentiality draft report, simply in search language that was approved by the National Association of Insurance Commissioners model law. So those were the changes, sir. Gentlemen, you're favourable consideration. Gentlemen, you have a question? Yes. Representative Jasmine Clark to your left has recognized for a question. Thank you, Mr. Speaker, to the gentleman yield. Yes. So is it my understanding that the original House Bill 182, which we did vote out that dealt with life insurance, is no longer, none of that language is in this new version of House Bill 182? That is not in this bill, but there was an identical bill to 182 that was introduced in the Senate. House Senate bill 209, which we passed out of this chamber several weeks ago. So it's already on the Governor's desk, ready for signature. Thank you. Gentlemen, I have a further questions. Thank you, sir. The other way. Gentlemen's yield is the way I thank you for the explanation. Is any objection to adoption of the House amendment? Here he known the House amendment is adopted. On the gentleman's motion that the House agreed to the Senate substitute, the House Bill 182 as amended by the House, all those in favourable vote. Yes, all those opposed will vote no, Mr. Clerk. Were you in lock the machines? Have all members voted? For what purpose is represented? Bernal rise? Cheatways. All members voted if so. Mr. Clerk, were you locked the machines? On the gentleman's motion, the yeas are 166, the nays are two, and the House has agreed to the Senate substitute to House Bill 182 as amended by the House. Members, if you have pages, join me now in front with your pages. We're going to take a little lunch break here. I'm getting hungry. We have a couple of announcements before we recess for lunch. Members, if you have pages, join us down front. Chairman Corbett. Excuse me, the end of day. Chairman Parish, is this now or the end of the day? Well, that's now then. I'm ready. Chairman of rules is recognized for an announcement. Thank you, Mr. Speaker. I'd like to ask for the members of the Rules Committee to meet me in room 341 at 1.30. 130 room 341. Thank you. Members, this House will stand in recess until 2pm. 2pm. House will stand in recess until 2pm. Thank you, members.",
  "updated_at": "2026-02-13T03:48:24.426098+00:00"
}