{
  "video_id": "IMWGD1tpHOY",
  "url": "https://www.youtube.com/watch?v=IMWGD1tpHOY",
  "title": "8-10-23 Senate Study Committee on Occupational Licensing",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 105,
  "summary": "Here is a structured markdown summary of the Georgia 8-10-23 Senate Study Committee on Occupational Licensing session:\n\n## Overview\nThis session focused on workforce needs and challenges in Georgia, as well as the state's occupational licensing framework. Key discussions centered around the need to modernize and streamline licensing processes to address workforce shortages across various industries.\n\n## Key Actions\n**SB 157**: No specific action on this bill was mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Wanda Jaffee, Deputy Director of the Professional Licensing Board, provided an overview of the board's operations and efforts to quickly license Georgians.\n- Daniello Perry, Vice President of the Georgia Chamber Foundation, presented data on Georgia's economic growth, job market, and workforce challenges.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe session had a quorum, with Senators Bryan Strickland, Mike Dugan, and Anivatarty (virtually) in attendance. Senator Halpern had a prior commitment.\n\n## Adjournment\nThe transcript did not provide information on when the session was adjourned or the date of the next session.",
  "transcript": "you you you are lovely I call on the Miss Wanda Jaffee. She's the Deputy Director of the Professional Licensing Board. And she has been gracious enough to allow us to meet here in her facility. So I'm going to invite her to come forward and give us a few words of welcome and maybe some logistics. Miss Wanda, if you don't mind, because we're live streaming, all the presenters will need to present from here. And we've got Senate press here. It's going to help us with that. Make sure we're on board. Am I on? Yes, sir. OK. Is that my phone? Yes, sir. OK. All right. The floor is yours. Good morning. Morning. I'm Wanda Jaffee. As you stated, I'm the Deputy Director here at the Professional Licensing Board. As many of you know, we have 43 boards, 197 license types. And we are in the process of trying to get Georgians licensed as quickly as possible. We're the only division that's located down in Macon. So welcome to Macon, everybody. And I just want to tell you all, thank you for coming down here. And I'm gracious to open up our building to you guys. We are transparent. We are doing the best that we can to get Georgians licensed as quickly as possible. We are fully involved with trying to remove blockers and get Georgians to work. So whatever we can do to be of help, just let us know. Thank you, Wanda. How many employees are here? So I have a total of 110 employees here in Macon. That does include some of our investigators and inspectors that are here in Macon. And you all are back open and not. The pandemic's been over quite a while. You're open for business. People are working here. And their offices is that correct? Well, yes and no. So we never close during the pandemic, during the COVID pandemic. I was here every day, five days a week. But we did send our staff home to do some remote working. So we are now doing kind of a partial remote, partial in person. So every board that works here operates has somebody here every day. So if a customer comes in and walks in off the street, if they have an occupational therapy license, there is someone here to help them. So what we did was kind of rotated our staff out. Some of them can work from home, as long as somebody is here every day that can assist a client. I'm here Monday through Friday, every day to make sure that if something comes up, that they've got somebody that they can talk to. OK. Thank you. Any questions for one? Thank you, ma'am. OK. Thank you. Thank you. I also want to recognize Maggie Hasty with the Secretary of State's office. She's been instrumental in helping us put this together. Thank you, Maggie, very much for that. Again, Senate brass. Thank you for the work. As far as the committee members, we have Senator Bryan Strickland here, Senator Mike Dugan here. Senator Anivatarty is with us virtually watching the meeting as it's live-streamed. And if he has questions, he's going to text them to Kay and I. And then Senator Halpern had a prior commitment on the West Coast. But we do have a quorum. And with that, I will call the meeting to order. Also, I do want to recognize my legislative assistant, Colleen Gallagher. Thank you, Kay, for all your help with this. Just I'm going to make a couple remarks to start off with. This topic, as I have dug into it, has been kicked around for literally decades. I suspect that my father worked on this issue. It's a tough nut to crack. There are, as I want to say, under this office, 43 lights are symbolized. And they're not any of them. One the same as the other, really, and they all have different nuances to them. And everybody kind of has the turf issues in their agenda and their vested interests. So it's difficult politically to so challenge. But we are in 2023. And as you'll hear from Daniello in a minute, we have serious workforce needs in Georgia, thankfully, under Governor Camp and prior good leadership. We've got a growing economy. And we've got to get into the modern world with this licensing, professional licensing issue if we're going to continue to grow our economy. I do want to recognize my very good friend, Representative Patty Bentley, for joining us. And we're always glad to see you, Patty. And Patty has recently gotten engaged. And I'm real proud for her. But I hope she doesn't decide to run for the Senate. I'd be in trouble. So our first speaker, just to give us some information on what we're at in Georgia with workforce, is Daniello Perry. So Daniello, the floor is yours. And if you'd like to sit and adjust that mic down, or if you want to move that chair and stand and just talking to Mike, you can work your PowerPoint. Thank you. Just to talk. Can y'all hear me OK? Well, Chairman Walker, again, thank you for the invitation to be here today and to share a little bit of information that we're looking at from a Georgia Chamber perspective. My name is Daniello Perry. I serve as the Vice President of the Georgia Chamber Foundation. And the foundation is really the research and data arm of the Georgia Chamber. So a lot of our work focuses on these big trends and what we're looking at moving forward. So as Chairman Walker mentioned, we've experienced tremendous economic growth. The last four years, again, has been record economic growth year over year. And of course, Governor Kim announced another year of record economic growth for FY23. So while many states are trying to still recover from the pandemic and find their footing, we have continued to see prosperity year over year. I think a key point to mention is the fact that 77% of this economic activity has occurred outside of Metro Atlanta, which is the state chamber is really important to us because we want to make sure that in every corner of the peach state, whatever your zip code is that you are experiencing opportunity and able to find good employment and grow your economy. So while we've experienced this tremendous economic growth, it hasn't come without its challenges, although these are really, really good problems to have. So we've been tracking unique job postings since 2020 with COVID. You'll see on the graph here, it looks at 2021. And you'll can see there's been some variation over the years. You'll see that dip in Q3 of 2021, which was the Delta variant of COVID. And you'll see it rebounded very quickly to over 450,000 job postings. And now we are kind of in a little bit of a plateau around 350,000. The top occupations we've seen this quarter, our registered nurses, software developers, and retail salesperson. The other one that often ends up in this category is tractor trailer truck drivers, which obviously with our faint logistics infrastructure, it's a huge demand. Of course, too, I want to note that all of these are very different skill levels, required different education. But again, we're just seeing tremendous need across the state. Another key point to mention is the number of unemployed Georgians is about half of what these job postings are. So as we're thinking about how do we combat with our workforce shortages, simply getting people off of unemployment and into jobs is not going to fix our problem. We really need to think strategically about how we can bring folks in and then also think about folks that are not engaged in the workforce, make sure that we're able to get them back into the workforce whenever barrier they may face, which is where I like to point you to our labor force participation rate, which is around 61.3%. So we have nearly 40% of Georgians that are not engaged in the workforce presently of working age. So again, as we're thinking about how do we get these folks in? We want to make sure we're looking at any barriers that prevent them to getting to employment or maybe individuals that are also under-employed or looking at that. So I mentioned labor force participation rate because we like it a little bit better than unemployment because it looks at that full working age population. This goes back to 2000. And you'll kind of see that there have been some spikes and jumps. And you can see where the great recession's been, as well as COVID. But overall, we've seen a decline in individuals that are participating in the workforce. I've got numbers for the last couple of years. We actually had our peak in November of 1998, around 69, a little over 69%. So again, as we're thinking about the fact we've seen this decline overall, we want to make sure that we're thinking about what are those barriers, understanding that the nature of work has changed. The skills that are needed in the workforce are changing too, especially as we're seeing technology become a bigger part of everyone's job. So I pulled some occupations from our labor market software. These are all required licenses in the state. Included the job posting over the last year. I also included retiring soon. So as we're thinking about not only our current workforce shortages, but what's the need over the near term? Want to be cognizant of that shortage that's coming? And then also the number of employers competing. So when we say work for talent, you'll know that we're not overexaggerating. This is a tremendous need. Of course, I'd love to point you to registered nurses. We've got almost 3,000 employers that are trying to hire registered nurses in the state. And there have been more than 82,000 postings. Again, you'll also see that there are other health occupations for nursing homes, certified nursing assistants, home health aids, and tractor trailer truck divers, the top ones. But of course, child care workers, pharmacist accountants. And again, this ranges over different skill levels, different education levels, but tremendous growth in all of them. So we like to look at the long term. I know where we're going. By in the next 10 years, we're going to need where the number of jobs will increase by a little more than 2 million. And our population's going to increase by 1.2 million individuals. So again, as we're thinking about the fact that we're experiencing this tremendous growth, and this is kind of just that projection we certainly could get larger announcements that'll bring more need. Also, thinking about the fact that in the back room here, we've got all those retirements of people that are moving towards that. People are working longer. So there's a little bit of variability. But over the long term, we're really going to need to think strategically and systematically about how we do things differently, how we are able to innovate or that's reducing regulations, but making sure that we're able to meet our workforce needs long term. So we have at the Georgia Chamber have looked at a number of opportunities to improve occupational licensing to get more folks into these occupations, because generally, occupations that are licensed have higher salaries, so better opportunities for folks. There's around 40% of Georgians that have a criminal history. And we've seen that salaries actually are 10 to 20% lower for individuals that have been incarcerated. And to the unemployment rate is significantly higher for those that are formerly incarcerated as well. I know there is some legislation from the Chairman's Drickland last session that addressed this. And the Georgia Chamber was supportive of it, because it really looks at how do we get folks that have skills and talents, but are facing some logistical barriers within our occupational licensing system. Georgia also has a huge military population. We actually have the ninth biggest veteran population and then the fifth biggest active duty population in the state. But portability of licensing for military spouses has become more and more important for the Department of Defense and order for them to designate Georgia as a military-friendly state. You need to have that 30-day near-term licensing. Of course, as we're looking statewide in seeing the big need, all of our military installations are huge economic drivers across the state. And so we know what they mean to the communities, but as well what they mean to the state as a whole. We want to certainly protect our military installations because we know the tremendous growth that they add, especially with Robin's Air Force Base being just down the road here. The healthcare industry, as I've kind of shared some data, you'll see again, there's tremendous need in growth. But the Georgia Healthcare Workforce Commission, but a few statistics, again, that look about what this looks like long-term. And estimate around 20% of nurses, behavioral health and specialty care workers are over 55 years old, and so might be looking to retire over the next 10 years. Also found that around 3.7% of the healthcare work forces leaving annually and is not being replaced by new graduates. And then of course, as we're thinking about all those opportunities with legal immigrants that have come here, opportunities to make sure that we're using their skill sets. Well, of course there's also an opportunity at the federal level with visa reform, but not within this scope of that. So we'll leave that to Washington. And that's all I have for you all this morning. So certainly happy to answer questions. But again, I appreciate the opportunity to be here and appreciate y'all's service on this committee to address this issue. Thank you, Daniela. It's good information. So you hear the challenge we face with these, the growth we're having and the physics she gave us. And license sure, it certainly is a barrier to entry into the workforce for a lot of people. And I know I didn't ask you this to prepare this, but maybe somebody in the room knows that what percentage of the job postings that we have require a occupational license? I can look that up for you. I think I understand that in a recent meeting, but it's a pretty high percentage. It's pretty surprising how high that is. So certainly that's a challenge. I've got, and I'm sure my colleagues will have some questions too, but on the workforce participation percentage, is this kind of a national trend? I mean, are we in anomaly or is this? No, Georgia, we've certainly kind of seen this nationally. Other states are going through similar things. Certainly, you know, Georgia, you know, I think is in the middle in terms of where we stack with our labor force participation rate, but we certainly have other states that we're competing with that are doing better in this arena. Obviously, it's something that's an opportunity. And when we look to different communities around the state, we see lower numbers in the state average. I think Bibb County was around 55%. So again, as we're thinking about the state, why need we've got different pockets depending on community need, where you are even seeing lower numbers than that 61.3%. It's part of that just lifestyle choices and maybe want to have one parent dedicated to parenting the children and staying home, raising the family. Absolutely. I mean, both parents working in the children and die care. Yes. So certainly, this is going to encompass individuals that are choosing to stay home because it is better for their family to have one parent working or one parent at home. It also could include individuals that may have disabilities, that have trouble accessing the workforce. So there's a wide range of why you have this 40% that is opted to not participate in the workforce. And certainly, again, the high point of this in recent history was around 68 or a little over 69%. And so a seven point drop is still very significant. And if we had those folks in the workforce, we would certainly be meeting a lot more of our current workforce shortages. But I think it's fair to say that you would always have a portion of the workforce that would not opt in for various reasons. So we have 350,000 unique job postings, currently a little over 350,000. And your projection is that the number of jobs is over the next decade is going to increase by over two, two and a half million looks like to me from 5,285,000 to 7,845. Yes, sir. And yet our population is only going to increase 1.2 million. So that makes the delta, so we're going to go, that's one point. So we're going to be like 1.6 or 7 million in open positions if these projections hold true. Absolutely. And so I think that's- And if 100% of the population growth went to work, which are not, so it's actually going to be a big, big deficit in workers. So it seems clear to me that we're going to have to recruit workers from other states to grow, to fulfill the need in our economy. And as we do that, I think the licensure issue becomes even more of a problem for that. The other thing that I think is happening and COVID accelerated this is we've got Georgians that are, you know, live here, but they're working for companies virtually. They're going to have to stay because they're licensing requirements or maybe they don't even have to have a license to do that job or maybe it's easier to get a license. And I think we are seeing that in all the fields, but I think in psychology and psychologists and some of the medical fields, they're, you know, able to make more money, maybe doing it that way, and have less barriers to entry. So we're at a competitive disadvantage. We're not going to be able to recruit these people from other states if we have a burdensome licensure system, which we do have, which we'll hear about that later. And we're competing, you know, with the ability to really work anywhere in the world in certain jobs virtually. So I think we are, it's imperative and incumbent upon us to try to fix this problem. Senate Bill 157 sponsored by Senator Strickland is a high high priority for the Senate. It passed unanimously in the Senate. And we are, I guess it'll come back being committee in the Senate or does it in the House? But that's going to be a high priority for us that deals with some criminal history. And Senator Duggan and I are on the George Wurts Commission. And we got a lot of good information about that at our meeting, TeesD. And people that are, apparently people that are arrested and not convicted, it still creates a problem for them with employment. And so I applaud Senator Strickland for his work on that. And, you know, the lieutenant governor is, this is a high priority for him. I'll just, for the public that's watching, that we get this pass. And then for me and a lot of us in the legislature, I represent Robyn's Air Force base and the Spouse of Licensure, which we're gonna hear about more today too, is something that I'm real passionate about. And we have, you know, had legislation that got out of Senator Duggan's committee that was really, he helped me improve it and perfect it. It was really good legislation. And again, got hung up in the house with some, just, you know, things going on there. So we're gonna continue to work on that. All right, I've taught enough, Senator Strickland. Thank you. Danielle, as Senator Walker was saying, thank you all for your support. Senator Bill 157, I think that bill is gonna go along ways in really making more of a uniform process as to how criminal records are handled, by all these different boards. You mentioned 40% of our state have an criminal record. And what we learned in working on that issue, you wanna applaud Representative Bentley, who's here as well. We spent the last year in a separate study group that was kind of unofficial looking at that issue. And we saw and heard from people that were not trying to work because they thought they couldn't. They didn't know how their record would affect them, even getting in industries. And then we're from an attorney that was handling appeals for people that were denied licensing, who does this for a living and has trouble navigating that. We realized how difficult it is for individuals to ever navigate that process. So it now sits in the house and we have broad support in the house, I believe as well. It just got caught up in the back and forth last year. So that'll be, I believe we back in the judiciary committee, I think, in the house this year, coming up next year. Question for you in the labor force participation rate. Some of the same things that Chairman Walker was asking, you mentioned how this compares nationally. Do you know if the aging population, does this include people of working age or does this everyone, is this the aging population that we have impacted by this or they're not counting that rate? Sure, so it's usually defined by US BLS by 25 to 64. So there is the potential to that as individuals are maybe older and choosing to still participate in the workforce that some of those are captured as well. And we're certainly encouraging businesses across the state to think creatively how to use individuals that have lots of expertise to offer and still want to contribute a lot to make sure they're utilizing things well. But it also goes to show it's not just because people are getting older than us, they're not counting in that. The other question to how you might not know the answer to this, not what Shripping by does, was there has there been any study that goes the next step and asks people why they're not working? There's many reasons people may choose not to work, but it'd be great to know just even from a survey standpoint, what the reason is, I look at the childcare shortage. I mean, I know people, maybe it's just people I know that are young parents that aren't able to work because they can't find childcare. I know someone right now that's considering taking a leave of absence or a professional job because she can't find a buyer to take care of her child. She lost her childcare purse. She's on a wait list at places. And so that's just one little factor that could be in there that we saw related to the overall issue of workforce. I'd be curious if we have any studies that would show why people are choosing more and more around the country, more so not to work. Absolutely. We can pull some information, but I have not seen a great survey. I think it is one of those things that people do consistently ask where are these individuals. I think we'd love to show them some of our TCSD programs and things that are our options. But absolutely, childcare is a huge issue and we do have a shortage of childcare workers speaking from personal experience with a dollar in childcare. We were on a wait list for a long time, to get her into the right place where she's safe. So absolutely, it's a huge challenge. And certainly one of the reasons too, while we saw tremendous levels of women leaving the workforce during the pandemic. And so still trying to make sure we've got folks into the workforce that want to contribute. But all those other factors need to be right for them able to make that choice. Thank you, Mr. Chairman. Senator Strickland, I'm sorry. I'll tell you, instead I wouldn't have asked anything. It's one of those. Yeah. Danielle, always good to see you. I'm going to tag on that one, two to 177,000. We need more context with that. How many of the 177,000 are actually looking for jobs that require a certification, which would be pertinent to this particular committee? And it's not only childcare availability. Some of these are childcare cost. So if you've got one, that's availability. You've got three. You start looking at, is it more economically feasible for one of these to stay at home with the children? A lot of the other one works because of the cost portion of it. Second one is a question. If you could look back at 1998, what will we do differently than that we're doing now? Probably a couple of different things. But certainly, there's been a lot of conversation again why we've seen this decline because it is something that we've seen nationally. And there's a number of different reasons, but there's not one silver bullet. People are choosing to want more flexibility. And so they're thinking about these options differently. There are a lot of cost that have risen over the years, and maybe always haven't tracked with salary growth. And so we've seen a lot of different trends kind of impact this number. But I would say there's not one clear factor. I would say Georgia has experienced this in a little different way because we were able to bring a lot of folks into the state to meet our workforce needs for a lot of years having the fact that we've got lots of people from other southern states that we're moving in and filling our workforce shortages. But we've kind of seen that slow in recent years. And then with the tremendous growth, it's created more of a challenge. There was actually some recent research that showed that Georgia has 159% more unfill positions than unemployed individuals in the state. And the national average is 67%. So again, as we're thinking about what's unique about Georgia, it's that our needs are a lot more acute than other places. Of course, other people are very envious of what we've seen from an economic growth perspective. They want the economy that we have. But that certainly requires.\n\nmade of in strategic thinking about how to use the people that we have here and then how to strategically recruit folks into the state that meet those workforce needs that we're seeing from an industry perspective just grow and expand. When you go back and look at 1998 and understand the types of jobs have changed significantly since that. Matter of fact they didn't have smartphones back then. But when you go back and look at that. Yes sir. Because the percentage population that was involved in agriculture at 98 that was considered employed versus now. Yes. And the only last question I have is on the Georgia's War for Talent. Obviously the situation with yellow is not good. How is that going to impact the availability of CDL drivers on your slide there? What do you forecast it? The need for CDL drivers is tremendous. I would say we consistently hear from folks that this is one of the biggest limitations which is why we're really seeing industry think about how do we is this an is this something we try to automate faster because we are just seeing tremendous shortages. And I would say too that's why we've seen more and more challenges with getting products to people faster. Of course a lot of this was accelerated with COVID as we're seeing so much more e-commerce growth. It was something that happened very very quickly. But too as we think about a competitiveness perspective. If we don't have the truck driver here to move goods in and out of the state it's going to impact the activity at the ports and everything that we've really been able to grow strategically. So I would say we really look at that and for the truck drivers retiring soon is almost the same number of the new postings. So we are specifically we throw a lot of companies engaged in this effort that it is a significant challenge for them to recruit folks. That's fine. You kept talking so again about another question. No, no, no, that's why you're here. So how much flexibility do we have within defining what is required for a CDL within the state? So the one thing I hear a lot of where we experience this big issue on the tractor trailer truck drivers is that in order to cross state lines you have to be 21 years old which obviously is where a lot of the need is. That's at the federal level unfortunately. And so there obviously is flexibility within the licensing here but consistently that's something that we hear. So I know there's lots of movement within Congress to try to continue to push this especially as we were thinking about getting folks on a talent pipeline. If we want to make sure that we're catching kids in middle school and high school and really showing them the opportunity if you within have to wait three years and do something else and then come back to CDL it's a big hurdle from that recruitment perspective. That's what I was asking. Yeah. Do we have the flexibility to set up a different category of CDL that is a short haul CDL where you could be lower than 21? That's a great question. We can I'll do some research to see if that would be something that would be an option but I know that crossing state lines is usually something that is very important obviously to get folks from industry perspective. Thank you. So I think that you can get a CDL prior to 21 it's just you can't cross state lines and the other issue is your income, he's insurance, income, care is going to have guidelines for their drivers too. That becomes an issue you know a lot of the drivers have three years experience and so on and so forth. Mr. Sterling I don't think he's here. So Sarah do you mind to go out of order and go ahead and present your portion? Thank you very much Daniela. Awesome. Sarah Crentan is with our Office of Legislative Council and she's got some good information. She's going to share with us today on some recent court cases and just the legal landscape of licensing and where it is in our code section etc so and she put all this together for me on short notice. I appreciate that. Anything for you, Senator. So I'm Sarah Crentan-Din. I'm a turn attorney with the Office of Legislative Council and we draft your bills. And I've been doing it for two years before that I was with the Department of Insurance so I have some experience with dealing with licensure and criminal investigations and how to handle background checks and that sort of thing so I was really excited to help out with this committee. I'm going to talk to you. So I gotta come down here. So we're going to I'm going to talk to you today about sort of opening up licensure and what's going on federally and in the service members civil relief act which is a federal law and then Senator Walker asked me specifically to talk about a recent Texas district court case and I'd like to take a moment to talk about interstate licensure compacts which comes up a lot where all this goes in Georgia law and then finally Senator Walker asked that we talk about a recent Georgia Supreme Court case so that's a lot to cover. I set the timer. It's going and so we'll see what can do. So the service members civil relief act or the SCRA is found in federal law under 50 USC section 3901 to 4043. This act is designed to help service members when they have to transition to active duty and it provides some civil protections which you'll see up there protection felt foreclosure repossession leasing agreements evictions interest rates and default judgments. The concept of protecting our service members goes away back. I did a little you know one days research but it goes back there there was there were laws in the civil war and World War 1 and in World War 2 to protect service been when they get called to duty and in fact it used to be called the soldiers and sailors civil relief act SCRA in 2003 it was overhauled and became the service members civil relief act and for our purposes there was an addition in 2023 this year on the portability of professional licenses. So this was signed in January of this year and went into effect in January of this year to allow service members and their spouses to use their professional licenses and certificates when they really relocate due to military orders. So this is a hybrid I tried to cut and paste the actual law because you never want to blur it because it is we have to look at the exact words to understand what's going on here who it applies to and what it covers. So it applies to service members or their spouse as who has a covered license and that's a defined term in the law and it's when they relocate because of a military order for military service outside the jurisdiction where the license was issued and the the the huge benefit of this is the covered license shall be considered valid which is a phenomenal statement in the law for them just to blanket say that. The interesting thing legislatively for me was you know it's not forever it's for the duration of the military order and then under certain conditions or circumstances. So what the service member or spouse must do is say and this is in the law this is cut and paste in the law they have to provide a copy of the order to the licensing authority. They have to remain in good standing with the original licensing authority and in good standing of every other licensing authority that they've been issued and they have to and this is very important as a receiving state is they have to submit to the authority of the licensing authority in the new jurisdiction so that's a great save that gives the receiving state some leverage. Interestingly the federal law specifically yields to states that are participating in interstate licensure compacts. So some of you may not be familiar with what an interstate licensure compact is and I'll talk about this later but this is from the service members civil relief act and it provides an exception so the federal law is yielding to the state's agreements which is which is also exciting yeah yeah law but it's very it's exciting to see the federal law is saying okay if you states have worked it out in a licensure compact then y'all you get to control. This is also from the service service members civil relief act is what is a covered license this is a definition it's a professional license that is good in good standing with the licensing authority and that the service member spouse has actively used during the two years and that is not a licensed to practice law so they carved out law yay so I um I underlined this phrase has actively used because that's going to come up in a case. This is a recent case portee and I think they're supposed to be an accent but I'm just going to say portee versus marath it's a recent case out of Texas so it does not have any governing on us but it's a very interesting case because we're going to see the little dance between federal and state law it's out of uh Texas it's a district court case so there's a chance this may all be appealed more likely it will be appealed but for now this is where it stands it was on the application and scope of the licensed sure and port probability provision in the SCRA there's a conflict with the Texas requirements so the plaintiff was Hannah Portee a service member spouse she had a school counseling license from Ohio and Missouri and she got married and her husband was transferred to Texas for military purposes so all that falls under SCRA and she applied for job in Texas and Texas refused saying um they had an extra requirement as most states do so they had an extra requirement that she had to have two years of experience um she appealed uh well they refused she moved she filed a lawsuit they moved for preliminary injunction and the district court granted it there was some argument about whether she had to be employed for two years or just if she used her license in that two years period and the district court sided with the plaintiff so what does this mean for us is that we have to be mindful of what the federal government's doing um what I found out after the fact is that the Department of Justice was very was very clear all along about where they stood on this so the in July of this year the Department of Justice issued a letter to all state licensing authorities regarding the professional licensing portability provisions and you can find it at their website and I don't think I printed out a copy but it's very clear the law is very clear and it's very clear to them that they're going to enforce this law and they're going to support the military members and their spouses and their pursuit of justice if they want to get licensed they also filed which is kind of interesting too it's a filed a statement of interest in the party versus Murath case um saying that she was likely to succeed on her merits and why that that why um they were going to vigorously enforce this section and why she had standing to bring the case so the message is very clear to the states that this is something important to the Department of Justice and to um federal government so as mentioned earlier yep so can we before we move on to another subject yes sir that's pretty significant I think um and very recent can we talk about that sir is that all right with you and maybe I have some questions and um I'll do my best Wanda I may call you back up um to so what does that mean for us in the Georgia legislature do we need to align our our statute to align with that federal statute does it mean we need to not do anything and and face potential lawsuits and see how the courts sort let the court sort it out I mean what is the prudent path forward so uh in my opinion I think the prudent path is for state licensing agencies to really take a look at their requirements and open it up to be compliant with the federal law I the the interesting thing is and we'll talk about this is so the SCRA is for active military and on some of our laws are more the the laws that we drafted are more about transitioning service members and so it's a little bit different so I don't think we need to repeal anything or changing our law I think agent state agencies need to be aware of this law and need to work work review their applicants with this in mind just saying oh yeah this might be an issue I don't think we need to change our laws yet uh Sarah we've argued in the legislature over you know it's 90 days long enough to recognize a military spouse license from another state is 60 days should it be 30 days I come down on 30 days this is immediately I don't think they put a timeline but I think right sooner or later we go one of your first slides it said I have something about absolute it says shall be valid you're right it doesn't say in 30 days or 90 days right shall be considered valid um I mean I think state agencies have a right they they need time to review and make sure all the documents are in place but you're right I mean it says it shall be considered valid there was some copy out on the next one is it next one yeah sorry that's fine one more now I think that's it all right I'm gonna put these animations in I thought it was being clever and it's just the pain to be as licensed as in other states that they've held so I don't think that but it has to be similar we have to see it as similar to there that does seem very subjective to me that part but I don't know I think yeah I think I mean I'd be able to it takes a lot to I know with the insurance department it takes a lot to review it takes you have to have you know a lot of documents and you meet someone to review those documents and confirm it it does take time to to process an application wanted you mind addressing us on this I wonder if um have you so again this is one of jaffee the deputy director of professional license boards have you run into this or you how are you all handling this so we've been handling military expedites since 2018 so we've have tracked those most applications are touched within three business days of receiving that military application now I can go back and pull the numbers I didn't really prepare for today I wasn't expecting to present but I have numbers that can show you how quickly the application is touched and how quickly a person gets licensed if they are marked military on their applications um I have a spreadsheet that I that I track those daily since 2018 I will tell you the problem with some of these things is that the federal government and I hate to say this but sometimes they are creating laws without taking in the state's considerations we at Georgia we are here to license people but we are also here to protect the public so there are two facets for the licensing boards we issue licenses but we also follow up on complaint and compliance to make sure our Georgians are safe within the practices so having the time to be able to receive these verifications from these other states that is very important because if they've got a pending case in another state do we want to put potential Georgians at risk when there's a pending case of some sort of malpractice in another state so some of those things you have to take into consideration these are what we call the exceptions to the rule but there are things that you have to consider when you're talking about time frames another thing you want to think about is that the response of those other states I'm dealing with a client that is trying to get a massage therapy license they cannot get taxes to send us the verification I personally went on behalf of this customer and called Texas I waited on hold for three and a half hours and still never received any assistance or an answer I sent emails to three different divisions for the state of Texas still with no response I'll call back the next day and wait for two hours this is what these people that are moving to Georgia this is what they're having to deal with he came in here and he was like I came in here and met somebody within five minutes I can't get a response out of Texas unfortunately what if there is a malpractice in Texas I feel for this people I'm prior military I moved around a lot and I feel sincerely for them and I feel like they need to be working but what if I took the chance and issued them a license and then come to find out that even though Texas was slow to respond they've got 10 cases of sexual assault you know so there are things that you have to take into consideration but as far as being a pro-military Georgia is one of the few states that are so very pro-military we add veterans preference points for exams that gives them some credit they have disability credit that we take for that to help them get their exams we are very pro-military and I have seen and I can pull up the spreadsheets I just don't have them handy but most of our applications are issued within five to ten days then again with the absent exceptions it can make it look like it's 50 days to get a license but you got to look over the long period and what those exceptions are so has this federal law changed your process and procedures or are you all still operating this I mean is this had an impact not in a significant manner because we were already pro-military if that makes any sense we were already a step ahead of the game so we already were taken in this information and preparing it and getting people licensed here so it made us look at a couple of things because there was some law that was saying that it had to be substantially you know somewhat similar and so some of the states for example I hate to say Texas again but one state for a profession only requires 300 hours worth of training where we require 1,500 hours so there's that's not substantially equal even though it's the same license type so when we're looking at these things those are some of the things that we had to take into consideration which is why we kind of pushed back and said let it be substantially equal not just you know similar so it has changed a little bit in how we process but not a lot because we were already proactive there one more question what kind of volume I'm sure it's a small percentage of your total volume but is the military license sure a pretty robust volume of activity or no no we we issue I'm trying to think about my spreadsheets because I try to track all the numbers I'm couple a hundred a year is military for licenses that where they are actually marking that they are transitional military that they are you know moving here it's just a couple a hundred a year I think one year we had like 700 and something but don't quote me on the numbers because I don't have my spreadsheet right in front of me but it's that's very little when you compare it to all the licenses that we do here no she can answer right now I was just kind of curious what we're getting for that additional twelve hundred hours worth of training without knowing what the thing was there are some that's going to come to something else we talk about is the number of hours will require for some of this stuff I'm not a lawyer you started to say last night my question was what year this law was was passed for Sarah I guess what year was this federal law pass this new one this year so so then that Texas suit is anybody challenged a constitutionality the law overall the idea that the federal government is going to require this the reason I ask that question is if so are we prudent they really not focus too much on this federal law until we see where this thing goes in the federal courts yeah I don't know if they that was raised in the in the case the her case actually started before this case I mean before the law changed and then it was brought in in the federal government sit sit in a letter or a statement of interest which I think is unusual so right there is an argument for let's see we there's a appeal process there's you know appeal up the up their side and there's in another case we've got coming it's there's appeals but I think the you know the the federal government sending a signals to help its service members to make their lives easier and all of this remember all of this is based on trying to help our active military who've been called you know called up in our being they're moving they're moving whatever it is so it's not so it's it's is a small subset of the tradition yeah so ready we're good all right let's all right let's see where we are sorry you stay calm back so I think okay so interstate licensure compacts which is an exception to the SCR's a portability rule law so so let's leave this work ah here we go My head's going to explode. Okay, I'm not sure where to look or read. So, if you go to this website, we have Occupational Licensure Convex. Actually, there are a lot of compacts in our OCGA and has to do with agreements like on water, borders, or there's just a lot of compacts. But they were focusing just on Occupational Licensure Compacts. They're about 15 available. And actually, if you scroll down, so it'll say, this is a great website that you can go to. Just keep going down, down, down, down. There's our list of 15. Georgia is signed on to about eight of those. Seven are in Title 43, and then one is in another title. And just the heads up, there's a dietician compact coming and a school psychologist compact coming. Let me see. So, is there a way to... Yeah. About this again. So, I actually... I've got a list of which ones. I'm going to... Can we count? Can we try to count this one? And this was... Oh, good.\n\nThis was just I'd like to point out that the Department of Defense is very much aware of these I licensure compacts and this is posted on their website and there's a whole bunch of links so that service members and their spouses are aware of which compacts are working and where their licensures can be eased along. So most of the licensure compacts are in Title 43. The point of interstate licensure compacts is to make it easier for people to get licensed to use their license but also to provide some safeguards so there's some better exchange of data and information between state. Okay so I'll do a skip one. Oh I think I might have. So this... Sorry there's all you never want to let a lawyer talk. There's all these things I wanted to talk about. I was going to tell you about each build and went through and what year it went through but you'll just have to read it in the news. So in addition to licensure compacts we've got some great law that in this is one section in Title 43. It's 43-134 and then the next one will do also. And this is for transitioning service members. It gives them... If you'll see in line B it's sort of... And this I think is where she's saying like since 2018 this has been... This has been a priority so they get sort of front of the line temporary licenses, license and disdry... Expod... Expodile licenses or a combination. So Georgia has been really positive about helping its military. And this is specific to transitioning service members. And as you know like with any build there's a lot of give up. There's a lot of give and take and chaos at the next session so things get added, things get taken out. So we do the best we can to get a good law for you. But this one has been on the books probably since 2017 with some adjustments. And then this past year this section of the law was amended heartily. 43-135 which is more about... Spouses and individuals. And this one we really worked hard to try to get this to protect the licensing part of the world but also to keep the licensing going. If you'll see under section B I don't want to read this because I love this it's great language. Again it's for an expedite license fine endorsement. So this part of the law is for spouses of a service member or transitioning service member stationed in Georgia. And then we added a little bit more. And I did think about this with Senator Walker's concerns. Do we need to adjust this? And I think in my opinion and I'm going to go talk to some of my senior attorneys about do we need to change B3? And I don't think we do but that is something I am wondering if that's in conflict or if it's okay because this is really just for a different group. The SCRA is for active military under orders, transferring under orders and this is a little bit different. The second part of this law or rather third part of this law is about... We really opened it up to any individuals crossing borders. So this was kind of an exciting change to the law. This of course is not affected by SCRA at all. But this was an exciting very exciting to put in place. And then the end of course we've got the little saver. We also say if you look under G. The licensing compacts, these are agreements we made with our brethren states. We honor those agreements and those agreements control. So I know I've been talking a lot and I just... I do want to show you this works. Well, it may not work but I did do... Do you think you can get it... If you can get it to work to be great. You know you never want to leave an attorney with time on their hands so in May after the session, after I'd recovered from the session I was like, hey, what is going on in Title 43? So I painstakingly went through every chapter and said, okay, this becomes an issue is what constitutes a professional licensing board, what is an other board, what is under the Secretary of State's office and I probably am going to get your business card. What do they consider under their wings or under their whatever shield? No workie? It's a beautiful spreadsheet with multiple colors, blue and green and yellow and I worked really hard and it's got tin columns about what... how many boards we have, which 43? We just lost one maybe. We'll talk about that in a minute and which ones are under the Secretary of State's office? Well, not really well. Well, there's a case. It's not lost. There was just no. Well, I'll send you an email with a beautiful spreadsheet. That's okay, that's okay. Maybe I'll try the next. Okay, well, you'll just have to imagine it's a beautiful spreadsheet with lots of colors and I think I figured out there's like nine I think eight or nine that are specifically not under the Secretary of State and then some that are specifically under the Secretary of State's office and then some that are squishy that are not in the state. I assume are probably under the Secretary of State's office. And let's you forget not everything's entitled 43 where we have plenty of licensing outside of Title 43 and this is just a list of random things I just kind of gathered. So there's lots of licensing that even when we cover it in Title 43, it may not, it doesn't reach out unless we say it's going to cover it. And just to give you an example, of course this becomes a big deal. We have not signed on to it to my knowledge. I didn't see it. We didn't sign on to a teacher compact and teaching is kind of a hard one, I think, for people to agree the first states to agree to because there's a lot of state requirements. And so we do have two statutes on the book for transferring out of state and military spouses. And that's that's about all I could find as far as getting letting out of state people get licensed. Okay, so the big winner Jackson D. Rathensberger. So as this is an exciting, exciting case that the complaint was filed in 2018 just after the Georgia lactation consultant practice act was enacted and the challenge was based on to the challenge the constitutionality of the act on due process Georgia due process clause violations equal protection clause violations. So of course I put those two up there. The plaintiffs were Mary Jackson in reaching out our sisters everywhere and nonprofit organization. The act name was rose. And if the defendant I think it started out under camp and then Rathensberger was substituted. So this was this case has gone up and down. Jackson Jackson won the lawsuit was filed and the trial court dismissed the claim saying there was no there was they failed to state a claim upon which we believe could be granted that was appealed. And the Georgia Supreme Court reversed and remanded with directions of the trial court to reconsider and they said that they had a long history of interpreting the Georgia Constitution as protecting the right to work in one's chosen profession from unreasonable government interference. And that's a key phrase there. And then the equal and they said that the trial court aired in concluding that plaintiffs are not some way situated. So that was Jackson won and this is just a quick overview. So that was in 2020. And then it went back to the trial court. There was some discovery and negotiations and talk and whatnot and on remand. The trial court granted one motion for summary judgment for one side and motion for summary judgment for the other side and both sides appealed. And so then we got to Jackson to and that this is the case that just came out this May 2023 and the Georgia Supreme Court concluded that the act was unconstitutional on due process grounds but did not reach the equal protection claim. So due process, here's your five second law school intro to due process. So there is a due process clause in the I already put it up there but in the Georgia Constitution it's always been there and the Supreme Court is very proud that they've long recognized it. And I've folded the phrase lawful occupation of they are choosing free from unreasonable government interference. And then that this is also from that the case where they say provide some guidelines on when can the government interfere when there's public health safety morality and other phase of general welfare. Generally the burden step one the burdens on the plaintiff to show the occupation is lawful and the regulation burdens them then the step two is the government must offer a legitimate interest. And then step three is the plaintiff has to prove that it's unreasonable we interferes. So in five seconds or less now you can all go to law school. And I'm happy to answer questions. I know I went a little long. I've got lots of you know I printed things and I know the website links didn't work but I'm happy to send you information. If you want my contact information is there. It's fascinating subject always interesting and always a pleasure to work with my colleagues. Thank you. Any questions for Sarah? Thank you so much. Sarah that was very informative and we'll make any of this material available to anybody that wants it. And I or these PowerPoints going to be available online. Thank you. All right. Last now my agenda we've got Mr. Gabe Sterling chief operating officer of the office of Secretary of State. We all have a member of the head. Thank you. I just like to try to smell this. Governor. Thank you. Thank you. Good morning. Y'all are everyone of those days. My phone is at an update and I feel like crap right now but I'm here to present to you all. All right so a couple of things. First of all I want to welcome you all today. I thankful for that. We have this building licenses nearly over 500,000 people in this state. And the people work very hard on that and I appreciate all their work that they do every day. And it's not easy. And we get about 2,000 phone calls a day coming in for corporations PLB and everything else but most of us for PLB. And we as Senator Waukey you heard a couple days ago where we bring about 24 million, we got about 8.5 million. And the nurses did a great job trying to present for our budget. So we appreciated that. And you saw that as well, Senator. Let's go ahead and get the next slide. All right so Y'all heard what he's saying is on license and fees generates about 24 or 25 million. And their budget for the professional license of boards 8.5 million. Well yes sir. From the state yes sir. And oh, they're teeny tiny. Okay. So the license and the fees go to the general fund. Fee's to the tour. Good friends and treasury yes sir. We reappropriate portion of them essentially. We have a majority of them. But the good part about that is in Georgia we're about 8.5 million. And Alabama which is about two thirds of our size they spend about 30 million on licensing because I have individualizing boards all run themselves. Our joint boards the way we do them save it saves the taxpayers a lot of money but still generates money for the general general fund. All right so next to the next slide. All right so this is where we are right now on the rollout. In 2020 we used a state contract to carousel to contract with Salesforce and MTX to build out a new system. Our old system emlo did a great job for Georgia for about 20 years. It was from a systems automation and it functioned but it's getting a little longer the tooth now. And we've been able to use the bond money left over from the voting systems that y'all reappropriated about $4 million to build the system out. Plus general funds that we've been able to do in part because we haven't had a director other than me and I get no extra money for that. To go towards building the system out we are in the UAT process right now. And in the UAT that's user acceptance testing we have analysts executive directors board members attorneys general who work with us going through all the different pieces and parts and we've done about. 5,000 or actually 4,800 what we call instances or stories which is the the interactions within the system itself. We've we're still have been there four or five thousand to go for the first round and right now we're looking at October of 23. To roll out the first sections of these because our intention is to not have analysts working in two systems that we're going to single system at a time. So we're going to do the cut over actually can go the next slide we'll quit. We're doing product development in the data migration that immigration is the biggest single item we have to deal with on this one right now because it is millions of records. We're in testing right now we're a little slower than we wanted to be but that's okay we'd rather be right than fast when it comes to these things. So the first cut over is going to be coming up in October and that's ending user training training for that we're doing training and testing all the way through. I see January 24 and February 24 that's when nursing goes in we want to get all of our problems out of the way before we get the nurses because those are obviously our most important ones and they will all yellow us if we have anything wrong. And I guarantee we're going to have things that are wrong it's a new software rollout we know that. We're doing the three tranches we were so before we pushed it to three and February 24 is a little aggressive. I don't know if we're going to make that or not but that is our intention right now so we have people working the tails off now one of the things we have to understand about this is and I know my executive director is sitting back at the room. Our best analysts are the ones we're doing the testing if they're in testing they can't do licenses so we're having a little bit of slow down right now when it comes to licensing but it's going to be best for the long term. And we try to explain to people we're not that slow overall and Senator walkie you were there yesterday day before yesterday listening to nurses the composite medical board which is the medical board right now they have months long. We are still the fastest part of this process at about 30 days and it's not great I wish we could just do that this new system will allow us to do that because one of the good things about the system is an administrative fix which is essentially analysts don't look at anything until you have all of what I call the binary things do you have a verifiable idea do you have your scores from your schools yes do you have your transcripts yes. Analysts are not going to look at anything until the applicant has all that stuff uploaded and they'll have a dashboard to see you're missing this this this in this or you're not missing anything we are really working pretty quickly on the stuff and one of the slides we saw on a Tuesday as a chamber event was we've nearly doubled the amount of licenses we're doing. We went from about we're record levels in every single one of our trades record levels of applications and licensing and but I think this committee should look at and our Georgia worst commission commission is we want to take away if we can these sort of subjective items that boards have to look at. And that's the thing that makes things difficult is the subjective side there are things need to be subjective but we need to be able to do it faster and take as many of those ways we can and the court case it was discussed earlier we now can only look at when you're looking at the laws we have to look at health and safety there's a secondary part of that which I think we look at which is the fiduciary side which wasn't a good idea. We're going to address necessarily in the Jacksonville Raffinsberger case. Symmeteries that have large pots of money that we have to look at we've moved that to our securities group because we know that those people have the skills to be able to regulate those but there's several of those in our sections right now. In general we're going to move this system we're going to be faster than any but in any state that's doing it we started in 2020 we will be finishing in 2023. We would have been done already but our voter registration system was dying faster than licensing was so we pushed that to the front of the line and we launched that in about 19 months. We have a very good partner in MTX a very good partner in Salesforce a very good partner in transform which is sort of our project management partner on this and we expect to be done again. I don't think it's in the February but I'm hopeful it's February probably March April May but even then we will be moving faster to a better system than most of the country will. And yes sir excuse me but so you'll have you won't have paper applications when this is completely finished I mean with the applicants go online complete their application through the portal online and upload their sporting documentation and you know that all just that all of the things up. The intention is to do that yes sir and we will still have an intake we can't just go 100% but we've done a couple of things we got a $10 fee now if you put it in by mail it's the same thing same thing that we've incorporations we're trying and we're going to make it more and more painful we'll probably raise that fee because we're paying for individuals to actually handle that paper and it's a $5 fee for online. So we're trying to push people that way and that $5 fee is going towards paying for the licensing and build up of the system and the on the licensing that will go on in perpetuity essentially because that's what you have to do to keep the software up. And there's a code section that allows us to do a collection fee for that purpose. Senator Dugan you always have a question for me come on. I'm always appreciative that Charles offices is get on these software updates. What I do have a question is some of these military ones that are coming in that know that I'm at since we're picking on Texas a little while ago I'm at Fort Hood Texas. I know my spouse has orders to go to Fort Moore Georgia. If I have those orders in hand already but I have not actually physically moved can I start this process electronically it will be once this is all done you you can now I mean essentially when it comes to the military stuff we put you the front of the line. But you still have to have all of your items in place and that's really our biggest problem and they say I'm a military spouse or I'm a military person and they say I should be the front line you should be the front of the line but you still have to get all of your items in so that we can actually process you. That's how I was asking you to do it on the front side because as a retired military person moved virtually every two years it's easier to find that stuff before the movers come. Yes after the movers have dropped it off and in a box somewhere at your new house I understand yes sir yes you can start the process. Senator Strickland. We have thirty twenty five minutes. The only question I have and we discussed this I think during session with SB 157 that we worked on this past year. I think one of the things your office mentioned was this rollout and trying to and based my question will be how does the change in the way we deal with criminal record something that's less subjective now as you mentioned with this change in the law. Is that an impact in any way or is that change going to be impacting you way by this new rollout. It shouldn't be we will be able to once you pass 157 we will be able to handle it better now the the issues we have around some of the stuff with. Arrests versus convictions and our office position essentially is yes we can look at arrests but without a full due process why I I'm kind of I'm not a lawyer makes no sense to me if you get arrested for something 20 years ago. That's somehow relevant if you're going to be a such therapist I don't fully understand how that works but the law allows for that so when you pass 157. I believe it should free up this thing this is a much more nimble system than the M.O. system we have if we if we change any field or any question and M.O. is twenty thousand dollars. I mean that's it's a cause all hard code this is more clicks than code so we feel like we can do if you all pass and change things we will be in a position to handle it better under this new system than previously. This sterling own part of the process I'm sure a lot of these licenses require criminal background check and when I get as an insurance agent when I go to get appointed with a new insurance company they do a criminal background check on me and for some reason I've had this come up a couple times this year where it's just taken a couple of months to get the job done. A couple of months to get those back is that are you all seeing that problem or do you have a different system to go through or we all got the GCIC but they changed how we do the finger printing in the background checks for the criminal records and I made a bit of best for it wanted to come here because I don't understand this as much as you do. I don't want to do that. She's a hell of a lot smarter than me on this one so go ahead. So to explain the criminal background checks we use we go through C.G.I.S. and they changed their process what they decided to do was that first you have to have an application on file so even though you go to get your fingerprints done if you haven't sent us an application they're not going to accept you. So they put you in a system you have to be in a system we have to receive your application then we can say.\n\nYes, it's okay. You can take their fingerprints. Then they go and get their fingerprints done. Then they send us the results and we have to go back out and get it. So that's been a change in the process with criminal background checks. A second thing that's really important about the background checks is the fact that when they go and get it, not only did they change the process, now they've changed who they use. They were using Codent, they've changed over to a new provider. So this new provider caused a backlog. We had people that had registered under Codent through them, that they were no longer valid and they had to go and re-register. So that caused a delay in processing of the fingerprints as well. And that just occurred maybe about three months ago, three, four months ago. So that caused a delay in there. So and then we just found out this affects our RNs. We have a lot of international RNs. The new provider that they selected doesn't have anything set up for international. So now we're battling with them about international and how we get their fingerprints done. So it's been a challenge to adhere to these rules and regulations, but we're doing the best that we can. I mean, we've got people that are staffed, that their main priority is the first thing they do is go out there and check backgrounds, approve as many people as they can and then pull those background checks after there. So to answer your question is taking longer. I mean, yeah, I've noticed that in my industry. So one of four years. Don't run away. So if things were, I mean, I'm willing to push for, you know, 30 day shot clocks on this stuff. If it takes longer than 30 days to get a background check, obviously that's problem. Under normal times when or maybe when this new vendor gets their works through the backlog is, can you normally get a background check within 30 days or And that that is, that is. That is a good question actually because they have their own guidelines, CGS, CGS, they have their own back their own timelines. So even though we're ready and we're ready to get their fingerprints, they have their own delay. They're like, oh, it can be 30 days before they can come in and even get their fingerprints done. And then once they get their fingerprints done, how long does it take to get it back? So That's outside of our, that's outside of our, you know, what we can do. We can only do once we get the results back then we can process. So you see there's many things that are outside of our ability to even, we blame for everything, but it's not, it's not our, it's not, it's not our thing to do unfortunately. You said international second ago, your slide said states, it didn't have anything to do with international. We tell them about two different things. What's that? When we were talking about people coming into state for licensure. There's out of state and there's international two separate things. So the international ones they, they can't even handle right now, which is a large part especially of our nursing side where people are registered in Europe or Africa or Asia and they come here and they don't even know where to handle those people right now. And I'm hearing it from constituents that are MD physicians that maybe they were from Grenada, Ukraine or whatever or a lot of our scientists, a lot of our doctors, the general doctors, medicine here and apparently just just about can't get license to practice. So what I mean, I mean, I can see that balance. You want to make sure that they, they're actually legitimate at what they do, but if they're. They're getting their prints should nothing happen. Yeah, fingerprints is binary. You have them. You don't. And that's the one we're talking about in this particular case. And obviously there's our board, the composite medical board for the medical side. And I know they have a five or six month backlog of getting people done, especially the international side was taking longer. Again, not our purview, but that's what's happening. So the issue is the processing of the fingerprints? Hell, I don't know. I don't know what's I mean, it's a fingerprint. It's a single thing that they have. And it's in the, it can use AI. I mean, it shouldn't be 30 days. I don't know why the vendors take as long as they are. And who chooses that vendor? C GIS. Okay. What's that? The GBI. Yeah. And didn't we a few years ago, and we, I think we expanded background checks, maybe with nurses, nurse, with long term care facilities. We did something long term care was a new one. And nurse a, CNAs have to, but I remember at that time, I think I was in the house. Maybe we did that. But I thought there was an issue as well about access to getting fingerprints and rule George in certain places. Didn't we, did we address that with some funny to put new vendors in places? Is there any update on that? Y'all may have addressed it. It doesn't mean it actually occurred. It's not. I mean, it occurred to a degree. But they get the fingerprints. It's the processing. It's two separate events. I mean, the people go roll their fingers. It just sucks. And they're slow. I'm sure we're saving taxpayer money, but it's taking a lot of time and slowing the process down. And we're not getting people licensed, which and get into work. So access to going and get your fingerprint done is not the issue. You're saying it's the, then the processing of it, right? Getting the results back. Right. So look at this in two parts. Look at this in two parts. So yes, you did provide funding and they do have more places. You can go get your fingerprints done at FedEx. You can get it done at the grocery store. Wherever the vendors happen to be at. But there's two parts of this. They also made it where now in the past, you could just go up and say, hey, I'm going to be applying for a license. I need to go ahead and get my fingerprints done. That's perfect. They were allowing that. But then they changed the process. So now you have to mail me an application. I have to have you in my system before you can even go and say, hey, I want to get my fingerprints done. So you've already started this process with us. Our clock has already started ticking. And yet you still haven't been approved to get your fingerprints done. That was a change that was they were trying to save Georgians or customers money by saying because once they get their fingerprints done, it has to be pulled within so many days or it's invalid. So they didn't want people to keep having to come back and come back and get their fingerprints done. To me, if I'm going to get my fingerprints done, I'm going to mail my application in pretty quick. But some people weren't. And so they would get their fingerprints done and then wait a month, month and a half, send in their application. And by that time those valid, those fingerprint results were no longer valid. They don't maintain them for us to pull. So then they changed the law to make them have to mail us an application. So our clock starts, but there's doesn't. Who changed the law, which was in the federal? That was done through the federal federal. It's the feds who did that. Larry, Larry Walker, does your bill? It's added more facilities. Now thanks, Biden. No, it was the feds who did that. So it sounds like everything you're saying is a national issue then on these. It is. When we go to national associations at the State, everybody's dealing with us now. It was one of those well-intentioned things, but it just had a really bad outcome, unfortunately. Congress. Don't get any ideas. I'm all recognized, representing Bentley for a question. Thank you, Mr. Chairman. Good afternoon. So what can you tell me, Gable, for those that are in the infunal industry? These young students getting ready to graduate from Gupton Jones or Hogi Chi Technical College or Columbus Technical College, ready to make their mark into the death care industry? What can we say to them is it relates to this long time process of getting their fingerprints done? Essentially, they're dealing with the same thing as everybody else does. At least they're in a recession resistant industry. So it's always going to be funerals. But they had the same situation that every other applicant has. Once they get the application to us, then they can get the fingerprints done. But it's a federal issue that we are just sort of swimming through. We can't change anything on it. It is what it is for us. Unless you can talk to our good representatives and senators to maybe push for a change. This is administrative. This is an illegal thing. This is an administrative situation. And the funeral side isn't as bad of a problem as it is for most of the other industries that we have. Because they're focusing on a couple of things. So it should be all right for them. Very good. That's good to know. Thank you. Any other questions? Did you have any more you wanted to tell us about? Basically, we have a very hard working staff. We've got a very hard working intake and call center. And the eight and a half million, we appreciate. If we get some more bodies in here, we can probably process stuff faster. I mean, it's just a throughput issue. And especially right now, when we're, it kind of trickles down to other things. We're talking about affordable housing. We don't have enough contractors in this state. We need more bodies to go for contracting. We don't have enough nurses in this state. We need more bodies to process the nurses. In a competitive way, we need to be the easiest states to license it. This system will end up helping with that. In the meantime, we still need bodies. And that's going to be the biggest thing to try to push these things through. Because it affects every other thing that you all have to deal with. Nursing shortages, healthcare shortages, housing shortages, all those things flow through our office. And we need more bodies. That's the one thing I would leave you with. And listen, I've been a conservative Republican. I hate spending money. But you have to spend money in the right places to make the systems go. The governing side of this isn't easy. It's about choices. So we need to make a decision that we can have, and our office produces enough money. It does to have this done. So anything y'all can do on the funding side. And once we get through the system in, we can probably start pairing our intake people to be analysts. But we have a meantime situation of about a year or so. So anything y'all can do in the meantime, we would truly appreciate. I appreciate what you all are doing. And I agree that I mean, I would be supportive of additional resources for your increase in volume that you're dealing with. And also this transition to the more efficient system. I do think there's other systemic problems with, I mean, it doesn't sound like the fingerprint issue. So we can really easily address. But when you have to have 3,000 hours of experience to be a massage therapist or you have to have eight or 10 years, I mean, four years, four year degree. And then four or five years of field experience to be a surveyor. Or I mean, I think there are things that I hope this committee will look at that and talk to those specific industries and I'm not picking on those two. But see if this stuff's reasonable. And as a young person, why would you want to go into a field where it's going to take you that long to be able to really earn, you know, the maximum earnings for what you're trying to do while you're kind of an apprentice or whatever. I hope we'll identify some things we can do to lessen the barriers to work. And I think that's the goal of the Georgia Works Commission also. Yes, sir. So I hope we are going to be able to. But as you peel back the onion, you've seen today with the testimony and discussion that it's complicated. I mean, the sector of Raphsonburg is basically like you said, the longer wants to get people working faster. And you're right. It does makes no sense that to cut hair on your 2,000 hours of work, but to be in the back of it of an ambulance is an AMT into 134 hours. It doesn't make it. That doesn't make any sense. So I appreciate the Senate looking at these items and your leadership on this front. Thank you. Anything else from the committee? All right. When is our next meeting? Kyle. All right. September 27th, 10 AM. We're going to do it at the Capitol room 450. I'll get an agenda out within the next week for that. And my intention is to have certain topics that these future meetings want to be. The construction trades want to be a health care centric meeting. I mean, and then we were going to add in some kind of the funding issue. We'll touch on that and some structural issues that may be helpful. But I appreciate everybody's attendance today. I appreciate the presenters and those that have joined us online. Thank you. We've got an opportunity here to help Georgians. And I hope we can get some good recommendations out of this. I have been getting a few texts from Chairman Ann Vertarity. And I don't think he has any questions. Thank you for him being with us on the live stream. Everybody, safe travels, have a great afternoon and the meetings are adjourned.",
  "updated_at": "2026-02-14T01:13:21.220971+00:00"
}