{
  "video_id": "IRZnbRIqmE0",
  "url": "https://www.youtube.com/watch?v=IRZnbRIqmE0",
  "title": "1/22/2024 Senate Committee on Finance",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 68,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Finance session from January 22, 2024:\n\n## Overview\nThe session focused on reconsidering a rural physician tax credit bill that had passed out of the committee previously but failed to get a full floor vote before the last session ended. The committee discussed updating the bill's language, including adding dentists to the tax credit and potentially updating the rural county definition to use more recent census data.\n\n## Key Actions\n**HB 82**: Rural physician and dentist tax credit bill\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- The committee discussed updating the rural county definition to use 2020 census data rather than 1990 data, given economic development changes in some rural areas.\n- There was a discussion about including a sunset provision on the tax credit to allow periodic review.\n- Questions were raised about whether the bill simply added dentists or made other changes to the existing tax credit.\n\n## Votes\nNo recorded votes\n\n## Attendance\nQuorum present\n\n## Adjournment\nNo adjournment details provided",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIf you have any questions, contact me on web.\nWe're already a minute late, we'll have an invocation first and I'm going to ask our\nSenator Billy Hickman to do that for us if you could, your mic 6 I believe there.\nYeah, thank you.\nLet us pray.\nLord God, what a great day you're giving us.\nLord, you're giving us another day too.\nTodd, are you lowering your vote?\nYou're giving us another day to work for the great citizen of Georgia.\nLord, we just ask you to guide us and direct us through our thoughts and your son's name\nSunday, Muppery. Amen. Alright, we've got a bill that had passed out last year that\ndied on the floor and the Honorable House member has come back to represent it to the\ncommittee again. We've got some date changes we need to make on it if the committee does\ndecide to pass it out again. The fiscal note from last year is in the folder as well.\nAnd we had some copies that got left on stairs, but I think they're arriving now.\nAnd we've got a couple of new people, too.\nWe should probably introduce.\nWe've got a new-ledged council, lost our wake forest lawyer, Blake Travis, to private industry,\nas so happens with several that we've had if you want to stand up and introduce yourself.\nif you can come to the mic here where I can hear you.\nHello, I am Christy Farhudi,\nand I will be helping out this session.\nAll right.\nAnd then I interned this year\nif you want to come and introduce yourself.\nHey, how's it going guys?\nMy name is Pedro Simano.\nI'll be working with Senator Houghseller this upcoming session.\nI'd tell him your major is at Georgia State.\nGeorgia State, senior, and I am majoring in finance\nwith a minor in computer information systems.\nSo I think all the other players are from here before last year, so that's all new players.\nSo with that, if you want to give us a brief presentation of your bill, or if the committee\nneeds to hear it again asking questions, go ahead with us your mic's up now.\nThank you, Mr. Chairman, and to members of the committee, thank you for allowing me the\nchance to come back before you for Senate substitute on House Bill 82.\nAs you can remember, this bill was passed out of this committee on last session and it\ngot to the floor but did not get a hearing on the floor before the clock ran out on us.\nThis is a rural physician tax credit bill that will allow us to incentivize recruitment\nof medical students to our rural communities and also to keep physicians in our rural communities.\nIt also includes dentuses in rural communities as well as positions.\nThis bill was worked on through your committee last year.\nSome changes were made and we were in agreement with those changes that were made through this\ncommittee but we just didn't get enough time to get it across the finish line before the\nclock struck 12 on Sandy die of 2023.\nBut it's the same bill that you worked on.\nWe believe that you did some good changes on this bill and made it so that it's a really\ngood beat.\nBut thank you for all the work that you did on it.\nAll right.\nAnd I will add that a few years ago we did a few bills after the clock struck 12.\nSo that doesn't always mean anything around here depending on the rules.\nAll right.\nfrom the committee on the bill again this was passed out before, the fiscal impact is fairly minimal, Senator Bates.\nYes, thank you, Mr. Chairman.\nOn the rural county, I guess it says on the line 16 through 19 talking about 65 persons per square mile.\nAnd that's from the census of 1990?\nYes, sir.\nOkay, because I mean, some of these communities\nwith all the economic development projects we've announced\nare not going to be rural forever.\nI mean, they're going to be growing\nwith the Hyundai plant, all these plants\nthat are being built, all Rivian and so on.\nBut this is all based on 1990 data.\nDoes it get updated to 20 data or anything?\nAre we going to just still stay at 1990 data?\nWell, when we talked about change,\nthe changes that wasn't included in it,\nit was stealing just a 1990 data.\nYeah, I'm fully supportive because we need\nto have doctors in rural Georgia.\nYes, sir.\nBut I just want to make sure that if they grow,\nthey can continue to get that tax credit.\nEven if they go over 100 beds, if they get CON\nand want to add to the hospital,\nI still want them to get their tax credit.\nSure, we'll be agreeable to that if the committee sees fit.\nOkay, thank you.\nLast chair, Albers.\nYeah, Senator Beach, I think brings up a good point.\nIt does say, in any future such census,\nbut it does make sense.\nWhy would we not be at the 2020 census not 30 years old?\nIt seems like a logical amendment,\nif the author were to be amenable to it.\nI'm very much agreeable to it, Senator.\nThank you.\nOkay, well, we've got, don't see any other questions.\nWe've got some amendments related white.\nThere's a, I believe that's our chair of appropriations.\nSenator Mike.\nYes, sir, Mr. Chairman.\nI think it does say that.\nIf you're looking at line 50, it says\nany future census. So tell me if I'm wrong on there. And then if you also look back at line\n17, not the, this, this the end, I can't even say that word, 1990 or any future census.\nSo you'll tell me if you still think it's needed. My question, I have two of them. One, I do see the\nstandard repeal section in 2028, which will be a five year four year sunset on line 39.\nBut that's only as the section one, the policy of this committee has been to set a sunset\non all tax credits.\nI don't know that we have one on this one, which while we may be okay with this policy,\nI do think having that sunset allows us to revisit things like Senator Beach brought\nup today if we did not have that future census language.\nIt's a reason to come back to the table and look at those things.\nThe second is, that's my first question, the sunset.\nThe second is why I don't know that I completely right now, I'm asking for someone who can\nread faster than me, to tell me I understand we're adding dentists, but I don't understand\nhow this changes the tax credit that was already in code in section one.\nDoes anybody, because if you're in section one start like line 25, it's $5,000 tax credit\nfor five years, it can't be used against,\ncan't exceed the taxpayers income liability.\nIf I flip the section two, well, first of all,\nat the bottom of that, section one's repealed in 2028.\nIn section two, we add Dennis's physician.\nLooks like they're named the same.\nMaybe there's a change in definition there.\nAnd it's a $5,000 credit for every 12-month period,\nnot to exceed five years.\nSo I'm just wondering, is this all that's doing\nis adding dentist, or is there something more to it\nthan I'm missing?\nLet you answer that.\nThe only two occupations we talked about\nwith Dennis and the doctors, the physicians.\nSo the question is, is this just adding dentist\nor to this, or have we done something else?\nJust adding dentists, too.\nOkay.\nAll right, and I think it is a good point that we do we routinely put\nsunsets on everything just because they may be great. We still like to look at\nthem on a periodic basis and make sure that the world hadn't changed. Okay, so we\nwe do want to do that. I think it's a committee process.\nMr. Chairman cannot say something else. It looks like the definition of rural\ncounty at spans, including military bases and installations, which I don't\nthat's necessarily a problem, but I'm just wondering why if it was as easy as adding\ndentists, why would we write a new code section, why would we not just come in in what was\nold section one and add dentist. Okay well we're in the what was that you\nwant to add this uh well we were the discussion of the committee was about the\nsunset of adding that but I'll leave that to the committee so we we've got the\nsunset we've got some dates that need changing okay and I'm not sure if our\nchair of appropriations had another thing you wanted to change in there as well okay okay all right\num do you have a okay go ahead see the rest of us I did miss German um and just to piggyback off\nthe appropriations job is I'm curious just because it does seem like it's two different programs\nand I just wanted to make sure that my understanding of of the bill was correct is this two different\ntax credits? No it was never meant to be two different tax credits just the same\ntax credit and we added dentists in there. Okay because there are some\ndifferences between the two the two sections the new section has not only\nredefines rural county but it also adds a cap of $2 million to the to the\ntax credit which I did not see in section one and then there's some other\nrestrictions here. I mean I generally okay with it I just pointing it it\nseems like two different programs. Okay yeah. I've got some concerns from\nseveral people we may have to bring you back I apologize for that but we want\nto ask this out with alleged counsel make sure everybody's good on this this\nis what we passed out last year but there's some concern that maybe we\nWe shouldn't have passed it out in this form last year, so we'll visit on this again on that.\nThank you, Ms. Chairman.\nSo the second bill we have today, I'm the sponsor of, so I'm going to go get in the hot\nseat and let Vice Chairman Albers take over here.\nAnd I will say this is a hearing only today on this bill.\nwe're just starting the process.\nAll right, Mr. Chairman, we've got Senate Bill 349.\nMake sure we have the right LC, 432939.\nIs that correct?\nAll right.\nHold my notes up here, yet.\nAnd that's correct.\nWonderful.\nAll right.\nTake it away.\nAll right.\nWell, we've probably all heard more about property taxes and any other issue in the last\nyear and it's been an issue for many years.\nI know I dealt with it on the County Commission for eight years and had actually put in for\nthe county in 2002 a homestead property freeze which is still in effect and the county\nhas still survived and thrived with it.\nI believe our chairman appropriations did the same when he was on the County Commission.\nAnd in fact, there are 39 Georgia counties, 35 cities, and 27 school systems that have\nsome sort of a local all-limiting assess value.\nSo what this bill does is it addresses several issues.\nOne is the escalating value.\nWe've seen property tax increases due to just solely assess value on homeowners of 25,\neven 40% on the bill and so this addresses this by saying there can only be a\n3% cap on this assessment increase by floating homestead same as we've done\non the freezes it can only go up by 3%. Some other things it does for the local\ngovernments is as long as you don't increase above that cap your\nmillage rate and you stay within that cap, you don't have to\nadvertise the tax increase anymore that they advertise so\nthat these can be very confusing to people to have these\nadvertised. Another issue is the estimated tax number on the\nbill. It quite often does not contain, for instance, the $500\nthe state put in there. Many of the exemptions that are in there, it's never a right number.\nIt's always wrong and it really stores people up. And so this wrong number would not be\non there anymore because it's totally incorrect number. And then a third issue has to do\nwith appeals. We've had many people that in my opinion have gained the system. They have\na tax appeal that puts their value at 85% and then they don't show up for the hearings\nand it just stays frozen at 85% and it stays frozen and they just never show up for the appeals\nso this can go over years and so what this says is you do still go to the 85% if you appeal\nbut if you don't show up for a hearing you don't get to keep the 85%.\nThe advantage to the tax assessors in this is the tax assessors quite often are in a\ncatch-22, I guess you might say.\nThey can raise the value of what they should put it at, the most accurate number, and\nthe whole community is mad at them.\nThey can not raise it up, and they don't meet the digest.\nWe tax on 40% of the value.\nIf you don't hit 36 to 44% the Department of Revenue says you're out of compliance and\nas a matter of fact, 33 counties right now are out of compliance according to the report.\nI received on Saturday from the Department of Revenue and so you either pay a penalty\nfor not being in compliance or you make everybody mad.\nThat's the tax assessor's life.\nThis would say you can raise it what you think is accurate but the taxes are only going\nto go up for the homeowners on that 3% maximum level that you could do. That is the essence\nof the bill. There's some other things that we need to make sure in this process that\nwe take care of that those that have freezes will stay in place. I want to double clarify\nthe language after this hearing. And I think there's been possibly an issue where the\nthe Digest is now projected now instead of what used to be and this Senator Chip Rogers\ndid a rewrite in 2010 of the property tax and some of this came about from then but we\njust had a lot of recession times and people wanted to make sure that their house changed\nand value quicker.\nWell, it's also made it change quicker going the other way and it's using numbers that\nare projected to my understanding that are hard to deal with so those are some of the\nissues we want to address in this and I can certainly go through different line numbers\nwith the committee and hear your questions at this time.\nThank you, Mr. Chairman.\nThis is a great bill and I would just say that this is definitely in need.\nPeople throughout the state have felt a lot of pain here.\nYou know, similar to what you and Chairman Tillery did, Senator Beach and I did this\nseveral years ago for North Fulton County along with our colleagues in the\nhouse. We reset all the values to the lowest amount they were in the years\n2016-17-18 and then did a 3% cap or the CPI whichever was lower and that has\nreally helped our homeers because a lot of them now would have a hundred or\n200% increase and we would attack people out of their house. Hopefully this\nwill help the entire system. I've got a similar bill that I know we're\nworking on but I applaud you for bringing this forward as well as I think\nI think if I understand in your bill, you're also giving some relief to the local governing\nbodies if they keep that increase of 3% or less and they wouldn't have to go through\nthe normal process of showing that they're going to have a tax increase.\nIs that correct?\nCorrect.\nAll right.\nI've got a question.\nI believe that Senator Dole's always at your light.\nYes, Mr. Chairman, number 11.\nI've got a couple questions if it's okay.\nFirst of all, similar to Chairman Alvers\nthat we passed in Forsyth County\nwe'll have on the ballot this year a cap\non floating homestead exemptions\nfor the school portion of the tax at 4%.\nI'm happy to see that move to three.\nI believe you references just want to clarify it.\nForsyth County on the County MNO currently has\na floating homestead of 0%.\nSo once you're locked in, it's locked\nuntil you sell the home.\nAnd that is your intention to ensure that that stays it.\nWe're going to clarify the language and make sure that is part of the bill.\nWe of course had Blake Travis dig this to begin with and that was the intention he had\nand of course he left us so I want to make sure with current ledge counsel that that's\nin place of the bill.\nI just want to flag a couple of thoughts for you if I can as you continue to work on this.\nCurrently I believe state law requires that if you win an appeal, your value is locked,\nor assess value is locked at that value\nthat it was appealed at for three years.\nI want to ensure that that remains the case.\nI haven't heard as much of the gamesmanship\naround the 85%.\nI thought you still had to eventually re-ups.\nI'm happy to hear you close that loophole.\nThere's no reason, apart from the anomaly of last year\nof us doing the $500 homeowner's tax refund,\nthere's no reason why the estimates should be wrong.\nAnd so I would rather see us figure out a way, figure out why they're wrong and clean\nthat up, then getting rid of them all together.\nBecause the second thing that I would add is that this bill deals with homeowners claiming\na homestead exemption.\nBut it's not going to do anything for anyone who owns commercial property taxes or anyone\nwho either owns a home for rent or it's a second home.\nAnd to the extent that those people will still continue to see backdoor increases via assessment\nincreases.\nI still want to keep that accountability\non the local government where they do have to\nessentially advertise a property tax increase\nif they do not do a rollback.\nI want to keep the pressure on to do rollbacks\nI think goes away a little bit.\nSo I would just like to ask you to consider that.\nAnd then lastly, I'm wondering for the base year,\ndo you just capture the previous year?\nAnd do we want to look at something\nlike what Jeremy Alverson beach did\nwhere it captured over a period of time,\neither a lower value or average value because we've seen in some areas, I think, as much\nas 50 percent increases on assessed values over the last three years.\nBut I applaud you for this bill in general.\nI think that it's overdue and certainly supportive of a constant.\nAnd again, I'm trying to work out a reasonable compromise that would limit the values but would\nalso pass.\nAnd so I'm certainly open to any suggestions in that area.\nAnd I did drop a bill today that would reset it to the lowest value between 2020, 2021 and\n22 that we'll probably discuss at a future meeting.\nOkay, I got a question.\nOh, Senator Terri, are you still looking for a question?\nA question.\nAll right, go ahead.\nThank you, Senator Hoesteller.\nI'm Senator Albers.\nOh, Mr. Chairman, the question I have is I'm looking at the definition of adjusted base\nvalue.\nAnd I understand it can increase by 3%.\nWhat happens if I take my house that's 2,000 square feet and I push out the back and\nI add 2,000 more square feet?\nIs the local taxing authority locked to only raise my assessment by 3 percent?\nThat's what I believe we have in the bill and I'll have to look for the line number, but\nthat if you put on a $50,000 edition that it would go up 50,000, it wouldn't as well\ncurrently as the law in some places where they go reevaluate the whole piece of property,\nit would only go up by the addition that you put on there.\nOkay.\nAnd I believe that's part of the challenge that exists in the property tax today.\nYou know, let's say you redo model the kitchen in your house.\nSo you're not adding to the structure.\nYou pull all the permits, you do all the right things, then your house gets re-evaluated\nat $50,000 or $100,000 more.\nWell, there's no additional cost to the city, the county, the schools.\nSo you actually, today we're penalizing people for improving their home.\nI understand if you built a 2000 square foot addition, because then that might require\nmore services in order to service your house in the time of need, but we have to come\nover the better solution there.\nOther questions?\nQuestions from Senator Oroch?\nGo ahead.\nThank you, Mr. Chairman.\nSenator Huffsettler, there's been a lot of concern that the commercial properties in\nmy county are being grossly undervalued and under-taxed and more the tax burden being\nput on the residential owners.\nIs that something that you have any familiarity with in general or in particular?\nI've heard those stories as not in my district, so I haven't really looked at it a lot, but\nI've heard evidence from people that said that they're being undervalued.\nWell, yeah, it would be a strict contradiction to what the property, the transfer of the\nproperty and a new owner, whatever, what they paid would just not be grossly undervalued\nwhen there was public knowledge and public record about how much the property costs\nwant to change hands and you know it would seem that all of that push the tax burden\nmore and more on residential as opposed to commercial is the problem to me and that's\njust something I'd like to hear more from you on going forward you know my my intent\nof this bill is to protect people who want to stay in their home right right off when\na retired and fixed income and not be subject to massive tax increases that they have.\nAnd so Florida did this same thing and actually used 3% in their bill as well.\nAnd we're trying to protect people who, you know, don't want to get taxed out of their\nhome.\nconcern across my county. Thank you. Senator Estevez.\nI echo my colleague from the 36th concerned about commercial properties and what we can\ndo to give counties the tools to appropriately adjudicate those appeals. One of the things\nthat I appreciate about this bill, Mr. Chairman,\nis the fact that by alleviating the county's\ndocket related to homes that have property appeals,\nyou're actually allowing them to use those resources\nto then focus more on commercial appeals.\nBecause right now, there's a lot of time\nsplit between residential appeals and commercial appeals\nby by cleaning up this process a bit it would allow our counties to focus more on those\ncommercial properties which take up a significant amount more resources.\nI also appreciate and wanted to ask you, well not even ask you, I also appreciate the\nThe fact that it does allow local municipalities in counties to not be distracted by the rollback\nadvertisements, which as a former local government official, found always be deceiving.\nAnd as several of us have talked about, not necessarily required by other entities, including\nthe state of Georgia when the state of Georgia does not roll back its taxes.\nSo appreciate that we're going back to where we should be, which is focused on not confusing\ntaxpayers and being transparent with taxpayers on where their taxes are going.\nAny other questions from the committee members?\nSeeing none, we've got four people signed up to speak.\nFirst one, no stranger to this committee.\nDante, would you like to come up from ACCG and sit next to the chairman?\nGood afternoon, chairman Alvers, members of the finance committee.\nWanted to express ACCG support for the the package that is in Senate bill 349\nI think will make a lot of very positive changes\nQuestions for ACCG\nThat was great. Thank you\nSee if everybody can follow your same suit here next from GSBA Justin Panley come on forward\nThank you Chairman committee thank you for the opportunity to speak to you today just have a few\ncomments around the bill so just going to read a couple of notes here. We recognize and understand\nthe issues that this bill is addressing as do our membership. Many school districts have taken steps\nto ease the burden on their constituents as local homestead exemptions have been created\nbased on age and income. In 2023, 110 districts decreased their\nmillage rates, 57 held them in place with no change and only 13 increased their millage\nmostly by less than half a point. There have been a good, good faith effort to adjust\nthese rates, taking into consideration the increased rates of inflation, which increases\nthe cost of doing business. We would respectfully request a fiscal note to be done to look at the\nimpact on the school districts, counties, and cities as well as the state. Although the state does\nnot collect ad-balarm taxes, the property tax digest impacts state funding in the QBE formula\nand the calculation for the five mil-share deduction and equalization. We appreciate most of the bill\nand what it addresses but do have concerns around the statewide floating tax exemption\nwhich caps property tax at 3%.\nSchool districts are constitutionally capped at 20 mils.\nDistricts whose digest is largely residential would be particularly hard hit.\nIt would create a system in which places more of the responsibility for funding local\nservices on new property owners if prices are rising and on local business owners.\nThis could impact some economic development efforts.\nwill not always continue to increase as they have in the last few years.\nThe housing market will slow at some point and we just thank the opportunity to address\nthe committee.\nThank you.\nYou've got a question, Justin, from Senator Dole's all.\nThank you.\nYou mentioned 110 did rollbacks.\nWhat was the approximate size of a typical rollback?\nMy understanding was that most of them were less than a quarter of a percent and that there\nwas only one that was over a quarter mill rollback, is that accurate?\nWe do have the report.\nI don't know the numbers right off the top of my head.\nI get a copy that I'd love to see that.\nThank you so much.\nAnd once you send that to the committee\nand we can distribute it out to Diego here.\nSo got the report from the Department of Revenue\nthat we give the same numbers.\nI'll get that to the committee as well.\nGot a question from Senator Tillery.\nThank you, Mr. Chairman.\nI'm wondering how you would set up a fiscal note\nbecause the fiscal note would have to,\nwould the revenue would be, I guess you would assume\nit's neutral unless the commission or the Board of Education is raising the\nmillage rate. So without knowing how much they're going to raise the millage\nrate, I'm not sure how we could factor in what a physical note is going to show\nyou zero.\nI don't have an answer to your question. I'm sorry, but I can definitely look\nto it for you. If I could add, I'm working with Department of Physical Audits on that\nvery issue to see if there is any physical impact to GBE formula or something. So we were\nthat was brought up and so we decided we needed to address that.\nOther questions for Justin. Thank you for your testimony.\nThank you.\nSteve Swindell, come on down.\nThank you Mr. Chairman this is what a mind be nice to him now I'm I'm the Cherokee County\nchief of Fraser and I serve as the legislative director for our tax assessor group in\nthe state and I'm just here to let y'all know that we are neutral on this bill as the\ntax assessors of the state on a whole, speaking on behalf of Cherokee County, my only caution\nis that we are a county that has a floating homestead, and it does get a little dicey\nexplaining to taxpayers how the whole process works, and this would complicate that process\nto a certain extent, I believe it has the potential to, but other than that, we're okay.\nCan I ask a question?\nOf course, Mr. Chairman, go ahead.\nYour floating home state exemption is that a freeze, a 3% camp?\nHow does that work?\nIt's a freeze on the county M&O, and then two of the cities have it too.\nSo it would cause us, in this case, I believe to maintain a second base rate,\nobviously, of this passes, and then adjust above the percentage of,\nthree percent or less whatever whatever it's less I mean we can do it so the\nsame in my county we've got a freeze on the city in the county not on the\nschools so they've got that freeze they keep employees the schools are\ndifferent so it's still gonna be two numbers I think I think the mass workable\nthere okay you got another question from Senator Beach thank you for being\nhere and I represent part of Cherokee County. Can you tell us how many\nyour appeals have they went up in the past? This past tax? Yes sir. Somebody\nmentioned earlier that the whole deal about property values increasing,\ndigest increasing, and tax assessors still being caught failing in their\naudit and that is what happened in Cherokee this year. We've had massive\nincreases, tried to keep up with the market. Our numbers look good. The state says\nas they don't, but yeah, we had a massive increase\nin appeals this year.\nCan you tell us how much?\nYeah, we typically average about 3,000 a year\nand jump to 8,500 this year.\nI mean, that's a big increase now,\nand don't get offended by this,\nbut that tells me, I don't know how you assess the property,\nbut somebody's assessing it wrong\nif you have that many appeals in the citizens' mind.\nThey think it's too much.\nI'm just not, I will tell you, I think property tax is one of the most regressive taxes we have.\nAnd I want to just give you my personal example.\nI've been in the same house for 31 years.\nI paid $169,000 for that house in Alphoretta.\nToday, I mean, my last assessment was at $885,000.\nNow I'm glad it's went up in value, but I haven't put $716,000 worth of improvements in that house.\nAnd I haven't realized the game.\nI think it should almost be like when you sell stock.\nYou don't pay the capital gains tax to you sell the stock.\nAnd I just think we're hurting people.\nWe're forcing people out of their houses.\nAnd I just have a problem with that.\nI think there's got to.\nSo I want to thank Chairman Huffstellar for least bringing\nthis to where we have a 3% cap.\nWe just need to be careful because some of these people\naren't going to be able to stay in their houses.\nAnd I just kind of wanted to get that off my chest a little bit.\nI didn't really have a question as much as I'm worried about.\nYou know, I guess my other question is how does the tax assessor value the property?\nDo they go on Zillow? How does that work?\nIt's an ad valorem. It's according to value.\nWe look at all the deeded transactions that occur in the county for a given year.\nAnd adjust our values to the deeded prices as closely as we can.\nand then have to adjust everybody else accordingly.\nSo this year we had about, for 2023,\nwe had about 6,000 qualified deeds that we looked at\nand made those adjustments based on those deeds\nand we do it every year,\njust trying to adjust to those values\nfrom that prior year deed cash A.\nAnd it's gotten to the point where the market\nin these last few years, I will say,\nadjusted so rapidly that from the beginning of the year deeds in January versus\ndeeds in December, you might have a particular neighborhood where the\nvalues jumped $100,000 on the same house in that 12-month span. So trying to get\nour values in line with any kind of accuracy, you know, we end up having to\nfocus more at the end of the year and things that we're just not really\ncomfortable or accustomed to doing, and the state on the flip side, on the Department\nof Audit side, hasn't really been a friend to us either, because they're focusing on January\n1st only, and they want us to adjust our values to January 1st.\nAnd if we did that, I think we'd have had substantially more than 8,500 appeals.\nNo.\nWell, I didn't mean anything about that.\nI just when you have that kind of jumping appeals people something happened you follow me and and I'm look\nI hope I can sell my house for 885 when I bought it for 169 and then I'll be a happy camper\nBut right now, I'm not I'm just making the point that I haven't put\n$700,000 worth of improvements in the house to be taxed on in my opinion. I understand you\nIf I could ask one question of him always up here too you talked about the January first date\nI've been told that it wasn't always that way\non January 1st that you're used to not have to project forward as a tax\nassessor. You may not have been in it before 2010, but I've been in since\n95. But yeah, it's always been January 1st is the date of appraisal in\nGeorgia, but you could count on the market being slow enough that, you know, if\nyou saw a three to four percent expansion and market over the course of a\nyear, you could target kind of a middle of the year number. So you'd end up with\nan overall ratio that would be around July somewhere,\nbut you wouldn't be that far out of whack\nby the end of the year.\nWell, in this market, we end up being way out of whack\nby the end of the year.\nSo we've had to change the way we do things.\nSo you're doing assessments all year long.\nThey're asking us to trend.\nIf we had to sail in February, they're saying,\nwell, trend that value to January 1st.\nOK.\nThat's where the problem is.\nThose people that bought in February and March are, that's going to be a problem.\nOkay.\nI think we all agreed, AIMN to what Senator Beach said, none of it really makes sense.\nThey dropped in 2009 like a rock, right, and then they came up their houses worth exactly\nwhat one person's willing to pay for at any given day.\nAnd that's why I bought Senator Huff's cellware for the work he's doing.\nSenator Teller, did you have a question still or did you turn your light off?\nI'm just picking off your expertise here.\nIn Georgia, we have this weird system where we tax on 40% of the full value.\nWhy would we, it would change practically nothing to tax on 100% of the value.\nYou could totally just drop the millage rate accordingly and get that exact same number.\nIs there a reason to do that?\nAnd does your office, if we were to make that change in the middle of these other changes,\nwould it save you any time or create any efficiency for you?\nI think that it would create a tremendous amount of transparency with the taxpayers.\nI do applaud that effort.\nHowever, I think the major stumbling block seems to be according to the legal scholars\nthat I've consulted about this, the constitutional local amendments for homestead exemptions.\nThose are all set at a value and that value is based on the 40 percent and you can't just\nI don't believe you can even just legislate that correction\nto multiply by 2.5.\nI think it would have to go back to the voters,\nand you're talking about hundreds and hundreds\nof those exemptions that exist out there.\nSo I think that that's really the hold up.\nAnd as far as the code section goes,\nI don't know that it would be that dramatic to change it.\nThere's not that many places.\nI mean, there probably are that we don't know about,\nbut we'd rely on you all to find those places\nthat it exists, but from a tax assessment standpoint,\nhow long for it?\nWe have to answer that question a lot.\nThe reason for it, I've been told,\nwas years ago, before really any attention was paid\nto fair market value and keeping up with fair market value,\npeople just returned their value\nto the tax assessor's officer to the county,\nAnd typically they'd returned it at about 40% value.\nSo then the state came in and said,\nnow we've got to stop that.\nEverybody's got to get up to fair market value.\nWe've got to do what's right.\nSo they forced the revaluation way back when.\nAnd it turned out that there was that difference.\nSo they said, all right, we're going to assess everybody\nat 40, but the values are going to be at 100.\nThat could be a lifestyle.\nI don't know.\nI've never heard it expressed any other way but that.\nbut that's my understanding of how that came to be.\nThank you.\nAs always, you are a wealth of knowledge, Steve.\nThank you.\nAre there other questions?\nI saw some lights go on and some lights go off.\nSeeing none, thank you.\nThank you, Chairman.\nAll right.\nLast person signed up to talk.\nSuzanne.\nGood afternoon.\nThank you all for having me.\nI am Suzanne Whiteenhouse.\nthe chief appraiser of Muscogee County and I was asked to come to talk about homestead\nfreezes and their effect historically because Muscogee County has the longest homestead\nfreeze in existence in the state of Georgia.\nours was implemented it was enacted in 82 and implemented in 83 now we are a consolidated\ngovernment, so it's Columbus, Muscogee County, and our homestead freeze is a zero percent.\nIn other words, there is no inflationary aspect to our homestead freeze.\nYou lock in, you lock in.\nAnd we have a lot of history to talk about what that does over the course of time.\nAnd there are implications to freezes that have zero percent increases built into them\nor three percent or five percent or ten percent just depends.\nRZZ is zero percent.\nAnd what that has done is that has shifted our tax burden.\nIt's the newcomers tax basically.\nIt has shifted that tax burden to our businesses and to new businesses coming into town and\nto non-home-steaded properties\nand folks who buy their property.\nAnd I've got a really good example.\nI've got a house in our historic neighborhood\nof Uptown in Columbus that was homesteaded in the early 80s.\nRight around the corner is another house that's\nalmost identical that was homesteaded in the 2018-2019\nsomewhere in there.\nBoth of them valued right about $300,000.\nOne pays $7 and 19 cents in tax.\nAnd the other tax bill is over $3,000.\nAnd this is what happens.\nSo when you talk about an inflationary cap of 3%,\nthat's great because it allows for some resets.\nBut you need to be aware if you look at the history\nof values over the course of time here in the state of Georgia.\nAnd I kind of took it back to about 1980 thereabouts.\nYou're going to find that your increases\nare 4.39% on average.\nThat takes into consideration the downturn\nthat we had the little downturn we had in the 90s.\nAnd then again, in 2008 when we had the big downturn,\nand then it takes into consideration\nthe hyperinflation that we have seen in 2021-22 timeframe.\nSo you're averaging about 4.39% what's that mean?\nIf you cap at 3%, you're not going to keep up.\nNow, it took 10 years in Muscogee County\nbefore they realized, whoops, we made a mistake.\nAnd they tried to roll it back.\nThey tried to repeal that freeze\nand put something different into place.\nAnd they couldn't claw it back.\nOnce it's in place, it's impossible to claw back.\nSo I'm here.\nThey asked me to come to talk about what this means historically.\nAnd so I would just caution that any kind of inflationary increase that's put into place,\nyou take into consideration the history because what you don't want to happen is what's\nhappened in Muscogee County, which is the fact that we have a great workforce, we have\na great school system, we have a great community, we have lovely river access, we are the\nSavannah of the West, we are a great community and we struggle to bring businesses in because\nwe have shifted our tax burden.\nThe freeze cost us about $56 million in tax revenue\nthat had to come from somewhere else\nbecause the county's not spending less.\nThey're still going to provide all of the wonderful services\nthat we enjoy.\nSomebody has to pay for those.\nSo that's $56 million that was shifted over\nto non-home-steaded and businesses.\nAnd what happens is in order to encourage new businesses\nto come. We have to then offer greater exemptions and all of that. So now we're going to penalize\nour existing businesses. Very comparable county that does not have our homestead phrase.\nStill has military base, still has a river, borders another state that has good industry\nto it, lots of hospitals. So we've got everything kind of similar. I don't know if any of you\nhave guessed, I'm talking about Augusta Richmond County, another consolidated government. We're\nabout the same size. We are a couple thousand people, a couple thousand citizens apart size-wise.\nThey are so much larger than we are because they've been able to draw businesses to them,\nbecause they have a lower military, they have a lower sales tax rate. We have had to put all\nof this in place to make up for the differences that our freeze has caused, the shifting of the\nthe tax burden to the businesses that we need to come to us.\nSo that is the one thing I would caution.\nThere's lots of great stuff in this bill\nthat I really, really like.\nAnd I, as a fellow chief appraiser with Mr. Swindell back\nthere, we really do appreciate the focus\nthat has been on the tax assessor's office\nand trying to clarify for the taxpayer.\nAnd it does get very confusing for the taxpayer.\nI would, I have some concerns about how this is gonna work\nwith the 3% versus what we already have in place.\nours effects, our school already,\nso we don't have that, we don't have that burden there.\nBut this has the ability to adjust back\nif there's a downturn,\nwhereas the one in Muscogee County cannot adjust downward\nfor a downturn in the market.\nSo our folks that locked in in 2008\nand then the market tanked in 2009,\nIt took them, some of them all the way up until 2020-2021\nto actually come back even and then surpass\nto get the benefit because our freeze\ndidn't have that in place.\nThank you, Susanna.\nA question for you.\nYou're using that 4% plus number.\nIt was out basically because the increase\nof the inflationary costs over that time, over those years.\nSo that is, that's an indexed adjustment\nthat they, that, you know, if you look at Fred,\nI love Fred, Fred's a great resource.\nAnd that's where I get that number from.\nFor the state of Georgia, that 4.39% average\nis a seasonally adjusted increase in value\nover a historic period of time.\nSo that increase in value, of course,\nis an inflationary increase.\nThat's not because of new construction.\nThat's the increase in value.\nOK.\nI just wondering how that gets skewed, as you mentioned,\nwhen we have big downturns and extraordinary upturns.\nAgain, this is, I think, part of the challenge for everybody.\nAs an example, last year, you know, the Fred shows a year\nover year, third quarter, 23 to third quarter, 22\nof a 7% increase.\nThis last quarter was about a 2% increase.\nSo that's, gets averaged in with that huge downturn\nthat we had in 2000 and, you know, nine time frame\nto work out to over the course of a 40, 45 year period,\n4.39%.\nIt's a long picture.\nAbsolutely, I got a question from Chairman Hofstelver.\nI was just going to say this, fortunately or unfortunately,\nhowever you want to look at it, will not have any impact\non your county because you've got a freeze in place.\nIt will continue to stay in place.\nAnd so there'll be no mechanisms to do it all\nfor your particular county.\nNow, I understand on the freeze what you're saying,\nand this does have 3%.\nI lived out in California five years, believe it or not.\nGlad you escaped, Mr. Chairman.\nthey said you can never leave but somehow I got out but anyway I went under\nthere under Prop 13 and there's been good and bad things from that and people\nwhen I got there said you know your neighbor may be paying half the property tax\nas you are are you happy with that and I said what I'm happy with is that mine\nare not going to go up and so that was my point of view in my county we put in\nand again this is a 3% increase but we put in a freeze for the city in the\ncounty in 2002. I think the county has done fine. I think they've functioned very well\nthere. Business has not been chased away just in the last month. Microsoft said they're\nputting a billion dollar data center in our county and they're not, we're not giving\nit away to them. They're paying their taxes and all their school taxes, everything from\nday one. So we're attracting business and I think that that's not going to be an issue\nWith a three percent increase on this because I've seen it with a freeze work well, too\nThank you. You got a question from Senator Dole's all\nThank you. Thank you for being here today\nHow much is the county military gone up in the last five years?\nOur military it's actually fairly stable\nWe fairly stable or zero zero increase. No, you know, there's been there's been a bit of an increase\nOkay, use some of those numbers.\n23, it dropped a little bit.\nLet me see if I have those numbers.\n23, we did drop just a little bit,\nbecause we did that increase in the digest\nwhen we did a revaluation.\nI'm looking to see if I have those,\nthe milled change in milled trades.\nSo, and what they did was they shifted\nour milledrate a little bit to put more towards debt service so they that's\nwhy I say they you know we've had some some tweaks to it over the course of\nhistory that we've had this freeze into place our milledrate started out in\nthe in the you know somewhere in the 29 range I was just talking about the\ncounty the county milledrate you know what that is County MMO our county\nBecause bond service, maybe this is important for the committee, for those that haven't dove into this yet.\nThe bond service, the reason you're shifting to that, that's not subject to these floating hubs, that exemption.\nSo, all of the bond.\nSo, here in Muscogee County, it does affect it.\nSo, you're doing remilitarate rollbacks on the bond service, this bill does not do that.\nSo, the Muscogee County freeze, just as an example, the frozen value does affect how much you pay on the bonds.\nyou just don't get the homestead deduction, the 2000,\nthat the state allows you the 11,000 and five,\nbut you do get that frozen value up against the military.\nYou guys have a population of about 205,000.\nSo we're in there, yeah?\nI'm in first side, which is about 250,000.\nWe've had a 0% cap since 2000.\nSo not quite as long as y'all, but for a long time.\nAnd it's had zero impact on economic development.\nIn fact, we're in the counties and negotiations right now to bring an NHL hockey team to the county.\nAnd that has just really not been a factor where there's been for data center sites and\nindustrial sites where the fastest growing county and the state have been for over a decade.\nAnd that's been with this freeze in place.\nYou said something that makes me tick a little bit.\nAnd that is that the counties have no other option.\nThey essentially have to collect it from the commercial taxpayers.\nAnd I just disagree with that.\nLast year, in Forsyfe County, our school superintendent\npresented a budget that would have assumed\nthe full military at 17.3 mils that our current milledrate\nis at, and there was outcry from the community,\nand the school board was able to do a full two-million\nrollback, which is the largest rollback in the state,\nand they were able to subtract $60 million.\nOtherwise, we've just been spent by government.\nSo I think that what the chairman is trying to do\njust to either make the county or the school board go to the\ncitizens and argue as to why they need to spend more money.\nAnd the tool that they have to do that is a milling increase.\nAnd the reality is, is that these counties and school boards\nhave been raising taxes on their citizens,\nmaybe not in the scogies you've had the freeze,\nbut all over the state of Georgia,\nwithout even having to raise the military,\nand they just get to blame not the property tax assessments.\nI think that what we see is that citizens,\nwhen they know that their money is going to good use\nare willing to invest in government.\nBut the elected officials have to be the ones to do it,\nnot just some sort of, like Chairman Beach said,\nit attacks on unrealized gain.\nBecause we are taxing people out of their homes in the state.\nAnd we have heard it from all over the state.\nAnd so your local delegation can remove the 0% rate\nof the cap if they wanted to, but they haven't been compelled\nto do that.\nSo that was a-\nThey have tried.\nWe've tried multiple times.\nit's a constitutional amendment,\nand the voters have voted it down twice now.\nWell, it's not like it's a local referendum.\nAnd so what you're saying is,\nso your voters like that this is in place,\nit's not damaging the economic development\nin the county so much that they've...\nSo, well, I can tell you,\noverall growth in the state has been about 21%.\nIs, you know, that was a 22 number.\nThe growth in 22 was about 21%.\nThe state-wise.\nStatewide growth, just overall growth in dollars investment, all of that, it was about\na 21 percent growth in investment, across the state of Georgia, those are-\nGovernment budget, I'm not sure what you're referencing.\nSo that's growth as far as new construction and I look at things from what's getting built.\nSo that was like, there was a 21% increase\nacross the state in investment into building infrastructure\nand buildings and houses and schools and all of that,\n21% in Muscogee County, we were at eight.\nSo.\nAnd your position is at the sole reason for that\nif it's you all has.\nHe's one of the reasons, it's not the only reason,\nbut it's one of the reasons.\nIt's a predominant reason in Europe in your opinion.\nYeah, because we have one of the highest milligrates\nin the state.\nIt's 23.321.\nExcuse me.\nHow do you juxtapose that with what I just told you that the fastest growing county\nin the state also has the same cap that you're talking about?\nSo what I can tell you is that you've had it in place for 20 years.\nWe've had it in place for well over 40.\nAnd we see the trend.\nAnd it's a long term trend.\nAnd all I can say is I hope that I hope that Forsythe County continues to be successful\nI know the challenges that Muscogee County has faced and some of the stuff that they have that they have tried to overcome and\nHere's the end. I'm gonna have to cut you off Suzanne\nWe got it. We got to have to wrap this meeting up in a minute\nI appreciate the dialogue maybe something you all could take off fine\nDo you want a very brief question for Senator? I can answer that milled-rate question before we leave this subject\nMuscogee County in\n2019 the milled-rate\nwas 40.501 in 2023. It was 38.561. So the five-year trend is downward.\nThat 23 is not correct. It was 38. That's what I said.\nIt should be 39.93 for 20. Well, I guess the DOR's numbers are wrong then.\nOn that particular one, yes. It's 39.93.\nAll right, Senator Beeson. Thank you, Mr. Chairman. I'll be real quick because I know it's time sensitive,\nBut I got to tell you, these counties need to live within their means.\nI mean, you made the comment, there's 56 million short, but\nthey're going to find the money somewhere because they're going to spend it.\nAnd they need to look at cutting instead of spending.\nAnd Senator Albers and I will attest to this.\nFulton County now is completely municipalized.\nAnd we thought when that happened with the services being paid for by Milton and\nJohns Creek and Sandy Springs that the spending in Fulton County would go down.\nis not going down. It's going up. So, you know, I just, I, I'm a little bothered by the\ncomment that they're going to find, we've got $5.56 million somewhere. Just, you know,\nyou got to make some cuts. Thanks.\nSuzanne, thank you so much. Chairman Hustle, you want to close this out here?\nNo, I appreciate the committee's time. As I said, this was a hearing only. We want to make\nsure we've got everything taken care of on this bill and bring the best bill forward.\nThank you. All right. Thank you all for coming. The finance meeting is here by\nByjourn.\n",
  "updated_at": "2026-02-12T19:43:59.150277+00:00"
}