{
  "video_id": "IV7_GzbYtXw",
  "url": "https://www.youtube.com/watch?v=IV7_GzbYtXw",
  "title": "The First Lady of Georgia Chats about GRACE Commission's Work Against Human Trafficking",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Here is a summary of the Georgia legislative session on the First Lady of Georgia Chats about GRACE Commission's Work Against Human Trafficking:\n\n**Overview**: The First Lady of Georgia, Marty Kemp, discussed her efforts to raise awareness and take action against human trafficking in the state through the GRACE Commission. She highlighted the pervasive nature of the issue, even in rural areas, and the importance of educating the public and law enforcement to identify and report potential trafficking situations.\n\n**Key Actions**:\n- No specific bills mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**:\n- None detected.\n\n**Notable Moments**:\n- The First Lady shared her personal journey of learning about the scale of human trafficking in Georgia, describing her shock at statistics like 3,600 children being trafficked each year. \n- She emphasized the importance of survivors' voices, recounting how she invited them to participate in the GRACE Commission and contribute to policy decisions.\n- The First Lady discussed efforts to increase penalties for those involved in human trafficking, such as revoking commercial driver's licenses for life if used to facilitate trafficking.\n- She also highlighted the need to provide support and services for survivors once they are rescued.\n\n**Votes**:\n- No recorded votes mentioned.\n\n**Attendance**:\n- No quorum notes provided.\n\n**Adjournment**:\n- No adjournment details given.",
  "transcript": "When Marty Kemp became Georgia's first lady in 2019, she knew where she wanted to make\na difference in the state.\nWhen I spoke to her recently, the mother of three girls told me that her interest in\nfighting human trafficking began before her husband was elected governor.\nWe went to the Atlantic station where they were having a press conference, pretty much\njust talking about human trafficking.\nWe had 72 school buses, which represented the 3600 kids\nthat were taken into trafficking every year in Georgia.\nAnd I was like, that cannot happen, that can't be.\nWe've been traveling, campaigning around the state\nfor two and a half years.\nAnd I've never heard anything about this.\nStarted learning more about it.\nThe team brought it to me.\nWe formed the Grace Commission, which\nbrought all the experts to the table, law enforcement,\nnonprofit, businesses, corporations,\nand just really talked about it.\nWhat is, what's going on?\nWhat is everybody doing?\nWhat do we need to do?\nAnd it needed to have more education and awareness.\nAnd we needed to have harsher penalties.\nAnd we have done that.\nExplain the, what the acronym, Greece is.\nSo it's Georgians for Refuge Action Compassion and Education.\nSo we have now Grace's Place, which is a facility\nthat entakes where we have survivors come\nand get the wraparound services that they need.\nSo that's been an operation for a year.\nAnd I pretty much want that,\nwould love to have that facility be a model for the country\nbecause it has everything that they need.\nAnd so that, that would be very helpful\nfor other states to take that on.\nSo we're hopefully going to build our third facility\nbefore he gets out of office,\nwhich I'd like to see, you know, five or six.\nUnfortunately, they're needed,\nbut it's also getting the survivors,\nthe help that they need, that they deserve.\nOne of the things that surprised me\nwas how pervasive this is.\nwe tend to think that it is a mid to Atlanta problem.\nRight, but it's not, right?\nIt is not.\nAnd then I remember, I think the statistic they gave me\nback in, maybe we talked about in 21 was, you know,\nit was in 140 or 147 of 159 counties.\nAnd I said from the beginning, it's in 159 counties.\nWe just don't know how to recognize it.\nSo we have also taught law enforcement.\nWe have a training that's just 30 minutes.\nIt's on the website of the Governor's Office\nunder the First Lady Grace Commission.\nAnd it just shows you the things to look for\nand what to recognize.\nIt's 30 minutes in your everyday life,\nif you're out shopping,\ngo into the airport, traveling, whatever it is.\nIf you see something, say something, if you're wrong,\nthat's okay.\nYou call law enforcement and you're wrong.\nThat's fine, but what if you save some lives life?\nI mean, what if you can call\nand get that individual out of harm's way?\nIt would be fabulous.\nHow many people do you estimate you've\ntrained over the last few years?\nWell, I wanted to have the training back\nAnd I guess we did that back in 2020 or 21\nto really encourage, not mandate or make people take it,\nbut encourage people to take it for all state employees.\nAnd I think there's 83,000 state employees\nand the agencies took that home\nand did have their individual employer employees take it.\nSo I mean, that right there, but I know,\nI mean, I have people come up to me all the time\nand say, how can I help?\nHow can I get involved?\nAnd I have to take the training.\nAnd they do.\nAnd I've had, I encourage them to tell their people\nthat they worship with, that they work with.\nJust take it, it's 30 minutes.\nAnd it's the education and awareness that you really have.\nYou've been able to bring to light for so many people.\nI know that must be something you're proud of.\nWell, I am proud of it.\nI have people come up and talk to me about it all the time.\nAnd I'm really glad.\nIt's an ugly topic.\nNobody wants to talk about it, and I completely understand that.\nBut I like to take on topics that are, you know,\nthat people don't want to talk about.\nI'm not afraid of that uglyness,\nbecause these individuals, you know,\nhave had a very tough childhood life,\nand they deserve somebody standing up and fighting for them.\nAnd I'm going to do that, and I've told them that.\nI've had survivors come to the Grace Commission meetings,\nAnd at the end, we have open public comments.\nAnd I had a couple of them come down\nand really write me over the calls\nand tell me I didn't know what I was talking about.\nAnd I said, you know, you're exactly right, I don't.\nI don't know the hell that you have been through.\nBut I am here to help you.\nAnd if I only help one person,\nif we only help one person, it's worth it to me.\nBut you can sit at this table,\nyou can sit on the Grace Commission\nand give us your input.\nAnd they were a huge part of the vacature bill.\nWe had them come in and talk to our policy team,\nand they were a huge part of that.\nAnd they said, you know, nobody's ever asked us.\nNobody has ever asked how we thought.\nAnd I'm like, how could we not learn from,\nyou know, we can learn so much from them?\nIf they're willing to talk about it,\nnow if they don't want to talk about it,\nI completely understand.\nBut I had a group of them come to lunch at the mansion.\nAnd we sat there and talked with some other\nnon-profit organizations.\nIt was very eye-opening to me.\nand it was very tough.\nAnd Brian came home that night and he said,\nare you okay?\nAnd I said, no, this is an ugly topic.\nBut we're gonna, it's not gonna knock me down.\nWe're gonna talk about it and we're gonna,\nwe're gonna get these people.\nThey put them in jail for a long time.\nI'm sure it's been tough to take it all in.\nRight.\nYou know, it's tough to talk to them in a hug them\nand just feel for them that, you know,\npeople don't understand in their everyday life\nthat they're going on what's actually going on in their life.\nIt's just really, really tough and just really ugly.\nI think the best thing is you said they came to you\nbecause they know that you're involved in this topic.\nThat has made it easier, right?\nI think so, I feel like people,\nlike when I travel around the state with Brian,\nwhich people make fun of me for traveling everywhere,\nbut I feel like people feel like they can come up\nand ask me things and they can also share things with me\nthat they may not feel as comfortable going to talk to him\nabout even though he's very approachable, I think.\nBut they feel like they can come speak to me about issues.\nAnd we've had everything from making your CDL license,\ntaking it away for good if you're caught using your truck\nas a human trafficking tool to entice young girls.\nBut that takes it away for life.\nI mean, it's not just a slap on the hand.\nWe mean business here.\nAnd I want people to know that, as Brian said,\nand stay at the state, if you mess with our children,\ncoming after you. You've hit all levels from the truck drivers you mentioned to helping the girls\ngoing after the pimps. Absolutely. And anybody that profits, you know the hotel clerk that is\nat the front desk, they're seeing everything that's going on. So they need to know that they\ncan be a part of our team, not a part of that team. And if they are a part of that team,\nthey can get sued as well. And there is a lawsuit right now that is because of our bill.\nand this young individual was trafficked in 2014.\nSo we're going back and trying to help them,\nyou know, get some compensation.\nThey have nothing when they come out.\nThey don't even barely have the clothes on their back.\nSo we wanna try to help them in any way possible.\nAnd that was one thing that was very important\nwas not only having the harsher penalties,\nbut not forgetting about these victims once they get out.\nWe need to take care of them.\nThey deserve that.\nAnd so we've tried to do that.\nIs there something you're most proud of?\nall of this. I think just people being aware and feeling like they can talk about it. You know,\nwe've had the utility companies, we've had the beer and wholesales, they want to put stickers on\ntheir car. I mean, everybody is is joined together and want to be a part of the team to try to\nhelp these victims because I think a lot of people felt like, oh, that doesn't that doesn't apply\nto me. That's that hadn't happened. That doesn't that's not going to happen to me. Well, it can\nit can happen to anybody. It does not have a hall pass at all.\nSo, you know, with our big busy airports, we have a PSA there,\nthat the mayor and Representative Bayes,\nMoore, Brian and I, and Tyler Perry, all joined together and talking about it.\nSo it's a, you know, nonpartisan issue that we are all coming together.\nAnd like I said, the legislators have passed it unanimously.\nSo they are all on board. So that's very good.\nIs there more that you want to see done?\nYou know, I would like to see more facilities. I would like to see individuals get helped\nmore and just have, you know, there's businesses that have come forward that want to help,\nyou know, have employment for them. So just talking about that more, but having the facilities\nto have them heal. And just, they need to feel safe. And I want them to feel safe and know\nthat there is an outlet. There's an option to this. And we're coming after the perpetrators.\ncoming after the bad people. We're going to put them away for a long time. I mean, the attorney general's\noffice has rescued almost 200 victims. I mean, that's great. 200 victims that are out of that\nlife. That makes me proud. The first lady says the amended budget, the governor assigned recently,\nadds another $1.2 million to the human trafficking prosecution unit. She says they're so busy,\nthey requested another prosecutor.\nI want to thank her for that interview.\nBut the first lady is not finished trying to change laws\nto stop human trafficking.\nComing up, we'll talk with legislators from both sides of the aisle\nabout the bills she's pushing now.\nWe'll hear from a Republican senator\nand from the House Democratic Representative Stacey Evans.\nThis is Lawmakers on GPB.\n",
  "updated_at": "2026-02-12T12:15:05.046888+00:00"
}