{
  "video_id": "iVdE6WVSRtI",
  "url": "https://youtu.be/iVdE6WVSRtI?t=519",
  "title": "Georgia House - Day 15 (2026-02-06)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 15,
  "video_date": "2026-02-06",
  "duration_minutes": 165,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n# Georgia House - Day 15 (2026-02-06)\n\n## Overview\nThe session included remarks from the House Chaplain, Reverend Rose Marine Green, who discussed the importance of compassion for those in prison, drawing parallels to Jesus's own ministry and teachings.\n\n## Key Actions\n**HB 876**: [No description provided]  \n**HB 385**: [No description provided]  \n**HB 992**: [No description provided]  \n**SB 63**: [No description provided]  \n**SB 876**: [No description provided]  \n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Green offered condolences on the passing of Chairman Richard Smith.\n- Reverend Green discussed Jesus's teachings on compassion for the imprisoned, and highlighted how influential figures like Dr. Martin Luther King Jr. found inspiration while incarcerated.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nA quorum was present, as all members voted on the afternoon roll call.\n\n## Adjournment\nThe session time and date of the next meeting were not provided.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you all members please come to the floor for new you you we're going to have the morning roll call well in this case we're going to have to have the afternoon roll call all members present will please vote green to signify their presence in the chamber Mr. Clarek will you unlock the machines you you you you have all members voted all members voted if so the clerk will lock the machines the door keepers will you please close the doors and keep them closed you you you you you you you you you as is our custom we will begin our day with scripture reading in prayer by the chaplain after which we will pledge allegiance to the flag of our country our chaplain this morning this afternoon excuse me once again we introduced by the lady from the 77th house house district representative ronda brinnell represent any brinnell mister thank you miss speaker good afternoon it is my honor to introduce our chaplain of the day Reverend rose marine green Reverend green's church is in my district however she and her husband reside in representative to meet your husband's church is in my district she co-pastors amazing grace world outreach church with her husband pastor wester green who is here today their church was established in 1998 and forced park Georgia and recently celebrated their 25th anniversary the greens have been residents of Clayton County since and they have seven children ten grandchildren and nine great grandchildren and their children and church family are seated in the gallery it is my pleasure to welcome my friend reverent rose marine green thank you thank you I say good afternoon to everyone and I would like to begin by just offering my condolences to the family, to the colleagues, to the friends of Chairman Richard Smith on his passing away. It's my understanding that he was a great man and that he loved this state and he loved the work that he did. So I offer my condolences. Thank you, Speaker Burns, for inviting me to come today and my thanks to my representative, Ronda Bernou and my other representative, Demetrius Douglas. And I would also like to thank other members of our Clayton County delegation coming from Clayton County. The home of the mighty John's Burrow High School met a majestic marching cardinals who would be performing in a live, in a Super Bowl commercial this Sunday and who will also be performing and be a part of the Macy's Thanksgiving parade proudly representing the state of Georgia. That's coming from Clayton County. We are so grateful today. I bring you greetings from the amazing Grace World Outreach Church where Bishop Green is the pastor of my husband and as Representative Bernou has said many of the congregants are here with us. And I would like to start off by saying that I am a member of a special fraternity here in Georgia and it is affectionately known as Grady Babies. I heard some chuckles and some of you know what I mean. Grady Babies were the ones that were born in Grady Hospital and so many years ago I was born about a mile from here in Grady Hospital. I am a Grady Baby. I've never lived more than 30 miles from where I was born. A 30 mile radius and that's because I love it here. I love Georgia and so I consider it a special honor and privilege. I don't take it lightly to be standing here before you today in this distinguished chamber with you wonderful servants of this great state. So thank you. Thank you so much. Today we are going to listen in on a private conversation. Listen in just a little bit on a private conversation that Jesus had with his disciples. Just a few days before he was crucified. This is not a scripted parable. Actually it's a sneak preview of things ahead. Thousands of years ahead. So we are going to just take a little listen as to what Jesus was saying to them. And I'm not going to read everything but he started out. This is coming out of St. Matthew the Gospel according to St. Matthew the 25th chapter. You're all I'm sure for me with it. But he started out talking with his disciples about the return of the king. He gave special categories of people. If those people had been shown special kindness and compassion, then the king would be very satisfied with that and that he would commend them at that time. And the categories were those that are hungry, those that are thirsty, those that are naked, those that are sick, those that are hungry, thirsty, naked sick, those that are homeless, five on this thing, on this hand. But then at the end there was another one that was added and that was those that were in prison. So we had a lot of people who were hungry, thirsty, naked, homeless, sick and then over here on this other hand in prison almost, almost clandestinely coming into that group. Because we talk a lot about the hungry, the thirsty, the naked, the homeless, the sick. But today I want to talk a little bit about the ministry that my husband and I have been involved in something that's very dear to my heart and that is the prison ministry. And I'm not going to talk directly about that, but let's see what Jesus had to say. At that time he told them that there would be some commendations given when he returned, to those who showed compassion to that group. And the ones that were listening to him heard him explain that at that time the writers would be commended. They would be commended. And they were told when you've done this, but the least of these, my brother and you've done it as unto me. That's how Jesus responded when he was asked a question, when the question was asked to the king, how in the world, when did we see you hungry, when did we see naked, when did we see you thirsty, when did we see you homeless, when did we see you in prison. He said the king was said at that time, when you done it until the least of these, my brother and you've done it to me, you've done it to me. And I want us to remember that you've done it to me. And so Jesus seemed to have a special compassion, a special connection with those who were in prison. And three days after this conversation, of course he was crucified. But the demonstration of his connection, while he was hanging on the cross, actually on death row, between two convicts, he spent his last breath. He spent his last times in his earth suit on this planet, ministering to a fellow in mate. Why? Because we call him the thief on the cross, but I believe Jesus would call him the least of these, my brother. In addition to that, if we fast forward about 30 years, then we know that when he arrested a young man by the name of Saul, converted him to Paul, and gave him an assignment by the Holy Spirit to write two-thirds of the New Testament. And we all know and understand that four of those epistles were written in prison. These collations, Philippians, filaments, these were actually written while Paul was incarcerated. Let's go just a little bit further, just a little bit further. And Jesus decided to make a personal, long distance, inmate visitation to his beloved disciple John, all the way from heaven to the Isle of Patmos, in order to dictate to him the book of Revelation. He was in exile. He was incarcerated at that time. And not only that, but right here, and I beloved Atlanta, a place that I love, right here, a native sign of this community, Dr. Martin Luther King. When he penned, when he scripted one of the most famous letters that's ever been written, a great piece of literature, a great motivation, something that actually helped to change the fabric of this nation. He was not sitting in the comfort of his office over at Elveniza, where he was the copaster with his father, Daddy King. He was writing on parchment, sitting at a Mahogany desk. No, he was sitting in a jail cell, 150 miles from here, in Birmingham, Alabama. Yeah, some great things can happen under the anointing of the incarcerated in the jail cell. Some great things can happen. And so what I want to talk, I want to share with you just a little, a little, I think it had a very good ending, a little story that occurred with me and my team of ladies who were going out ministering to those in jail. This was about 20 years ago. Now let's keep in mind. I'm going to read this and the King shall answer and say into them, barely I say unto you. And as much as you have done it, Isaiah 2540, unto one of the least of these, my brother and you have done it unto me, about 20 years ago, we were ministering in a jail, a local jail. And there was a lady there in our service who was obviously just distraught, just distraught throughout the whole service. Afterwards she came down to ask for special prayer. And so when I asked her, okay, what is it, dear? What's bothering you so much? Then I will make this very brief, but what she ended up, excuse me, what she ended up saying was that she had been there for some months. During that time she had a child. That child was taken from her, I was after he was delivered and taken into foster care. And she knew that the next week she was about to be shipped out to the place that she would serve her prison time. And this is what she said. She said, I haven't seen my baby since the day that he was born. She said, if you would just pray for him, that he would be in a loving family. And if you would just, she said, I wish there was some way that I could just see my baby one more time. I said, okay, tell me your baby's name. We are pray, we are pray right now. She said, his name is Jamal. I said, okay, how old is Jamal? He's three months old. He's three to many. Where was Jamal born? He was born in Southern Regional. When was his birthday? She told me his birthday. I said, hold up. Your baby is the youngest, the newest member of our congregation. The foster mother that is taking care of your baby right now is a member of our church. And absolutely, your baby is being loved. Absolutely he's being taken care of. And not only that, I'm going to arrange for you to see him. And so the next week when she had to come into the courtroom, we had the foster mother to come into the back of the chambers, just into the back in a very unobtrusive way. When the young lady came out and took her seat, I had her to just hold the baby up. Just hold them up so that she could see her baby. She turned around, she looked at the baby, she did a heart like that. What did I do? That was my it. You see, when you do it unto these, the least of these my brother, and you're doing it as unto me, that was my it. That was the it of the ladies who were with me because that's what we were able to do at that time. That's what God had put within my purview to do at that time. And in concluding, I'd like to just tell you about one other situation, just one other situation. A young man grew up in a large extended family in a Christian home. He was home school. His idea of having fun was going on mission trips with his father, as far away as Kenya, Africa. He was home schooled so he finished high school early at the age of 16. He went on to college. In his third year, he was accused of a horrendous crime. At trial, he was actually acquitted and he was allowed to go free. He was found innocent of the charges.\n\nAnd that is a good thing. But the bad thing is that he was incarcerated for 549 days, waiting for a trial, 549 days waiting for a trial. We went home to be with his family. And after that, 10 months later, this young man, his name is Paul Costerley, you can Google him. This young man, not a young man from the ghetto, but a white kid in Carleton, Georgia committed suicide. Just three years earlier, he had everything to live for. And now, because of the change that took place in those 549 days, suddenly, his whole life changed. What am I saying? What I'm saying is that somebody missed their it. Either a person missed the it or a system missed the it. Because Paul ought to be here with us today. This is what happens when we miss the it. And so I want to leave you today and to say to you, you're in a unique position. You don't travel to the jails and the prisons like I do. Like my husband does, like some of the other people who are part of our team. Maybe you don't, maybe many of you don't do that. But you do what you do. And I don't do what you do. You do your it. But as you're remembering those, as you're remembering, the hungry, the thirsty, the naked, the sick, people getting that last one. The hungry, the thirsty, the naked, the sick, and the homeless. Hallelujah. Thank you, Pastor Green, and the homeless. Don't forget about this hand over here. It's a prison. Don't forget about that. Amen? Do your it. Do your it. And do it from your heart. And so I'm going to pray. If you stand with me, please. I thank you so much for your attention. And I thank you for this great opportunity. Father God, we're so grateful to be here today to be a part of this great assembly. I thank you, Lord God, for the decisions that are made in this house. I thank you, God, for how you're advancing this great state. And Lord, as we all go about doing our daily duties, let us be mindful of those who you categorize as a least of these. We didn't do it. You did it. And included in that number are those who are imprisoned. And then Lord, your word says in Psalm, the 102nd Division of Psalm, verse 19, for he has looked down from the height of his sanctuary, from heaven, did the Lord behold the earth, to hear the groaning of the prisoner. And so Lord God, I thank you right now for hearing the groans. I thank you for the ears being opened and the hearts being receptive to doing your will in Jesus name. Amen. Want you please say the prayers to the flat with me. I pray allegiance to the flag of the United States of America and to the Republic of which it stands, one nation under God, any available, with liberty and justice for all. Thank you, Pastor. Thank you, Bishop, for being here. Door keepers, you may unlock the doors. Members, you may join the pastor in the South, any room, greet her and have a photo if you'd like. Thank you. Members, our Doctor of the Day, today is brought to us by Chairman Tray Rhodes of the 124th House District. And that's Dr. Mason Florence. Dr. Florence is downstairs in the health. Cottage, and if you need her, need him, excuse me. You may go down and see Dr. Florence. Okay, if the House will come to order, House will come to order. Members, will please find their seats, take these important discussions out into the any room. Members, will please take your seats. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information Audits. Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. And on another note, always remember, you really never fail until you quit trying. Profound and true on another note, no doubt about that. Thank you, Chairman Tarvan. Chairman Tarvan, the Chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair here is none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair here is none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative Strachan, on the 104th, moves finally be established as the order of business during the first part of the period unanimous consent, introduction of bills and resolutions first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair here is none and the resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House bill 1,113, represented by reps and I've reached the 99th, got 30th, Smith of the 18th, lever to the 123rd, silcox, the 53rd, and others. There will be a title of an act to amend chapter 18 and title 50, the physical to George Anatetti, relating to state printing and documents. Governmental affairs. House bill 1,114, by reps and have waited the 9th gamble of the 15th on the 103rd, McDonald the 26th, Jones the 25th and others, there will be title of an act to amend, title 33, the physical to George Anatetti relating to insurance. Insurance. House bill 1115 by reps and have Williams of the 148th, Kelly the 16th, Crow of the 118th, Blackman 146, Horn of the 3rd and others, bill to the title of an act to amend, chapter 8, and title 48, the physical to George Anatetti relating to sales and use taxes. Ways and means. House bill 1116 by reps and have pucked near the 137th, Stevens the 164th. House to the 170th, Blackman the 146, Holcomb and the 81st, bill to the title of an act to amend Article 2, chapter 7, and title 48. The physical to George Anatetti relating to imposition rate, computation, exemptions, credits relative to income taxes. Ways and means. House bill 1117 by reps and have pitch and the 161st, lump into the 12th, Collins the 71st, Vanston the 133rd, Neil the 79th, bill to the title of an act to amend, Code Section 35, 8, 8 in the physical to George Anatetti relating to requirements for appointment or certification of persons as fee solvers. Public safety and homeland security. House bill 1118 by reps and a draper, the 90th, Gilear to 160 second, Beverly the 143rd, Bill the 22nd, Polly the 33rd, Bill the title, an act to amend, chapter 2, a title 21, the physical to George Anatetti relating to elections in primaries generally. Judiciary non civil. House bill 1119 by reps and have carcin' of the 46 and Hilton the 48, Bill the title, an act to amend, part one of Article 1 of chapter 8, a title 40, Bill the physical to George Anatetti relating to gentle provisions relative to motor vehicle equipment and inspection. Motor vehicles. House bill 1120 by reps and a tailor, 173rd, air heart of the 36th, meet the act of the 74th, Smith the 70th, Thomas the 21st and others, Bill the title, an act to amend, Code Section 45, 299, the physical to George Anatetti relating to ascertainment of taxable property. Ways and means. House bill 1121 by reps and a ballot of the 147th, Washburn the 144th, Polly the 33rd, New with the 64th, Saints with the 180th, Bill the title, an act to amend, chapter 60, a title 36 of the physical to George Anatetti relating to gentle provisions applicable to counties and municipal corporations. Governmental affairs. House bill 1122 by reps and a Hilton the 48, Jones the 47, Dubnec of the 29th, Pallor to the 147th, Adina the 110th and others, Bill the title, an act to amend, chapter 2, a title 20 of the physical to George Anatetti relating to secondary and elementary education. Education. House bill 1123 by reps and a bear to the 24th, Cooper the 45th, Silcox the 50th, Oliver the 82nd, Bill the title, an act to amend, chapter 5, a title 30 of the physical to George Anatetti relating to protection of disabled adults and elderly persons. Judiciary non-subm. House bill 1124 by reps and a mark of the 49th, Hilton the 48, Jones the 47, Silcox the 53rd and Gaines the 120th, Bill the title, an act to amend, Subpart 2A, Part 3 of Article 7 of chapter 3, a title 20 of the physical to George Anatetti relating to needs, based financial aid program. Higher education. House bill 1125 by reps and a Cooper the 45th, Carpenter the 4th, Daniel the 117th, Hilton the 48th and Smith the 18th, Bill the title, an act to amend, title 34, the physical to George Anatetti relating to labor and industrial relations. Industry and labor. House bill 1126 by reps and a percol 169th, Jasper's to the 11th, Colour to the 19th, Tick of the 145th, Collins the 71st, Bill the title, an act to amend, Article 2 chapter 14 of title 40 of the physical to George Anatetti relating to speed detection devices. Motor vehicles. House bill 1127 by reps and a percol 169th, Corb of the 174th, Roads of the 124th and a lot of the 131st, Bill the title, an act to amend, title 2 of the physical to George Anatetti relating to agriculture. Agriculture and consumer affairs. House bill 1128 by reps and a lot of the 131st, taken to the 156th, new to the 64th, Houston to the 170th, Ballotter the 147th and others, Bill the title, an act to amend, title one of the physical to George Anatetti relating to general provisions, so as to enact the Georgia women's bill of rights. Judiciary. House bill 1129 by reps and a whole come to the 81st and work eyes in the 157th, Bill the title, an act to amend, Article 3, a total 16, the physical to George Anatetti relating to responsibility, relevance, defenses, to criminal prosecutions. Judiciary non-civil. House bill 1130 by reps and a whole come to the 81st, work eyes in the 157th, Bill the title, an act to amend, Article 1, a chapter 3, a total 16, the physical to George Anatetti relating to responsibility, relative to crimes and offenses. Judiciary non-civil. House bill 1131 by reps and a whole come to the 179th, Ballotter the 147th, say it's the 180th, glazed to the 67th, advanced to the 133rd, and others, Bill the title, an act to amend, Part 3 of Article 16, chapter 2, a total 20, the physical to George Anatetti relating to health of students, and elementary, and secondary education. House bill 1132 by reps and a remainder of the 56th, Jackson the 128th, Limb of the 98th, Bill the title, an act to amend, Titles 8, 10, 33, and 34 of the physical to George Anatetti relating to buildings and housing. Judiciary. House bill 1133 by reps and a remainder of the 56th, Limb of the 98th, Bill the title, an act to amend, Part 7, an article 6, a chapter 2, a total 20 of the physical to George Anatetti relating to staff development on the Quality Basic Education Act. House bill 1134 by reps of Stevens the 164th, say it's the 180th, Buckner the 137th, Bill the title, an act to amend, Article 2, chapter 7, a total 40, 80th, the physical to George Anatetti relating to the impositionary, computation, exemptions, and credit, and relative income taxes. Ways and memes. House of Resolution 979 by reps of Draper the 90th, Mitchell the 88th, Drenner the 85th, Crawford the 84th, and Ben of the 94th, Resolution recognizing Reverend Dr. William E. Flipp and Senior, dedicating a bridge in his honor. Transportation. Senate Bill 333 by Senator Dixon the 45th is still the 48th, Bill the title, an act to incorporate the City of Moambeard. The Intergovernmental Coordination. Senate Bill 377 by Senator Tillery the 19th, Karpatric the 32nd, Burns the 23rd, Paine the 54th, Strickland the 17th and others, the bill to be entitled an act to amend, Titles 15 and 49 of the physical to George Anatetti relating to courts and social services. Public and community help. Senate Bill 386 by Senator Dixon the 45th, hatching the 50th, the 12th of the 55th, beach to the 21st, Malow the 2nd and others, Bill the title, an act to amend, Titles 50 of the physical to George Anatetti relating to state government. Higher education. That completes first readers. Second reading of bills and resolutions the clerk will read. House Bill 1094 by Representative of the 133rd, Jackson the 128th, the bill to amend an act creating board of commissioners of Baldwin County, House Bill 1095 by Representative of the 133rd, Jackson the 128th, a bill to create board of elections and registration for Baldwin County, House Bill 1096 by Representative Washington the 144th, work eyes are the 157th, that was the 89th, the Powell the 33rd, a bill relating to general provisions, professions and businesses. House Bill 1097 by Representative of the 133rd, Mathis of the 149th, Karpatric the 4th, Hitchens of the 161st, Lums of the 12th, a bill relating to driver education training courses, House Bill 1098 by Representative Hawkins of the 27th, Stevens of the 164th, Newton of the 127th, Jackson of the 128th, Townsend of the 179th, a bill relating to Medicare, Supplement and Insurance, House Bill 1099 by Representative Huttleston of the 72nd, Bershad of the 176th, Canon of the 170th, Camp of the 135th, Bred to the 124th, a bill relating to general provisions relative to criminal trespass, property to damage to property. House Bill 1100 by Representative of the 64th, corporate of the 174th, Prince of the 130th, Smith of the 138th, McLean of the 109th and others, a bill relating to motor vehicles and traffic. House Bill 1101 by Representative Mayner of the 56th, Camp of the 135th, Hagen of the 156th, Cox of the 28th, Sgt of the 14th and others, a bill relating to the Fair Business Practices Act of 1975, House Bill 1102 by Representative Momtae of the 17th, Smith of the 18th, Lever to the 123rd, Daniel of the 117th, Chaspers of the 11th and others, a bill relating to criminal extradition. House Bill 1103 by Representative Gellier of the 162nd, Williams of the 168, Reitz of the 140th, Gladney of the 130th, the bill relating to income taxes. House Bill 1104 by Representative, corporate of the 84th, the few-move the 140th, Smith of the 109th, Douglas of the 78th, Cox of the 28th, the Bill to amend the Quality Basic Education Act. House Bill 1105 by Representative Petrie of the 166th, Collins of the 71st, Bonner of the 73rd, Dunneh of the 31st, Barton of the 5th and others, a bill relating to penal institutions. House Bill 1106 by Representative Petrie of the 166th, Stevens of the 164th, Jackson of the 165th, Gellier of the 160th, Hitchens of the 161st, Wail to Authorize the Municipal Court of the City of Tybie, Ireland, Charge and Technology, Fee, House Bill 1107 by Representative Maynard of the 56th, Jones of the 25th, Mitchell of the 88th, Sains of the 180th, Daniel of the 117th, a bill relating to General Provisions Relative to the Reitz and privilege of patients and representatives regarding examination, treatment for mental illness. House Bill 1108 by Representative Fry of the 120th, Cains of the 120th, Reitz of the 99th Washburn of the 144th, Holley of the 116th and others, a bill relating to General Provisions Relative Housing Authorities, House Bill 1109 by Representative Crawford of the 84th, all over the 82nd Evans of the 57th, Miller of the 62nd, Willis of the 55th and others, a bill relating to to tolling of limitations. House Bill 1110 by Representative Crawford of the 84th, all over the 82nd, Kendrick of the 95th, Miller of the 62nd, Willis of the 55th and others, a bill relating to offense of violating Family Violence Order and Penalty, House Bill 1111 by Representative Crawford of the 84th, all over the 52nd, All over the 82nd, Willis of the 55th and others, a bill relating to carrying and possession of firearms. House Bill 1112 by Representative Levin of the 123rd, Levin of the 175th, Barrett of the 24th, Anderson of the 10th, Warner of the 3rd and others, a bill relating to the elections and primaries generally. House Resolution 947 by Representative Gailier of the 160th, Stevens of the 164th, Jackson of the 165th, Westbrook of the 163rd Resolution, Designating the Weeping Time Cultural Heritage Cordors, an official cultural and historic corridor in Georgia. Senate Bill 105 by Senator Walker, that's the third of the 20th. Robertson of the 29th and in March of the 31st, Goodenham of the 8th, Anderson of the 24th and others, a bill relating to retirement benefits, payable upon normal earlier delayed retirement from the public school ed employees retirement system, Senate Bill 328 by Senator Roberts of the 56th and Robertson of the 29th, a bill relating to retirement and pension, Senate Bill 335 by Senator Roberts of the 56th, Robertson of the 29th, Kirkpatrick of the 32nd, Strictland of the 17th, Jackson of the 45th and others, a bill relating to incest to the bill 369 by Senator Burns of the 23rd, Albers of the 56th, Robertson of the 29th, parents of the 42nd, summers of the 13th and others, a bill relating to registration and licensee of motor vehicles, through 2nd readers. We can have a little order in the house. Senator Davis-Clerk reports a standing committees, the clerk will read. Representative Matt Hatchin, the 150th District Chairman and Committee on Appropriations submitted the following report. And to speak your committee on appropriations, as added under its consideration following Bill of the House, as the instructor of the Committee report, saying back to the House and following recommendations, Hospital 915, do pass by committee substitute, respectfully submitted, Representative Matt Hatchin, the 150th District Chairman. Representative Chris Irwin, the 32nd District Chairman and Committee on Education submitted the following report. And to speak your committee on education, Senator Newton's consideration following Bill of the House, as the instructor of the Committee report, same back to the House and following recommendations. Hospital 941, do pass by substitute, Hospital 987, do pass by substitute, respectfully submitted, Representative Chris Irwin, the 32nd District Chairman. Representative Tyler Paul Smith, the 18th District Chairman and Committee on Judiciary Non-Civil submitted the following report. And to speak your committee on Judiciary Non-Civil, as added under its consideration following Bill of the House, as the instructor of the Committee report, same back to the House and following recommendations. Hospital 909, do pass by committee substitute, Hospital 1033, do pass by committee substitute, respectfully, Submit it, Representative Tyler Paul Smith, the 18th District Chairman. Representative Rick Jasperist, the 11th District Chairman and Committee on Transportation submitted the following report. And to speak your committee on transportation, as added under its consideration following Bill of the House, instructor of the Committee report, the same back to the House and following recommendations. Hospital 516, do pass by committee substitute, Hospital 617, do pass by committee substitute, respectfully submitted, Representative Rick Jasperist, the 11th District Chairman. That completes the reading of the Reports and Standing Committees. All right, members, huddle out in the, call the signals out in the Any Room. Make the play out there. Need everyone's attention. Members will please take their seats. We're getting ready to have some members bring some morning orders in the afternoon and recognize some very important guests in the gallery. Representative Gladney and the Augusta delegation. Representative Gladney. She comes Augusta delegation. Join us down at the well. Members, we're going to have a maximum of two minutes. Very much maximum. If you can do it, short appeared in that you will gain great favor with the speaker. Thank you, Mr. Speaker. Good morning. Good morning. Introducing Augusta's very own radio hostess with the mostess with her own very own nonprofit organization, the Sisters Only Club. Will you please stand, ladies? Founded by Miss Sharebest of I Hard Media. This multimedia talented speaker, writer and community advocate uses her finesse as the radio voice of the community on the afternoon ride out show and the morning show as a pivot to express her passion to help the Augusta community. The S.O.C.'s roster includes over 40 strong professional women. Many of them joining her today with a focus to visit us at the Capitol to address community issues that further their efforts to develop teams in power women and promote overall health, wellness and quality of life. Her access to the community on 93.3 KISS FM and on the throwback 105.5 in Columbia, South Carolina gives us plenty to grow to as we enjoy our family and friends. But don't get it twisted. This clever lady is way more than a fast-talking this jockey. We in her Sisters Only Group does regular community service, volunteer work, host, she hosts an annual scholarship ball, a Prama Paloza giveaway, a Christmas toy giveaway, and the renowned She-Roy Awards to honor women of valor throughout her community. On behalf of the Augusta delegation, thank you for visiting the people's house today. Welcome. Glad to have you. Members, if you will join with me in recognizing a gentleman who has spent many years in this house, seven years, sixteen years, and has been our pastor, Chaplain. Many times served as ethics committee chair, our very own Randy Nicks, Representative Randy Nicks. Good to have you back. Chairman Blackman, Chairman Dickie, Leader Beverly, Representative Barreler, Chairman Williams, Noel Williams, they'll recognize for a morning order in the afternoon. Thank you, Mr. Speaker. We are excited today to have visitors from the Perry area Chamber Commerce, their youth leadership, and adult leadership classes won't you help us welcome them to the people's house. Would you all stand to be recognized? Very proud. Thank you, Mr. Speaker.\n\nChair Lady Penny Houston has recognized for a morning order in the afternoon. Chair Lady is good to see you back. It's good to be back. Thank you, Mr. Speaker. It is my honor to recognize Heather Bracewell, a South Georgia landowner who has just been awarded one of the nation's highest honors for her commitment to the sustainability of managed trees. Ms. Bracewell of Bearing County was just named the 2023 National Tree Farmer of the Year by the American Tree Services. Ms. Bracewell was recognized for her stewardship with the Gaskins estate. And one thing about the Gaskins estate, it has been in her family for almost 200 years and she told me today in 2026, it was formed in 1826 and it's been in her family since 1826 and she will be honored by the Tree Farmers later on in the event in March. But I would also like to say thank you to Ms. Bracewell for she established the Gaskins Forest Education Center and by hosting classes, workshops and field trips, she's given hundreds of Georgia's boys and girls the opportunity to visit an area with the abundance of natural wildlife in her farm. Thank you and thank you for your commitment to forestry and congratulations and I'll ask her to say it if she will. Thank you. Wow, that's awesome. And if you're ever in South Georgia, we'd be glad to show you the Gaskins Education Center. Come on down. Thank you for helping individuals in our state to understand forestry in our wildlife and congratulations on national tree farm in you. That's awesome. Thank you. Thanks for being with us. Representative Joseph Gullet. Representative Joseph Gullet, there he is, right there. Representative Gullet's recognized and friends, wait a minute, you have friends, I didn't know you had any friends, but I guess you do. There's nothing you had that many, must have paid them. Got friends. Representative Gullet. Thank you Mr. Speaker. Today we want to extend a heartfelt welcome to our gallant firefighters here on firefighters recognition day. Let it be known that your efforts and sacrifices are recognized and deeply appreciated by the members of this house and by the people of Georgia. We honor and commend each of you for going above and beyond the call of duty. Let this day serve as a testament to your outstanding service and a reminder of our collective gratitude for your heroic contributions to our state. You would please stand. Thank you for your bravery, thank you for your service, thank you for your dedication to our communities and for our state. We appreciate you. Thank you Representative Gullet. Thank you for what your gentleman do. Representative Bennett. Representative Bennett. Recognize for a morning order. Thank you Mr. Speaker and good afternoon colleagues. Today it is my privilege to recognize those in the gallery from the American Physical Therapy Association of Georgia. This morning we had over 400 physical therapists, physical therapy assistants and physical therapy students to be with us today. Now we have the remnants that I left for the afternoon. I would like to ask you to stand as I indicate to my colleagues that we have over 12,000 members of the American Physical Therapy Association of Georgia here spread all across Georgia and perhaps some of you had had the great opportunity to receive therapy or treatment from physical therapists who serve in an array of health opportunities. So thank you Mr. Speaker. Colleagues want you to rise with me and recognize our physical therapists, members who are with us today. Thank you Mr. Speaker and thank you to my colleagues in the gallery. Thank you. Welcome and thank you for your work. Physical Therapy is important. Representative Lutton. I like this one. Here's ready for some good news. God knows I am. I am so proud to have with us today representatives from Bagel Rescue, nonprofit based in Brookhaven. Bagel Rescue is a hunger relief food rescue specifically for bagels. Bagel Rescue has reduced, their goal is to reduce food waste and support hunger relief from a chance discovery of bagel waste by a young boy, Reese Diaglets, who was curious and dared to ask the right questions. His mom, Aaron Stiglitz, turned that discovery into a way to support the community by creating an epic web of goodness and offering those suffering from food insecurity, a bite of dignity. They have rescued more than 1.4 million bagels. They have made over 10,000 bagel deliveries. They have partnered with over 100 agencies in nine counties in Metro, Atlanta. This is a tremendous work. Please join me in recognizing Aaron, Reese and Graham Stiglitz, board member Jen Bala, and volunteers Shiva Waterman and Vijay Desai from Bagel Rescue. Thank you so much for coming to the people's house today. Bagel Rescue. Welcome to the house. We're glad to have you here. Representative Hilton is recognized for an order. Thank you, Mr. Speaker. This morning we had a few hundred Girl Scouts down here. The Capitol is a little bit of a fire hazard. I was proud to have about 200 of them from my district. We've got a few remaining here. Girl Scout Troop, 17428. Would you please stand and be recognized by the members of this body. Please recognize the best Girl Scout Troop in Georgia right there. Thank you, Mr. Speaker. Thanks for hanging around. Ladies, we appreciate y'all being here. Thanks for your patience. Representative Dewey McLean, and the WANET delegation is recognized for an order. Thank you, Mr. Speaker. It's 21 members in the house delegation. I guess we are. Come on, baby. Don't get past that line. Thank you, Mr. Speaker. Representative McLean, we're in the two-minute warning and the clock is running. Thank you, Mr. Speaker. Good afternoon, colleagues. The WANET delegation would like to welcome the Gwyneth Chamber of Commerce to the People's House. Hope y'all enjoyed your M&Ms as on your desk because they came from the Chamber. I want to say thank you all very much. WANET Chamber was established in 1947 and today has over 2,000 members, 22,000 businesses, 10,000 sole proprietors, and Gwyneth has nearly 600 international businesses. So today, the Chamber has earned a five-star accreditation from the United States Chamber of Commerce, the highest destination achievable in the Chamber industry. Also on August 1, 2023, the Chamber was awarded the Association of Chamber of Commerce Executive Chamber of the Year designation. The first time the Chamber has received this honor. So I just want you all to know that our Chamber is that way. What I would like to, what we got today with us is, we have the CEO and President Nick Macino is in, of Nick and stand up. We have the Board Chairman, the Neil Levit. There he is, our new Board Chairman. Thank you. This is Jackson M.C., all of y'all Jackson M.C., we have Peek on Georgia, Exxors Company, Kaiser Bermanent Day, Georgia Power Board of Steel, Steel Coal Steel Brothers. And what can I say, they're just the name of you. Thank you all for coming to the People's House. Thank you, Mr. Speaker. And we do have a resolution for you all if y'all will come on down and get a few bit. Thank you, Gwyneth Chamber. We appreciate the good work you do representing the community. And you as well, representatives and representative McLean. Representative Park Cannon is recognized. Thank you, Mr. Speaker. So today I'm excited to announce that the Morehouse School of Medicine Physician Assistant Program is in the building. You will see them in their lovely white coats if you'll stand up. They are headed up by Dr. Pangella Dawson here in the fluffy arms. Fabulous women leading this amazing. It's the newest professional graduate program at Morehouse School of Medicine. It has its accreditation continued status, meaning it has been in compliance. They focus on rural and urban service so they can serve your districts. They focus on workforce diversity and expanded scope of practice. So as they do this work, as you might see, doctors out here doing this work, physician assistants can do almost all of those things. Of course we're working on that, but want to thank you for your patient-centered care. And thank you for Wayne Martin for having you here today. Congratulations. Thank you all. Appreciate it. Yeah. Hey, we appreciate you all. Good luck to have you all here today. We appreciate what you're doing and what you will do for the people of our state. Thank you. Representative John Carson, Chairman Carson is recognized. Folks, I want you to help me welcome the, actually the entire senior class from Fellowship Christian School. It's a school based up in Roswell. I actually, I think it's part of Chairman Martin's district, but it's a wonderful school. It's about 1,300 total. I think the entire senior class is down here. Their high school football team went 10 and 3, lost in the state playoffs to Pierce County. I got to talk to Representative Meeks about that. These are some really smart kids with numerous, numerous scholarships. Will you help me welcome them to the People's House? Fellowship Christian School. Stand up, guys. Over to the left. Thank you, Chairman. Thank you, Mr. Speaker. Good to have you all in the People's House. Sounds like you had a good year. So, congratulations, Stady Hard. That completes our morning orders. Members, we're moving on to the rules, calendar. Mr. Clerk, will you read the caption to HB385? HB385, I'm innocent of Thomas the 21st and others to be entitled to men, title 47, the Fisher go to George Annotated, relating to retirement and pensions, so as to add appropriate references to the United States Space Force. Bill Evernford, the Committee on Retirement, that committee recognizes this bill, do pass. Representative Brad Thomas is recognized to present the bill. Thank you, Mr. Speaker. Today I'm here to present House Bill 385, LC4326228. This bill adds references to the Space Force and other branch reserves to ensure they have the same credible time and service accounted for in the same manner that all the other military, already recognized military services do. With that, I'll yield for questions. Gentlemen, has no questions. Thank you, Mr. Speaker. With that, I yield well and go Navy. No, you may have some now. You've got some probably some negative votes right now. With that comment, but the gentleman's yielded the well. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and Mr. Clerk, will you unlock the machine? Have all members voted? So what that bill means? All members voted? If so, the clerk will lock the machine on the passage of House Bill 385. The yeas were 160. The nays were zero. This bill haven't received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 456? House Bill 456 by Roach, and I'm gunner of the eighth, and I'm lums of the 12th and others to be entitled to amend Article 1 of Chapter 32 of Title 36 of the EFISCO to George Annotator, ruling the General Provisions regarding municipal courts. So it's an increase in term from municipal court judges from one to two years, unless provided for in a municipality's charter. This bill ever referred to the committee on judiciary. That committee recommends a disbilled do pass by committee substitute. Chairman Gunther is recognized to present the bill. Thank you, Mr. Speaker. House Bill 456 gives judges a minimum of two years to serve. Currently, they serve one year or at will, or sometimes they can have contracts for longer than two years. But what this does is it sets the minimum term at two years or more. Depending on what they reach and agreement on. And also if there is a disagreement or an alleged breach of the agreement that they make with the city, there's a provision in here that allows them to get rid of the judge or fire the judge in the way. That's basically what the bill does, and I'll take any questions. Gentlemen, yields for a question. Yes. The lady to your left represent Carter is recognized from the 93rd for a question. Thank you, Mr. Chief. That's the gentleman yield. Are you? With proposing a bill that would tie municipalities into two-year contracts, historically you couldn't bind over another government entity, right? I understand. How will this affect the municipalities' ability to not be tied into a contract if there's a new group of legislators? Council people coming in. I believe that the council members' terms in at least all the cities I have in my district are four years. This is a minimum two-year. And so if they do a two-year, they shouldn't cross over into another. That's the gentleman further yield. You're absolutely correct. But just in the instance in that year that you have a larger number that is turning over, then you're binding a new council. So if you have three leaving a new council company, so is there an opportunity if that contract needs to have one or all municipalities now going to be bound to two-year contracts? I'm sure there's a way that can be worked around that, but this bill itself does not directly deal with what you're asking about. Chairman Collins has a question if the gentleman were yield. Parliamentary inquiry, Mr. Speaker. You may ask a question. I'm sorry. I'm sorry. Is the gentleman yield? Are you? There's been my experiences of not true that a lot of these municipal governments have staggered terms. For instance, the city that I used to be the mayor of, we had two-year terms for council, four-year terms that it was staggered. Every two years there was a majority of the council or the mayor was elected. Is that not true? That's true. Yes. Also, is it not true? In this bill, as you pointed out when you were presenting the bill, that there's also a mechanism to which the city can break that agreement. And part ways with the judge. Is that correct? That is correct. Okay. Thank you for bringing this bill. Yes, sir. Oh, you did a good job. The gentleman, you have no more questions. I yield the well and ask for your favourable consideration. Is there any objections to the previous question being ordered? Chair, has none the previous question is ordered? Is there any objection to adopting the committee's substitute? Chair, has none the committee's substitute is adopted? Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? Chair, has none the report of the committee is agreed to? Shall this bill now pass all in favour of the passage? Of the bill, we'll vote yes, all those opposed. We'll vote no and the clerk will unlock the machine. Thank you. Have all members voted? I hear no. All members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas on House Bill 456. Yeas are 161. The nays are two. The bill having received your requisite constitutional majority is therefore passed. Thank you. Members, we have a conference committee report that we presented. Chairman, reclusey. Okay, representative Gaines has recognized for a motion. Mr. Speaker, I move that the House agree to the committee of conference report on SB 63. Mr. Clerk, will yeary the conference committee report? Committee of conference on Senate bill 63 recommends both the Senate and the House of Representatives received from their positions and that the attached committee of conference substitute to SB 63 be adopted. Respectfully submitted for the Senate, Senator Randy Robertson, the 29th Senator John Kennedy, the 18th Senator Steve Guch, the 51st for the House of Representatives, represent an abstraction of 104th representative Collins, the 71st representative Gaines of the 120th. Chair recognizes representative Gaines to explain, please, the Committee of conference report on SB 63, representative Gaines. Thank you, Mr. Speaker. As Speaker mentioned, we have before us the conference committee report on SB 63 legislation that will protect public safety in our state. On sunny day last year, we had many parts of this legislation before us, and we had a vigorous debate at that time. So I won't belabor the point in the details as bodies already considered. But to refresh everybody's memory, this legislation will make it clear that Georgia is not going down the path of failure seen by other states and communities that have eliminated cash bail. It's been an unmitigated disaster. You probably seen the headlines just this week of migrants in New York who attacked NYPD officers, let out without bail. Now those migrants are reportedly headed to the border and an attempt to flee. It's abhorrent and unacceptable. Fortunately, Georgia law would have already required those individuals to post bail. But today we have a number of offenses where you have real victims involved and no requirement for bail. SB 63 will address that issue by adding a number of offenses to require bail. I've been reading some commentary about this bill, how their low level offenses, particularly I keep reading about marijuana. This bill does not require bail for misdemeanor marijuana. It's only for felony marijuana, which includes the intent to distribute. Some of the other offenses in this bill include obstruction of a law enforcement officer, battery theft, trafficking of persons for labor, sexual servitude, and domestic terrorism. SB 63 does not set a mandatory minimum amount of bail required. Judges will continue to have that discretion. There are countless examples across the state of very low bail amounts. I've seen examples of $1. The difference between unsecured judicial release and secure judicial release are bond is very significant. In Fulton County for example, there is a 30% failure to appear rate over the last five years on unsecured judicial release cases. 30% of criminals not showing back up in court, whereas in cases of secure judicial release, we're talking about 3 to 5%. These are real criminals not showing back up for court and staying on the streets. Ultimately, this legislation is about addressing repeat offenders, and it's about respecting our law enforcement officers. We've heard from countless officers that go out every day and do their job arrest criminals, and then as soon as they get to jail, they're checking right back out. I'll share an example of where this legislation would have made a real difference to protect public safety. In April of 21st, 2022 in Fulton County, Jerome Peters was arrested on five charges, including possession of tools for a commission of a crime, reckless driving, and criminal trespass. Each of these offenses are listed in SB 63. A judge issued him an unsecured judicial release on these charges, and he failed to appear when due back in court. Fast forward to November 6, 2023, Jerome Peters was in a vehicle that fled police and crashed into Atlanta Public Schools bus carrying students from Fickett Elementary School. Peters then fired a handgun at state troopers several times before he was eventually apprehended. This is just one case that highlights criminals being released on the offenses in this legislation failed to appear for court and then move on to more dangerous and violent crimes. There are many other examples I could present, but again, we've already debated this issue and I won't belabor the point. There are two other components of SB 63 I want to highlight. The first is addressing unaccountable bail funds that are releasing violent criminals on our streets and covering 100% of bail with cash bonds. We've seen these bail funds across the country, an example is here in Atlanta with the domestic terrorism we've seen at the site of the New Atlanta Public Safety Training Center. In fact, the Atlanta Solidarity Fund, which has been used to release the individuals who've committed these crimes, is under indictment from the Attorney General for Charity Fraud. What SB 63 does is limit bail funds and other entities to three cash bonds per year. Once they reach that threshold...\n\nI show these groups need to register properly as a bondsman. This doesn't prevent a bail fund from operating. In fact, they could bail out as many folks as they want, but they need to do so under the same rules and regulations as bondsman. The final component I want to highlight is what this legislation will do to keep illegal aliens who commit crimes in our state behind bars. Thanks to Chairman Jesse Petrie in particular, for his work and leadership on this. Under current law, a bail bondsman is not held liable for an illegal alien. If they are deported or removed in the country, SB 63 will keep the bail bondsman responsible for these individuals. The result will mean violent criminal illegal aliens will remain behind bars instead of being released by bondsman. As we continue to see folks pour across our southern border or strengthening our state laws against criminal illegal aliens. Mr. Speaker, that's a summary of SB 63. I know you've been very generous to provide the minority party time to speak when it's not required. So I'll allow them to do so and yield the well asked for this body's favorable consideration of SB 63. The gentleman has yielded the well. Representative Gaines is correct after conversation with minority leader, the minority whip. We're going to make an exception. We typically don't have a conversation and information on a conference committee report, but I'm going to make an exception today. I want both sides of you to be heard. The speakers that are signed up will have a total of 13 minutes, my favorite number. There will be two minutes representing Willis, two minutes for Representative Kennedy and two minutes for Representative Derek Jackson and Representative Miller will have the remainder. So I caution the members when the light goes off and we'll keep the time. It will be subtracted from the final speaker. So honor the final speaker, Representative Tanya Miller. So I hope you all stay within the time limits. At this time, I will recognize Rep. Inga Willis for to speak in opposition to adopting the committee report. Representative. Thank you, Mr. Speaker. Good afternoon, colleagues. Arise today in opposition again to Senate Bill 63. Give me your tired, your poor, your huddled masses, yearning to breathe free. Words from the new colossus inscribed at the base of the Statue of Liberty, who was symbolically blindfolded because justice is blind, unbiased, and should not be based upon a person's appearance nor other outside influences. She holds scales representing the weighing of evidence on its own merits. There is also a snake at her feet representing evil. Today, juxtaposes the justice system we have versus the one we promised. Exacerating issues for the poor is not biblical, civil, nor is it humane. Proverbs 1431 says he, who oppresses the poor, shows utter contempt for his maker, but whoever is kind honors God. Today's stance on SB 63 will record our individual stances and our stances estate with regard to our poor citizens. I'll leave you with this. When we think of what is most expensive to become and be in Georgia, we may think a lawyer, we may think a doctor, or even a legislator with the sacrifices that each of us make. You're wrong. The most expensive thing you can be in Georgia is poor. Mr. Speaker, I yield back to well. Thank you, Representative. The lady has yielded back to well, Representative Cannon. Recognized for up to two minutes, Representative Cannon. Thank you, Mr. Speaker. I oppose SB 63. There are a significant number of Georgians sitting in our county jails and state prisons right now for one reason. They have no money. They are poor. Most of the folks behind bars in Georgia are poor, and we're convicted for low-level nonviolent offenses. When you're poor, you cannot afford your own representation. Your only option is a public defender. There are some good public defenders. We just don't have enough. And too many poor men and women fall through the cracks and inevitably get hammered by our criminal system. With proper representation, there are a lot of poor incarcerated Georgians who would not have been convicted at all. And most of the rest would not have received as harsh of a sentence. Money and the lack thereof biases are justice outcomes. I know this because of my professional experience working with the homeless. In the program I oversee, a typical client has a mental health diagnosis, a subsequent substance use disorder, and a felony background. Oh, and one more thing, they're homeless to their poor. It's telling how much intersection these conditions have, mental illness, substance use, poverty, and a criminal record. Where I have spent a lot of my time as the director is leveraging my position as a state representative to pull our clients up out of the criminal justice quicksand. I'm in court almost weekly advocating for someone to come to our program in lieu of incarceration because their convictions were directly related to mental health, substance, and poverty. I'm constantly contacting probation officers from all over Georgia because of bench warrants issued for a failure to appear. I'm explaining that why they failed to appear is because they were homeless, they had no stable address to receive the notice of their court date. These folks are often faced with hefty, monetary fines. So I negotiate working community service hours instead of the fine that's impossible for them to pay. The good news is my efforts work, judges accept my recommendations for program placement, warrants are quashed, and court dates reset, and community service hours are accepted. This is one of the superpowers that I have possessed as a state rep that I've really enjoyed. I've helped a lot of people get untangled from this system during my three terms. But if the poor did not have an advocate with some pool to stand up for them, they will be crushed by this state's criminal system. SB 63 continues this crushing. SB 63 picks on the poor. Please vote no. Thank you. Jim, as you know, the well-represented Derek Jackson has recognized for up to two minutes to speak to the report. Thank you, Mr. Speaker. Colleagues, I rise to oppose Senate Bill 63. While I was reading this 17 page bill, I kept asking the question, what is it that Senate Bill 63 is trying to fix? But then it was crystallized when the sponsor was asked what would happen when individuals are forced to remain in custody. Pendentryl, because they are too poor to afford a bond, the sponsor said, I quote, community groups could put money together. That's interesting, because there's an irony here, because the text of this bill says it would be criminalized. I invite you to go to section four, line number 192. No more than three cash bonds may be posted per year by any individual, corporation, organization, charity, nonprofit, corporation, or group in any jurisdiction. That sounds like to me that we can possibly criminalize churches who are raised money to get their member out of jail. On line number 194, every individual corporation, organization, charity, nonprofit, corporation, and here's the other key point, colleagues, listen clearly. Any personal entity who violates any part of this paragraph will be guilty of a misdemeanor. This bill will force judges to set bail even in cases where defendants would otherwise would have been released. Some of us in here have been released. Elected officials, off duty law enforcement, lawyers, military veterans, because they realize a day in jail could cost them their job. But that I yield the well. Good afternoon, colleagues. I rise today again to speak in opposition to Senate Bill 63, a bill that if enacted would undermine the historic bipartisan justice, criminal justice reform efforts led by former Governor Nathan Deel and place in jeopardy, Georgia's role as a national leader in evidence-based criminal justice reform measures that both help reduce the burgeoning cost of our criminal justice system and make our neighborhood safer. It serves as a reminder that between 2011 and 2018 together, Republicans and Democrats implemented an array of criminal justice measures, including accountability courts, and yes, cash bail reforms. We already did this, y'all. These reforms were designed to contribute to public safety by helping people turn their lives around and not recidivate, so that they can become contributing members to their communities and not simply more experienced criminals. In 2018 led by Governor Deel, the Georgia legislature unanimously, unanimously, passed reforms that trusted judges to release people accused of misdemeanor and other low-level offenses without posting cash bond. If it's appropriate, if it's appropriate, when someone in his own party told Governor Deel that this was not a quote-republican issue, he said, perhaps it's not, but it's the right thing to do, and he was right. Today, it is my hope that this chamber will also do the right thing and reject Senate Bill 63. Now, the Council on Criminal Justice Reform from 2017 to 2018, led by Chief Justice Box, reviewed the issue surrounding pretrial justice in Georgia, with these goals in mind, maximized public safety, minimized pretrial appearances, and maximized personal liberties. I submit to you that these three standards sought to guide us in our actions, and they should guide us in our actions today as well. The Council conducted an extensive analysis of the issue of pretrial detention and cash bail, including a legal review of legislative reforms, pending litigation around the country, as well as a review of current practices in Georgia. Available articles, case-long research, they heard from a wide range of groups, including the Southern Center for Human Rights, the Georgia Association of Professional Bondsmen, Georgia Municipal Association, and the Georgia Association of Chiefs of Police. They did their homework, and before we cast their work aside, we should be poised to do ours as well. Just five short years ago, this committee was diligent and thorough in their work, noting that when it comes to meaningful criminal justice reform, the issues of pretrial justice, pretrial justice, are a paramount importance. For good reason, pretrial detention is expensive, it can be ineffective, and it can exacerbate Georgia's two-tier criminal justice system. Let's talk about the research and the data. First, from a public safety perspective, pretrial incarceration does not make us safer. This is a data. In fact, more time, excuse me, in fact, a more time in accused person, by the way, not a convicted person, an accused person who has the presumption of innocence, the more time that they spend in pretrial detention, the more likely they are to reoffend. Research shows that spending more than seven days in pretrial detention increases the probability of a new arrest, and a new arrest for a violent crime. One Kentucky study, evaluating a 150,000 defendants, found that people held in jail for just two to three days after arrests were 39 percent more likely to be arrested on a new charge. While the first charge was pending, two to three days, and that's in a criminal justice report. That is what informed our criminal justice reform in 2018. Second, the findings, based on a year of study of evidence and data, requiring cash bail before an initial court proceeding, which this bill does, can result in extended detention for those who simply can't afford it. We've talked about the criminalization of poverty. This bill would require incarceration for many offenses that once the person is fully vetted through due process, if they are convicted, they would not even receive incarceration for. We're asked to do this based on what? There is no evidence that expanding the application of pass bail and substituting the judgment of lawmakers without informed evidence, without a thorough vetting, will make us safer. My colleagues, I could talk longer. I thank the speaker for allowing me this time. I ask if you oppose Senate Bill 63 and work with us together to an abhypheartisan fashion, formulate evidence-based measures and procedures that will make us all safer. And lastly, what is most scary about this bill is the criminalization of churches and religious institutions that have historically been on the front lines of social justice and civil rights justice for black and brown people in this country. I do not believe that it is appropriate today or any day to tell parishioners and people of faith who pool their money together, who want to bail mothers out on Mother's Day, who want to bail fathers out on Father's Day, who want to bail children out on Christmassy that this body believes that they should be charged as criminals unless they go through the process of becoming bail bondsmen. And if I were you, I would carefully look at that subsection. Because who is not included in that are bail bondsmen. Excuse me, excluded from that are bail bondsmen. reread it. Why wouldn't a bail bondsman also not be allowed to bail out more than three people if you look at the language? That's what we do as legislators. Perhaps this is a result of the hasty, private, not public committee conference procedure that yielded that bail front provision. I submit to you, send back Senate Bill 63. Thank you, Mr. Speaker. My time is up by you, the well. The lady has yielded the well. We've had representatives explain this from both the pro and the cons side of the issue. On the adoption of the conference report on SB 63, all those in favor the adoption of the conference committee report were vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. All members voted. If so, the clerk will lock the machines. On the adoption of the conference committee report SB 63, the yeas are 95, the nays are 67, and the committee of conference report is adopted. Mr. Clerk, will you read the caption to SB 876? Possible, 876 by Representative Williams, into the 112th and others to be entitled to a men title 710 and 53, the fish go to George Anatated relating to banking and finance, commerce and trade, wills and trusts, and administration of the states. Ms. Bill, I'm referred to the committee on banks and banking. That committee recommends that this bill do pass. Chairman Bruce Wims has recognized to present HB 876. Thank you, Mr. Speaker. Members of the general of the House of Representatives, I bring for you today the Department of Banking and Finance's annual housekeeping bill. You know, for the last 10 years, this body has passed legislation. It's brought George a modernized George's banking and financial services code to the point where the envy of the nation and one good example of why we are is we've attracted so many financial technology companies to specifically the line of error. We're up to over 200 thin tech companies and that's not the only reason, it's because not the only reason they're here, but it's one of the big reasons they're here. So this bill, annual housekeeping bill, does impact banks, credit unions, merchants, merchants to acquire limited-purpose banks, installment lenders, and residential mortgage lenders, but it's come with no opposition in the full support and approval of the Georgia Bankers Association, the Community Bankers Association, the League of Southeastern Credit Unions, mortgage bankers association of Georgia, the George Financial Services Association, and Georgia installment lenders association. There's been no opposition of the measures that we have in this bill this year, so if there are no questions, I'll ask for your favourable consideration. If there are no questions, Mr. Speaker, I'll yield the well. You predicted the future, there are no questions. General Azul to the well, is there any objection to the previous question being ordered? Chair Hesnon, the previous question is ordered, is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? Chair Hesnon, the report of the committee is agreed to. Shall this bill now pass, all in favour of the passage of the bill? We'll vote yes, all those opposed will vote no, and the clerk will unlock the machine. Have all members voted? We got you, Mr. Chairman. The clerk will lock the machine on the passage of House Bill 876, the yeas are 164, the nays are zero. This bill, having received the requisite Constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to HB992, House Bill 992? House Bill 992, by the represent of Blackman in the 146, battle over the 147th and others to be entitled to amend Code Section 1562. The official code of George Anitetti will link the number of judges and spirit courts since the Rev. 4th judge, the spirit courts of the Houston Judicial Circuit, this bill ever further, the committee on Judiciary, that committee recommends this bill do pass. Chair recognizes, Chairman Blackman to talk about the Houston County Superior Courts down there. The gentleman is recognised. Thank you, Mr. Speaker, fellow colleagues, who bring before you House Bill 992, which provides for an additional judge in the Houston Circuit, per the recommendation of the Judicial Council. It's actually rated the second highest workload by the Judicial Workload Assessment Committee. I'd be happy to try to answer any questions if there are any, Mr. Speaker. The gentleman from the Houston County doesn't have any questions. Well, thank you. I ask for your favourable consideration and yield the well. Thank you, Mr. Speaker. The gentleman is yielded well. Is there any objections to the previous question being ordered? Chair, has none of the previous question is ordered? Is there any objections or agreeing to the report of the committee, which was favourable to the passage of the bill? Chair, has none of the report of the committee is agreed to. Shall this bill now pass all in favour of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted. Take your time. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 992. The yeas are 161, the nays are zero. The bill having received a requisite constitutional majority is therefore passed. We have a couple more further actions today. And we'll take up. Chair recognizes a representative gamble for a motion. Representative Gamble. Thank you, Mr. Speaker. I make a motion that we agree to the Senate substitute of House Bill 130. Mr. Clerk, will you read the caption? House Bill 130, by the rest of the gamble with 15th Collins, the 71st, the 161st, be entitled back to amendment 3 of Article 7 of Chapter 3 of Title 20. I think this goes to George Antiteraling, the Georgia student finance authority. Representative Gamble is recognized to explain the Senate substitute to House Bill 130. Thank you, Mr. Speaker. Members, I have before you House Bill 130, again, we voted on this last year. And this was one of the pieces of legislation that is a part of Governor Kim's package that deals with service loan repayment for law enforcement officers. We did not get this through the Senate on the last day last year. So it's back for consideration now with one small change. And that is we have changed the date of eligibility to January 1 of 2024 as opposed to January 1 of 2023 because of the year delay in passing this bill. So that is the only change to this bill. And with that, Mr. Speaker, I'm happy to answer any questions. You explained it very well. You don't have any questions. Thank you, Mr. Speaker. I ask for your consideration and I yield the will. On the gentleman's motion that the House agreed to the Senate substitute to House Bill 130, 130. All those in favourable vote? Yes, those opposed will vote no way, Mr. Clerk, where you unlock the machines. Have all members voted? If so, Mr. Clerk, where you lock the machines, on the gentleman's motion that the House agreed to the Senate substitute, the House Bill 130, the A's are 161, the NA's are 0. And the House has agreed to the Senate substitute to House Bill 130. Now, on this next one, the House has been asked to agree to the Senate amendments as two of them to House Bill 318. To recognize this representative Hilton for a motion. Thank you, Mr. Speaker. I'd like to make a motion to agree to House Bill 318 as amended by the Senate. Representative Hilton moves at the House agreed to the Senate substitute to amend House Bill 318 with amendments. The clerk will read the caption. House Bill 318 members in the bill. The 48th and others will be titled an act to amend Chapter 2, the title 20. The official go to Georgia annotated ruling the elementary and secondary education, so it's to provide for the reestablishment of the offers of charter school compliance. The representative Hilton is recognized to explain the Senate amendments for the Senate Hilton. Thank you, Mr. Speaker. House Bill 318, the underlying bill passed this chamber with an overwhelming majority last session. It was received two amendments on the Senate side. One from Chairman Dixon, which was a bill sponsored here by Representative Fleming, which passed nearly unanimously, dealing with changing the verbiage to guaranteed energy savings performance contracts throughout code. The second amendment sponsored by Senator Ann Vittartet was a chairman Corbett's dealing with school system eligibility for capital outlay grants and the timing of that and when folks would receive those. Would that Mr. Speaker outwelled for questions? You have no questions. Thank you, Mr. Speaker. General Masjord of the will, on the General's motion that the House agree to the Senate amendments to House Bill 318. All those in favor will vote yes, those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine. All in the General's motion that the House agreed to the Senate amendments to House Bill 318. The yeas are 147. The nays of 10 in the House has agreed to the Senate amendments to House Bill 318. Thank you, members of the House for your attention.\n\nTo the issues we had before is the clerk will read the caption to a group of privileged resolutions. Honoring the life and memory of Randy K. Riggs, honoring the life and memory of Sarah Lynn McFarler. Recognizing February is National Cancer Prevention Month and commending Dr. Jandria Jan Jackson. Recognizing February is National Cancer Prevention Month and commending Dr. McKeter Wright. Commending the Georgia Social and Realtors in recognizing February 2024 is Realtors Day at the State Capitol. Commending and congratulating Frederick Allen Fred Harris. Recognizing and commending the statewide independent living council of Georgia. Recognizing February 6, 2024 is a therapy day at the State Capitol. Recognizing commending members of the Coutusa County Public School, Superintendent Student Advisory Council. Recognizing commending family and consumer sciences. Congratulations the University of Georgia women's soccer team for an outstanding 2023 season. Recognizing commending pastor Dwight Boone. And congratulating him on the occasion of his 17th pastoral anniversary commending. Monie Presley, Columbia Elementary School's 2022-2023 teacher of the year. Recognizing commending Del Marlosell land on being named the Gilmer County citizen of the year. Recognizing commending the national conference of state legislators on its 50th anniversary. Recognizing commending Graystone power corporation for outstanding service to his members. Recognizing celebrating perimeter college at Georgia State University on the grand occasion of its 60th anniversary. Recognizing February 11th through 17th 2024 is future business leaders of America week. And Georgia recognizing March 7th, 2024 is national vending day. The State Capitol. Commending the restaurant industry of Georgia in recognizing February 21st, 2024 is state restaurant day at the State Capitol. Recognizing commending Mr. Rechard Snowlings. Recognizing February 5th, 2024 is black business expansion day. And for other purposes that completes the reading of the privilege resolutions. Recognizing February 5th, 2024 is the national conference of state legislators on its 50th anniversary. Recognizing February 5th, 2024 is the national conference of state legislators on its 50th anniversary. And for other purposes that have been named the privilege resolutions, is there any objection to adopting the privilege resolutions? Chair, here's done the resolutions are adopted. We're going to move on to afternoon order. Representative Kennedy has recognized for an afternoon order. Let's see. One give you all about three minutes. Can you get it done in three minutes, sir? Thank you. Thank you, Mr. Speaker. As I've said before, I was raised in a classical Pentecostal church. I was raised in my grandfather's church who was a assembly of God pastor, pastor, stone mountain, the assembly of God. I was raised in that church till I was 16 years old. In our church, we observed a watch night service. This is a service where you go to church at the end of the day on December 31st, spend a couple hours and you bring in the new year in the House of God. My grandfather always included footwashing in that watch night service. So towards the end of the night towards midnight, mid on one side, the women on another side. We watched feet. And as my grandfather said, we're washing out the old and we're washing in the new. This is a black history moment because the origins of the watch night service, such as African Americans. In September of 1862, President Lincoln signed the Emancipation Proclamation, but it wasn't enacted till January 1 of 1863. So African men and women who were in slavery, anticipating they freedom. So they went to their praise houses, their churches, wherever they could congregate and spent the last few hours of December 31st. And then they brought in the new year and the new freedom. It was also called Freedom's Eve. This is your moment in black history. Thank you. Representative Buckner has recognized for and after the Lord of the Earth. Representative Angela Moore, you'll be next. You're on deck. That means you're the next speaker, the next hitter. Thank you, Mr. Speaker. I think you may have noticed that today is Girl Scout Day at the Capitol. If not, I have serious concerns about your vision, your powers of observation and other things. But what I wanted to say different is that in the state of Georgia, we have 41,000 girls involved in scouting. And we are excited that at least half of them were here today. What I also want to say is that many of the women in this chamber are Girl Scouts or were Girl Scouts. And the leadership skills that we learned are what they are continuing to teach the young girls across the state. And by doing that, some day, many of the 10,000 girls that have reached the level of gold scout, which is comparable to the Eagle Scout and the Boy Scout System. Look at them. Come forward if you're a Girl Scout. It's equal to the Eagle Scout. It is involved the same kinds of goals and objectives. And it's very good at putting projects and programs together for sustainability in their community and unique programs. The final thing point I wanted to make is that if you didn't open your card and find it, I want to point out to you that they have issued an invitation to us to visit one of the three camps that are situated across the state. And one of them is called Camp Misty Mountain. One of them is Camp Timber Ridge. And my favorite is Camp Maryweather, because it's in my district in Maryweather County. So take them up on that opportunity to go and visit and see the camps, see what they are doing in the way of training our girls so that they have great leadership skills to come up here and take our place one day. Thank you, Mr. Speaker. Happy Girl Scout Day. Excellent afternoon order. What a great organization the Girl Scouts are. I think they were founded down in a place on the coast where they're not. Savannah, Georgia, no doubt. Representative Angela Moore, members you need to give the representative your attention right now. Good afternoon, everyone. I just wanted to make the announcement. I'm sure many of you all have heard that legendary singer, country singer Toby Keith passed away yesterday. He had stomach cancer and I think you all know how I feel about the cancer, the big C word. A lot of people didn't realize that Mr. Keith performed for Republican and Democratic presidents. And it honored they were he was honored with the national medal of arts. I was so proud. He leaves behind a wife, three children and four grandchildren. He may not have been a resident of Georgia, but he has certainly generated millions and millions of dollars into the state of Georgia. And he was smart enough. I'm sorry. He was smart enough to have an entertainment publicist me right here in the state of Georgia. I'm really sad. And I wanted to just try to repeat one of my favorite lyrics from Toby. It's called I Want to Talk About Me. We talk about your friends and the places you've been. We talk about your skin and the devils on your chin. Your polished toes and the runs in your holes. And God knows we're going to talk about your clothes. You know talking about you makes me smile. But occasionally I want to talk about me. I want to talk about me. I want to talk about I want to talk about number one. I want to talk about me. I want to talk about me. So Toby today in House of Representatives in Georgia, we are talking about you. Number one. God bless you. Thank you. Thank you, Representative. Thank you, members. Prayers for his family, Toby Keith was a great talent. He will be missed. Representative Kendrick recognized for an afternoon order. Give the lady in the well. Your attention. Thank you, Mr. Speaker. Good morning colleagues. Today I rise to thank three groups of people. First, I want to thank the Biden administration. The second, Mr. Donald Cronin, who is our HR director here in the House. And for the constituents of the 95th House District, they have sent me back for 14 years. If you have student loans, you're going to want to hear this story. If you have student loans, you're going to want to hear this story. So in 2022, I was having a conversation with Mr. Cronin down at Byiniel. And he said that we could get student loan forgiveness. And I did not realize as a legislator that I qualified. Long story short, we went back and forth with the Department of Education, filling out forms. And December of 2023, right when my pastor got down from preaching as pastor of the day, I received a notification that $180,000 of my student loans had been forgiven under the public student loan forgiveness program for the four degrees that I have. Statistically, we have about 3.7 million Americans that have about $136 billion in student loan debt that have been forgiven so far. And I do not want to be the only American. It is a burden on so many people that look like me, so many of our generation. And it is one of the biggest drivers of the wealth gap here in the state of Georgia and the nation. So if you have student loans and you have served longer than 10 years, I am willing to have that discussion with you until you, my process for going through that. But you have to actually believe in student loan forgiveness. So for those of you that actually believe in student loan forgiveness, I am more than willing to help you. But if you do not, you probably do not want to come speak to me because I do not want to enable hypocrisy. So if you have student loan forgiveness and would like to speak with me about that process, I'm more than willing to help you with that. So thank you to the Biden administration, to my constituents, and to Mr. Donald Cronin, who is our HR director. And thank you for letting me share my story at Yolkwill. Chairman Weedauer, you got a little scarf there. I like it. Chairman Weedauer has recognized for- Thank you, Mr. Speaker. And afternoon order. I rise today to celebrate another momentous step on the road to FIFA Cup 2026. In June of 2022, Atlanta, Georgia was selected among 16 other North American cities to be a host city for FIFA World Cup in 2026. And we've eagerly awaited the announcement of which matches we will host. I'm excited to share with you this Sunday afternoon FIFA announced that Atlanta will host eight FIFA World Cup matches, including five group matches, a knockout round match, a round of 16, and the highly coveted semi-final match. Atlanta will host the second most matches out of all the 16 host cities. So what does that mean for Georgia and Georgia's in 2026? The first match set for June 15th in the semi-final match set for July 15th. You'll see the dates up on the board here. That length of the tournament, Atlanta will feel more like the 96 Olympics than a final four. Each match will have the feeling, the pageantry, and anticipation of a Super Bowl. And with eight matches over a month of activity, the economic impact of hosting the FIFA World Cup is estimated to be between $450,000 and $500 million for the state of Georgia. So over 96,000 hotel rooms in the Metro Atlanta region that we filled with national and international visitors. Restaurants, bars, stores, entertainment venues, and cities will see fans, visitors, media, and dignitaries from across the world. Fans and ticket holders will have an opportunity to experience world-class venue that is Mercedes Ben Stadium and experience the Southern hospitality Georgia and Georgians are known for. I'd like to also personally congratulate FIFA World Cup host committee led by Atlanta Sports Council and Dan Corso, the team with Metro Atlanta Chamber, Arthur M. Blank, Sports, and Entertainment. Atlanta visitors and convention bureau, the World Congress Center, Authority, Governor Brian Kent, Mayor Andre Dickens, and many, many others. Through a public pirate partnership led, the United VIDE for Atlanta. The World Cup host committee eagerly looks forward to hosting the world-class event for all Georgians, national, international visitors. As we sit here today, two and a half years away from the opening of FIFA World Cup, the excitement and buzz for this event already is ringing through our holes. And I'm looking forward to it. Please join me in celebrating what is truly a win for Georgia. This past Sunday as we prepare to host FIFA World Cup. Thank you, Mr. Speaker. Mr. Chairman, that's a big deal. We have soccer as a big deal all over our state. From the young to the older, I have a great soccer team down in Staceboro. Mr. Derek Coach of the Daring Venn Tassel has to mentor USA and they do a great job. Planned soccer. We have some announcements. We want to... Chairman Corbett is recognized for an announcement. Thank you, Mr. Speaker. Members on your desk, a little piece of wood. Remember, wood is good. We've got an invitation for you for a forestry day at the Capitol today, January, February the 6th. They'll be at the depot this afternoon from 5 to 7. Somebody come down and join us and in the more words of our former colleague Chad Nimmer if you like clean air, clean water and soft toilet paper. Come thank you for our store. Best forestry state in the country, right, Mr. Chairman? No doubt. Chairman Tarvin is recognized for an announcement. Thank you, Mr. Speaker. Insurance committee, subcommittee on property and casualty will meet upon the adjournment 515 CLEB. 515 CLEB, we have two bills. Thank you, Mr. Chairman. Chair Lady Camp, recognized for an announcement. Thank you, Mr. Speaker. The Intergovernmental Coordination Committee will be meeting today at 4 p.m. and room 403. Thank you. Thank you. Chair Lady Cooper, recognized for an announcement. Thank you, Mr. Speaker. The Health and Public Health Committee will meet as soon as we adjourn. We will meet in 606 L.O.B. the Public Health Committee. So please, let's get over there and we have a few bills and I'll get you out as soon as possible. Thank you, Mr. Speaker, I yield well. Thank you, Chair Lady Chairman, Dubnik, recognized for an announcement. Thank you, Mr. Speaker. The Alcohol and Tobacco Subcommittee of Regulated Industries will meet in 506 right now. There will be a cash prize for the first attendee. I'm on the way. Chair Lady of Ballinger, y'all stay here. I'm here to live with you. Chair Lady Ballinger, recognized for an announcement. Thank you, Mr. Speaker. The Health Committee on Rules will be meeting tomorrow morning at 9 and room 341. There are several people who need to present their bills. So we look forward to seeing everybody there tomorrow morning at 9 o'clock. Thank you. Thank you, Chair Lady. Chairman Chokus, recognized for an announcement. Thank you, Mr. Speaker. I wanted to get here. Our normal time for small business development, we're not going to meet tomorrow at 8 a.m. We're going to meet tomorrow at 3 p.m. So I didn't want anybody to be in our normal room. Our small business development committee will meet tomorrow afternoon 3 p.m. in Capitol 403. I just wanted to make sure everybody knew. Thank you very much. Thank you, Mr. Speaker. Senator Kimp, you're going to recognize and go back in. Good as straight. Chair Lady Kimp. Thank you, Mr. Speaker. I'm sorry. Apparently I need a snack. We are meeting in room 341. I believe I said the wrong room number earlier. So 4 p.m. And our governmental coordination room 341. Thank you. Yeah, I think you said 341. I didn't know you could ever make a mistake. Representative Anderson is recognized for an announcement. Mr. Speaker, the governmental affairs subcommittee on state and local government will meet upon a journey in 415. And then the subcommittee on elections will meet immediately following that meeting in room CLOB 415. Thank you. Thank you, sir. Chair in Lomston, recognize for an announcement. Thank you, Mr. Speaker. The full house insurance committee will meet in the morning 8 a.m. CLOB 406. Thank you. Representative Tray Kelly is recognized for an announcement. Thank you, Mr. Speaker. The energy utilities and telecommunications committee will meet 10 minutes upon a journey in Capitol 403. I look forward to seeing the committee members and anybody else who just wants to see the fun we have. Thank you, Mr. Speaker. We have one more announcement. I would like to make an announcement. I want to thank you all that attended the Effingham event last night. I got to speak to many of you. We appreciate the local folks. Appreciate it. Y'all being there. Chairman Hitchens and I both appreciate that. So thank y'all for coming and joining us. It's important that we show up when local folks come up. They appreciate it. So y'all know you appreciate it. That concludes our announcement. We have a birthday. And I think you left a little early to go separate to celebrate his 39th birthday for the, I don't know how many times, but anyway, Representative Ken Vance has a birthday today. So we will wish him happy birthday and do it personally tomorrow on his birthday. A little belated. We have pages today. Members, if you have pages, join us up front for a photo. So thank you for your attention today. The Housemajority Leader is recognized at this time for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Wednesday, February 7, 2024. We have a riveting presentation tomorrow. The state of the judiciary is tomorrow. Is that not right, Mr. Leader? It's all, I mean, it's pretty good. So judiciary, and I think Chairman Hatchett, Chairman Hatchett, you have the budget on the floor tomorrow. We have some important issues to take up tomorrow. So I encourage all of y'all to be here, be here on time. On the motion of the majority leader, this, this house, house stand adjourned until 10 a.m. Wednesday, February 7, 2024. All those in favor will say aye. All those opposed will say no. Oh, the I was clearly ahead of it. We won. We're adjourned.\n\n",
  "updated_at": "2026-02-13T21:50:20.486139+00:00"
}