{
  "video_id": "IxNga3CV4Jw",
  "url": "https://www.youtube.com/watch?v=IxNga3CV4Jw",
  "title": "1/11/2024 Senate Committee on Public Safety",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 35,
  "summary": "Here is a summary of the Georgia 1/11/2024 Senate Committee on Public Safety session:\n\n**Overview**: This was a routine committee meeting where the chair reviewed committee procedures and operations. The committee discussed several bills that had been referred back to the committee after failing to advance in the previous session.\n\n**Key Actions**:\n- **HB120**: Relating to cameras in school zones (bill referred back to committee)\n- **HB142**: Relating to booting for cars (bill referred back to committee) \n- **HB301**: Relating to limiting certain activities in school zones (bill referred back to committee)\n- **SB277**: Relating to watercraft, education, and law enforcement accreditation (bill referred back to committee)\n- **SB344**: Relating to non-lethal use of tasers (bill referred back to committee)\n\n**Bills Introduced (First Reading)**: None\n\n**Notable Moments**:\n- The chair thanked the committee staff for their work, including legislative assistant Allison Bailey and intern Brooke Partridge.\n- The chair reviewed committee procedures, including publication of agendas, handling of amendments, and the need for bill authors to request a hearing.\n- An overview of the committee's jurisdiction and key public safety issues was provided by the policy analyst Austin Bryson.\n\n**Votes**: No votes taken.\n\n**Attendance**: Quorum present, no attendance issues noted.\n\n**Adjournment**: The meeting adjourned with the next committee meeting scheduled for the following Wednesday.",
  "transcript": "you you grant us wisdom and discernment as we go about this meeting Lord and we thank you\nfor all the many blessings you bestow upon us and Jesus' name we pray amen amen thank you\ncommittee members for being here today as well as everybody who is seated in the room want to take\na special moment to thank all the staff here that has helped us out from all the different groups\nand specifically Miss Allison Bailey who has only been with us a few months now and she is\nis legislative assistant for this committee.\nAnd then we also have Ms. Brooke Partridge back there.\nShe is interning with us, so we're excited.\nAnd we've also got Jack back here,\nwho's on to keep everybody straight,\nsupporting Senator Robertson.\nWe give him an extra prayer every night.\nSo we're gonna talk about a few things today.\nAnd the first thing I want to review really quickly\nis we have Senate rules which for the committee,\nwhich normally would be in our folders,\nwe're gonna get those up back in there.\nBut I wanna remind everybody that this is a very active committee.\nWe have a lot of bills that come through\nand we're gonna try and do is not jam pack everything to the end.\nI think the lieutenant governor has made it clear\nthat we should start moving some things earlier,\nbut would rather do one or two bills in a meeting\nrather than trying to do nine in a meeting.\nIt's a lot of overwhelming work.\nWe're also gonna do our very best\nto get the agenda published the day before,\nto give first and foremost our committee members\nthe opportunity to look through those,\nbut also for the public and everyone else here.\nI can't always promise you that will happen\nbecause sometimes a specific circumstance will arise,\nbut that will be our intent and Allison\nwill be the person will be working on that agenda\nputting it together.\nCertainly those bills should be online.\nIf for some reason we have an amendment\nor a committee substitute to that,\nWe will try to have those available in our office,\nwhich is 421, as most people know, right outside here,\nthat you could pick up a copy of that\nif we don't already have that published online.\nWe'll also do our best to have electronic copies\nas well to email.\nNext thing is when we do have amendments,\nwhich we will have at different times,\nif it is a minor amendment, it's a word change\nor a day change, et cetera, doing those I'll call it\non the fly are very reasonable acceptable.\nIf it's a big material, change the bills, though.\nAnd you want to bring it in amendment.\nI'm going to need that brought to me 24 hours in advance\nso we can sure we've vetted that out.\nAnd that'll be something that I'll work on.\nI'll certainly ask our vice chairman, Senator Robertson,\nto help, and specifically also legislative counsel, who\nhelps us to make sure that those are going to work properly.\nSo I just want to review kind of the logistics first.\nThe committee, anybody have any questions on that?\nOkay, seeing none, as everyone is aware, all bills that were reported fade away of this\ncommittee and got to rules but then were never heard on the Senate floor got reported\nback to the committee.\nSo we have right now quite a few bills that came back to the committee and they're not\nonly your folder right now but we're going to reanalyze what they are but there is just\nto give you kind of a high level overview.\nThere were ones relating to cameras in school zones,\nbooting for cars.\nWe had ones limiting certain things in school zones again.\nThat was a second bill.\nWatercraft, education, law enforcement, accreditation,\ngypsy credentials, non-lethal use of tasers\nand other stuff.\nSo there's a group here and there's about 10 bills or so.\nWe're going to re-analyze those because some of them were substituted at the end from what we're originally put here, and when it's reasonable and feasible, we will combine bills that are in the same code section or the same subject matter in order to make sure we ease the legislative process.\nSo we'll be going through those and then we do have two subcommittees as you may remember.\nBills will be assigned to subcommittee sometimes, sometimes not, it really depends on the depth of them\nIf we think that they need more input and research, and I want to thank everybody who has served on those\nOnce they're assigned to a subcommittee it is up to the subcommittee chair to host those meetings\nAnd the last thing I want to say is we need a request from the bill's author to hear the bill\nIf we don't get a request\nWe will just make the grand assumption that you probably didn't want to move forward with your bill for whatever reason\nYou may have had it tacked on something else. You matter how change of heart\nEither way, it's fine with me, but until we get a request and then once we get a request\nWe'll review those requests and decide what's going to make it to each one of the meetings\nWe do have our meeting schedule is the same as last year we canceled yesterday's because of\nAll the events happening with the eggs and issues breakfast as well as the Pro Tems luncheon\nbut we'll be meeting on Wednesdays and of course today on Thursdays.\nI know Thursdays sometimes are tough,\nwe're not in legislative session on Friday,\nbut we're going to do our best to make sure we have a good solid quorum\nand everybody can be here to participate in the process.\nAny questions?\nOkay, so the next thing I'm going to do is I'm going to have Austin come up\nand he's going to give us an overview of what has happened up to this point\nin the Public Safety Committee's background.\nWhat do we cover, the things that we do?\nJust to give a refresher for everybody here,\nand the last but not least,\nI'll remind everybody on the committee,\nas well who are in the audience.\nAll the bills which are in our committee\ncan be found at any time on the legislative website.\nBy simply clicking on the advanced search button\nand searching by committee and this calendar year,\nand you can see all of those bills\nand the status from which those bills are in.\nSo I will turn it over to you, Austin,\nThat was us with your, with your update.\nWell, thank you members for having me here today.\nIt's an honor to be with you.\nMy name is Austin Bryson.\nI'm at the Office of Policy and Legislative Analysis.\nAnd I will be the analyst for this committee, this session.\nI do realize that it is late on Thursday,\nfirst week of session.\nAnd I promise I won't keep you too long.\nSo like Senator Albers was saying,\nI'm just going to briefly go through kind of what public safety\ndoes. I know that seems pretty obvious to most of you, but I know each session, it's\nreally easy to get honed in on one or two specific topics, and it's easy to forget just\nhow wide-ranging these committees can be. So first, I'm going to just look at the general\nareas of focus here. The Committee on Public Safety has general jurisdiction over legislation\nrelated to the security and safety of Georgia citizens. Additionally, the committee reviews\nmost legislation related to the licensing of drivers and safety on Georgia's roads. Now,\nI didn't write that beautiful language that came right off the committee website.\nSo there's the official definition for you below there are the key areas of the committee.\nI'm going to go through each of those in turn just briefly and in a little more depth.\nSo first up is a motor vehicle safety.\nNow I got this information here off of the Office of Highway Safety website and a lot\nof it just goes through 2021 because that was the most up to date, fully worked out information.\nBut speed-related fatalities represented 22% of all traffic fatalities that occurred\non Georgia roadways in 2021, alcohol impaired, and drug-related crashes increased by 14%\nfrom 8,520 to nearly 10,000 in 2021.\n54% of all motor vehicle traffic crashes had at least one confirmed or suspected distracted\ndriver, and for those passenger vehicle occupants who were fatally injured, 52% were unrestrained.\nNow just quickly, that chart below there, one trend that I saw that I thought was interesting\nwas back when this chart starts in 2012, the difference between rural and urban traffic\nfatalities is very close.\nYou got 589 to 603, but as it goes on, urban becomes nearly double that of rural.\nAnd I thought that was a bit of an interesting trend over the course of the decade.\nAnd I'm just going to stop you for one moment.\nI think all this analysis is very important, but looking at your fourth bullet.\nFor those passenger vehicles, occupants who are fatally injured, more than a half is because\nthey didn't wear a seatbelt.\nThe one simplest thing that we can do to save somebody's life, I think that's very important\nto point out.\nThank you.\nAbsolutely.\nThank you, Senator.\nAnd so next topic that this committee covers largely is DDS procedures.\nSo Georgia maintained 67, Department of Driver Service locations, statewide, digital licensing,\nprobably something you've all heard quite a bit about.\nIt's a new feature it's making headlines.\nThe offices received two grants recently.\nOne was a grant award of 117,000 that will be used for\ndefund a traffic data analyst, which I drive from Woodstock\nevery day, so I'm very happy.\nAnybody that's analyzing traffic pattern.\nSo it's good with me.\nThere's also a $240,000 grant that was given for the\nGeorgia Electronic Conviction Processing System.\nAnd just as sort of an example, you know, I've put these out\nthroughout their presentation.\nHB120 is an example of a bill that dealt with standards\nfor issuance and revocation of limited driving permits\nfor certain offenders.\nAnd before you go on to the committee members,\nwho else has downloaded their digital driver's license?\nAll right, Senator Jackson, anyone else?\nVery simple process to do.\nGo to your Apple Wallet or your equivalent\non your Android phone.\nYou'll take a few pictures of it.\nit'll submit. It'll come back. This is a legal ID. You can use it at the airport for other\nforms of identification. Great thing. Some reason you misplaced your wallet. You don't\nhave something with you. This is a good solution.\nSo next up, fire protection and safety. That's another big topic here. Georgia has 487 fire\nstations and departments. In 2022, there were 69 home fire fatalities reported by US\nmedia. One thing that I found interesting is how Georgia Fire Department is\ncompared to the national average. The national average has 70% volunteer rate.\nGeorgia is slightly under half. We almost have doubled the career firefighters as\nthe national average, which I think is pretty impressive. Next up we have law\nenforcement agencies. So Georgia has 11 state law enforcement agencies. This\nranges from larger agencies like the GBI to smaller agencies like the Georgia\nWorld Congress Center Authority. Stone Mountain Park also has quite an operation. They have the Stone\nMountain Park Department of Public Safety, which I had no idea it was such a large operation.\nThe DPS provides police, fire, emergency medical, and rescue services to the park's visitors and\nemployees. Another thing that I just wanted to put in here briefly is post-certification.\nAnd most of you know what that is, but the Peace Officer Standards and Training Council\nputs out the standards for training our police officers in the state and that\nthat is an extremely important you know part of making sure that our officers\nstay safe our citizens stay safe and one thing people I think forget about is\neven from a legal side of things in the courtroom if you've ever been in a\ncriminal proceeding you've certainly heard a prosecutor establishing post\ncertification with an officer and having them explain that which is very\nimportant. And also just to clarify for everybody post also will investigate and\ncould potentially pull someone's credentials from them if there was something\nfound to be problematic or illegal in their actions. Right, thank you. So in\nGeorgia there's 159 elected sheriffs, one for each county. There's\napproximately 350 local police departments, 12 martial offices and\napproximately 12 county police departments. Here the example bill I use for\nFor this category was HB142, which dealt with the establishment of unified campus police\nforces.\nSo the next topic is pretty straightforward, so I just got an example here.\nBut school bus rules are important, and this committee does deal with that.\nHB301 was the example I used here, and that dealt with violations of improperly passing\na school bus and speeding in a school zone when captured by cameras.\nWhy don't you go back one for it?\nAbsolutely.\nIt's a good reminder for everybody here, so just take a moment and remember when you can,\nespecially if you're on the other side of the street, pass school bus,\nonly if the highway is fully divided. Make sure that you don't do that. There are cameras\non a lot of our school buses too that capture people to do in that one, make sure the kiddos\nis your safe. Yes ma'am. Your number will you talk to the microphone and I'm asking you're\nnumber when you're talking about officers are they I'm assuming they are included the school\nresource officers are they in that number that you quoted. Let me go back here they I'm not sure\nthat they would be in this number here they they very well might be I don't know they'd be\nto be included in the local police departments.\nI think that's mostly city, but we have a resident expert\nright here.\nI think that's a great question.\nBecause I know Cobb County school system\nhas their own police department,\nMuscogee County school system.\nMost of the universities and colleges have their own.\nSo I think that would be great if we make sure\nthat all of those numbers are part of that.\nBecause that's something that gets missed way too often\nand needs to be there because Cobb County doesn't need\nresource officers because they have a police department\nthereby they have the resource officers already there.\nSo in Harris County, the resource officers in our school\nwere provided by the Harris County Sheriff's Office.\nSo it's a sharing of resources.\nSo great question, Senator.\nYou look quite well.\nWe need to add those in.\nLet's break those out to Austin, maybe for a future meeting.\nSounds good.\nThank you.\nSo next up we have firearms.\nI mean, I think we all know how this applies,\nbut I did want to point out that some firearm bills\nwill go to judiciary, some come to this committee,\nfor instance, a constitutional carry.\nSome of that goes to judiciary,\nbut I've used two examples here of SB277 and SB344\nfrom the 2022 session.\nThese bills dealt with, the as introduced of 277,\ndealt with extended exemptions for weapons,\ncarry laws for certain court officials inside of a courthouse and 344 dealt with it was a\nbill that required training to possess certain firearms.\nNow I'm a little hesitant to show you this slide as much as I like to shoot off fireworks\non 4th of July but it is important so the firework industry has become a multi-billion dollar\nindustry in the United States and according to the National Fire Protection Association\nFireworks started over 12,000 known fires in the US in 2021,\nincluding over 2,000 structure fires, 300 vehicle blazes,\nand nearly 10,000 others.\nThe NFPA estimated that fireworks could start some 19,000 fires\nannually in the United States.\nI do want to comment when Georgia passed the fireworks law\nwhen we did years ago.\nOne of the things we put in there is the ability\nbased on us having a drought or other weather conditions to suspend some of the\ntimes and dates that we allow fireworks for some of the very reasons that\nyou're citing. So here I've got rules of the road, another category that we\ndeal with here. The two pictures I have are what reminded me of traffic\nviolations the most. I've got spaghetti junction from my mini drives from Marietta\nto UGA during my internships, during rush hour as well as my current exit at the capital\nwhere I often see people trying to move over seven lanes to get off their last minute\nbecause they didn't read the signs.\nSo the two example bills that I used here were HB-119 and 541, both of these just dealt\nwith procedures for passing vehicles.\nFor instance, 119 modified the procedures for passing stationary vehicles other than authorized\nemergency vehicles all right so next up the Department of Public Safety that was\ncreated back in 1937 they oversee the day-to-day operations of the Georgia\nState Patrol capital police and the Motor Carrier Compliance Division so\nthey have large ranging responsibilities and then last but certainly not least\nthe the GBI and it deserves its own slide for sure as much as they do\nwithin our state. The GBI is broken up into several divisions. They have the\ndivision of forensic sciences, the Georgia Crime Information Center, the\ninvestigative division, which does a significant amount of investigations on\nofficer-involved shootings, the legal division, medical examiner's office, and the\ncrisis intervention team. With regard to them, I'm sure many of you have been\ndown to the GBI offices and labs where they do significant amounts of their\nwork. It's quite an operation they have down there. I was fortunate enough to go\nmyself back when I was an intern at the Cobb DA and see the autopsies and the crime labs and\nit they're very impressive operation over there. George is very fortunate to have them. But with\nthat said, I promised I'd keep it brief and I think that covers the major categories\nthe public safety committee. So thank you so much for letting me be here today and I'll turn it back\nover to the committee. Thank you. Thank you, Austin. Great job. Do you want to add the Department\nof Corrections, which is our prisons, even though sometimes they will fall under state institutions\nand properties for the committee, for the actual physical building, a lot of the legislation\nwill come through us as well.\nAnd a lot of these different departments will connect, as an example, if we're working\nsomething on the, with the governor's highway safety, well, the first people we're going\nto talk to is George State Patrol, right?\nBecause they're out there on a road all time.\nWe'll be working with our George Sheriff's Association with George Chiefs of Police.\nWe'll work with sometimes the DOT to make sure that we're connecting those dots.\nWe have a lot of partners in here,\nsame with the Firefighter Association,\nthe Fire Chiefs Association.\nWe've got a lot of groups that are very well represented here\nat the Capitol that can't have all the folks\nin their profession here at any time\nand they send some pretty darn good people down\nto speak on their behalf.\nSo I appreciate that.\nDo you wanna mention just a couple more things\nbefore we open up to the committee,\nbecause two of us in this committee,\nSenator Jackson and myself,\nboth swatted right after Christmas. And it is an unfortunate incident. You may have heard\nboth of us talking about it either in the news or coming from the Senate well.\nBut for a quick update on that to remind everybody how dangerous that is,\nplease talk to the people that you know. Talk to your family, talk to your friends,\ntalk to younger folks who may not realize that that's not a prank. It's very serious. We could\nliterally harm people or they could lose their lives.\nReally big special thanks, though,\nto George State Patrol and GBI for the work they're doing.\nIt is very difficult to find the people\nthat do this type of work because of the technology.\nHowever, we're pretty close.\nSo we're going to thank them, as well as all local\nand federal law enforcement.\nIt's a team to make all those things happen.\nAlso, I want to just say that I'm sure you all\nheard Mayor Dickens spoke at the exit issues breakfast yesterday, as well as a lot of\nPR between him and Chief Shearbomb here in Atlanta for the tremendous job they have done\nto reduce the crime rate in our capital city.\nThat is certainly worth celebrating.\nA big part of that is the support of our law enforcement, the very intentional work,\nas well as the crime suppression unit, which Governor Kim put in the place.\nMany of us have written along with the crime suppression unit that's going out three\nto four days a week with a compliment over a hundred officers from Georgia State Patrol,\nbringing in other state agencies as well as working with the Atlanta police, Fulton County\nPolice and Sheriff's Office.\nSo a lot of good things are happening.\nIs it perfect?\nThe answer is no.\nBut are we trending in the right direction?\nAbsolutely.\nAnd that's a wonderful thing.\nLast thing I want to bring up today is aside from the two standing subcommittees that\nwe have in place and they are again designed to vet legislation on occasion, depending\non a specific need, we will assign a special subcommittee for the purpose of looking at\nsomething that's out of our normal parameters.\nAnd in this case, we had a lot of issues in 2023 that really stemmed back candidly for\nalmost 50 years, but they really came to ahead in 2023 with a Fulton County jail, with\n10 people losing their lives, overcrowding, you all saw, I'm sure, in one way, shape or\nform that on the news and the pictures.\nSo I asked clearly the most experienced person that walks in this building every day in\nthe legislature, which is Senator Randy Robertson, our majority whip, to lead that subcommittee\nbecause as a retired deputy sheriff and a major, he's actually both worked in and managed\nA.J.L. and he has held two committee meetings.\nI want to let him give you an update, but I will tell you, since he held his first committee,\nthere's no overcrowding right now.\nSuddenly things are getting done much quicker and much faster by a little oversight.\nSo kudos to the great work he's been doing and all the people who have realized with shining\na little light on something can get people to get things done a bit more efficiently.\nSo Senator Robertson, would you give us an update, Mr. Chairman?\nYes, Mr. Chairman.\nThank you.\nBriefly, I want to thank Chairman Albers for this opportunity, but also I want to thank\neverybody who we've reached out to.\nThere's some of us in Senator Jones himself works with a sheriff's agency in his district\nand understands a lot of this.\nAnd when this information came out, the first thing we understand is the vast majority of\npeople don't understand the role of accounting jail, what exactly it's supposed to do in relation\nship to the court.\nSo when we started the meeting, these meetings were basically the first two were basically\neducational meetings for the committee members.\nWe brought in experts.\nexperts, we brought in the Fulton County Sheriff's Office, we brought in the Prosecutorial\nAttorney's Council to basically explain the system, if you will. The Sheriff's Office\ncame in and explained what the jail does. And as many people have admitted and as was brought\nout in the meeting, there is a misunderstanding, a common misunderstanding within the community\nabout what a jail is and what a prison is. They are not the same by any stretch of the\nthe imagination, nor is the responsibilities\nof the individuals operating those facilities.\nVery different.\nOne facility is there to hold individuals\nwho have not been convicted of a crime.\nThey have only been accused of a crime.\nAnd so we looked at the process there,\nand remember our primary focus to start with is overcrowding.\nAnd so we talked to the sheriff,\ntalked about the facilities,\nthe things that were going on in there.\nThen in the second meeting, the sheriff came back,\nspoke a little more after the jail experts\nthat spoke it in the previous meeting.\nAnd then the Pat came in, Pete Scandalactus\nand his incredible team, and pointed out the,\nor explained the judicial process,\nthe normal judicial process moving through.\nOur next goal at our third meeting,\nwhich the announce will be coming up shortly,\nwill be to have some, some experts\nfrom the local prosecutor's office to come in\nand we're gonna look at the process\nof how cases are selected,\nhow the process is used to decrease the population\nwithin the jail by moving the individuals in the jail\ninto the judicial system\nso that their cases can be adjudicated\nand they can either be released back into the community\nor incarcerated if that's what,\nif that's what the system determines via the due process.\nAnd then in conclusion, after the meetings,\nI think we focus, we'll have representatives\nfrom the county commission come in,\nand therefore we talk about funding,\nthe future opportunities that we believe are on the horizon\nfor the Fulton County jail,\nwhether that is consolidation of services,\nwhether it's the construction of a new jail or whatever,\nand also issues around technology\nand other new ways of doing things\nthat hopefully will alleviate the overcrowding problem\nhere in our capital and hopefully some ideas\nthat we can use around the state\nto address this problem if it exists in other communities\nand to prevent it from happening in other communities.\nBut I feel that our subcommittee hearings\nhave been extremely fruitful.\nA lot of great information coming out,\nbut I wanna say this,\nany agency that I have reached out to\nand asked to come in here and offer information\nwith a special emphasis on the Fulton County Sheriff's Office.\nNobody has hesitated to come in.\nNobody has questioned me saying,\nas if they were nervous about what we were going to ask.\nEverybody was very forthright, very forthcoming.\nChairman Albers pointed this out when this was established.\nThis is not political.\nAnd as long as I chair this committee,\nthis subcommittee, it will not be.\nWe need the information so we can solve a legitimate problem not only for those that run these facilities\nBut for the men and women the citizens of Georgia who are being held there awaiting to have their constitutional rights of due process\nSo the meetings are going well and there'll be an update coming out within the next couple of days on when the next meeting will be and again\nChairman Ivers, thank you so much for this opportunity\nThank you chairman Robertson\nOkay, I'm going to open this up to the committee for any questions or comments, Senator C.\nThank you, Mr. Chairman.\nI'm curious to know how many of our, we got our counties or municipalities that have\ntheir own training establishment.\nmore I'm learning are having them or acquiring them or building them or whatever and I'm just\ncurious. Any ideas?\nYou know that's a great question. I don't know if I could tell you how many specific\ncounties because sometimes there'll be a local police academy, fire academy, sheriff\nmay have the academy. We have obviously Gypstick is the main one which most of you have\nbeen to and we will have an off-session committee meeting there as we like to do every couple\nof years. Director Wigginton, who leads Gipsdick, has got a pretty robust plan to increase\nour regional academies. So we have more opportunities to do that. I think you're also going to see\nsome pretty exciting things coming down the line that many of us have been working on\nto increase the hours of training for our new police officers. Things have changed.\nThe world continues to evolve. And I think everybody here believes more training is good,\nwhether that be through one of the regional systems\nor at the future Atlanta Police Training Center,\nwhich I look forward to cutting the ribbon\nbefore we know it.\nOther questions, comments?\nYes, Senator Williams.\nThanks, sir.\nI'd like to go back and look at some of these school cameras\nwhere they're located schools or close to a fall line,\nor a freeway. They're not exiting or entrance or exit on to that freeway or fall\nline but they have cameras and they turn it into a school zone but they're\nnot putting flashing lights to let people know when they're operating. I'd also\nlike to require that when they send you a photograph of your tag that you've\nexceeded the speed that there's also in that photograph that can wide-angle\nlittle ends so that the speed that you're being clocked at that's shown on that\nradar also validates what they're riding because I've had reports that\nthat's not consistent so I'd like to really look at that issue. I think it is a\nThere's a great issue, Chairman Jay Collins over in the House and I and Senator Roberts\nand spent quite a bit of time working on it toward the end of the session.\nWe do need to make some updates to that.\nI agree with everything you're saying.\nIt needs to be done properly, it needs to be consistent.\nWe've had a couple of bad actors, Candlely, who are running cameras 24 hours a day, seven\ndays a week, off of school zone times two, that we've had to have some conversations.\nWe've had a handful of cities who put on stand-alone cameras.\nWe got an opinion from legislative council that that was, in fact, illegal.\nAnd most all of them stopped immediately.\nI want to thank the great work that was done through Butch Ayers with the Chiefs of Police.\nSo we want to make sure that we're consistent, right?\nWe want to be safe, but we also want to make sure that we have the proper parameters in place.\nSo I would love for you to capture that and work with us because we're going to be updating that bill\nbill probably in the next week or so because I'd like to get it out sooner than\nlater. I think one of the last things that we'll mention on that is there's\nbeen discussion a long time about who owns the cameras and who makes the\ndecision to do that and in our bill just remind everybody we change that\nbecause the schools and the local jurisdictions were battling over that. The\ncandid answer to this is the schools have no play in that at all. The schools\ndo not maintain the roads in front and the schools do not have someone out there who\nat otherwise be running radar and pulling people over for driving in a manner that was\ninconsistent with the law.\nSo that is up to the local jurisdictions to put that in the place.\nCertainly, they'll work with the school, but that is on a city, county, or state road,\nand it should be the law enforcement's jurisdictions area to make those decisions.\nBut we will have a robust debate on that one, Senator, and I look forward to hearing\neverybody's feedback and input.\nHave one more.\nYes, sir.\nWatercraft, you mentioned watercraft education.\nWhere am I at?\nWe have lakes in Claire, like O'Coney.\nAnd there's been some fatalities on those lakes.\nBut, and where someone would be in the wrong\nand create that fatality.\nThere's no insurance at all.\nAnd they've killed the breadwinner of a family.\nAnd the family has no recourse, nowhere to go.\nThere's no requirement of liability insurance.\nAnd it may be something that we have to look at.\nThat's a very good point.\nI'd be honored to help you with that.\nAnd I think we'll get Chairman Walker,\nas well from the insurance committee,\nto probably weigh on that as well.\nGood, thank you.\nThank you.\nOther committee members, Senator Robertson?\nYes, one thing is during off session,\nI've received a couple of phone calls\nabout the possibility of agencies running speed traps\nin a couple of parts of the state,\nprimarily down South Georgia.\nAnd so, I'm sorry.\nI'm sorry.\nSo, which shall remain nameless until we get the information,\nbut there are penalties in Georgia code for doing that.\nAnd what I hope to do during this session\nlook at some of those code sections because something that any good law enforcement officer\nopposes is revenue-based policing.\nAnd I want to be really careful as we look at this technology too, that when we're using\ncameras to send citizens' citations that the fees being charged are flat fees and they\nare not or penalties or flat penalties and that they're not additional fees being added\non top of this that would put the undue financial stress on the operator, thereby appearing\nto be revenue-based policing. But the fees would have to be something negotiated between\nthe vendor and the municipality coming from the profit side, if you will, the vendor\nside, and not from the motorist who has cited. As an example, there was one piece of legislation\nand it may have been Chairman Collins coming over.\nI think it had a flat fee of $100.\nI just wanted to make sure I went to court\nin an off session with a couple of residents\nwho had gotten traffic citations\nand were really intimidated by the process.\nAnd one thing they didn't understand\nis when the judge said a fine of this\nand when they went back to pay it.\nAnd I'm sure Senator Jones knows exactly what I'm talking\nabout, they go in the back room.\nHe goes from $100 to $175\nbecause of all of these fees that have been added on\nby the General Assembly to pay for other things.\nAnd while in those types of situations\nthat's established policy and law and understand it\non this technology side, I think it's a little different\nanimal, so we need to be really, I wanna look at that.\nBut I am gonna follow up on the speed trap issue\nand be communicating with committee members\nto see if there may be some action.\nWe need to take to better police, the police that are attempting to generate unfair revenue\nfrom unsuspecting citizens traveling up and down our roads.\nOther committee members?\nAs we wrap up, we've got some pretty great experience on this committee from prosecutions\nto EMTs and paramedics and firefighters and law enforcement, and even now dads of firefighters\nlike me.\nSo, I'm pretty excited for Senator Payne and his son.\nHe's been sharing me a wonderful, wonderful career and the great things his son's doing.\nSo, what we do is very meaningful, and we'll say it a thousand more times of how grateful\nwe are for every one of our first responders that goes out each and every day to protect\nour community and we are working outside of this committee, both Senator Robert, Senator\nand I, to increase the amount of retirement through the POAB, which is the police officer,\nannuity benefit fund, as well as the firefighter pension fund, and that will come through a different\ncommittee. But I'd ask you to remember that when those hopefully make it through those\ncommittees onto the floor in order to help out all of those who protect us. So with no\nother further comments, this meeting is hereby adjourned. Thank you and have a great day.\nYou\n",
  "updated_at": "2026-02-12T19:50:57.337273+00:00"
}