{
  "video_id": "J2qESc0eBd0",
  "url": "https://www.youtube.com/watch?v=J2qESc0eBd0",
  "title": "3/12/2025--GLBC--Press Conference on SB67",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 28,
  "summary": "Overview:\n- This press conference focused on opposition to SB 68, a bill that Georgia legislators argue would unfairly limit victims' ability to seek justice in court, particularly for survivors of sex trafficking and drunk driving accidents.\n\nKey Actions:\n- **SB 68**: Bill that would restrict victims' ability to sue businesses, which legislators argue would protect corporate interests over victims' rights.\n\nBills Introduced (First Reading):\n- None mentioned\n\nNotable Moments:\n- Emotional testimony from sex trafficking survivors recounting their \"repeated rape, repeated sadimization, repeated beatings, repeated torture and torment at the hands of abusers.\"\n- Legislators argue the bill is \"poorly drafted\" and proponents could not articulate a scenario where sex trafficking victims could seek justice under the bill.\n- Legislators call on the governor and Republican leadership to work with them to improve the bill to better balance business and victim interests.\n- Accusations that the governor and Republican leadership have targeted and tried to silence victim advocacy groups like Mothers Against Drunk Driving who oppose the bill.\n\nVotes: \n- None mentioned\n\nAttendance:\n- No quorum notes\n\nAdjournment:\n- Press conference concluded, no mention of next session date.",
  "transcript": "All right. Good afternoon, everyone. I'm Senator Nikki Merritt, Chair of the Georgia\nLegislative Black Caucus. We are here today to talk about how SB 68 is protecting the\npowerful in silencing the victims. The mission of GLBC is to advocate for marginalized communities\nacross our state. Today, the people that we're speaking up for are victims of tragedies who will\nnot receive justice if SB 68 is passed and signed into law. In particular, we want to focus on the\nconcerns of people who have survived sex trafficking and people who have been\nvictims of drunk driving accidents. After the heartbreaking testimony that we\nall heard and I heard myself from sex trafficking victims, I want to point out\nthe hypocrisy of Governor Kemp and the Republicans. They're willing to fight\nsex trafficking when it suits them, but they are now willing to throw those\nvictims aside in the name of corporate profits. To get things started, I'm not\ngoing to take up too much time because we have several speakers. I would like to\ninvite Representative Tanya Miller up to the podium to share her knowledge and\nand many others were to share their knowledge,\nand experience, and perspective on this vital issue.\nThank you, Madam Chair.\nGood afternoon, members of the press.\nIt's wonderful to see you here.\nI want to start off by thanking you\nfor covering this very important topic.\nAnd but for your willingness to share the stories\nof those victims who came down here bravely\nto testify, the world would think that this issue is all about insurance premiums and\nis a smart tackle of a problem or a crisis in our legal system.\nWell, I will tell you, coming off of a very emotional hearing this week, as a legislator\nwho represents citizens as a former sex crimes prosecutor in this county, it was very\ntraumatic for me personally to sit there and watch victims stand in front of a bunch\nof politicians to share their stories of repeated rape, repeated sadimization, repeated beatings,\nrepeated torture and torment at the hands of abusers,\nat the hands of businesses who are all but complicit\nin many of these crimes that would now be outlawed\neffectively if SB 68 passes.\nThe fact that they had to stand up at a microphone\nshare the darkest days of their life,\nmany of which occurred when they were but children,\nin order for legislators to understand\nthat this is not about profits,\nit's not about good businesses in our communities,\nthis is about a citizen, a victims right to access\nthe court and to seek justice from the jury of their peers,\nthe same jurors who elect these representatives\ndown here at the Capitol.\nWhat this process has revealed is that this bill is so poorly\ndrafted that the proponents of this bill could not even\narticulate a scenario under which a victim of sex trafficking\ncould go into court and make a case.\nTheir own lawyers, who've had months to study this bill,\nmonths to deliberate on it, who have come down here and\nchampioned it, when asked a simple question, give me a\nhypothetical, where one of these victims who you just heard\nfrom, would be able to get justice in court, and not a single\none was able to do it. This bill is gobbledygook. It makes no\nsense. There is no precedent for what they are trying to do to\nsilence victims and keep them out of the courtroom.\nMy hope as a legislator, a proud legislator in the House of Representatives, I serve proudly\nwith friends and colleagues on both sides of the aisle who come here to work every day\nin an effort to vet policy, to make it the best it can be for our citizens, to consider\ntheir intended consequences and unintended consequences through a process that is vigorous.\nAnd while we may ultimately agree on the policy, the process, we should all respect.\nWhat I am calling on my friends in the House of Representatives to do, whether they are\nRepublican or Democrat, is do not abdicate our responsibility as a third and co-equal branch\nof government, it is our job to make the laws. Do not treat a piece of proposed legislation\nas if it were a royal eat it. There are no kings in this state and there are no kings\nin this country. I want to say, lastly before I hand it over to my colleague, the film\nto my Louise, that for the victims who are out there who are watching this and many\nof them are, many of them who are too afraid or too ashamed to step forward and tell\nyou about their story for fear of being bullied or ridiculed, to the organization mothers\nagainst drunk driving. Who have through their advocacy for decades made our state and\nour country and our roads more safe. Mothers against drunk driving gave their opinion\nand their voice on this bill. They opposed it. In response, they were targeted by the\ngovernor himself. It is sad and it is unfortunate, but I want you to know that there are those\nof us on both sides of the aisle who are down here to stand up and stand in for you.\nWe will not bend the knee.\nWe will not acquiesce into any royal edicts.\nOur process in the House of Representatives is going to be respected.\nWe will vet this bill.\nAnd if it is not protective of the victims and the citizens that we are sworn to protect,\nwill fight it until the end. Thank you. Thank you. I'm now going to hand this over to my colleague\nRepresentative Stacy Evans. Thank you, Chair Miller. Good afternoon. I'm Stacy Evans,\nState Representative District 57, City of Atlanta. Legislator, mother of two, and a lawyer.\nmember of the subcommittee of rules that's hearing this bill right now. The bill\ngoes too far. The bill is not a balance. The bill sacrifices victims at the\nfeet of big business. That's what it does. I do not believe that the governor and\nhis lawyers minute to go as far as the words on the paper make it go. I believe\nthat our governor cares about sex trafficking victims. I believe that our\ngovernor cares about other victims of crime. And that is why I am here today with my colleagues\nto say we want to work with you. I know there are Republican members of the Georgia House\nof Representatives that want to work with him to make this bill good, because none of my\ncolleagues standing behind me, none of my colleagues that serve with me in these chambers upstairs,\nhate business, we're business owners, we care about victims and we care about business,\nBut this bill does not care about both, and we want to work to make it better.\nSo Governor, leadership in the House of Representatives on the Republican side lets work together\nto actually make balance.\nBut make no mistake.\nIf our Governor, if our Speaker of the House, if the Republican majority does not want\nto work with us, with victims, with well-meaning businesses to make this bill right, we will not\nstop fighting. We listened to victim after victim after victim after victim over\nthis last week. We heard horrendous stories stories that no one would say\nrepresent a frivolous claim. Stories that no one would say that's okay and we\nheard their lawyer after lawyer after lawyer say I can't bring that claim\nunder Senate Bill 68. So if those victims are brave enough to stand up to our\ngovernor, to risk going back to that dark place, I will certainly be brave enough\nto stand up to power in this building and fight for them because they deserve\nnothing less. Thank you. And now I'll turn it over to Senator Elaine Apparent.\nThank you.\nleader Harold Jones. Thank you. Thank you. State Senator Harold Jones out of a\ngust of my Nordic leader Democratic caucus. It should to some extent sound like\ndéjà vu in the sense that we have the House and the Senate both saying that\nthey're willing to work with the government to try to do something good for this\nbill. We recognize that there ought to be certainly a balance between business\nand also interests of the general public and this bill does not represent that\nbalance at all. It is truly clear that SB 68, the crux of it, really is this issue of\nactually for closing victims access to the courtroom. It is the one area that quite\nfrankly the governor has refused to actually make any changes to or make any concessions.\nThe bill overall, we have seen is problematic, but especially is problematic as far as cutting\noff victims access to the courtroom. We have stated that within the Senate and now we hear\nsimilar concerns in the House and will hear concerns from the House about such a tremendous\narea of sex trafficking. But even that is also receiving a blind ear, a blind eye, and a\ndeaf ear by the governor. And why is that? Because it's been stated is that this bill is\nnot a balance. It is totally to protect corporate interests, unfortunately. We are here to actually\nprotect our citizens. That is the key. We need to make sure that we have a balanced bill\nthat works for the public, works for business,\nand at the same time, make sure we protect all of our citizens,\nespecially those who have victims of sex trafficking.\nAt this particular point in time,\nno Georgia should support SB 68.\nIt is not good for well-meaning businesses,\nand it certainly is not good for the public.\nAnd with that, I'll turn it over to Senator Parent.\nGood afternoon, and thank you so much for joining us.\nI am Senator Elena Parent,\nand honor to serve as the chairwoman of the Senate\nDemocratic caucus, and I also am a proud associate member\nof the Georgia legislative black caucus,\nwhich convened this press conference.\nRight now, we are in a critical juncture\nin this gold dome as the House of Representatives\nconsider Senate Bill 68.\nThe legislative process used by the House of Representatives\nhas already been twisted and inverted\nto try to predetermine the outcome.\nI exhort the members of the Georgia House\nof Representatives, particularly my Republican friends,\nto not abandon the job that they have been elected to do,\nwhich is to speak for the people in their districts\nand not take orders from any particular group\nand not to take orders from the executive branch\nbecause the legislature is a co-equal branch of government.\nOur responsibility as legislators\nto the people of Georgia must outweigh political expediency.\nIt would be a grave mistake\nand a dereliction of duty for legislators\nto push forward a sweeping tort reform package\nwhen there are alarming developments,\noccurring just over our southern border in Florida,\nrelated to the tort reform package\nthat they passed only a year or two years ago.\nIn Florida, new reports and legislative hearings\nhave revealed disturbing allegations\nthat major insurers may have manipulated\ntheir accounting practices and taken advantage of regulations using subsidiaries to hide\nprofits while simultaneously lobbying the Florida legislature for tort reform on the basis\nof financial distress that if the allegations that the legislature is now demanding an investigation\ninto are true, were 100 percent false.\nThey were crying poor after two major hurricanes, claiming they were going to have to leave the\nstate and the allegations are they funneled money to subsidiaries to hide it and actually\nwere extremely profitable at the exact same minute that they were twisting their numbers\nin order to get the tort reform they sought to be even more profitable in the state of Florida.\nFlorida lawmakers are currently outraged, furious that they were lied to, not made aware of an\ninvestigation that was ongoing during tort reform as to these potential deceptions.\nAnd now they are demanding answers and re-examining these very foundations of the arguments that\nled them to pass their tour reform package in the first place.\nAnd yet here in Georgia, we are being asked to pass a sweeping tour reform package based\non the exact same premise that businesses and consumers' insurance rates have all risen\ndue to lawsuits and lawsuit abuse.\nHow could we responsibly move forward when we have not examined whether insurers in\nour own state might be engaging in these questionable practices that are unfolding in Florida?\nHow could we, in good conscience, put all of the burden of rising insurance rates on\nvictims denying them their day in court and even before these reports in\nFlorida not ask really tough questions of the insurance industry and now it\nwould be willful blindness to rush this bill through without asking these very\ntough questions about the insurance industry and what their accounting\npractices are right here in our great state of Georgia. We cannot place the burden on\ninjured Georgians who only seek fair compensation for their injuries and crimes and harms against\nthem. We must demand accountability out of every player in this judicial system. If we fail\nto do so, we have abandoned our own duties and we risk making the same mistake that Florida's\nlegislators now so regret. Let's not betray the trust of every Jordan who relies on us to speak\nfor them and to legislate with integrity. If we rush this bill through now without getting answers\nto these critical questions, it will reveal this effort for what it is, a flawed premise,\na sweeping bill closing the door of justice to Georgians that is based on a complete lie\nand fabrication, which is that insurance companies can't profitably operate in the state\nGeorgia and that that's why they're raising everyone's rates.\nThank you for being with us today.\nAnd now I'll turn it over to Miguel.\nGood afternoon.\nAttorney Miguel Dominguez, I represent plaintiffs in lawsuits that seek to protect and get\nthe full value of the lives of injured, catastrophically injured, and victims in this state.\nAnd I'm here to tell you as someone that represents that group and someone who has spent a lot\nof time reading SB 68, there is not one Iota of that bill that deals with what the proponents\nof this bill says it's supposed to do in lowering insurance premiums.\none eye out of it deals with that. If the people of the good state of Georgia were coming\nto this capital outraged because of the increasing prices or cost of educating our children\nhere in the state of Georgia, what you wouldn't see is a bill proposed to restrict the access\nof our children to school.\nWhat you would see is some bills trying to figure out\nhow to lower that cost.\nThis bill only seeks to restrict the least of us,\nthe folks who are most need of a voice to advocate on their behalf,\naccess to the judicial system.\nAnd we should all be outraged by this diabolical bill.\nI won't refer to it as anything else because there is language in the bill that even your\naverage attorney has problems really identifying how this affects people who are injured and\nvictims because of the way it's written.\nLet me share this with you because I wanted to bring you all a client of mine today that\nactually could tell the story of how bad this bill is and who it really affects way better\nthan I ever could. But I couldn't bring myself to have a victim of a sexual assault come\nand have to tell her story more than she already has. So I'll tell it for just to make a very\npowerful example of who this bill absolutely and will affect. I have a client right now\nNow, we've been in litigation for years that was a homeless woman, 65 years of age.\nOne of us, a citizen of this state, who was minding her business, eating a sandwich that\nsomeone had given her in front of a Walmart, when a gentleman came up to her, preaching\nthe good news of the word of the scripture.\nBecause it was Christmas Eve and it was cold outside,\nhe convinced my client that she should come back with him\nto a motel that he was staying at right next door.\nSo she could get out of the cold and have a warm meal.\nAnd my 65-year-old client made it clear to him\nthat if he was a true believer and a man of faith\nand knew for a fact that there would be no sex involved\nin this relationship and this help that she would agree to,\nthat she would go back with him.\nWhat happened next was that when she got inside of that hotel,\nthat still in business here in this state,\nin the Metro Atlanta area,\nhe then tried to have sex with her.\nAnd because she refused, he snatched off her clothes\nand beat her to a pulp.\nWhen she continued to defend herself from this violation, he finally gave up and through\nher naked body out of the room in front of the hotel and in so doing, locked himself\nout of his own room.\nHe was so confident that this hotel would do absolutely nothing about the condition that\nmy client was in laying out there that he went down to the lobby in the hotel, got security\nto come up and let him back into his room with my client laying on the floor.\nAnd when they got to the room and security saw my naked client beat up and battered on\nthat ground, the security guard asked the perpetrator, does this belong to you?\nDoes this belong to you?\nAnd then let the perpetrator back into his room held the door while the perpetrator dragged\nmy powerless naked client by the risk back into the room.\nWhen they were back in that room, the perpetrator told my client, you see, this is the kind\nof place where you could kill somebody and nobody would care.\nFor the next 36 hours, that physical assault turned into a rape and my client was repeatedly\nraped and assaulted to the point where her neck was broken.\nMy client is in a wheelchair today and in a couple of months from now, God willing,\nsome good people like you all from this state will hear this case.\nThey will hear these facts that you've just heard and they will decide what her ordeal\nis worth.\nAnd when that verdict comes back for way more than the insurance company wishes to\npay, they'll be out here saying, nuclear verdicts, but what they won't tell you is that\nMiguel Dominguez had to send out a demand letter early on demanding the policy limits\nfor this fact pattern that you just heard, and that it's been denied over and over again,\nand that the insurance company themselves have opened themselves up to a quote unquote\nnuclear verdict. But you won't hear that part of the story, so I'm here to tell you.\nThis is a diabolical bill. It does not have the best interests of our people at heart,\nand it needs to be opposed at every step of the way\nor substantially amended.\nPeriod.\nThank you, Miguel, for sharing your client story.\nI wish we could hear more of these horrific stories\nand how victims will be impacted if SB 68 passes.\nSB 68 is not good for our victims who need to seek justice.\nIt gives cover to businesses that should be held accountable.\nIt's not good for our citizens here in this state.\nAnd I call on in this legislature a more bipartisan, a better solution than SB 68.\nWe all need to come to the table as been highlighted to come up with a better solution.\nAnd I ask the members of this legislative body to reject SB 68 in its form as it is now.\nWith that, we're going to end the press conference.\nWe're going to open up for questions.\nI may have to default to some of my attorneys that are here or some, but we're open for questions.\nAbsolutely, there are amendments and they've been shared and we'll continue to share them\nand we'll continue to work on them.\nImmediately, I can tell you, there's a lot of sections, there's eight substantive sections,\nBut we've discussed amendments relating to this bifurcation of trials.\nThis bill says mandatory.\nIf somebody wants two, if not three phases of a trial, they get it.\nGeorgia law says you should ask for that.\nAnd if the judge thinks it makes sense, then he can give it.\nWe could set down some parameters for a judge to have to consider when he's doing that.\nWe've offered amendments related to how much the jury will hear about insurance from both sides.\nFor a bill that has so much to do with insurance rates, the proponents of this bill only want\nthe jury to know about one side of insurance.\nAnd that's the victim.\nThey don't want anybody to know that businesses that active badly, drivers that were driving\nunder the influence are recklessly that they've got insurance to make them whole, they don't\nwant the jury to know that.\nSo we've got amendments around that, we've got, for every section, we've offered ways\nto compromise on this and have offered to even go further than I know some of us would\nlike to go in the interest of getting something better because this is disastrous.\nOkay, and with that we're gonna end thank you all for coming this afternoon\n",
  "updated_at": "2026-02-12T18:56:20.859864+00:00"
}