{
  "video_id": "JAMKObYtl28",
  "url": "https://www.youtube.com/watch?v=JAMKObYtl28",
  "title": "3/20/23 - Committee on Rules",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured summary of the Georgia 3/20/23 Committee on Rules session:\n\n**Overview**\nThe session focused on passing a Senate resolution (SR 334) to restrict out-of-state and international travel by the Senate President, members, and staff. Several other bills were also discussed and advanced.\n\n**Key Actions**\n- **SR 334**: Amends Senate rules to prohibit the Senate President and members from traveling outside the U.S. or outside Georgia (in their final 6 months of office) at Senate expense. Also prohibits Senate staff from traveling internationally at Senate expense.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Debate and unanimous passage of SR 334 to restrict Senate travel.\n- Routine discussion and advancement of several House bills, including HB 120, HB 80, HB 186, HB 227, HB 120, SB 340, HB 132, and HB 163.\n\n**Votes**\n- SR 334 passed unanimously.\n- Several House bills passed without recorded votes.\n\n**Attendance**\nA quorum was present, and the meeting proceeded without issue.\n\n**Adjournment**\nThe committee adjourned after considering the agenda. The next committee meeting date was not specified.",
  "transcript": "You\nYou order and we are actually going into Senate Committee on\nrules standing so if you look you've got SR334 in as the the agenda's here we've\ngot the resolution is in your folders our president pro-tim of the Senate who\nI'm sure is on his way up has this little resolution simply we're changing\nthe rules to where you can't travel out of the country on the Senate's dime and you\ncan't travel on the Senate's dime and you're if you're leaving office is the gist of it.\nSee by Mr. President Pro Tem, we give us a little more detail on your Senate Resolution\n334, working off at LC-280595.\nThank you, Mr. Chairman.\nMike, number eight.\nThis resolution is the product of the member out of state travel memo that was released\non March 1st, 2023, prior to my services protein, a study committee trip went to Europe.\nAnd I think there was some press about that issue, a pump becoming aware of this, I've\nworked with Lieutenant Governor's Office on what we think would be appropriate changes\nto the Senate rules that would address issues of international travel and making sure that\ncertain protocols are being followed for the use of Senate funds for within the United\nStates travel.\nAnd so that's what this resolution does.\nreally does three things, it amends rule 1-2.4 and prescribes it neither the president\nof the Senate nor the members of the Senate shall engage in any tribal outside of the\nU.S. at the expense of the Senate.\nNumber two, it amends rule 1-2.4 and the bill prescribes it neither the president of the\nSenate nor any member of the Senate who is in their final six months of term of office\nmay travel outside the state of Georgia at the expense of the Senate.\nAnd then finally, rule 1-3.2 provides that no Senate staff member shall engage in any\ntravel outside the U.S. at the expense of the Senate.\nThose are the three main points that are made by the proposed changes to the Senate rules.\nThank you, Mr. Chairman.\nThank you.\nYou're ready for the motion, sir.\nOh, let's hang on.\nAre there any questions for the author of this fine Senate resolution?\nAll right.\nAnd that would be the appropriate time to my eager vice chairman.\nThank you, Mr. Chairman, I move do pass on LC280595.\nAll right, I got a motion do pass on Senate Resolution 334 LC280595.\nI got a second from the eager chairman beach.\ntwo point two point any further discussion uh senate read for the\nclarification when you say foreign country are you talking about places like\nAlabama Tennessee or Florida\nfair question how do you respond to that I thought you might be headed that way\nsenator but I don't think it would be included unless we go back in a time\nmachine and then it would be included all right no further discussion all\nin favor say aye all the polls same sign motion passes unanimous meeting a\nall right now we're going to go into regular rules R and R call this meeting\norder order order all right I'm hungry so let's get moving HB 76\nrepresentative power you with us today I'm apparently carrying this one oh yeah\nWe'll cover this. This is dealing with marriage licensing, family therapy, and eliminates\nGork. Gork, my favorite. Any questions? Hearing none. All right. Who we got up next?\nRepresentative Lover, you with us? I'm going down the list. So go ahead.\nI'm sorry, I don't have a sheet, which one out of these?\nHB80.\nHB80, that was good.\nIf we have more months for the Declaration's Act,\nI believe Senator Kennedy is monitoring the Senate.\nIs there a response from the State Board?\nI'm going to allow you something unsworn Declaration,\nwhich is that the Declaration may not have been.\nThere we go.\nMade under penalty of perjury, but without having\nto be notarized, if it's signed outside of the United\nStates is requested by the Atlanta international arbitration society would be\nof great help to them in promoting Atlanta as a hub for international\narbitrations and would be of use to other practitioners in civil cases.\nAll right. Any questions for the author? Thank you. Did you have another one?\nI have well I have again I haven't seen the sheet I have two other bills that I\nbelieve are eligible for consideration by the committee House bill 186 is a\nJudicial Council bill for say good time. Let's save your breath. Okay, any other\nones? I also have 227, which is they didn't save your breath. Okay. All right. Good\njob. Thank you, Mr. Chairman. Thank you. All right.\nRibs and weight. I'm just gonna go down the list as faster. If anybody's in a\nThank you, Jerry.\nThank you, Chairman.\nHe can jump up there.\nAs I indicate on Thursday, this bill passed unanimously.\nLast year, we brought it back this year.\nThis does two things.\nOne, it requires that executors notify beneficiaries\njust like they're currently required to notify ares.\nAnd then investment accounts that have beneficiaries name\nwill not have to be subject to probate,\njust like your CD, check an account, bank account, et cetera.\nHave any questions for the author?\nHearing none, thank you.\nThank you, sir.\nAll right.\nRepresentative Corbett, you with us.\nThere you are.\nCome on up.\nHB 120.\nThank you, Mr. Chairman, members committee.\nIn my haste, Thursday, I explained that.\nI left out some important information.\nEarlier that day, I had took some errors\nfor the majority whip here in the Senate in the bill.\nWe had natural resources.\nI stood in his place so he was able to get there,\nto get some bills out of that committee\nand later get it passed out of full committees\nto help the number boards.\nI left that out and I want to put that in.\nSo aren't any questions?\nHow's the author?\nAll right, you also got SB340.\nThat's right.\nGo for it.\n340 is a bill where we protect a planning period\nfor teachers, but at the same time,\nwe can still allow the principals\nto be able to use them one day a week\nor if they can save your reasons,\nthey can use them more than that.\nAll right.\nAny cool?\nYou're on 220.\nWe're going down the list, unless they get multiples.\nAll right, thank you.\nThank you.\nThank you.\nRepresentative Jenkins.\nFrom one of my fellow delegations.\nYes sir, how are you?\nI'm doing fine.\nRise is to present House Bill 132.\nThis bill authorizes the use of ungraded lumber\nand constructing residential and agricultural\nuninhabited outbuildings.\nThis bill passed the Senate in the exact same form last year.\nJust didn't make it back for an agree in the House.\nand request your favorable consideration.\nAll right.\nIs this your first bill?\nAnd it is not.\nIt's not.\nDarn it.\nAll right, well, I'm hungry anyway.\nSorry.\nAll right, be gone.\nThank you.\nWe're going to present some doughnut.\nThank you, Mr. Chairman.\nGive me a minute.\nI'm going to give you a minute.\nI'm going to give you a minute.\nYou look sad, so I'll call you on a four out of eight.\nLet's go.\nSo for a way, the majority extends the sunset period\nfor the projects of regional significance\nfor the exemption of sales tax on construction materials.\nThis act has been in effect for 11 years now.\nIt expires June the 30th of this year,\nand this bill would simply extend it\nthrough December the 31st of 2026.\nBe happy to answer any questions.\nAny questions?\nHearing none.\nAll right, I don't want to ask anyone on this floor.\nThere's 412 on there.\nno sir thank you no sir still in the JV team representative crow 138 you\nwith us go ahead it's our albers this affords those who work in law\nenforcement that are non-sworn they have the same protection of their\npersonal information all right thank you do you want to cover 139 for them as\nWell, I'm sorry to actually that was 139. Yeah, you won't be one thirty eight\nOh, that's for late Jackson. They have to update the population every ten years for that area. Okay, any questions for the non-author\nThank you\nI\nRepresented McDonald\nThank you, Mr. Chairman, committee.\nThis House bill 163, this is a loan repayment plan\nfor medical examiners.\nOf course, we're in a crisis in the state.\nWe have 19 positions with nine medical examiners serving\nover 11 million people.\nThis is a bill that was created in the House\nand made better in the Senate.\nAnd it's going to allow for these medical examiners\nto recruit and retain and also be retroactive\nto pay those members scholarships\nthat we already have in the state.\nAll right, any questions for the author?\nAll right, thank you.\nRepresentative Reeves, you're back.\nI'm back.\nGood afternoon, Mr. Chairman and members\nof the Rules Committee, House Bill 182,\nsection one of that arises from the State Bar\nof Georgia's real property section\nAnd Board of Governors, it fixed a commercial real estate\nissue following a 11th Circuit court decision.\nThe rest of the bill is a follow-up\nfrom the timeshare bill last year.\nIt leaves everything last year in place,\nbut gives some title insurance and mortgage protections\nfor larger timeshare companies.\nThank you, Mr. Chair.\nGreat job, any questions?\nAll right, thank you.\nAnd I have the State Ethics Commission bill\ncan wait until later or address the number.\nWhat's the number?\n572.\ngo ahead and cover. Mr. Modi wanted to be here. He is in a meeting\ncouldn't come but 572 officially renames the State Ethics Commission, the\nState Ethics Commission. No more tongue twisters. It also had some five or six\ntechnical changes based on a U.S. Supreme Court decision and some other\nthings have come up over the year. So three very light technical issues and\nrequest your consideration of House Bill 572. You got HB444 on here as\nas well, and I presented that last week, the Liz Pendance Bill.\nI'd be glad to talk about Liz Pendance more\nor if the committee recalls it from last week.\nIs there any questions about Liz Pendance?\nI don't know her, but.\nIt, the Senate passed it last year.\nWe're trying to get to it earlier this year in the House\nif you'll approve.\nThis is the Senate Bill last year.\nTell Liz she needs come see me.\nWe're gonna talk about this Bill.\nThank you, Mr. Chair.\nThank you.\nAll right, Representative Barton.\nSo you back, there you are, HP 183.\nThank you, Mr. Chairman.\nThis is the Department of Revenue Bill.\nThis is a bill we got through rules last year in the Senate,\nbut it is to make it to the floor.\nThis bill based, the basis of it is where they want\nto change it from a temporary license plate\nto temporary operating permit, and they call them tops.\nAnd it's just make it where the dealers get new and used,\nand the tax commissioners are saying the same language,\nThat's the basics of the bill.\nThey call them what?\nTops.\nTipperary operating permit.\nAll right.\nThat's the basis of it.\nIt's creative.\nAny questions for the author?\nThank you.\nDid you have any more?\nI didn't see any.\nThat's it.\nThis one.\nAll right.\nThank you.\nUh, Representative Sains.\nYes.\nThank you, Mr. Chairman.\nHave House Bill 188 formally the dangerous sexual predator\nprevention act now, mariums law, in a collaboration with a tragic accident that\nhappened here in Atlanta, it wouldn't ensure we respond to Park V State, which\ndidn't allow, in a loud GPS monitoring for some of the most dangerous\nsexual predators, it would put a lifetime concurrent sentence to the 13 crimes if\nyou've been twice convicted of many of those 13 crimes to allow Department of\nCommunity Supervision to then do a lifetime GPS monitoring, which was part of\nSenate study committee who that looked over this bill this issue did you all study it we took\ny'all's lead and ran with it took it as installed it collaborated\nwhat's the public safety chairman have to say about this\nI don't see any questions thank you thank you saying you did such a fine job of explaining it\nAll right, HB193, Representative Anderson.\nCome on up.\nThank you, Mr. Chairman.\nHB193 raises a project cost threshold for compliance\nwith Georgia's local government public works law\nfrom $100,000 to $250,000.\nAny questions for the author?\nThank you.\nThank you.\nRepresentative Lamston, you got $2.292.20,\nto, I think you had another.\nYeah, 541, yes sir.\nLet's do all three.\nAll right, House Bill 221 and 222\nare both insurance department bills.\n221 deals with rate filing for auto insurance.\nThis bill keeps the current file and use model\nin place for the state mandated minimum filing\nand adds a 60 day waiting period for all other filings.\nThis is a compromised bill\nthat all the affected parties have agreed to.\nIt provides adequate time for the department\nto review the filings and provides a guarantee of speed\nto market for the insurers.\nThat's the bill.\nOkay.\nNext.\nHouse bill 222 is also an insurance department bill.\nIt addresses four sections of the insurance code\nminor changes.\nFirst section has language that makes it clear\nthat the insurance department only regulates service contracts\nthat are sold to individual consumers,\nnot to any other entity.\nSecond change deals with probationary insurance license\nand extends the period of a probationary license\nfrom 12 months to 24 months, third change deals\nwith re-application for insurance license\nwhen the license application is denied,\nlousy insurance commissioner latitude\nto reinstate between one and five years.\nAnd the fourth change removes a reference\nto code section that no longer exists.\nThat's 222.\nAll right, 541.\nAnd House Bill 541 is a bill that deals with uniform rules\nwith the uniform rules of the road,\nmuch like we have done in the past\nwhere a motor vehicle,\na police vehicle is on the shoulder of the road\nwith the lights flashing.\nWe require motors to slow down,\nmove over and pass at a reduced speed.\nThis simply includes in a similar code section\nvehicles that are stranded on the shoulder of the road\nwith our lights flashing\nor a postal service vehicle\nthat's running around moving in a non-traditional fashion.\nOkay, any questions for any of those.\nOkay, thank you.\nThank you.\nAll right, Representative DeLouche, 273.\nYou will hear this.\nAll right, Representative Franklin, HB 285.\nThank you, Mr. Chairman.\nAppreciate this.\nSo this is a retirement bill.\nAnd it's a request from the employees,\nretirement systems be able to raise their investments\nno turn of investments from 5% to 10%.\nAny questions for the author?\nThank you.\nThanks, sir.\nRepresentative Cameron?\nHe was.\nHere you are.\nI thought I saw you.\nThank you, Mr. Chair.\n8B327.\nThis bill makes one change to the state in Cessla\nadding step grandchildren.\nIn this amenity from a case in a lookout mountain judicial\ndistrict where a case could not be prosecuted because\nof this omission, step children\nare in the state inside slough but step grandchildren or so that's so much\nchange. Okay. Any questions for the author?\nThey'll keep it down there trying to concentrate. Thank you.\nThank you sir. All right, Representative Drenner, HP 431.\nThank you, Mr. Chairman. House Bill 431 strikes language in line 64 through\n75, which are restrictions for the cab county, the cab county only existing\nsploslaw and just removes those restrictions. Okay, any questions? See some puzzling\nlooks? What's your question? State your question. What restrictions would be\nremoved from the from the spost. The restriction of how you could spend the\nspost dollars it just levels the plain field for the cab county only that's it.\nIs it isn't the spost was approved by a voter referendum? It was yes. And the\nconditions were included in that referendum. There'd be a new referendum. So you\nwould have to get the voters to approve of the changes in this legislation. Yes.\nOkay, thank you.\nAny other questions?\nSir Hostel number number three this really just makes the cab like the other counties. They were in a different deal\nIt makes them exactly like every other county\nAll right, thank you. Thank you\nRepresentative Ballinger\nHP 508\nThank you, Mr. Chairman, members of the committee, HP 508 just basically starts us shot clock\nthat says that temporary protective orders or temporary restraining orders, DROs, should\nbe served within 24 hours, happy to answer any questions.\nAny questions?\nThank you.\nThank you.\nThis is representing Ridley with us.\nI hadn't seen him born poor land, hurting.\nOh, that Ridley.\nDifferent Ridley.\nCome on up.\nThank you, Mr. Chairman.\nHouse Bill 524, it just clarifies language\non three-wheeled vehicles.\nAnd it says any vehicle that has a frame\nto partially or fully enclose their operator\nand has a seat belt is in a motorcycle.\nIt's a car, so it'll fall under car laws\ninstead of motorcycle laws.\nCon? Any questions? Senator Alvers. Is this your first bill represented\nbrilliantly? Yes sir. This bill has been through this general assembly a few\ntimes the past you familiar with the history of it? I've been told that recently.\nAre you a floor leader for Chairman Powell by chance? No I'm not. Are you related to\nRepresentative Jason Ridley. No sir. I could answer. Follow up. Yeah you got a chance.\nYeah yeah. Thank you. All right. Well thank you. Did anybody else want to come out\nand they have something? Senator hold on, Representative Reese, let me get my\nSenator Setslore there, did you have something?\nThank you, Mr. Chairman, it's not on the yellow sheet yet,\nbut House Bill 204, Representative Yeard,\nit's a local government bill that both creates a council\nof municipal court clerks, so they can start receiving funds\nand try to professionalize the operation of municipal courts.\nIt also clarifies that the counties do not\nhave the power to reapportion themselves.\nThat was a proposition that we discussed here in the Senate, but just the timing of crossover\nDidn't make it across the go lines. There's two ideas of both moving into your house bill 204 glad to take questions\nOkay, thank you. Any questions?\nSerena, okay, represent race\nGo ahead\nIt's always great to be before the committee not on a list today about House bill 175\nIt's been before you before presenting that bill\nthat's the one that would do the tax revenue sharing for two organizations and\nalso establish a constitutional tag for our Constitutional Officers at\nCommission of Public Service Commissioners right now they do not have those\ntax and want to try to get them taxer. Okay. Thank you sir.\nRepresentative what who's that? Did I want to represent Washburn? I know you've\nbeen there a little bit you want to get. Thank you Mr. Chairman. I don't think I'm\non the yellow sheet House Bill 514 limits moratoriums by local governments on residential\npermitting and construction to 180 days. It also limits them from entering into another\nmoratorium for another 180 days after that exploration. There are some conditions there\nto allow them to extend. Second part of the bill limits fees permitting fees to the cost\nof administration of the permitting and inspection process.\nThird piece allows them to waive fees for construction of single-family residential\nthat is less in size than 2,500 square feet.\nOkay.\nThank you.\nThank you, sir.\nThank you.\nThank you, sir.\nThank you, sir.\nThank you, sir.\n514.\nRepresentative, did you want to discuss something?\nThank you, sir.\nThank you, sir.\nThank you, sir.\nThank you, sir.\nI'm just coming to ask for it as a rule physician tax credit that passed out of finance all last week. Okay. Thank you. Thank you\nAll right, let's pick a few was there anybody else did you want did you have something there?\nYes, I want to speak out of term, but I do have two other bills that aren't on the sheet and I could do they're doing now if you're willing or not\nYou can discuss from now if you won't just keep in mind my committee hadn't eaten. Yes, sir. Well, this is a house bill 450\nI'm sorry 480 and it's a workers comp bill that increases the rates on workers comp and then it clarifies some language\nwith the the death of workers comp and then there's 302\nThat just clarifies some language own\nOn we're straining orders\nAll right, thank you. Thank you sir. Everybody else had anything for the good of the order\nAll right, let's pick some\nWe're back at\nPresident had a pick. He left.\nMajority leader had a pick. He left.\nMinority leader Butler. You have a pick.\nI have a pick. Thank you, Mr. Chairman.\nOn page two, house bill 431.\n430.\nYeah.\nOkay. Vice Chairman again.\nYes, sir, Mr. Chairman, I want to raise the fees from contracts from 100,000 to 250,000 give me a bill number sir\nOh, you know, I knew you'd ask me that\n193 sir\n193\nOkay\nI'm going to go ahead and help out my colleague from the House over here, House Bill 175\nfor Representative Rees.\nIsn't there?\nIt's not there.\nIt's not eligible today.\nOkay, it wasn't but okay\nWe'll get it. We'll get it. You want to take another pic. Oh, yes, sir\nYes, 541. I will take five four. Five forty one\nAll right\nWhat did you want?\nAll right.\nSenator Roberts.\n120.\nHB 120.\n120.\nAll right.\nSenator Calzart.\nOK.\nI'll give you a 138.\n138.\nOkay all right we need to I got some department bills on here we need to get\ngoing and so I'm just gonna put them on so that y'all don't have to waste your\npigs so I'm adding Senate bill 163 Senate bill 221 Senate bill 222 I'm sorry\nHouse bills. These are all house bills. Just so used to pass some bills. I'm just assuming it was Senate all right\nLet me back that up house bill 163 house bill 221 house bill 222 house bill 273 and house bill 408\nthe score after today is 68 to 15 and for the record that does not include\nlocal bills because if you'd have to add I think it's three or four local bills\nfor them it does well whatever we're still killing them all right anyway all\nright so I've got an equalist I'm circled all of them on all right I got\nall right for tomorrow we've got hb 138 hb 163 I've got hb 120 I was getting to it\nLet's get into it.\n120, 138, 163, 193, HB193, HB221, HB222, HB273, HB408, HB431, and HB541.\nI get all those right.\nI got a motion over there from\nminority leader butler.\nShe did it with her eyes.\nI got a second from my vice chairman, any further discussion.\nAll in favor say aye.\nAll opposed same sign.\nMotion passes unanimous.\nRules committee, if you don't like your sandwich, I have barbed\nin the malls from Donk's barbecue in Newton, Georgia, which is no\nbehold barbecue place right by my house. So please go enjoy.\nMegan Jern.\n",
  "updated_at": "2026-02-12T10:41:11.223249+00:00"
}