{
  "video_id": "jdE_WpFpyfo",
  "url": "https://www.youtube.com/watch?v=jdE_WpFpyfo",
  "title": "3/23/23 - Committee on Urban Affairs",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 63,
  "summary": "Here is a structured markdown summary of the key points from the Georgia 3/23/23 - Committee on Urban Affairs session:\n\n**Overview**\nThe session focused on housing and tenant issues, with a personal testimony from Ms. Dory Henry about her experience with a problematic home ownership lease program. Several committee members discussed the challenges low-income residents face with evictions and housing insecurity.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Ms. Dory Henry provided a detailed account of her struggles with a home ownership lease program, including facing eviction despite making payments.\n- Committee members expressed concern about the growing issue of corporations buying properties and quickly evicting tenants for minor payment issues.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nA quorum of committee members was not present, but some members joined later in the session.\n\n**Adjournment**\nThe meeting was ongoing at the time the transcript ended. No information was provided on when the next session would occur.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nI'm with Legislative Council and I draft bills on behalf of your elected officials.\nYou\nYou\nYou\nOkay, because the other members, it's not being streamed though, right?\nOkay, very good.\nWell, let me officially open this urban affairs meeting.\nUnless the lumps, please stay if you want to.\nIf not, we can go next door.\nBut of course, I can do that.\nBut if you want to hear us in action, you can stay.\nAnd I would love for you to stay.\nI would love for you to stay.\nOkay.\nExcuse me?\nOh, no.\nWe're not on the legislative floor.\nHowever, over in the house they are on the floor, so if you go to the fourth floor and\nsit in the gallery of the house, but I hope to see all of you, we don't start to want\na clock.\nAnd I'm going to introduce you, and we might have some food, but then I think, oh, we\nhaven't food.\nHere we order food.\nUh-oh.\nOh my goodness, so I'm going to have to call and order some food.\nI'll do that.\nMaybe the only thing you can order at the last minute is pizza.\nEverybody eats pizza.\nWe'll order that.\nBut anyway, that will come a little bit later too when I finish this meeting.\nBut thank you, Mars Brown College.\nI'll be back with you soon.\nThank you.\nWe have already made the introduction while we're here today and we see Ms. Dory Henry.\nYou want to come up first and sit right there for us and give your statement?\nOkay, okay, like you're welcome to stay now, but I understand thank you.\nSay your name please for the record and Henry.\nOkay.\nAll right.\nI'm going to ask me a question so I can start with what you want me to do.\nbefore you do, do we have a minister in the house?\nYes.\nYou want you to come in and open us up for prayer?\nNo.\nCome up to the mic for that one.\nMaybe our heads.\nHeavenly Father, we praise your holy and righteous name\nfor you and Jesus alone are worthy to be praised.\nWe thank you for this day.\nWe will rejoice and be glad in it.\nWe will find your will for us in it,\nand we will be a blessing to many.\nplease forgive us for our sins and fill us with your Holy Spirit that we will do greater\nworks like Jesus and follow the help us to be humble and to pray and to seek your face\nand to turn from our wicked ways that you will hear from heaven and heal our land. Thank you\nfor this opportunity to be in this committee asking and dealing with the needs of our community.\nBless us and help us to open our minds and hearts to do the right thing for the right people in\nThank you very much everyone for being here, we are officially opening the meeting of Urban Affairs Committee and\nAnd Sonja Hopper, David Lucas, Immanuel Jones, Nikki Merritt, and Senator Raman, all members\nof this committee.\nAnd three of them are in the building right now and they're going to come back four in\nthe building.\nThey will join us as we continue, but we're being streamed and it's being recorded.\nSo everyone will get a chance to hear the comments that we have to make today.\nSo I called on you, Ms. Henry, because you have been with me through the former meetings\nthat we've had, and you have a personal testimony that you want to make, because when you first\nstarted out, you said you didn't realize the problems that others so many have in this\nstate with this, but you don't have to tell us all your personal things.\nI will, but you can't give us, you know, over a few high level overview and I'm happy\nto be able to participate in it James and thank you and I did share this with her this\nthis morning that I'm living proof and living witness of the flaws in the system.\nSo a couple of years ago, I entered into a home ownership lease purchase program with\na company that claims we buy the house, we give you three years to purchase it from us,\nyou're the homeowner, but you're not a homeowner, you're a winner, just like everybody\nelse.\npart is at least agreement.\nLast year due to COVID and different situations,\nSenator James, the state of Georgia doesn't pay me.\nSenator James pays me a stipend out of her pocket.\nAnd because I am self-employed, I do have other contracts\nwith other clients.\nAnd sometimes they renew and sometimes they don't.\nAnd in the middle of COVID, I had COVID.\nAnd so one of the jobs that I had, I had to resign from\nbecause I was sick.\nSo that impacted my income.\nAnd I was making my rent payment.\nMy main payment, I paid it on June 7th,\nand I remember the day specifically,\nbecause I got a notification for eviction on June 9th\nfrom that company, saying that I failed to pay my rent.\nTwo days.\nNo, it was 37 days late.\nPrior to that, I tried to contact somebody,\nI do have email documentation, who do I contact, how can you help me have lost my job,\nincomes being impacted, and other type of loan situations you can usually put that payment\non the back of the loan. Is that an option? And in this particular program, a percentage\nof the lease payment was going supposedly\nto a savings account for me.\nSo at the time when I decided to buy the home,\nI would get that money back.\nAnd additionally, I gave them just about $10,000 to move in.\nSo you got a ton of my money.\nAnd so I said, is there any way that you or can we\ntake some money out of the savings account\nto cover that payment?\nThey told me no.\nThey weren't willing to help me.\nAnd by the time I got a hold of somebody,\nshe said, no, your accounts and litigation,\nwe can't even talk to you.\nSo I had a higher in attorney,\nand he said, just keep making your rent payments.\nSo I did that.\nIn September, I started getting payments back from them.\nThey said, oh, by the way, our client\ndoesn't want your money anymore.\nIt's not accepting your money.\nIf the clients had accepted your money,\nI thought they're supposed to give it back to you immediately.\nI don't know any place where they hold on to your money for four months,\nand then say, oh, by the way, we want you gone.\nSo I've been fighting with them this whole time.\nBack in November, I got a notification and said,\nwe want, now we want you to pay your rent.\nSo you think, hey, my money baby, we want you to pay your lease now\ninto the court registry.\nAnd if you don't pay it by a certain date, the first of the month, then we're going to get a\nrid of possession on you. I paid it November, paid it December, January. I was a little bit late,\nso I called and had my attorney call them. I said, I'm going to be late making the payment. Can you\nlet them know? I still need to make a payment. They said, we don't want your money. We refuse it.\nWe want you gone, they got a rid of possession that month.\nNot willing to negotiate, not anything.\nWe want you gone, we want you out of our property.\nYesterday the marshal showed up at my house and so on and so\nthat's why I spent my day doing packing my stuff and moving at the end of this.\nI'm saying all that to say, when you get in that type of situation,\nthe first thing people first of all you can't realize oh my god how do I get here and then people\nare embarrassed you don't want to ask for help because we're all of those we should be able to\nhandle our business but sometimes you you need help from people and you've got to reach out\nto your resources I get calls like I just said to you every single day from people saying hey\nSenator James I know she's got these bills we've got to do something about this issue that\nanother late she said I was three days late on my rent and they put a\neviction they got a rid of possession against me and now I got to move what\nsaid what's that what that is doing to our homeless population everybody might\nnot have money in the bank so they can move all over again or at the drop of a\ndime so it's and it costs money to move you know you got to move your things in\nor you got to move your things out you're paying a first deposit last deposit first\nmust rent that's expensive and if people and so it looks like corporations are buying properties\nthey're paying cash for them and they're renting them out and they're leasing them at an\nexorbitant amount and if you miss a payment or if you're late they start to make their rules\nthey make their rules up as they go on. Even though it's not in it was not in your\nNot at all.\nAre these agreements?\nThey haven't made one repair on that property.\nThe air conditioner went out three times.\nI paid for it out of my pocket because when I notified them,\nthey said, oh, somebody get back to you within a week.\nAnd it's two weeks, and the air conditioner was out,\nand it's like 89 degrees inside my house.\nAnd nobody can live like that.\nSo I had to pay somebody out of my pocket.\nIt's still never got my money back.\nWhen I initially moved in, the sink fill in.\nI was like, oh my god, how did that happen?\nSo I said, you can't talk to anybody.\nI said, request about a week and a half later,\nsomebody contacted me back.\nWell, you can't live without a sink, your kitchen sink,\nand there's no way possible.\nSo.\nAnd we're talking about an exclusive area of town.\nAbsolutely, an exclusive area of town.\nAnd it's not the area of town, it's the corporations\nwho are, I just think it's predatory in my mind,\nwho are treating people like cattle.\nSo Senator James has been so gracious and kind to take up\nthis issue and people out there know it.\nSo that's my other contact in there,\nbecause she's willing to address it.\nAnd I told her, I will give my testimony.\nI'll say it to anybody who's listening.\nThat something has to change.\nIf we don't get back to where people are important to us,\nit's going to be a problem.\nI'm willing to take any questions, Senator James, do you have any questions for me?\nNo, I would like to, first of all, say I'm so sorry.\nSecondly, and when our members have just come in, he didn't hear, we were talking about\nproblems with rent and leases, and we're going to talk about HOAs briefly as well.\nOh, there's one more thing I wanted to add.\nSo I was given a personal testimony of a catastrophe\nthat has happened to her.\nAnd it's the same thing before you say that,\nthat Nikki Randall, our member, has come to the well\nand talked on, and she has also developed\nin legislation for it, because unfortunately,\nit didn't just happen to you, too.\nAbsolutely.\nIt's happening.\nIt's happening, as we speak.\nShe gave the statistics and everything,\nbut she's in another meeting,\nso I'll make sure that we can share your information\nwith her.\nYeah, absolutely, I'm happy to do it.\nSo there's another thing.\nSo remember, flashback to May of last year,\nI still have an active court case.\nSo yesterday at Senator Jameson,\nso gracious, we call him Magistrate Judges\nand all kinds of stuff.\nAnd I said, I don't even have a court day,\nnobody's even notified me so when does that go happen two or three years from now\nthey said oh no you're on the docket for when may so still to me that's\nunconscionable for an issue a year old that we just now getting to I mean I\njust don't even understand how that's that's okay that does things have to\nmake sense to me that doesn't make any sense unfortunately in this law\nAbsolutely, nothing fair is not fair.\nWell, what should be fair is not fair.\nUnfortunately.\nAnd I know the law is the law.\nAnd it's a subject to interpretation,\nbut there's some things to me as I was calling around trying\nto get some relief on the attorney told me.\nHe said every law is, what did he say?\nIs makeable.\nSo what he was saying, if there's a law that says\nWe can evict you on this day that he said there's a counters law\nAgain that can counteract that because nothing is holistic and pure is what he's telling me\nI don't know Jason's I mean Nathan's\nforehead is wrinkle, but that's what he was saying every law has something that can counteract it\nso\nHaving said that I'm thinking there has to be something that can be done not just for me\nBut for all the other door hemorrhage in the world\nWhat if you don't like me, what if you don't have a Senator James at your resource?\nI mean, you know, at your disposal that I can call you any day, time of the day, or night.\nWhat about those people?\nThank you. Again, I'm very sorry about it. We are going to look into this and add this to the\nthings that we've already received from so many people all over the state. This is not just an\nissue that one or two of us have. We've heard from so many people. In fact, Senator,\nthe rent control people have emerged on this whole capital. So many times they've been\nover at all the city council meetings in Atlanta and they've been coming over here and\nthey've been talking to all of us sending us emails. So this is an issue that should\nWe have some priority that we need to make sure that we do something about it.\nSo do you have any questions?\nNo, it's not a question.\nJust a comment.\nI don't think this issue will be in the city of Atlanta.\nIt's all over the state.\nYou know, we have a serious issue in this country, basically, in a lot of different places.\nSo there's definitely some issues that we need to listen and come up with some kind of\nsolution to help.\nThank you so much.\nThank you so much.\nThank you.\nThank you.\nI'm so happy to meet you.\nOkay.\nWell, Sonja's going to come back too, so it'll be just us sitting in here, but the others\nare listening to it, and it is streaming.\nSo thank you very much for your comments.\nAbsolutely.\nAnd I'm going to be like, I'm going to be like Ms. Marge, I'm going to have all the\nstopby bigs as well.\nI'm going to have to change.\nYou know, I'm going to have to change.\nIt's sad that we have to even find a way to smile about this.\nThis is no smiley matter.\nAbsolutely.\nWhen it happens to you, so I mean, that's\nwhy we're having these meetings so that we can look\nat what we need to do for reforming rent and rent control.\nI think we have one of our Mr. Mullins going to come up\ncan tell us about what he has been talking about\nand it falls into your category.\nI just wanna say thank you for your leadership\nand thank you for the opportunity to share.\nOkay, thank you very much.\nY'all wanna both come up together.\nYou wanna come up first, Margie?\nI was supposed to be going to break it back.\nOkay.\nSo Miss Margie McLeod.\nThank you very much.\nYou want to see your t-shirt need rent control.\nI don't know if everyone understands why the prices continue to go up and nobody has\nstopped.\nSo you go ahead and tell us.\nI know that you've been an advocate and you own your house, but you've been an advocate\nto help so many. A lot of the Atlanta public schools, bus drivers and cafeteria workers\nand teachers come with you and you veteran too. And so you have brought all of the groups\nthat you are part of to speak with me and others about this. So can you briefly tell\nI was going to give you about three minutes.\nGood afternoon, everybody.\nI took one uniform off and put it on another one.\nI was in the military for 20 years and one day.\nAnd I wear this proudly, because when people see this shirt,\nyou give it me hope.\nYou give it me hope.\nRent is going so high, $400.\nGo all way up to $1200.\nThis is everywhere.\nThis is also Midtown.\nGod, I'm gonna say, he was a Caucasian.\nHe said, my rent went up to $1,000.\nIt's not about color, it's about.\nIf you don't have like what my saying is,\nif you don't, if you're not green, you don't fit in.\nAnd it have to stop.\nWe could do this.\nIt's not about land laws, I'm not against land laws,\nBut how can you go up 100% or 300% on red?\nIn fact, everybody, in fact, your family?\nIn fact, my family, seniors, getting put out\nof senior soon, for $36 because they can't afford.\nPeople is being displaced, schools is closing down\nbecause guess what?\nFamilies don't have nowhere to go.\nWhat is the solution?\nWe have to do this.\nReputably, we got to work together\nbecause it's affecting your home also.\nNot just my home, your home.\nYou got grandkids, okay?\nI hear people telling me, my daughter,\nI can't, my son, we can't afford to rent out here.\nIt's too high.\nYou got mothers as prostitute.\nYou want to believe it or not?\nBecause they cannot pay the rent.\nYou got students also.\nSo what are we going to do?\nThat's why I'm here.\nI'm not going nowhere.\nAnd you keep saying it can't be done.\nWe got to change it.\nEvery other state is changing it.\nWhy George, you can't change it.\nRay, George, on my mind, that's what we need to do.\nAnd I'm not giving up because guess what?\nYou are hurting also.\nYou landlord, the development binder,\nhow are you gonna let somebody come in here\nand buy up a whole block?\nIf you overseas, I've been in Europe.\nThey will let you do that.\nThe Chinese are seeing here.\nAnd I just left yesterday from housing authority,\nthe people that is in the housing,\nThey push them up, they go up on the red.\nOh yeah, tenor rights.\nOkay, that's good, you got it.\nBut guess what the landlord's saying?\nWe're gonna go up the red.\nIf we got to fix anything and you don't know\nthat they can't afford,\nwhen you know me wearing wedges of $5 and 15 cents,\nyou got people here is leaving\nbecause they can't afford the red\nand they broke for y'all.\nThey right here and they go for them.\nThey can't, my man, man, say he leaving also\nBecause guess what, he can't afford to rent.\nSo what are y'all gonna do?\nYou wanna say what you can't not do?\nYou can.\nWhatever other state could do it and we can't do it.\nWho, who's in that pocket?\nYou know what they say?\nWe know.\nWe tell them what to do.\nThat's what the developments are saying.\nSo please pass this bill sending 125.\nWe need it.\nChange has to be made.\nSo let Georgia be the change.\nThat's what I'm saying.\nBecause the people's crying out there.\nHomeless is increasing.\nIt's increasing.\nI know you're very passionate about this.\nAnd so many of us are, thank you.\nThank you, Ms. Margie.\nAnd you got firing your bones, even.\nSo we can understand, because we've\nheard from so many people before you.\nBut please, now we're gonna get the history of it.\nSo please come up.\nIntroduce yourself for the record\nand give us your testimony, please.\nAnd thank you very much for coming.\nI've had an opportunity to talk with you,\nto be on a TV, you know, with you.\nAnd you really educated me when I thought\nthat I knew everything about this issue.\nSo please share with us if you can something about rent\ncontrolled and where it started and what we can do about it\nnow, what your opinion is.\nThank you, Honorable Senator Donzella James\nand other committee members.\nI would like to speak to you today about the situation\nin Georgia and how we arrived at this point of having\nthe challenges of increased rent.\nMy name is Rodney Mullins.\nI'm a former military officer,\nstudied at United States Military Academy at West Point.\nThen went on to receive my masters and business\nand work now helping people in a different way.\nI help my country in a different way now.\nI deal with a lot of disabled veterans,\na lot of citizens that are struggling now.\nIt's my way of giving back.\nBut I want you to understand how we arrived at this point.\nAt the end of World War II, the veterans were returning\nand the Georgia State Legislator said this is a challenge\nbecause many veterans could not afford to pay their bills.\nSo they implemented rink control.\nSo rink control was a policy in Georgia until 1972.\nIn 1972, the real estate lobby came here.\nThey lobbied the Georgia State Legislator,\nand they were not from here.\nIt was a national real estate lobby.\nThey targeted all the major markets, LA, Miami, New York,\nSeattle, all the major markets, and they passed legislation\nto remove the ban on rent control.\nThey lobbied the Georgia State legislature, and they won.\nIn 1972, there was a ban on rent control.\nSo local municipalities, rural counties,\nas well as urban counties, could not control their rent.\nWhat this did to local municipalities, local counties,\nmaking county, Bartow, wherever you might be,\nFulton County, what it did was it hamstrack, hamstrack, hamstrack, it handcuffed them because\nthey could do nothing about rising rents, but what it did for investors allowed an investor\nfrom China, an investor from LA, an investor from New York to control your market.\nSo what that did was that allowed foreign investors or out-of-state investors to take control\nof this market, which was the design for lifting the ban on\nrent control.\nSo they were very successful, because now the Federal\nDeposit Insurance Company, FDIC, has stated that Georgia\nhas less than 2% areas that are considered affordable.\nAll across the state, citizens are struggling,\nparticularly our veterans, they cannot find affordable living and it's not just affordable\nit's low income because what goes on in some areas, the formula for AMI is computed\nwith conglomeration of several municipalities so you might have an upper echelon district\nthat's computed in that formula so someone that's living in a rural county their average\nincome is combined with someone that makes $95,000 a year.\nSo now, all of you understand, ma'am, so you have that aggregate number.\nWhen you increase that aggregate number, 30% is going to be bigger.\nNow if you have a number that stratified based on census tract, which the way it should\nbe done, then the people that are looking for affordable housing would have a chance.\nSo now they can't even get government programs because the average media income is so high\nand if they make just $50 or $25 above the allowable range, they don't receive any assistance\nwith housing.\nThis is a dilemma.\nThe same action and the same rationale that the Georgia State Legislature took after\nThe World War II is the same demand that we need now to lift the ban and repeal the\nban on rent control.\nWhat it would do to rural counties in urban counties, rural counties would now have control\nto make its difference.\nRight now, local municipalities, city councils, county commissioners, they cannot do anything.\nGeorgia is controlled by out-of-state investors.\nSo our children based on the numbers that I've analyzed for the past several years, Georgia\nis controlled by out-of-state investors.\nThey are here.\nThey're coming hard.\nWe're being traded on the start market, conglomerates of properties here are traded\non the New York Stock Exchange.\nSo the Georgia State Legislature has to make a decision.\nNow if you look back at the thought pattern of the Georgia State Legislators after World\nWar II, they put a ban, they implemented rent control because their population was struggling.\nThey had a major challenge with World War II.\nBut we just got out of a challenge, too,\nit's called the pandemic.\nIt's called COVID-19.\nWe are in our Katrina.\nIf we don't live this ban on red control,\nand repeal this challenging law,\nthen more and more people will be evicted.\nAnd they won't have options.\nSo it's not like before we could just find a cheaper place\nbecause you can't control it.\nIf I'm an investor from a different state,\nI don't care about the children here\nbecause I have no connection.\nIf I'm from LA or if I'm from China\nand I'm trading on your county which they are,\nthey're in pretty much every county in Georgia,\nthen I have no connection to the heartbeat\nof the children in this state.\nIs that what we want?\nDo we want the children of this state\nto be controlled by investors\nthat have no love or no connection to this community?\nThat's why I'm here testifying today\nbecause our veterans are challenged.\nEveryday citizens are challenging, challenged.\nAnd we will allow people to be evicted,\nit leads to teenage convictions.\nBecause when you disrupt a home in a rural county,\nAnd in the city, children lose hope, and they go into an uproar.\nSo that's why we are requesting, and that's why I'm here to testify today.\nI appreciate all of you and the service that you've given our country and our state.\nBut this is a serious issue.\nWe are in a economic pandemic, a housing pandemic, a COVID-19 for housing.\nAs people are living in their cars, we have veterans that are living behind buildings.\nVeterans that come to me and talk to me, fellow veterans, they say, Rodney, where can\nI go?\nThey're looking for room in houses.\nRoom in houses are becoming very popular in Georgia.\nPeople are living in rooms.\nAnd you all are blessed.\nAnd that is very exorbitant too.\nYou pay what $100, $200 a week for one room in the bathroom?\nWe've seen them go as eyes 175 to 225.\nSo if a couple is married, send it to James.\nWhat we've seen is much more.\nWe have some veterans and some citizens that are paying for a room\nup to $700 to $900 per month for a room.\nIt's real because they know they can get it.\nno control on the marketplace.\nAnd what I'll tell you, we all love capitalism.\nBut when I studied capitalism in business school,\nit says make as much profit as possible.\nIt then say, make considerations for veterans,\nmake considerations for children when you pursue your money.\nThe values and principles from capitalism\nhas to come from us.\nBecause without any virtue, without any love,\nCapitalism can be extreme.\nWe can be extreme with market investments.\nIt could possibly be for an apartment.\nIt could be $2,000 one day.\nIn some parts of Georgia, you have for one apartment.\nOne bedroom apartment is $2,300.\nI promise you it is.\nSo we all love capitalism, but we need some love in that capitalism.\nWe need some virtue.\nWe need principles in that co-efficient and that form\nin one of those variables.\nAnd you are that virtue.\nYou are that love.\nThat's my testimony.\nAnd I appreciate all of you.\nAnd I hope that you will support SB 125,\nand which is designed to repeal the ban on rent control.\nBecause rent, if we did not take charge of it,\nor at least free the local municipalities\nto do something about it, that you\nsee more evictions and the last thing I'll tell you when I talk to several\nattorney friends of mine they said Rodney let me tell you a secret a lot of\nfirms are hiring additional lawyers just to handle all of the evictions that\nthey anticipated because they anticipate in Georgia in 2023 there could be in\nin some region seven to eight thousand evictions per month, seven to eight thousand. So I appreciate\nyour time. Thank you, Senator James, and any questions I entertain.\nYes, we would like to ask a few questions. First of all, thank you very much for the very\ninformative review, overview on what has happened and how we got here. But can you tell me,\nI've been talking to many mayors and City Council persons to see what they want to do.\nAnd they say we have no control and even in Atlanta they're saying we have so many vacancies\nbecause the rental on condominiums or apartments have gone up to $5,000 in some of the key places\nin just downtown Atlanta, but the people who,\nwhen they find out who owns it,\nthey are from other countries or from other parts\nof this country.\nAnd they have no vested interests.\nAnd when they have a vacant apartment,\nthey can use it for taxes, for taxes.\nSo it helps them, they don't lose.\nonly the citizens, the people who are renting lose.\nSo, what have you heard on this or what can we do?\nI know if we lift the prohibition against it,\nthen it'll allow mayors and city council\nand county commissioners who have talked to me.\nThey said that, yes, if we could lift it,\nBut it doesn't have to be a constitutional.\nYou have to repeal, you have to.\nThat's what I was going to ask our legislative council.\nDon't we have to have a constitutional amendment\nto take, to lift the prohibition against rent control?\nIt is in the Constitution.\nYou want to expound on that, please?\nI will say that in talking to several government elected officials, what they told me sent\nit to James is that they want to do something about this, but they are challenged with\nthe ban on rent control.\nThey want to do something because they see their local constituent struggling and they\nThey are begging for something to happen, but they can't do anything.\nSo they told me that if we can get it passed the state, they said we want to do something.\nThey said we can get passed this ban on rent control that we immediately would do something\nabout this issue, because their people, their constituents are clamoring, are coming to\nthem saying we're living out of our cars, or we're living with family members, or basically\nsome of them are have gone to there's rental of campers there's a lot of new\nphenomenons going on people living in campers we have found people living in\nstorage units the secret oh you heard about that too Senator James people are\nliving in storage units because they're out they get four clothes on are evicted\nfrom their rental property and and they put their things and then they had a\nthe key to it and they have to go and sleep on top of the furniture and oh I get all\nchoked up because I'm very sensitive to all this now because I'm talking to so many\npeople and I know plenty of these people and these people have jobs. They just couldn't\nafford to continue to pay the rent and I also some of the elected officials are saying\nthat is changing the demographics of their area and so whereas they could win for years.\nNow it's changing the demographics and the only people who can afford some of these apartments\nbecause they've gouged the rent so high that every minimum wage person or a person who\nwho gets a middle class amount of money can no longer stay there and so as a result their\nvoters are going and other people who don't know them or big companies are sending people\nhere you know who work out of Georgia but don't live in Georgia.\nSo do you have you, I know you talked to a lot of people so can you say something to that?\nYes, I speak to the number of people every day.\nAnd many of them have told me that,\nand also elected officials, the number of elected officials,\nand they've told me they've seen the demographics\nand the citizen profile of their region changed drastically\nbecause what happens is when a person loses their address,\nthe system, they become in limbo in the system.\nSo a number of people are living in hotels.\nAnd that becomes a challenge for the children.\nSo that also becomes a challenge for the population\ncount for that school district, if it's a Title I school.\nSo what happened, you have now a school bus has actually\nstarted stopping in hotels.\nThere's a new phenomenon that children are being picked up\nat hotels.\nWhat the challenge with that is children\nneed a permanent address.\nAnd sometimes that's a challenge because if you don't have a permanent dress, that's\ndifficult even to get registered your children for school.\nSo this is creating a ripple effect.\nThe elect officials are just requesting stability.\nOne thing I hear them saying is rent stabilization.\nThey need to be able to stabilize it.\nSo in Georgia, the rent is rising.\nIt's in the top four in the nation.\nas far as the increased rate of increase in rent,\nGeorgia's in the top four.\nSo, but also, the challenge is,\nbut wages have not spiked up at the same level.\nSo statistically, you have a gap,\nyou have wages plateaued,\nbut then you have rent going up.\nSo you create a statistical and a financial gap\nin the haves and have nots.\nAnd so you have a lot of people struggling.\nSo, and a lot of elected officials want to do something\nif they could only have this a ban on red control repeal.\nThank you very much.\nMembers, we've been joined by Senator Emmanuel Jones\nand you already heard from him.\nAll right.\nAnd let me say this, we're not against landlords\nbecause I know my late husband and I had more than 10 houses\nthat we rent it for years and years,\nbut we never gouge to people.\nAnd we got renters in who didn't want to leave the property\nbecause we kept it up and looking good.\nAnd until he got sick and then he's in heaven now,\nyou know, that's when I stopped being a landlord\nand had to take care of my husband and let that go.\nBut I met with so many people who were landlords\nin the same category with me who did take care of that property.\nSo again, we need to, I'm thinking about also going\nand talking to the Georgia Real Estate Board\nof different apartment associations and see\nif they can't encourage people who are members of them\nto also stop gouging.\nBut the gouging we found out is really coming\nfrom the outside companies that live outside of the country\nor outside of the state of Georgia.\nSo do you have any questions?\nComments?\nThe only question, but a comment, you know, this is a thing.\nFor testifying, this is the issue that I said earlier too.\nNot necessarily, we have a lot of good landlord\nin the state of Georgia.\nI was in landlord.\nI had some places I know that doing the COVID,\nI had some tenant, dinner, and pay rent,\nI didn't even charge him, it's okay, it's fine.\nBut not everybody like that,\nespecially the problem we have now,\nthat our state investor did the major problems.\nI don't know what we can do,\nbut we need to work on that.\nThe create investor court position coming from outside\ncausing the problem for us.\nNow one thing, right.\nAnd thank you, Senator, one thing I will tell you,\nThe state of Florida did do some states\nare addressing the issue of out of state investors\nbecause it was becoming a phenomenon.\nI know for a fact, Florida was inundated with foreign investors\nso they began to place limitations on LLCs\nthat are owned by foreign investors\nbecause Florida was like number one for several years\nand the market rate was so high that poverty was skyrocketing.\nSo the Florida State Legislator took an action to limit the control of that state from\npeople that are disconnected from the community who don't have a concern about the day-to-day\nlife of the children, of the families, of the businesses.\nYou know, also, oh, no, sorry, but it was to you that we got to do something about it\nfor sure, but the thing is, you're talking about eviction, my concern is even if forget\nof a conviction. The people working right now, working class folks, working restaurants,\nconvenience store, break and even find a place to stay. Forget about eviction. You don't\nhave a place to stay. We have a shortage of people for working regular hourly jobs. You\ncan't really afford, you know. That's my concern too. I mean, that's one thing. It's not\na Atlanta issue. This is all around the state of Georgia everywhere.\nAnd all over the world, because even in Nigeria,\nI was talking to the people who came to our diet\nas per day, and they were saying that they were having\nthe problem there because China came in\nand bought up everything.\nSo now, they don't even hire the Nigerian community\nto even work in their companies, oil, whatever they doing.\nThey've come over there.\nThis is not my words.\nThey say they rape the country.\nand that they're gouging even other people\nso they have to stay outside, families.\nSo it's not just happening here in the United States,\nbut so we need to look at the different foreign countries\nthat are coming here.\nAnd hopefully this committee can look\nat the best thing we can do to take more control.\nBecause that's all we're trying to do.\nYou said one word, stability.\nAnd that's what we need to do, have more stability in our rent\nwith all of the people who are a part of us.\nYes, yes, and that would do it.\nOf the state of Georgia.\nAnd Senator Jones, did you have a statement of question?\nI do not met him, Chair.\nThank you for choosing that information with me.\nI apologize for being late in Tarty,\nBut I had another event I had to attend this morning.\nAnd I've heard the comments shared by a chair lady.\nAnd I too have property that I lease out, by the way,\nlots of it.\nAnd I understand these issues and concerns.\nAnd I'm always sensitive.\nAnd I believe landlord should always\nbe sensitive to the needs of the tenants.\nBecause after all, there are the ones that\nwe're the ones who just own it but they're the ones who spend their time at\neffort and raise their kids in these properties so thank you for bringing\nthis information forward. Thank you Senator Jones. Thank you very much and we\nhave Jody Williams is gonna be next thank you sir we're gonna call on you some\nmore I'm sure because this was supposed to be also a HOA meeting but time is\nof, you know, we're going to have to end pretty soon. So we'll try to have another meeting\nto talk about what we can do about HOAs. And we end next Wednesday. So it might be after\nthe session since this committee cannot do anything until next January anyway legislatively.\nBut we might have a call on you and thank you very much, very much. I know you do it voluntarily\nto, although you might have some clients, and I appreciate you.\nThank you.\nYes.\nWe appreciate you.\nMs. Jody Williams.\nOh, you're here.\nHow you doing?\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nHello.\nand relatives and even my clients, whose rent is so high that they are moving like one\nsituation where the persons rent went up to $1,700 and they had to move and they are living\nin their car until they can find another place.\nYou know, it's dangerous out there the way the rent is out of control.\nSo we really need this ban lifted.\nSo if you all can do anything to help, and I notice sometimes when you talk to some\nof the senators because they have this state ban, you know, they feel like there's nothing\nthey can do.\nBut if we can be heard, that would be step one.\nIf this could come out of the committee, that would be step one.\nSo don't be afraid to help the people because that's what this is all about helping the\npeople.\nWe appreciate that.\nAnybody have any questions?\nOkay.\nYour points will take and we are going to continue to work on this.\nYou know, I've been told by many of the other legislators\nwhen I tried to get them to come and work with me.\nI own property.\nI'm not going to do it.\nI said, this is not about you and why you handle yours.\nIt's about the trend that has gone on all over\nand especially in the state of Georgia.\nAnd so we need to look at how we can reform this rent.\nI'm also a property owner, but I have friends, clients.\nThis is just out of control.\nSomething must be done.\nMy niece went up $400.\nShe don't have any place to go with her son,\nso she have no choice.\nSo this is really needed.\nthey're even putting the elderly out of their apartments\nbecause they can no longer afford it.\nRight.\nIt's getting to the point that you're\ngoing to have the wealthy, the middle class, the poor,\nand the tent people, because that's what it's coming to.\nThey're going to be a group of people,\nthe people who live on the streets.\nI see people now with their children living outside\non the streets.\nIt's getting ridiculous.\nWe must do something.\nWhat kind of state are we if we can't help the people?\nOr if we're not even concerned about the people?\nAnd that's all I have to say.\nAnd I really appreciate you all listening.\nThank you.\nAre there any questions?\nYou know, we are convening these hearings because we know that it's a serious problem and\nwe appreciate, oh, excuse me, don't leave.\nAnyway, he's with the alumni for Mars Brown yesterday evening.\nHe didn't make his statement.\nHe was saying to make a statement because he and his wife don't live in, it's not just\na metropolitan and land area.\nYou know, some people who live in Georgia, 30 miles away, you know, are experiencing this.\nAnd their companies are coming there, big companies, corporations, and bringing thousands\nof jobs.\nAnd so these corporations are being forced now to use a part of their property to build\nsome apartments and allow the people who work for them to rent from them because they\nwon't be able to rent a decent place and they're building townhouses, you know, maybe\non own a couple of acres of their property and that's what he was going to talk about.\nAnd you know, he did come to me and tell me about it.\nSo we are going to continue to investigate and talk about it.\nAnd this is not just a meeting to talk, is any more, but we're going to try to come\nup with solutions.\nEven on my interstate corporation committee that I'm also, I used to be the chair, but\nnow I'm the vice chair.\nWe had a meeting last year on this and we were told to do something about it this year.\nAnd that's why I did the Senate bill 125, but it didn't come out of committee.\nAnd it was to lift the prohibition on the rent control.\nSo we are going to take one step at a time.\nAnd I'm so happy that we have our members who are also interested.\nThe members of that other committee are also interested, Senator Harborson and Senator\nFreddie Power-Sims.\nAnd then what they do is they come here to Atlanta for the session.\nSo they are renting apartments, short-term, or either they are least one.\nAnd when they're out after a few months, then they rent it out.\nBut you know, they're having problems like you've never heard of.\nYou don't, I mean, even though you have been bringing this and Ms. Margie-Bake, there's\nbeen bringing this issue and so many people to us.\nSo it's on the minds and hearts of us.\nAnd so we have to find a way to address this very important concern.\nThis was addressed once by our Judiciary Committee when Senator Stone was here, so that\nmight have been about five, six years ago that they had it.\nAnd this kept coming up, but out of the whole thing that he passed, it wasn't addressed.\nSo maybe we have to revisit his legislation and see what we can do senators to address.\nThank you very much for your comments, and I know you got to go back to work.\nWhat was Stone?\nWhat was...\nSenator Stone has retired.\nRight.\nWhat was the...\nWhen it re-control, it was re-control.\nOh no, it was Renner's rights.\nRenner's rights, I believe, because you're new.\nI'll find out.\nExcuse me.\nI beg your pardon, I don't know if I may have done that.\nSure.\nAround what time of the event in history as a state was that I was on the 70s was a state?\nOh no, no.\nHe just did a rent.\nHe wanted to revise the rent, reform the rent.\nAnd this was, he was just five or six years ago.\nHe just left.\nSenator Stone is your age probably a little, but he stayed here almost 10 years and then\nhe left what about four or five years ago.\nSo we can look back and find out and I'll get, please make sure we have a way to reach\nyou and we'll make sure that we do that.\nOkay.\nThank you so much.\nYou're welcome.\nThat's going to be the end unless I see Gordon Draves coming in, were you going to speak\non rent control or HOA?\nYou just wanted to listen.\nOkay.\nThank you.\nAnd I know we've been talking about it too.\nThank you.\nSo this is not an issue about just the 35th District or Dunzella James, but it's all over\nour state.\nYes, it is.\nAnd it's not against landlords at all, since all of us are landlords too, or have been\nfor many years. So we just want to do what's right and make sure that we give our\nelected officials who are municipalities or counties have control. They\nwon't control. And we always stress local control, you know, all the time on\nour decisions that we make here. So, you know, the demographics have changed and\nSome of the people are not going to get reelected because they have people who have moved in, who don't know them or won't vote for them.\nAnd they're going to get other people.\nAnd then not to say anything's wrong with other people, but they might not have the same values as the community.\nAnd then we're going to move on from there.\nOkay, I just want to thank you so much for the bill, Senate bill 125, and I think you did a really great job, you know, with the time frame that you had to put it together and present it.\nSo thank you so much.\nYeah, very welcome. I'm sorry I didn't come out of committee, but maybe another hearing or something will help to get it out of committee before it dies at the next year.\nIt's still alive after this session and next year.\nSo we hope we can move.\nOh, I got your name on it.\nMargie, knew you were coming, so she put it down.\nOK, is it anyone else who wishes to speak on this issue?\nDr. Faroqi is coming.\nHe's with our Mars Brown Group.\nBut his son, your son, even addressed this issue\nwhen he was the city council person over here.\nTell us his name.\nI'm not, yeah.\nI'm E for Rocky.\nHe addressed this and they tried to change it,\nbut then that's when they came to me and others\nand said, you gotta lift the prohibition\nin order for us to take control.\nSo, does any of the lobbyists in about, oh, they gone?\nMost of them go on now.\nDid they want to say anything?\nNo?\nOK.\nHearing none, thank you everyone for coming.\nAnd we will adjourn officially now.\nThank you very much.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:05:05.810454+00:00"
}