{
  "video_id": "jDHDXiiLYWI",
  "url": "https://www.youtube.com/watch?v=jDHDXiiLYWI",
  "title": "Sen. Hickman Press Conference on GCDD for K-12 Students | 02/04/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 23,
  "summary": "Overview:\n- This press conference focused on the experiences of students with disabilities in Georgia's education system, particularly the challenges faced in the \"Jeanette\" segregated education program. The speakers highlighted the need for inclusive, high-quality education for all students.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Senator Billy Hickman, a champion for disability rights, introduced the event and spoke about the importance of strengthening the teaching workforce and making education more accessible and inclusive.\n- Representative Lim emphasized that inclusive education benefits all students, not just those with disabilities, and discussed efforts to promote this in Gwinnett County.\n- Daniel, a \"survivor\" of the segregated \"Jeanette\" system, shared a powerful personal account of the abuse and challenges he faced in that program.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nNo adjournment information provided.",
  "transcript": "Good afternoon. Good afternoon, everyone. My name is Darcy Robb. I'm the Executive Director\nof the Georgia Council on Developmental Disabilities. You won't be hearing much from me today. You're\ngoing to be hearing from a young man who describes himself as a Jeanette survivor. You're going\nto be hearing from a mother whose child is currently stuck in the Jeanette system. And\nWe're going to be hearing from a young man who had the opposite experience, whose inclusive\npost-secondary education laid the foundation for a good life today.\nWe're all here today talking about education.\nThe some ways our state needs to keep doing well, and other ways in which our state is\nfailing our children, especially children with disabilities.\nWe need to value education for all of Georgia's children and youth.\nWe need to fund what our students need to succeed, and we need an education to be inclusive\nnot segregated.\nInclusive education means using different educational tools so we can educate students\nwith disabilities alongside their peers.\nWhen inclusive education is done right, there is a lot of research and there is a lot of\nreal-world experience that shows inclusive education is best for all students, not just\nstudents with disabilities.\nOn Georgia's roadmap to inclusion, which is a document my team and I have produced and\nwe will share with you, you can see there are a number of steps to this.\nSome of them can and should be done now, such as making sure retired teachers can come\nback into the classroom, ending the Gnet system, and making inclusive post-secondary education\ngrants permanent.\nAnd there's something we need to start now.\nWe need to overhaul the QBE.\nThe Quality Basic Education Act that directs how Georgia's public school systems are funded\nwas created in 1985.\nIt has not had a major update since.\nMore than 40 years old and it does not reflect the needs of today's world or today's students.\nI'm going to hand it over to our host today.\nHe's a legislator who is championed in Georgia with disabilities and that is Senator Billy\nThank you all for being here. It's such a great crowd. I'm Senator Billy Hickman from\nStates of Georgia. I represent Senator District 4 and of course one of my favorite people\nOh, here's the day you're not smart, huh?\nRight here.\nOh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nAh.\nEveryone here who is behind me,\nto head to rights that day to serve.\nThank you.\nAll right.\nYou know, some people may think Martha's shy,\nbut she's not.\nThank you, Martha.\nWell, thank you all for being here today.\nK-12 education is one of the most influential peers\nin a young person's life.\nespecially for students with disabilities.\nThe experiences, support, and expectation\nset during these years shaped long-term outcomes\nin employment, independence, and community inclusion.\nSenate Bill 150, which is my bill,\nis an important step in the right direction\nby strengthening the teaching workforce\nand bringing high quality, impactful educators\nback into the workforce and classroom Senate Bill 150\nhelps ensure that students across Georgia,\nall of students across Georgia,\nincluding students with disabilities,\nhave access to a strong and consistent education.\nThis bill is not the final step\nin making our education system fully accessible\nand inclusive, but it is a meaningful\nand necessary starting point.\nI am so proud to stand with the disability community\nin supporting Senate Bill 150\nand to continue to work to ensure every student in Georgia\nhas the opportunity to succeed.\nThank you.\nWoo!\nWoo!\nAll right, we all knew legislators move quickly\nin and around these parts.\nI don't know if Senator Dixon is here or representative Lim.\nI know they had both mentioned wanting to speak.\nI got somebody, hey, come on up.\nRepresentative Lim.\nThank you all so much for having me.\nAnd thank you to Chairman Hickman,\nSenator Hickman for the work that he's been doing.\nI don't think any of us like when people make assumptions\nabout us, even if it's well-intended,\nand especially if they're wrong.\nAnd a lot of well-intended assumptions have been made\nabout education for people in the community\nof people who are disabled for many, many years.\nBut we know, you all know, and if you don't know,\nI'm telling you that the research,\nthe actual lived experiences shows\nthat inclusive education, integrating people\nwith disabilities in our classrooms,\nraises everyone's level.\nThose who are disabled and those who are not.\nAnd that's why I'm so grateful that we are making this push.\nI know Senator Dixon, we introduced a joint resolutions\nto study this issue in both the House and the Senate last year.\nAnd I know we've been pushing it.\nWe're both part of the Gwinnett delegation.\nWe sat down with our interim superintendent last summer,\nalong with a great advocate, Chelsea Hutchings,\nto really push this in Gwinnett.\nBut we know that we need this throughout the state.\nIt's time to stop making those assumptions.\nthere are so many paths forward\nand I hope that you will join us\nbecause again, I will repeat,\ninclusive education for people with disabilities\nimproves all education for all of our students\nK through 12 and beyond.\nSo I'm so grateful to be here today\nand thank you to you all for what you are doing.\nThank you.\nYeah.\nYeah.\nYeah.\nThank you so much.\nAll right, we have, I don't think\nSomebody stop me if I'm going off script here.\nBut we have a young man who calls himself\na survivor of genets.\nSo think about that for a minute,\na survivor of public education, segregated education.\nI want to invite Daniel to come to the microphone now\nand share his experiences with us.\nHow are you doing everybody?\nMy name is Chris Fix and I run Reflection Life Coaching and I'm fortunate to have one\nof my clients here.\nThis is Daniel and he had a pretty harrowing experience through G-Nets and he wrote this\nletter a long time ago when I first met him and I was approached to if I had any clients\nwho experienced Jeanette and I said I did and I'm really proud of him just for being\nhere.\nA lot of anxiety for him so he wrote this so I'm going to read this on your behalf.\nMy name is Daniel Firebird and I was diagnosed with Asperger syndrome from a very young age.\nAs such I was placed in special education for all my school life.\nI was unfortunately admitted into the Jeanette system through false pretenses and I'm very\nlucky to have survived. My story started not in Genets but at Johns Creek High School,\nwhere I was physically and emotionally abused by the heads of the special needs department.\nAfter they performed many illegal acts, bribes, death threats, and false reports,\nI was admitted into Genets, specifically into North Metro program.\nDescribed to many as the only other option besides jail, the environment was horrible,\nall the students were struggling, some having been to prison at least once already,\nHalf of each assigned school location is designated to contain the low-functioning autistic students.\nYet, the teachers were ill-equipped to deal with some of them.\nAs they often came over to our side, screaming and coherently and destroying the place,\nbecause that's how their brains worked.\nResource officers were often called in to restrain and inject medicine,\nand the rest of us weren't allowed to defend ourselves,\nbecause that was considered destructive behavior.\nThe program advertises the level system.\nto interest parents proposing it is a means of transitioning to normal school through continued\ngood behavior. What they don't realize is that it's an inescapable trap designed to keep students\nthere forever. Whenever a student maintains perfect behavior and follows the programs rules perfectly,\nthey would always be unable to reach the final level due to unacceptable behavior.\nAnd they weren't allowed to know what they did wrong. I eventually reported my encounters at\nat Johns Creek High School at my experience with North Metro and IEP meeting and the head\nof the entirety of Fulton Schools was there. School faculties, everything. He promised he\nwould launch a full-scale investigation only to illegally falsify one. Weeks later, contacted\nmy parents telling them I was just trying to get out of work. I was not contacted as part\nof the procedure and a trip to JCHS years later revealed they never even set foot inside\nthe school. No where's there any communication to them from an investigators. My parents\nfinally caught on to this scheme. However, the application of the G-Nets takes away parents\nlegal rights to withdraw students from the program. So I've had to be taken out of school\nentirely. I've yet to earn my high school diploma as a result. To the entire state of Georgia,\ndo better. Don't destroy lives. Troubled students are not a problem to contain. They're a\ntreasure that's been buried. And today we're here to unearth the grave digger.\nGenets, shut it down and start fresh with people that actually care because\nsimply saying you care has lost all meaning.\nAnd I don't want to point out Daniel right now is living in a three-bedroom condo\nand he has a job and he has friends for the first time in his life. So I'm so\nproud of this guy.\nHello, my name is Amanda Morris, and I'm the mother of a nine-year-old son named Gabriel.\nGabriel is bright, curious, and full of potential.\nA few weeks into his kindergarten year in 2022, he was placed into Gnet's program.\nWe were told there are only options where Gnet's or homeschooling.\nFeeling that I had no other choice, I agreed to Gnet's.\nAfter the four years Gabriel has been enrolled in Genets, he has experienced constant turnover\nof teachers and paraprofessionals.\nMany of the teachers were not certified in special education and he has had over six\nparapros in four years.\nGabriel's IEP requires him to have a one-on-one aid, but after all the aids left, the Genets\nprogram took the one-on-one aid out of his IEP without my knowledge or consent.\nIEP goals were not being met. Instead of trying to improve the Gnet's program took important\ngoals out of my child's IEP. Gabel is now in third grade. The school insists that he\nis on a grade level reading, which is not true. My third grader is reading at level below\nkindergarten. He is only given pre-K level work and he's not receiving instruction that\nwould allow him to make meaningful progress.\nThe problems are not just academic.\nGabriel and his Jeanette's classmates\nare completely oscillated from their peers.\nThey're not allowed to interact with other students,\neat in the cafeteria or play on the playground.\nThey are often made to watch other children participate\nin activities through classroom windows.\nGabriel has a gluten and dairy allergies,\nand the cafeteria frequently has no safe food options for him.\nDuring second grade, I packed his lunch every day.\nEven then, Gabel often did not eat\nbecause he was being severely bullied.\nBy the end of that year, my nine-year-old son\nhad lost nearly 30 pounds.\nThis nightmare is my son's reality\nand is happening in Georgia Public School system.\nIn the past three years, I have repeatedly asked\nfor Gabel to be returned to a regular\nspecial education classroom and get the support he needs there. Each time I\nhave been told that he must earn his way out of Genets, but the school has not\nexplained how to earn his way out. I want my son to succeed and learn alongside\nhis peers, but there is no clear or realistic path out of this program. I believe\nthe money spent on Genets would be far better invested in supports that allow\nstudents to remain in inclusive school settings. When children with\ndisabilities are educated in regular classrooms but the support they need,\nthey are better prepared for adult life, independence and meaningful\nemployment. Thank you for allowing me to share a gable story. I hope it\nurges you to make the right decision for my son and so many others by ending\nand giving all Georgia children what they need to succeed.\nAll right, Justin.\nYes.\nHello.\nMy name is Justin Andre God, or you can call me Justin God, because I rather prefer both.\nSo today, I am in, okay, let me refresh, I'm so sorry.\nSo today, for my speech, I am going to talk about IPSE\nand also everything else in my life.\nSo I am an official inclusive post-secondary education graduate\nwho accomplished Project CEDA, Georgia Lenn, and the GSE ideal program,\nand even Project CEDA too, because I forgot about that part too.\nsince that already happened last year in 2025.\nSo, I was proud that I was accomplishing some of my classes for film,\nwhen Project CEDA and the Ideal Program at GSU\nand very blessed about it and I'm very proud of myself for doing all those things.\nWhen I was attending the IPSE, I wanted to make new friends,\naccomplished some of my ideal and filming classes.\nPractice elevator speeches, learn about the large\ndisability community, family mentors and individuals with\ndisabilities from the Georgia Land Program, and finally,\nI wanted to make good memories with my friends and family.\nActually, yeah, just friends and peers, especially family members,\nfrom the ideal and the Georgia Land Program,\nbecause I have very good people to help support a guide me,\nbecause I need all the guidance that I need,\neven though I'm still autistic,\njust like the other disabled people\nwho are autistic as me.\nBut at least I had a good time with the people that I know,\nand love who helped me get to some of my new parts\nfor my future, and very happy about it.\nNow for my wife, I got a new awesome job at 23 East.\nSo let me tell you about that.\nSo 23 East Group is evolved with marketing,\ncommunications firms, web design for nonprofits,\nand social media platforms.\nIt's we've done like social media,\nand I also do marketing,\nbecause I'm officially an employee there right now.\nI used to be an intern there back in 2023,\nbut now I am an employee there,\nand even though I did the G's for Georgia this year.\nAnd now for the rest of my life,\nI make YouTube videos because I'm an official YouTuber\nsince I have a YouTube channel called,\nI am just and I've done for 10 slash 11 years now\nsince I was 12 years old.\nAnd I love building Legos because that is one\nof my most favorite hobbies that I like to do.\nAnd it's definitely a part of me\nbecause it makes me for who I am\nand I am such a creative person since I'm always into film\nbecause I've been watching a lot of Marvel movies\nwhich I'm totally obsessed with Marvel\nbecause I am a huge Iron Man fan\nand I'm just very happy about it.\nAnd it makes me for who I am right now.\nSo that is my entire speech.\nSince IPSE was a very good fit for me\nand I'm glad I get to be part of the ideal program,\nthe Wend program, Project CEDA.\nAnd let me look back at my speech really quick.\nAnd yeah, also be part of the 23 East Group too,\nbecause I'm blessed to have everything here\nin Atlanta, Georgia, since already makes me happy\nand I'm glad everyone let me get to those cool parts\nfor my future.\nSo that is my whole speech.\nAnd I hope you enjoyed it,\nbecause I want to make it nice and very zesterful.\nSo zessilator and I just want peace.\nSo Justin is an example of why Inclusive Education works.\nI want to invite a champion of Inclusive Post-Secondary Education, Representative Katie\nDempsey, to say a few words, someone with personal ties.\nWell, good afternoon.\nI'm speaking to these guys back here.\nOkay?\nWelcome to your cap at all.\nYay!\nWe made sure we had a lot of people here today\nto welcome you, okay?\nAbout the biggest crowd we've ever had.\nI think in the end this whole building today,\nI know it was a little hard to navigate at times,\nto walk around, but thank you for being here,\nfor telling your story, for encouraging others to do a program just like you are doing.\nIt's hard work.\nYou got to do well all the way through school to get to go to one of our colleges and do\nan Ipsy program.\nBut I just want to say thank you and all who lead in this world and all who carry it forward\nbecause the reality is there's a lot of ability standing on these stairs.\nThank y'all.\nGood afternoon, my name is Crystal St. Pierre Stackpole, and I'm here to close this out.\nI'm a member of the Georgia Council on Developmental Disabilities.\nI'm also a longtime educator.\nMost importantly, I'm an advocate for my brother, Trey, that's 37 that has Down syndrome,\nto advocate for other Georgians with disabilities.\nI thank you for the evidence today\nfor why Georgia must change its educational system.\nWe need to make Ipsy grants permanent.\nWe need to get qualified retired teachers\nback into our classrooms.\nWe need to fund therapeutic supports.\nAnd for my buddy Gabriel, who is so special to my heart\nand kids that go through the G-NATS program,\nwe have got to end the G-NATS program.\nAnd most of all, we need to update QBE\nto find what Georgia students need to succeed.\nI have seen it with my own eyes as a teacher.\nAll of our children can learn if we do the right thing\nand if we use the best practices of modern education.\nPlease join us in our advocacy\nto invest in Georgia's children.\nWe'll now take questions.\nWoo!\nOh!\nOh!\nOh!\nOh!\nYou're gonna give me a little time, please.\nAll right.\nThank you all so much for being here\nand bearing with us on the marble floor.\nDo we have a question over here?\nAre you okay with this?\nI'm okay with this.\nI'm okay with this.\nWe're gonna have a time.\nI'm okay with this.\nI'm okay with this.\nOkay. No, thank you. The question was, do we have a timeline for getting rid of\ngenits and overhauling the QBE formula? Especially for QBE, this is going to\ntake a lot of players besides us, and there's been a big push lately of\ndifferent folks in the education community talking about that. What I would\nlike to see happen is a commission form to take action on meaningful QBE\nreform. I think within the next, you know, what, two years, three years, because\nQBE is massive, it's going to take some time.\nWith Genets, what we are hoping to see is a phased out approach, you don't want to just\nshut the doors.\nAs much as we want everyone out of Genets right now, we need students to be supported in\ntheir homeschools.\nSo what I would suggest is an approach similar to what was done with ending sub-minimum\nwage for people with disabilities.\nThere was legislation passed last year, sponsored by Senator Hickman, that ended the antiquated\npractice of being able to pay people with disabilities less than minimum wage.\nThat was legal at this time last year.\nThat practice is now being phased out over the next few years.\nI think in all reality, a similar approach would be needed over the next few years to\nphase out G-nets and bring those students into regular school with the supports they need\nto succeed.\nThank you.\nOkay.\nThank you.\nother questions. All right. But in that case, that concludes our time. Those of us who spoke\nwill be available to speak afterward. Thank you all so much for being here and for advocating\nfor Georgia's children and youth.\n",
  "updated_at": "2026-02-12T01:32:55.761266+00:00"
}