{
  "video_id": "jg04DXqy0qw",
  "url": "https://www.youtube.com/watch?v=jg04DXqy0qw",
  "title": "3/21/23 - Committee on Ethics",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 2,
  "summary": "Overview:\nThe Georgia legislature's Committee on Ethics met on 3/21/23 and approved three new caucus applications with no notable debate or opposition.\n\nKey Actions:\nNo bills were passed or referred.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee chair opened with a brief prayer.\n- The chair noted the presence of a quorum and proceeded to the sole agenda item.\n- The committee unanimously approved caucus applications for the International Caucus, HBCU Caucus, and American Irish State Legislators Caucus.\n\nVotes:\nThe committee unanimously approved the three caucus applications.\n\nAttendance:\nThe chair noted the presence of a quorum.\n\nAdjournment:\nThe committee adjourned after completing its sole agenda item.",
  "transcript": "You\nThank you to the members who are here this afternoon.\nI'd like to call the Ethics Committee to order.\nI'm going to open with a brief, very brief order prayer.\nFollow me, thank you for good days and great opportunities and ask that you continue to watch\nover us as we do the business of Georgia.\nChrist name.\nAmen.\nAll right, committee, thank you for being here.\nWe have a chair notes the presence of a quorum and we will take up only one agenda item\nand that agenda item is the approval of three caucus applications in your folder.\nYou see three caucus applications, one for the international caucus, proposed by\ncaucus chair Don Zell James, any discussion, hearing none.\nThe HBCU caucus, co-chaired by the President Pro Temp, Kennedy and Senator Sonja Halprin,\nany discussion, hearing none.\nThe third caucus is the American Irish state legislators caucus,\nchaired by Senator Mike Dugan.\nAre there any questions?\nHearing none, the chair entertainer motion moved to approve these three caucuses.\nSecond, a motion by Senator Strickland.\nSecond by Pro Tem, Kennedy, all those in favor?\nAye.\nAll those, there you go.\nAye, that's good.\nAll those opposed?\nCheers none, motion carries.\nThank you to the committee.\nNo further business.\nCommittee is adjourned.\nAll right.\n",
  "updated_at": "2026-02-12T03:20:25.127553+00:00"
}