{
  "video_id": "JJA0nENgk2A",
  "url": "https://youtu.be/JJA0nENgk2A?t=1325",
  "title": "Georgia House - Day 35 (2026-03-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-16",
  "duration_minutes": 239,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 35 (2026-03-16) session:\n\n**Overview**\nThe session featured a prayer by Pastor Clay Smith, who delivered a thought-provoking speech on the importance of physical health, especially for leaders. No significant legislation was passed, but several bills were introduced and referred to committees.\n\n**Key Actions**\n- **HB 711**: Referred to committee\n- **SB 140**: Referred to committee \n- **SB 193**: Referred to committee\n- **SB 40**: Referred to committee\n- **SB 55**: Referred to committee\n- **SB 5555**: Referred to committee\n- **SB 90**: Referred to committee\n\n**Bills Introduced (First Reading)**\n- HB 711\n- SB 140\n- SB 193\n- SB 40\n- SB 55\n- SB 5555\n- SB 90\n\n**Notable Moments**\n- Pastor Clay Smith delivered a speech emphasizing the importance of physical health, especially for leaders, citing biblical principles and personal experiences.\n- He addressed topics like the stewardship of one's body, the witness of one's physical health, and the need to prioritize family.\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nThe transcript indicates a quorum was present, with all members having voted on an unnamed motion.\n\n**Adjournment**\nThe session adjourned, but the next session date was not provided.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I have all members voted I have all members voted if so, the clerk will lock the machine doorkeepers will please close the doors and keep them closed reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 46th House District, Chairman John Carson's representative Carson's. Thank you, Mr. Speaker. I write this morning to present our senior pastor from Johnson's very Baptist Church and actually in Chair Lady Sharon Cooper's district, Clay Smith. Clay is a native of Myrtle Beach, South Carolina, graduated from the University of South Carolina and is an avid gamecock fan, so I don't hold that against him though. He later went to Southwest, a Southwest Baptist Theological Seminary in Fort Worth and has been serving at our church, Johnson's very Baptist in East Cobb since 2019 and actually he started in the role in five months later, I think the the pandemic hit didn't it Clay. He's married to his wife Terika, they have three beautiful daughters and I know you're going to enjoy hearing from him, Pastor Clay Smith. Well, Mr. Speaker and Representative Carson, thanks so much for having me today. It's good to see all of y'all. Really appreciate what you do. I have a small glimpse into what you do. My first job out of college, I was working for our lieutenant governor in South Carolina and I just appreciate the service that you do for our state. I don't know if you have any days where though they happened years ago, they seemed like they were just yesterday. I have times like that in my life. One of which was two weeks before I graduated college. I had locked myself out of my apartment, had a break in through the window I got in. We used to have these things called answering machines. I don't know if you remember those and the little red light was beeping and the phrynamon from high school called and said Clay, you need to call your mom immediately. So I called my mom who was in Greenville, South Carolina and she was crying and I just remember this one phrase. She said Clay, your dad had a heart attack and he's gone. Two weeks before graduate college, he was 53. His father had died of a heart attack close to the same age and I have a good grasp on God's sovereignty and how our days are numbered. At the same time, if I could say this humbly, I think my dad died early. He was not a man who took care of himself. He was stressed out always on kind of yo-yo fat diets. So it didn't surprise me at a heart attack. It just surprised me that it killed him. I grew up myself being relatively unhealthy and eating habits. That kind of thing. When I shop for clothes as a kid and shopped in the Husky section, but I remember that in the Husky section, who came up with that? The Husky section. Well over time, over time, I think because of my dad's death, because my own journey with health, I've learned to really appreciate the value of health, not just mental health, emotional health, relational health, but even physical health. And as a pastor now, I see in our church, in our world, people that struggle. I think we all do to some degree. And let me just say something that will be very controversial, though I don't mean it to be. I just think it is. At least in the church, a majority, a majority of the sicknesses and surgeries that we pray for are preventable. Not all, but a majority. Now why don't we like to talk about health? Several reasons. One, it's normal to us, isn't it? We live in an age where we love food. I love food. As a pastor, as a legislator, you are around barbecue and things all the time. At Christmas time, I get 30 different cakes delivered to my house. At our church, our kids memorize Bible verses and we give them candy. That's just what it's normal. And we're around that kind of food all the time. Most of the time we pray for our food. We're asking God to do a miracle. Are we not? Dear Lord, would you bless this food to the nourishment of our body? And I wonder if God's like, really? Okay. So this is normal. You know what else we don't talk about it? It's because there's a lot of shame there. And the lab is filled and competent. We feel like we're not disciplined in the way we should. And we're just overwhelmed by the whole process. So I know I have just a few minutes with you. I want to talk to you briefly about a couple reasons why you need to take your health seriously, particularly as a leader. Let me give you four quick reasons. I'll go through these very quickly. Number one is because your body is alone to you by God. That's the principal stewardship, is it not? God owns it and he loans it. And that's true of a lot of areas in your life. It's true of your physical body as well. First Corinthians 6 says that your body is a temple of the Holy Spirit. Now those of us who are followers of Jesus, we understand what he means by that. That when we accept Christ into our life, the Holy Spirit comes in us and our body is where the Holy Spirit resides. But there's also a general principle for all people. There are God says, honor me with your body. So we are to be good stewards of our body. And just very practically, means as a leader, you have to be good stewards of simple key areas of your life, like nutrition, like your sleep, exercise, and even stress. You're not a victim of stress. You actually have a lot of control.\n\nover that and it's because you are to honor God with your body. You know why else you should take your health seriously, particularly as a leader? It's because your body matters to a watching world. I think about first Samuel 16 and there's a story about when Samuel is gonna select the new king and you may know the story, especially if you're a follower of Jesus, but he's gonna select David and God gives Samuel his principal. He said, man looks at outward appearance, but God looks at the heart. And that's a good thing that God ultimately looks at our character, our virtue, who we are as a person, but it's also true that man looks at outward appearance. And as a leader, I wonder what impression do you give by your temple, by your body? Does that give the impression of a disciplined life? Not in a vain way, as if you're trying to be on the cover of a magazine, or you're trying to get abs. You know, a lot of y'all say your abs are so important to you that you keep them protected under a protective layer, every single day. But your body matters to a watching world. That's the second reason. Third reason why your body matters, your physical health matters, is because your family deserves your best. I don't know what your job is like. I can tell you it's a pastor. I live with a lot of occupational guilt, because this is a never ending 24-7 job. And I leave the office every day with 20 emails I could have sent, but I did not. 20 phone calls I should have made, but I didn't. 20 things I could have done, and you leave every single day. And often my job gets the best of me. It gets the best of my creativity, my leadership, my energy. And then I come home and I have three girls. Y'all pray for me, I have three girls. And sometimes, if I can just be real honest, they get the leftovers. I had one of my daughters came down the stairs of the day and she asked for advice on something. I gave her what I thought was great sound advice to help her problem. She started crying and ran up the stairs. And I looked at my wife and said, I have no idea what I'm doing. I have zero idea, you know, how to lead these girls. But my family deserves my best. I had a great pastor friend who said, one time he said, the greatest gift you can offer your congregation is to be the healthiest version of yourself. And to some degree, the greatest gift you can offer to this role and to our state is to be the healthiest version of you. But here's the last reason why. And this is something I think we don't talk enough about because when we talk about physical health, we often don't think it's a spiritual issue though it is. And we often say, well, I just want to lose a couple pounds. But can I give you a bigger vision than that? The fourth reason why you should care about your physical health is so that you can lead longer. If you think about it, why do people want to get in shape? Well, it's because they want to look good. I think we all have to admit that's something that we care about. We don't want to be vain, but it is something we care about. I think the older you get, the more it's just you want to feel good. You're sick and tired, you're feeling sick and tired. But the great vision could be that you could do good longer. Now we live in the age we're in fatuate with youth and youthful leaders. But who's to say that your 60s, 70s and 80s might not be the greatest years of impact in your life? Hey, man. We just had church, amen, right here. But who's not to say that those couldn't be the greatest years in your life and you have to have a bigger vision than just losing a few pounds? You have to have the vision for what does it look like to be as healthy as long as I can? Why? So that can do more longer. So I just want to challenge you guys to think about your physical health, the impact it has on your leadership so that you could do good for the Lord longer. And the good news is in a couple hours, you got lunch coming and God's going to give you a test and he's watching. All right. Would y'all join me and let's pray together? Father in heaven, I thank you for these men and women for this job that is often a thankless one and yet is so important as they serve our state so well. Lord, I'm grateful as a constituent of the wonderful work that these men and women do. Lord Jesus, I just pray that you would help them to honor you with their bodies. Lord, not in a way that shames them or fills them with guilt, but Lord, they would take seriously what it means to take care of this body given to them. So ultimately, they can do more for you longer with a greater impact in their life. Lord, I pray your blessings over them as they go in this day and session, Lord, that you would guide them and lead them is in the wisdom that you want them to have. God, we thank you for today. We pray in Jesus' name, amen. And now would you join me in the pledge of allegiance? I pledge allegiance to the flag of the United States of America and to the Republic of which it stands, the foundation of the individual with liberty and justice. Thank you. Good job. Thank you. Stay right there and now let me get this a little bit done. Door, keepers may unlock the doors. Members, you may join Pastor Smith in the South, any room for some photos. And stay healthy. To turn on the feet of the symbol questa Chairman Tarvan, the chair of the Committee on Information and Audits is recognized. Thank you, Mr. Speaker. Mr. Speaker, your Committee on Information and Audits has read the journals and the legislative day and found it to be correct. It's the last day I'm on mentioned what day it is. It's day 35. And some of you guys, it's your first year I came in on day 21, I think. You ain't seen nothing yet. That's Tarvanology. Be awake, pay attention, and be here. On another note, Mr. Speaker, a river cuts through stone, not because of its power, but because of its persistence. No true words have ever been spoken, Chairman Tarvan. And you mentioned day 35, 36, 37, 38, 39, and 40. We'd be appreciated. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct is any objection to dispense with the reading of the journal. Chair, here's none. The reading of the journal is dispensed with is any objection to the confirmation of the journal. Chair, here's none. And the journal is confirmed. The clerk will read the resolution establishing the order of business far of the day. Perhaps, on the administration, the 104th Moose File and Be established as the order of business earned first part of the period unanimous consent. Introduction to bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business far of the day? Chair, here's none. And the resolution is adopted. First reading of resolutions, excuse me. First reading of bills and resolutions, the clerk will read. House bill 738, by the way, of Hilton and the 48th Jackson, the 128th Rhodes, the 124th Jasper, the 11th Berkwood, 169th. There'll be Todd on Act 2, men, chapter 2, and Todd on 34th, the bishop of Georgia and Intended relating to the Department of Labor. Industry and labor. House bill 739, by the way, of C-Ball, 34th Carson, the 46th, and all that was the 42nd Stoner of the 40th Parsons, the 44th and others. There'll be Todd on Act 2, men in Act creating the state court of Cobb County. House bill 740, by the way, of C-Ball, 34th, and others, the 68th and the 167th, the bill of the town of Act authorize the governing authority, the city of Hinesville, the Levy, and next-sized tax. Intergovernmental coordination. House bill 741, by the way, of Taylor, the 92nd, more than 91st, the bill of the town of Act 2, men in Act creating board of commissioners for Octayl County. Intergovernmental coordination. House bill 742, by the way, of Green in the 154th, the bill of the town of Act authorize the assessment collection of a technology feed by the Magistrate Court of Clay County. Intergovernmental coordination. House bill 508, by the way, of C-Ball, 34th, the third, Monttown, on the 17th, Tarbona, on the 2nd, Cameron, on the 1st, Chastain, on the 2nd, on the 7th and others. The resolution urging the Attorney General of Georgia to bring forward a claim before the Supreme Court of the United States. Interestate cooperation. House resolution 519, by the way, of the Jenkins, the 136th, per chair of the 176th, 9 to 134th, Chocos, 151st, Corporate of the 174th and others. The resolution creating, now, study committing, and phishing, access to fresh water resources. Judiciary. House resolution 520, by the way, of the Cooper, the 45th, Hilton, the 48th, Evans, the 57th, Smith, the 18th, Hunchets, and the 106th. Resolution urging members of the Employment First Georgia Council to develop recommendations. Industry and Labor. Senate Bill 294 by Senator Burns, 23rd, Bill B. Todd Lack, to provide a new charter for the town of Kamak. That's K-Mac. K-Mac. Enter, governmental coordination. That completes First Readers. Second reading of bills and resolutions, the clerk will read. House bill 728, by the way, of the 150th, Bill Torepil, and act, but create a board of commissioners of Webster County. House bill 729, by the way, of the 83rd, Roberts of the 52nd, all over the 82nd, a bill to amend and act to incorporate the City of Brookhaven in the cab county, House bill 730, by the way, of the 131st, Fleming of the 125th, you can know the 127th and the number of the 123rd, a bill to amend and act to create a board of elections for Columbia County. House bill 731, by the way, of the 85th, Lapton of the 83rd, Crawford of the 84th, Barnes of the 86th, Taylor of the 92nd, others, a bill to amend and act to abolish the offices of tax receiver and tax collector of the cab county. House bill 732, by the way, of the 154th, a bill to authorize the assessment and collection of a technology fee by the Magistrate Court of Quipment County. House bill 733, by the way, of the 130th, Prince of the 130th, Howard of the 129th, a bill to amend and act to regulate in public instruction for the County of Richmond. House bill 734, by the way, of the 150th, Bill to appeal and act to provide a new charter for the City of Preston in the County of Webster. House bill 735, by the way, of the 8th, the bill to authorize the governing authority of the City of Ohio, Ossi, Tulevi and X-I's tax, House bill 736. My reps of Williams of the 148th, and Hagen of the 156. The bill to amend and act to create a board of elections and registration of Ben Hill County, House bill 737, by the way, of the 150th, Bill to readopt and revise the laws pertaining to the Commission of Unified Government of Webster County. House resolution 488, by the repositive meek, 178th, jazz, president of the 11th, corporate of the 174th, House of the 170th, Jackson of 128th, resolution reauthorizing the House World Development Council, House resolution 489, by the representor of the 56th, Thomas of the 65th, Williams of the 168th, Jackson of the 128th, more of the 91st and others. Resolution recognizing the committee, vice president Kamala Harris, and recognizing the first Friday of October of each year as Kamala Harris State Capitol. House resolution 490, by the representor of the 59th, Townsend of the 100th, Saturday night. Glad glaze of the 67th, green the 154th, Hagen of the 156th, and others. Resolution creating the House Study Committee on Education, Funding Mechanisms. House resolution 491, by the representor of the 160th, seconds, Stevens of the 164th, Jackson of the 165th. Resolution honoring the life of Judge Willie Lowe Jr., dedicated in intersection in his memory. House resolution 492, by the representor of the 160th, second Westbrook of the 160th, Stevens of the 164th, Jackson of the 165th. Resolution recognizing, Roger Johnson, and dedicated in intersection in her honor. House resolution 493, by the representor of the 160th, Jackson of the 165th, Westbrook of the 160th, Stevens of the 164th, Resolution recognizing Mr. E. Larry MacDuffey, and dedicated in intersection in his honor. Senate Bill 227 by Senator Kennedy of the 18th of Williams of the 25th, Bill Toa Minden Act to create a Board of Elections in Bibb County. Senate Bill 292 by Senator Moore of the 53rd, Bill Toa Minden Act to provide a Homestead Exemption from Alcatusa County, School District Edelarm Taxes, 3 Second Readers. Report, sustaining committees, the clerk will read. Cups have camped on 35th district chairman of the committee and intergovernmental coordination locals submitted the following report. In the speaker committee on intergovernmental coordination locals had an urge consideration. Following bills of the House has struck the meeting of reports same back to the House of the following recommendations. House will 597 do pass, House will 666 do pass, House will 695 do pass, House will 702 do pass, House will 703 do pass, House will 708 do pass, House will 709 do pass, House will 711 do pass, respectfully submitted representatives of camp on 135th district chairman. Now completes the reading of the report, sustaining committees. Members, we're going to move on to morning orders. We have a technical difficulty with the machine. We're going to solve here a minute, but if I have your attention just for a moment, I'm sure these words will be echoed into the other chamber later today. Now as we all know in this House, we have all have a set of rules we have to inform with when we expect to pass legislation that's impactful on the people of Georgia. You introduce a bill, goes to committee, committee hears the bill and you hopefully pass it out of the committee. Then you do the proper paperwork to submit it to the rules committee. And I thank last time I checked Mr. Chairman, you expect the author of that bill to come to your committee and present the bill. That's our rules. That's how this house operates. That's how we operate with our friends on the other side of the chamber, on the other side of the building and the Senate. And we're going to work with them that way. We're not going to take any extra time with their bills. We're going to be proactive and we're going to do just what we always do. We're going to tend to the people's business in this House. And if they send us a great idea, we might make it a little bit better, right? We might make it a little bit better. But we're going to move forward with their good ideas. But they will have to comply with our process. And that's how we're going to conduct ourselves. That's how we're going to conduct the business of this House. And we know that the members of the Senate will certainly work with us on that. So I look forward to, and we have a technical issue that is completed. So we're ready to go. So we're going to take up another piece of business right here. Let's see. We're going to take up the local calendar now. For what purpose is representative Reeves rise? Mr. Speaker, may I make a request? You may make a motion. May I make a motion to remove House Bill 711, the Gwyneth County Homestead Bill from today's calendar. Representative Reeves has moved that House Bill 711 be removed from the local calendar and voted on later at another legislative day. Mr. Clerk, will you read the caption? House Bill 711, my reps on Reeves, of the 99th Gwyneth County of building increase homes that exception from Gwyneth County School District out of Lorm, Texas. All in the gentleman's motion that HB 711 be removed from the local calendar and voted on on a later legislative day is their objection. Here in none it is so ordered. We will now have third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Here in none it is so ordered that the clerk will read the local calendar. House Bill 597, my reps on Bentley, the 150th City of Anderson Bill, House Bill 666, by reps of Jenkins, of the 136th town of Blownoke, House Bill 695, by reps of Camp, of the 135th City of Tomiston, House Bill 702, by reps of Westbrook, of the 163rd Chatham County, House Bill 703, by reps of Westbrook, of the 163rd City of Savannah, House Bill 708, by reps of Chastain, of the 7th City of LJ, House Bill 709, by reps of Washburn, of the 144th City of Forsyth. Is there an objection to the previous question being ordered on the local calendar? Here is none. The previous question is ordered. Is there an objection to agreeing to the report of the committee? Is there an objection on the local calendar, but in the local calendar as a whole? The gentleman is objected to the local calendar? Does the gentleman move on the gentleman moves? Will Park, would you please clarify your objection to the calendar as a whole to a specific bill on the calendar? Mr. Speaker, I will waive my objection. The gentleman has waived his objection. We will move on to voting on the local calendar's whole. Thank you, Representative. Is there an objection to the previous question being ordered on the local calendar? Chair, here is none. The previous question is ordered. Is there an objection to agreeing to the report of the committee? Which was favorable to the passage of the bills? The chair, here is none. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar? Yes, all those opposed will vote no, and the clerk will unlock the machines. Representative. voting yes on this voting green if if you are I can have the clerk to register your vote in the machine until we respect until we repair your machine. The gentleman's voted indicated he will vote green on this on the local calendar. We will address your machine issues. Have the Grimmlands are here I guess the leprechauns are in the building someplace have all members voted. If so the clerk will lock the machines on the past of the bills on the local calendar the eyes are 157 the nays 0 these bills haven't received the requisite constitutional majority are therefore passed. We are moving on to morning orders. Now representatives we have a long list of morning orders I've been very compliant. We're giving you all the time in the world but this today we're going to ask you to pay attention to the lights right in front of you. We'll give you adequate warning we need you to comply with the best with a one minute time limit one minute time limit so we're going to start with representative a mighty Barnes for a morning order. And others thank you speaker and friends I'm going to try to be very very brief. All right let me see okay. Okay but first of all I'm happy to be here thank you speaker he's coming back in but the person that we have here today is someone that everybody in this body should have some type of relationship with that he can really help the individuals and the businesses. We have to be here with the business in your districts but we have today with us recognizing John Hope Bryant the founder of the operation hope and you guys have seen him on CNBC you've seen him on several different television shows you've seen him all over the world all over the country. We have a great quarter in Atlanta Georgia just a brief thing here John Hope Bryant is an American entrepreneur he's a thought leader and philanthropic leader who has been referred to as the conscience of capitalism by the CEOs of Delta Airlines Walmart first Republic Bank and countless other businesses. He's going to be here soon come down from the gallery he's going to be over in the room if you want to take a picture with him we have our proclamation for him here and he's joined also by his mom miss Juanita Smith and his president Brian Betts of operation hope and a few other people you all stand real quick y'all welcome in here and we're going to be going to the side okay. Thank you all.\n\nThank you, Representative. We appreciate y'all's work. Thank you being in the house. They represent how is recognized for a morning order. Thank you, Mr. Speaker. Good morning. Today we mark a sad anniversary. On the morning of March 16, 2021, a man bought a gun and by that evening had used that gun to murder eight people at three Asian owned spots in the Atlanta area. Of those eight murdered six were Asian women. These are the names of those we lost that day. Sun Chung Park. Hyun Jung Grant. Sun Cha Kim. Yang A.U. Xiao Jie Tan. Dao Yofong. Delania Yon Gonzalez. And Paul Andre Michaels. To the family members. Of those that we lost on March 16th, they're here with us in the gallery today. I'd like to acknowledge them. As we stand in their honor. Mayor memories of those we lost continue to be a blessing and may the injustice of these senseless losses continue to fuel the change we need to see. Thank you. I y'all below. Thank you, Representative. Thank you members. Riverside Barnes. Recognize for a morning order. Thank you, Mr. Speaker. As we continue women's international women's month, I would like to acknowledge one of my friends who inspires many women in our community and around the nation. She is a women's life coach. She is an entrepreneur, a mother, and a fighter for all the women in the community. She started the lifestyle exchange program, which empowers women to find their purpose and continue to do great within our community. Today, she's in chambers with us. And I would like to acknowledge Ms. Keiana Williams. Thank you for your community service. Thank you, Mr. Speaker. I yield the will. Representive Davis is recognized for a morning order. Thank you, Mr. Speaker. I ask all the nurses, doctors, other health care professionals, and those who have nurses in your family to join me up here to celebrate nurses. Nurses are the frontline angels in health care. Nurses have been voted the most trusted ethical profession for 21 years. Right now, our nurses are in the process of taking a picture with the governor. So I ask everyone to join me with celebrating today as nurses day at the Capitol. Thank you. Thank you. Thank you so much. Thank you, Representative. Representative Angela Moore is recognized for a morning order. Thank you, Mr. Speaker. Good morning, everyone. Well, Mr. Speaker, isn't it true that today is my legislative anniversary. And as such, instead of going out into the community, I decided to make brunch for the Georgia General Assembly. I hope that you all will join me in the anti-room. I tried to make a healthy lunch for you. Please don't let it turn into dunch. We may need the pastor to pray because I thought that I was doing good, but in retrospect, it's just as worse as the donuts that you all eat every morning and the sugar you pour in your coffee. Lastly, I'd like to, and you didn't say something there, Speaker, but it is true because the lady knows what she's talking about. Lady has the will. Speak home. And I'd like to thank the constituents of District 91. And now, and District 90 for putting their faith and power in me to send me to the Georgia General Assembly to be with all these great people, whether you all like it or not. I'm here to stay. Good morning and happy anniversary to me and District 91. And you'll be back soon. Happy anniversary. I'm not going to sing. Obviously, you were paying attention to the chaplain this morning, those comments. Thank you very much. Representative Roman has recognized for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Today is Muslim Advocacy Day at the Capitol. Just so you all know, the Muslim community is one of the most diverse communities in our country. Fun fact, although I am Arab, the majority of Muslims are not Arab. So here to blow your mind every single day. So please stop by. This hot wing steps around 1 o'clock. They will be here to meet with you, talk to you at the ropes. I also want to ask my fellow community members to please stand so we can recognize you. Thank you so much for being here. Excited talks to all of you. Yep, yep. And we have a very special group of folks from a local mosque that our brother Furukos to. Thank you, Mr. Speaker. We're recognizing Guneck's loving circle, Swati Muschit. So brother, Thariq, Siddiqui, Khalid Thili, and Mansoor Alam. Thank you so much for your contributions in Guneck County. Thank you so, so much. And I hope to see you all later today. Thank you, representatives. And welcome, Chairman Tyler Paul Smith, is recognized for a morning order. Thank you, Mr. Chairman. I'm joined by my friends, Lauren McDonnell. Got a little West Point grad over here too. And then, I'll represent in Franklin. But today, we have with us a native son, Wiley McDonnell. Lauren Wiley McDonnell, the fourth. And let me just tell you about this young man. He is a 3.7 GPA ever semester. He's been there, I believe, majoring in mechanical engineering. And he has just recently been recognized as the rising first sergeant for Papa Company over in Fifth Battalion to go get that crazy bunch over there and fifth straightening out. So we just want to recognize Wiley today, the son of Lauren McDonnell, our own Wiley. Thank you for making our state proud. And standing in a long line of Georgia cadets that have attended the Senate. I thank you for being with us today. APPLAUSE Mighty proud of that young man. Representative Lisa Campbell is recognized for a morning order. Thank you, Mr. Speaker. And I welcome all of my cobb, county colleagues to the diast this morning. This morning, we are recognizing Kenisaw State University. They are here with us today. It's KSU Day at the Capitol. They have been serving breakfast and entertaining folks all morning. They may be here in the gallery. If so, I welcome them to stand. John Carson shared some information on all of our desks this morning about KSU. And I just want to say we are so proud of all of our students here, the Georgia Government Association, our honor students, and certainly our men's basketball team, who will be going to the final four first game tomorrow. So go, owls. Who do you please welcome? KSU president Catherine Schwag, Casey Tanner, and all of our students here today who are doing such a wonderful job in their work and their studies and will be making wonderful contributions to Georgia in the future. Thank you. Thank you. Applause. Representative Hong is recognized for a morning order. Thank you, Mr. Speaker. And I'm going to have my UGA friend, Vice Chair Gaines up here as well. I have Professor Zhu Yang Kim with the UGA Cox Center. And along with him, we have 21 South Korean government officials, as well as journalists that are sitting here under the Kim Fellowship. So if you can help me welcome them, stand up. Thank you. We're going to recognize our doctor then, Representative Carolyn Yigley, from Owen Columbus, going to do that for us, Representative Yigley. Thank you, Mr. Speaker, ladies and gentlemen of the House. It's my honor today to recognize our doctor of the day. She is Dr. Komisha Harbison. And Dr. Harbison began her career in obstetrics and gynecology in 2013 after earning her Bachelor of Science and Master's of Arts undergraduate degrees from Xavier University. And she earned her Doctor of Medicine from University of Iowa at the Roy J. and Lucile A. Carver College of Medicine. Before she attended medical school, she was a teacher. And she spent many years teaching honors level biology and chemistry courses to high school students, as well as the physical exam skills to the second year medical students. Outside of her career medicine, Dr. Harbison is passionate about volunteering, mentoring young women and reading. And I am so proud that she serves us at the Valley Healthcare System, which is one of our federal qualified health centers in Columbus. And I can't leave without telling you that she is a member of Alpha Capital Sorority Incorporated and the links of Columbus, Georgia. And also, she is the daughter in love of our own Senator, Senator Ed Harbison. So we're excited that she's here with you today. And I don't think me and I'm going to be having many babies, but go by and see her anyway. Thank you, Mrs. Speaker. Thank you, Representative Heagley, Dr. Harbison. Thanks for being here with us today and taking care of us and go by and see her. I know she comes from a great family and doing great work over the Columbus area. We have a special resolution. We'll invite Representative Becky Evans and her guest to come up for a special recognition. Thank you, Mr. Speaker. Good morning, colleagues. Today, I mean, first I want to say, top of the morning to you. Yes, I know we'll be celebrating St. Patrick's Day tomorrow. But today, I am pleased to honor MedShare, a humanitarian organization dedicated to improving the quality of life of people and our planet by sourcing and directly delivering surplus medical supplies and equipment to communities in need around the world. I had the privilege of touring the MedShare facility with Representative Regina Lewis Ward on Earth Day in 2021. I was so impressed by all of these medical supplies that have been donated and delivered back out to needy organizations throughout the world and actually during COVID, they helped a lot of some Atlanta hospitals when our supply chain was so broken. So I'd like to recognize today March 16, 2023 as MedShare International Day at the State Capitol. And I would like now to introduce Mr. Charles Redding who is the CEO of MedShare. Mr. Redding? Yes. Thank you, Mr. Redding. Thank you, Mr. President. Yeah, so thank you, Speaker and Representative Evans. Really appreciate it. Let me start by saying, first of all, I am a Georgia native son and a Ramley wreck from Georgia Tech. So we'll get that out there. It is indeed an honor to accept this former recognition. Georgia is such a special place for us. And it's unfortunate the world today we live in. There's still a need for organizations like MedShare that stand to bridge a gap between surplus's need and make sure that people, vulnerable populations all around the world, including here in our community, have the tools they need to improve health outcomes. So thank you for declaring this day, MedShare International Day, and on behalf of our board, our staff and accountless volunteers that help make our organization special, we just want to say a hearty thank you to all of you. And thank you for the great work that you're doing. It's really, really appreciated. So thank you. Thank you. Thank you. Thank you. We appreciate what MedShare is doing, and we appreciate you all being here. And thank you, Representative Evans, for bringing this resolution. Thank you. The House will come to order. We will allow our guests to enter the South any room. If you would like to visit with our guest, feel, and you feel so lit. Please join them for a photo in the South any room. you you you you you you that completes our morning orders and our special resolutions. We're going to move on to the rules calendar. Thank you. you we're ready to move on to the rules calendar. We're going to take up a bill that's on your supplemental rules calendar. It's on your desk. Supplemental rules calendar. Mr. Clerk, will you read the caption to SB 140? SB 140 by Representative Summers. The 13th and others being titled to amend Article 7 of Title 31. The Fifth go to Georgia, and it's a related to regulation of hospitals and related institutions. So it's prohibits certain surgical procedures for the treatment of gender dysphoria and minors from being performed in hospitals and other licensed healthcare facilities. Bill haven't heard the committee on public health. That committee recommends that this bill do pass by committee substitute. Members, if you will, take your seats and cease conversation and give your attention to the gentleman in the well. Chairman Banner is recognized to present the bill. Thank you, Mr. Speaker. Good morning, colleagues. I rise the date of present Senate Bill 140. So I grew up in the mid-70s and 80s. I'm one of four brothers. When I reflect back on my childhood, it was pretty good. I've very fond memories. We played sports. We fished. We rode bikes. We spent time outside. We knew it was time to come home when the street lights came on. Maybe some of you can relate to that. I'm now a father of four. Two boys and two girls. Friends, I'm here today to tell you something that you already know. The world in which we are raising our children today is not the same world as the one we grew up in. There was no social media growing up. If you wanted to know what was happening in Fayetteville, you'd go to the local beauty salon or you'd go down to Malir's barbecue on a Saturday morning and you'd get the scoop on everyone. Smartphones didn't exist. But today, our kids are constantly bombarded by confusion and noise. As a youth pastor, friend of mine said, the issues we dealt with in our 20s are issues that our kids are having to deal with as early as age 8 to 12. As parents, our role is to help our kids navigate through the confusion of growing up in a society that is often over-sexualized and wants to place children in situations to make adult decisions they are not capable of processing. As legislators, we are charged with protecting our most vulnerable population in the state. Senate Bill 140 does just that. By establishing guardrails to ensure that children struggling with identity issues are not rushed into decisions that would alter their bodies forever. The bill prohibits medical providers from performing surgery or prescribing hormone therapy for the purposes of altering the sex of anyone under the age of 18. I say again anyone under the age of 18. If there is a valid reason to prescribe the hormones or perform a surgery for any reason other than altering the sex characteristics, the bill allows it. Violating this statute will result in sanctions from the composite state board of medical examiners or the Department of Community Health, including the loss of a physician's license. Without question, those who struggle with issues of identity will include gender dysphoria, deserve our compassion and our care. No one denies this. As a state, we have made significant investments in mental health care. And I pray we continue to support any effort to deliver the appropriate care to those whose judgment isn't fully formed. In limiting these irreversible procedures for minors, we are not only joining at least eight other states in the U.S. but other countries such as England, Finland and Sweden. Now opponents of the bill will make the claim that what we are doing is inconsistent with what we believe the role of a parent to be. But I would submit that SB 140 is completely consistent with our duty to protect minors. We limit the age for all sorts of activities and behaviors in Georgia, alcohol, tattoos, purchase of a firearm, driving, etc. The list goes on. Opponents also reference a medically accepted standard of care. The fact of the matter is that there is no consensus. And finally, opponents of the bill assert that we are criminalizing health care. This could not be further from the truth. We are simply establishing and statute what is legally permitted. Anyone in the state of Georgia who violates a law is and should be subject to those consequences. Senate bill 146 to strike the balance between providing proper level of care with the fundamental principle found in the Hippocratic oath. Do know harm. I believe this bill does that in a way that recognizes fully the reality of the world our children live in today while preventing a decision that can cause irrevocable harm. With that Mr. Speaker, I know there are a lot of speakers to the bill. I'll stand for a few questions. Gentlemen, as you will do for questions, you do have a few questions. Let me see. In fact, you have a lot of questions. Chair recognizes Representative Roberts for a question. Thank you Mr. Speaker. Will the gentleman yield? I do. This bill sets a dangerous precedent of overruling medical standards of care established by respected medical organizations. Will this body next regulate chemotherapy, heart transplants, MRIs? Is that a question to me, Representative? I would say we will do whatever the body chooses to do. I will state that it wasn't too many years ago that I believe it was House Bill 569 that was introduced by members of this body that regulated the use of conversion therapy for those under 18. What I think is the reason is that there is some appetite to tell medical providers what to do. Gentlemen, further yield? I do. Representative Chokus has recognized for our question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Thank you for bringing this legislation forward. And when we're talking about the age appropriate and putting guardrails on it, isn't it true that it is illegal in the state of Georgia to sell alcohol to a minor and also to sell cigarettes to a minor? The gentleman knows of what he speaks. Thank you. With that, Mr. Speaker, since there are those that want to speak to the bill, I will yield the well. Gentlemen, yield the well. Now, we do have a number of speakers signed up to speak to the bill. This morning per our rules. The rule that was adopted in the rules committee this morning that we have 30 minutes for those in favor of the bill and 30 minutes for those that are opposed to the bill. So what we're going to do, we're going to set the timer on 30 minutes and we're going to start this begin this discussion. I'll recognize those opposed to the bill. And your time is to be distributed amongst the members opposing the bill. So I'll just say to you all, you're allowed to make your own judgment on how much time you want to speak and how much time you want to leave for your fellow representatives. So at this time, I will recognize representative Ramon to speak to the bill. Representative Ramon. The lady is recognized. Thank you, Mr. Speaker. Good morning, colleagues. I'm sure a lot of you are wondering why someone like me would speak out against this bill, particularly because my community is relatively conservative on these issues. But I'm here once again to talk about unintended consequences because apparently that's been my brand around here.\n\nThere has been an increase in bills targeting this community. While I'm sure many of you have the best intentions, the unintended consequences are far too severe. And there will be those that will share way more facts about that and are way more, have more expertise on this than I do. But I'm here to tell you that a lot of these bills, right now focused on medical issues, had started in other places, related to sports. Then there was messaging about what people are wearing and who's wearing what and who's dressing how and what they're putting on their birth certificates. And the not so fun fact is, I went through that as a kid. I was told as a child what I can and cannot wear while playing sports because people were too concerned about what was on my head. And those same laws and rules were then used last year on trans kids. So, I know that not a single one of you thought about someone like me when passing bills like this, but I can tell you right now that's where they started. And I'm here to implore you because I spoke into a lot of you. And I know that you have the best intentions at heart, but the unintended consequences of this kind of legislation will have terrible impacts on the kids that you are trying to protect because their parents know them better than any of us can and will. And it does not make sense that for those of us that have never spoken to those kids, that have never sat down with those kids, that have never heard those kids make laws about those kids. And so, I'm here to implore you, please, reconsider this bill and look at the potential unintended consequences and what it is setting up for for future legislation and how it can impact other people. Thank you. I yield the well. The lady has yielded the well. Representative Hutchinson has recognized to speak to the bill. The lady has recognized. Thank you, Mr. Speaker. Today, colleagues arise as a member of the Mental Health Profession. The bill today, one of the premises is that there's a rise of cases of trans kids in this state. And that is true. And the reason for that is trans kids are seven times, seven times more likely to commit suicide. Seven times. There's no other population with that kind of statistic. None. That means if in Gwinnett County, we had a hundred kids to commit suicide, we could have 700 trans 700 just because they are going through a clinical, a clinical treatment plan developed with their mental health professional and their parents. The cases are going up because we are recognizing them. We are hearing them. We are talking to them. And they know that we see them. They know that they can get help from us. And they feel comfortable slowly but surely coming to us when they're thinking of harming themselves. This is a win for the mental health community. This is a win. But this bill would set us back decades. We're talking about seven times the amount of kids, children, lives that we're supposed to protect seven times more likely to kill themselves. Kill themselves. That is really irreversible. And I bet you ask any parent if they would risk their child having a permanent change in who they are as a person, they would take that over their child being dead any day of the week. Mr. Speaker, I yield the will. Representative Park Cannon has recognized. Speak to the bill. The lady is recognized. Members, I come today to ask you to reconsider your position if you're supporting this bill into vote in opposition. I'm asking you as a person in this body who loves someone, who is transgender, who transitioned as a child, and who is a state of Georgia employee. I'm also asking you because I have a staff member who's watching right now, who transitioned as a child here in Georgia, and is thriving. In fact, she's the reason why I served my caucus as a secretary. I'm here to talk to you about research as well. There are some perceptions about trans people that I really think that we need to look at. We've had a survey of voters in Georgia. It's not an old survey. It took place this week. You want to know the perceptions of Georgians right now, who are voters as you're voting on this bill. Well, this is how it went. 40% of the respondents were called on the phone. The phone, the same phone that you'd probably called them on. Those 40% were then matched to their voter files to make sure that they were who they said they were, and they lived in the districts that they said that they lived in. Your districts are districts all across the state. They've been weighted the results by gender, by age, by race. And they did this precisely to make sure that the credibility interval, which is the theoretical margin of error, was plus or minus 4.4%. The results only a quarter would support this bill. Two thirds opposed this bill. In fact, the opposition was actually very strong. 58% strongly disagreed to the bill. The opposition to Senate bill 140 is bipartisan. It makes up 70% Democrats. There are 60% of the participants who were independent, and 59% were Republican. I thought it was so interesting that they were able to target deeply in North Georgia. 62% meaning 6 out of 10 North Georgians who they pulled, who were Republicans and Democrats opposed this policy. I thought it was so interesting because 62% in North Georgia, so what is it in Atlanta? About 70%. We're not as far apart on this issue because we understand how nuanced it is. This bill does not allow for the nuances that happen in gender affirming care. I'm here to talk to you about that today. It's the first bill of the day. We're really in no rush. And this really matters to people who need it. So what happens when someone is a child and their gender identity is forming? Is it swayed by makeup and beauty pageants, where they're forced to go perform on stage and smile, and move their bodies in ways that are not really natural? Or is it that kids find themselves talking to their preschool teachers when they're outside playing with the boys and the girls and they might say, I'm not a boy. I'm not a girl. Don't call me that. This is why educators have continued to start using gender neutral phrases for their class. All the preschool teachers in here like myself will know we say, hey friends, hey everyone, let's line up together. We don't do gender based teaching anymore. The reason why is because that gender identity formation, which is a social construct that can reinforce your genes. Your sex can be reinforced by medicine. I know deeply the people who this bill will impact. They're the same people who have called and emailed you and have gotten no responses. It's not right. We don't even have a single transgender elected official in the state house or senate. And yet we're setting policy. In the senate, we have someone who has a transgender child. And we did not listen to her on this bill. We all receive this letter. 500 medical professionals who have said that they are opposed to this bill. This impacts their practice. But in the committee instead, one person of medical experience spoke who does not serve any gender affirming clients. Zero she could not speak to. What's going to be the impact of this bill? I want to show you. Do you know what this is? These are black market drugs for gender affirming care. This is what parents will have to start giving their children. Similar to the THC issue we had here, where we were all so concerned about parents trying to help their kids through medical instances who needed support. Instead of having to travel state lines, go on the black market, order and get it in black bags. This, you have to break this. It is glass. It can be contaminated easily. You then have to inject with this. This is what we should be giving our students, our kids that need the support past the hormone blockers. This is given by a provider. A supportive provider. It has a prescription. It has information about what it does. Not this. I am begging you today. Please consider voting no on Senate Bill 140. I yield the well. The lady has yielded the well. Rupplin, I will recognize. Speak to the bill. Good morning again, colleagues. I rise to speak against SB 140. This bill would make it illegal to perform some forms of gender affirming care to transgender and gender diverse children in the state of Georgia. In conflict with the health policy guidelines set by the American Academy of Pediatrics among many other medical societies. The Georgia State Legislature should not be in the practice of dictating or restricting the standards of care determined by those who actually care for patients. If, for example, the legislature drafted a bill restricting prescription of certain chemotherapy agents for cancer treatment or started passing guidelines for perioperative approaches to treatment for acute appendicitis, we would all clearly understand that to be ludicrous. Why should politicians be able to pass laws that supersede established medical care standards? What patient would prefer their medical care be dictated by a politician rather than a doctor? Further, there was an amendment introduced to SB 140 in committee, which would create a cause of action where doctors could be held civilly or criminally liable for caring for transgender and gender diverse children according to the standards of care. Under which we are ethically obligated to practice. Simply put, SB 140 amounts to state mandated malpractice. I am enraged and dismayed that this bill passed out of a committee on which I serve, despite the best efforts of my colleagues to speak logic, to absurdity, and apply scientific rigor and data to anecdotal evidence and conjecture. I want to acknowledge the families, activists, and allies for continuing to work with us to defeat this bill. We continue to see you and stand with you and fight by your side. And I hope a majority of the members of this body will join me in voting no. Thank you. I yield the well. The lady has yielded the well. Representative Hulcombe has recognized the speak to the bill. Thank you, Mr. Speaker. I'm probably an unlikely person to speak about this bill. I'm straight white male. I don't have a lot of understanding about this issue and I'll admit that. Probably for some of you, this is an issue that's somewhat challenging and for which you don't have any personal experience. But I'm troubled by it. And I think those that are proponents of this bill believe that it will or is consistent with the medical principle of do no harm. And those of us that oppose it see it exactly the opposite. Is that we think that this bill will in fact do real harm to some of our most vulnerable citizens. I don't know how or why. Chance gender individuals have become a political punch bag, but they have. I think that's wrong. And with respect to the specific issues, you've heard some of the scientific reasons and the medical reasons to oppose this bill. I certainly agree with those and I appreciate my colleagues for bringing those forward. I want to just share with you and I really try not to make policy making through anecdote. But I will share with you a little bit of an anecdote on this issue. One of my law school classmates is Chance gender. And I watched her transition over the last few years. And I was surprised by it. I think a lot of our classmates were surprised by it. But I immediately reached out and said, I was your friend before. I'm your friend today. I'll be your friend tomorrow. And watching that process was remarkably eye opening. And again, it was the first time that I had experienced it in this way. And it was unbelievably difficult. People were not kind. There's a lot of name calling, a lot of nastiness. And what I saw was her name is Anne. Anne wasn't doing this to make anybody else feel uncomfortable. She was doing it to make herself feel more comfortable. And one of the things that we do here is we try to make good decisions and we try to help our citizens make good decisions. But I'll submit to you that one of the best decisions that we can make sometimes is for us not to be the ones making those decisions and those choices. And I really believe that this is an area that the state of Georgia should stay out of. It's a very difficult issue. It's one that we should let our doctors work with the parents, work with the children that are affected, give them the best treatment possible. And as you heard, what we're going to legislative mandate, legislative mandate and criminalize is a standard of care that is malpractice. And that is wrong. That is wrong. And looping back to the issue of the do-know-harma, I want to just emphasize that a little bit more. These children are really vulnerable. Their lives are not easy. We're going to make their lives even more difficult. And I really do fear that we may lose some lives by passing this. Not save lives, but lose lives. And that should get everyone paused to really think about what we're doing. So I'm sorry my thoughts weren't better formulated. I really wasn't prepared to speak about this today. But I am extraordinarily troubled by this pill. And I would encourage those of you that are thinking about voting for it to please reconsider and to vote no. Thank you. I yield the well. Representative Crawford is recognized to speak to the bill. And gentlemen is recognized. Thank you, Mr. Speaker. Colleagues, this morning I rise to oppose Senate Bill 140. There are so many thoughts that come to my mind, but let me first say that I'm deeply honored to be a member of this distinguished body. And even though I am a young freshman within this distinguished body, I have learned and grown so much just from being close and proximity to all of you. I've had the opportunity to learn about areas in the state that I honestly didn't know existed before being in this distinguished body. And so I thank you for that. And what I've learned is that we may have many differences. We may have different opinions. We may have different values, but we grow together because of our conversations, because of our interactions. But sometimes we may differ on how we come about to different policies. You may vote one way or I may vote another. Sometimes we vote particular ways because of fear, sometimes the knowledge that we may have. I am not a doctor. I am not a transgender. But because I am not a doctor and I'm not a transgender, if I'm going to vote on legislation, I try to do my research. And it is my belief, my opinion, that this bill is being voted on based upon some of our fears. In an effort to ensure that I have the best information possible when making my vote, I did a little research. The fact is this. If we vote for this bill as a body, this bill will severely limit, necessary and sometimes, life-saving healthcare for transgender youth. We are going to negatively impact the lives of so many people in our districts and in our state because of whatever fears you may have about transgenders. In fact, gender dysphoria, like other medical conditions, is best treated with collaboration among a multidisciplinary team of healthcare professionals and parents and guardians. It was mentioned earlier from the well that doctors, and to see that we have some in our gallery, must take a hypocritic oath. I didn't really know what was in that oath until again, I wanted to do a little research. In the modern oath, it says, and I quote, I will not be ashamed to say, I know not, nor would I fail to call in my colleagues when the skills of another are needed. I think that's important because again, gender dysphoria is something that needs multidisciplinary attention. And so now we as a body, a very distinguished body that has less than 3% doctors are going to now vote on a bill that's going to have such a negative impact. We are not doctors, we're lawmakers, and even though we are different, the one thing that does hold us together is the oath, like the hypocritic oath, that we took as a body. And within that oath, we've said that we are going to ensure that we follow this constitution, the constitution of the United States as well, and that we will ensure that we act in a way for the betterment of not only the citizens, but the prosperity of this state. Voting in favor of this bill would make us hypocrites. Voting in favor of this bill would not be for the betterment of this state and the citizens within. But another fact, voting in favor of this bill would actually be against the United States Constitution. Our neighbors, Alabama, tried to implement a bill called the Alabama Vulnerable Child Compassion and Protection Act. That bill was going to try to limit how parents could treat their children just as this bill was doing. And the court in Alabama, the Northern District Court, rely on a Supreme Court decision, actually relied on Supreme Court decisions. And what this court said is that even though sometimes medications and sometimes procedures may be risky, was most important, is that a parent should have the ability to determine what is best for their child. That is one of the oldest rights in this country. This bill makes no exception for that. What this bill does say is that an operation can be done if it is deemed to be medically necessary. Well, then I ask you what is medically necessary. We've heard people come to this well before me and discuss that there are young people that are probably going to take their lives because of some of the issues that they may face. I'm going to ask you to oppose this bill and vote no for this bill because doing so will say multiple lives. I'm going to leave with this. This morning, on the 35th day of our legislative schedule, the pastor says your family deserves your best, the greatest gift that you can give is the best version of you. That right should be enjoyed by everyone. Transgender, not transgender, allow parents to make the decision. I urge you to vote against this bill. Mr. Speaker, I yield the well. Thank you. The gentleman is you to the well representing draper has recognized the speak to the bill. Thank you, Mr. Speaker. I rise today as a parent to oppose SB 140. I know that if I were to ask all of you, if you think you can make the best decision for your child, every one of you would say yes. Let's trust the rest of Georgia parents to do the same. Those are not my words. Those are the words of a colleague on the other side of the aisle in the Senate. And while he wasn't talking about SB 140, the sentiment is equally applicable here. Most of us who are parents, regardless of which side of the aisle we find ourselves, want the freedom to make decisions for our families and for our children. I know I do. Indeed, many of you in this chamber have said as much. You have declared that it is a parent's right to make decisions about where their children go to school, which books they read, and which subjects they study. And I suspect that there is not one parent in this chamber that doesn't believe that he or she would make be the one to make critical health should be the one to make critical health care decisions in consultation with qualified medical professionals for their minor children. And yet SB 40 attempts to substitute the judgment of the state for that of the parents of some of our most vulnerable children, those who identify as transgender. That is wrong.\n\nAnd it is not what this body should stand for. We know that gender-affirming care is critical for our transgender youth. We all know that mental health is a critical issue among Georgia's young people, and trans youth are at even greater risk for mental health issues, including an increased risk of suicide. Studies show that 56% of trans youth have reported suicide attempts, and some 86% have reported considering suicide. Not surprisingly, studies also show that transgender youth who receive age-appropriate gender-affirming care report lower rates of suicide and depression, and specifically for children under the age of 18, receiving gender-affirming healthcare was associated with a nearly 40% reduction of depression and a recent suicide attempt. LGBTQ plus children, and in particular, trans and gender-diverse children, are not born more prone to suicide than others. Nor are they inherently more likely to develop serious mental illness as they grow up. I think that's a really important point. They're not more prone to this. Trans children are at a higher risk for suicide and mental illness because of bills like SB 140 that take away their agency and ability to live freely and authentically. Gender-non-conforming children die every year because of policies that force them to live in shame and self-hatred. The lady's time has expired, she has 20 seconds to complete. Let me speak from the heart here. As a parent, you do not have the choice to say whether your child is tall or short. You do not have the choice to say what color their eyes are. You do not have the choice over whether your child is a boy or a girl or some way in between. When you choose to be a parent though, the most important thing that you can do is love your child and loving your child means standing up for them and ensuring they get the care they need in whatever form that takes. The lady's time has expired. I implore you, please oppose this bill. Thank you, Mr. Speaker. I yield the will. The lady has yielded the will. That's 30 minutes for those opposed to the bill. Now we will hear up to 30 minutes for those in favor of the bill. Representative Will Wade has recognized the speak to the bill. General has recognized. Thank you, Speaker. Good morning, colleagues. I come to you as a father, a colleague, and a former school board member who has spent the greater part of my adult life focused on protecting children and serving them to the best of my ability. Governor Kimpin, this house, have a steadfast history and record of protecting children. You know, childhood as Americans know it today seems to be a fairly new concept. We've gone from seeing our early years as a time of learning, work, and even starting families to a time of learning in play. We have a much greater understanding now of our minds and how they develop with age. We know now that our brains aren't fully formed when we become teenagers or legal adults at 18. For most people, it's in their early to mid-20s. Even our youngest members have lived through those years and can look back and recognize the path of their own maturity. Even then, it's often in our 30s that people begin to really understand who they are. Listen, there are many ways that we protect children during this time of development. It's crucial. We know how much change and how many phases they'll go through because we've lived those years and because many of us, we live it again with our own children. No matter how each of you vote today on this legislation, I have no doubt that every single one of you is acting in this belief or maybe just hope that it serves the best interests of children. We share a concern about kids facing mental health challenges in this state. This body has made great strides to that effort. We want them to feel love and understanding, not fear or isolation. For kids experiencing these feelings, I want to make sure they have access to high quality mental health services. I want them to have counseling and I think we should start with gender confirming care. The idea that a child's declaration of their gender identity should clear any obstacles to irreversible gender transition surgery stems more extreme political political orthodoxy than from what's in the best interest, the long term interest of the child. Over the next decade, I expect we will see gender dysphoria is based on fluid beliefs. Gender itself is not fluid. It is a biological fact. Nothing in this legislation stops an adult from pursuing a different lifestyle based on their feelings. We must draw a line for the long term protection of children. Opponents of this legislation suggest that these treatments are a cure all, delivering them to their true and proper destiny, but many of these procedures and treatment can actually bring physical problems such as causing bone density issues as well as short term and long term mental health concerns like anxiety and even worse in depression. We know that many who go through these surgeries regret it shortly after and even sometimes greater in life, later in life when they decide that they want to become parents. The fact is there is no cure all. These are complex issues and we're all unique. I'm voting yes today because I believe that childhood is about giving young people time to develop and letting them learn by trial and error, but while still protecting them from long term harms. It is our job as legislators and as parents to use our accrued wisdom to guide them on the right path so that at some point in their journey they're able to make good and right decisions for themselves on their own. I ask you to vote yes in the interest of protecting children. Thank you very much. I yield the well. The gentleman has yielded the well. Representative Earhart has recognized to speak to the bill. Thank you Mr. Speaker. Ladies and gentlemen I rise in support of SB 140 and speak to you both as your colleague and more importantly as a mother that raised four children and understands the driving and inherent desire to protect our children from all forms of danger. The danger that exists and simply crossing the road and the danger that exists down the road often as a consequence of the decisions our children make today. SB 140 is about protecting Georgia children from being sterilized and surgically altered by irreversible experimental medical procedures. This bill safeguards children who struggle with the mental health disorder known as pediatric gender dysphoria. It protects them from receiving dangerous drugs and irreversible surgeries to induce cosmetic changes in their appearances. This is a balanced bill that approaches the issue with three things. Compassion for the struggles that some of our youth face. An understanding of the limits that children have to understand long-term consequences. And finally, an acknowledgement that once adulthood is reached they will be more likely to have the cognitive ability to make an informed decision whether it be to transition or not. As a parent it concerns me to know that there is no long term study not one to show that these interventions are safe and effective for use in children's strategy struggling with gender dysphoria. Additionally, there is reliable medical concern that these treatments pose irreversible consequences to children's health up to and including sterilization. This is one of the more disturbing realities for children who receive cross-sex hormones long-term. A loss of fertility. This is proven and it's irreversible. Unfortunately, I've not heard one speaker today who's speaking in opposition to this bill addressed the fact that bisexual transitioning children, those same children are then deprived of the right and ability to bear their own biological children later in the future. The truth is the hormone treatments on children are experimental and no one knows the full extent of the medical or psychological impact of the life altering sex reassignment surgeries. Ask any parent if they would condone giving a child a drug that is not approved by the FDA and they would likely say no and yet none of these medications addressed here today are FDA approved for the condition of pediatric gender dysphoria and none have undergone rigorous FDA safety evaluations for this purpose. So what happens to these children when adults do not interfere medically with their natural development? There have been studies on this issue. 11 studies to be exact, three large and eight small studies with a combined total of 4,000 subjects. In these studies when young gender dysphoric children were not subjected to procedures like those prohibited in this bill but instead were supported in their natural bodies through puberty. These studies show that as many as 95% of the children wereverted back to their natural bodies by the time they reached adulthood. The common course is for most young children to outgrow conflicting gender identity by adulthood. But what if they've been administered synthetic hormones for years? What if their bodies have been permanently surgically altered? What does that mean for them? What does it mean for me and you as parents? It means we've taken away that child's ability to change his mind or her mind. Parents often wonder how our children will reflect on the decisions they make later in life in adulthood and an increasing number of young adults in the US are expressing painful regret for undergoing these interventions as teens that have forever impacted their health, appearance, fertility and sexual function. These young adults are called D Transitioners. You may have heard of them and they represent a growing and increasingly vocal group of thousands across this country and Europe. They've formed associations, support groups and nonprofit organizations. They are sounding the warning bell that some trans adults will come to regret the permanent decisions they're making in their youth. As a parent and a former teenager myself, I know firsthand that permanent life altering decisions may seem rational, very rational in the mind of a 15-year-old, but not so much in the mind of an adult with a fully formed frontal lobe and the cognitive ability to finally understand the permanence of one's actions. Some parents and physicians have been misled and I know that as a parent this perhaps is one of the scariest things of all is the thought that our child might be driven to take their own life. Some parents and physicians have been misled to believe that their children and patients will be at greater risk for suicide without these interventions. There is no scientific evidence to support this claim. I know we have well-meaning colleagues here who laid papers on our desk this week, citing a study that studied a study that looked at suicide rates for the 12 months, only the 12 months following sexual transition. But there in truth there is only one long-term follow-up study on the subject of suicide and it found that adults who took hormones and underwent sex reassignment surgery had substantially higher rates of mortality suicide, suicide attempts and psychiatric hospitalizations. Increasing suicides began to manifest five to eight years after transition, not in the first 12 months. The treatment of suicidal tendencies among trans youth justice with all other population groups must include psychotherapy, compassion and support. We know this as legislators, we know this as parents. Other scientific reviews have reached similar conclusions in a thorough governmental review of all the scientific literature and assessment by the Center for Medicare and Medicaid Services, CMS was conducted under the Obama administration. After extensive reviews, CMS concluded and I quote, there is not enough high-quality evidence to determine whether gender reassignment surgery improves health outcomes. A comprehensive 2019 review by the British Medical Journal described medication to use for gender dysphoria as being quote in the context of profound scientific ignorance. The review concluded that current evidence does not support informed decision-making and safe practices in children. In closing, I'd like you to hear the words of a fellow Georgian who was a detransitioned man. He says, I was told that my transgender feelings were permanent, immutable, physically deep-seated in my brain and could never change, and that that was the only way I could ever find peace was to transition to female. The problem is, he says, I don't have those feelings anymore. Ladies and gentlemen, I ask you to support the health, safety, and long-term well-being of our children by granting them the protections found in SB 140. Mr. Speaker, I yield well. The lady has yielded the well. We do have a minority report. Is there any objections to the previous question being ordered? The chair here has none. The previous question is ordered. We do have a minority report. We will hear total of 20 minutes, and then we will have 20 minutes for the chairman's time. We will move on to the minority report. Will Park is recognized to present the minority report. Thank you, Mr. Speaker. Colleagues, I rise as strongly opposed SB 140. This is a bill that will do an incredible amount of harm. Unfortunately, I think what you heard from the previous speaker was a lot of disinformation. I know that y'all think, and I know that a lot of Republican members think that what y'all are doing is protecting children. The truth of the matter is that you are not protecting children by passing this bill. You are inflicting harm. You are inflicting harm on the children of Georgia by voting for this bill. Now, what's the impetus for this? We know that this is a bill that pulls with 80% favorability in Republican districts. That's heartbreaking to me. How many times do we come to this floor and hear the good word about loving your neighbor? I've been taught that you know a tree by its fruit. It doesn't matter what the intent is, what matters is the effect, the outcome. So many people who understand this issue know that it will cause harm. We are telling you that it will cause harm. But if you pass this bill, know that it is not to protect the children. Know that you are passing this bill and your political self-interest to rile up your base. Don't deceive yourself on this bill. It's heartbreaking. Heartbreaking. We have the ability in this body to do so much good. We found common ground and we've moved this state forward on so many issues. We don't need this far right culture war to continue to divide us. Why are we attacking one another? Why are we attacking the most vulnerable among us? We are better than this. We owe it to the next generation to do better than this. The evidence is clear. The science is clear. Politicians should not be substituting their personal opinion for that of doctors, for that appear reviewed studies when it comes to this issue. So I strongly urge you to vote no to SB 140. Vote no to protect the lives of some of the most vulnerable citizens in your state who you are commanded to love. Love is dead without deeds. I hope that each of my members demonstrate their true faith by demonstrating love to their neighbors. Love to those that you may not understand and vote no to this bill. Thank you, Mr. Speaker. I yield the vote. General Hays, yield the will, represent even no of its, as recognized to speak to the bill. Thank you, Mr. Speaker. Colleagues, I rise before you today to speak against SB 140. The Georgia Supreme Court has held for nearly 40 years. This is a quote. The beginning presumption is that the parent has the child's best interest at heart. They continue. The medical decision making is a constitutional right which is not lost because of the incompetence or the youth of the patient. We have affirmed in this general assembly. We have codified into law legislation that has decreed that the parents are the ultimate authority to determine whether and when their children receive vaccines, whether and when their children can wear a mask, a binst, a pandemic, whether and when their children can learn about dark, tricky, complicated, confusing moments in our history. We have affirmed in this chamber that parents have that authority. To that end, people have stated in this chamber. Parents have the right to make decisions about their children's health care without interference from the government. We have declared in this chamber parents are the first and most important teachers in a child's life and they should have the freedom to choose the educational path that fits their child's needs. A question I asked in committee that was not answered. And a question I put forth before each of you today is what makes this different. In committee and here in this chamber, we have heard examples given about tattoos, drinking alcohol, firearms. Paul Harvey would say, here's the rest of the story and I'm going to tell you right now the rest of the story. Those things, tattoos, you can get a tattoo if you're a minor with the consent of your parents. Alcohol, you can consume in your home with the consent of your parents, a firearm. Your parent may absolutely give you a firearm to do something legal. And if something a child does something illegal, we have also determined that yes, 17-year-olds should not be tried as adults. And I will tell you, I've doubt very many of those 17-year-olds who are deciding to commit a crime are making that decision with the consultation of their parents and their physicians. Yet what we are talking about today, the decisions these families are making are not done on a whim. They're not done because a child has declared they are one gender or another. They are done after heart wrenching, anguish, confusing decisions. Trust me, if you think the issue of transgender youth is confusing for you, imagine what it is like for the families who are going through this. Imagine what it is like for these parents. We are being intellectually inconsistent. We are being inconsistent from a policy basis. I urge you to vote against this bill into the children out there and to their families who know that they are being discussed in such an intimate way. Know that you are loved. Know that you are valued. Know that you matter and your life matters to everyone who loves you. I yield the well. The lady has you to the well. Representative Lamb has recognized to speak to the bill. Thank you, Mr. Speaker. Gender affirming care helped me come out of what my mom called a hibernation. It was like I awoke and it was spring. As a trans person, I've seen trans children who could not swim in public, couldn't feel safe in a bathroom, couldn't look in the mirror or record their voice, and then they received this care, and that all changed. It's not just about surviving, it's about thriving. We should care for trans children because they are in our districts, in our schools, in our military, in our families, whether we know it or not, and they are in Georgia's future because the future belongs to them too. My son is healthy and happy because of his hormone replacement therapy, not having access would have been devastating for him. I don't want this to be the experience for other children. I wanted to read just a few short words directly from Chan's youth and their parents in response to this bill because whether we agree with them or not and even regardless of how you vote on this bill, it's important for us not to let any paternalistic instincts, whatever motivates those instincts erase their voices, their experiences, their intelligence and autonomy, consulting with health care professionals, people who seek not to harm others or even impose their views on others, but only to live in flourish in their own human existence as they aspire to live in flourish. So I hope not only as you vote, but long after that, that you take to reflect time directly on their words. Thank you, Mr. Speaker, I yield the well. The gentleman has yielded the well, representing Ola Lillet, is recognized to speak to the bill. And the bill is recognized. Thank you, Mr. Speaker. Good morning, colleagues. Today, I rise in opposition to SB 140, but more importantly, I speak to you all as a parent. And I'm scanning the room, the chamber this morning, and I see the eyes, and I'm looking into the eyes of parents and grandparents. My son is one and a half years old, my son August. He has curly hair, he has a wide smile, goofy personality. You don't get to choose your child. You don't get to choose their gender, how tall they are, if they're gay, straight, transgender. The only thing that you can choose as a parent is how you show up for them, how you love on them. My son, if he cried, if he falls, there's not anything I would do to run to his aid and care for him. There's nothing that you would do in this room. There's no mountain you wouldn't move to love on, to support, to provide the necessary care for your child. We cannot deny our parents, your friends, your neighbors, your loved ones, the right to love on and care for their children, especially minors when we're talking about how critical it is for a young person. It's not just about development, it's not just about learning. We're talking about life or death. Even if it's one child, even if it's one parent, even if it's one time, we cannot deny parents the right to love on and care for and provide for their children. So again, colleagues, please, I urge you, please oppose 140, do not deny parents the right to love on and care for their children. Thank you, Mr. Speaker. I yield the well. The gentleman has yielded the well, representing a mighty barn just recognized to speak to the bill. Thank you, Mr. Speaker. I rise to speak against SB 140. As I stand here today, I represent many different demographics. I represent being a 20-year-plus scientist. I represent a person who is in the dissertation phase of my public health PhD. And I said all that to say, I analyze things differently, and I analyze and make decisions with facts, data, and the well-being of our public's health in mind. And so I'm asking you to oppose this bill with the public's health, our public's health, our Georgia's public's health in mind. Putting the public's health at the forefront looks like voting no for SB 140 and coming back to the table with other solutions like mental health programs for trans kids, safe spaces for trans kids, community support programs for trans kids, that will further decrease the suicide rates. By voting yes on this bill, we will increase the suicide rates. And those are facts, proven data. So I asked that this body look at the facts, the data, and the well-being of our public's health when making this decision. And I want to leave you with what if your kid came to you and said they were trans? What if your kid or your grandchild came to you with that? And you vote it yes on this bill. How would you feel to all the trans community out there, the trans kids and the parents with trans children? I want you guys to be strong. And in the event that this bill does pass, reach out to community services and programs that will help you support your trans child. Thank you, Mr. Speaker. I yield the well. I'd like to hear sheo to the well. A representative drenner has recognized to speak to the bill. Representative drenner, you have about seven minutes. Thank you, Mr. Speaker. I'm so sad today. I've been here 23 years. I was the first openly gay state representative in the south. I have bare witness to lots of bills over the years that have impacted the LGBTQ community. The Boy Scouts, Gay Straight Alliance is a film called That's Elementary. The Marriage Fight. And now today we're talking about kids. If my phone rang, if my phone rang right at this minute, and somebody said something has happened to my child, I would leave immediately. I have been blessed to have four children. My children are the most important thing in my life. Does that make me a bad person because my children are the most important thing in my life? What you are talking about today is somebody's child.\n\nThey're children. You are telling these parents that they are bad parents because they want to take care of their children. In committee, I'm just kind of mortified by the findings section of this bill. There is absolutely no academic rigor associated with anything in these findings. The intent of the bill to help kids. It's like the kids are just going to like walk into the doctor's office and say, hey, please do this to me. Where are the parents? I believe that you mean well, but this is wrong. To all the children in our state that are going to be negatively impacted. Please don't lose hope. Please don't give up. Please don't kill yourself. Kill yourself. This world is worth it. We need you. Please don't vote for this bill. Thank you. I yield the well. The lady has yielded the well. We'll move on to the chair's time now. We'll recognize the vice chair of the committee from which this legislation came. Vice chair Washburn. 20 minutes. Thank you, Mr. Speaker. I yield the chairman's time to Chairman Martin Newton. Chairman Newton has recognized the bill. He has up to 20 minutes during the chair's time. Thank you, Mr. Speaker. I think I've heard the compassion. I know in the committee meeting as well. I've heard the compassion that so many of us bring to so many issues in this chamber. But in particular, issues that affect children from adoption reform, which has been a key effort. TheGoldbr sich judgment of Republicans back in the direction of prestigious students from the senator teachers. I you back in my field we talked about it and the gospel. We have talked about voters from McIntyre and Corn網 in Washington. I've talked about other roles at patriarchal divisions. I've talked about someburst change of public surveillance. But the health system didn't understand. Why this legislature should not intervene in what may be going on in some very challenging situations. I guess three of them that I've heard is there's some respected organizations that think it's a good thing to do that we should not get between doctors and patients and that the data is convincing. So I want to, if you don't mind, just bring what I think are some additional facts that will help us make what's called an informed decision on Senate Bill 140. We all know, and I have heard it here today, the first mantra of medical school that a lot of us heard was first to do no harm. So regarding trusted organizations, they often do mean will, but in the late 90s and early 2000s, there were great intentions to care for people with under-treated levels of pain, including children and teenagers. Trusted organizations like the CDC, the United States Health and Human Services Department, and others made it a priority to see that MDS and others more aggressively treated pain. And that almost always regarded upping the strength of the medications, from not just Tylenol or ibuprofen, but the things like opiates. And that wasn't just for acute pain, a broken bone, a kidney stone, or post-operative pain. It was in particular for what they called under-treated chronic pain. So the CDC, HHS, the FDA, went on and approved oxycontin, our specialty societies, the Joint Commission on Hospital Accreditation, all of these, well-meaning, well-intentioned doctors, pharmacists, and scientists, followed this plan. Well, pain levels did decrease, but as we've all seen, there were very serious, what we call, unintended consequences. Actually, long-term devastating consequences. We've talked about suicide and the mental health challenges in this room significantly. 20 years later, after hundreds of thousands of citizens have died related to accidental or intentional overdoses, addictions that may have started with the best intentions. But now still, millions of families across our nation are dealing with current addictions and substance abuse. 20 years later, we're dealing with it in hospital 1013 last year, trying to address new things in hospital 520 this year. So now several of these trusted organizations have changed their guidance, their orders. Why is that? Because of the significant unintended consequences to patients. In particular, unintended consequences often to Georgians. American Academy of Pediatrics was mentioned, and now they recommend almost zero opiate use is recommended below age 18. Not because it wouldn't help short-term in the pain, but because of unintended long-term consequences of such a high risk of addiction and all those complications. So number one, sometimes these respected organizations are sometimes incorrect in their guidance. And they correct it when better data becomes available. Second, possibility was, well, the state shouldn't interfere. We shouldn't have legislative interference with our doctors and their decision-making, along with patients. So that's true most of the time. There are narrow times though when the state does get involved. An example that I just mentioned was when well-meaning doctors are prescribing control substances, whether sedatives, opiates or others. Well, the legislature is definitely involved. It now requires doctors like me to, before we prescribe something to review a database, the PDMP. It must be checked prior to prescribing. Pharmacists, our pharmacist friends must check and enter prescription data before dispensing any of these prescriptions. And frankly, physicians or pharmacists who dispensed or prescribed medications inappropriately, we get counseled. We could be in sanction, we can lose our license. The state has indeed intervened between the patient and their doctor. Why did they do that? They did it because it was needed to protect patients, to protect Georgians, which is our role here. Finally, the third and last thing, science is still in the early stages of understanding and grappling with what's been a tremendous rise in reports of gender dysphoria. Some reports say as much as 2,000 percent. Scientists are trying to understand that, and unfortunately, as has been mentioned here earlier, there's very little peer-reviewed solid science to evaluate the effects, especially the short and even more important long-term effects of many of the irreversible treatments and surgeries. And we're not alone in this in Georgia. There's other states that are dealing with this. There's other countries dealing with this, even some nationalized health care institutions in England, Germany, and other places. Some in England, for example, have even gone as far as before puberty doctors can be prescribed by the National Health Service doctors. You have to get a court order because the courts realized that a 16 and below really are not able to make what they would call an informed decision, a decision that where you can understand the risk benefits and make a decision. These countries and other areas in many states are raining in some of the uncontrolled expansion of early treatment for gender dysphoria. They're recognizing the serious consequences that could be resulting from treating irreversibly. That's a key word in this bill, irreversibly, what often might be a temporary or transient condition. There are several studies that have shown that when youth expressed gender dysphoria, it left untreated with medication, maybe treated with mental health care, but untreated with medications or irreversible surgeries that somewhere between 61 and over 90% resolved by their early 20s. 61 to over 90% of those feelings may resolve by the time they reach adulthood. And so their severe discomfort with their biologic sex, if no chemical or surgical intervention has resolved, it often appears that many of those people revert back to the suicide rate of the general population. What the other side of that is those who do go through gender treatment still have a five times higher suicide rate. So you have an 80% reduction when those early feelings and thoughts resolve. So you're actually saving lives by not doing early treatment. So the medical science community is just beginning to really evaluate and understand all these unintended consequences of often well meaning policies, treatments and surgeries. So we left with those three things. Organizations respected that they are are indeed sometimes incorrect in their recommendations, however well meaning. Doctors and medical treatments do sometimes require state involvement to protect individuals from even well-intentioned physicians. It was brought in article about some cultural practices 15 or 20 years ago that were going on in some communities where the state did have to intervene in particular surgical treatments that parents were approving. So doctors do sometimes require state involvement to do what's best to protect Georgians. The day is not, while it's not as clear as we'd all like, it's actually raising some serious questions regarding irreversible surgeries and treatments. Somebody mentioned, I think a law school classmate, nothing in this bill touches adults making decisions. The key point is this is how Senate bill 140 is indeed a light touch to narrowly tailored bill that restrains these often well meaning physicians and surgeons for irreversible treatments and surgeries on children. This bill has well done exceptions that relate to the very rare genetic abnormalities, inter-print related conditions where science is much more settled. Once again, nothing in this affects adults in their own informed decision making. It simply asks doctors to pause any irreversible treatments and surgeries on an individual until they're 18. When a child's brain is more developed, they can more fully understand as an adult the potential side effects of surgical and chemical treatments. That can cause irreversible results. We all agree, I think, that children do deserve care, including mental health care. They deserve compassion. This bill offers them the opportunity to be the adult that makes an informed decision on a permanent irreversible change to their own body. SB 140 is really a very reasonable, a very narrowly tailored bill. It very strongly follows what we mentioned earlier. First, do no harm. I really hope you'll support this along with me and vote yes on SB 140. Thank you, Mr. President. The gentleman has yielded the well. That concludes all of the debate. The time has been allowed on this bill. Is there any objection to adopting the Committee's substitute? Chair here's none. The Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the past to the bill? Chair, have an objection? We have an objection to the passage of the bill. Let's see, Mr. Clerk. We have an objection. Is the gentleman move? Gentlemen, move. This is our posture. We have an objection to the report of the Committee. She weighs all in favor of the passage of the bill. Chair here's none. The report of the Committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. For what purpose is Riverside all of arise? Parliamentary inquiry, Mr. Speaker. State your inquiry. Isn't it trusser that even if you don't accept the reality of the defects of this bill that criminalizes medical advice in the standard of care that the real ultimate reality of this bill is that it simply mean to point your finger at somebody else's child and say she looks funny and she runs too fast. Isn't that true, Mr. Speaker? I'm sure the lady believes what she speaks. Have all members voted? Have all members voted if so, the clerk will lock the machine. On the passage of the bill, the yeas were 96, the nays 75. The bill have received the requisite constitutional majority is therefore passed. For what purpose is represented, bottom rise? Make a motion. State your motion. I move the Senate bill 140 be immediately transmitted to the Senate. There is objection. Does the gentleman move? The gentleman moves. Our posture is we're going to vote on the objection. All those in favor of immediate transmittal will vote yes. All those in favor of immediate transmittal will vote yes. Those opposed to immediate transmittal will vote no. The clerk will unlock the machines. Was for what purpose does we at Parkrise? He waves. Have all members voted? For what purpose is represented, Kenna and Ross? Just a parliamentary inquiry on this. Is it not true that we can wait to understand the impacts that this will have on transgender children? We don't have to immediately transmit this to the Senate right now. I'm sure the lady believes in what she speaks. This bill has been thoroughly debated. If all members voted, if so, the clerk will lock the machine on the question of immediate transmittal. The yeas are 97. The yeas are 97. The nays are 74. The bill has passed it on its way to the Senate. Mr. Clerk, we're going to move on with the rules, calendar. Will you read the caption to SB 5555? SB 55 by Senator Parr, the 42nd to be titled back to men chapter 80. Title 36, the Fisher go to George Anitetti relating the general provisions relative to counties, municipal corporations, other governmental entities, so as prohibit the regulation of businesses of persons under 18 years of age. This bill, that been referred to the Committee on Small Business Development. That Committee recommends a disbilled do pass by Committee substitute. Representative Oliver is recognized to present the bill. Thank you, Mr. Speaker. Constituents of the House District 82, who were the parents of young children, learned that it was illegal under Georgia law for children to have a lemonade stand. The purpose of Senate bill 55 brought by my senator, Helena Parr, allows in limited circumstances on private property children to have lemonade stands. I'm guessing we all had some form of a lemonade stand I did, and I'm guessing that that was an activity that was fun and positive for the family and positive for the neighborhood. And in many, many circumstances in my neighborhood, those lemonade stands are set up for the purpose of some charitable contribution to some entity that the family may support. This bill allows lemonade stands without license, without registration, without regulation, without statute. When it is operated by a child under 18, when they are in school, when they have the permission of the private property owner, and when the legal aid stand does not generate more than $5,000 a year in income. This bill is supported by the Georgia Chamber of Commerce. Here in a different tone right now than the past bill, and it's a little bit unfortunate for me personally that I can't celebrate this bill on behalf of the children and the families of my district having listened to the last hour's debate. But colleagues, this is a good bill. It is a bill to remove regulation from lemonade stands in your neighborhoods, and I ask for your favorable consideration. And I'm happy to answer any questions if there are any, Mr. Speaker. The lady has some questions. She yield? Yes, sir. Reptile Bentley in the rear to your left. Has a question. Represent Bentley has recognized for a question. Thank you, Mr. Speaker. There's a general lady yield. Yes, ma'am. I'm sorry. I just can't hear back here. Is it not true that we have a lot of questions? The lady will suspend the question. Can you hear now? Yes, sir. I can. Thank you. You're recognized for a question. Thank you, Mr. Speaker. Does the general lady yield? Yes, ma'am. Is it not true that we have a lot of young people in the gallery and working as pages today? Yes, ma'am. Is it not further true that without this bill, it will be illegal for, or you're saying it will be illegal for young people under the age of 18? And most counties across this state to sell, eliminate, set up, eliminate, stand and sell, eliminate, to make extra money to help them buy school supplies, school clothes, whatever the case may be without this legislation? It is in some circumstances and it is not usually enforced, as we know. This family had a discussion. This was a family learning experience. This is what we're going to do. Let's figure out what the law allows us to do. And they discovered that there was illegal and unincorporated to cab to have food operations that may be described as a lemonade stand. This is not, we don't enforce a lot of these local laws, but it is right for us to consider basic freedoms of a family and a child to make their own decisions about whether or not to have a lemonade stand. This bill is necessary. Thank you for your work on this legislation. Thank you, Mr. Speaker. Lady Yil, for another question. Yes, sir. I know this gentleman has some experience down around the military base in Hinesville, Georgia. Representative Williams has recognized for a question. I can speak to a little lady Yil. Yes, sir. It might have just happened, is it not true that it did not just happen in the cab, but about seven or eight years ago, we had chief of police in Midway to come and remove some children from a lemonade stand, but it is not further true that because of that action, it was almost ready to take the city charter away. The person didn't like it at all. Good bill. Thank you, sir. Lady Yil, for a couple more? Yes, sir. Representative Thomas, to your right, Representative Brad Thomas has a question. Thank you, Mr. Speaker. Do you yield? Yes, sir. So I have one question specifically, line 29 that says, generates gross receipts up to $5,000. My question is, how often do you get a receipt from a lemonade stand? I think that not often is, would be my response, but I think the proof, if anybody wanted to charge a lemonade stand, the proof of how much money they raised would be available to whoever was making a decision their violating, not just by the testimony of I brought change in, and this is how much I earned. So without a receipt, it could be provable that the amount earned on the lemonade stand was less than $5,000. Further inquiry? Yes, sir. But is it not true that now you're going to put a counting burden standard on the lemonade stand to prove that they have $5,000 that they meet this bill or don't? If the county wants to use its resources to enforce the $5,000 limit, I believe that is their option. I don't think they're required to do so. I like they're not required today to shut down lemonade stands as they did in midway. So I think that's the county's option if they want to assume that burden. Thank you, I'll segment this for Parliamentary inquiry. Was that a question or a parliamentarian? I think that's a question. You're doing good. Thank you, Mr. Speaker. Thank you. Thank you. The gentleman knows about consumer affairs. The chairman of agriculture and consumer affairs. Chairman Dickie has recognized to your right for a question. Does the lady yield? Yes, sir. I appreciate you putting the five piles of them in there because I assume it would cover roadside peach stands. I would very much want to protect roadside peach stands, particularly in your area of the state. Thank you. Lady Yulfe for representing Martinez. Yes, sir. To your right. In the back. Does the gentleman lady yield? Yes, sir. Isn't it true that this bill is a local city, county, business, and HOA subdivision issue? I believe that the state should not get involved in approving or disapproving, lemonade stands or any other stands. Also, this bill also caps sales at 5,000. Isn't it true that this is mainly a cash business and it will be difficult to determine any revenues? Thank you. As the former mayor of the city, you would be, have the options to counsel with your local folks about whether or not you want to enforce the legality of lemonade stands. You can share with me later what are the circumstances of which you would try to shut down a child's lemonade stand. I'd be interested in hearing that analysis. I think that there is options for cities and counties to make decisions. Lady Yulfe. Yes, sir. Representative Frazier to your left and the back has a question. Thank you, Mr. Speaker. That's a lady here. Yes, ma'am. Will this be able to affect any of the children that we see on the right away that are selling water, bottle, lemonade, coax, and all of that that are either on the right or on private property that are on the side streets? It only affects private property. A child that's in a right away on the street is not protected by this bill because you have to have the permission of the private property owner in order to set up the lemonade stand. My lemonade stand was in my parent's yard. Thank you. Later, you have a lot of interest. I'm going to take two more questions. One's from Chairman Martin to your right. Sir, there's a question. Lady Yulfe, a question. Yes, sir. Isn't it true that I hope if some young people are out there just trying to do something that the Department of Revenue will leave them alone as well? I feel pretty confident that they have better things to do. Well, if they don't have better things to do, I would like to have another conversation with them. Yes, ma'am. Isn't it further true that I'm trying to get that on the record as less legislative intent that just because we're making use of this, that we don't want them to bother these young people with a sales tax permit? Isn't it further true if you find somebody that's making more than $5,000 a year, I'd like for anybody to pass their name along to them. I'd like to look to go in business with them. They would be a very successful young entrepreneur and I think they would be an asset to any business. Unfortunately, as you know, the courts don't believe we have legislative intent in Georgia and that's another discussion I won't engage in right now. Chairwoman, the Deputy Deputy has a question for Lady Yulfe. Yes, just the Lady Yulfe? Yes, ma'am. I am blessed in my community to have one particular young man that I know of that does this for a non-profit. He raises much more than $5,000 every year in his own driveway, of his own home with his parent support. Is there anything in this measure that would impact his ability to do that? I think that the will of the committee and the Senate and us consideration is that we should have a $5,000 limit. What you're suggesting is whether or not we should have a dollar limit on it. And that's a discussion that I'm happy to have at some other time. But for today, purposes, I would like the body's favorable consideration of Senate Bill 55. So just to clarify, if you will yield again, this would limit his ability to raise more than $5,000 to give straight to charity. Yes, ma'am. Today, actually under today's law, today limits him even more significantly because the local city or county has the right today to impose obligations for licensure registration or other bodies. So this bill helps him forward a little bit, but maybe not totally if he is very successful in raising more than $5,000 in a year.\n\nMr. Speaker, if you did not wish to allow other questions, I will yield the well. The ladies are doing an outstanding job as he is yielded the well. Is there an objection to the previous question? Well, we have a speaker. I'm sorry. My apologies. We're representing Jasmine Clark. It's recognized to speak to the bill. We have some other speakers. Representative Park Cannon has recognized to speak to the bill. Thank you, Mr. Speaker. I am here speaking in support of this bill because I'm supporting transgender children with lemonade stands. Transgender children who have digital goods, have clothing, they're selling, have post-its, have file folders, have pens who are doing this because they understand they need money too, especially in the circumstances based on the last bill that we have. I think it's very interesting how hypocritical this body could be to say that under 18-year roles do not in one circumstance have the ability to make these decisions about their lives and now they do. They don't need parents even in this bill to do this. And I think that's a great thing, in fact, in the other bill they did. So I'm just really excited about this bill. I think y'all are too. I just want you to think deeply about the impact that we're having on students today. For history's sake, I know that kids who are transgender, who have lemonade stands, are excited about this bill. They came to the Capitol today because they were excited. And instead of being in the gallery right now, excited about this bill, they are outside crying. I'm going to go join them. Thank you very much. I yield the well. Lady, as you did the well, Representative Holland has recognized to speak to the bill. Thank you, Mr. Speaker. I rise in support of this bill and I have to make a confession. Until a couple of years ago, I had no idea this bill was even necessary. I'm the parent of a small child that would like to set up a lemonade stand or a friendship bracelet stand or a chocolate chip cookie stand in my front yard. And until word of this bill started circulating, I thought that was my choice. My child felt compelled to set up a lemonade stand, usually in response to charity. A tornado had hit a nearby town or he had heard about the war efforts in Ukraine. And I was his parent, so I could assess, is it a good idea for my child to set up this lemonade stand? Do I want to consult with my neighbors about setting up the lemonade stand? But I figured that choice was between me and my family, my property, and my child, and I didn't think the government necessarily had any business injecting themselves into that decision. So imagine my surprise to learn as this bill was moving forward that the government wanted to regulate what my child and my family could decide to do on our private property in our home. On a more positive note, lemonade stands are good for our communities. We talk in this chamber about the importance of economic development and workforce development. What better way to prepare young people for a life in business than having them set up a lemonade stand in the front yard? Any of you who are parents know how this works, your child thinks they sell a cup of lemonade for a dollar and they get a dollar, not how that works. I'm going to charge my child for the materials I had to go to public to buy for that lemonade stand, for the poster board that he used to make his advertisement. He's going to learn something about marketing because he has to make sure that the neighbors know to come by lemonade from his lemonade stand. He might leverage some social media. It's gotten easier for him than it was for me at that age. We talk in this chamber about the importance of mental health of our young people. Supporting young people when they are determined to do something that makes a difference, whether it's make money for themselves or raise money for others who need it, is a wonderful way to build confidence, to help them feel seen, to allow them to exercise their own agency. When they have a lemonade stand with their fellow neighborhood children, it encourage his team work. They learn how to work together on group projects and I don't know about you but I think lemonade stands build community. I live in a neighborhood not far from here, residential neighborhood, lemonade stands pop up all the time. And if I see a lemonade stand and I've got any change in my change store or a dollar in my purse, I'm going to stop and reward those young people, not call code enforcement, reward those young people for having the initiative to put out the lemonade stand. And that's when I sometimes meet children in my neighborhood for the very first time. I meet their parents. One entrepreneurial young woman in my neighborhood was also handing out flyers advertising her pet sitting services and dog walking services. She was at 11 starting to save money for her own secondary education experience. This was how she was going to see her college fund. I didn't want to see the popo woo woo come up and shut down that lemonade stand. She was thinking about her future. But because I had the chance to talk to her and talk to her mother, talk to her friends, talk to her friends father, I got to know more people in my community. Lavin 8 stands are the way that we build the foundation for caring for one another and loving one another in our communities. It gives us another chance to interact with young people who maybe we don't usually get to see in front of us. Young people who just want to be recognized for what they are. Young people who just want the opportunity to speak up about the things they believe in. Young people who just want the support and encouragement of the people around them and who love them. The earliest documented lemonade stand was opened in 1873 in Brooklyn. It wasn't legally regulated then either. In fact, the scourge of trying to enforce local business licensing regulations on lemonade stands actually caused to the company country time. They all know country time lemonade. Anyone lazy like me that doesn't make your lemonade from scratch and knows the country time brand. They actually started an offshoot called legal aid that spelled like lemonade to offer up to $300 a person to get young children out of trouble when they get fined for holding an illegal lemonade stand. Here's what this bill is going to do. It's going to make it unnecessary for country time lemonade to give $300 to cover the legal fees of any of the children in our communities because we're going to be supporting our children and what they want to do and having their voices be heard by allowing them to sell you a cup of lemonade. Thank you so much, Mr. Speaker. I yield the well. And lady has yielded the well. Represented of an elouits is recognized to speak to the bill. Thank you, Mr. Speaker. I rise today because I feel like most of y'all probably expect to hear from me when there's anything involving cities or counties. I like to stay in my lane as it were. So I just want to say that I do support this bill. I think that it's tremendous. My children have had lemonade stands. I know that in my city, in my county, I don't think we've ever prosecuted anybody, but I know that it has happened elsewhere in the country. So it's good that we are on guard and prepared to make sure that we are ready to stand for our children. I am so happy to support this bill today and I hope that you will join me in voting yes. I yield the well. I have a member who has another opinion. Represented of an elouits is recognized to speak to the bill. Thank you, Mr. Speaker. Mr. Speaker has a former council member and a former mayor. I heard all the comments. We love our kids. We love our lemonade stands as a matter of fact. Is that time of year where you're going to have the cheerleaders on Saturday raising money. You're going to have the booster clubs raising money selling donuts. But where does the stop, Mr. Speaker, where does the stop. This is a city issue. This is a city issue. This is a county issue. This is a homeowners association issue. Where does the stop we cannot tell these folks what to do in their cities. Let me tell you, as a mayor, I support these kids. I support these kids. We don't have you seen a prosecution. We never prosecute these kids. And if there's any issue, if these kids, if these families have any issues, that's why you got a city council meeting. You go to your city council chambers. If you have an issue in your HRA, you go to your president. Why are we, why are we legislators dictating what our city does? I'm telling you, I cannot believe that a family came to a legislator as state senator and had one complaint. And now we're voting on this issue. She should have gone to the city council members. She should have gone to a local mayor or an HRA or a county commissioners. We have a few county commissioners here. How does it feel for the state to tell you cities what to do? So I'm so against this because we keep voting on bills that we should not be involved in. We should not be involved in. So folks, I'm totally against this bill. Thank you and I year the well. The gentleman has yielded the well. We have no further speakers, but we will honor the chairman's time. This bill came from Chairman Mike Chokus' committee. But we'll do this first. Is there any objection to the previous question being ordered? Chair has done the previous questions ordered. Now we will move to chairman's time. Representative Chokus is recognized for up to 20 minutes. Thank you, Mr. Speaker. When we passed this bill out of committee, and the concern was dealing with permitting, dealing with registration and dealing with licensing. Originally, it had regulation. That was struck and replaced with registration. And we consulted with the Municipal Association and the ACCG, and we found that they were neutral because they were involved in the process. The lemonade stands will still be regulated in the case, more than one reason, but I can just slide one off the top of my head for public health. In case there was a bowl of water restriction, and the child didn't know there was a bowl of water restriction, the health department would be able to regulate this. Members, you all vote your conscious on this bill, because apparently the author of the bill, and the members that have been speaking in favor of it, have kind of kidnapped the bill, and are using it for other purposes. This is simply allowing our children to sell lemonade, girls' gout cookies, donuts, for fundraising events, and to help them. The other caveat that we have in this bill is that they have to be enrolled in a public school, a private school, a home school, a working towards their GED, or any other high school equivalents, high school equivalents, a certificate. Please don't take this out of context, either side. Let's vote for lemonade. Thank you. Gentlemen, I have the word. We don't want to get into the donut category. Let's just stay on lemonade. Is there any objection to adopting the committee's substitute? Chair, here's none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee? There's an objection to your objection to the committee report. Gentlemen, move. Gentlemen, move. Gentlemen, move. Does the lady move? Representative Oliver, do you move? Yes, sir. Lady moves. We're going to vote on the committee's substitute. We'll put your vote on the board. If you support the committee's substitute, you're a vote, yes. If you do not approve the city's, you won't consider the committee's substitute. You're a vote, yes. And the clerk will unlock the machine. All members voted. Have all members voted. If so, the clerk will unlock the machine on the adoption of the committee's substitute. The yeas are 150, the nays are 18. Is there any objection to adopting this committee's substitute? Chair, here's none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill. Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote. Yes, all those opposed. We'll vote no and the clerk will unlock the machine. We'll vote. We'll vote. We'll vote. Have all members voted. Have all members voted. If so, the clerk will unlock the machine on the passage of the bill. The yeas were 139, the nays 30. This bill, having received the requisite Constitution majority, is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 193. 193. Senate Bill 193 by Senator Gouge, the 51st and others to be titled and act to amend chapter 40, a title 50, the fiscal to George Aniteta, related to promotion and deployment of broadband services, so it's required for the Department of Community Affairs to determine locations that are eligible for state or federal funding programs. This bill has been referred to the Committee on Energy Utilities and Telecommunications. That committee recommends that this bill do pass. Representative, excuse me, Chairman Parsons is recognized to present the bill. The gentleman will suspend just for a minute. No, it's on. No, I've got you. I want to make sure members give your attention to the member in the way. Chairman Parsons will present the bill. Chairman Parsons. Thank you, Speaker Burns. This is an issue here. I don't think I've never heard anybody say that they were opposed to expanding rural broadband or broadband in general. And this issue has been pretty close to my heart now for the last seven, eight, maybe even nine years. So it's an honor to come up here today to bring this bill to you. It's an agency bill. It's relatively short. But I do think about some of the people that I've worked with on this issue. I guess it was seven or eight years ago. I was on a joint Senate House study committee. We went across the state. I co-chaired it with Senator Gucci who's the author of this bill and the Senate. And we went around the state. And we heard from people around the state that I think some of us didn't really have a good understanding of how they were. They did not have access to broadband and how that they weren't able to do the things pay bills online. Their kids couldn't do homework at home and look up things on Google and so forth like people in metro areas do. Companies, little small companies that could not upload photos to a processing center to get them to get them printed or published somewhere. All the problems across the state and impacting economic development. Just having a negative impact on everything in those communities because of the lack of broadband. So it was an honor to have worked with Senator Gucci on this. But I have to mention the late Jay Powell who chaired during the time we worked on this. He was the chairman of the Ways and Means Committee. And we fussed a little bit about different things but Representative Powell, he was from rural Georgia. He knew the issue really better than I did. We fussed but he was correct about so many things. And I know some of the first legislation I had, we were trying to base it on the FCC mapping. And it turned out and Representative Powell recognized this. The mapping from the FCC just was not accurate. It didn't get it down to a small enough point to actually do what we needed to do. So he did a tremendous amount of work on this and it's an honor to come up here and just bring this bill that he had been so intimately involved with back a few years ago. This is a short bill. This is an agency bill brought by the Georgia Technology Association with the support of the Department of Community Affairs. Those agencies consulted with the State's Broadband Advisory Committee which included broadband service providers. Internet trade associations and state agencies to solicit their feedback and support. Their input has been incorporated in this bill and we're not aware of anybody that has any opposition to this. It has a three section. The first section basically just says that consultants can be brought in because there has to be some things done especially relating to federal funding to do some further development of the maps. This allows consultants to be brought in on that. The second section just says DCA will separately determine the programs for state funding and federal funding because the federal funding comes with which different funding is available. The third section comes with which different rules and regulations. Then the third section currently the mapping from state of Georgia if an area has Internet at 25 megabit per second down and three megabit or up and three megabit down they will not be included on the mapping but because of some of the federal requirements. They can say that if that is the case they could make exceptions to that. That's pretty much the bill really and it just gives us an opportunity to continue with this process that we've been working on in state for a good many years. It actually does my heart good to even bring this because when we first started working on this issue there was nothing in code about broadband or how it was going to be developed in the state. What had to be done what it is had to be brought into it. So with that Mr. Speaker if there are any questions I'll be glad to try to take them otherwise I'll yield the well. You have a couple. Okay. Chair Lady Houston do your rights recognize for a question. Thank you Mr. Speaker. You know that a lot of rural areas have already worked with different like my district has worked with EMCs and we've gotten state money. Does this have anything to do with the state and federal money that's already been designated as? No, no. There have been several different funding mechanisms that have come from the federal government. There's already been some that have been given out. There's another big one that's coming and I think that went in particular in order to be able to do this and get that funding and get it out like it needs to be done. These are some changes I think in particular that need to be done for that as far as what's being done. Well even if it's not done it was designated to be a project it's still a project. That is correct yes. Thank you. Thank you too. You've been involved in this issue for a long time too and I appreciate that. Gentlemen you have one more question. Yes sir. Representative Ramon has a question straight in front of you. Thank you Mr. Speaker. Does it gentlemen yield? I do. Is it not true that we spent a lot of time in our community learning about this issue and how there's still much work to be done and that bills like this are incredibly important? That is true yes. Thank you. Thank you. Thank you for your help. You have no further questions. Thank you Mr. Speaker. Ladies and gentlemen I ask for your favourable consideration of this bill and I yield the well. The gentleman is yielding the well. We have some folks that would like to speak to the bill. Some of them like it and some of them don't. Rip Park is recognized as a speak to the bill. He weighs. Representative Jasmine Clark is recognized as a speak to the bill. Thank you Mr. Speaker. Today I rise not because I am necessarily against this bill but I think we have an issue in these chambers, in this building, in the proceedings that we do and that issue is that we like to just baby step things that really need a lot more attention. So to be clear I am a huge proponent of expanding broadband. I have been since before I was elected. I have been since I was elected in 2018. It is greatly needed in our state. When we think about the lack of internet access, we normally think about our rural areas and it is true that lack of broadband is a pervasive problem in our rural community. Sadly people who do not have access to the internet are at a great disadvantage in our current and future society. We saw firsthand what happens when something like a global pandemic strikes our communities and there are people in parts of this state that had to find a way to get physical paper packets to students. Because they did not have the ability to do Zoom sessions. They had to be innovative in ways that made it very difficult for them to do what a lot of school districts in our schools did. Hey everybody get on the internet. Hey everybody download your assignment from Google classroom. Hey let's do a synchronous Zoom every day at 1 o'clock p.m. We saw this issue and as a person who has studied microbiology, I am here to tell you with climate change and a lot of the things that is happening in our world and in our country, it is very likely that we might see those types of disruptions again. And so if we do see those types of disruptions again, are we going to be ready? But another thing that I don't think people realize when it comes to access to the internet is that it is not just a rural Georgia problem. There are people all over this state including people in the metro areas or just outside of those metro areas that also don't have access to the internet, that also don't have broadband. You probably don't, if you live in the metro area, you probably can't fathom that there are pockets of places within your own community where people can't get on the internet. Or they have to go to Starbucks or they have to go somewhere else or they have to purchase one of those little wireless hotspots in order to get access to the internet. Now you probably experienced this before, have you ever gone to someone's house and all of a sudden your phone is not working in their house and they are like, oh I have a dead spot in my house. Or the internet doesn't work that well on this street. And along with that people really don't have a whole lot of options to choose from to get internet. You might have people who can only use for example, Xfinity to get their internet. And if Xfinity isn't working well in their area, they don't have any other choices. Other people might try satellites, starlink, all these other different things to try to get internet and it might not be adequate. There are people in metro Atlanta that are dealing with some of the same issues that people in rural Georgia deal with when it comes to broadband. And I don't think anyone in this room would argue that when it comes to the internet without having it, we are pretty crippled. You know, you right now can look up a bill and read that bill and be prepared to vote on that bill by looking it up in your phone using the internet. There are people in Georgia today that do not have the luxury of even knowing what we are doing in this building because the only access to the things that we vote on every single day, the only access is the internet that they do not have access to. And so you're probably saying, well what is the issue? I feel like you agree with this bill. And you're right, I don't have a problem with expanding broadband in this state. It needs to be done. The problem I have is it needs to be done yesterday. We keep baby stepping this issue. This is not an issue that we need to baby step, we need to floor it. We need to put our foot on the gas pedal and floor it so people can get access to the internet, not that they want, but the internet that they need. I think this bill is a bill in the right direction, but I am so tired of feeling like when we sit in this chamber, all we do is do just enough to say we did something, but we never do enough to do something that is actually meaningful and impactful for the people of Georgia that send us up here to help them, to protect them, to give them what they need in order to thrive in their life. Now, I will likely vote for this bill, but this is not the first time I've come to this well during this session.\n\nto talk about the fact that the things that we do in this chamber are not always what we tell our constituents we did when we go back home. You will likely vote for this bill and then you will say go back home and put on your campaign literature that you expanded broadband in your area. That's not what you did here. You might have taken a step toward that, but I would love to see us be bold in this chamber. I would love us to be both see us be bold outside of this chamber. I would love for us to engage with the people who can bring actual broadband to our communities and just make this happen. Let's stop taking baby steps. Let's be bold. Let's blur it for the people of Georgia who need to be able to get on the internet. And so with that, Mr. Speaker, I yield the well. Lady has yielded the well. Representative Al Williams recognized to speak to the bill. He waves. Representative Mag Jackson recognized to speak to the bill. Thank you, Mr. Speaker. I rise to the day in support of Senate bill 193 since my friend from the coast. I'm going to support Senate bill 143 because broadband is essential. It's vital to the economic development to this state and especially to our rural communities. While the FCC maps did not accurately show the underserved areas in rural Georgia, but thanks to the Department of Community Affairs, Georgia has led and mapping out these underserved areas. Washington EMC received $13 million for fiber-opted build-up to some of the most underserved communities in the state. When you look at Washington County, you look at Hancock County, Glasscock County and Warren County, those counties were underserved. They were inaccurately mapped out. As a member of the rural development council, we focused on rural broadband for several years. Senate bill 2 authorized the EMCs to engage in and to sell broadband. Several of the money has been a tremendous asset for rural broadband build-up in our rural communities. Underserved areas are thankful for what we're doing to build out rural broadband and we're excited to see the furtherance of this build-out in our underserved areas, especially in our rural communities because we've seen tremendous, tremendous growth in rural broadband in the last couple of years. So, I'm going to report Senate bill 1493 and I ask that you vote yes on this bill. Thank you for speaker Yeal DeWell. Representative Park Cannon has recognized the speak to the bill. Representative Cannon. Thank you, Mr. Speaker. Here really excited about this bill. I want to tell you some back story. So, three years ago, right before the pandemic hit, I applied to a program at the Harvard Kennedy School of Government to study an issue. I was actually accepted as one of the Bonet Fellows and LGBTQ Fellows, you know, L being lesbian, G being gay, B being bisexual, T being transgender and Q being queer. And so, of course, I was the queer legislator who was there and we did have bisexual folks, we did have gay men, we did have lesbian, so we did not have anyone from the state of Georgia who was a transgender state elected official. So, I thought that was super interesting and started looking around to see what we were going to do during this four week long program, what these people were going to study, what those transgender elected officials were studying. One of those was Andrea Jenkins. She's actually the first openly transgender elected official in the United States. She's a black woman. She has medical conditions that are not related to her transition, but, you know, she was excited to actually go to Harvard as well as me for full. She's been with me for four weeks, stay at the hotel, off campus, go to class every day, do readings. And so, we decided that we were going to team up with one of our colleagues from Alabama. Now, he was not transgender, but he was supportive of the trans community. And so, he started studying broadband access. You see in Alabama, never having a lot of issues with folks being able to upload and download. And I got to know more than I wanted to know about what was going on. You see here in Metro Atlanta, we do have some pockets that have broadband issues. And so, many of the members of our caucus have actually done op-eds in our local papers talking about those broadband blind spots, those dark zones, those places where you can't upload and you can't download and you can't do your research. So, what he did in Alabama, similar to this bill, was figured out which consultants that they could bring in to help their state agency work on broadband access. And I thought that was great. So, I was excited to see that that was in this bill. But I think that it's also very interesting that in this bill, we understand why you bring in professionals who know more about the subject matter, to study the issue and to help forward the issue. Instead of just appointing a body of legislators who don't know about broadband issues, you actually bring in the consultants that know about this. And I thought that was great. Now, as we talk about uploading download speeds, I know in different districts, people have different access. You know, what they can download depends on where they are, certain places, don't allow for you to do certain downloads or don't allow for you to go on certain websites. But actually, at the end of the day, we can all use the internet to research issues that we might not know about. I think that many of us could benefit from doing some more research on transgender people. But this bill, we will actually be able to move forward in moving that research forward. And so, I hope that we'll all continue to do the research that we need to do. I do not think that the bill is perfect. And in consult with some of my other colleagues, we've wondered, you know, if we could move a little bit more in this, Alabama actually is superseding us with what they're allowing for their upload and download speeds and what programs that they're letting their states departments contract with. So, I do think that we need to work on this a little bit more with our department. We are excited about community affairs and all that they do. But I will be supporting this bill today and just hope that we continue to work on it. Thank you, I yield the well. The lady has yielded the well. Representative Evans speaks to the bill. Representative Evans is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, our rise in support of Senate bill 193 and applaud this body on recognizing broadband as the necessity that it is. That was certainly brought to light during the pandemic, but it was obvious before that. And so, I'm really, really glad to see us taking this step. But as we do it, I just want to make sure we realize that yes, broadband is essential. And yes, we want to make sure that it gets extended to everywhere that there are people in the state because if you're not able to connect to the internet, you're not able to connect to life these days. And that's just the truth. But we need to recognize that there are people across our state right now that don't have access to clean drinking water. And so, while I'm glad to see us moving toward making sure that everyone has access to broadband, let's not forget the other basics. There are communities in middle Georgia. There are communities right here in Atlanta that have had problems brought to life about the cleanliness of their water and it's happening all across the state. And I call on EPD and all those who have the ability to make sure that folks have access to clean water to really pay attention to that as much as we're paying attention to broadband. Thank you, Mr. Speaker. I yield the well. The lady has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? There is objection. Does the gentleman move? Chairman Parsons, do you move? The gentleman moves. All those in favor of adopting the committee's substitute on SB 193, we will agree to the committee report as it came before this floor that we just debated. All those in favor will say aye, vote aye, green. All those opposed will vote no, red and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. The yeas are 166, the nay zero. The report of the committee has agreed to. Shall this bill now pass? All in favor of passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 167, the nay zero. The bill will have received the requisite constitutional majority, therefore passed. If I can have your attention please. Senate bill 149 will be postponed to the next legislative day. Senate bill 64 will be postponed to the next legislative day. For what purpose is represented in crow rise? Make a motion, Mr. Speaker. State your motion. I move that Senate bill 90 be recommitted to the rules committee. Mr. Clerk, will you read the caption? Senate bill 90 by senator Dixon, the 45th and others to be entitled back to amend chapter 1 and title 10 of the EFJ Georgia Anitator relating to selling and other trade practices so as to provide for commercial financing disclosures. All the gentleman's motion that SB 90 be withdrawn from the calendar and recommitted to the rules committee is the objection. There is objection, the gentleman move. Here is our posture. There has been objection. We will vote on the objection and on the motion to move the bill back to the rules. If you vote green, you will be voting to move it back to the rules. If you vote red, you will be voting in the other direction. Mr. Clerk, will you unlock the machine? Have all members voted? If so, the clerk will lock the machine. The yeas are 165. The nays are won. Senate bill 90 is back to rules. For what purpose does representing camp rise? Senate bill 90 is back to the rules. The question is, will the committee be withdrawn from the calendar and recommitted to the other intergovernmental coordination committee? If there is objection, hearing done, it is sorted. We will move on to afternoon orders. Ladies and gentlemen, please recognize the bill. I just want to thank chair lady Smith for the hard work. I would like to thank the committee. Thank you, chairman Knight. I would like to introduce you to Max. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, representative. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Mr. Clerk, will you read the caps into a group of privileged resolutions? I would like to thank the committee. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Is there any objection to adopting the privileged resolutions that chair has been in the resolutions are adopted? We are going to move on to announcements now. Thank you, chairman Knight. We usually have our annual gathering. We are going to move on to announcements now. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Thank you, chairman Knight. Now something to hang on for. Representative McClain is recognized for an announcement. Thank you, Mr. Speaker. The caucus will be meeting in room 307 and the CLOB. And today we are doing Medicaid unwind. And look forward to seeing you on room 307, CLOB. Again, 307 CLOB. Thank you, Mr. Speaker. The Fulton County delegation will be meeting today at 4 o'clock in 605 CLOB. Please be present. Thank you. Chairman Parsons, recognize for an afternoon order, excuse me, for an announcement. Thank you, Speaker Burns. Members of Energy Utilities and Telecommunications Committee, we will meet Monday morning at 8 o'clock and room 403 here in the Capitol. We are going to be taking up that telecommunications consumer protection legislation we have been working on now for several days. That is on Monday. Thank you. Thank you, Mr. Chairman. What time do you say? 8 o'clock Monday, very important legislation and just committee. Chairman Dickie is recognized for an announcement. Thank you, Mr. Speaker. The agricultural consumer affairs committee meeting is cancelled for today. You should have gotten an announcement through that. Look for reschedule early next week. Thank you. That completes our announcements. We have some birthdays over the weekend. Well, actually starts tomorrow. March 17th. Chairman Martin Newton has a birthday. Happy birthday, Chairman Newton. On Sunday, March 19th, Representative Viola Davis. And Representative Doreen Carter. There she is. Happy birthday, y'all. We do have some pages. If you have a page, if you are joining us down front, we will have some photos. And thank our pages for being here and working today. The majority leader of this house has recognized for a motion. Thank you, Mr. Speaker. I move that this house stand in recess until 4 p.m. and then adjourn until 10 a.m. on Monday, March 20th, 2023. On the motion of the majority leader that this house stand in recess until 4 p.m. today, at which time then we will adjourn today. And we will come back here on Monday. Monday, March 20th, March 20th, 10 a.m. Monday, March 20th, 2023. On the motion of the majority leader that we will be back here for session on March 20th. All those in favor will say aye. That sounds good. All those opposed will say no. Oh, yeah, the eyes have it. We are adjourned. We are in recess. We are adjourned.",
  "updated_at": "2026-02-14T03:06:54.078419+00:00"
}