{
  "video_id": "JLPk02TUCmM",
  "url": "https://youtu.be/JLPk02TUCmM",
  "title": "Georgia House - Day 39 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-03-29",
  "duration_minutes": 133,
  "summary": "Overview:\nThe Georgia House session on 2026-03-29 (legislative day 39) featured a diverse array of legislative activities, from the introduction of several bills to notable speeches and procedural matters.\n\nKey Actions:\n- **HB 826**: Not mentioned in the transcript provided.\n- **SB 156**: Not mentioned in the transcript provided.\n- **SB 260**: Not mentioned in the transcript provided.\n- **SB 59**: Not mentioned in the transcript provided.\n- **SB 213**: Not mentioned in the transcript provided.\n\nBills Introduced (First Reading):\nThe transcript does not mention any bills being introduced for first reading.\n\nNotable Moments:\n- The session opened with a scripture reading and prayer led by Pastor David McKinley, who delivered a thought-provoking sermon on the significance of the resurrection of Jesus Christ.\n- The Speaker received a special \"Amen\" hat from Pastor McKinley, which provided a lighthearted moment.\n- Pastor McKinley shared personal anecdotes and reflections on his ministry, highlighting the challenges and privileges he has faced over the years.\n\nVotes:\nThe transcript does not mention any recorded votes.\n\nAttendance:\nThe session began with a quorum call, during which members were instructed to vote green to signify their presence.\n\nAdjournment:\nThe transcript does not provide information on the adjournment of the session or the date of the next scheduled session.",
  "transcript": "All members of the House will please report to their assigned seats. All members of the House of Representatives will please report to their seats. Oracle Ring the Bell. We are about to have the morning roll call. We are about to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. I'm not telling you. If all members now voted, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. We will begin our day, legislative day 39 with scripture, reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 123rd House District Chairman Mark Newton. It is a joy and privilege to introduce my friend and my pastor, David McKinley. David has this rare ability to convert complex biblical doctrine into every day language. Language that can both challenge and motivate change. He is the senior pastor at our church, Warren Baptist Church, and Augusta, leading a ministry team reaching out to thousands of families in our area every week. We are glad that he and his wife Connie, who I hope is watching, are serving with us these past 13 years. Previously David, pastor at Merritt Island and Boko Raton, Florida, but I have heard from a hint that he has grown to love a little island off the Georgia coast that the speakers fond of and Mayor Don Hogan is fond of, St. Simon's Island. He is also the author of two books, the latest of which is The Life You Were Born To Give. David and Connie are blessed with two children and six grandchildren. Finally, Pastor David reminded us that God calls him to comfortably afflicted and to afflict the comfortable. This past year has certainly seen challenges in how we comfort others in time of loss, loss of jobs, loss of fellowship, even loss of life. David and the team have done a wonderful job reaching out in new and caring ways in a challenging year. He is also never strayed from the second part that I mentioned of afflicting the comfortable of challenging each of us not to be satisfied with the status quo, but for each of us not just on Sunday to reach out to others regardless of any situational differences to motivate us to bring unity and make a positive difference in the lives, families, and communities around us. I trust you will appreciate this as well as we hear this morning from my friend Dr. David McKinley. Thank you, sir. Greetings and blessings to each of you today. And thank you so much, Mr. Speaker. And to each of you representatives from across the breath of the life of Georgia and my dear friend Mark Newton, Dr. Newton, who is a congressman who is a physician who has all sorts of things that he does and I'm so thankful for that. And I do bring you greetings today from the Garden City of Augusta, Georgia, where we are seven days away from the great tradition of the masters, the 85th edition of the masters. And I believe this week that you all have received some hats that are allowing you to participate in that. I brought one more of those that I want to present to the speaker this morning. And it's kind of one of my favorites. It's the Amen hat. And so Mr. Speaker, I want you to be in my corner today and get an Amen before I even begin. Okay, so there we go. Thank you. So very much. I appreciate that. So we have the Amen corner hat up here today. Now I realize that as I come before you this morning that I am on your turf and that I want to both honor your time and your attentiveness. But in a unique scheduling sequence, we are also in a place where you are on my turf. I am not a lobbyist or a legislator. I am a pastor and a teacher. Throughout my life and throughout my ministry, I have tried to be faithful to the calling that really I sensed when I was 15 years of age, 15 years old that I had a sense of coming and doing what I'm doing today. Now obviously a lot of time has passed since I was 15. I am now in that category of life where I'm often asked, senior, and I always respond, no, I just turned 40, but I've had a really hard life. And that's what I always try to say to help people to understand. When I was 15 years of age, I never could have imagined the challenges, the struggles, the hardships, the tragedies that I would face in years of ministry. I will return home this week to officiate in a funeral service for the loss of a husband and a father, a former veteran whose wife, 39 years of age, is left with three children. As you know, this is so much a part of life that we walk through the struggles. I also could have never estimated, and I have often underestimated the enormity and the regularity of the conflicts and challenges and changes that I would face over these last four decades. And I know that you are not in any way unaccustomed to personally dealing with conflicts and challenges in your life. I think the greatest leadership maxim I've ever learned is this. I cannot make everybody happy, but I can make everybody mad. And I think you understand that as well, right? I also never dreamed of the privileges and the platforms that would be extended to me, one of which is standing in front of you today. But as I'm here in my life, just as in your life, a lot of different things have shaped the growth, the development, the experience of my life. And one of those happened really after I graduated from college, and while I was working on my master's in seminary, I threw a paper out. 286 copies of the commercial appeal newspaper from Memphis, Tennessee every day of my life for seven days a week for over three years. And you know something that was true of that experience was that never on one occasion did I ever write the news and never did I print the paper. All that I did was delivered it. And as I come before you today, that is the spirit in which I come. I simply want to stand in this holy week here between Palm Sunday and Good Friday and Easter and to deliver to you what I believe to be the most important message in all the world. In 1 Corinthians 15, verse 3, the Apostle Paul said, for I delivered to you as the first importance what I also received that Christ died for our sins and accordance with the scriptures that he was buried and that he was raised on the third day and accordance with the scriptures. And then he appeared to Peter and then to the 12 and then to over 500 eyewitnesses. Here in this one text we have the totality and the simplicity of the message that is known as the gospel. The word gospel means good news. And the good news is that God sent his son Christ to die for our sins because we are a lot of faulted people and we need forgiveness. That Christ was buried in order that he might taste death and then that he rose again on the third day to give healing and hope to all who would look to him and that that testimony of the resurrection was not simply something that was passed but something that would be carried on through over 500 witnesses who were willing to risk their lives for the reality of this message. And so the whole of the message of the Christian faith has built on the reality of the resurrection of Jesus Christ. It was the Anglican theologian John Stott who said it well when he said Christianity is in its very essence, a resurrection religion. The concept of resurrection lies at its heart. If you remove it, Christianity is destroyed. And he's exactly right. Paul in this same chapter went on to play his own skeptic when he wrote on down in verse 13, for if there is no resurrection from the dead, then our preaching is in vain. Your faith is futile. And even we, that is the disciples, are found to be misrepresenting God because we testified that Jesus rose from the dead. And if Christ is not raised, your faith is futile, you're still in your sins and those who have fallen asleep in Christ have perished. And if in Christ we have hope in this life only, we are of all people to be most pitted. Think about what he just said there. He said, if Christ is not alive, then all preaching is pointless. I don't know about you, but I've heard some pointless preaching in my time. Can I get an amen on that one at least? Yeah, there's plenty of pointless preaching, but what I'm here to tell you today is it's not an issue of pointless preaching. He essentially Paul is saying if Christ isn't risen, there is no good news because there is no news. And while some men may live a lie, few are willing to die for a lie and the disciples were willing to die for the truth of the resurrection. He says faith is futile, even foolish. We talk a lot in our world today about believing, but the question is not just do you believe? What do you believe? Faith isn't just a subjective thing, it's an objective thing. There must be a foundation of our faith. And then he says, if this is true, then the disciples are deceivers. They weren't just good men who didn't know better. They were bad men who willingly and knowingly deceived. He even used the courtroom scene. He said, we miss represent through our testimony. He was talking about perjury. And if Christ is not alive, then death is final and the future is fearful. The only universal truth if Christ does not live is death. And then he says that the very end, Christ's followers are pitiful people. That sounds more like late night with Bill Mar than it does a biblical passage. Because if there is no Easter, then there is no hope. I love what Timothy Keller said when he said, if Jesus rose from the dead, then you have to accept all that he said. If he didn't rise from the dead, then why worry about anything that he said? The issue on which everything hangs is not whether or not you like his teaching, but whether or not he rose from the dead. And I stand before you to share testimony today that my hope is not in the Christian faith tradition, but it stands on the firm foundation of the resurrection of Jesus Christ. Because I believe this to be the message of hope and the message of healing because it is a message of power. Jesus didn't just come to show us how to live a good life. He came to give us power, to give us a new life. And I would just simply say and be so bold as to suggest to you today that the greatest need in our world today is not for more information or inspiration, not more moral teaching or psychological understanding, and not even greater economics or education, though every one of these has their place. The greatest need that we have right now in our world is for power. And I believe that that power is found in the name of Jesus Christ and His resurrection. I close with this, SM Lock Ridge, an African-American pastor who for 40 years shepherded the Calvary Baptist Church in San Diego, California, who was known for his alignment and allegiance through the civil rights era and hosted Dr. Martin Luther King in his church. By the way, if you've never Googled SM Lock Ridge, do it. There are some fabulous YouTubes out there. One of them is called It's Friday, but Sunday's coming. And the other one is called That's My King. And in that he says this, Christ is enduringly strong. He is entirely sincere. He's internally steadfast. He's immorally graceful. He's empirically powerful. He's impartially merciful. No barrier can hinder him from pouring out his power in blessing. That's My King. Do you know him? I may be naive, but I think there are plenty of people in this room just as there are in every congregation that I stand in front of, who today need help and healing and hope. And I pray that in the face of all of the issues that divide us and the doubts that surround us and the discouragement that weighs on us and the despair and the defeat that inevitably causes us to look at the reality of death that threatens us, that you will take some time this week to read and to consider the witness in the testimony of Paul in 1 Corinthians chapter 15. And the voice of many through many millennia who would share with you what I say today is the headline of My Delivery, Christ's Rism, and there is life and hope in His name. And what I deliver to you today, I believe to be the truth, the whole truth, and nothing but the truth, so help me God. Would you pray with me? Now may the God of peace and the God of hope fill you with all joy and peace in believing so that through the power of the Holy Spirit you may abound in hope. I pray in Jesus' name, amen. Would you join me in the pledge? I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. Let's get a picture of it. Thank you, my friend. Doorkeepers will unlock the doors. Before I recognize Chairman Hogan, I want to remind all members of the House, if I could have your attention, COVID-19 testing will take place today in Room 230 here in the Capitol, and it will continue until 11 a.m. You still got a few minutes to get down there if you haven't tested. All members and staff must test today. Testing will be open until 11 a.m. Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the Journal of the Previous Legislative Day and found it be correct. And furthermore, Mr. Speaker, we need to be decisive right or wrong, make a decision. The road of life is paved with flat squirrels who couldn't make a decision. Chairman Hogan, the Chair of the Committee on Information and Audits reports that the Journal of the Previous Legislative Day has been read and found to be correct. Is there any objection to the confirmation of the Journal? The Chair here is none and the Journal is confirmed. The clerk will read the resolution establishing the Order of Business for the Day. Mr. Burns, on the 50th Anniversary, I post following me establishes the Order of Business to our first part of the period unanimous consensus. Introduction to Bills and Resolutions, first reading and reference files, bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the Order of Business for the Day? The Chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 8 by Representative Scott of the 76 Bill of the Natto Men Chapter 3, total 20 of the Fish Go To Georgia annotated relating to post-secondary education. House Bill 14 by Representative Scott of the 76 Bill of the Natto Men article 3, chapter 2, total 40 of the Fish Go To Georgia annotated relating to prestige license. Order vehicles. House Bill 8, 22 by Representative Scott of the 76 Bill of the Natto Men Chapter 4, total 1 of the Fish Go To Georgia annotated relating to holidays. State planning and community affairs. House Bill 8, 23 by Representative Newton, the 123rd hatched 150th Douglass, the 78th and Cooper, the 43rd Bill of the Natto Men Chapter 24, total 33 of the Fish Go To Georgia annotated relating to insurance. Special committee on access to quality health care. House Bill 824 by Representative Cantrell, the 22nd and Mitchell of the 88th Bill of the Natto Men Chapter 6, the total 47 of the Fish Go To Georgia annotated relating to Georgia legislative retirement. Retirement. House Bill 825 by Representative Cooper, the 43rd, Dempsey of the 13th. Parish of the 158th Stevens, the 164th and Smith of the 70th Bill of the Natto Men article 7, chapter 4, total 49 of the Fish Go To Georgia annotated relating to medical assistance. House Bill 826 by Representative Hart of the 36th, the 34th and Setsler, the 35th Bill of the Natto Men Corporate, the City of Lost Mountain. Answer governmental coordination. House Bill 827 by Representative Petrie, the 166th Hitchens, the 164th, first. Chalkas, the 38th, Newton, the 123rd, Stevens, the 164th Bill of the Natto Men Code Section 35, 823 of the Fish Go To Georgia annotated relating to basic training. House Bill 828 by Representative Voting, the 62nd, Skullfield, the 60th Park, the 101st, one of the 89th, Limb of the 99th and others. Bill being talon act to Men Part 1 of Article 1, chapter 7 of Title 34, the Fish Go To Georgia annotated relating to wages. Industry and labor. Resolution 467 by Representative Green, the 151st Duke, the 154th. Lehood of the 175th, House to the 170th, Nix of the 69th. Resolution urging the Georgia Department to transfer transfer. Resolution invitation. House for Resolution 496 by Representative Carper, the 4th, Paul, the 32nd, Chas, the 11th, Smith, the 18th, Skoggins, the 14th and others. Resolution proposing and amendment to the Constitution. Education. That completes First Readers. Second reading of bills and resolutions, the clerk will read. House Bill 809 by Representative Davis of the 87th, Scott of the 76th, McLeod of the 105th, Taylor of the 91st, Scott of the 60th, the bill relating to conditional discharge, possession of control substance, his first defense. House Bill 810 by Representative Buckner of the 137th, Stevens of the 164th, Matthewc of the 73rd. And all that to the 42nd, Scott of the 60th and others, the bill relating to sales and use taxes. House Bill 811 by Representative Cooper of the 43rd, the bill relating to professions and businesses. House Bill 812 by Representative Lim of the 99th, Maynard of the 56th, Lopez of the 86th. Bill relating to zoning procedures, House Bill 813 by Representative Lim of the 99th, Maynard of the 56th, Lopez of the 86th, the bill relating to general provisions relative to mass transportation, House Bill 814 by Representative Lim of the 99th, Maynard of the 56th, and Lopez of the 86th. The bill relating to zoning procedures, House Bill 815 by Representative Lim of the 99th and Tom, so the 21st. The bill relating to annexation pursuant to application by owners of 60% of land and 60% of electors. House Bill 816 by Representative Lim of the 99th, Scott of the 76th, Park of the 101st, Lopez of the 86th, Maynard of the 56th. The bill relating to the Department of Community Affairs, House Bill 817 by Representative Lim of the 99th, Maynard of the 56th, and Lopez of the 86th. The bill relating to initial determination and redeetermination of eligibility for amount of and duration of unemployment benefits. House Bill 818 by Representative Lim of the 99th, Scott of the 76th, Park of the 101st, Lopez of the 86th, Maynard of the 56th. The bill relating to landlord and tenant. House Bill 819 by Representative Lim of the 99th, Maynard of the 56th, and Lopez of the 86. The bill relating to foreclosure, House Bill 820 by Representative Mitchell of the 106. The bill relating to hope, scholarships and grants, House Bill 821 by Representative Mallow of the 163rd Mathiack of the 73rd Games of the 117th, Neil of the 74th, more of the 95th. The bill relating to tax returns and furnishing of information. House Resolution 452 by Representative Cooper of the 43rd Resolution, urging the Georgia Department of Public Health to take action to increase child and adolescent immunization rates. Senate Bill 300 by Senator Hickman of the 4th. A bill to amend and act creating board of commissioners for a Tatinal County. Senate Bill 301 by Senator Dougan of the 30th, the bill to authorize the City of Carrollton to exercise all redevelopment and other powers under the redevelopment powers lost. Senate Bill 302 by Senator Walker of the 30th, the bill to amend and act to provide a minimum compensation. In certain county officers of the Polesky County. Senate Bill 304 by Senator Kennedy of the 18th, the bill to create the Peach County Public Facilities Authority. Senate Bill 305 by Senator Berk of the 11th, the bill to provide a home setting exemption from early county school district, Edgelhorn, Texas. Senate Bill 306 by Senator Jones of the 10th and Strickland of the 17th, the bill to amend and act to provide for a new board of commissioners of Henry County. Senate Bill 307 by Senator Walker of the 30th, the bill to create a board of elections and registration for Polesky County through second readers. Reports of Standing Committees, the clerk worried. Representative Chan Takersley, the 160th district chairman of the committee and intergovernmental coordination locals submitted the following report. And speak your committee on intergovernmental coordination locals and a consideration of following bills of the Senate. As a structural meeting report, same back to the House following recommendations. Senate Bill 21 new pass, Senate Bill 285, new pass, Senate Bill 286, new pass, Senate Bill 290, new pass, Senate Bill 293, new pass, Senate Bill 296, new pass, respectfully submitted, Representative Chan Takersley, the 160th district chairman. That completes the reading of the Reports of Standing Committees. Okay, we're going on now to the local calendar. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered, the clerk will read the local calendar. Senate Bill 21 by Senator Jones, the 10th city of Stonecrust, Senate Bill 285 by Senator Jones, the 10th Henry County, Senate Bill 286 by Senator Jones, the 10th Henry County, Senate Bill 290 by Senator Hickman, the 4th Evans County, Senate Bill 293 by Senator Pared to the 42nd. The 10th and the 10th county, Senate Bill 296 by Senator Gooch, 51st, White County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none, the report of the committee. Is agree to, shall these bills now pass all those in favor of the passage of the bills? On the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted. If so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 155. The days are five. These bills having received the requisite constitutional majority are therefore passed. Going on now to morning orders. Going on to morning orders. Members will give attention and respect to the members in the well.\n\nrecognizes Chairman Lynn Smith and members of the Caluina County delegation along with their neighbors in that part of West Georgia for a morning order. Good morning everyone and thank you for your awareness by standing like you are today for what happened to our county last Friday morning. We truly had not yet absorbed what's happened to our county all of us have been out in it working doing our part. We have some information up here on the board for our local governments for you to make contributions if you want to. But there is a story to tell here all of us were out in our communities experiencing what the people we know and love so well were dealing with. But please indulge us for a moment as we share this story with you because it's worth telling. My county and the district we represent all of us here has been wiped out in so many places by midnight tornado and EF4. 170 miles per hour and I'll say that five more times 170,000 miles per hour. Yeah that's incomprehensible. It roared with very little warning, pale male through our homes and lives. The dawn brought us to silent witness of what had happened. The day saw scrambling like ants in an ant bed that had just been kicked open as we moved about trying to comprehend. Most of us were able to do a flyover of the area to see what had happened. This flyover gave us a sense of destruction. Six miles of sustained winds on our land. Wide in places, fourth of miles is the smallest area that was hit. This is still incomprehensible for all of us here today. But when we got back home to our homes and when we went out to see what we could do to help, some had chain saws, some were bringing water, we were all trying to do it. But this is what we saw later, the walkabout. Actually as we stumbled about, it gave us a bone chilling wake up call to the 3D demolishing of our homes, trees, lives, chaos, chaos. But then as if a movie producer snapped the scene marker, a symphonic energy emerged. There were checking for survivors, trees were moved off roads and houses. And when I tell you checking for survivors, that is really true. You had to move things out of the way and you were trying to find out where they home that morning. It was a story that we knew would never end. But the utility trucks came in from everywhere, volunteer groups of all kinds materialized and good things began to happen. As if our lives were now being guided by an airstrip. Chaos was being reshaped and reformed. We have such a long way to go. How do you replace a high school that has anchored our lives for over 70 years? I taught there during desegregation, the history and the goodwill this high school has for our community still exists, but there will not be any structure for almost two years because it was demolished. How do you replace trees that are over 100 years old? How do you regain the store combs, both in the wealthy areas of our area and in the poorest areas of our area? How do you cope? How do you survive? How do you thrive? Well, I can tell you, as we are witnessing it now, the talent and creativity that has long defined noon and in cowita is being put to good use, guiding our energies into a 21st century marvel. We know that is our goal. There is no woe in us with God is our strength. This is from Corinthians. With God is our strength and our guiding light, we can overcome and survive our hardships. But it is with your compassion that you are showing today. It is the compassion of so many leaders in our state. We have schools, bedwacking, Jema. We are really living almost as if we have just been a bomb that area. But thank you. We don't have all the information to tell you now because so many have already spoken to us about helping us. What can we do? We are still putting it together. But our community has always been able to try and keep and have the type of leadership that we have always found out we needed. Look at our delegation here today. We have Randy Knicks here with the story to tell us about Howard County. Coming from Howard County and Cowita County. What is still incomprehensible to me to all of us though is that no one died. I know. Y'all. But it wasn't for lack of that storm trying. We can all give you a tale. Somebody's second store apartment was sucked out, got the cat. The man who wasn't there came home and found his cat. The friends of mine, someone was awakened by the siren. And there's maybe something there. Got out of bed in the tree, hit her bed. We can all tell you a tale like that. But we survived. There was one man who heard the siren and was trying to get to his family in time to help them and he died of a heart attack on the way. It is not counter-deserved to this storm. But it is an example of how much compassion and wherewithal that we as people have when we pull together. We are a faith-based state. That is so obvious. I stood with our ministers. I stood with the principal of the high school that was no more. And I said, you've just been through COVID. I said, you know, at least you haven't trained to do virtual learning. I said, but what about the Asprey to Core? What about the campus? What about the next year? But those are things we don't answer. I think we, instead, use the spirit and the love that God has given us. We tell you our story. We ask your grace and strength for our community. And I'm going to step aside now because I know there are other stories to tell. And Mr. Speaker, I'm looking for the hook. But if you'll let us keep talking. We only have a collective time limit. There's two minutes left. Two minutes left. The other actual resident of Cowardy County is representative Singleton. And he can tell you briefly what his team of volunteers did. Thanks, Lynn. I think Chairman Smith said it very well. It's hard not to get emotional about it. We're all very tired. It was a very long weekend. We have an unbelievable support. We have an emergency collection point that we've actually had to move to the fairgrounds now. Because we overwhelm the initial emergency collection point. And so now it's at the fairgrounds. And we're actually having to ask people to stop giving because we have so much. We went and just a couple hours notice we were able to put together some reaction teams. A couple hours notice we put out, hey, everybody meet at Smokey Road Middle School. I'm ahead over 150 family members and people show up. And we were able to go clear some houses and families. There's just one family that we cleared their yard. And the only thing you could see in their home was the master bathroom with the shower tub combo. Still standing. You can see the back of the shower tub. Everything around it was gone. Completely gone. And the family of four and their dog were in the tub. And they survived. They were unscratched. So there will be stories. We'll share more with you. Thank you for your prayers. That's obviously extremely important. And the out-appoints of port, you know, the governor coming down and seeing the devastation and putting the resources immediately into play. It's hard to understate how important that was and how important that's going to be going forward. But pray for our community. We have a lot of work that's going to be needed. We're going to need resources. We're going to need your support as a body. And I just, I think you and I think Chairman Smith said it. Well, I said it best. Thanks. Thank you, Mr. Speaker. Thank you, Madam Chair. Time for morning orders has expired for today. There were a number of members who did not get reached. Please see the messenger if you wish to sign back up for legislative day 40. We are now going on to the rules calendar. What purpose does Chairman Richard Smith rise? What state your motion? I move that Senate Bill 78 that's on the current rules calendar. And Senate Bill 201 on the first supplemental calendar be recommitted to rules. Could you state those bill numbers again? The Senate Bill 78, which is on the current debate calendar. And then Senate Bill 201, which is in the first supplemental calendar. Clerk will read the caption. Oh, he does not have the supplemental calendar yet. Why don't we come back to that one when the supplemental calendar is published? Senate Bill 78 was Senator Jones, the 22nd Anderson, the 43rd Harlow, the 40th parent of the 42nd, the 55th and others, the Natal Nacto Men, Part 3 of Article 3, Chapter 11, the Title 16th, which go to Georgia, Entity Relating, the Invasion of Privacy, so as a revised prohibition on electronically transmitting or posting nude or semi-explosive photographs or videos. On the Chairman's motion, the Senate Bill 78 be recommitted to the rules calendar. Is there objection? The Chair hears none, and it is so ordered. On Thursday of last week, legislative day 38, Senate Bill 246 was postponed until the next legislative day. It is called at this time, the clerk will read the caption to Senate Bill 246. Senate Bill 246, Senator Brass, the 28th Alpers, the 56th perpetrator, the 32nd Paine, the 54th and others, the Natal Nacto Men, Code Section 22690, the Fish Code of Georgia, the Annatated Relating and Educational Entities and Requirements for Private Schools and Home Study Programs, so as to provide for the Learn Pod Protection Act. This bill ever further from the Committee on Education, that committee recommends a dispelled dupe pass by Committee Substitute. Chair recognizes Chairman Jasper's to present the bill. Thank you, Mr. Speaker. Glad to be the first step on day 39. Senate Bill 246 is a unique opportunity in education that many of your families are taking part in right now. It is responsible for the COVID in school education changes. It is something called a Learning Pod. And so what is a Learning Pod? It is a volunteering group of parents of public school, K-12 children and parents, choosing to get their kids together to enhance learning. We are talking about neighborhood groups, apartment pods, possibly a subject matter pod, to assist in their kids' education. This is for using K-12 when in a remote learning situation. It is so common today and we know it is going to be carried on into the future. The bill's sponsor worked with decal, that is an apartment of early chair Karen Learning, to answer a few questions that they had in concerns. And to me this bill just simply protects parents and gives them the opportunity to educate their children. This bill passed out unanimously in education and I appreciate your favourable consideration on this and I will be glad to answer any questions, Mr. Speaker. You have no questions. Thank you. Thank you Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill? No. The bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The bill members voted have all members voted. If so the clerk will lock the machines on the passage of Senate Bill 246. The eyes are 155. The nays are 7. This bill having received the requisite constitutional majority is therefore passed. On last Thursday Senate Bill 213 was postponed to the next legislative day and it is called at this time the clerk will read the caption to Senate Bill 213. Senate Bill 213 by Senator Harper the 7th, the painting of the 54th, follows the 53rd, the 13th, the 51st. The title of an act to amend Article 10 of Chapter 2, title 20. The official go to Georgia annotated relating to contracts and purchases by public schools, so it's required for payment on guarantee energy saving contracts by local school systems. Let's bill ember for the committee on education. The committee recommends that this bill do pass. Chair recognizes chairman Trey Rhodes to present the bill. Thank you Mr. Speaker. We have before you today SB213. SB213 deals with energy savings contracts and what these are tools that are used from our school systems. Mainly our rural school systems and smaller school systems use these as ways to alleviate pressure from their general fund. And basically all this bill does currently right now. They are listed under Title 20, entitled 50. And what this bill does is take them out of Title 50 and put them into Title 20. So these can be used by our schools. Mr. Speaker, that's the generalities of the bill. I'll be glad to answer any questions. You have no questions? I ask for your favor of consideration. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. All members voted. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 213. The eyes are 164. The nays are two. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 117. Senate Bill 117. I said it in a bill over the 49th. Cows are the 46th and in a Varte, the 31st, the Painted 54th and others. We are entitled to amend chapter 6 and title 16, Article 1 of Chapter 10 of Title 17, Article 2 of Chapter 3, Title 35, Title 42, and Article 1 of Chapter 2 of Title 49. The official go to Georgia annotated relating sexual offenses. This bill I refer to the committee on Judiciary Nonsense. Civil that committee recommends this bill do pass by committee substitute. Chair recognizes representative gains to present the bill. Thank you, Mr. Speaker. Senate Bill 117 closes loophole in Georgia law. We've seen situations in the state from my hometown of Athens to Gainesville to Chatham County where sexual predators only be being charged with a misdemeanor due to a gap in the law. In Athens, for example, we had an individual who was a coach on a community team. He repeatedly and appropriately touched a young female on that team after it became public and other victim came forward as well. Unfortunately, due to Georgia law and the gap in the law, this person was only charged with misdemeanor offenses and was also unable to be placed on the sexual predator registry. This bill will fix that issue by ensuring that improper sexual contact by a person in a position of trust can be charged with a felony. A bipartisan group of prosecutors are asking for this legislation and it passed the Senate unanimously. Mr. Speaker, I'd be happy to answer any questions if there are any. You have no questions. Famous speaker, I yield well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 117 or vote I? Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 117, the eyes are 170, the nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 156. Senate Bill 156 by Senator Harburn, the 16th, tippens of 37th, Lucas of the 26th, Hillary of the 19th, Gucci of the 51st, and others to be entitled to act to amend Title 34 of the fiscal to Georgia, Antietta, Relay New Labor and Industrial Relations. So it's to provide for the appointment of Bonn, Powers, duties, and authority of a chief labor officer. This bill I refer to the committee on industry and labor, that committee recommends this bill do pass by committee substitute. Chair recognizes representative Kirby to present the bill. Thank you, Mr. Speaker. I rise today to present to you a Senate Bill 156. And I'm going to start off with a couple of things about what it's not that I've heard. It's not about unemployment benefits and who's controlling those. And I'll be the first one to tell you, our department of labor, the hardworking men and women in that department have done an outstanding job. When you're dealing with a million unemployment claims and they get 98% of them adjudicated in five to seven days, that's remarkable. And especially when you think they were staffed for a good economy with low unemployment. Now granted, if they get 98% of those million claims adjudicated, there's 20,000 Georgians out there waiting for the final disposition of their claim, whether they're titled to it or not. That's still a lot of people and we get those calls. I know you do too. And they're working hard to get those and they're doing an outstanding job. So this is not about unemployment. If you've heard that, it's not. This has to do more with our bond package than anything. If we lose our AAA bond rating because we don't get the reports that we need on how much money we may owe the federal government, that affects every budget item that you support. It affects our bond package on what we can do and build in the future. This is extremely important information that Chairman England needs, Chairman Tillery in the Senate. That's why 43 senators co-sponsored this bill on the Senate side. So what does it actually do? All it does is we are creating a new position. It's going to be called the wrong page. It's going to be, I'll get it here, the Chief Labor Officer. We went through several different titles over the time, but Chief Labor Officer. And their job is going to be to do those audits and financial reports to make sure they are given to the Chairman timely and our budget people timely. So we don't have to worry about our bond rating going down. The rest of the bill gives them the authority to do that, gives them standing if there's an issue to make sure they have access to the information they need just to do these audits. That's all it's about. Auditing the finances of the Labor Department to make sure we get the information in the General Assembly we need. If there are a few questions, I'll be happy to take them. If not, I ask for your favoral consideration. You do have a few questions if you care to. I will take a few of them, yes sir. Chair recognizes representative Al Williams to your left for a question. Thank you, Mr. Speaker. I'm just, with the gentleman yield. Absolutely. I'm just a little confused, help, unconfused me here. Yes sir. One man is overloaded and can't do it and it isn't happening. What you're telling me is one of the single man can make it happen. Well, I think the commissioner has a lot more responsibilities than just doing these audits and getting the financial reports. That's what this position is going to do. It's just having one responsibility being an auditor and getting this information to us and reporting back to the General Assembly. Well, the gentleman further yield. Yes sir. One final question. Is it not true that our triple A bond rating has been around from several administrations? And is it not further true that all the other labor commissions were able to get this paperwork? What's the difference now? I guess that would be the person who's responsible for doing it, sir. I'll take another question if there is one, Mr. Speaker. We recognize his representative, Glanton, to your right for a question. Thank you, Mr. Speaker, with a gentleman yield. Yes sir. I guess my question is why would we need to augment the duties of the commissioner who volunteered for the position, who's been duly compensated for the position to pass by law someone to fill in the gaps? Why is that necessary? We did not get the information this year that we needed. If we're not getting it, we've got to have it and we need to take action to make sure we preserve that bond rating and get the financial data that we need. Thank you. One further question please. Yes sir. Well, it would seem to me as a leader, both in corporate America and the military, that if you have someone who's not providing you with the information that you need in their areas of responsibility, you get rid of them. That will be up to the voters in 2022, sir. But we're not dealing with the voters and putting somebody in. No, but this does happen. It does, if you look on the last sign in December 31, 2022, this will sunset. Now, we would always have the ability to extend it if we thought that was needed, but it will go with the sunset on the end of the 2022 year. I appreciate the gentleman's response and putting the sunset on it in my mind has nothing to do with taking and alleviating the responsibility in the future. The responsibility in the school of the commissioners responsibility with him being able to do his job. So maybe we need to pass the law to change commissions. Just a vote for another day, sir. Just a vote. Thanks so much. Mr. Speaker, I think we'll go with that and I'm going to ask for your favoral consideration and I yield the well. Chair recognizes representative McLean to speak to the bill. Thank you, Mr. Speaker. You know, colleagues, I rise today to speak against SB 156. I have no idea like you. I've heard the questions about SB 156. We've heard about the bond rate. Even in committee 156, barely got out of committee. It was about six or seven. One vote. I mean bipartisan both sides. I hear that. If someone's not doing a job, we've got an election. We can get rid of them. But also in committee, the governor was the one important, the labor officer. And then I guess it came out of, we've got some kind of way I think, but speaking of the Genshinman speaker, but I guess if it would have came to the community that way, it may have been something different. But now the speaker of the house makes that appointment of that labor officer. Again, we all are elected officials. We all are elected officials. When I say we're all elected officials, I would want anyone to come to my district and appoint someone over me to watch me. And I'm the one that's got to pay them out of my budget. I just think.\n\nThat's wrong. I think that's bad policy. I think we've already done something. This is two old two like. We've taken away the Secretary of State. And now we're working looking forward to take care of the Department of Labor. I mean, colleagues, I'm asking you all to vote no on this piece of legislation because it is wrong. It is bad policy. If we take over the labor, what's next? Secretary of State's gone. Labor commission is gone. What's next? I don't know what's next, but we've got to quit doing that. These people are elected to do a job. And they need to do their job or someone we need to elect somebody else. So with that, Mr. Speaker, I don't take any questions anyone to want to ask or I will yield the well. But I'm asking my colleagues to vote no. You've got a couple of questions if you care to you. How you? Chair recognizes the minority caucus whip representative Wilkerson to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that it's very rare for a speaker that's both for a bill and against a bill to convince me to vote no? Is that not true? Yes. But what you have to realize is it's good policy. And right now, this is bad policy. Only because you're taking someone that's elected by the people and someone that's appointed by an official. And does the gentleman further yield? Yes, I do. So prior to this conversation, my concern was the fact that like many of us in this chamber, I'm receiving a ton of calls from constituents who want their unemployment benefits. But after listening to the sponsor of the bill, is it not true that this bill would do nothing for those individuals that are waiting for their unemployment? The only thing it would do is help us with a bond rating. And that is not people. Is that true? You heard the author of the bill say that this is bond rating. This will not help anyone with you making sure your constituents collect their unemployment. But speak out of you of the well. Gentlemen, is yielding the well? Is there any objection to the previous question being ordered? The chair here is now in the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is now in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is now in the report of the committee. He has agreed to shall this bill now pass, all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose is representative Buckner rise? Parliamentary inquiry. Isn't it true we've had two bills that have effectively removed power from duly elected state officials before our house? If the lady interprets them that way, then I'm sure she does so honestly. Well, further inquiry. State your inquiry. Well, it appears power has been taken away last week from the secretary's state and it appears that with this bill some power is being taken away. I guess I just wonder who's next. Stay tuned. What purpose does representative Jasmine Clark rise? Thank you, Mr. Speaker, parliamentary inquiry. State your inquiry. Is it not true that this bill gives a non-elected official the power of an elected position but will not even address the unemployment issues that are affecting our constituents? I'm sure the lady believes that to be true. We will do one more parliamentary inquiry. What purpose does representative Carpenter rise? Parliamentary inquiry. State your inquiry. Is it not true that the very people that elected us to be down here wanted answers? And when we called, there was nobody on the other line. Chair heard that a few times. Have all members voted? Have all members voted? Have all members now voted? If so, the clerk will lock the machines. On the passage of Senate Bill 156, the eyes are 85. The nays are 84. This bill having failed to receive. The requisite Constitution of Majority is therefore failed. What purpose does the majority caucus whip rise? Mr. Speaker, I rise a certain notice for reconsideration. Jim, has that right? What purpose does the minority caucus whip representative Wilkerson rise? At the appropriate time, I'll object. Okay, served. All right, gentlemen's objection is noted. We do have to vote the motion or the request for reconsideration now, the motion. If the motion succeeds, the bill will go back on the general calendar. All those in favor of the motion for reconsideration of this House's action on Senate Bill 156 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? What purpose does representative de-loat your eyes? Mr. Speaker, isn't it true that a number of members of this House feel like that the speaker of this House is eminently qualified to make this appointment? Well, I don't know how many think that. All right, have all members now voted? If so, the clerk will lock the machines on the motion for reconsideration. The eyes are 92. The nays are 76. This House has reconsidered its action and failing to give Senate Bill 156, the requisite constitutional majority. That bill will now go back on the general calendar. Clerk will read the caption to Senate Bill 236. Senate Bill 236 by Senator Brass of the 28th Jones, the 25th Miller, the 49th Robertson, the 29th. Beech of the 21st and others to be entitled to an act to amend Title III, the official to Georgia annotated related alcoholic beverages, so to allow food service establishments, license the cell distilled spirits for consumption on the premises to sell mixed drinks off for off premise consumption. This bill have been referred to the Committee on Regulated Industries. That committee recommends that this bill do pass. Chair recognizes representative Carpenter to present the bill. Thank you, Mr. Speaker. Senate Bill 236 seeks. Everyone in this chamber has seen the devastating effects the pandemic has had on the restaurant industry. In fact, upwards of 30% of restaurants will not come back after this pandemic is over. This bill seeks to give restaurants a tool in the toolbox to weather these tough economic times. Currently restaurants can sell beer and wine to go, and this bill seeks to add mixed drinks to that list. It gives rooms for locals to control it if they decide they don't want it. There are safety parameters around the amount of alcohol in each drink, the number of drinks for each entre, as well as where the alcohol must be stored in the vehicle while taking it home. Even when we are fully out of this pandemic, the eating behaviors of many Georgians have changed. In fact, I have seen takeouts increased 250% with no growth in sales. Moving forward, Georgians will eat out differently. This bill seeks to give our industry the flexibility to address those needs. Over 33 states have or will have legislation to address these concerns, and I want to add Georgia to that list, and I'll be glad to take any questions. You have a question if you care to yield. Chair recognizes or recognizes representative Jasmine Clark in the gallery to your left for a question. Thank you, Mr. Speaker. Does it, gentlemen, yield? Yes, ma'am. I just have a quick question about logistics. So when you get your drink from the restaurant, you have to store it in the trunk of the car. How do you prevent it from spilling? It's a big cup holders, and it's in a sealed container. But yeah, you can store it in your trunk. If you don't have a trunk, you have to store it behind the last seat of the car, or you can put it in a glove box. Does it, gentlemen, further yield? Yes, ma'am. And is this just to ensure that people are not drinking their mixed drink on the way home? Absolutely. This is the anti-roady bill. Yes, ma'am. Thank you. You have further questions if you care to yield. Yeah, I'll take one more. Chair recognizes representative Wolenski over in room 341. Here's the representative you. I do. How do I get at home on a motorcycle? I'd say you better find another vehicle to pick it up. There's nothing in this legislation to address that one. Thank you for this great bill that helps the restaurants, and also it's a safe way to have these mixed drinks come home. Thank you, representative. Thank you very much. And I will further say that I don't sell mixed drinks in my restaurant, so this is not a Casey Carpenter profiteering beer. I'll yield the well. Any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 236. The eyes are 120. The nays are 48. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 225. Senate Bill 225 by Senator Harveston, 15th red of the 33rd painting of the 54th. Dougan of the 30th Anderson of the 43rd, and others, the Italian Act to amend Article 3, Chapter 2, Title 40, the fiscal to Georgia and attended relating to prestige license plates and special plates for certain persons and vehicles. Shall this be provided for our veterans license plate? Let's bill them for the committee. I'm owed a vehicle, so the committee recommends the disbilled do pass by committee substitute. Chair recognizes Chairman Hitchens to present the bill. Like very much, Mr. Speaker, sometimes when you buy your time in a patient, things just seem to collapse into place. For those of you who don't know, today is Vietnam Veterans Day is declared by Congress and signed by the President. And I have a bill here today that deals with Vietnam veterans. It's a little bit unique because it doesn't affect veterans who served in the United States military. It affects veterans from allied countries who serve with us in Vietnam. We had five allies in Vietnam, Australia, New Zealand, the Philippines, Thailand, and South Korea. And particularly, as many of you know, there's a group that lives up in Wittenhut County. Most of them were here last year for a companion bill dressed up in their uniforms. And they contributed almost a half a million men and suffered 18,000 casualties in Vietnam war. They've invited me up there three or four times. I've made the five-hour trip up there to be with them. It received a lot of international coverage last year when we gave them Veterans Driver's License, including a lot of coverage in Korea. So I'm back today to ask that we do the same thing with regard to those people who served in the military of allied countries who have since immigrated to the United States have become naturalized U.S. citizens. From my perspective, and Representative Williams is going to speak here after me, it kind of reminiscent of King Henry V's and to play by Shakespeare, Henry V, Act 4, Scene 3, which was written about 1600, and talked about the Battle of Agent Court many years before, in which the British were greatly outnumbered by the French. King Henry, as if he was talking to his men before the Battle, was trying to motivate them because they had very negative thoughts about what the outcome was going to be. And what he said, there's quite a long speech, but those that become immortalized were, he said, we view, we happy few, we bend the brothers. For he today who's shed his blood with me, she'll be my brother. And that's the way I feel about these people, and I know Representative Williams is going to say the same thing. So if there are no questions, I ask for your favorite consideration. You do have a question if you care to yield. Certainly. Chair recognizes representative McClain in the gallery to your right for a question. Thank you, Mr. Speaker. Mr. General, you yield. This tag, it is only for the allies that are nationalized citizens of the U.S. That's correct. They have to have the equivalent form of the DD214 and the Koreans. It takes them about three months to get it, but we require that they put it in English now. DD214 and it itemizes their time in Vietnam, specifically for Vietnam combat veterans. And that's correct. They get a license plate. Thank you. Great bill. You have another question if you care to yield. Oh, you do. Chair recognizes representative Cannon to your left for a question. Thank you. Do you yield? How you yield? Senator of a master sergeant in the Vietnam War, I wanted to thank you for this bill and also just ask, what's the cost? I don't think there's any cost. The Vietnam veterans tag is already in place. And all they do is access one that those people in our country who served as veterans and haven't been to a war, already get these veterans license plates. I've got one that says, Vietnam, Marine Vietnam veteran, but those people who were in between wars can still get a veterans license plate and it just says veteran. No further questions? How you deal to will? Chair recognizes representative Al Williams to speak to the bill. Thank you. The speaker felt good to be able to sit everybody down. That was strong. Even the speaker sat down when I said, let me first thank. Representative Hitchens for bringing this bill. Of those five allies I served with three, the Army of South Vietnam, the Army of course of South Korea and briefly with the Australian troops. I'm so glad that after all of these years we're doing the right thing because when you think about it we lost 58,000 American soldiers. South Koreans lost 18,000 at that time, much smaller population than us. And there's one thing about serving with the South Koreans and serving with the White House, members of the White House division, military police. They did not feel like they were as bound to the Geneva Accords as we were. So if you really wanted some information, let the South Koreans do the interrogation and you would get the information you needed. They served lawyally. They served courageously. And I'm asking that those of us in agreement would vote yes for House Bill 225. On our Shemika, with that I yield the will, Mrs. Speaker. Gentlemen has yielded the will. Representative Williams, I hope you didn't take any disrespect in my sitting down. My feet were hurting. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The chair here is none. The report of the Committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed to vote no and the clerk will unlock the machines. That purpose is representative McLeod rise. Parliamentary inquiry. State your inquiry. Isn't it true that Brian Kim of Gwyneth County called and asked me to vote for this bill? Because he wanted me to know that he stands proudly with his community. If the lady so states, have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 225. The eyes are 173. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 59. Senate Bill 59 of Senator Albers, 56, painted the 54th mill of the 49th. The 51st of Stuntler, 52nd and others to be taught and act to amend. Chapter 2 and title 20, if you go to George Anatetti, relay an elementary and secondary education. So, I'm just going to provide for additional QBE funding for each full time equivalent student within a local charter school. This bill having further committee on education. That committee recommends this bill do pass by committee substitute. It recognizes Chairman Todd Jones to present the bill. Thank you, Mr. Speaker. Colleagues, for those of you in the education committee, you know that one of my key matras in education is to put the child at the center of every decision that we make. We have an opportunity here to continue to do that. Being able to provide more and more options for our children, I think really just enhances the educational opportunities here in the state of Georgia. I think it's incumbent upon us to be able to continue to fuel this type of opportunity and alternative for each of our schools. So, what does SB 59 do? First and foremost, this is helping public schools. It's helping public schools students and public school teachers. There's three key sections to the bill. The first one talks to basically bringing up the QBE base to each of the local charter school systems to be exact as the charter systems approved school. And that's 3.785, which is the equivalent of circa just a little over $100. The second key thing that this bill does, it provides an opportunity for the local charter to not just at the time of its charter, but also at the time of its renewal to opt into the state health benefit plan for its teachers. Clearly, we want to do everything we can for our public school teachers and we want to make sure that they have an opportunity to have that type of fringe benefit provided to them through the state. And then finally, the last thing that it does is for these students at the local charter schools, it provides the opportunity to ensure that they get their equal proportion of federal funding. For those of you who don't know much about local charter schools, I have just a couple of examples in case you're sitting there wondering what does a local charter school do. In APS, for instance, the APS school district, there's a locally approved charter school, for Charles Drew, that focuses in steam education. In Clayton County, there is utopian academy and it focuses on the performing arts. So you can see these are not necessarily always going to be redundant to the public school, but definitely complimentary to the public school offerings to ensure that each child and their unique requirements are addressed. I hope that each of you have had an opportunity to review the bill. Unless there's any questions, I ask for your favorable consideration on SB 59. You have a question if you care to yield. Yes sir, I'll yield for a question. Chair recognizes Chairman Martin to your left for a question. Jim and Yill. Yes sir. Just a quick question related to the section of the bill that allows the teachers to opt into TRS. I just wanted to make sure that does not have a fiscal impact and is not a bill that has to carry over to next year just wouldn't want the legislation to have an unintended effect. So I want to stress here, this isn't TRS, but rather the health benefit plan. Health benefit. I misunderstood. I thought to be in the health benefit plan, you were also putting them in the retirement. Thank you. My apologies. Mr. Speaker, there's no other questions. I will yield the well and ask my colleagues for them. Do you have another question? Actually, several if you care to yield. I'll take one more sir. Well, let's see. How about Chair recognizes the Speaker Pro Tem of the House to your right for a question? Thank you, just as General Maniel. Yes. Is it true that public school charter teachers, whether they're state authorized or locally authorized, currently participate in the state health benefit plan and always have, there just has occasionally been a question. This just clarifies what is the existing practice. You're absolutely correct. Mr. Speaker, with that, I will yield the well and ask my colleagues for their federal consideration. Thank you. General Maniel is yielding the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does Chairman Houston rise? Parliamentary inquiry. Is it not true in one of my counties that represent that the school board formed a charter school because not every child fits into a hospital situation. And is it not true we formed a charter school for potential dropouts and it has been very successful? I'm sure the lady, if she states that it is true. Thank you so much. Have all members voted? Have all members voted? So the clerk will lock the machines on the passage of Senate Bill 59. The eyes are 138. The nays are 31. This bill having received the requisite constitutional majority is therefore passed.\n\nHahah … Watson to the first. The total an act to amend Article 10 to Title 17. EFISH go to Georgia and say they're relating procedure for sentencing and imposition of punishment at this bill ever for the committee on judiciary non-civil. That committee recommends that this bill do pass. Chair recognizes representative Tyler Paul Smith to present the bill. Thank you, Mr. Speaker. Members of this August, by the good morning, I bring to you today Senate Bill 105. This bill will have a significant and impactful result to help thousands of Georgians actually get back to work in our state. Tell you a little bit about Senate Bill 105. It will provide a uniform pathway to early termination and probation for individuals who have proven their rehabilitation in our state. This important bill was a bipartisan effort that has the support of the Prosecuting Attorney's Council, the Georgia Association of Criminal Defense Lawyers, the Department of Community Supervision and the Council of Superior Court Judges, as well as many other advocacy groups. Specifically, Senate Bill 105 takes the three existing early termination pathways in Georgia law and provides a clarity and consistency to make them work for the courts, prosecutors, community supervision officers, and individuals on probation. Each pathway is based on the same criteria and is only available to individuals that have proven their rehabilitation by the following. Number one, by not committing any new offense other than a minor traffic offense. Number two, not having to even a technical revocation in the last 24 months and paying 100% of their restitution. This bill provides an incentive for those on probation to behave and pay their restitution they owe to make good their debt to society. Mr. Speaker, with that, I will yield a few questions if there are any. You do have some questions and you do yield? Yes, Mr. Speaker. Chair recognizes representative Mac Jackson to your right for a question. Thank you, Mr. Speaker. To the gentleman, well, do you yield? To my friend. Thank you for bringing this bill. One question I have in order for a person to request early termination, will he have the high and attorney to petition the courts or can he just sign a petition at the probation office? Or will it have to go back to court before the judge? Thank you for the question. Although some of the sliders in here would prefer that they do ask us, you could present your own pro-say motion if you wanted to do that as the defendant. You wouldn't necessarily have to have an attorney to do this. Chair recognizes representative Al Williams to your left for a question. Thank you, Mr. Speaker. The gentleman you yield. To my friend. Thank you for, Mr. Bill. I think it's very important. I do have one question. Is it not true that I'm a proud golagichi and I don't recognize your dialect? Is that Ludo Whistle? Yes. Yes. Yes. Yes. My friend is a little bit of West Georgia and East Alabama mix, we kept on hopping over the line. Do you further yield? I will, Mr. Speaker. Chair recognizes representative Scott in the gallery for a question. She waves. No further questions. Thank you, Mr. Speaker. Members of this body is the good lord taught us in his model prayer. Forgive us, our trespasses, as we forgive those who trespass against us. If you want us truly believing forgiveness, I ask your favorable consideration for this bill. That, Mr. Speaker, I yield the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote I. Those opposed to vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 105. The eyes are 169. The nays are two. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 198. Senate Bill 198 was sent in a heart for the seventh. Albers of the 56 and Roberts of the 29th. The Natal Nack to amend chapter 2 and title 35. The fiscal to Georgia annotated relating the Department of Public Safety so as to provide for subsistence and redeem allowances. This bill having further committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. Chair recognizes Chairman Lumsden to present the bill. Mr. Speaker, members of the House, I bring to you Senate Bill 198. This is a Department bill that comes as a request from the Commissioner of Public Safety. The bill moves the responsibility for certain per-demon payments, which are already present in law. It moves them from the board of Public Safety to the Commissioner of Public Safety. And it also removes an outdated schedule of payment for educational incentives. All of this, of course, is still subject to the appropriations process. That is the bill. And I would be glad to take any questions. I appreciate your question. No questions. Thank you. Appreciate your favorable consideration. Is there any objection to the previous question being ordered? The Chair here is not in the previous question. Is ordered? Is there any objection to agree to the report of the committee, which was favorable to the passage of the bill? The Chair here is not in the report of the committee. Is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 198. The eyes are 169, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 220. Senate Bill 220 by Senator Payne 54th, and a divarta. The 31st, Mulles of the 53rd, Summers of the 13th, Dougan of the 30th and others, the title of the act to amend our Actuitude Chapter 14, title 20. If it's going to George Anitator, we'll lay an educational accountability assessment programs. So, as we create the Georgia Commission on Civics Education, this bill I'm referring to the committee on education. The committee recommends that this bill do pass by rules committee substitute. Chair recognizes Representative Yeartou to present the bill. Thank you, Mr. Speaker. Today I bring to you Senate Bill 220, the original language of this bill has been taken out. And now is the same as House Bill 681, which we passed back in March the 8th. And this House passed this bill 169-2. It dealt, if you remember, with financial literacy. And it's a really great bill. The state, what it basically says is the State Board of Education, again, shall prescribe a program of study and financial literacy. And the goal behind this bill is to help students develop a basic understanding of financial concepts. A strong foundation and financial literacy can help with life goals, using debt responsibly, savings, retirement, or even running a business. They also learn basic skills like household budgeting and the value of compound interest. Today, as I said before, it's an estimated that four out of five US workers live paycheck to paycheck, and that's something we're trying to change with this bill. The skills learned in a financial literacy course were proved valuable to the rest of the students' lives. It will help them even bill well and make them hopefully less vulnerable to fraud. I worked with the Department of Education to make this flexible for our school system so they could work it through the framework of their existing coursework. And really, everybody, I talked to about this bill, like the bill. A lot of people said that they had taken this course when they were in school. And not a lot of schools offer it right now, so we're trying to change that. Some of the things that will be included again in this course will be balancing a check and account, money management spending, credit scores, the value of keeping a good credit rating, even post-secondary educational financial planning, basic principles of insurance policies, also simple interest contracts, types of savings, and other investments, even to touch on cryptocurrency, which I stated last time I was up there, I know nothing about. So maybe I can sit in on one of these classes, but it's a good bill. I think it will be very positive and very practical for our students to get this knowledge and just ask for your favor for consideration. Do you have several questions do you care to yield? Yes, sir. I'm glad to. Chair recognizes representative Benton to your left for a question. Thank you, Mr. Speaker, Jim and you. Yes, sir. Supported to your bill the first time it came through. Was there some reason that the Civic's legislation was taken out and not just included in with your bill? Well, it didn't get... It was taken out because basically mine was stripped out on their side. Okay. Do you further yield? Yes, sir. Chair recognizes representative Maynard up in the gallery for a question. Do you yield, sir? Yes, ma'am, I do. A quick question about logistics. It says State Board of Education will create it and the local school board will implement it. Right. Do they have time to implement it in this 2021 school year session? Well, the Department of Education didn't indicate that that would be an issue, so I'm kind of going by that. Do you further yield? I do, sir, for one more. Chair recognizes representative camp in the gallery to your right for a question. Thank you, Mr. Speaker. This question is coming from a person who served on a school board. We had an issue in our county where we had a very similar program, which was a great program, but the requirement was kind of a stranglehold to students who were dual enrolled their last two years of school. Oftentimes they'd have to come back to public school to take this one class, even though they'd already had microeconomics or macroeconomics in college. So my question is, is there an exemption or is there some kind of program to prevent students from having to come back to the high school for one class? Actually, like I said, I work through the framework of working with the Department of Education and the classes can be offered through existing classes framework, in other words, they may be able to take this course instead of economics or something like that or some other social studies. Do you further yield? Yes, sir, I will. Okay. Chair recognizes representative Gamble over in room 341 for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that COVID has created a situation where the original part of this bill, the Civic's renewal act, makes it hard for them to meet this year, but I'm in full support of this bill in the COVID, in the Civic's bill, and support financial literacy in our public schools? Yes, sir. Okay. Thank you. May I ask for your favour, consideration? Gentlemen, has yielded the well? Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is not in the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is not in the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is not in the report of the committee. Is agreed to. Shall this bill now pass all those in favour of the passage of the bill? Will vote aye, those opposed will vote no, and the clerk will unlock the machines? What purpose does representative Sharper arise? Paul Mayeron-Carrie. Structure inquiry. Is it true, Speaker, for the last eight years or so, that I've done a morning order encouraging us to do something about financial literacy and financial education? I believe that to be true. Is it further true that I am a financial planning specialist since 1992, and I think this will be a great thing for us to continue to work with and get people in a better shape. But also, I'm very involved with Bitcoin, cryptocurrency and stock. So let's make it happen, y'all. Come on. What purpose does representative Bentley rise? Paul Mayeron-Carrie. Structure inquiry. Mr. Speaker, is it not true that I'm very grateful to my seatmate for bringing this bill and thank him for his consideration of life insurance and any conversation about financial literacy because that is so very important for generational worth life insurance. Is that not true, Mr. Speaker? I think that is true and important to a certain industry, I think I know. So, but we won't go there. All right. If all members voted, if all members voted, if so, the clerk will lock the machine on the passage of Senate Bill 220. The eyes are 159. The nays are seven. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to Senate Bill 78. Senate Bill 260. Senate Bill 260 by Senator Harper. The seventh be titled, NACTO Men Code Section 2, 1280. The fiscal to Georgia and Tater are laying a promulgation and adoption of rules and regulations and sharing of information. So, it's exclude certain soil amendments from regulation. This bill then refer to the Committee on Act Culture and Consumer Affairs. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Dickey to present the bill. I commend Speaker. The South New United Ladies and Gentlemen, I bring you SB 260. If you recall last year, we passed House Bill 1057 out, created rules and regs for these soil amendments for agricultural products. And it was really done to put some new rules and regulations in this bill. We haven't done it since 1970. And it was a great bill. We have some bad actors that you might have heard by it in the past. And this 1057 sort of fixed that. But 260 this year, due to the COVID last year, didn't get around to quite finishing those rules and regulations. And that's what 260 does. It sets a buffer of 100 feet, which is the most largest buffer there is in the state right now. And it requires a nutrient management plan from these companies to have before they apply this to the land. It's no more, this is liquid. It's no more than 4% solids. And it's injected into the soil. They've purchased these large machines that actually put several inches into the ground to cut down on any other odor. So and also this bill is another bill we have to collect fees so we can hire these people with Department of Ag or Grimements and inspect to check behind what is going on. So this bill is immensely important to the poultry industry in our state. And I just asked your consideration on SB 260 that finishes the drill of lending these of regulating soil amendments. And I'll stay in for any questions, Mr. Speaker, if I have any. Chair recognizes representative O'Rickia to your left for a question. Thank you, Mr. Speaker. Is it Chairman You? I do. Mr. Chairman, is it not true that we talk a lot up here about balance in trying to strike that balance? And that if you want to strike that balance, this is a perfect example of that with the Department of Agriculture, the poultry industry, individual property owners and communities to make sure that everyone was considered as these two committees work together on this bill. Thank you for that question. It is true. I add committee worked hard on this bill to get it right and as well as opening up Senate. So thank you. Thank you. I'll take one more for Zeni, Mr. Chair recognizes chairman Jasper's to your right for a question. Thank you, Mr. Speaker. Mr. Gillman Yeal, I do. Is it not true that in line 29, we're talking about the 100-foot buffer that this is the widest buffer in code and it isn't should be limited and done by science, which backs up that 100-foot buffer. Absolutely. And thank you for that. Mr. Gillman, further Yeal, I do. In line 30, we talk about nutrient management plans and they're described and I describe as the foundation of good environmental agriculture. And these farming practices are went over with farmers and by law and by county extension agents and consultants to make sure this is done right in very environmental way. Thank you, Chairman Jasper's and then you're also right that our county extension agents are very, very well equipped to do this and I'm just thankful for those that we have in every county in our state and this working with our Department of Ag, EPD and I have an extension. So thank you for this. I ask your favor consideration. I'll yield the oil. Gentlemen, as Yeal did the well, Chair recognizes Representative Mary Francis Williams to speak to the bill. Thank you, Mr. Speaker. This is one of those bills that I truly have trouble understanding how it happens and I have great respect for some of the people who have just spoken, I mean for Chairman Dickie and people who have asked questions but I'm hearing a very different story from people who live around some of these farms that have been treated with these products. So these soil amendments are supposed to be liquid and they are supposed to, they're helpful because they contain nitrogen but in truth sometimes they control, they also have poultry byproducts including hatchery waste and awful. Inspectors have found eggshells, chicken carcasses in the material that is labeled a beneficial product for soil, not a waste stream. So this is a preemption bill which means that local governments would not have the ability to establish setbacks to protect neighbors from the odor, runoff flies and 100 dollar, I mean 100 foot barrier. I'm told is 100 feet, I'm not good at judging distances but I'm told it's 6 to 8 car lengths. So that's not a very big distance and perhaps this is beneficial to soil although I'm told some farmers are paid to take these products. When it's not a liquid and it does contain these byproducts the smell is awful. It's been a problem in people have really complained bitterly in Oglethorpe County, Wilkes County and Elbert County. There is one woman who talked about not being able to go outside her house without literally vomiting. So I just would like for you to all ask how you would feel about having this kind of smell 6 to 8 car lengths from your front door and I don't think you'd like it. And once again we are stopping local governments from having any control over that and I don't get that either. Well I mean I get it. I'm just really shocked that this is moving forward and I hope that you will know against it. I think that we're not listening to people who live near these farms that have been treated, these farms that have been treated with this product and I'm not making up a bit about chicken carcasses, broken eggshells, chicken excrement. It's been found. So please think about your neighbors and how you would feel if you had to live next to something with this level of stench. Thank you. I yield the well. Chair recognizes representative Mitchell to speak to the bill. Thank you Mr. Speaker. Today I rise in opposition to SP 260. I stand before you because this bill is ultimately a decision point on whether municipalities have the ability to determine setbacks for soil amendment application. I asked in committee whether currently any municipality or county had a setback bigger than 100 feet and I was told that there was one single setback bigger than 100 feet presently. And I want to say I certainly appreciate the amendments made to the spill in the house to add the new tree management plan requirements for soil amendments. That is an improvement. I think it's important to know a little bit about why I am one of the people standing before you today. I'm a legislator from a suburban county but I'm also someone who drove a tractor almost 10 years before I drove a car. I understand that fertilizer, potentially soil amendments, is an integral part of productive agriculture. I do not in general oppose farms being able to control their own land within their own boundaries. Moving to a home next to a farm brings with it an expectation of exposure to normal farm smells. However, soil amendment application from processing waste is not necessarily part of that bargain. I received multiple emails telling me what soil amendments were like in people's own communities asking for local control to make decisions about them. So I took a trip to one of these communities last week. After watching a gathering of vultures waiting across the street from a field that threw the road surrounding the field to see whether the concern was valid. Indeed in my exposure it was. I do think anyone would be hard pressed to live next to fields spread with this particular soil amendment. I think we have a responsibility to Jordan's to build this legislation better. We should continue to develop it to make sure that we're actually responding to situations that are on the ground and we should trust our local agricultural communities to make responsible choices for their residents. Thank you and I yield the well. Chair recognizes Chairman Dickie for the Chairman's time. Thank you, Mr. Speaker. I just want to make sure you know what is of a soil amendment and what's not. And as I said, this is liquid. It's injected into the thing and we have had some bad actors in the past that have been shut down by the Department of Ag and the EPD. And this bill just goes to soil amendments. And I think it's set a great balance as Chairman Jasper's and I'll talk about the soil management plan, nutrient management plan. I think this bill will help our poultry industry that's vital to this state by largest agriculture industry in this state. So I ask you to devote green on this bill and let's move forward with these regulations and make Georgia a great state to have agriculture. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The Chair here is not in the previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is not. The Committee substitute is adopted. Is there any objection to agreeing to the report?\n\nof the committee which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Scott rise? She waves. What purpose does representative Buckner rise? Parliamentary inquiry. Isn't it true that I have never knowingly voted for a preemption bill because I believe most locals can smell the stench and generally handle it without our meddling? The lady so states what purpose does chairman Watson rise? Parliamentary inquiry. Mr. Speaker is it not true that the cost of commercial fertilizer has recently almost doubled and alternate nutrient components that can be used to grow crops in our state are definitely needed and we definitely need this bill. If the gentleman so states what purpose does representative Mayner rise? Speaker please forgive me what is the number when you want to be excused can I be excused from the bill? 133. 133 I'd like to be excused. Lady has that right and the journal will so reflect. What purpose does representative LaRickia rise? Parliamentary inquiry. State your inquiry. Isn't not true Mr. Speaker that this bill is sole amendments only and has nothing to do with dead carcasses, lagoons or eggshells? If the gentleman so states I'm sure he believes intensely that that is true. What purpose does representative Ridley rise? Parliamentary inquiry. Is it not true that state law usually on gives 25 to 50 feet buffers and this is actually doubling or quadrupling that law? The gentleman so states I know he believes that to be true. What purpose does representative cannon rise? Parliamentary inquiry. Is it not true that there's concern from the healthcare community that this will negatively impact pregnant people because of the stench in the nasal passages? If the lady so states I'm sure she believes that to be true. What purpose does representative meek rise? Parliamentary inquiry. State your inquiry. Isn't that true that Department of Agriculture has taken action against some of the bad actors with some pretty severe actions? I believe that to be true. All right let's go ahead. We've had several parliamentary inquiries. Have all members voted? Have all members voted? If so the clerk will lock the machines on the passage of Senate Bill 260. The eyes are 87. The nays are 75. This bill having failed to receive the requisite constitutional majority has therefore failed. What purpose does chairman Dickey rise? Parliamentary inquiry. No excuse me. Make a motion. State your motion. Reconciteration for this bill 260. Chairman Dickey has moved for reconsideration. That will be voted on immediately. All those in favor of the gentleman's motion that this house reconsider its action in failing to give Senate Bill 260. The requisite majority will vote aye. Those opposed to reconsideration will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machine on the gentleman's motion for reconsideration. The eyes are 92. The nays are 68. This house has reconsidered its action in failing to give Senate Bill 260. The requisite constitutional majority will now go back on to the general calendar. What purpose does representative Williamson rise? Make a motion. State your motion. I move that we recommit Senate Bill 201 to the rules committee. Clerk will read the caption. Senate Bill 201 by Senator Hustler of the 52nd to be taught an act to amend Article 2 of Article 48 of the fiscal of Georgia. Senator relating the administration of the revenue and taxation. On the gentleman's motion that Senate Bill 201 be recommitted to the rules committee, is there objection? Is there objection? Chair, here's none and it is so ordered. What purpose does the majority caucus whip representative Kelly rise? Make a motion, Mr. Speaker. State your motion. I move that House Bill 639 be moved from the judiciary committee to the special committee on access to the civil justice system, both chairs and agreement. Clerk will read the caption. House Bill 639 to be taught an act to amend. On the title 51 of the fiscal of Georgia, Senator relating the Torx system to provide transparency with respect to asbestos trust claims and claims made in the civil asbestos actions. On the gentleman's motion that House Bill 639 be transferred from the judiciary committee to the special committee on access to the civil justice system, is there objection? Is there objection? Chair, here's none and it is so ordered. What purpose does representative air heart rise? To make a motion. State your motion. I move that HB826 be moved from intergovernmental coordination committee to the government affairs committee. Clerk will read the caption. House Bill 826 to be entitled an act to incorporate the city of lost mountain. On the ladies' motion, at House Bill 826 be transferred from the intergovernmental coordination committee to the government affairs committee. Is there objection? Is there objection? The chair, here's none and it is so ordered. The purpose is the chairman of the House Ways and Means Committee rise. All right, we'll come back to him. What chair recognizes representative Gaines for a motion? Mr. Speaker, I move that the House agree to the Senate substitute to House Bill 146. Clerk will read the caption. House Bill 146 by Representative Gaines, 117th Cooper, 43rd Jones, 47th, Vita Lannak, 2nd Mandatical, 1th Chapter 20, 45th. If it's going to Georgia and Tater, the general provisions regarding personnel administration should survive for a paid parental leave for eligible state employees. Chair recognizes representative Gaines to explain his motion. Thank you, Mr. Speaker. House Bill 146, the Senate made some changes that we worked together on at passing anonymously in the Senate. Mr. Speaker, I want to thank you for your leadership on this. Also I want to thank the members of this body for passing it overwhelmingly 155 to 2 and so many folks have come together to make this happen from Ivanka Trump to everybody in this room. So Mr. Speaker, I yield the well and ask for the body's favourable consideration. On the gentleman's motion that House Bill 146, that we agree to the Senate substitute to House Bill 146. All those in favour will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? Have all members now voted? If so, the clerk will lock the machine. On the gentleman's motion that this House agree to the Senate substitute to House Bill 146, the eyes are 153. The nays are 8 and this House is agreed to the Senate substitute and we now have passage of a paper rental leave act law in Georgia. Chair recognizes now the chairman of the House Ways and Means Committee, Chairman Blackman. Thank you Mr. Speaker. I move that we insist on the House substitute to Senate Bill 6. Clerk will read the caption. Senate Bill 6, my Senator Halberst, 56, was the 52nd and others to be entitled to amend Article 3, Chapter 5, and Title 28 of the Fish Goat of Georgia and it's stated relating to fiscal builds generally so as to provide for independent economic analysis to be procured by the office of planning and budget. Chair recognizes Chairman Blackman to explain his motion. Just feel like, sir, that some of the discussions that we can iron out in conference would be beneficial to our measure on this bill, sir. Answer any questions if there are any. You have no questions. Thank you. I ask for this body's favorable consideration. Chairman Blackman has moved that this House insists on its position on Senate Bill 6. Is there objection? Is there objection? The chair here is none and this House has insisted on its position on Senate Bill 6. All right, I'm going to remind all of you who have tablets to please return those to the clerk's office when we recess for lunch so they can be recharged. Do not forget that. Chair recognizes the chairman of the minority caucus, Chairman Mitchell, for an announcement. Thank you, Mr. Speaker. There will be a Democratic caucus meeting today. We're going to do that in about maybe 20 minutes. Their lunch will be served. You can pick that up in room 216 here in the Capitol. Thank you, Mr. Speaker. First to be the only announcement we have, this House will be in recess for lunch until 2 p.m. 2 p.m.",
  "updated_at": "2026-02-14T00:00:42.511492+00:00"
}