{
  "video_id": "JnHRDc7zItU",
  "url": "https://www.youtube.com/watch?v=JnHRDc7zItU",
  "title": "12/21/23 Joint Study Committee on Service Delivery Strategies",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "## Overview\n\nThis transcript appears to be from a joint study committee meeting on service delivery strategies in Georgia, with minimal substantive legislative activity. The key focus was on approving a list of seven recommendations, which was described as a framework for future legislation rather than legislation itself.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee members discussed establishing a quorum and technical difficulties with one member joining the virtual meeting.\n- The committee chair thanked the staff for their work in preparing the list of recommendations.\n- The committee adopted the list of seven recommendations unanimously.\n- The committee chair wished everyone a Merry Christmas at the end of the meeting.\n\n## Votes\nThe committee voted unanimously to adopt the list of seven recommendations.\n\n## Attendance\nThe committee had a quorum of at least five members, including the two co-chairs.\n\n## Adjournment\nThe meeting was adjourned after the vote on the recommendations. The next session date was not specified.",
  "transcript": "So, I understand that.\nI'\nYou hear me?\nhow many of our members are old?\nI think we need six for a quorum, and apparently we have five at the moment, but uh...\nYeah, we have five, including the two chairman.\nYeah, and Derek Norton is having technical difficulties in trying to log in now.\nI just wanted to have a link, so hopefully it should be on shortly.\nYeah, so we should have a quorum any minute now.\nUm, while we're waiting on him, um, do we need a quorum to open the meeting?\nWe, on the house side, we do not.\nOkay.\nWe go to the center side to go ahead and not have yourself at it.\nSaid the, uh, we, we, we can't vote on anything till we have a quorum.\nRight.\nWell, I'll just share him again. If it's good with you, just go ahead and welcome everybody\nand call the meeting to order. And I want to thank the committee members for getting\nback together again for this list last time. And I want to thank ACCG and GMA for working\ntogether to get us this list of recommendations that we can vote on today.\nAnd I want to point out that this list is not legislation.\nIt's just simply a list of seven recommendations that the committee will hopefully approve today.\nIt gives us a framework to begin legislation.\nThis for anything becomes law has to go through the entire legislative process.\nThere's still a long way to go.\nSo what you're again and I have decided to do what we'd like to do is.\nConsider we have a forum.\nJust take a quick, you know, vote on this list and totality and.\nAnd just understand that there's there's going to need to be more discussion and we move forward, but we're up against a deadline.\nWe need to check in the Norden joins you guys are good\nOkay, great. All right welcome there at Norton Mayor Norton. Appreciate you doing it. Sorry\nLate I had a little bit of technical difficulty probably user error\nYou're good\nSo you make our quorum and we've opened the meeting caught up to order and\nHope everybody's had a chance to look at the seven recommendations\nAnd I was\ncopy of that. We can confirm all the members got a copy.\nYes, sir.\nI know I got a copy. Anybody else?\nYeah, I got a copy.\nYeah, I got a copy off the job.\nThank you, given Prince.\nI like him. He's driving while he's doing this. Good job. Good job.\nChair reprints. Only for the team. Only for the team.\nWe have.\nAs chairman, I don't know from the chair, from the co-chair, if I can make a motion, but you know,\nwe can beat the horse or move on and get the committee's report submitted. I'd like to move\nthat we adopt the report has written. I think I want to thank our staff for the great job they've\ndone and prepared and everything.\nJohn, you got a motion in a second. We have a motion in a second and any quick discussion\nbefore we vote. All right. This is Mayor. This is Mayor Ward just just to make\nsure we put on the record with regards to ACGA 367020. You know the intent of\nthis SDS article has stated in the statute is to make sure that this remains\nflexible and consistent with what the cities and counties are looking for. I'm\nI'm very encouraged with everything we've done.\nI think this final report books appropriate\nand has some flexibility built into it for those reasons.\nSo it has my full support in being adopted.\nThank you, Mayor Ward.\nAppreciate that.\nAll right, well, there's no other discussion.\nAll in favor, if you'll just say hi.\nHi.\nHi.\nHi.\nAll right, looks like it carries who our staff was that clear enough, you know, to go on record.\nLook great to me.\nYes, works for the house.\nAll right. Very good. Well, everybody, I want to thank you again for all the hard work that's going into it.\nagain it's been a pleasure serving with you, co-chairing with you and look forward to some meaningful\nlegislation coming out of this. It's good for county cities and people of Georgia.\nSince I just had a nice Mexican lunch today I want to wish everybody\nFeliz Navidad.\nMerry Christmas.\nChris, but you have a, I'll thank you for that.\nYou have a dot coat with that center again.\nI did two of them.\nAll right, everybody, Merry Christmas,\nand that's all the business we have today.\nI'm glad this could be short and sweet.\nThe best call I ever had this week.\nThank you.\nAll right.\nSee you in the new year.\nThank you, Chamber.\nBye-bye.\nBye.\nYou\n",
  "updated_at": "2026-02-12T01:32:01.590061+00:00"
}