{
  "video_id": "jPOO3BgtSn4",
  "url": "https://www.youtube.com/watch?v=jPOO3BgtSn4",
  "title": "Georgia House 2026 - Day 8 AM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": null,
  "duration_minutes": 89,
  "summary": "Overview:\n- This session focused on procedural matters, with no notable legislation discussed. The session began with a prayer and Pledge of Allegiance, followed by introductions and routine business.\n\nKey Actions:\n- No bills passed or referred.\n\nBills Introduced (First Reading):\n- No new bills introduced.\n\nNotable Moments:\n- Prayer delivered by Pastor George Dillard, who spoke about the importance of focusing on essentials and not getting bogged down by unnecessary burdens.\n- Introduction of the House doctor of the day, Dr. John Pittman.\n\nVotes:\n- No recorded votes.\n\nAttendance:\n- Quorum present, with all members voting to signify their attendance.\n\nAdjournment:\n- No specific adjournment time noted, but the session appears to have continued after the events summarized.",
  "transcript": "I work in meeting, having arrived, all members please come to the floor and be prepared to take your seats.\nAll members, please come to the floor, Mr. Clerk, while you ring the bell.\nWe're going to have the morning roll call for all members if you get close to your desk.\nAll members present will please vote green to signify their presence in the chamber.\nMr. Clerk, will you unlock the machines?\nAll members voted.\nAll members voted.\nNow we're good.\nis voted if so to clerk where you lock the machines.\nThe doorkeepers, if you're pleased,\nclose the doors and keep them closed.\nAs is our custom, we will begin our day\nwith scripture reading and prayer by our chaplain,\nafter which we will pledge allegiance to the flag\nof our country.\nOur chaplain this morning could be a familiar face\nto many of us in this room.\nHe's an old friend from down home\nwho's moved up to Chairman Bonner's district,\ndoing a great job over there at his church.\nBut I'll let Chairman Bonner do the honor\nof introducing our chapter to the day.\nOur chapter will be introduced by the gentleman\nfrom the 73rd House District,\nChairman Josh Bonner.\nChairman Bonner.\nThank you Mr. Speaker. Good morning colleagues. It really is an honor to introduce our\nchaplain of the day. Dr. George Dillard has been the senior pastor at\nPeachtree City Christian Church for over 30 years. The mission of the church is to\nbuild relationships, introduce people to Jesus and grow disciples. And Pastor\nDillard has done that leading out through investing in our local community and\nand missions abroad.\nGeorge has been a good friend to me\nand so many folks in our community.\nHe always brings an insightful word\nand is certainly no stranger to this chamber.\nSo at this time, I'd like to introduce\nPastor George Dillard.\nThanks for being here, David.\nGood morning.\nIn 1978, I was asked by a number of my friends\ncollege to take a five-day backpacking trip on the Appalachian Trail. Now I thought\nthat would be just one of the best things I've ever done. Never done it before but\nI was looking forward to it. I showed up at the site where we were to begin with\nthe backpack with every conceivable utility and piece of equipment that you can imagine.\nI mean, literally, I had enough stuff to build a frontier village.\nAnd I noticed when I walked up, all of the other guys that were going on this journey kind\na smirk, a little bit kind of grand whisper to each other. I thought probably there in\npress with what I'm bringing. About three miles in, I figured out, you know what? I'd\nrather die than carry some of this stuff. I started unloading the backpack. I promise\nShe there probably pots and pans from 1978 still up air around cleanman's domes.\nBy the time I got down after five days of backpacking I had a sleeping bag, one pan, and\ncouple of pairs of dry socks. I learned a very valuable lesson. Number one is if you're\ngoing to get anything done, if you're really going to accomplish something, if you're\nreally going to bake the journey, there's a bunch of things that you need to let go of.\nall the stuff the world tells you that you need, you don't need.\nIn fact, Jesus said everything that God ever said is built on this foundation.\nLove God, love people.\nAnd then everything else is just trying to figure that out.\nalso learn that your friends know all the junk that you're carrying that you don't need\nto carry. But they're probably not going to tell you that you're carrying it unless you\nask them. You know, the Apostle Paul said, help one another with the burdens, thus fulfill\nthe law of Christ. We need to be sure that we understand, especially in this room, that\nour part of our function is to work together for the good of all Georgians, that we should\nhelp one another not only carry the load, but also figure out some of the stuff that\nmaybe you need to let go of, because everything that you're holding on to is not valuable or needed.\nYou'll kind of remind me of David getting ready to go fight God's life.\nAnd King Saul loaded him down with this armor.\nNow, I always tell people, don't let the Bible just be words on the page.\nYou got to dig in a little bit.\nAnd the description of Saul was that he was a head taller than everybody in Israel.\nSo guess what, Paul, Saul knew that that armor was not going to fit David.\nSo why did he load him down with it?\nI think he was trying to convince him not to go out and fight Goliath.\nNow why did he not want him to go fight Goliath?\nknow why, because he was the king, he was supposed to be out there doing it. He couldn't\nfind the courage to do it, and so instead of encouraging somebody else to do it, he\ntried to load him down with too much junk to try to talk him out of it. David had enough\nsense and enough courage to say, I don't need this. And he picked up five stones and did\nimpossible. So I want to encourage you as representatives of the people of the\nstate of Georgia to be willing to let go of the stuff that doesn't matter, that\nshe don't need, to be able to be willing to help one another regardless of where\nyou come from or how you got here. And number three, and most importantly, don't let anybody\ntalk you out of the fight. Because you're here for a reason. And the fight should be to\nmake life better for every Georgian. Would you join me in a word prayer?\nFather, give us strength this day. Give us courage. Give us wisdom. Give us\ndiscernment. I pray for the members of this house that you would bless them so\nthat they might bless others, that you would give them a spirit of cooperation, unity and peace,\nthat what they do here might improve the lives of every Georgian, that it might help us\nto be able to live freely and with peace and community in this state.\nFather, thank you for the leadership, thank you for the strength that you've given them,\nbless them, bless their families, bless this state.\nWe give thanks for all the blessings that we have, most of all, for your Son Jesus and\nit's in His name that we pray, amen.\npledge allegiance to the flag of the United States of America and to the Republic for which\nit stands. One nation under God, indivisible, with liberty and justice for all.\nThank you for those words of wisdom and this group is certainly always working for the\nthe best of people of Georgia, so thank you.\nMembers, you may greet Brother Dillard in the south any room.\nThank you for his service today.\nWe do have a doctor of the day.\nIf you need his services today, he's brought to us\nby cheerleading Katie Dempsey from up in Rome\nIn Floyd County, we appreciate Dr. John Pittman being here to serve us.\nThank you, Dr. Pittman.\nWe appreciate you being here in your service to the members of the General Assembly.\nChairman Hilton, the chair of the Committee on Information Audits is recognized.\nGood morning, Speaker.\nYour Committee on Information Audits has read the journal the previous legislative day,\nAnd we have found it to be correct.\nChairman Hilton, the chair of the Committee on Information and Audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nHearing none, the reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nvery none the journal is confirmed.\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative Aestration of the 104th Moose following me establishes the order of business under first part of the period unanimous consent.\nIntroduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions.\norders. Is there any objection to the adoption of the resolution establishing the order of business for the day?\nHere he none the resolution is adopted.\nYou folks have been busy, we have a lot of first readers today.\nFirst reading the bills and resolutions, Mr. Clerk, will you read?\nHouse Bill 1015.\nMayor Ripsett of work.\nHighs of the 157.\nThe Bill B.\nTodd Lacto.\nAmendment Article 10 of Chapter 9.\nA title 34.\nThe official go to Georgia.\nAnnotated.\nRelating the self insurers.\nGuaranteed trust fund.\nIndustry and labor.\nHouse Bill 1016.\nMayor Ripsett of Kendrick.\nIn the 95th and Florida.\nIn the 74th.\nThe Bill B.\nTodd Lacto.\nAmendment Article 1 of Chapter 10.\nA title 15.\nArticle 2.\nChapter 7.\nA title 16.\nIn Article 2.\nChapter 11.\nA title 44.\nThe official go to Georgia.\npositions relative to magistrate courts.\nYou do share House bill 1017 by\nRepresentative Kendrick of the 95th\nEvans of the 57th the Clark of the 108th\nwill be titled an act to amend chapter 3\nto title 44 in chapter 5\nof title 48 of the official code of\nGeorgia annotated related to regulations\nspecialized land transactions.\nWays and means House bill 1018 by\nRepresentative Kendrick of the 95th\nWilks 38th Evans the 57th\nFriday the 120 second, Lewis Ward of the 115th and others.\nBill B. Todd will act to amend Code Section 488-3.\nThe Fitch go to Georgia annotated,\nrelating exemptions from sales and use taxes.\nWays and means.\nBill 1019 by Representative Barnes of the 86th,\nglazed the 67th, Alexander the 66th.\nYou believe the 141st clerk will 108th and others.\nThe Bill B. Todd will act to amend chapter 7\nand title 44 of the Fitch go to Georgia annotated,\nrelating the landlord and tenant.\nJudiciary, House Bill 1020 by reps and it reaves the 99th\nfrustration 104th Gunner of the 8th, Kelly of the 16th, Smith of the 18th and others,\nBill B. Todd on active men chapter 23, a total 47 of the physical to Georgia and\nit's headed relating to the Georgia Judicial Retirement System.\nRetirement.\nHouse Bill 1021 by reps and a McDonald of the 26th lever to the 123rd, guller to the 19th\nOliver, the 84th Heavens, the 57th and others.\nBill B. Toddl, an act to amend Code Section 15, 21A, five.\nThe Fist Dakota, Georgia, Annotated Relignant.\nRetention of funds by authority.\nJudiciary.\nHouse will attend 22 by reps and a McDonald,\nthe 26th Corbeter, the 174th.\nHitchens on 61st, lumps into the 12th Crow,\nthe 118th and others.\nBill B. Toddl, an act to amend,\ntotal 40 the Fishercota Georgia annotated relating to motor vehicles and traffic motor vehicles house bill 1023 by reps and\nInvestigation of the 104th Burns the 150 ninth or one of the 32nd hatch into the 150th person here the 119th and others\nIt'll be titled an act to men article 27 in chapter two a title 20 of the Fishercota Georgia annotated relating a\nLoydering at or disrupting schools\nEducation\nHouse Bill 1024 by reps at a pong of a hundred and third reaves to the 99th and lever to the hundred and twenty-third\nBill B. Todd on act to amend code section 44 13\n100 of the fish go to Georgia annotated relating exemptions for purposes of bankruptcy\nJudiciary House Bill 1025 by reps and Davis the 87s go feel the 63rd Scott of the 76th\nBill B. Todd on act to amend article 5 of chapter 11 and title 15 of the fish go to Georgia annotated relaying the child in need of service\nJudiciary Juvenile House Bill 1026 by ribs of Sharper the 177th Corb of the 174th will\nhood to the 175th and birch head of the 176th Bill B. Todd will act to revive for the compensation\nof the city of Valdosta Board of Education.\nIntergovernmental coordination House Bill 1027 by reps and of Anderson to the 10th year\nto the 150 second Williams into the 112th Williams the 148th Campbell the 15th and others\nBill B. Toddled active in chapter one and 30 of title 36 of the fish go to\nGeorgia annotated relaying the general provisions applicable to counties.\nGovernor Mennel affairs House will 1028 by Representative Reeves and 99th\nAssociation of 104th Gunner D8 Kelly the 16th Smith of the 18th\nothers. Bill B. Toddled active and article on chapter 18 in title 15 of the\nfish go to Georgia annotated relating the general provisions regarding\nprosecuting attorneys.\nJune 1029 by Representative Thomas of the 21st Ridley, the 22nd Jones, the 47th.\nJasper, the 11th Parsons, the 44th and others will be taught on an act to amend the act\ncreating a new chart for the City of Holley Springs.\ntheir governmental coordination.\nHouse Bill 1030 by rest of Donna Tucci of the 105th\nIrwin of the 32nd Jones of the 47th.\nDubnick of the 29th, Hilton of the 48th and others.\nThey'll be titled back to men's chapter two,\na total 20 of the fish go to Georgia,\nannotated relating to elementary and secondary education.\n10-30.\nEducation.\nHouse Bill 10-31 by Gremson of Holly the 116th,\nMcQueen of the 61st, Bill of the 75th,\nBarnes of the 86th, Baker of the 64th, and others.\nBill B. Todd of the Active Men,\nArticle 1 of Chapter 7 of Title 44,\nthe official go to Georgia,\nand it ended relating to landlord and tenant.\nDid you do, Sherry?\nHouse Bill 10-32 by Gremson of Scott of the 76th,\nGofield of the 63rd, Davis of the 87th,\nfor now the 77th,\nBill B. Toddl, an active men article 60, chapter 2,\nthe title 20 of the E. Fischko,\nto Georgia annotated the Quality Basic Education Act.\nEducation.\nHouse Bill 1033,\nby reps of Scott of the 76 Davis of the 87th Scofield,\nthe 63rd and for now the 77th,\nBill B. Toddl, an active men chapter 24,\ntitle 33 of the E. Fischko,\nGeorgia annotated relating to insurance generally.\nInsurance.\nHouse Bill 1034 by reps of Scott of the 77th,\n96 go field is 63rd and Davis to the 87th.\nBill B. Toddl and act to amend chapter one of titles seven of the official code of Georgia and it's had a related to financial institutions.\nBikes and banking House Bill 1035 on reps of Scott of the 76 Davis to the 87th scope field is 63rd green in the 154th Taylor the 92nd and others.\nBill B. Toddl and act to amend titles 36 44 46 and 48 of the official code of Georgia and it's had a related to local government.\nWays and means.\nHouseful 10-36 by revenue.\nScott of the 76.\nGofield of 63rd Davis of the 87th.\nTaylor of the 92nd Baker of the 64th and others.\nBill B. Tato, an act to amend chapter three.\nA title 44 of the official go to Georgia and it's\nany related regulation specialized land transactions.\nJudiciary.\nHouseful 10-37 by reps of Cummings of the 39th.\nAdesana of the 43rd Parsons of the 44th.\nCampbell of the 35th and Seaball of the 34th.\nwill be taught an act to amend and not creating the state court of Cobb County.\nThe intergovernmental court decision.\nHouse Bill 1038 by Ripsett have griffened to the 149, hugely the 141st.\nMiller to the 62nd, Davis to the 87th Perry, the 56th and others.\nBill be taught an act to amend Title 20 of the EFISCO to Georgia and attended relating to education.\nEducation House bill 1039 or instead of Davis to the 87th Scott of the 76 and scope field is 63rd\nBill B. Todd will act to amend chapter 34 title 50 of the fish go to Georgia and it's a\nRelating to the one Georgia authority\nEconomic development in tourism House bill 1040 by reps of aisle the 50th Buckner the 137 with green to the 154th\nBarnes to the 86, base more of the 69th.\nBill B. Todd Electo, men, chapter 12 A,\na title 31 of the official go to Georgia,\nannotator relating to smoke-free air.\nPublic and community health.\nHouse will attend 41 by represent of Scott of the 76 Davis,\n87th's Go Field of 63rd.\nBill B. Todd Electo, men, article 11 of chapter 11 of\ntitle 15 of the official go to Georgia,\nannotator relating to general provisions relative\nthe juvenile code. Judiciary Juvenile. House Bill 1042 by\nreps and a briefs of the 99th Gunner of the 8th 18th Evans the 57th Crawford\nthe 89th and others will be titled an act of men titles 915 and 23 the\nFisher go to Georgia and it's ended related to civil practice courts and\nequity. Judiciary House Bill 1043 by reps and of Scott of the 76 go\nfield the 63rd Davis to the 87th,\nbased more of the 69th,\nAlex and to the 66th and others.\nAbility, Toddl, an active men,\nart three, chapter five,\na total 16 of the fish go to\nGeorgia and it's ended relating to\nkid napping.\nJudiciary juvenile House bill 1044 by\nresident Roberts, the 52nd park of\nthe 100th and 7th Crawford,\nthe 89th Miller, the 62nd Evans,\nthe 57th and others Ability,\nToddl to act to amend chapter one\nof the 501 of the Fisher Golds,\nJojo Annotated Relay,\nand the General Provisions regarding torts.\nDo you do, Sherry?\nHouse Bill 1045,\na repressive herring of the 145th RICE to the 139th,\nuniquely the 141st of Lallie, 59th.\nBaller of the 147th and others,\nwill be taught in Active Men Part III of Article 16\nof chapter two, title 20,\nof the Fisher Golds,\nand Jojo Annotated Relay,\nand the Student Health and Elementary and Secondary Education.\nEducation.\nHouse Bill 1046 by representant Frey,\nto the 120 second, Roberts to the 52nd,\nGisley to the 121st, Sanchez to the 42nd,\nBell of the 75th and others,\nBill B. Todd on active and title 14\nin the physical to Georgia and attended,\nrelating to corporations, partnerships, and associations.\nJudiciary.\nHouse Bill 1047, by reps of the Washburn of the 144th,\nDickey the 134th, Carpenter of the 4th,\nPrince of the 130th and Friday,\nthe 120th and others,\nBill B. Todd on active men,\nfour chapter eight and total 48 of the Fisher go to Georgia and it did it\nrelating to water and sewer projects and cost tax ways and mean.\nHouse 48 by Ripson of Hilton of the 48th frustration 104 Jones the 47th\ndown to 2G the 105th reads the 99th and others will be titled an act to amend\nArticle 6 of Chapter 2 title 20 of the Fisher go to Georgia and it did the\nquality basic education act. Education House will 1049 by Ripson and\nFriday, the 120 second Evans, the 57th.\nGisley, the 121st.\nSanchez, the 42nd.\nBell, the 75th and others.\nThey'll be titled an act of men chapter one and title 51.\nThe fish go to Georgia, Antietta,\nrelating the general provisions regarding torts.\nJudiciary.\nHospital 1050 by reps of Defry, the 122nd Evans,\nthe 57th Roberts, the 52nd.\nGisley, the 121st Sanchez, the 42nd and others.\nThey'll be titled an act of men code section 35,\n17 of the fish go to Georgia\nannotated relaying the state and local law enforcement actions public safety\nand homeland security.\nOsville 1051 by reps and a bury the 56 glazed the 67th\nBell of the 75th Holly the 116th Scofield the 63rd\nthe bill be a total an act to amend our 27th chapter 2 title 20 of the fish go\nto Georgia annotated relayed an allitering at or disrupting public schools\nEducation House will ten fifty two by reps and a berry the fifty six. I'll leave the hundred and six Evans the fifty-seventh\nSanchez the forty-second lupton of the eighty-third and others\nBill B. Tottlin act to amend part three of article seven in chapter three entitled twenty of the fish go to Georgia\nAnadjator relating the Georgia student finance authority\nIt could just tone it down just a little bit would be helpful just a little I know you\nhave imported business you're transacting do it a little bit quiet quieter please higher\neducation House will 1053 by reps under limit the 98th Romano the 97th Sanchez the 42nd Wilkerson\nof the 38th, left into the 83rd, and others.\nBill B. Todd will act to amend Title 35,\nthe official go to Georgia annotated,\nrelating to law enforcement officers and agencies.\nPublic safety and homeland security.\nHousehold 1054 by Robsett,\nmore than 91st, McQueen in the 61st,\nCanada 58th, and Bell of the 75th.\nBill B. Todd will act to amend Title 31,\nand the official go to Georgia annotated, relating to health.\nDo you do sherry house resolute ten forty six by representative Kendrick of the 95th and florin oi the 74th\nResolution proposing amendment to the Constitution so to provide that any property owner in a condominium property owner's development or simon common interest ownership\nJudiciary house resolution ten forty seven by represent Kendrick of the 95th Evans the 57th Clark the hundred and eight\n8th Resolution proposing an amendment to the Constitution,\nState of Georgia, so as to set the rate of that Valorum tax.\nWays and means House Resolution 1048 by reps on the Skullfield\n63rd, Scott of the 76th, Davis of the 87th at McLean,\nthe 109th Resolution urging the introduction,\nconsideration, and adoption of the Georgia Breed Parents and Family Support Act in 2026.\nindustry and labor. House\nresolution 1049 by reps and\na hugely the 141st Griffin of the\n149th Barry the 56th Park of the\nhundred and seventh Jones the\nhundred and forty third. A\nresolution designating Wednesday\nthe last week in October of\neach year as fat and all in\nopen oil awareness day. Special\nrules. House resolution 1050\nby reps of green and the\n154th Donahue, the 31st beckons of the 96th Buckner, the 137th in Florida, the 74th resolution authorizing the conveyance of certain state-owned property in Clayton County.\nState properties.\nHouse resolution 1051 by Robson of Green and the 154th Donahue, the 31st beckons of the 96th Buckner, the 137th in Florida, the 74th resolution authorizing the granting a non-exclusive easements for the construction operation and maintenance of facilities.\nstate properties House Resolution 1052 by reps of Cooper the 45th Fleming of the\n114th Pantitch of the 51st and Reeves the 99th Resolution Expressing Support for\nthe designation of a state creator Willie syndrome Awareness Day Special Rules House\nResolution 1053 by reps of Clark the 100th and Martinez the 111th Resolution to\nto urge the appropriate state and local authorities to consider renaming.\nAnd for governmental coordination, general House resolution 1054 by Representative Barry, the 56th,\nHugely the 141st, Parkly the 107th, Miller the 62nd, Mitchell the 88th and others.\nA resolution creating a house study committee on the effects of the one big, beautiful bill.\nAppropriations, Senate Bill 407 by Senator Dickerson of the 21st Albers of the 56th\nin Karpatric of the 32nd, the bill will be taught on active provide for a homestead\nexemption from Cherokee County School District at Valaram, Texas.\nIntergovernmental coordination, that completes first readers.\nThank you, members, second reading the bills and resolutions, but will you read?\nHouse Bill 1000 by Representative Gamble, 15th, Wade of the 9th.\nCeva of the 34th, Hong of the 100th, third, Black 1 of the 146th and others.\nA bill relating to income taxes, House Bill 101, by Representative Wade of the 9th,\nGamble of the 15th, Steve of the 34th, Hong of the 103rd, Blackburn of the 146 and others.\nA bill relating to the imposition rate, computation, exemptions, and credits relative to income taxes.\nHouse Bill 102, by Representative Camp of the 135th, and Hatchet of the 150th.\nA bill relating to medical assistance generally.\nHouse Bill 103, by Representative Wilkerson of the 38th,\nLeipton of the 83rd, Pannonch of the 51st, Kendrick of the 95th, Campbell of the 35th and others.\nAbel related to annual salaries of certain state officials and cost of living adjustments.\nHouse Bill 104, by Rebser Wilkerson of the 38th, Campbell of the 35th, Pannonch of the 51st, Kendrick of the 95th, Roman of the 97th and others.\nAbel relating to the Security Guard Division of the Department of Public Safety, House Bill 105, by Rebser Wilkerson of the 38th.\nBill to amend an act providing a new charter for the City of Ostele, House Bill 106, by Representative Gugley of the 141st, Williams of the 168th, Kendrick of the 95th, a bill relating to the Department of Public Health.\nHouse Bill 107, by Representative Barry of the 56th, Friday the 122nd, Ridley of the 22nd, Sanchez of the 42nd, Bell of the 75th, and others, a bill relating to landlord and tenant.\nHouse Bill 108 by Representative Williams of the 112th Wilkerson of the 38th, Jones of the 47th.\nA bill relating to general provisions regarding the General Assembly.\nHouse Bill 109 by Representative Dalton of the 48th, Jones of the 47th,\ndown to 2G of the 105th, Reeves of the 99th, Silcox of the 53rd, and others.\nA bill relating to elementary and secondary education.\nHouse Bill 1010 by Representative Lim of the 98th, a bill relating to commerce and trade corporations,\nPartnerships and Associations Revenue and Taxation.\nHouse Bill 11, by Representative Galliard at the 160 second,\nJackson 128, Lays of the 67th.\nAbel relating to law enforcement officers and agencies.\nHouse Bill 1012, by Representative Ramon of the 97th.\nRidley of the 22nd, Oliver of the 84th,\nfive of the 120 second, Sanchez of the 42nd.\nAbel relating to general provisions of local government.\nHouse Bill 2013, by Representative Abel of the 75th,\nSharper of the 177th, Carpenter of the 4th,\nPatelston of the 72nd, the Queen of the 61st and others.\nA bill relating to other state symbols.\nHouse bill 1,014 by reps of the 75th,\nBradley of the 22nd, Barnes of the 86,\nHagen of the 156th, and Sharper of the 177th.\nA bill relating to student health.\nHouse resolution 1,032 by reps of Jones of the 60th,\nMcLean of the 109th, Glazer of the 67th,\nOliver of the 84th.\nThe resolution creating the House Study Committee\non raising the minimum wage in Georgia.\nHouse Resolution 1333 by Representative Draper of the 19th Gisler of the 121st was of the\n55th Miller of the 62nd Roberts of the 52nd others a resolution proposing an amendment\nto the Constitution says to provide the changes of horsemen and districts of the General\nAssembly in Congress shall only be made in the first odd number year subsequent to each\nUnited States decennial census, through second readers.\nThank you, Mr. Clerk. We do have some reports of standing committees today. Mr. Clerk, will you read?\nCouncilmember Reed.\nRepresentative Josh Bonner, the 73rd District Chairman of the Committee on Defense and\nVeteran Affairs submitted the following report and speak to your Committee on Defense\nand Veteran Affairs as head under its consideration of following bills of the House.\nThe instructor made a report the same back to the House with the following recommendation.\nHouse Bill 1010, House Bill 110, due pass, House Bill 985, due pass, respectfully\nsubmitted, Representative Josh Bonner, the 73rd District Chairman.\nRepresentative Don Parsons, the 44th District Chairman of the Committee on Energy Utilities and Telecommunications submitted the following report on the Speaker, your Committee on Energy Utilities and Telecommunications that has our nerds consideration, following Bill of the House, this is the struck to me to report the same back to the House and following recommendation, House Bill 998, do pass, respectfully submitted, Representative Don Parsons, the 44th District Chairman.\nRepresentative Gunner of the 8th District Chairman of the Committee on Judiciary submitted the following report and speak to your Committee on Judiciary.\nThis had an interest consideration of following bills and resolutions of the House, and it struck to me to report the same back to the House of the Following Recommendations, House Bill 557, do pass by committee substitute, House Bill 676, do pass, House Bill 960, do pass, House Bill 999, do pass, House Resolution 251, do pass, respectfully submitted.\nPerhaps I'm going to gunner the 8th district chairman.\nThat completes the reading of the report to standing committees.\nThank you, Mr. Clerk, the meetings are working, as they should be.\nWe'll move on to morning orders now.\nMembers, if you will, give the member in the well your attention.\nWe have guests in the gallery and we have members who want to recognize some important folks\nin their lives and in the lives of our state.\nwill begin with Representative Changi hearing, then Representative Douglas your own deck.\nMembers of you will be courteous to the Lady in the Well of the Lady will suspend just\nfor a moment.\nMembers, if you allow, get close to your seats\nor have your conversations if they're important.\nYou can take them out to the any room.\nBut that certainly be courteous to the member in the well.\nWe're representative hearing.\nGood morning, Mr. Speaker and members of the House.\nToday, I am delighted to introduce sisters-in-law.\nIf you would please stand up.\nSisters in Law Society is a student organization\nat Georgia State University dedicated to empowering women\nof color who aspire to enter the legal field\nand profession through mentorship,\nprofessional development and community.\nThe organization provides supportive space for members\nto build confidence, access, resources,\nconnect with legal professionals\nwhile preparing for law school and legal careers.\nSister-in-law is committed to advancing equity, justice,\nand representation with legal fields.\nIf you would please stand and welcome women in law.\nLadies, if you would meet me for a picture,\nI would greatly appreciate it.\nThanks for coming.\nSpeaker our year of the well.\nThank you.\nWelcome, ladies, to your state capital.\nKeep studying hard.\nGeorgia State is a great school.\nThanks for being here.\nRepresenting to Mietrius Douglas.\nRepresenting Douglas.\nGive the gentleman the well you're changing, please.\nThank you, Mr. Speaker.\nColleagues, I am standing here today to introduce\nand proud group of colleagues in recognition of this\nmight be neurotherapy month, January and August of this\nyear, will Dr. Clay and the rest of the group please stand\nwhile I recognize them.\nThey're up in the gallery to my right, something to your\nleft. Today in the gallery we welcome a distinguished group led by Dr. Clay, Director of Nero Therapy\nat Mining Motion Development Centers of Georgia. She also as the Founder Emeritus Institute\nof Brain Health. Will our guests please, our colleagues, please give them a warm welcome\nto the Georgia State House.\nI yield well.\nI yield well.\nI yield well.\nI yield well.\nThank you what you're doing for your neighbors and our neighbors.\nWe appreciate what you're doing. It's great work.\nThank you. We encourage you to keep working hard.\nThank you for being here today.\nRepresentative Jasmine Clark has recognized\nRepresentative Clark for a morning order.\nGive the lady a new way of your attention, please.\nThank you, Mr. Speaker.\nGood morning, everybody.\nToday, I would like to welcome several community violence\nintervention groups and community health worker advocates\nto the Capitol.\nCommunity violence intervention programs\nlike Ivy at Grady Hospital and organizations\nlike Paralyze from Violence, founded by Eddie Smith\nand Hope Husslers, founded by Leonard Dungee\nand Titara Alexander, who are here joining us\nin the gallery today, could you stand?\nYou're here?\nOh, well, they're still trying to get into the gallery,\nbut they are on their way.\nThese organizations and programs seek to prevent\ngun violence through a holistic community-based approaches.\nThis includes using things like peer specialists,\nother community health workers,\nand really considering social determinants of health,\nand trying to prevent gun violence in our communities.\nThank you for this very important work,\nand welcome to the People's House.\nThank you, Speaker.\nAre you?\nThank you.\nRepresenting the aisle, aisle, excuse me,\nand Representative Gamble,\norganized for a morning order.\nIs Dr. aisle?\nRepresentative Gamble.\nLady and the gentleman are recognized.\nGood morning, thank you, Mr. Speaker.\nSo today, there are over 1,400 people at the capital\nfor addiction recovery awareness day, ARAD 2026.\nIf you could please stand if you made it into the gallery.\nThese people come from less than a mile from the gold dome\nto all the way five hours away to be with us here today.\nThese people are Georgia.\nThey represent over 900,000 Georgians in recovery\nfrom addiction.\nand they stand for over 1.4 million\nGeorgians who are in active addiction\nin communities in each of our districts\nin every part of Georgia.\nSo thank you so much for joining us here today.\nRecovery is real and welcome to the People's House.\nThank you.\nThank you.\nThank you.\nThank you for that recognition and great work.\nWe're representing Gilear.\nRepresentative Carl Gilliard from the great state of Chatham.\nThank you, Mr. Speaker.\nToday I want to rise to recognize Mr. Daring Lewis from Savannah, Georgia.\nMr. Lewis in March of 2025 was just walking and coming out into his own leftist wife who is here.\nhave members of Savannah, Savannah State, and Mrs. Kathy Lewis, that's here, who is the\nwife of Darren Lewis, and he was coming out of his house, high-speed chase, and was killed.\nToday is Saving Lives Day at the Capitol, and our focus is House Bill 10-11 focuses\non saving lives for law enforcement and civilian.\nThere's so many people, unfortunately, that have lost their life.\nWould you stand with us on today in memory of Mr. DARREN Lewis and an opportunity to save lives in Georgia?\nJust a moment of silence.\nThank you, Mr. Speaker.\nThank you, representatives.\nRepresentative Anne, representatives.\nOkay.\nRepresentative Scofield, Barnell, and Representative Tony Miller.\nMr. Speaker, good morning, colleagues.\nToday in the gallery, I'm honored to recognize\nto the People's House a group of amazing youth leaders\nfrom the City of College Park.\nUnder the leadership of Council Member,\nMayor Pro Tem, Jamil McKenzie,\nthe Youth Civic Advisory Council is a group of right now\nvoices who speak up, show up, and stand up for their city.\nThey address things like houselessness\nand advise mayor pro-tim on issues that need to be addressed.\nThese students make an impact wherever they go.\nToday here with us will all the students, staff, parents,\nmayor pro-tim, Jamel McKenzie, and the gallery,\nplease stand to be recognized for all your good work.\nThank you guys for being champions in the City of College Park.\nThank you all for being here, we appreciate you for having a good work.\nOkay, we need the Bibb delegation and representing Dale Washburn and the Bibb delegation.\nI join Representative Washburn in the well.\nGive him just a second.\nThey're all thinning to very important business.\nI'm sure they've come.\nI don't think Representative Harris is here yet.\nYeah, he's here.\nJust a second, Representative Washburn.\nThank you.\nYou almost recognized.\nThank you, Mr. Spaker.\nand thank you for your patience\nand now people getting to the well.\nLadies and gentlemen of the house,\nwe are pleased today to recognize\nthe Vine Ingle Junior Boys All-Star team\nand they are seated up here in the gallery along\nwith their coaches.\nI wanna read just a couple of paragraphs\nfrom the resolution we're doing for them.\nWhereas the Vine Ingle Junior Boys All-Star team\nhas earned the distinction\nbeing the best junior league team,\n14-year-old boys in the United States and the right to compete for the World Series\nChampionship against Chinese Type A. And whereas this supportive team continues its\ntriumph on two-year journey in junior league competition by posting an outstanding record\nof 24 and five over two seasons, as well as winning, intermediate World Series, Junior\nLeague World Series, two district five championships, two Georgia State\nchampionships, and two southeast regional championships. And whereas the\nphenomenal performance of the team is a clear indication of the outstanding\nathletic ability, dedication, hard work, and unity of purpose. In the spirit of\neach member of the team, it's superb offensive and defensive talents. And the\nThe astute direction of head coach Lance Foster and assistant coaches Harold Wilson and David Mullis.\nLadies and gentlemen, please join me in welcoming this team and recognizing their outstanding accomplishments.\nThank you, Mr. Speaker, I yield the well.\nI can say as well, thank you for being here,\nthank you for being dedicated to our nation's past time,\nbaseball.\nThank you for what you're doing.\nA good look at the rest of y'all's careers.\nI know y'all will continue to do very well,\nplaying baseball on the next levels up.\nCongratulations.\nThanks for being here.\nChair Lady Matthews is recognized for a morning order.\nChair Lady MacYak, thank you, Mr. Speaker.\nToday, I have time to read.\nThe lady will suspend just from a moment.\nThis is an important group.\nY'all know we're talking about literacy.\nIf you can't see, you can't see the read.\nTo learn the read.\nSo these are important folks in our lives of Georgia.\nlady will proceed she's recognized thank you again mr. Speaker the\noptometry association is here today so if you get called out to the ropes\nplease go out and say hello to them there is a mixed group of young optometrists\nand older optometrists did my heart well to see them today thank you for being\nhere and thank you for recognizing them thank you mr. Speaker thank you\nrepresentative. Great work. We appreciate what our\ntomatrists in Georgia do for us. Look forward to working\nwith them. Chairman Irwin, Representative Glaze, y'all\ngoing to come tell us about some of y'all's good work, right?\nYes, sir.\nHere, gentlemen, the lady and several other members, some\nother friends are interested in a part of that good work.\nHe's recognized.\nThank you so much. We want to recognize in our gallery this morning the big brothers and\nbig sisters of Metro Atlanta, Chattahoochi Valley, Northwest Georgia, and the heart of\nGeorgia. So if you have been inspired by a big brother or a big sister or you've been\nlittle and been inspired by their work if you would stand with us. We want to\nrecognize them today because of their work throughout Georgia, how they\ncontinue to help young people and their families and communities. And colleagues,\nI want to point out to you if I can, these mentors up here, the impact they have\nacross the state of Georgia, and also something that's hitting our state of\nGeorgia, which is chronic absenteeism. And big brothers and big sisters have\nhad but definitely been a group that have come in trying to help us getting\nthose young people to school where they can learn. So thank you and thank you\nfor being here today in what you do.\nArea and Pat will work. Thank you for your dedication. Big brothers and big\nthat's awesome. Thank you members. Wilbur Chad is recognized for a morning order.\nThank you Mr. Speaker. It's my pleasure to recognize the Georgia Business Aviation\nAssociation with us up in the gallery. If you all please stand. The Georgia's Business\nAviation Association is very important to Georgia. They play a critical role in strengthening\nGeorgia's economy and supporting thousands of high quality jobs, as well as helping ensure\nthat Georgia's airports, large and small, remain viable for the economy, and through their\nadvocacy and education and their workforce development, GBA promotes the highest standards\nof safety and professionalism within the country.\nToday, they'll be in the club at, I think, room 510 is from one to three, I'm inviting\nyou all to go over there and speak with these folks and very much appreciate what you do\nfor Georgia and let's give them a round of applause if you want.\nThank you, Mr. Speaker.\nI yield a lot.\nThanks, and part of our state in so many different ways, our airports.\nThank you all for what y'all doing.\nThanks for being here.\nContinue to advocate for airports, right?\nGood stuff.\nThank you, Whitbridge.\nthat concludes our morning orders.\nMembers, I'm going to ask you to come to your seats.\nWe have some important business we need to attend to this morning.\nWe have a further action on a bill we sent over to the Senate last year that the author\nhas worked out, so I'm going to ask members if you'll come to the floor and come to your seats.\nI want to recognize Chairman Petrie for a motion.\nChairman Petrie, members please give the member in the well your attention.\nMr. Speaker, as relates to House Bill 444, we agree to the Senate's substitute as amended by the House.\nChairman has 443, right?\n443, Mr.\n443.\n443.\nMr. Clerk, will you read the caption to House Bill 443?\nHouse Bill 443, members and the P3166 and others to be entitled and act to amend code section 27 to 23 the Fisher go to Georgia, annotated relay, no license permit tag and stamp fees as to provide from the fees for reef and\nof the regulatory fish endorsements.\nThe representative, Petrie, will you explain\nthe Senate's substitute in the House amendment?\nThank you, Mr. Speaker.\nYes, so members, as you'll recall, last year,\nwe overwhelmingly passed House Bill 443.\nThat is a bill that creates an endorse,\na special endorsement for refishing,\nwhich is essentially offshore fishing.\nThis is something that our fishermen on the coast want.\nIt will allow us to raise funds to take possession\nof the fishery in federal waters from the federal government.\nAnd the way we're doing that, as other adjacent states\nhave done, is by using this mechanism\nto raise the revenue to do our own surveys.\nSo right now, federal surveys that are done on our fishery\nare basically encompassed the entire Atlantic coast.\nAnd so they lack any rigor as it relates\nto accuracy in Georgia.\nAnd most of you have probably all had 100 emails\nabout red snapper.\nAnd we only have one day we can catch red snapper in Georgia.\nSo anyway, that's the purpose of the bill.\nIn the last minutes of signing die, this bill was sent back with an amendment related to raw milk.\nAnd so we are sending this bill back, having removed raw milk, this amendment on raw milk and putting it back in its previous state.\nMr. Speaker, I'm glad to answer any questions if that needs clarity.\nGentlemen, has no questions.\nThank you, Mr. Speaker.\nQ. Chairman Petrie, is there any objection to adoption of the House amendment?\nHearing none, the House amendment is adopted, on the gentleman's motion that the House\nagreed to the Senate's substitute, excuse me, Senate substitute to House Bill 443 as amended\nby the House, all those in favor of vote yes, opposed, we all vote no, and Mr. Clerk,\nyou unlock the machines.\nhave all members voted. This is the way we do it.\nWe have been practicing on your attendance when you vote green or red.\nall members voted. All members voted. Representative Scott, if the lady are you\ngreen or red? Green? Will you allow us to vote your machine for you?\nEverything's Scott both green. Have all members now voted? All members voted.\nBut if so, Mr. Clerk, will you lock the machines?\nOn the gentleman's motion, the yeas are 165 of the days or two.\nThe House has agreed to the Senate's substitute to House Bill 443 as amended by the House.\nThank you members.\nnew orders. We have a whole slew of afternoon orders. So we're going to give you, we'll\nbe a little bit flexible, but I'm asking you to hold your afternoon order to one minute\nif possible. If possible, we'll be a little bit flexible, but one minute. And I want the\nThe members that give representative Sharper your attention, please.\nWe'll recognize representative Sharper now, and I'm going to ask members of the police\njoin representing Sharper and myself in standing.\nAll members, please stand.\nWe were going to have an image up, but they don't have it ready.\nBut Naomi Delva, she came here 11 years ago as an intern from Spellman College for the\nLegislative of Black Caucus.\nShe was a young lady that you would see back with us a lot of times.\nA lot of you knew her.\nShe was 30 years old and she passed away and she was encountered a lot of you guys, a lot\nof times and no matter where she was in the country,\nshe would try to be here all those years after for session.\nBut I'm going to read this very briefly.\nI earned the life and legacy of Naomi Delva for other purposes.\nWhereas the state of Georgia mourns the loss\nof one of its most distinguished citizens\nwith the passing of Naomi Delva on January the 5th, 2026.\nWhereas Naomi Delva was a woman of vision,\ncharacter and purpose whose life was marked by service, leadership, and unwavering commitment\nto uplifting others.\nWe're asked throughout her life, Naomi Delvey exemplified excellence in entrepreneurship,\ncommunity development, and mentorship using her gifts and talents to empower individuals,\nfamilies, and small businesses.\nShe was widely respected for her integrity, compassion, worth ethic, and she consistently\nsought to create opportunities for economic growth through education and positive social\nimpact.\nNaomi Delva's influence extended far beyond her professional accomplishments.\nShe was a source of encouragement, wisdom, inspiration to colleagues, friends, and all who\nat the privilege of knowing her.\nHer legacy will continue to live through the lives she touched initiatives she helped\nbuild.\nAnd in doing an example, she set a faith.\nis fitting and proper that the Georgia House of Representatives pause to recognize and honor\nthe life of this remarkable individual and to extend heartfelt sympathy to her family\nand the loved ones and all who've known her through her life.\nShe was also my business partner with Delvin Sharp Consulting Group over the last four\nyears and she was also the creator and founder of the Harmony Fresh toothpaste that a lot\nof you are already using.\nSo therefore, we just thank God for this opportunity\nto honor her and everything she's done to help so many people\nall across the country and across the world.\nJoin me in a moment of silence, please.\nThank you.\nGod bless.\nThank you, Representative Sharper.\nAnd our condolences, of course.\nThank you, House members.\nRepresentative Bail is recognized for an afternoon order.\nRepresentative Bail, get the gentleman to wear your attention.\nPlease.\nThank you, Mr. Speaker, for being in knowledge today.\nFirst of all, I'd like to start off by apologizing.\nI apologize to my colleagues, Speaker of the House,\nthe staff and other members.\nYesterday, during this pledge of allegiance,\nwhen I stood, I draped a abolished ice flag over my back.\nI understand that this is not a part of the decorum here,\nand I apologize for violating that.\nBut like America, I feel like I'm in a crisis.\nSo in that, I acted out.\nI'm a veteran, so apparently I'm somebody's mental health\npatient as well.\nBut that's funny, huh?\nBut I do deeply apologize for that.\nMy country is in turmoil, and I\nacted out as an activist, as a person that deeply cares about\nall of you in this room in this country.\nMay I find better ways to show my activism and my spirit\nand my courage for our country and our nation.\nThank you.\nThank you, Mr. Speaker.\nI yield the will.\nThank you, Representative Bail, for coming down and I'll\nlearn from and follow the rule of the Corridor in this house.\nWhip Sam Park is recognized for an afternoon order.\nThank you, Mr. Speaker.\nI rise to honor the life of Alex Prety, a son, a brother,\nan ICU nurse, and a devoted member of his community\nwho spent his life caring for others.\nHis family described him as a kind-hearted soul\nwho cared deeply for his loved ones\nand the veterans he served.\nOn January 24th, Alex Prety was shot and killed\nin broad daylight by federal immigration agents\nwhile exercising his constitutional rights.\nHow have we become a country\nwhere American citizens are killed in the street\nby their own government for exercising constitutional rights.\nThis is not normal, this is not acceptable,\nand it should shock the conscience of every American\nwho believes in the rule of law.\nThe rule of law means allegiance to the Constitution,\nnot blind obedience to power.\nRespect for law enforcement requires accountability\nand transparency, especially when force replaces restraint\nand violence replaces justice.\nThis is a moment that demands courage, not fear,\nfidelity to the rule of law, not might, makes right,\ntruth, not denial.\nWhat we choose now will define who we are as a nation,\nand whether we will safeguard our democracy\nand trust it to our care.\nThank you, Mr. Speaker.\nI yield the well.\nChair Lady Amp is recognized for an afternoon.\nThank you, Ms. Whitport.\nChair Lady Camp, give the lady in the will.\nYour attention, please.\nand friends.\nRepresentative Ali, there he is, you're next.\nThank you, Mr. Speaker.\nGood morning.\nLast night's attack on Minnesota State Representative Omar\nduring a town hall was an act of political violence,\nplain and simple.\nOur public servant was targeted while doing exactly\nwhat democracy requires, meeting constituents\nand listening to their concerns.\nThat should never put anyone at risk or danger.\nPolitical disagreement is part of a healthy republic.\nViolence is not.\nWhen someone uses force or intimidation\nto silence an elected official, that is not a protest.\nThis is terrorism.\nIt is an attempt to rule through fear.\nWe must always condemn this clearly and without qualification,\nno matter who the target is,\nand no matter what their political party is.\nThere is no place for political violence in America, none.\nOur democracy depends on civil discourse,\npeaceful engagement, and respect from one another.\nWe resolve our differences with words and with votes,\nnot with threads and never with violence.\nThank you.\nThank you.\nWe're representing Vali.\nGive the gentleman he's carrying on a tradition here.\nHe started again yesterday, so we have to say that.\nAnd Ms. Ruckanay, thank you, Mr. Speaker.\nMembers of this house, I wanted to direct your attention\nto the screen where 12-year-old Oscar is displayed.\nOscar is a wonderful kid.\nA country music fan and avid reader,\nbut also a fantastic friend to those who are around him.\nAnd so if you are looking to make a difference\nin a child's life, if you are looking to open your arms\nto family, then please go to itsmightturnnow.dhs.orgia.gov\nto please consider Oscar for adoption.\nThank you so much.\nThank you, Representative.\nA pretty cool John Deere sweater on there.\nSweat shirt.\nRepresentative Lim and Representative Jasmine Clark\nrecognized for an afternoon order.\nRepresentative Marvin Lim and friends.\nThank you, Mr. Speaker.\nSo often people will tell our stories\nand those of our communities for us.\nand when they do, so often will they tell a story\nof our weaknesses, at least as they perceive them.\nWe are politicians, we've all been there.\nToo frequently we don't allow people\nto tell their own stories, and too frequently\nwe look past the strengths that lie therein.\nThis past week, schools in my district,\nincluding one called Medo Creek High School,\nchose to tell their own story about how our government\nand its policies on immigration are impacting them.\nThey were not the only ones to do so,\nbut it was special that they did as the most immigrant\ndiverse part of my county and also in the face of fears\nfor many students and their parents about speaking out.\nYou may know I've come to this while many times\nspeaking proudly about the diversity\nof not only my school's backgrounds,\nbut also their accomplishments across STEM,\nlanguage arts, sports and other fields.\nIt's been one of my greatest joys\nto work so closely with my schools\nwhose greatest strengths still are perhaps invisible\nto the eye, but especially to those eyes\nwho look at them only when a news camera does.\nToday we want to recognize their strength to speak out\nabout what they believe is right.\nBut beyond that, beyond today, I urge us to nurture\ntheir many other strengths in and outside the classroom,\nthe many other parts of who they are beyond statistics\nthat will never fully capture either their identity\nor their achievements, and to build up their resilience\nrather than tearing them down with their perceived weaknesses\nas some have, and bullying students who are to me\nwise beyond their years, yet still to be clear in their formative years.\nIn speaking to so many in the school community this past week, whose feedback we certainly\nsought before deciding to speak here, I know two things to be true at once.\nThey are proud of who they are and want their voices heard in our democracy.\nAnd they also want to go on living the many other parts of their lives without people\nseeing them only as it meets our own preconceived narratives, speaking about them only when it\nour individual purposes. I trust this body can honor that, and the best way is not to dismiss,\nbut to listen with care and curiosity when our youth decide to tell their own stories.\nThank you, Mr. Speaker. I yield the well.\nThank you. That was important, but I'll remind members\nwhen you exceed your time, limit your cutting down on the next person's afternoon order.\nI'm not sure they all appreciate that.\nRips and Scofield is recognized for an afternoon order.\nThank you, Mr. Speaker.\nMembers of the House, I really want you to listen.\nWe have partnered with the Georgia Lions Lighthouse, which operates one of the largest\neyeglass recycling centers in the United States, providing impact domestically and internationally.\nThank you, Mr. Speaker, Chris Riley and Gerald Pilgrim\nfor making this happen.\nThis box will be located at the counter of the security\ndesk in the capital.\nSo please bring your old eyeglasses,\nincluding the broken ones, loose lenses, readers, sunglasses,\nand hearing aids.\nMy goal is to collect 200 glasses by the end of session.\nTogether, the Georgia General Assembly\nto make a difference for all people giving the gift of sight.\nI'm the first one to drop it in.\nI need those others to join me.\nThank you, I yielded well.\nAwesome.\nRepresentative Davis, could you do that little wave?\nHow you-\nYes.\nThere you go.\nAll right, members, that's a great opportunities.\nSo let's help.\nVery important.\nLadies and gentlemen of the House, before we close out this month of January, I want to remind\nus of something that Martin Luther King, Jr. once said.\nHe frequently spoke out about solids in the face of injustice, and he reminds us that\nsolids in the face of wrong is betrayal.\nAnd that's why you hear members coming to this well, speaking about what is important\nto them.\nAnd I want to remind us that these are moments of personal privilege, it is not for debate.\nSo we need to respect each other's opinions and not turn them into debate.\nSo I appreciate everyone who shares with us because there's something to be learned\nfrom each and every one of us.\nAnd I appreciate the opportunity for us to have moments of personal privilege.\nThank you, Mr. Speaker.\nI yield the well.\nThank you, Madam Leader.\nRepresenting talented.\nMr. Speaker, I've got two colleagues joining me.\nI just want to let you look at your desk and see this invitation.\nFebruary 17th is the day we've been waiting on.\nFresh Georgia shrimp.\nWhat more kids you want?\nIt's going to be good stuff.\nWe're following Savannah this year.\nI know Savannah's going to be a blast in a couple of weeks.\nActually, two weeks, next week, I think.\nAnd then this is going to be a great, great time.\n17th, dinner, and cocktail start at five o'clock.\nWe hope to see you there.\nYou're all invited.\nThat'll be a deeper and a deeper.\nThank you, we look forward to it.\nThose wild, Georgia shrimp.\nGood stuff.\nRepresentative Rhonda Taylor.\nRepresentative Taylor.\nThank you, Mr. Speaker.\nI just wanted to pause.\nI haven't heard anyone say it during the morning order\nand thus far in the afternoon orders.\nBut I wanted to pause and say thank you\nfor the beautiful garment bag that you left on our doors.\nCan we give the speaker a hand with that?\nI really, really like it.\nThank you.\nAnd Mr. Speaker, I you're the well.\nThank you, Representative.\nThank you all.\nI hope you put it the good use and travel safely.\nCharlie D'Aimsy and Charlie D'Camp\nrecognize for an afternoon order.\nGood morning, still.\nSo on your desk today, this often,\nthank you, Speaker.\nOn your desk today, I know there's a lot,\nBut this often gets overlooked.\nChairman Campan, I want you to know how important the information is in here.\nMany of you call and ask about some of the facts that are already in here.\nIt is exactly what you need to address any children's issues that might be happening\nin your district and also anything that might just be speaking to your own heart\nabout our children wonderful fact sheets\nthat will tell you across key indicators,\nhow George is doing and how we can improve.\nSo please, if you feel inclined\nthat it doesn't matter to you,\nshare it with someone else.\nThis book will get you through the year though.\nThank you, Mr. Speaker.\nI yield the well.\nThat concludes our afternoon orders, Mr. Clerk, are you ready for privileged resolutions?\nYou read the caption to a group of privileged resolutions, Mr. Clerk.\nHonoring the life and memory of Mrs. Geneva Wilkins Jones.\nHonoring the life and memory of Mertle, LeVon, Johnson, Odom.\nHonoring all cancer patients, survivors, and their families is recognizing February 4th,\nin 2021 as Cancer Action Day, honoring the life and memory of Steve Dale Golden, honoring\nthe life and memory of Charles Chuck Lennard Leonard Mashburn, honoring the life and memory\nof Joshua Gerard Cardiello, honoring the life and memory of Jacob Allen Cardiello, memorializing\nthe victims, the five-call chemical corporation explosion of 1971.\nCommending the Marriage and Family Therapist of Georgia and recognizing February 11,\n2026 as the Marriage and Family Therapy Day at the State Capitol.\nRecognizing February 17, 2026 as blood plasma, donation, awareness day in Georgia,\nan honoring the life service and legacy of Mayor Wabend Smith of Alapahaw Georgia,\ncommending and congratulating Ron Zerpoly, commending the middle of Georgia State\nUniversity School of Aviation's Excellence in Aerospace Education,\nrecognizing commending just a grow Baptist Church on the occasion of its\nIt's 175th anniversary.\nRecognizing commending, Penny L. Lkins PhD, recognizing the efforts of YKKAP America Inc. for their\nsignificant contributions to economic development, congratulating commending the good neighbor\nhomeless shelter upon 30 years of dedicated service, recognizing commending Mike Dunham\non his outstanding career with the Associated General Contractors of Georgia, recognizing\nFebruary as Career and Technical Education month in February 4th, 2026, as Georgia Career\nand Technical Student Organizations Day at State Capital. Celebrating the 250th anniversary\nof the United States Postal Service and reaffirming support for its continued public service to\nthe American people. Congratulating the City of Tucker upon its 10th anniversary, recognizing\nMay 2nd, 2026 is Tucker Day at the State Capital, recognizing and honoring the City of\nTucker Georgia on the occasion of his 10th anniversary,\nrecognizing commending Miss Chantelle Grant\non the occasion of her selection\nas the 2025 Georgia Public Library employee of the year,\ncongratulating Sonic Edge of Pebblebrook High School\nfor winning the 2025 International Championship\nof High School Acapella.\nCelebrating the first HOA, COA and POA Day\nat the Capitol, recognizing the importance\nof civil engagement with homeowners\nacross the state of Georgia.\nRecognizing March 4th, 2026 is City of Hopeville Day\nat the state, at the Georgia State Capitol,\nrecognizing February 19th, 2026,\nas Lupus Advocacy Day at the State Capitol.\nRecognizing February 10th, 2026,\nis dyslexia day at the State Capitol.\nRecognizing January 29th, 2026 is due\nthe day at the State Capitol.\nCelebrating continued observance of March 5th\nas small business day in designated March 5th, 2026,\nas a corporate and entrepreneurial woman\nin leadership day at the Georgia State Capitol.\nRecognizing February 19th, 2026,\nas girls empowerment day,\nrecognizing commending Taiwan\nfor its relationship with the United States\nand state of Georgia,\nrecognizing commending the Boykin Zee,\nand for other purposes,\nrecognizing and commending Mrs. Lena B. Williams.\nWe're recognizing and commending the Association of Nutrition and Food Service professionals\nrecognizing February 11th, 2026 as Albany Dirty County Day at the State Capitol, recognizing\nthe members of the Georgia Black Republican Council, recognizing February 4th, 2026 as Hispanic\nDay at the State Capitol, celebrating the second year of recognition of Trinity International\nUniversity of Ambassador and recognizing June 7th, 2026, it's T-I-U-A, School of Business\nEntrepreneur Day, and for other purposes that completes the reading of the resolution.\nIs there any objection to adopting the privileged resolutions?\nHearing none, the resolutions are adopted.\nWe'll move on to announcements this time.\nand Chokus, recognize, take your time.\nThen Chairman Corbett and Chair Lady Smith.\nChairman Chokus is recognized for the announcement.\nThank you, Mr. Speaker.\nMembers of the Small Business Development Committee,\nwe will have a meeting tomorrow morning at 8 o'clock, 506.\nWe have a bill and we have a presentation.\nSo please be there.\nNeed a quorum.\nThank you.\nThank you, Mr. Speaker.\nChairman Corbett, recognize for announcement.\nThank you, Mr. Speaker.\nThe rule caucus will be meeting over the ag building down here off of Trinity, where\nwe met last year.\nLunch will be served, everybody come join us, thank you, Mr. Speaker.\nChair, ladies, Smith, recognize for announcement.\nThank you, Mr. Speaker, to the Natural Resource and Environment Committee, we will have a meeting tomorrow morning.\nWe will have an in-depth presentation of the forestry issues that we are facing.\nSo see you tomorrow, room 606, CLAB. Thank you.\nChair, Lady Hagen.\nRecognize one of those.\nThank you, Mr. Speaker.\nThe Federal Development Committee will have a meeting today at 2 o'clock in room 515 in the CLOB, and we do have a bill, so please try to be there if you can make it.\nThank you.\nAnd he's done, Chairman Hawkins recognized for an announcement.\nThank you, Mr. Speaker.\nThe Committee on Health will meet today at 2 o'clock in 403.\nThat's Capitol 403.\nThank you.\nChairman Todd Jones recognized for an announcement and friend.\nMr. Speaker, Representative Panich and I for the fourth year are hosting a Shabbat dinner.\nFor those of you who have never attended a Shabbat dinner, I promise you it's Shabbat\nlight.\nBut it's a great opportunity to experience and really just get a sense of what exactly\noccurs at a Shabbat dinner.\nI think you'll really enjoy it.\nWe have one happening in Roswell and one happening in Macon this Friday.\nIf you need the details, please see Representative Panich or myself.\nThank you so much.\nThank you, Mr. Speaker, the House Industry and Labor Committee will be meeting this afternoon\nat 3 o'clock and CLOB at 5 o'clock 6.\nThank you.\nRepresentative Adinia, recognize for the announcement.\nThank you, Mr. Speaker.\nColleagues, members of the Georgia Legislative Black Caucus.\nWe have a meeting today is a very important meeting where taking some important votes is\ngoing to be at CLOB 310 at 3PM.\nLook forward to seeing you there.\nThank you, Mr. Speaker.\nWhich room?\nThree what?\n310.\nWe can't.\nThe LLB.\nI want to make sure everybody got it.\nChair Rhodes, Chairman Rhodes.\nGame, Fishing Parks.\nThank you, Mr. Speaker.\nGame fishing parks from me and 415 CLOB at 130 today.\nWe have our yearly update from Commissioner Raven.\nSo I need y'all there to see what they've been doing this year.\nThank you.\nThank you, sir.\nRepresentative Carter, recognize for the announcement.\nRepresentative Doreen Carter.\nThank you. Good morning, everyone.\nYou all know what time it is.\nThis year, we were asking you to wear red on two days.\nSo on Thursday, February the 5th,\nthe American Heart Association is having their advocacy day\nand they are asking if you were red\nand we will meet them on the South Steps at 9.30 AM\non Thursday, February the 5th to wear red and take their picture.\nThen on Friday, because we're in session\nand we're normally not in session on that Friday,\nbut it's okay, we're gonna ask you to wear red again.\nAnd that is the Go Red for Women\nwith just American Heart Association's advocacy day\nto bring awareness to heart disease as it affects women.\nAnd on that day, we'll also have a luncheon\nthat will be at 12.\nIf you think you're going to join us for lunch,\nplease contact my office\nbecause we're finalizing catering.\nAnd then at one on Friday, we'll have Dr. Focker-Ready\nout of Cleveland, Mississippi,\nwho is an interventional cardiologist,\nwill be one of our guest speakers.\nSo, I just want to see if you were listening.\nOn Thursday, we'll call her, are you wearing?\nAnd on Friday, we'll call her, are you wearing?\nThank you.\nHave a great weekend.\nDon't pay your attention to the peanut gallery.\nChairman Yoder, recognize for the announcement.\nThank you, Mr. Speaker.\nThe appropriations general government subcommittee will meet today at 1 o'clock, 606 CLOB.\nThank you.\nThank you.\nChairman Anderson.\nThank you, Mr. Speaker.\nThe federal government affairs committee will meet this afternoon at 3 o'clock in 606 CLOB.\nThat concludes our announcements.\nI have one special recognition today.\nOne of our own has a birthday.\nI'm looking this way, but I'm then going to do what quarterbacks do.\nlook over there and recognize the pro-tim of this house,\nwe're saying, Jan Jones is celebrating the birthday today.\nWe appreciate you very much.\nThank you for your service and be birthday.\nOkay, members, we do have some pages today.\nSo you, those of you who have pages,\nif you'll join me up front, as soon as we adjourn,\nwe'll get some page photos done.\nThe majority leader of this house has recognized for a motion.\nThank you, Ms. Speaker.\nI move that this house stand adjourned until Thursday, January 29th, 2026 at 10 o'clock\na.m.\nBoy, Tom's flying on the motion of the majority of this house stand adjourned until 10 a.m.\nThursday, January the 29th, 2026.\nAll those in favor will say aye, all those opposed.\nWe'll say no.\nJust clear those that counted, voted aye, clear.\nWe are adjourned until tomorrow.\nThank you for being here, and thank you for your attention.\n",
  "updated_at": "2026-02-12T01:30:06.660995+00:00"
}