{
  "video_id": "Ju2zyqO_6Wk",
  "url": "https://www.youtube.com/watch?v=Ju2zyqO_6Wk",
  "title": "3/20/23 - Committee on Transportation",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 21,
  "summary": "Here is a summary of the Georgia 3/20/23 - Committee on Transportation session:\n\n**Overview**: The session focused on a Georgia legislature bill regarding truck weight limits, including amendments and discussion on the proposed changes.\n\n**Key Actions**:\n- **HR 256**: Annual road naming bill, amended to include SR 347 for the Sean Cornacchi Memorial Intersection.\n- **HB 189**: Truck weights bill, with a committee substitute proposed to address concerns.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- Discussion on the need to address infrastructure funding in Georgia and the impact of truck weight changes on road life.\n- Explanation of the committee substitute for HB 189, including a carve-out for the timber and agriculture industries with a 10% variance on the 80,000 lb weight limit until July 2024.\n- Detailed explanation of the tiered penalty structure for weight violations under the proposed bill.\n\n**Votes**:\n- Amendment to HR 256 to include SR 347 passed unanimously.\n- HR 256 passed unanimously.\n\n**Attendance**: Quorum maintained throughout the session.\n\n**Adjournment**: No specific adjournment time noted, but the session proceeded to the next item on the agenda.",
  "transcript": "You\nI had a little grand entrance for BLB,\notherwise known as Brandon Lamont Beach,\nas he walked in the room for those\nif you don't know what the L is.\nI did a little bit of research\nand discovered Brandon Lamont Beach.\nSo, good to see you, Mr. Chairman.\nHow are you?\nWhat'd you do this weekend?\nDid you place a bed on it?\nAll right, fantastic.\nwhat do you all hear for this road naming bill is that we're working on okay well we'll\nget to that one first then we've got a house resolution 256 it is our annual road naming\nbill we think this is the perfect Frankenstein combination of all of the Senate road\nnameings and all of the house road nameings. We did have one request that came in from Clayton County for a removal of somebody who is currently in office, which violates their house rules, so that has been removed from this list.\nI would encourage all members of the Senate to browse through here, make sure that your road naming is here.\nWe will have an opportunity to agree on the floor. Should we miss anything? I'm going to recognize after we have to entertain emotional, entertain amendments.\nSo I will entertain a motion on House Resolution 256, LC393932S.\nA motion do pass from Senator Lucas, so I hear a second, second from Senator Mallow.\nI'll entertain any discussion or amendments.\nSenator Moore.\nThank you, Mr. Chairman.\nAt the appropriate time, I'd like to make an amendment to House Resolution 256 by adding\nSenate Resolution 102 to it and that is the naming and intersection for Sean\nKornaki. Sean Kornaki was a employee of the Department of Transportation who\nwas clearing out a road in northwest Georgia on one of the stormy nights that we\nhad earlier this session and he was working by himself. Unfortunately that\ntree limb fell on him and he passed away in the line of duty and this is\ncoming a little later in session and I was hoping maybe we could we could add this\non if that'd be okay. I think it's Senate resolution 102. I'm not mistaken.\nAll right. I have a motion to have a second second for Senator Gouge. Chair\nand more can you they're telling me that there was not an ad run can you talk\nabout the ad or the conflict check if either of those. To my to my understanding\nThe Department of Transportation actually had a resolution naming the road in the intersection, so there is no conflict.\nI just got to see a thumbs up there from the commissioner.\nDo you know the address or is that not necessary in this instance as well?\nWell, I don't think it's necessary.\nIt's actually Senate resolution 347.\nThat's Sean Cornacchi Memorial intersection of Walker County to dedicate.\nWe have a motion and a second on the amendment. All those in favor, please think about saying aye. All those opposed like sign.\nAmendment carries unanimously.\nWe're now onto the underlying bill in the discussion.\nAll those in favor, please signify by saying aye.\nAll those like sign, motion carries unanimously.\nAnd I'll go ahead and carry this in the Senate side.\nAll right, we're now on to House Bill 189, the truck weights bill.\nI'm going to take a little bit of chairman's privilege here, walk you through our current posture.\nI have had extensive conversations with numerous members of this committee as well as the house sponsor of the bill, as well as the tenant governor's office, and there are not the votes on this committee to pass the resolution as it passed the house.\nSo we have spent time over the last week to 10 days as well as through the weekend, working on a sub that we think will do a number of things and the community members that sub is in your folder.\nBut ultimately we recognize that we're at a crossroads with the executive order that has expired and we also recognize that we're at a crossroads with our funding and some of the other underlying issues that really serve as a backdrop to this entire conversation.\nThe enforcement pieces and a number of other things that we have heard discussed in the two hours or so of testimony we've had on this will be addressed in the sub.\nWe, you'll see a sunset in the, in the sub and the reason for that is we think that we need to have a serious conversation on infrastructure funding in the state.\nGeorgia currently ranks six to last in terms of infrastructure funding per road mile and it's a similar number when you work, look at it on a per capita basis.\nWe're going to get further behind when you consider that a number of states have literally\ninvested billions of dollars to be their ARPA funding or their surplus is over the last\ntwo years into infrastructure and we really have not done any of that.\nWe've moved money around within the program.\nWe've put I think $50 million of money into the baby budget, but we have not done a significant,\nwe've not gone to significant lengths to ensure that we're investing in the much needed\nfuture of our infrastructure.\nWhat we do know is that any truck weight change,\nwhether it's a 5% change,\nas we heard from the Georgia Tech Professor,\nor it's a 40% reduction in the life of a road\nthat we heard from the Commissioner of G.Dot,\nno matter which of those you look at,\na bill is needed to, if we're going to move on truck weights,\nwe need to be responsible and protect the assets\nof the state as it relates to road funding as well.\nSo you're gonna hear a significant conversation\nhappen over the summer into the fall,\nthis year has begun to look at how to address that next year.\nBut in a recognition of a couple industries in particular that we know that have grown\naccustomed to the executive order that expired last week and then really in wanting to\nhonor the House sponsor as well as the Senate sponsor that have some particular needs for\ntheir areas of the state.\nWe have crafted a more tailored bill that we think will address the key concerns but\nwill also keep the conversation open moving forward and with that I would like to turn\nit over to Leader Gooch to walk us through the committee sub.\nThank you Chairman Dolezal. Committee members, if you'll look at LC-39-3928S, we can go through\nthe bill section by section 1. Basically, it's a carve out for the two industries that we have chosen.\nThat is the timber industry and the ag industry. So those are the two industries that will be given\nthis variant. So there will be a 10% variance of the 80,000 pound weight limit. So this will allow\nthose trucks hauling timber products or ag products to go up to 88,000 pounds, it will be allowed\nto do so until July 1st of 2024. So it's dependent on when the governor signs this bill into law,\nthey would have the extra weight provision until 2024, July 1. Section 2 goes into the weight\nviolations and what the penalties are for that and we have it tiered separately than what we've seen before so for the first\n5,000 pounds over weight which is over the 88,000 pounds there would be a 5-cent per pound penalty\nThat's from 88,000 to 93,000 pounds greater than 93,000 pounds\nBut less than 100,000 pounds the penalty is increased to 10 cents per pound\nfor all gross weight and then if the weight of the vehicle exceeds one hundred\nthousand pounds the fine will be twenty cents per pound per pound the twenty\ncents per pound or the ten cents per pound or the five cents per pound would go\nback to the eighty thousand pound limit no different if you had a speeding\nticket today if you were pulled over in the city of Atlanta or back home you may\nhave a 10% buffer in that speed limit. For example, local law enforcement normally won't\nwrite you a ticket for the first 10 miles per hour over the speed limit. But once you exceed\nthe 10 miles per hour over the speed limit, the fines would be based on the total speed that\nexceeds the posted speed limit. Same thing in this bill. So if you're overweight by 100,000 pounds,\nif you have a 100,000 pound weight, your fine would be 20 cents per pound back to 80,000. So that\nthat would be a 20,000 pound in fraction.\nAnd so that's the, the penalties are still for a reason.\nWe've heard from a lot of the industry people in the room\nthat they're okay with the enforcement,\nthey're okay with the fines,\nthey just want to be able to have the extra weight capacity\nto be able to get their products to the market.\nAnd so especially with Ag and Timber,\nwe believe that this is a fair compromise.\nThere is a variance on this up to 88,000 pounds,\nbut it's only within 75 miles of the origin\nof where the product is being shipped from in two.\nSo they would have this provision up to 75 miles radius.\nBridges, similar violations on bridges,\nstarts in the bottom of page three.\nIt deals with the overweight trucks on bridges\nthat are posted, so the fines would be based\non the posted weight on those bridges.\nSimilar the way we do today.\nThe other part of the bill allows for local government law enforcement personnel to enforce the weights.\nIt's no longer going to be limited to the Motor Carrier Division of Department of Public Safety.\nThis bill will allow local government law enforcement whether that city or county police departments and\nsheriff's department employees to enforce the weights.\nAnd imagine they could do that several ways they can use the manifest and the load tickets that are required to be in the trucks.\nThey also could have portable scales on their vehicles so they could pull the portable scales out and weigh the trucks on site just like motor carrier does it today.\nAnd I believe that is all that we have put in the bill, Mr. Chairman.\nEverything else that was in the previous bill is no longer there to add on to your earlier comments. I think it's important that this committee being engaged fully with the business community, the ag community and also the Department of Transportation over the next few years.\nsix to eight months. We have to get this breaking logistics plan implemented, but we have to have lots of money to do it, and we believe that people in this room are going to be a key component of that discussion.\nThank you, Leader Gouge. I want to highlight just a couple of things, either I missed or you missed, and then maybe draw a distinction between existing law and what we're doing here.\nMembers of the committee, if you look on line 17,\nyou'll see mention of outside of a non-attainment area.\nAnd what this does is it basically precludes\nthis variance from being allowed in a non-attainment area.\nWhich, what is that?\nThat's the following counties.\nCherokee, Clayton, Kaweeda, Cobb, DeCab, Douglass, Fayette,\nForsyth, Fulton, Gwynet, Henry, Paul Dean, and Rockdale.\nSo, essentially, Metro Atlanta, this variance will not be allowed.\nWe will revert to existing code in basically the metro-elana area.\nWhat is not included in the 88,000 allotment that is here, or remain at 84, is D-E-N-F\nunder the current code, which is granite, solid waste, or recovered materials, and concrete\nthat is freshly mixed or unhardened for a state of delivery of customer.\nelse moves up to the 88 outside of these attainment areas. The last thing, that I would\njust point out, um, leader that maybe just didn't get to, was 153 to 157, allows local\nlaw enforcement to essentially have probable cause to, um, conduct a, a, a, a, a, a,\nway of a truck on their roads. Uh, we, we've obviously know that we currently have,\nI think that was mentioned a couple hundred people around the state to ensure the enforcement\nand compliance of these provisions.\nWe know that's not enough.\nLeader, I think you told me that local municipalities\ncan purchase the scale for about $4,000.\nIs that accurate?\nAnd so we want to, we were told 16,000 for a set of four.\nSo we want to just ensure that local, the locals whose roads\nwill come under the same variance here\nhave the ability to enforce that.\nAnd with that, I'm going to open up for discussion and questions.\nI'm going to recognize these in the order I saw\nand then come up, Senator Lucas.\nYeah, Mr. Chairman, are you saying those kind of\nexclude, if I run up to $80,000,\nand I get ready to come to a Henry kind,\nI got to get rid of some weight.\nThat's correct.\nOkay, I had one thing to let me remind everyone,\nif you're driving on any interstate highway in Georgia,\nor across the country, the weight limits 80,000 pounds,\nthere is no variance for that.\nThe only exception is if you're bringing a load\nof goods out of the port, and it's on a sealed container, and it's an invisible load.\nSo in other words, you're going to leave Savannah's port, and you're going to drive to anywhere\nin Georgia or outside of Georgia, as long as you don't stop and break that load, you're\nallowed to go up to 100,000 pounds, but it's primarily on interstate routes.\nWell, I'll stay at the only exception.\nI understand that, but also you're saying that dump trucks are excluded from the tonnage\nbased on this bill is our agriculture.\nWell, what about when you're doing the highway, is the folks that fixed the highway, we\ntook my payload too.\nYes, so the dump trucks are in this bill to remain at the 84,000 pounds that they've been\nout for the however many years prior to the executive order.\nOkay. It looks like Senator again, Chairman again.\nThank you, Mr. Chairman.\nTwo things.\nIn the 75 mile radius,\nthis is my down foot truck,\nand I love this,\nthis Mr. here,\nand he might be able to test it.\nBut every time,\nwhen somebody can't go across the bridge,\nthey've got to get outside\nin the 75 mile,\nand hopefully,\nthe situation will have.\nAnd we have a lot of bridges\nWhen I read the word radius, I do it from a straight line, so if you put the pen in the\ncenter and you draw a 75 mile radius in a circle, then that's your radius.\nHow you get there is up to you.\nI would suggest you talk very nicely to the enforcement officer that has you pulled over.\nSo for me, I noticed that this bill is small, and I was just saying, or any agency of state,\njust looking at scales where these products are being delivered, is that right?\na one-year timeout is to help the ag community and the timber industry to continue what they're\nused to doing for the last two years under the executive order. And so it gives us time as a\npolicy board to get together with our Department of Transportation and everyone in the industry\ncome together and try to solve a major problem that we're facing in this country and that is the\nheavy trucks but also the congestion on the highways in a growing state like ours with the fastest\ngrow important in the nation. We have to upgrade our infrastructure and it has to start with the\npeople on this room. We are not talking about that in this bill. Just to be clear for the committee,\nyou're referencing the actual private entities, they're doing weights at a timber location that we\nWe heard testimony about whether we have access to those scales, we can work with them, we know we have heard from them last month, and we can talk to the fan actors that are going to exercise, they don't have that level of importance, you may need to have a truck that will hurt 30,000 women and families.\nI believe with the extra enforcement by law enforcement at the local level that we will start to identify who some of the bad actors are they're going to be on secondary roads, they'll be on some of the state routes and when the sheriff's department and the police department start to pull them over and they can show\nthat there's bad actors in the room, they'll be signed, they'll be fined accordingly and they'll have to go to court and they'll have to pay very excessive fines.\nChairman again, I believe Chairman Anne of Attarte was nice.\nNo?\nI'm sorry, that's Senator Mallow.\nWell, Senator Beech was first on that way.\nGood.\nGood person.\nThank you, Mr. Chairman.\nAnd to the members that worked on this substitute,\nI really do appreciate you and the work that you've done here.\nMy question is it relates to the collection of the fees\nfor enforcement.\nIf these folks are going to be on state roads,\nis it going to be the local governments that collect the fees\nas the state collect the fees.\nWhat does the revenue go from the increase in citations?\nBecause I just have a question about that.\nI didn't see where it was spelled out.\nThere are normal traffic citations.\nIf Georgia State Patrol pulls you over,\nthat goes to the local jurisdiction that handles that.\nSo I just want to ask that question for clarity\non the fees.\nMy interpretation, talking to the legislature,\nas both portions of the fees will go to the state, portions will go to the local governments.\nSo local governments will get the fine revenue for the tickets that are issued by the local\ngovernments.\nIn the public safety personnel, I believe, are adjudicated by the Department of Administrative\nServices.\nSo that fine money will continue to go where it goes.\nOkay, that's Chairman Beach.\nThank you, Mr. Chairman.\nI want to thank you as chairman and leader Gooch and really the entire committee for having\ninput on this committee sub.\nI think it's a good compromise.\nI think that it's great that it's sunsets in one year and we need to do this now so that\nwe can continue with the governor's executive order playing out.\nBut I think what we need to do and I think the reason it's important that it's sunsets\nis leader Gooch said we've been studying freight logistics for four years and this needs\nneeds to be part of an overall comprehensive freight and logistics program and how we\nfund freight and logistics and move freight and logistics through our state and yet protect\nour roads and our infrastructure.\nSo I think this is a good compromise, it's a good start, and I would be willing to make\na motion at the proper time, Mr. Chairman.\nI can chair and be a chair, any other discussion from the committee?\nI don't see any, any other lights illuminators, this would be the appropriate time.\nOkay.\nmove, do pass, LC393928S.\nWe have a motion, do pass, we have a second, Senator McClellan.\nAll those in favor, please signify by raising your hand.\nI've got seven in favor, all those opposed, like sign.\nOne, two, three, four.\nMotion carries seven to four.\nThank members of the committee, welcome Mr. Chairman.\nYou're just in time for us to adjourn.\nSo this meeting isn't adjourned.\nAre you going to carry this in the Senate?\nRuss Goodman is going to carry it.\nOK.\nYou\n",
  "updated_at": "2026-02-12T10:42:16.17511+00:00"
}