{
  "video_id": "jU7KMO0b724",
  "url": "https://www.youtube.com/watch?v=jU7KMO0b724",
  "title": "11/29/2023 Sen. Gloria Butler and Senate Democratic Caucus Press Conference",
  "chamber": "senate",
  "session_type": "press",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Overview:\nThe Georgia Senate Democratic Caucus held a press conference to discuss their proposed Senate redistricting map, which they claim complies with the court order to address Voting Rights Act violations in the previous map drawn by Republicans. The Democratic Caucus argues their map creates two additional majority-Black districts in the affected areas, while the Republican proposal fails to adequately address the court's findings.\n\nKey Actions:\nNo specific bills mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Senator Jones criticized the Republican map for continuing to \"dilute the power of African-American voters\" despite the court order.\n- Senate Minority Leader Butler argued the Democratic proposal fully complies with the court order by drawing two new majority-Black districts in the affected areas, while the Republican plan does not.\n- The Democratic Caucus claimed the Republican proposal simply \"shuffles\" voters around without meaningfully increasing Black voting power as required.\n\nVotes:\nNo votes mentioned.\n\nAttendance:\nNo quorum notes.\n\nAdjournment:\nNo adjournment time provided, as this was a press conference, not a legislative session.",
  "transcript": "I'm State Senator Harold Jones, the second current whip for the Georgia Senate Democratic\nCaucus.\nIn a few minutes, as you know, we will begin a special session focused primarily on redraw\nand Georgia state legislative congressional maps.\nAs you know, this is the second legislative session we have for redistricting in as many\nyears.\nThe reason we gather here again today at additional taxpayer expense is because within\nIn General Assembly Met in 2021, Republicans passed legislative and congressional maps that\ndiscriminated against minority voters.\nIn that special session, Democrats pleaded with Republicans to acknowledge that all the\ngrowth in Georgia's population over the preceding decade have been driven by residents of color\nand have the new maps reflect that reality.\nUnfortunately, those pleas were ignored, and here we are.\nproposals of fair maps that complied with the Voting Rights Act were rejected. Instead in 2021,\nRepublicans passed maps that sought to cement political power for the coming decade\nat the expense of minority voters. These are not my worries, but the words that actually come from\na federal court opinion in an exhaustive comprehensive 516-page order which states that the legislative\ncongressional maps passed in 2021 violated section two of the Voting Rights Act. It diluted the\npower of African American voters by not providing them with an equal opportunity to elect their candidates\nof choice. Specifically, the court identified Senate districts 10, 16, 17, 25, 28, 30, 34, 35, 43,\nand 44, as areas in which the enacted plan violated the Voting Rights Act. To remedy this\nviolation the court ordered the state to an act in a map that has two additional\nmajority black districts in South Mesro-Atlantic.\nUnfortunately the Republican proposal for the Senate fails to do that and fails to comply\nwith the Voting Rights Act, fails to comply with the judge's order, and continues to dilute\nthe power of African-American voters.\nHowever, the Georgia Senate Democratic Caucus has proposed a map that complies with the\ncourse order can pause with the voting rights act.\nNow I will turn it over for Senate Minority Leader Gloria\nButler to continue to talk about efforts from this point\nforward.\nGood morning, everyone.\nThank you, Senator, for so many words.\nAs we did in 2021, yesterday, Senate Democrats\nreleased a proposed Senate map that complies with the Voting Rights Act.\nBut more importantly, it complies with the Court's order, given the General Assembly,\na second opportunity to do the right thing.\nThis is the map that should be adopted for Georgia's Senate District.\nIt does exactly what the order demands by drawing two additional majority black districts\nin the area where the court found violations\nof the Voting Rights Act.\nSpecifically, the 16th and 17th districts\nin the Democratic proposal are new majority black districts.\nAs my colleagues, Senator Jones stated,\nthe courts order identifies an area\ncovered in 10 Pacific Senate districts\nwhere black voters do not have an equal opportunity\nto elect the candidate of choice.\nTherefore, that's where the Democratic proposal starts and ends.\nAll the proposed changes in the Democratic proposal\nare to those districts and only those districts.\nIt's within the area where the Court\nfound Voting Rights Act, violations that the new majority black, 16th, and 17th districts\nexist.\nThe Democratic Proposal Friends almost 150,000 black residents that currently live in non-majority\nblack districts in the affected areas into majority black districts.\nAs to the remaining 46 districts in the current Senate map, they remain exactly the same\nin the Democratic proposal. In short, Democrats did what the Court ordered within the confines of the Court's order.\nUnfortunately, the majority's proposal fails to do so.\nThe majority's proposal is a share game that continues to dilute the voting power of Black voters.\nto start in order to try and obscure what it is doing,\nthe majorities propose a reassign the district numbers\nof multiple existed incumbents.\nBut at the end of the day, they can't have the continued dilution\nof black voting power in the plan.\nIn the Pacific area where the court found Voting Rights Act violations,\nThe majority's proposal moves almost as many black residents out of existing majority black districts as it moves into majority black districts.\nI need to say that again because quite frankly it's shocking.\nThe majority's proposal moves almost as many black residents out of existing majority black districts\nin an affected area as it moves into majority black districts.\nEssentially, the new proposal does nothing.\nNothing to improve the voting power of black voters\nin the areas in which the court found\nVoting Rights Act violations.\nTo mask this failure, the Republican proposal\nconsolidates black voters in the core\nof Metro Atlanta for the Court not find any existing voting rights at violations.\nBut this does not comply with the Court's order.\nRather, it ignores the Court's finding on the dilution of black voting power.\nIt's for these reasons that we encourage the General Assembly to stafffully consider\nand adopt the Democratic proposal that fully complies with the courts order.\nThank you so much for being here this morning.\nIf you have a few questions, we'll be happy to entertain you.\nThe leader Butler, I would like to hear from two of the affected families of St.\nI didn't hear you, hear you, hear everything you say.\nHow possible would you hear from it,\nto the center, to the fact that by the drawing,\nis that the center, is that the center?\nIs that, should that be for this whole?\nYeah, I think so.\nThere actually are 15 districts extensively redrawn\nunder this proposed Republican plan.\nThe court order specified 10 districts\nas being problematic and violative\nof the Voting Rights Act.\nSo there are many, many more Georgians shifted around\nunnecessarily under the Republican proposal,\nwhich, as noted by the leader, directly violates\nthe Voting Rights Act and the court's order\nby engaging in a shell game, moving some voters\nand numbers around, but not at all providing any additional,\nor very, very few additional block voters\nwith the meaningful opportunity to elect the candidate\nof their choice.\nDo we hear about how specifically we were different from what we were doing?\nAnd how they do a thing on the other side?\nChanges were made in certain areas to attempt to make it seem as though additional block\nvoters were being provided an opportunity to like the candidate of their choice.\nThose, however, are outside the affected area where voter dilution and discrimination\nwas found.\nThey're simply in a totally different part of Metro-Atlanta, and therefore they do not\nremedy, the Voting Rights Act violation that the court found. Therefore, they continue to\nviolate the Voting Rights Act and they also violate Judge Jones' order.\nGood morning, I'm such and Bargis Council for the Georgia Senate Democratic Caucus.\nIt plainly violates the court's order.\nThe court specifically identified those two districts as part of the vote dilution area.\nI won't speculate as to why the majority chose not to do that, but it is in plain violation\nof the court's order.\nLater, what do you want to come to do?\nWhat do you want to come to do a role\nat least during this special session?\nMy role?\nYeah.\nCan you just advocate for, is it?\nI am going to present our plan in committee.\nI don't know how far it would get,\nbut if it comes out in committee,\nthen I would present it on floor.\nThat's my role.\nDo you think if your plan does not advance out of committee,\nthat it will be an important part of argument\nand important path of possession as ever?\nYou know what?\nI'm hoping that the judge is watching us and looking at our plan\nand knowing that it is the best plan.\nI would be over the moon if the judge could recommend\nthe Senate Democratic Caucus Plan.\n",
  "updated_at": "2026-02-12T20:16:48.831073+00:00"
}