{
  "video_id": "jz2RwuMi-TY",
  "url": "https://www.youtube.com/watch?v=jz2RwuMi-TY",
  "title": "Rules meeting day 26 2025 session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 41,
  "summary": "Here is a summary of the key points from the Georgia Rules meeting day 26 2025 session:\n\n**Overview**: This session featured discussions and progress on several bills, including measures related to property ownership, school infrastructure, disabled parking, autism alert systems, and school personnel benefits.\n\n**Key Actions**:\n- **HB 399**: Requires out-of-state property owners with more than 25 single-family homes to have a Georgia real estate broker or representative.\n- **HB 563**: Allows licensed physical therapists to verify individuals for disabled parking permits.\n- **HB 465**: Establishes a missing autism alert system through the GBI.\n- **HB 127**: Increases the number of personal days teachers can take from their sick days from 3 to 5.\n\n**Bills Introduced (First Reading)**: No new bills were explicitly mentioned as being introduced.\n\n**Notable Moments**: \n- Discussion around HB 647, which would annex 45 parcels into the city of Mulberry, with some disagreement between the representative and county commissioners on the level of local support.\n- Procedural discussions around the process and timeline for creating new cities.\n\n**Votes**: Bills HB 399, HB 563, HB 465, HB 127 were all described as having no questions and moving forward, implying they passed.\n\n**Attendance**: No specific quorum notes were provided.\n\n**Adjournment**: The transcript does not indicate when the session adjourned or the date of the next scheduled meeting.",
  "transcript": "Morning. Is that time of the year? And what we get started, we're going to ask\nChairman Jasper's if you would with the opens for the word of prayer, please.\nThank you, Mr. Chairman. It's all by our heads, please.\nHeavenly Father, thank you for this upcoming week and that most importantly,\nthanks for the glorious weekend we just had. You know, Heavenly Father,\nplease be a presence in our lives as we go through this week.\nPlease give us patience, kindness, and wisdom,\nbecause we certainly will need it.\nAnd for our friend Terry England, Lord, thank you\nfor your healing hands around him and his progression.\nAnd we work in your word and your name today, Amen.\nThank you, Jim.\nOkay.\nLet's get started.\nActually, Mary Margaret Oliver.\nI bring your attention to House Bill 399 that's at the very top of page 5.\n399 comes to us from the Government Affairs Committee that has had a good discussion\nabout the phenomena of out-of-state property owners buying significant numbers of single\nfamily homes.\nAnd House Bill 399 is one step forward to require that an out-of-state property owner that\nowns more than 25 single family homes must have a Georgia real estate broker or\nand or a person in Georgia. We need a presence in Georgia for this\nsignificant phenomena of purchase taking away the limited supply of single\nfamily homes. We had a good hearing about the significant percentages of\nsingle family homes that are purchased all over Atlanta is a national\ntarget. This is a national issue and I am pleased to bring you this modest reform forward\nthat will assist our families, purchase single family homes that at least know, at least\nknow who is the owner and who is responsible for the repairs.\nOkay, don't see any questions. Thank you, ma'am.\nThank you.\nYes, ma'am.\nGood morning, Mr. Chair. And thank you. Thank you, committee, for allowing me to present my bill, which is\nwhich will establish a three year pilot immersive writing program and grant funding for all public school students in grades two to five to participate.\nThe writing program aligns with the current writing standards established by the State Board of Education and can be integrated into the existing curriculum.\nIn addition, this bill requires playgrounds be included in all new school constructions in order to address the physical, sensory, cognitive, social, emotional,\nand communication needs of students.\nOkay, don't see any questions, thank you, ma'am.\nYeah.\nRepresentative Neil.\nThank you to the chair, thank you to the committee.\nToday I bring to you House Bill 229.\nThat's going to be on the very back page of the document.\ndocument. All this bill does allows for local school districts who have e-splossed capital\nbuilding projects to have their local sales taxes exempt when they purchase construction\nmaterials. This just allows for school districts to save a few dollars during their development\nwhich they can reinvest in their communities later. And with that, Mr. Chair, I ask for your\nOkay. I don't see any questions. Thank you.\nYes, ma'am.\nGood morning, Mr. Chair and to the members of the committee.\nI present to you today House Bill 563, which is found on page 6 at the bottom.\nThis bill will allow for licensed doctors of physical therapy\nto verify via affidavit for an individual\nto receive a disabled parking permit\nand as stated in the bill to obtain special vehicle decals\nis the proper term.\nLicensed physical therapists would join in\nwith licensed chiropractors, licensed optometrist,\ndoctors of osteopathic medicine,\nand licensed doctor of pediatric medicine.\nPhysical therapists are highly trained and qualified\nto identify, recognize, and treat movement disorders\nand rehabilitation as well as habitation.\nI ask for your favorable consideration\nof House Bill five, six, three.\nThank you, Mr. Chairman.\nThank you, ma'am.\nDon't see any questions.\nLet's leave a deal here.\nThank you, Mr. Chairman.\nmorning, I'll be reading, uh, getting, presenting to you House Bill 465, the substitute on page 5 down to the bottom.\nThis is a substitute because we had the privilege of working with the GDI on this saving life's bill. It is the missing autism alert bill.\nWe've had a lot of unfortunate family members that have either been\na casualty or suffered missing or gravitating to roads or waterways.\nSo this will be an alert system directed through the GBI and we hope that it will\nsave lives. Mr. Chairman, we ask for your favorable consideration on House Bill 465.\nThank you, sir. I don't see any questions. There's two cocks.\nThank you, Mr. Chairman. House Bill 127 is page one, the last one on the page. This is a teacher,\na teacher bill, and a school personnel. Currently, they earn 1.25 days, sick days per month,\nwhere three of those days can be used for personal days simply changing the\nthree days to five to encourage our teachers for additional personal days\nthat they can use from their sick days. Nice for your favorable consideration.\nOkay, don't see any questions. Thanks, sir. Mr. Chairman.\nThank you, Mr. Chairman, members of the committee, 4th page, level 1 down, House Bill 351.\nAll right, thank you, everybody's there.\nWhat we're doing with House Bill 351, AC443100S, the sod of waste handling facility permitting\nhas long been a source of litigation.\nThis litigation is intent to revise the Solid Waste Act to remove provisions deemed unconstitutional and just clarify responsibilities of public hearings who's required to do what for the county, the EPD is just keep us out of lawsuits and save money.\nSo that's the intent of House Bill 351.\nOkay, I don't see any questions you got another yes, I do house bill 371 14th one down on the fourth page\nAnd it's LC 492236\nAll right under the quality basic education act all we're doing here. We're just increasing the state's\nmaximal authorization\nFor capital outlay funding from 300 million to 375 and I said maximum\nWe can appropriate less than that, but not over 375.\nThat number has not been raised since 2007.\nAnd will it not take effect until 2027?\nWould rate of inflation alone since 2014 is\nwhen it's over 33%.\nSo this just trying to get us back in line\nwith what actual construction cost are today.\nOK, don't see any questions.\nThank you, Chair.\nThank you, Mr. Chair and members of the committee.\nYes, ma'am.\nGood morning, Mr. Chair, members.\nToday I'm here to bring House Bill 647.\nThis bill is annexing 45 small parcels into Mulberry.\nOh, it's, let me tell you the page.\nI believe it's on page seven.\nThis bill is annexing 45 small parcels into Mulberry.\nAll of these parcels are in my district.\nThe commissioners we have been told will not be opposing this bill.\nThe commissioners would win it.\nOkay, you have a question.\nThank you, Mr. Chairman.\nDoes the general lead a yield for a question or two?\nI do.\nSo that is not my understanding that Gwyneth County commissioners are supportive of this bill.\nMy understanding is that they're in ongoing negotiations.\nIs that not true?\nThat is not something I am aware of.\nI had a discussion this morning and was told that they were told the commissioners were\ntold that it was in their best interest just to allow us.\nAgain, not what I've heard from the representative of Gwyneth County who I spoke with this morning\nas well.\nIsn't not true that as we have some local annexation bills that this bill provides\nno opportunity for residents to say whether or not they would want to proceed and may\nmay also lack local control and transparency\nhad it's currently drafted.\nMulberry is brought about because the people\nwanted to have more control.\nSo I would say that that statement is not true\nbecause that is why it was brought about.\nThe people want more control.\nControl over what is going to be done there.\nOne final question.\nIs it not true that the creation of the city of Mulberry\nwas privileged to the extent that it did not follow\nthe traditional two-year timeline that it takes\nto create new cities?\nAnd which again, I remain concerned in which again, we are seeing these unilateral actions\ntaken without full agreement and an opportunity for transparency in the people to provide input\nand to significant actions that may affect both Gwinnett County, second largest county\nin the state and the city.\nSo I would say that this city was taken to a vote.\nIt was passed by a large number of people, so I would have to disagree with that.\nOkay, you have another question, boy.\nThere's a more.\nDo you have a question?\nOh, I mean, I'm sorry, Mr. Chairman.\nThank you, Mr. Chairman.\nI did have a question for the bill sponsor.\nDid this bill have bipartisan support\nwithin the local Gwinnett County delegation?\nBecause it is strictly in my district\nand it was assigned to general, to be a general bill,\nI have spoken with some of the members, but I did not discuss it as a vote.\nOkay, but so to your knowledge, last question, do any democratic members of the Gwinnett County delegation support your bill?\nI have spoken with two that have said that they are not concerned with it, that they're not concerned with it.\nThe other one said that he's going to make a statement regarding the bill.\nThank you.\nOkay, I don't see any other questions, thank you.\nMr. Chairman, members of the committee, I have three bills I spoke to you about before.\nHouse Bill 298 was something to help our nurses, House Bill 320 was something to help\nour environment and House Bill 432 on the fifth page, the Eliturkey Conservation, Bill\nI'm here to present today is House Bill 482 at the bottom of the fifth page, which\nIt codifies a practice of allowing judicial officers in circuits that have over 15 superior court judges.\nOkay, you don't see any questions.\nThank you.\nThank you, sir.\nThank you, sir.\nJim?\nJim?\nThank you, Chairman Parrish.\nMembers, out of the committee, I come to you first with House Bill 175.\nThat's second page eight down.\nThis is an apartment bill, decal is basically, I'm working with decal to get them in line with the federal requirements set out by the FBI around background checks.\nToday, in the past year, they do about 70,000 a year to keep our youngest safe.\nAnd this goes through the entire ecosystem of every individual that would be, quote, involved within the decal organization statewide.\nThat's the summary of the bill, sir.\nI don't see any question.\nYou have another one.\nYes, sir.\nHouse Bill 652, 11 down on page 7.\nThis is also a cleanup bill in some way, but not a department cleanup bill.\nAs you recall two years ago, Chairman Jasper's was the sponsor of an EV bill that did a\nmyriad of different things, including an excise tax.\nThis bill, working with Chairman Jasper's, we would basically exempt one charitable organization\ncalled the Ray, which is an experiential organization that does transportation, I'll say work in\nadvanced modalities. And they had put in an EV charger over 10 years ago that is exclusively\ncharge or it provides electricity from a solar array, not from the grid. It's on the federal\nright of way and it does not charge and it does level three charging at about 175 kilowatts an hour.\nWhat we're asking for in this bill for them to be exempt. And one of the clarifications that we\nhere in order to not open up Pandoora's box was to make sure there was an\noperation by January 1 2025. That's the summary Mr. Chairman. Okay, don't see any\nquestions. Thank you, sir. Yes, sir. Come on up.\nGood morning. Thank you, Mr. Chairman and to members of the committee. Today I am\npresenting House Bill 335, which is on page 4 and this is 6th from the top.\nHouse Bill 335 raises awareness of mental health resources available to student athletes and requires coaches to annually review materials and guidelines about mental health risk.\nThere's no cost associated with this and the implementation of this bill would mirror that of current concussion and cardiac arrest protocols.\nIt's fully supported by the Georgia High School Association.\nOkay, don't see any questions on that.\nYou have a resolution for us also.\nYes sir, thank you very much.\nI do have a resolution that's on page seven\nand it's the eighth from the bottom.\nHouse resolution 130 is legislation to compensate\nMrs. Cedric Moore, who was wrongfully convicted\nfor 21 years for a crime that he did not commit.\nModern DNA testing revealed that Mr. Moore was not\nthe culprit of the act committed.\nThus, the charges against him were dismissed\nand he was officially exonerated.\nMr. Moore had no prior criminal record\nand he hasn't been a model citizen since this release\nand so I asked for his body's favorable consideration.\nOkay, I don't see any questions.\nThank you.\nThank you.\nThank you, the members of the committee.\nReaction of Townsend.\nMore Mr. Chair, thank you very much.\nIf you turn to page, top of page three, House Bill 235,\nit is LC492305S.\nBasically, this is a cleanup from a bill a few years ago.\nIt's the George Education Living Donor Educators Act.\nIt allows pay time leave off for secondary,\npost-secondary teachers and full time staff employees\nto donate an organ and have received that pay time leave.\nOkay, don't see any questions. Thank you, sir.\nOkay.\nChairman Golly.\nGood morning. This is House Bill 522. It's on page 6,\nmiddle of the way down. What this bill does is it prohibits\norgan transplant centers from discriminating against organ transplants\nrecipients based solely due to their COVID-19 vaccination status.\nIt's a bill we passed last year, got hung up in the Senate, and I think we're going to try it again.\nOkay.\nDo have a question for you.\nLady Hughley, is that your...\nOkay.\nThank you, Mr. Chair.\nCan you tell me why we need this bill?\nWhy we need this bill?\nYes.\nWell, even lately, so COVID, we feel like we're behind this a little bit, even lately.\nLately, January 13th, there's a news article,\nmom declined second, COVID shot,\nand now Dartmouth Hitchcock is denying her transplant.\nFebruary 14th, child refuse heart transplant\nover vaccination status, it's really the COVID-19.\nThis happening today, COVID-19 vaccination\nis something that is continuing to get pushed\nby some of these organ transplant centers,\nbut I think there's a number of people who rightly so,\ndon't wanna get vaccinated for it.\nI got vaccinated for it, I'm not an anti-vaxer,\nBut I think it's become a political thing and you have a right to get an organ transplant\nI believe and it should be based on COVID-19 status.\nIsn't it true that I just went through a heart transplant with my brother-in-law and\nthey have to have those vaccines done so that they can move forward with the work to make\nsure that they're not going to be somehow compromised because of the cost associated with these\norgan transplants. I'm very concerned about what you're proposing here because we're\ndabbling in the practice of medicine even more than what we normally do.\nWell I think I'm sorry to hear I hope that they're healing and I hope that I'm on the\ngood end of that transplant. This is not something that we're dabbling with medicine.\njust saying, the only criteria that you cannot be excluded from is COVID-19 vaccination.\nAnd not all centers do it today, only some centers, so I think that shows that it's not such\na dependency.\nThis is important that you have viability of the organ receiver.\nYou want those organs to, they're very precious.\nYou want them to be used for the right people, and for people who are going to succeed\nand I don't think, or who have a vaccination is a hindrance to that.\nOkay, you have another question, Mr. Miller.\nThank you, Mr. Chairman.\nSo to your last point, to the sponsor, to your last point, isn't it a fairly complex\nassessment about what kind of patient is appropriate for organ donation period?\nYes, for sure.\nOkay, and so medical professionals do they not have a whole list of things that a person\ncannot do in order to be qualified for an urban transplant, correct?\nI think it's holistic.\nThere are certain people just because you have your diabetic doesn't mean you're excluded\nfrom getting a transplant just because you're just because you were a drinker in your life\ndoesn't mean you're excluded.\nI'm just trying to say just because you don't have your COVID-19 vaccination solely based.\nYou can have other reasons that you don't get that that that transplanted on qualify, but specifically to the COVID-19 vaccination.\nOne more question. Is it not true that if a patient does not survive due to the illness that the organ that has been transplanted into that person cannot then go to another person?\nDo you understand my question?\nSo basically if you guys if you receive a transplant and you pass away that same organ can't be used again, is that what you're saying?\nfor a correct, for an MU-compromised person.\nBut I think there are a lot of vaccinations out there.\nJust the COVID-19 vaccination specifically\nas a sole discrimination factor.\nIt's about the sole discrimination factors.\nIf you have problems, most likely there's other discriminating\nfactors that would not allow you to have a building transplant.\nThank you.\nChairman Hawking, do you have a question?\nIsn't it true that COVID has so many variants now\nthat the vaccine you may be given today\nmay not be effective in two weeks?\nAnd this is one of the reasons you're bringing this bill.\nThat's correct.\nThank you.\nChairman Martin, you got a quick question.\nJust a quick question.\nI think a gentleman explained it, but I just want to, again,\nyou would, if you had comorbidities,\nif you had drank a lot and you had diabetes\nand you had other things and you had the COVID shot,\nyou could still be denied because of the COVID,\nThe total of it all you just are trying to do the one simple thing doesn't take you off\nthe list.\nThat's right.\nThat's right.\nThat's right.\nThanks, sir.\nThank you, sir.\nHere in the bar.\nThank you, Mr. Chairman and members of the committee, bringing you House Bill 224.\nIt's on the second page, second from the bottom.\nThis is a piece of legislation that was brought to us by the leadership of Fort Stewart.\nIt would simply allow the state of Georgia through GDOT to enter into a regional governmental\nsupport agreement for the purposes of doing work on our military installations.\nNo costs to the state.\nThis would simply allow vendors through the DOT to do work on our installations.\nIt would help get that work done faster more efficiently, and there is an economic benefit\nto our state vendors for that.\nDon't say any questions.\nThank you, sir.\nI think Mr. Chairman, many, many members, come on in.\nI have HB 575 at the top of sheet 7.\nIt's a Georgia DOT department bill.\nIt has four sections.\nThe first section essentially gives the DOT a little bit more flexibly.\nFlexibility due to newspapers not being printed daily now.\nsomeone will go once a week so that gives them a little more flexibility on\nposting it doesn't change how the two postings they already have for public\nhearings. Second section gives the department the ability to negotiate with\ncondominiums for only common areas and so it gives them the ability just to\nnegotiate with the condominium associations. Third section codifies the\nDOD trip program and essentially what that does is let some paid bonuses far\nare picking up a tractor trailer, 16,000 pounds an hour over to get them out of the road\nand get the roads open faster on the interstates.\nAnd the fourth section gives the department a head start on getting utilities moved on\nthe widening of state road projects so they can get ahead and start and get the projects\ngoing faster.\nI'll stand for any questions.\nOkay.\nDon't see any questions, thanks sir.\nThank you, Mr. Chairman.\nHere we can.\nThank you, Mr. Chairman.\nI have House Bill 12 LC number 499-002S.\nHB 12 passed the House nearly unanimously last year.\nAs a quick refresher of what HB 12 does is simply lower the threshold\nfor equalization eligibility from 14 mils down to 10.\nIt doesn't change the formula for equalization, it doesn't change the formula for QBE.\nIt doesn't change the local 5 mil share requirement.\nIt would allow, allow, not require a local school system that receives equalization to simply roll back their milledrate over time to a new minimum threshold of 10.\nThe bill also includes a penalty provision for those school systems who sometime in the future might roll back their millage under the new proposed threshold of 10.\nThere is no penalty in the code as of today.\nthis bill has a 25% penalty on equalization\nif a school system rolls back under the new proposed threshold.\nI appreciate the help from Chairman Erwin\nin the speak of pro-tim and crafting language.\nThat's the bill.\nI'm happy to answer any questions.\nOK.\nI don't see any questions.\nThank you, Mr. Chairman.\nOK.\nAny members of the committee have requests?\nOkay, you've got several Chairman Stevens.\nThank you, Mr. Chairman, on page five,\nat the bottom of the page, House Bill 473,\nis the department, drugs and narcotics,\nand the board of pharmacies, annual update bill.\nDrug update.\nIf you have a question, raise your hand,\nI've got several lives, blanking, okay?\nNo questions, thanks sir.\nI've approved ten.\nThank you, Mr. Chairman.\nI'd like to ask the committee's favor,\nfavorable consideration of House Bill 614 that's halfway down page 7.\nIt would prohibit the use or ignition of consumer firework within a hundred yards of a commercial\nfacility housing equines in a confined area.\nIt would add this use to a long list that's currently in law restricting fireworks within\n100 yards because of a danger to the people who work with horses and the horses themselves.\nOne difference between this use and any other uses that are fit this category of 100 yards,\nit would require the passage of a local ordinance by the city or county to put it in effect.\nSo it would not go in effect anywhere in the state without a local ordinance and the local\nordinance would allow for special use permits, even if they put the ordinance into a fact.\nOkay, no questions. Thank you. My share, Leverett.\nThank you, Mr. Chairman. I have two new bills on the blue sheet. One is on the first page.\nIt's the second one in the modified structure rule section. It's House Bill 37 came out\neducation committee it would just require local school systems to notify employees if the school\nsystem would hold Social Security and not. School systems are exempt and some many of them across\nthe state do not and the number of employees have had unfavorable surprises upon retirement. So\nwe're just trying to make sure that they're made aware of that. The other bill is House Bill 339\nand that would just the titles will misleading because of the perceptions that would exempt\nrideshare drivers from the Motor Carrier Act have been removed.\nThat was in response to a court of appeals decision.\nNow the only thing remaining in the bill is the final section would simply confirm the\nexisting law that those drivers, that the rideshare service doesn't have the\ncarious liability for the acts of the drivers because they're independent\ncontractors and those are the two buildings, Chairman.\nOkay, don't see any questions on those two bills.\nOkay, Chair Lee Cooper, you have a request.\nThank you, Mr. Chairman.\nYes, sir.\nThat House Bill 91 on the first page.\nIt's the one on specialty vets.\nAnd it's the one that had a scribbner error.\nAnd it's been corrected.\nAnd it was already slated to be on the floor for a vote.\nAnd I would ask that it be put back.\nThank you.\nOkay.\nThank you.\nDon't see any questions on that 91.\nChairman Hawkins.\nThank you, Mr. Chairman, the top of page 4, 322, the board of dentistry issuance of a dental license\nNot including dental hygiene. What number is it? 322, okay\nTop page 4\nThis is teaching license for sole purpose of teaching foreign\nWell, these will be foreign faculty right now our clinical faculty stands at only 80%\nat MCG. Then the second one on top of page 7571, this is bill we had last year, dealing\nwith radiology assistance. It was left on the table that in the Senate, this involves\nactually access to care, increasing availability of radiological images being read.\nOkay. Do you have a resolution, also?\nI could. 72.\nI don't know where it is on here, but yeah, that's for the Cancer Coalition Study Committee on Cancer Care.\nYeah, first page.\nOh, yes. Okay. Thank you.\nAppreciate that, help.\nOh, okay. I don't guess we have any questions about that. Okay. Chairman Powell.\nThank you, Mr. Chairman. I've already asked for 24745467. Today I'd like to ask on the yellow\nsheet House Bill 651. This is a bill that cleans up the contentious issue that we've\ndealing with the red light of the speeds on camera bill. This puts very strict\nparameters around these these devices gets back to the original purpose of the\npublic safety and I'd be glad to go on to develop it just briefly. It puts\nspecific times that they can run these cameras have to have flashing sight\nflashing signs that give the speed of the oncoming vehicle and then where the money\ngoes is divided that half of any of all these fines will go back to the public\nschools in that district for schools. Okay. I have a question for you. Jim Stevens.\nThank you, Miss Chairman. Just curious I hadn't seen the bill yet but is there\nany penalty for the camera manufacturers for these defaulty cameras that may\nsend out a bill that's an error. Well under the current law and no there's not\nbecause under the established legislation, current legislation, the local police\nauthorities are supposed to review those citations. Something that I don't think\nis always about practice among these folks. So when somebody gets tagged with one of\nthese speeding violations, that police jurisdiction is running these and authorizing these, they're\nsupposed to review them before those citations go out.\nI'll also say one of the things that we've done is clean up some of the existing state\nlove of saying that most people don't realize, but we have always had a policy in the state\nof Georgia on radar, in your radar device, you've got to be running more than 10 miles\nover the speed limit for that radar to kick in on the leisure of state control.\nAnd we have access, but that in there and cleaned up a lot of the local legislation that deals with this so that 25\nactually means 35.\nOkay, don't see any other questions.\nThanks, sir.\nChairman Newton.\nThank you, Mr. Chairman.\nOn the back page, under structure rule, House Bill 144 deals with how we train physicians and our\npractitioners and PAs, it's important that they get outside the tertiary care hospitals\nto get their training. This continues and reauthorizes a medical preceptor program. It expands\nit a little bit to include dental students and dentists as well to be included along\nwith physicians, nurse practitioners and PAs.\nOkay, don't see any questions. Thanks, sir.\nhere in Dempsey. Thank you, Mr. Chairman. On page 7 about midway down, House Bill 612.\nThis will add a member to the Behavioral Health Coordinating Council, specifically the Commissioner\nof Insurance, and will also establish a parity compliance review panel within the Council\nto help address the challenges we are still facing and parity between mental health and\nOkay, I don't see any questions on that.\nThank you, Chairman Irving, is that you?\nThank you, Mr. Chairman.\nI'll also on page seven about halfway down HR 145,\nwhat this does is as we're walking down the path\nof trying to do a better job of teaching\nand our kids reading in school,\nthis is working with the expansion of the vision\nand hearing screening, so we're catching those kids at an earlier age and helping them\nthrough their handicap.\nOkay.\nYou don't see any questions?\nThanks, sir.\nAll right.\nIs that all the members of the committee there?\nWe all know we've got a couple of busy days ahead of us, so we have set a calendar for\ntoday what we're going to do now is set a supplemental calendar for today\nMonday under modified open house resolution 69 have a move in second is\nare any opposition gets on under modified structure 91 seconded move is\nthere any opposition it's on hospital 255 move in seconded no opposition it's\nSo, House Bill 262, move in a second.\nAny opposition?\nHouse Bill 398.\nMove in a second.\nAny opposition?\nHouse Bill 399.\nAny opposition?\nHouse bill 454, move in second, is there any opposition?\nIt's on.\nHouse bill 473, any opposition?\nIt's on.\nHouse bill 612, moved in seconded, any opposition?\nIt's on.\nunderstructured House Bill 141 moving and seconded its own House Bill 165 in the opposition\nits own House Bill 229 in the opposition its own okay that will be our supplemental calendar\nfor today. Now, hold on just a minute.\nOkay, four, this will be the calendar for tomorrow Tuesday, day 27, under the\nmodified structure house bill 37 have a move in second any opposition it's\non house bill 77 any opposition it's on house bill 123 move in second any\nthe opposition. It's on House Bill 154. Any opposition? It's on. House Bill 180.\nSeconded. Seconded. It's the opposition. It's on. House Bill 197.\nAny opposition?\nIt's on.\nHouse Bill 325.\nAny opposition?\nIt's on.\nHouse Bill 348.\nAny opposition?\nIt's on.\nHouse Bill 406.\nAny opposition?\nIt's on.\nHouse bill 465 in the opposition it's on okay under structured House bill 79\nin the opposition it's on House bill 129 in the opposition it's on House bill 144\nthe opposition. Excuse me. Okay. 144 is on. Okay. Let me run over these with you for our\nSupplemental calendar for today House Resolution 69\nHouse bill 91 excuse me 91\n255\n262\n398\n399\n454\n4.73, 6.12, understructured for today, 141, 165, 229.\nSo that will be our supplemental calendar for today.\nOn our rules calendar for tomorrow, Tuesday, House Bill 37,\nSeventy-seven.\nOne twenty-three.\nOne fifty-four.\nOne eighty.\nOne ninety-seven.\nTwo forty-four.\nThree oh four.\nThree oh nine.\nThree fourteen.\nThree twenty-five.\n348, 406, 465, and under-structured, 79, 129, 144.\nThank you all. We're adjourned.\n",
  "updated_at": "2026-02-12T18:33:43.272994+00:00"
}