{
  "video_id": "k-X5W6SW7s8",
  "url": "https://youtu.be/k-X5W6SW7s8?t=844",
  "title": "Georgia House - Day 3 (2026-01-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": "2026-01-10",
  "duration_minutes": 100,
  "summary": "Overview:\nThis Georgia House session on January 10, 2026 featured a routine opening, with prayer, the pledge of allegiance, and the introduction of the guest chaplain. No substantive legislative actions were detected in the transcript.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The guest chaplain, Dr. Justin Norles, gave a sermon on biblical principles of leadership, emphasizing that leaders are called by God to serve others.\n- The House Speaker thanked the chaplain and his wife for their visit.\n\nVotes:\nNone detected.\n\nAttendance:\nThe session began with a roll call to establish quorum.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will be.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you This is Claire. How about Ring that Bill? We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? Have all members voted? Have all members voted? If so, the clerk will lock the machines. Doorkypers, will you please close those doors and keep them closed? As is our custom, we will begin our day with Scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Had a great visit with the chaplain and his wife this morning, both very fine people, so at this point in time, I'll let you learn a little more about them. And they'll be introduced by the gentleman from the 144th House District, Representative Dale Washman. Representative Washman. Well, thank you very much, Mr. Speaker. Ladies and gentlemen, the House is a great privilege for me today to introduce to you as our chaplain of the day, Dr. Justin Norles. And Dr. Norles is here with us with his wife Cassie, who's not over here next to my wife Donna, who you know. And Dr. Norles and Cassie have four children. Dr. Norles is the teaching pastor at Inglocide Baptist Church, where Donna and I have been active for many years. It is a large church in central Georgia. He is the teaching pastor there. He has a bachelor's degree from Mississippi College, a master of divinity from Beeson Divinity School at Sanford University, a master of theology from Duke Divinity School, and a PhD from Spurgeon's College in London, England. Donna and I have been members, active members. It angles I have for many years. And Dr. Norles has been with us for ten years. I'm a lifelong Baptist, and I've heard a lot of good teaching and preaching as many of you have. But I will tell you that I have been very blessed by the teaching and the preaching of Dr. Justin Norles. And I look forward to hearing him today. Ladies and gentlemen, it's Donna for me to present to you our chaplain of the day, Dr. Justin Norles. Good ahead, yours. Well, thank you, Mr. Speaker, for the invitation to be here today. And to really enjoy and to privilege. And thank you all for having me. I want to say thanks, first of all, to you and for all that you do. I'm really grateful for your willingness to serve our state and to put in all the work, to do that well in the way that you do. And obviously, this is a room full of leaders. You obviously have a leadership role. I'm here within this body. And I would imagine many of you have leadership roles outside this body. Whether that's in your family or your church or community, or places of work. And so I want to share some few thoughts this morning on leadership. And there are thoughts that come from the biblical book of Psalms. Specifically, Psalm 78, the end of that chapter. And you're the end of Psalm 78. It talks some about King David. David was a king of Israel. Perhaps the best known, that king of Israel. David was not a perfect king. He was not a perfect leader. In fact, maybe one of the best known stories about David is about one of his failures. So he was not a perfect leader. But he was a good leader. And there are some important lessons that we can learn from his life. So in Psalm 78, sorry, in verse 70, it says, God chose David, his servants, and took him from the sheepfolds. From following the nursing news, he brought him to shepherd Jacob, his people, Israel, his inheritance. As you notice, it says that God chose David to serve as a leader. As a sovereignty, he chose the person that he wanted to be in that position of leadership at that time. Of course, first, David was a shepherd. The Lord used that time to prepare him for the role that God was going to use him as a king. David shepherded sheep before he shepherded people. It was a way of God preparing him. And then at just the right time, God put him in that position of leadership over the nation. It reminds me of what the Bible says in Romans 13, where it says, let every person be subject to the governing authorities for there is no authority except from God. And those that exist have been instituted by God. I think David's example in Romans 13 teach us that it's not a coincidence that you are in this position of leadership at this particular time. The Lord has appointed this governing body for this time to serve other people by promoting what is truly good and just. It also tells us that God is very much involved, that he has plans for the world and for the people that he's created. And one of the ways that God provides for societies is through government leaders that are called to serve just like you. But you also notice it says that David was called for what purpose to shepherd people. What does a shepherd do? Well, of course, provide some overall leadership and he does that largely by providing and protecting by doing what is good for the sheep. But genuinely caring for them. I think all of that then should really give us a sense of purpose related to our leadership and help us see the significant responsibility that comes with it. It keeps us aware that our leadership is not fundamentally about ourselves. It is not a means of self promotion. It's not self serving. Our leadership is part of something bigger. We are put in place by God to serve others, to leverage our leadership for the good of others. He reminds me of another shepherd in the Bible, the good shepherd, Jesus. I love what he says in John 10 when he made clear that he had all authority in heaven and on earth. And what did he choose to do with his authority? John 10, he tells us that he chose to lay down his life for his people. Like a good shepherd giving his life for his sheep. On another occasion, he said that he didn't come to be served but to serve. God himself, King of kings, Lord of lords, God in the flesh saying he came to serve. And to give his life as a ransom for many that we might have eternal life. His example teaches us that we are meant to leverage our leadership for the good of others, to lay down our lives for the good of those that we lead. And so here's the lesson this morning that I want to see here from Scripture. Simply that those of us in leadership are put there by God to serve others for their good. We join me as we pray. Our Father in heaven, I thank you for your provision through the leaders in this room. And I pray that you would incline their hearts toward you. Fill them with your wisdom that they might lead in a way that is consistent with your character and your commands and is good for others. But I thank you that your grace is sufficient for all of us to do what you have called us to do. The grace that has been expressed ultimately through the death and resurrection of your son Jesus. And it's in his name that I pray. Amen. You know what you join me as we say the pledge. I pledge allegiance to the plight of the United States of America and to the Republic of which it stands, the One Nation under God, indivisible with liberty and justice for all. Excellent. The Lord, keepers, you may unlock the doors, members. You may greet the chaplain in the south any room. If you would like to greet the men, have a photo. Chaplain, pastor, thank you for those words. They are very meaningful. And thank you for both of you for being here today with us. We look forward to having you back. Great. Thank you. Thank you. Only 38 more days. We're in good place. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits. Chairman Tarvan. Mr. Speaker, your committee on information and audits has read the journals in the previous legislative day and found it to be correct. On another note, you know, we all worried about our health now and all our health concerns and we're not supposed to worry. So I'm on a quote one that was Mark Twain was attributed to him. Hold one second. Do y'all need to hear this? I'm going to have somebody been worrying. Hold one second, Paulus. Y'all need to hear this. I'm an old man and I have known a great many troubles, but most of them never happened. Let's hope so. That's pretty stout. Chairman Tarvan, the Chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there an objection to dispense to the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there an objection to the confirmation of the journal? Is there a Chair, here's none? And the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, registration of 104th Moose Follin B established as the order of business under first part of the period unanimous consensus. Introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none and the resolution is adopted. First reading of bills and resolutions. The clerk will read. In the 17th, I represent a lump sum of the 12th of the bill being titled and act to provide a for homestead exemption from Shatuga County advalorem taxes. Intergovernmental coordination. House bill 878 by rep. In the 178th, I represent a lump sum of the 12th, Corb. of the 174th Smith, 38th, Hitchens on 61st and Apollo on 33rd. Bill B. Tonto, act to amend Article 166 of Title 40. The official go to Georgia annotated relating the journal provisions, relevant to uniform rules of the road. Motor vehicles. House bill 879, I represent a riddley of the 22nd, final of the 73rd, Apollo 33rd, Horner of the 3rd, Jasper's the 11th and others. Bill B. Tonto, act to amend Part 3 of Article 1 of Chapter 2, Title 38, the official go to Georgia annotated relating the state to defense force. Defense and veterans affairs. House bill 880 by rep. In the 177th, bottom of the 73rd, perched to the 176th, black one to the 146 prints to the 130th and others. Bill B. Tonto, act to amend Code Section 43, 1, 34 of the official go to Georgia annotated relating the licenses for transitioning members of the armed forces.\n\nRegulated industries House bill 881 by reps and gull of the 19th gains the 120th percent of the 176th section of 104th hatched to the 155th and others will be titled back to amend code section 15 1832. The official go to Georgia annotated relating the prosecuting attorneys, qualifications, commission. You just share a non civil House bill 882 by reps and bruise the 61st Smith of the 18th Gunner of the 8th McLean to the 109th Beverly the 143rd others. Bill B. Todd on act to amend code section 351 19 to the fish go to Georgia annotated relating the disclosure of arrest booking photographs. Government will fares House bill 883 by reps and c ball of 34th Cooper the 45th Hawkins the 27th Dempsey the 13th silcox the 53rd. Bill B. Todd on act to amend code section 50 141. Bill B. Fischer go to Georgia annotated relating the meetings open to the public. Governmental affairs House bill 884 by reps and Alexander the 66 Bruce the 61st knew the 64th Thomas the 65th. Bill B. Todd on act to amend code section 1562. The official go to Georgia annotated relating the number of judges to superior courts judiciary House bill 885 by reps and a balance and a 66 Bruce the 61st Thomas the 65th. Bill B. Todd on act to amend chapter 3. Toddle 44 the fish go to Georgia annotated relating the regulation of specialized land transactions. You do Sherry House bill 886 by reps and a whole come in the 81st flumbing the amount of 25th pairs to the 142nd reads the 99th fry the 120 second Bill B. Todd on act to amend code section 42 86. The fish go to Georgia annotated relating the special license plates. Motor vehicles. 87 by reps and a Thomas the 65th Bill B. Todd on act to amend article 1 in chapter 24 of title 33 of the fish go to Georgia annotated relating general provisions regarding insurance. Technology and infrastructure innovation. House bill 888 by reps and a Thomas the 65th Bill B. Todd on act to amend part one of article one of chapter two of title 44 of the official go to Georgia annotated relating the recording of deeds and other real property transactions. You wish, Sherry House bill 889 by reps and a Thomas the 65th Bill B. Todd on act to amend article 6 of chapter 11 to title 15 of the official go to Georgia annotated relating the link would see relative to the juvenile code. Juvenile justice. House bill 890 by reps and Thomas the 65th Bill B. Todd on act to amend chapter three title one of the official go to Georgia annotated relating the laws and statutes. Technology and infrastructure innovation. House bill 891 by reps and a Thomas the 65th Bill B. Todd on act to amend chapter seven to title 48 of the physical to Georgia annotated relating the income taxes. Ways and means. The official go to Georgia annotated relating the regulation of rates. Insurance. The official go to Georgia annotated relating the tax exemptions relative to property tax. Ways and means. House resolution 768 by reps and a quarter to the third just in the seventh person to the 119th can in the 112nd, readily the 22nd. Resolution creating a house study committee on the elimination of state income tax. Ways and means. That completes first readers. Second reading the bills and resolutions the clerk will read. House bill 856 by reps and a half of the 50th, Beverly of the 143rd park of the 107th province of the 52nd Mitchell the 88th and others. A bill relating to public assistance. House bill 857 by reps and a half of the 50th by relief the 143rd park of the 107th province of the 52nd Mitchell the 88th and others. A bill relating to public assistance. House bill 862 by reps and a quarter of the third, Kelly of the 16th, Jasper's of the 11th, Pro of the 118th, Ridley of the 22nd and others. A bill relating to homestead, homestead option but sales tax. House bill 863 by reps and a half of the 171st to bill to authorize the governing authority of the city of Bainbridge to Levy and ex-size tax. House bill 864 by reps and a green of 154th, the bill to repeal and act creating the state court of Miller County. House bill 865 by reps and a half of the 135th and night of the 134th, the bill to amend and act to provide a homestead exemption for Lamar County school district at Lauren taxes. House bill 866 by reps and a camp of 135th. A bill to create Pike County Public Facilities Authority, House bill 867 by reps and a gamble of the 15th, Goggins of the 14th. A bill to authorize the assessment and collection of a technology fee by the probate court of Bartow County, House bill 868 by reps and a Stevens of the 164th, the bill to amend and act creating a new charter for the city of Bloomingdale. House bill 869 by reps and a half of the 134th, McCollum of the 30th, move all of the 105th, the bill to incorporate the city of Mulberry. House bill 870 by reps and a washroom of the 144th, out of the 50th Stevens of the 164th, the new limits of the 42nd, Hitchens of the 161st and others, a bill relating to general provisions relative to state government. House bill 871 by reps and a parkel of the 169th, honor the 173rd, corporate of the 174th, greens of the 99th, a cannon of the 170th, a bill relating to homestead exemption. House bill 872 by reps and a half of the 27th, parish of the 158th, been it with the 94th Cooper of the 45th still cocks with the 53rd, a bill relating to medical professionals for rural assistance. House bill 873 by reps and a counter of the 8th Smith of the 18th, which had 176 breeds of the 99th lever to the 123rd and others, a bill relating to courts. House bill 872 by reps and a Hawkins of the 27th, or one of the 32nd, Jones of the 47th, green of the 154th, Cooper of the 45th and others, a bill relating to health. House bill 875 by reps and a Roberts of the 52nd, Mitchell of the 88th Draper of the 90th, Westbrook of the 163rd, left into the 83rd, and others, a bill relating to carrying a possession of firearms. House bill 876 by reps and a Williamson of the 112th, Williams of the 148th, Dickie of the 145th, Wade of the 9th, Chastain of the 7th and others, a bill relating to banking and finance, commerce and trade, Will's trust and administration of the states. House resolution 767 by reps and a Roberts of the 52nd, Park of the 107th, Beverly of the 143rd, Mitchell of the 88th, Canada of the 58th and others, resolution recognizing that free and fair elections of the peaceful transfer of power to foundational to our Democratic Republic, commemorating all who died or were injured on January 6th, 2021, including law enforcement officers who bravely defended the United States Capitol. Three-second readers. We have no standing committee reports. Correct, Ms. Clerk? Mr. Clerk, Madam Clerk. Members in any room, I'll ask, if you all come to the floor, take your seats, we'll come to order. All members, we have some important work to do here. We have some members that have served this house in this state with distinction we're going to hear from. So I'll ask all members, please take your seats and let me have your attention. All members. Thank you members. All members, please take your seats. You know it's always a bittersweet time in this family of house members over the years and one of our members. You know a lot of times it's the end of the session when we do this and hear from a house member that may decide not to come back or offer themselves for a real election. This time we have one of our members that's moving on a little earlier. This gentleman represented Barry Fleming and served this house with distinction. He has served the people of Georgia and his district with distinction and with effectiveness. Barry's our dear friend who I respect greatly and admire. He's taken the skill set to another place he can serve the people of his district and he'll tell us about that. I'm going to allow him to do this. Representative Fleming, I'd like for you to come down now and be recognized by a special morning order. Let us know what's going on in your life. Representative Barry Fleming. Thank you, Miss Speaker. And I do mean thank you, Mr. Speaker. Every time you come to this well and I'd have for about 21 years or so we say thank you, Mr. Speaker. And for letting us stand here because we have to have his permission to do that. And not only do I say thank you, Mr. Speaker, but thank you also because I don't think even those of us so close to this job realize how much it takes out of a person to serve in the role as a man behind me does. Man, you and I both know the the the pools on us. But when you step up and become Speaker of this house, not only you probably one of the most important man obviously in this state, but the commitment it takes from your your time and your family and you don't get to see your grandkids like you want to and you missed stuff. Thank you, Mr. Speaker. Thank you, Mr. Speaker, for what you do for us. Thank you. You may be seated. You may be seated. Me too, is it going to be that long? Gotta get used to that, I think. About 21 years ago when I first got elected to this house, then Governor Perdue had to make his first judicial appointment in the state and in an opening came in my district and he and I talked about that and he was very gracious to give me the opportunity to be a spirit court judge, but I did not think it was the right time for me. So I um I said no and I didn't know if that opportunity would ever come along again. Uh well, lo and behold it has and I am extremely thankful to Governor Kemp for allowing me this afternoon to raise my hand and move from the legislative branch of government over to the judicial branch of government where I think most law students at some point they they wonder if they will ever get to serve as a judge one day and I didn't know if I would, but I am very thankful for to him for giving me that opportunity. I also want to say how thankful I am to our Governor for the leadership, particularly it probably one of the toughest times I know in my lifetime I have ever seen a Governor have to serve during COVID. We all know how it turned our lives upside down and how difficult some of the decisions we had to make right here on this floor work. Can you imagine being the chief executive of the state and having to deal with that and I thank him profusely. I know in my behalf and I'm sure yours too for being the leader that he was particularly doing that time period. Thank you Governor. As I as I pause, obviously and I look out here on the floor, I see so many friends on both sides of the aisle. I see Mary Margaret over there. I see my Prince right there. There is Sheila and of course my dog Dmitrius and I do mean dog, DAWG dog. Go dogs. One of the greatest things about coming down to this place is particularly for us who have to come from far away and get a place to stay down here is this whole idea of getting a roommate which I've been able to do. You know we did that in college many of us and that was fun. You really got to know folks when you were roommate and then I got to do it again after undergraduate. I went to DC and worked for a congressman and I had a roommate up there. My college roommate, my attorney brother Steve Fowler, still my best friend, Patrick Crusoe, one of my roommates up in Connecticut. He's now a judge. Just became a judge up there in Connecticut. Here my roommate was representative Kelly and we tried to figure it out. I think it's been eight years. He's put up with me and I want to say thank you for that. You know when you leave this place even though if you get to move on to an opportunity like me you still worry about what goes on behind after you leave and many of you, one of the joys of serving here is to get to help many of you as an attorney. Perfect your legislation, get the wording right. It's one of the benefits and of service that we get from my profession. I'll tell you a little secret. If you need somebody smart, go to Kelly. I mean he's actually a smarter lawyer than I am but don't tell him I don't want him to get the big head. Seeing those young people though that are here to follow us is one of the things that gives you comfort when you move on and I know I see representative gamble back there. You know when I was elected to this place in 20 and 002 I started going to the prayer call. It's that is on Wednesday mornings and when I first started it was a guy named Tom Rice from Gwinnett County and then Timmy Barr took it over after he retired and then representative gamble is doing it now that prayer call because I would greatly encourage you it's right in the center of the week on Wednesday if you want to get your life centered down here and keep your head on straight go to that prayer call because I appreciate him doing that. I call him a young person he's got three three kids but I don't know they keep getting younger it seems like dawn down here these young people. I'm so thankful to have had a chance to be just a small part of the rich history of this house sometimes some of us will say you know somebody ought to write this stuff down some of the things that occurs down here maybe I will one day but the way we only know some of the history is by telling each other about things that we've experienced and I have so enjoyed my my time down here listening to some of the things that have happened the rich history of this house and I'll tell you a couple of them one of my saw personally and one of my heard about and the first one I heard from got named Larry Walker who was majority of this house for a number of years his son centered to Walker now serves across the aisle over there but both stories center around that man we call the speaker of the house the term speaker was defined for about 30 years down here by a guy named Tom Murphy Thomas be Murphy long as serving speaker of the house when he served down here and like him or disagree with him he was the speaker governor's came and went but the speaker was always here the story is is that he was elected as a young man to this house in 1960 and he came down here and was a lawyer from over in West Georgia I think Tyler Paul Smith has most of his district he was from Bremen Georgia and in his first term he got behind a young fellow from Augusta named Carl Sanders who was going to run for governor and upstart senator across the hall and he was the underdog but Murphy believed in him and he got behind Carl Sanders and lo and behold Carl Sanders got elected governor in 1962 well another bit of history about this house that many people don't understand is that this house has always not been an independent body we did not always choose our speaker we did not always have our own say of who chairman of the committees were the governor did all that in 1962 he ran this place it's another story about how we got our independence but at that time because Tom Murphy had backed the governor he made him the chairman of the committee which was unheard of back then for a sophomore to be chairman of a committee in the house and the governor allowed him to do that and one day during that next session the governor got word down on the second floor that Tom Murphy one of his chairman was out here on the floor working against one of the governor's bills well the governor called Tom Murphy down to his office and asked him he said Tom what is this out here he said I so much appreciate you supporting me and getting behind me I made you as a sophomore to the chairman of one of my committees in the house and you're down there working against my bill on the floor you just can't do that and Murphy doodifully listen to his governor and went back to the floor of the house and went right back to working against the governor's bill well governor got word of that called Murphy back to his office and fired him on the spot his chairman of one of his committees it was an unheard of thing right in the middle of session fire one of the chairman well the next morning rode around and who came to the well of this house Tom Murphy he stood right here in this spot they said you could have heard a pin drop on the floor of the house he came to this well and he said it comes a time and a place in every man's life when he's got to stand up and say what he believes and he said right now is neither the time nor the place to do that and then he announced a charity basketball game they were going to have that after that the first time I ever met speaker Murphy was in 1986 I was a young intern Dr. Charles Bullock over at the University of Georgia I took his Southern politics class and he let me even before I took his legislative process class do something that any political science kid that wants to go to law school would love to do is come maybe an intern in the legislature and lo and behold I got the plum committee I got to be the intern for the House Judiciary Committee in 1986 and my specialist the thing I was most good at down in the House Judiciary Committee was the three C's I got coffee I got coke and I got copies and I could fix you up if you needed that well if y'all have been down to that judiciary committee I know you have it was even more busy back then because it was really only one judiciary committee in the House back then in Murphy being on a lawyer speaker Murphy that's where he sent everything and particularly things he wanted worked on and the big issue the big issue lo and behold in 1986 was something called tort reform and there were three members very prominent members of that committee in this House who had introduced a tort reform bill to reform the legal system one of them was an upstart young fellow named Pete Robinson from over in Columbus George he had a little company a new company is district called Affleck and of course Pete went on to be the majority leader in the Senate head of Troutman Sanders government affairs department a great fellow but he introduced a tort reform bill in 1986 his number two son was a guy named Tommy Chameless he was vice chairman of the Judiciary Committee Tommy had a little entity entity down in his district and all make all Phoebe Putney hospital and and he was the number two son of the vice chairman the third son are on that now was a guy named Denmark Groover Denny Groover they used to say for years down here if you want to bill right you give it to Denny and he Grooverize it he was the whip of the House he sent right there in that spot he was Tom Murphy's lawyer and he was the number three son are on that bill the whip of the House well it came today for the for the for the first big committee or or so and of course I'm down there that Judiciary Room was packed full of people and we've been down there at about four or five hours of hearings you know how things go down there and all of a sudden the chairman of the committee Charles Thomas from over in Temple Georgia on that near Bremen he grew up knowing the speaker he did this right here to me me I mean intern I kneel down now this is before cell phones and taxes and everything like that he kneeled down I kneel down and he said to me you and only you go to the speaker's office and you tell the speaker and only the speaker things are not going right and he needs to come down here now I said you want me to go to the speaker's office and telling that he said you and only you and don't you talk to anybody else I said where's the speaker's office he said third floor ask anybody so you know here I go I come up here and I find the speaker's office and I walk in now back in those days you did not get to see the speaker unless you got through Lunele Lunele was a speaker secretary and she was the gatekeeper so I walk in the door and she says young man cannot help you and I said yes ma'am I need to see the speaker she said well who are you I said I'm very flimmy she says well what do you do I says I'm the intern for the House Judiciary Committee she said that's fine so just tell me what you need and I'll take care of it I said no ma'am chairman Thomas said I could only speak to the speaker she said okay so she then brought me back to the chief of staff's office a guy named Steve Anthony ended up being a law professor over at Georgia State and I walked into the chief of staff's office he said young man can I help you I said yes sir I need to see the speaker he said well who are you I said I'm very flimmy he said well what do you do I said I'm the intern for the House Judiciary Committee he said well son just tell me what you need and I'll take care of it I said no sir the chairman said I could only speak to the speaker he said all right so I'm gonna hold on just a minute second later too he walks me into speaker Murphy's office first time I ever met him in my life he said son who are you I said I'm very flimmin he said what do you do here I said I'm the intern for the House Judiciary Committee he said son what do you need I said mr. Speaker the chairman told me to come tell you that things are not going right without bill and you need to come down there now he said all right son you go back down there and you sit down and you don't say nothing to nobody so I made my way back down to the judiciary committee I went by the refrigerator and got a coke for good fashion set it up there in front of the chairman setting my little position over there in the corner after 30 seconds chairman looked over at me and I said about a minute or two later that door swung open back there in judiciary and and him walk speaker Murphy now that room was packed the fire marshal would have arrested everybody in there but it looked like Moses part in the Red Sea when speaker Murphy walked up to that judiciary table in the chairman stopped the meeting right there and said well my goodness mr. Speaker what in the world brings you down here today and speaker Murphy walked over to the table like he could he's the larger than life figure a big man he said well I'm sorry mr. chairman to come down hand interrupt your proceedings I know y'all got a lot of stuff going on but I just wanted to come down hand tell y'all how much I appreciate what y'all are doing he says I know I send you too many bills down here you're down here every day all day it's running your law practice but I could not run this house if it were not for y'all and I just wanted to come and say thank you and he turned to walk away and then he leaned back and he says in the worst the worst bill I've ever seen in my life you get Pete Robinson to tell you that story back when he was still here and he'll tell you they had about 14 15 16 votes out of the 20 or so lawyers on that committee and after the speaker Murphy left it went back to the three guys who signed the bill mr. Speaker that's one I learned about the procedure of the house of representatives procedure rule number one the speaker is always right house procedure rule number two went in doubt refer to rule number one I'll end this morning by probably doing the more important thing and that is thanking my family for allowing me to come down here and serve I knew they were going to be here this afternoon for the the swearing in but I did not know that they were going to get to be here this morning my beautiful wife Paige and my son I love Zach are both back there in the back and my brother Jimmy is sitting right up there in the balcony I cannot tell you how many calls they have fielded how many signs they have put up high-made doors they knock on you all understand without my beautiful bride allowing me to do this there's no way I could have done it and I sincerely emblessed with my family and I thank them I am a lucky man I have been allowed to do the duty that lies nearest to me that's Sir Thomas Carlisle in his masterpiece Sartara Sartis the Taylor retailer do the duty that lies near is he tells us sick Vos non-Vobus is what's most important that's Latin for not for ourselves but for others ever since I have been here I have asked the Lord to give me wisdom to know what to do every time I go on some new endeavor whether it's run for office or not I always reference the book of kings when Solomon is about to become a leader amongst his people and he asked the Lord for just one thing for wisdom in the Lord bless them with that and much more I think that is the example for all of us whether we're going to be a judge or a house member or whatever ask the Lord for wisdom the promise is over in the book of James this is my dad's Bible right here that from my wife will hold for me today and if you look in James chapter 1 verse 5 it says ask the Lord for wisdom if you need it and he will give it to you generously and if I could part you with anything that's what I would do the barba vold said partying is such sweet sorrow is it not thank you all for allowing me to serve with you God bless all of you and God bless this great state of Georgia thank you\n\nApplause Page we thank you for sharing and bearing with us over the years and supporting him. Zach thank you for allowing your dad to take time away from being with you over the years and porting things in your life as well. I know this has been some of those. Now close with this, representing Fleming, you have done that duty nearest and you've done it very well. Thank you for your service, thank you for your friendship and God's bid and your further pursuits. Chairman Mac Jackson, you're in the room, there he is. I think you have some folks in the gallery that need to be recognized and we'll be prepared to represent Kendrick's representing more after Chairman Jackson and some friends looks like. Awesome. Representative Jackson. Thank you, Speaker. Today is Georgia Head Start Association Day at the Capitol. We have some head start officials in the gallery want to recognize them. Please put your stand so we can recognize you at this time. Today they are here to celebrate our annual Susie Wilts today at the Capitol. The late Susie Wilts, you passed away on August 2022 and she was very instrumental in head start. She loved head start and today we'll celebrate her day to day at the Capitol. Susie was an advocate for Georgia's infants, for toddlers and preschool children. They have asked that you join them for lunch in room 230 at the Capitol at 1130. She was passing 1130 now but they still have lunch for you in room 230. We have head start from all over from Columbus, Georgia, from Bert County, Richmond County from Savannah too. Thank you, Mr. Speaker, for Yale or Well. Thank you, Mr. Chairman and welcome. Glad you all here. Appreciate the work you do with Head Start. It helps a lot of folks know about that. The representative Angela Moore is recognized for a morning order to recognize some folks in the gallery. We're representing Moore. And she has some friends as well. It's always good to have support. Representing Moore. Good morning, Mr. Speaker. Colleys. Good morning. Good morning. We're really excited that today is Deb Yatton Day at the Georgia State Capitol. And in our Miss, we have our 2024 Deb Yatton here today along with their leader, Miss Memes. Miss Memes, will you please stand? Miss Memes is the sponsor of this program, which is a much lost tradition. Our program is a positive mentorship in our counties. These young ladies range from the Cad Rockdale, Henry County, as well as Newton County. Got it. Newton County. Ladies, if you all would please stand for a moment. The goal of the event, hold that applause, is to encourage these young rising high school juniors and seniors to pursue higher education, academic excellence, personal development, and today begins their civic duty and civic involvement in the state government and world government issues as well. The Debuitons of Georgia are enrolled in a scholarship program, which will culminate on February 24th, 2024. We are so proud to welcome you all here. You are our women amongst women today, and we hope that we will encourage you and ask you to go into your endeavors with pride that Georgia has your back. Ladies and gentlemen, can I please introduce you to the Debuitons from the East Side of the A 2024. We will meet you in room 216 for Attacco Bar. Thank you. And welcome to the People's House. Representative Kendrick's recognize for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. This morning I would like to recognize someone special in the gallery, Mr. Richard Hicks. He's the CEO of Inspire EDU. And as him and his team stand, let me tell you a little bit about their work. Their mission are your paying attention to me because I can barely hear myself. Please give the lady your attention. We have guests in the gallery. Thank you, Mr. Speaker. What I need to use mission is to help underserved youth develop the skills needed for education and career success through technology-based learning tools and engagement activities with their families, their communities, and schools. Their purpose is to bridge the gaps in digital literacy and access by providing our communities most marginalized and vulnerable citizens with the resources and support they need to be competitive and pursuit of their education and world preparedness. He just came back from the city of Atlanta for getting a proclamation for his work. So if you care anything about digital literacy all over the state of Georgia, could you help me congratulate him on the work that he is doing in the community? Thank you. I think that completes our morning orders, recognizing our guests in the gallery. Thank you for those folks being present. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Peggy Usher Theos. Honoring the life and memory of John Michael Venable Honoring the life and memory of Jack Bassett Honoring the life and memory of Steve Hadley. Recognizing commending Eric D. Thomas commending Shantyush Shelman Austin Samson. In January 15, 2024, Alpha Kappa Alpha Sorority inks 116th International Founders Day. And for other purposes, I completes the reading of the privileged resolutions. Is there any objection to adopting the privileged resolutions? Chair here is none and the resolutions are adopted. We'll move on now to afternoon orders. There is going to give the members two minutes each. There are some very important afternoon orders we're going to hear. Someone asked the members at your seats to give the member in the well your attention and your respect. Representative Shay Roberts has recognized for an afternoon order. Members, I'll repeat, we have two minutes each. We'll be allocated for afternoon orders. Thank you, Mr. Speaker. Good morning, colleagues. Saturday March three years and we did not want this week to pass without taking a moment. To remember those who died or were injured as a result of the attack on the U.S. Capitol on January 6, including the law enforcement officers who bravely defended the people's house in DC. I was inspired by you, Mr. Speaker, today at eggs and issues and I couldn't agree more that improving the public's confidence in our elections is so important. With many of our colleagues experiencing receiving threats, being swatted, the dramatic rise in anti-Semitism and Islamophobia, as we head into what is likely to be another tumultuous election year, it's important as leaders of this state that we've set a good example and recommit to ensuring free and fair elections and the peaceful transfer of power. Preserving these foundations of our democratic republic is the best way we can honor those whose lives were lost on January 6. So please let's all take a moment of silence to reflect and remember the January 6 victims. Thank you, Mr. Speaker. Thank you, the ladies shield of the will. Representative Maynard is recognized for an afternoon order. Thank you, Mr. Speaker. If we can please rise for a moment of silence for a community member that we lost over the holidays. Her name is Keona Jones. Keona Jones has actually been running against me for quite a while as my opposition candidate. And one thing about politics is we are all children of God and her family is hurting. Her church community is hurting on behalf of the Dixie Hills Baptist Church, Reverend Sutton and his family. The state of Georgia we offer our condolences to you on this last and let's borrow ahead in a moment of silence for Keona Jones. Thank you, Mr. Speaker. No, thank you, Representative Maynard. Representative Brad Thomas. There he is. Representative Thomas is recognized. Thank you, Mr. Speaker. I stand before you today to discuss a significant policy change within the Veterans Administration that's far reaching implications for nation's heroes. Beginning one week from today, January 17th, all eligible veterans will be able to access emergency mental health care free of charge at any Veterans Medical Facility or outside clinic. This is regardless of whether they are already enrolled in the Department of Health Care Services. This marks a crucial step for in ensuring the well-being of our veterans, particularly in their most acute times of need. Under Section 201, the VA commits to providing or paying for treatment of eligible individuals in emergent suicidal care, including transportation costs, added to a VA or non-VA facility, this extends 30 days of inpatient care and 90 days of outpatient care with possibility of an extension. Additionally, appropriate referrals to continued care and eligibility. So who's eligible? There are some further caveats, but veterans who served before September 1980 who were discharged under conditions that were not dishonorable. Veterans who joined after September 7th, 1980 who have served 24 months, also not discharged other than dishonorable. And it's just imperative that we understand the key provisions and as leaders in our respective communities, it's such a collective responsibility to spread awareness about these new provisions. Thank you. Let's stay in the United Supportive Veterans with that, Mr. Speaker, I yield the well. Thank you. Thank you, Representative. I've visited one of those clinics. They're doing great work. Great work. Representative Draper, you're recognized for an F-New North. Thank you, Mr. Speaker. And I invite any colleagues who are interested in the issue of maternal mortality to join me here at the well. So this morning colleagues, like many of you, I attended eggs and issues sponsored by the Georgia Chamber of Commerce, I am so pleased to hear that health care is among their priorities. And I was so encouraged to hear that it is a priority of this house, this session, to increase access to health care and provide better outcomes for Georgia families. Georgia's mothers desperately need better outcomes. The House Democratic Caucus held a hearing on maternal mortality last week. I had the great privilege of sitting on that committee. Many groups who dedicate themselves to this issue testified before the committee. They were professionals, doctors, nurses, academics, organizers. And we also heard directly from women who either had had a near-death experience during childbirth or lost someone they loved during childbirth. And woman after woman shared their souls with us. They're most painful moments in the hopes that we can do something to change maternal outcomes for our fellow Georgians. I had a harrowing experience the first time I gave birth. If my good friend who happened to be an OB nurse hadn't advocated for me, I don't know what would have happened. And my guess is that every one of us in this chamber has either had such an experience personally or knows someone who has had such an experience or has lost someone they loved during childbirth. Because even though having a child is a natural thing, it is also an extremely dangerous thing. I have three kids. As a mom, I remember kissing my children as I went to go give birth at the hospital. And it was this crazy conflation of feelings, this excitement that I was going to bring a new life into the world into my home. But also a fear that if God forbid something should happen to me during childbirth, I would not see my children on this earth again. And the truth is that that fear, that risk, it's higher for my black sisters. Black women in Georgia are 3.3 times more likely to die from pregnancy-related complications than white women are. Georgia has one of the worst maternal mortality rates in the country. Third highest in the country. And by the way, it's getting worse, not better. I used to refer to the death of women during childbirth in Georgia as a crisis, the maternal mortality crisis. But after last week's hearing, I'm going to adopt new nomenclature that I think more accurately describes what is happening here in Georgia. It is a state of emergency. Women and babies are dying. Black women and black babies are dying. These are tragedies that do not have to happen. Over half of them are preventable. And so this is a call for action. We will continue beating this drum. Colleagues, I invite you all to join us. Let's pass some legislation and save precious lives. Thank you, Mr. Speaker. I yield the well. Ladies, you, the well representative Eric Bell is recognized for an afternoon or hour of remind the representatives. Speakers have been very lenient on the last two. We're going to hold you to two minutes. And the lights are working on the podium. So representative Bell. Good afternoon, colleagues. I am honored to be with you today, serving as District 75 Representative for the Georgia State House. I have a request to speak about a issue that touches every district. Not just mine, but human trafficking. Human trafficking is an issue that we all are familiar with, but maybe we all can do some more work with it. So I would like to invite you on January 20th to human trafficking awareness resource fair. It's myself and representative Deborah Bayes more. We will be trying to eradicate this issue, not only for my community but for all of our communities. We will be providing resources as well as training and seminars for our community members to know, to identify and how to attack human trafficking and how to eradicate that in any way informed that makes it look. So please, if you have any resources then we can be able to provide to the community. I'll call on you to for this help. I'll call on you as representatives and I'll call on you as comrades. So if I'd against human trafficking to make Georgia a better place to live, work, play, pray, and to move out of their economic things, no matter where you come from. Thank you. Thank you representative. It's an important topic. So we appreciate your attention to it and those that joins you up here as well. Representative Scott Hilton is recognized for a morning order, afternoon order. And now we're in the afternoon. Now so you're good. Afternoon order representative Hilton. Thank you, Mr. Speaker. Yesterday the Peach State welcomed Vice President Harris to Georgia for a talk on voting rights and ballot access. The speech was part of an ongoing narrative from the administration to instill fear and misinformation prior to the 2024 election. If I've learned anything from our great leader, Speaker Burns, it's at this house deals in facts. As Georgia set once again to be the political epicenter of our nation, I think it's important now more than ever that we deal in facts. And here are the facts. Georgia continues to set records for turnouts amongst all groups. In 2022 we achieved the largest single day in person early voting in Georgia midterm history. The U.S. Census Bureau found that Georgia's ranked number one in the southeast and 17 overall in turnout. A recent survey by MIT and the University of Georgia. You don't hear those two schools mentioned often. The survey found that 98.9% of voters reported no issues, no issues casting about it. The same survey found that 95% reported a wait time of less than 30 minutes and 90% of all voters feel confident about our elections. Finally the bipartisan policy center said Georgia's number one for election administration. I want this to be heard loud and clear. When it comes to voting in Georgia, we need to tell our constituents in this body that it has never been easier to vote and harder to cheat in this great state. Thank you, Mr. Speaker. Gentlemen, as you are the well, so we have two final afternoon orders. Members of fuel paid special attention to these two orders. I'll invite up the Cherokee County delegation. Cherokee County delegation, if you'll all come to the well. Senator Ridley is recognized for an afternoon order. Last night in Cherokee County, a car ran off the road and struck a tree with 517 and 8 members will you please rise. These five individuals were all between 17 and 18 years old. One died at the scene and one died later at Kennenstone Hospital. One had just recently graduated from Edowall High School. The same high school I went to and my sister went to. It's one of the largest high schools in the state or in our county and our students and our families in our county are dealing with this loss. And if you just take a moment of silence to recognize these lives that were cut short before they could really even start. Thank you. Thank you, Representative. And our prayers grow out of those families. The Glaze is recognized for an afternoon order. Representative Glaze, face special attention. It's another tribute and a moment of silence, I think, for a passing. Thank you, Mr. Speaker. I rise before you today because as a family member who lived in the city of Faberant for almost 38 years, we lost a mayor that I got to know very well. Mayor Betty Hannah, who served the great city of Faberant for 26 years, the first woman. And we continued to elect her until she said her time was up. She was 86 and passed on January the 6th. Her husband Ray Hannah served her and took care of her during her years of dementia. And he passed just two weeks before her. So to this great family who served our great state in the city of Faberant, it is my honor. And I'm so sorry that we couldn't do more today. But I just got the news. So would you buy with me for a moment of silence for the Hannah family? Thank you so much. Thank you, Representative Glaze. It's a tough time for the family, so let's all remember that family in our prayers. That completes our afternoon orders. We will now move on to announcements. Herman John Corbett is recognized for an announcement. We got you brother, take time. We only have to be done by five or six o'clock, something like that. I'm not sure. Chairman Corbett. Thank you, Mr. Speaker. Rule of caucus, we have lunch in the Ag Building upon adjournment. Dawes Barbecue, come join us. Thank you, Mr. Speaker. Thank you, Mr. Chairman. Representative Boatner, you're recognized for an announcement. Well after you eat lunch with the rural caucus, think about tomorrow's lunch. Working families will have their first meeting of the session. It will be upon adjournment in 307 of the legislative office building. So working families come join us for lunch. Tomorrow. Sounds like a good lunch. Chairman Knight, recognize for an announcement. Thank you, Mr. Speaker. And just want to make an announcement tomorrow. We have our annual, keep Georgia Wilde at the Capitol from 8 to 10, second floor. Many of you have been there in the past, formerly the Coastal Sportsman's Day at the Capitol. But please come out and visit our DNR. We'll be there with our different divisions. Plus a lot of our conservation organizations, these are folks are in your community and around the state that care about Georgia, the conservation and the wildlife in Georgia. Please come out and say hello and participate. Thank you. Chair Lady Camp, recognize for an announcement. Good afternoon once again. I just wanted to announce that following our departure today after we adjourn in room 403, we are having a lunch and learn. It is intergovernmental coordination. It's to give some good tips and best practices to give your local bill the best chance of making it through both chambers into the governor's desk. So 403 today after adjournment, we are serving lunch from Carabas. Thank you. Chairman Ron Stevens has recognized for an announcement. Thank you, Mr. Speaker. Members of the Economic Development and Tourism Committee tomorrow after the governor's state of the state will meet over at the World Congress Center at 1 o'clock. You all have a badge to get on to the parking deck, the red deck over in front of the stadium. It will be at 1 o'clock at the World Congress Center room C302. And then afterwards we are going to go see all the things that are built marine at the Atlanta boat show that are made in a lot of your districts. Thank you. Members, we have a couple of more announcements. We need to take care of something with Chairman Blackman. Chairman Shaw Blackman hasn't announced but that we all need to be made aware of and if you will, there you are. Give him your attention and I'll ask you all to stand. Thank you very much, Mr. Speaker. We rise before you today with heavy hearts. A former member of this body, Roy H. Sonny Watson, went to be with the Lord yesterday, January 9th, 2024. Somebody who was larger than life and want appropriately acknowledged and honor him with a couple of things that were written. He grew up in what is now known as one of Robbins. He graduated from Georgia Military College and then later earned his degree at Mercer University. He humbly began his career at a fillin station and then he became the city clerk and administrative for Houston County and served in that capacity for 17 years before he was elected to this body where he served a distinguished career for 22 years and he earned the title as you heard earlier, The Chairman. I think you'll hear more about that from Chairman Powell but he served as the House Industry Committee Chairman and frankly rewrote the book on how to serve in that capacity. I think one of the most notable things he shepherded through this body was what is one of the most successful programs in Georgia's history and that's the Hope Scholarship program. Of course, he didn't stop when he left this body and went back home. He was a brilliant and successful business person with Watson Insurance Agency. He served as the chair of the Houston County Healthcare System for 18 years and he was a champion of so many things, one of Robbins, middle Georgia Technical College Robbins Air Force Base, Museum of Aviation, and I could go on. I think he was fair to say that he was tough but compassionate. I don't think I ever visited his office when I didn't leave having left numerous times and learned something very profound. He was highly respected, much admired.\n\nand people loved him. Hope you'll join me in praying God's peace over his wife of 67 years. Janine, his daughter Cindy, his grandchildren Jennifer and Joseph. And I know that there are some others that may want to have a word. Thank you. Members of the house, a lot of y'all have heard me talk about this over the years and those of us who have a certain number of years of historical perspective. We talk about this that we're all a, we're all colleagues, whether you're here or whether you're gone, but we're all brothers and sisters. We serve in the greatest fraternity that there's ever been. I was fortunate enough when I was elected 34 years ago and took office to speak of Murphy and those people in power at that time saw something and they assigned me to Sonny Watson's to-lige. Now, what my friend from Warner Robin said about compassion, I never saw that in Sonny while he served. I'm obviously when he left public service here, that society came out of it. But he absolutely wrote the book on how to be a chairman. And a lot of y'all who crinkle your eyes up, it made some things that I say, well, you can blame it on Sonny Watson. Because Sonny taught me how to be a chairman. One of the things that people don't realize about Sonny Watson, and they remember Zell Miller, they remember the lottery, but a lot of people don't remember that one. Zell was elected. It was still the lottery barely passed. At that time, we had all the old felt hat crowd from World War II and the Korean War. And those guys at that time were absolutely petrified to vote on gambling or petrified to vote on alcohol issues. But Sonny Watson never blinked to eye. When that bill came to the committee, we dispatched it. And if it had not been for Sonny Watson, then that program today would not be an effect. He was absolutely a chairman, chairman. In that day and time, the house had probably half as many chairs as they do now. Being a chairman, absolutely meant you had to be a chairman, very sought after committee. Sonny sat right over here on this side over here, on the front row. And with Sonny, if you asked a question, you'd have to have to worry about where he stood on things. If something went to the committee, it was all about business at that point. So that being said, I would admonish every member in this house to think about this, that you could be fortunate enough when your tour comes to an end in this house chamber, the people's house. That if your memory is still there, and you've passed on certain information to other members, it'll carry forward and you will be as lucky as Sonny Watson has been that he has has revered. And you don't have to believe me. There's still a few lobbyists around that he can probably testify to that. I would tell you plenty of stories as his vice chairman for several years, some of the things that he had said, but I will give you one, the cleaner version. He was so good at the legislative process that I saw something done under his chairmanship, I'd never seen done. There was a lobbyist that made fun one day to their dismay that a certain piece of legislation never was dropped in or passed. And he was making fun of it. And he made the mistake of quoting that, well, chairman Watson didn't get his way this time. Sonny had a bill drafted within 30 minutes. And of course, we did things different in that day. Drop the bill in, had the rules suspended, hadn't read, had it assigned. We had a committee meeting in the aneurium of the industry committee, bill Lee called a meeting of the rules committee in the same fashion. And within an hour that bill was on the floor passed and in the Senate. And Sonny walked outside and that lobbyist was still cackling about the fact that that bill hadn't ever got any further. And he told him, he says, you need to go to the Senate. And that bill did pass. But that is a man who was committed to this house. He was committed to the independence of this house. He didn't shy away from Speaker Murphy when the speaker was wrong, nor any governor. So that being said is just a history about a great man who served in this house for a number of years. Thank you, Mr. Speaker and thank you, Representative Black. You just joined us in a brief moment of silence. Thank you very much. Thank you, Mr. Speaker. Thank y'all, prayers for the Watson family. Thank you for those remembrances about the history of this house. Chairman Jasper's has recognized for an announcement. Thank you, Mr. Speaker. I don't know if anybody has recognized something that happened this morning if you were at exit issues this morning and hope many of you were. And if you didn't, you need to go back and watch the video tape of our speaker. Speaker, you did an out. You're not recognized for that. Well, you know, I got it. Don't cut it off yet. But you did an outstanding job. And I want to, as that's a group, we need to recognize him for a great job this morning. Applause Are you done? No, if you'd say I am, I am. But members tonight, you got a note on your desk yesterday, the contractors that keep you warm and that keep you cool. They fix your glasses. They mind the minerals. They build the buildings and make Georgia the great state it is. Have a reception tonight for you at the Commerce Club at 430. Hope you can honor them by your presence. They're great supporters of all of us and all of our citizens. I hope you can be there. Thank you, Mr. Speaker. Thank you, Mr. Chairman. That's a great group. I hope we'll try to attend. And certainly, Mr. Chairman, I appreciate that. Thank you so much. It's all about the house. Chairman Halkins, recognize for an announcement. Thank you, Mr. Speaker. Committee on Health will meet today at 2 o'clock in Capitol 403. See you, too. Chairman Mitchell, recognize for an announcement. The Democratic Caucus will meet tomorrow morning 9 AM in room 216. Breakfast will be served. Thank you, Mr. Speaker. Thanks, Representative Billy Mitchell. Chairman Gunther, recognize for an announcement. Thank you, Mr. Speaker. The Judiciary Committee will meet at 8 AM in the morning in room 132. We have about three bills to take up. Thank you. Thank you, Mr. Chairman. Thanks for getting to work, man. Yes, sir. Where's this house is about? Chairman Martin is recognized for an announcement. The Speaker, the higher-end committee, your higher-end committee will meet at 2 o'clock today, 2 o'clock over in Seattle, be the notices have been sent earlier this week. Thank you, Speaker. That concludes our announcements. You have more information. Information overload, I'm afraid, but we have to have the information. So let's move on. Hey, we have some birthdays today. Let's see. Come on, Representative Holland stand up. Representative Betsy Holland has a birthday today. Happy birthday. Representative Karen Bennett. I thought you stopped having birthdays. Happy birthday. We have one more. Chair Lady Beth Camp. There she is. She's already standing. Happy birthday, Representative Camp. Appreciate the work you do. You halfway there, right? I'll let y'all figure that out from there. Well, members, thank you for being here. That concludes our work for the day. The House Majority Leader, Leader of Abstration is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Thursday, no January 11, 2024. On the motion of the Majority Leader, I'll remind you first that tomorrow, the governor will be here for state of the state. That will occur at 11 a.m., state of the state at 11. Is that right, Mr. Leader? But we'll be here at 10 a.m., so on the motion of the Majority Leader that this house stand adjourned until 10 a.m. Thursday, January 11, 2024, all those in favor will say aye. Opposed, no. It's close, but I say it, we're adjourned.",
  "updated_at": "2026-02-13T19:29:12.516514+00:00"
}