{
  "video_id": "k1jcDUigMcI",
  "url": "https://www.youtube.com/watch?v=k1jcDUigMcI",
  "title": "Rules Meeting for Day 28 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 34,
  "summary": "Here is a summary of the Georgia Rules Meeting for Day 28 of the 2025 Session:\n\n**Overview**: This session featured a variety of bills being considered, including measures related to voting, Black women's history, age discrimination, recovery support services, student loan forgiveness for veterinary technicians, and enforcement of transit lanes in Atlanta.\n\n**Key Actions**:\n- **HB 502**: Allows parents with young children to go to the front of the line when voting.\n- **HB 146**: Designates April as Black Women's History Month.\n- **HB 10**: Removes arrest photos of those never convicted from \"Remove for Pay\" websites.\n- **HB 311**: Removes the age cap of 70 for working individuals.\n- **HB 657**: Certifies Peer Specialists and defines Recovery Community Organizations.\n- **HB 217**: Extends a dual achievement program allowing high school dropouts to earn diplomas and technical certificates.\n- **HB 88**: Provides student loan forgiveness for veterinary technicians.\n- **HB 638**: Allows MARTA to use cameras to enforce bus rapid transit lanes.\n- **HB 442**: Allows students 25 days of school absence for film industry work.\n\n**Bills Introduced (First Reading)**: No new bills were introduced during this session.\n\n**Notable Moments**:\n- The session opened with a prayer, acknowledging the \"busy, stressful\" day.\n- The chair reminded presenters to provide bill numbers and page locations to expedite the process.\n- Several bills were noted as having been perfected or recommended by the Speaker Pro Tem.\n\n**Votes**:\n- HB 502, HB 146, HB 10, HB 311, HB 657, HB 217, HB 88, HB 638, and HB 442 all passed with no recorded opposition.\n\n**Attendance**: Quorum was met, and the session proceeded without noted attendance issues.\n\n**Adjournment**: The session adjourned. The next session date was not specified.",
  "transcript": "You\nYou\nGood morning everybody. If you would please come on in and take your seats and we'll get\nstarted, we're going to have some lead frustration to open\nus up with a word prayer. Thank you, Mr. Chairman. A few\nplease, y'all, please pray with me. Dear Heavenly Father,\nthank you for this opportunity for us to serve as we begin\nthe Lenten season, we keep you and your son, our Lord and\nSavior, Jesus Christ, top of mind. We are on a busy, here on a\nbusy cross over day today with a lot of stress, anxiety,\nhard work that's been put in. Please help us remember to keep\nyou first to love one another and do all things in service to you. It's in Jesus name\nI pray. Amen. Thank you, Mr. Leader. Okay. We can tell our blue sheets picking up. We\ngot a lot of things to be considered. We're going to try to get everybody in and let you\nbe heard this morning. For those of you that are presenting, if you would please, before\nyou start tell us the bill number and where it's located on the blue sheet so that we can find that\nand it'll make it go easier and brevity is good. So let's go ahead. Thank you. Come on up.\nThank you Mr. Chairman and good morning to the committee. I'm here to present House Bill 502\nwhich you can find on page five of the blue sheet about a third of the way down.\nand what this bill does is it takes the wait time guessing game out of voting for\nparents with small children. If you have a child on the age of two and you go to\nvote and there's a long line it allows you to go to the front of the line.\nIt merely removes an obstacle that some people might consider a barrier to voting.\nIt has been voted out of committee for the last three years unanimously.\nOkay, don't see any questions, thank you. Thank you.\nGood morning, Mr. Chair and committee members, I am working on House Bill 146.\nIt is a very first bill on your blue sheet.\nI am here this morning to actually share with you a very simple bill that came before\nyou last year.\nis designating the month of April as Black Women's History Month, but not just Black\nWomen, but all minority women.\nAnd I am passionate about this because I do a lot of work with young girls and I really\nwant to be able to encourage them to gain an understanding and an awareness and to embrace\nthe many achievements that are made and continue to be made in science, engineering, mathematics\nand technology.\nAnd by the way, the creator of this celebration is a Native Atlanta.\nreceived a proclamation from the from several cities over the last six years. And she was\nalso honored by Governor Nathan deal with a commendation. That's the bill. Okay, don't\nsee any questions. Thank you. Thank you. Let me make clarification. If you have already\nasked for your bill one time, you do not have to ask for it again. I think some of you may\nhave gotten an email saying to ask for it again but that's that's not so if you\nhave asked for your bill one time you don't need to ask for it again but if you\nhaven't asked for it you're welcome to get in line and ask thank you come\nyes ma'am thank you good morning mr chair members of the committee mr chair\nI have two bills that were passed out of committee submitted to rules but haven't\nmade the sheet yet can I I'm sorry say again no no yes they're on the\nOkay, go ahead and ask for them, yes, ma'am.\nOkay, so today I present House Bill 10,\nand this is a bill that simply strengthens\nto protections for individuals who've been arrested,\nbut never convicted of a crime,\nremoving their booking arrest photo,\nlike their mug shot, from the Remove for Pay website.\nThe media can still post the arrest photos.\nIt's HP 10.\nOkay, thank you, did you say you had another one?\nYes, and the second bill is HP 311\nthat seeks to amend the state's code\nby removing the age cap of 70\nfor people that are still working beyond the age of 70.\nSo the code says 70 and we just wanna take that code off.\nOkay, thank you.\nThank you.\nLet me remind you also a lot of bills came out yesterday.\nThese bills will not be eligible until the clerk\nreads them today and accepts that.\nSo you may run into this, but if anybody's here\nthey want to present the bill, we're going to go ahead and do that since we're getting\nsorted toward time crunch here.\nThank you.\nThank you, Mr. Chairman.\nOn page 7, the seventh bill down, House Bill 657, George is a national leader when it\ncomes to supporting our neighbors that are in recovery of different types.\nIn fact, we've got the second highest number of RCOs in the country here, second only\nbehind Texas.\nSo this bill comes at the request of Georgia Recovery Council and DVHDD that would\ncertify Certified Peer Specialist the different types, how they would become certified.\nIt defines what a recovery community organization is and lays out some basic operating requirements\nfor them so that it protects the integrity of this network so that we make sure when\npeople are in recovery and they need that support from their peers that we know that they're\ngetting quality care and that it's consistent across the state.\nNo, I don't see any questions.\nThank you, Mr. Chairman.\nYes, ma'am.\nThank you, Chairman.\nMembers of the committee, I have HB217, it's second page on the blue sheet in the middle.\nThis was recommitted to committee.\nThere were some concerns by Speaker Pro Tem that we've perfected some language on here.\nBut this is a dual achievement program with the TCSG basically allowing students who\nhave withdrawn from high school to go back and earn their high school diploma as well\nas some technical certificates.\nNo questions.\nThank you.\nExcuse me.\nI'm sorry.\nOne question.\nThis bill has a sunset which makes it timely to pass it and it is an agency slash governor's bill.\nThat's correct, it is, so it's a pilot program that we enacted four years ago, it's going to end at the end of this year, so we're extending in another five years with this bill.\nThank you.\nThank you.\nGood morning and thank you Mr. Chairman my bill is House Bill 88 page one.\nIt would provide student loan forgiveness for vet technicians where we have a shortage\nof veterinarian technicians in the state of $150,000 for five students $30,000 a piece.\nMirra's House Bill 172 that we pass unanimously for veterinarians, but we also have a shortage of pet technicians in the state.\nThank you.\nThank you.\nNo questions.\nThank you, ma'am.\nYes, ma'am.\nThank you, Mr. Chairman.\nI bring to you this morning House Bill 638.\nIt's on the top of page seven.\nIt's the very first bill.\nAnd I'm bringing this bill on behalf of Marta.\nI want to especially thank the pro tem for her assistance in perfecting this bill as well as chairman jasper's for hearing this bill late Tuesday night\nEspecially this bill is going to allow marda to use cameras on their buses\nTo enforce their bus rapid transit lanes that have been designated by the city of Atlanta to be used specifically for transit\nThese would restrict the violations of\nof the lanes to only parked vehicles,\nonly parked vehicles would be, if we're issued a citation,\nthere would be a six month warning period\nand education period for the community\nbefore anything would start,\nspecifies specific signs,\nbe put up to alert people of this\nin addition to the education program.\nThe fines would be identical to the distracted driving bill\nand would be limited to those amounts,\nonly no additional administrative fees.\nThere is a sunset of five years on this bill,\nif this doesn't work, but this will allow them to hopefully,\nlike said, enforce their best rapid transit lanes\nsince we do have a lot of great events coming to Atlanta.\nAre there any questions?\nNo, I've seen any questions, thank you.\nThank you, sir.\nYes, sir.\nThank you, Mr. Chairman, thank you to the committee page 47 spaces from the\nbottom house bill 442. What this bill does here is it help us take full\nadvantage of the film industry that we have created here in Georgia by allowing\nour young people to participate by giving them a max of 25 days of absence from\nschool when there's a contractual agreement the discretion of the\nadministration there allows it and there's a certified teacher on set to make\nsure that that child is receiving the work. Right now we're bringing in a lot of\nchildren from California and Texas here to Georgia to do movies as because of the 10\nday restriction we currently have and that's to be a Mr. Jim.\nOkay.\nThank you.\nI'm seeing questions.\nYes, sir.\nThank you, Mr. Chairman.\nPage three, second from the bottom, HB 383.\nThis is the Georgia High School NIL Protection Act and this bill codifies what's in place\nby the Athletic Associations for High School Student Athletes. It puts a sunset on contracts\nthat high school athletes currently have so that when they finish high school, that contract\nends and then they renegotiate contracts at the next level.\nOkay, I don't see any questions. Thank you. Yes, sir.\nMr. Chairman, on the top of page 8, the very top House Resolution 174, this is a constitutional\namendment that would move our state school board from being appointed by the governor\nto being elected in the same manner that we elected the OT board currently, state school\nboard would then recruit and hire a state school superintendent.\nOkay, don't see any questions.\nThanks, Mr. Chairman.\nYes sir, in March.\nMore in Chairman, page eight, fourth built down, House Resolution 450.\nThis would authorize putting a question on the 2026 ballot asking Georgians if they wanted\nto legalize mobile sports, mobile online sports betting only.\nOkay, we do have a question for you, Jim Stevens has a question.\nThank you, Mr. Chairman.\nI want to make sure that I'm clear of what I'm voting on.\nIs this, am I voting for hope and pre-K money?\nThat's correct.\nThank you.\nOK.\nNo other questions.\nThank you.\nOne other?\nYes, sir.\nIf you flip the back to page seven, almost two-thirds\nthe way down, HB 686.\nThis would be the enabling language.\nShould that constitutional amendment pass?\nOK.\nThanks, sir.\nYes, sir.\nThank you Mr. Chairman. I bring you House Bill 439 is on page 4 about the middle. House 439 relates to the compensation of dealers and merchants for reporting and paying taxes and the reimbursement deduction. This is your local hardware store or a boutique or a restaurant.\nIn 2024, there was a study committee that looked at the impacts of sales and excise tax and\nMerchant fees on card processing and one of the things they recommended was to\nSupport small bid this by raising the vendors compensation\nRight now the vendors compensation is 3% of the first $3,000\nThis bill raises to the first 3% of\nof $10,000 and it remains one half a 1% over $10,000 so it's just the first 3% of the $10,000.\nI asked the revenue department, they had not vendished compensation and not been raised\nin at least 20 years.\nThis bill would help small businesses bottom line and I think it's really good timing\nwith Hurricane Elaine, a lot of small businesses suffering from that also.\nThank you.\nOkay, I don't see any questions.\nThanks, sir.\nThank you.\nYes, sir.\nFranklin.\nFranklin.\nThank you, Mr. Chairman.\nThis is House Bill 357 on page nine, second down.\nAnd this, basically, gives a tax credit\nto Habitat for Humanity, up to $2 million a year\nwith the sunset and their capital.\nThey're affiliates for capital $2 million.\nI have to go in more details of the bill if you can lie,\nbut they were out here yesterday\ndoing their first ever capital build.\nand I hope many people were able to see it,\nbut there's many benefits in this,\nbut one of them would be in an effort\nto address the workforce housing in this day.\nSo happy to answer any questions, yeah?\nOkay, don't say any questions.\nThanks, sir.\nThank you, sir.\nCan we come?\nHouse Bill 330, bottom of page eight.\nHouse Bill 330 is sort of a cleanup bill\nfor some of our state income tax credit programs,\nmore specifically for the law enforcement tax credit program known as less and also\nthe peach education tax credit.\nThe bill also adds some uniformity to both programs in order to mirror some existing\ntax programs.\nIf you recall, we made some of these changes to Georgia Heart last year and these new,\nthe peach and Georgia Heart and the last act all have similar technical language to\ninclude the sunset date extensions, the pre-approval requirements and similar caps for qualified\ncontributions.\nSo, overall, a few changes to the peach and law enforcement programs, but we also add\nin language that achieves some uniformity across several detached private programs.\nAny questions, Mr. Chairman?\nYou got a question for us.\nBig protein.\nI had a question.\nWhat is the cap lifted from and to on each one?\nFor the education, it's from 15 to 20 million.\nWe raised it to 15 last year from five.\nThe law enforcement would remain at three\nand qualify contributions for corporations\nwould drop from 75% to 30%.\nOkay, don't see any other questions.\nThank you.\nYes, sir.\nChair and members of the rules committee\nOn page 8 under structured rule, House Bill 260 respectfully request this bill, which\nis an increase in the state minimum homestead from $2,000 to $5,000.\nThat would be the first increase since 1978.\nAppreciate the speaker identifying this issue and Chairman Blackman's work with the Senate\non this respectfully request that.\nOkay.\nDon't see any questions.\nThank you, Mr. Chairman.\nAnd I've got a call from the rules office.\npresented House Bill's 531-27318 respectfully request those. Thank you. Thank you.\nIf you need to leave me. Thank you, Mr. Chairman. And if I may, I have two bills. First bill is\nHB390 on page four, first bill on the page known as a halo act. What this bill seeks to do is\nprovide protections for our first responders. What it does is it creates a felony violation for\nfor obstructing or hindering them\nfrom doing their official duties on the scene.\nThere's already some provisions in the law\nto help protect our law enforcement,\nbut what this bill does, it also brings in firefighters\nand emergency medical technicians\nor emergency medical professionals\nwhen they are performing their official duties\non an act of scene.\nOkay, don't see any questions on that.\nAnd second bill, Ms. Chairman, if I may, is HB602.\nIt is on page six, seventh, down.\nIt is our campus protest bill.\nThis bill applies to students who\nreceive state scholarships, loans, or grants,\nsuch as hope to attend Georgia's public and private post\nsecondary educational institutions.\nIt says that if you are such a recipient and are convicted\nof certain acts of violence, vandalism, and aggression\nthat you will lose financial support from the state\nfor one semester, except for that.\nWe're not talking here about peaceful protest.\nThe conviction must be providing violence\nor similar unlawful behavior, damaging property\nforcefully and physically violating other's access to buildings and events and engaging in harassing behavior.\nWe've got a couple of questions for you.\nRepresentative Millen.\nThank you, Mr. Chairman, to the author over here.\nI'm sorry.\nHi.\nSo I just, I want to understand what we're trying to do with this bill.\nObviously, I would not be sitting in this chamber had it not been for students who\nprotested who were arrested, who were beaten, who were accused of being\ndisruptive and accused of being violent. My concern is this, if a student on a\ncampus violates the criminal code, gets arrested, gets convicted, gets sentenced,\ngets suspended or expelled from school, why do we also need to take away their\nfinancial support? Don't we want that student to reintegrate back\nback into an educational setting?\nWe do.\nWhat this is, this is another step, another tool for the University System, T-S-G, and our\nprivate institutions.\nWe've seen over the past year protests going on campus, and at times we've gone on\nruling.\nThis is not going after peaceful protests.\nThis is not telling students you cannot protest, you cannot have your voice heard.\nBut once the line is crossed, and there are certain crimes you commit, you will lose hope\nif convicted for one semester.\nThank you.\nThank you, Mr. Chairman.\nRepresentative Fleming, is there a rule substitute on this bill?\nI'm sorry.\nIs there a rule substitute on this bill?\nIs it not true that the bill that passed the House Higher Ed Committee would make Boeing\npissing and a sit-in under this bill, would it not penalize it for that?\nIs that not considered a peaceful protest in your mind?\nIf they are allowed to have a sit-in, they're allowed to have their protest,\nbut once it becomes unlawful and there are laws broke, that is what this bill\naffects Mr. Whip and as you know, we had three committee hearings on this with lots\nof discussion in the base.\nSo to clarify for the record, this would take away financial aid for students who\nto engage in peaceful civil disobedience?\nNo.\nIf only if they violate the law.\nNo, sir.\nYeah.\nMr. Evans.\nThank you, Mr. Chairman.\nTo the author, following up on the last question,\nyou do understand that you can peacefully violate the law.\nSo when you say that a student can be penalized\nfor otherwise unlawful behavior,\nif they are sitting in a place that they're not allowed to sit,\neven if they're not hitting anyone,\neven if they're not screaming,\nI think the civil rights taught us that this.\nIt's still unlawful and you can still be arrested.\nIs that your intention?\nAnd they can still have that peaceful protest.\nThey can still have that peaceful system.\nHow?\nHow?\nLine 36.\nOtherwise unlawful.\nOK.\nWe're going to ask a question, and we're\ngoing to answer a question, OK?\nCould you please explain how a student can engage\nin peaceful but unlawful behavior\nand not be penalized under your bill\nconsidering the line of line 36.\nOtherwise unlawful.\nWhat our bill says, as you can still,\nwe are not going after the first minute rights.\nWe are not going after saying that they cannot do this.\nWe were just saying once that line is crossed\nand laws are broken, that is what we're going after.\nWe are allowing, it is allowed.\nThat is your right to peaceful protest.\nThat is your right to have your voice heard.\nThat is right to have that.\nBut it is once you cross that line,\nand there are laws broke.\nThat is what we're going after.\nAny laws broke.\nTo me, it's pretty simple.\nYou can peaceful protest, and if you cross that line,\nand it becomes unpeaceful, unruly,\nthat is when this act will take effect.\nDo you recognize that a lot of civil rights protests\nthat led to a lot of rights being gained in the state\nand others were peaceful, but they were otherwise unlawful?\nYes, and we have seen over the past year with these protests on college campuses that there are many many\nmany peaceful protests and there are many many times where students have had their voices heard and and they have followed the law\nIt is when that line is crossed and they are breaking the law. Mr. Chairman\nHe's not answering my question. You can be peaceful and break the law\nSo just because you're being peaceful doesn't mean you're not breaking the law doesn't mean you won't get arrested and this bill\nwould take away rights of those students who are doing exactly what I think you're\nsaying you want them to be able to do like those in the civil rights movement did\nbut you're still taking away their scholarship is that your intention?\nOur intention is if you are unruly and you cross the line and you break the\nlaw and you're convicted of that crime you're going to lose hope for the\nsubstance. And the line is breaking the law not being not being loud. You have to\ngo through the process you have to you go through the trial and you have to be\nconvicted. Your bill doesn't do what you think it does thank you Mr. Chair.\nOkay, here we go. We still got several questions and obviously there's a lot of interest in this build\nI'm going to suggest that all of you that have questions get with the author and y'all have a conversation offline\nAnd we'll go ahead and try to listen to some other folks here. Thank y'all\nIf you got one quick question, isn't it true, Mr. Chairman that this does not take away hope\nThis means it takes away your ability to use hope in the next semester\nI just want to that's a very important part. It does not take away hope. It takes away the ability. Okay. Here we go. Here we go. All right. Look.\nY'all get together and have a conversation. Okay.\nThank you.\nIf you have any sense in\nGood morning, Mr. Chairman and members of the committee. I bring to you House Bill 646, which is on modified structure page\n7 at the very top House Bill 646\nfor corners and we all have a corner and our district provides minimum salaries for corners\nthroughout the state of Georgia. That is House Bill 646.\nOkay, no questions. Thank you, ma'am. Thank you.\nYes, sir.\nThank you, Mr. Chairman. I'm here to present House Bill 668. It's a little on the\nmiddle of page seven and what this bill sets to address is the fact that the\nstatutes currently on the books in Georgia with respect to service animals and\nservice dogs and training are extremely problematic because when they're\noverlaid with the Department of Justice final requirements set forth in those\nregulations it causes a much confusion as to how what the applicability is and\nthis bill sets to address all of those issues and bring Georgia in alignment\nwith surrounding the states and the federal statute.\nWould that be happy to take questions?\nOkay, I don't see any questions.\nThank you.\nAnd Mr. Chairman, I presented a House Bill 461\npreviously, so I'd also like to ask.\nOkay, don't have to ask for that again, thank you.\nThank you, sir.\nYes, sir.\nThank you, Mr. Chairman, members of the committee.\nHappy crossover.\nI was asked to present House Bill 506.\nI've already presented that previously,\nso I'll skip that one.\nWe can go to House Bill 728,\nwhich needs to be read by the clerk again.\nHouse Bill 728 provides confidence and clarity\nto our state election officials,\nbut more importantly, to our voters\nby requiring any rules and regs issued\nby the State Elections Board\nwithin 75 days of an election.\nDon't go into effect until 30 days after the election.\nThis one hasn't been read yet.\nCorrect.\nYeah, thank you.\nThank you.\nThank you, Mr. Chair.\nThank you Mr. Chairman on page 8 third from the bottom house bill 266 in\ncollaboration with Representative Ballard and Chairman Shaw bring to you a\nsubstitute to house bill 266 which would double the military retirement income\ntax exemption going from 17,500 to 35,000 with a gradual tax year increase of\nfive thousand dollars I'm starting in tax year 2027. Thank you. You don't see any\nquestions. Thank you. Yes sir. Good morning rules. Thank you for sharing my\nheavy crossover day. My bill is not on the blue sheet if it was it would have\nbeen on page four between H. B. 461 and H. B. 466. I would like to ask for H. B. 464. H. B. 464.\nI would like to ask for H. B. 464. Okay, it hadn't come out yet, right? No, just made it out of\ncommittee. Okay, thank you. May I continue? H. B. 464 simply provides protection for individuals\nwho are victims of sexual crimes or violent crime,\nbut they can report those crimes without penalties\nor prosecution or being afraid that they too will be drawn\ninto court and be prosecuted or witness jail time.\nSo simply providing victims protection\nso they will no longer or continue to be victimized.\nThank you.\nOkay, good, no questions.\nThank you.\nIt came out of the judiciary non-civil.\nThank you.\nI yield the will.\nI put a star by that.\nthank you I guess if you don't ask you don't get right okay how about wait a minute one\nmore here come on thank mr. Chairman on page last page second to the bottom house bill\nSo 577, this creates a state level solution to the vapor vapour issue that we've seen with\nillegal disposable Chinese vapes flood the market.\nNo saying questions, thanks sir.\nOkay, any members of the committee have requests.\nOkay, you've got a couple of chair lady Cooper.\nThank you, Mr. Chairman.\nHouse Bill 717 on page 7, they're down close to the bottom.\nThe Board of Medicine is asked for this.\nWe are having clinics popping up all over our state, which are using an off-label drug\nand injecting it to cause supposedly help with depression, but the drug causes hallucinations\nand out-of-body experiences and extremely likely to affect the respiratory system and\nleaving to a possible death.\nThey're totally unregulated and this will put regulations\naround them just like we get on paying clinics.\nOkay, thank you, don't see any questions.\nChairman Weaveson.\nThank you, Mr. Chairman.\nBring the House Bill 586 page nine,\nvery last bill on the blue sheets.\nAnd I want the attention about entrepreneurs in the room\nand that might be listening to us online\nbecause every entrepreneur knows what I'm about to refer\nbecause house built 586 extends the current exemption on intangibles recording\ntax on recorded security dates from three years to seven years. Currently\nbikes make 35 month loans and renew every three years to avoid this tax on the\nborrower. This measure would allow longer loans and give interest rate certainty\nto the borrower and thereby reduce paperwork on both the borrower and the\nbiker. Since this tax is currently being avoided because of these three\nor reserves, and this is important, there will be very minimal fiscal impact of the local\ngovernments which collect this tax. There's no fiscal impact to the state. It comes with\na strong support for my banking community and no long, and no objections from both either\nthe Credit Unions, ACCG or GMA. It simply offers interest rate certainty to the bar and\nreduces paperwork. Appreciate your favorable consideration in this measure.\nOkay, don't see any questions on that.\nThank you, sir.\nJim and Hawkins.\nThank you, Mr. Chairman.\nHaspill 419 came out of higher ed.\nYesterday, this is a bill that deals with Narcan.\nIs we all remember a hope that we passed a bill last year\nthat put Narcan dispensers in government buildings.\nI removed colleges and technical universities\nand technical colleges.\nI do the fact that they did not know\nhow many numbers are locations of buildings\nwith AEDs, so this bill now addresses putting those in the universities and colleges.\nThis is a very important bill.\nYou know, it only takes five minutes for brain cells to start to die on an overdose, so\nit's very imperative that these young folks have this.\nThanks, sir.\nDon't see any questions.\nJim Lonson.\nHouse Bill 5-11 on the blue sheet page 9-5 from the bottom.\nThis is a piece of model legislation that comes from the National Council of Insurance\nLegislators.\nI would note that several of our surrounding states have already passed this.\nMississippi, Alabama, Tennessee and South Carolina and several other states are considering\nat this session and in light of the storms and things that we have experienced here in\nGeorgia recently, it simply puts another tool in the toolbox for our citizens.\nIt deals with the reduction of one's taxable income by way of a catastrophic savings account\nwhich can be used in a declared catastrophic event, works much similar to a health savings\naccount.\nIt can be a regular savings account or a money market account but it's got to be designated\nas a catastrophic account and it can only be applied for one's individual home.\nOkay, I don't see any questions.\nThank you, sir.\nChairman Jasper's.\nThank you, Mr. Chairman.\nI have two bills, House Bill 248,\nthe geothermal tax credit on page eight.\nAnd additionally, today I have on page six,\nHouse Bill 604.\nSo bill that's come from my community\nand that those around me,\nit will give the local elections superintendent\nthe ability to do a hand accounting, not a recount,\nbut a hand accounting of all ballots cast in one race.\nIt is very permissive for their superintendent,\nand it allows them to terminate it immediately\nif they've so seen that it was in interfering\nwith the normal counting the ballots.\nWhere it comes from is when a community wants\nto do a hand accounting or recount,\nthere's no letter of the law that allows them to do this.\nAnd so local attorneys choose to rule against it and not allow the election boards to do it.\nThank you, sir.\nOkay.\nDon't see any questions.\nIs that everybody on the committee?\nOkay.\nSpeakers have been fussing at me because we've been getting in there late.\nAnd I told them we were going to make up for that today.\nSo we're not going to add anything to the calendar this morning.\nabout 20 something bills that are on the calendar already. I would expect to be\ntalking with you later on around lunchtime so just hang around and it's gonna be\na long day so let's all be on our best behavior and have a good day. Thank you.\n",
  "updated_at": "2026-02-12T18:22:53.559371+00:00"
}