{
  "video_id": "K5p_QxnD30o",
  "url": "https://www.youtube.com/watch?v=K5p_QxnD30o",
  "title": "Press Conference with Senator Jones & Former Senator Jason Esteves | 12/8/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 21,
  "summary": "Here is a structured markdown summary of the key points from the Georgia legislature floor session transcript:\n\n## Overview\nThe transcript highlights a press conference with Senator Jones and former Senator Jason Estevez discussing the impending healthcare crisis in Georgia due to the expiration of federal ACA subsidies. They call on Republican leadership to take action to protect healthcare access and affordability for Georgians.\n\n## Key Actions\n**SB 192**: The Georgia Health Insurance Affordability and Consumer Protection Act, introduced by former Senator Estevez to address the healthcare coverage gap when federal subsidies expire.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced in this transcript.\n\n## Notable Moments\n- Senator Jones criticizes Republicans for refusing to address the healthcare affordability crisis and failing to pass solutions like SB 192.\n- Former Senator Estevez shares his personal experience seeing the impacts of the healthcare crisis as the husband of a nurse practitioner. He pledges that as a future leader, he will fight to expand Medicaid and lower insurance premiums.\n- Kiana Randi Gregory and her mother Marilyn share how the loss of healthcare subsidies has impacted their family.\n\n## Votes\nThe transcript indicates that SB 192 was introduced but not passed, implying it failed to receive enough votes.\n\n## Attendance\nNo specific quorum or attendance details provided.\n\n## Adjournment\nThe transcript does not mention the session adjourning or provide details on the next scheduled session.",
  "transcript": "I want to thank everybody for coming today.\nQuite simply, Georgia is facing a health care crisis,\nand the Republicans will not act to help Georgia's families.\nThe picture is bleak, and it is widely\nheld that Georgia's health care system is failing.\nIt would only get worse with the expiration\nof the federal ACA subsidies.\nBecause of new federal laws in our state and action,\nover the next year, almost 500,000\nGeorgians could lose health care.\nOver the next decade, we could lose over 33,000 jobs,\nand billions lost in healthcare revenue\nand additional billions in uncomplicated care.\nYet Georgia Republicans refused to act.\nIn fact, they marched blindly and willingly off of this cliff.\nBut the numbers do not tell the personal story\nthat so many of our Georgia families are actually facing.\nMany Georgians will see their insurance premiums\ndouble or even triple.\nWhen we talk about job loss,\nthat means people's ability to take care of their families\nis lost.\nThis is not about politics to these people.\nIt is about survival.\nYou know, when people go to the polls and they elect us,\nthey elect us to try to help solve their problems.\nWhen people of this state voted for President Trump\nand Republicans, they were trusting that they were\nto address issues impacting their families\nand especially the health care affordability crisis.\nYet the president instead of addressing\nthe affordability crisis says that the use of the term\nis actually a con job.\nYou see, the Republicans to them affordability\nis simply a political buzz word, but to Democrats,\nwe understand that is a term that properly encompasses\nfolks' concern about rising health care costs,\neducation costs, and even housing costs.\nFortibility is not a con job.\nThe con job is the one that's been laid\non the people of Georgia by the Republicans\nthat they would promise to do something about these issues.\nNot only do Republicans refuse to act,\nthey actively ignore legislation that will bring solutions\nto these problems.\nConcerning this health crisis,\nDemocrats led by former Senator Jason Estevez\nintroduced SB192.\nBecause this caucus realized the very possibility\nthat President Trump and Congress,\nand the name of politics,\nwould refuse to help people\nand allow the subsidies to expire.\nSenator Estevez, along with this caucus,\nis providing solutions to help the people of the state.\nAnd so SB192 was one of those solutions.\nMake no mistake over the next few months in these hallways.\nAnd around this state, we're going to be laser focused\non showing the people of this state which parties\nabout finding solutions and which parties about politics.\nAnd one of the leaders of our state\nwho will help us find solutions, as he did with SB 192,\nis Senator Jason S. Tess.\nWith that, I'll give it to Senator Jason S. Tess.\nThank you.\nThank you so much, Leader, and thank you to the Gregory as well, introduced in a second\nfor being here this morning, and to my former colleagues in the State Senate.\nThank you for continuing to fight to protect and expand access to health care in this\nstate.\nMy name is Jason Estevez, and I am proud to be working across this state to change leadership,\nas Georgians deserve better than the leadership\nthat we are seeing here today.\nAs a former educator, as someone who's\non the Atlanta Public Schools Board of Education,\nas a former state senator, but more importantly,\nas the husband of a wife who's a nurse practitioner\nand owns an urgent care in Metro Atlanta,\nI've seen the impacts of this failure in leadership firsthand.\nI've seen what happens when Republicans refuse to act\non expanding access to health care,\nand what that means for families across the state.\nAnd now in just a few weeks,\nmillions of Georgians are on the verge\nof either losing access to the health insurance\nthat they need or seeing their premiums skyrocket.\nPremiums that were already unaffordable.\nWhy is that?\nBecause Donald Trump and his cheerleaders have failed to act\nand extend the subsidies that so many people rely on.\nOver 1.5 million Georgians benefit from those subsidies today\nand they are at risk of losing it\nbecause of the failure of Republicans act.\nSo let's talk about what that exactly means.\nThat means that parents who are gonna be unable\nto get health insurance,\neven though they're working two to three jobs\neach just to stay afloat.\nIt means families are forced to choose between\nlife-saving medical care and putting food\non the table or roof over their head.\nIn a state where 15 to 20% of Georgians\nhave billions of dollars in medical debt already,\nfolks can't afford to lose their health insurance.\nNot only that, small business owners like my wife and I\nare going to be unable to pay for their employee's health\ninsurance.\nWe knew that this crisis would happen long before today.\nThat's why I authored SB192, the Georgia Health Insurance\nof Fortability and Consumer Protection Act.\nThis legislation would fill in the gaps and coverage\nwhen federal benefits expire at the end of the month.\nIt ensures that we protect Georgia's health care\nin the face of a chaos coming out of Washington DC.\nMy colleagues and I brought this necessary legislation\nto the Senate floor, but Republicans,\nlike Lieutenant Governor Bert Jones\nand others refused to pass it.\nBrian Kemp refused to show leadership\nand get his allies on board with protecting health care.\nAnd now, as health insurance is being ripped away\nfrom millions of Georgians,\nthe governor and his allies are still sitting on their hands.\nBert Jones, Brad Raffisberger, and Chris Carr\nhave even cheered on this destruction\ncoming out of Trump's White House and Republicans\nin Congress.\nSo let me be clear, we are in crisis.\nAnd in times of crisis, we run towards that fight.\nAnd because we are in crisis, we're\ngoing to step up when we are in leadership.\nWe're going to do what we should have done over a decade ago\nand expand access to Medicaid.\nBut we won't stop there.\nWe're also going to lower the cost of private health\ninsurance and make that more affordable by lowering the health insurance premiums and\nbuilding health care hubs throughout this state.\nWe'll make sure to make it easier for Georgians to get the care they need, not harder.\nYou can count on me, you can count on Senate Democrats to use every tool in our toolbox\nto help the people of this state get the services that they need.\nAnd there's no excuse for Republicans failures.\nAnd it's time to act now.\nSo we are calling on Brian Kemp and state Republican leaders to protect health care now,\npass SB 192 next session, and use the state's resources over $14.9 billion sitting in a bank\naccount to ensure that Georgians aren't left out in the cold.\nWe want to make sure that every Georgian who is looking at December 31st with fear and\nworry to know that Senate Democrats stand with you, that we stand with you, and that I\nstand with you.\nAnd here's my commitment to you.\nI will always put your health first.\nThat's what I've done my entire career, and it's what I'll continue to do as a leader\nin the state.\nNo matter what attacks Trump and Republicans throw away, we'll fight for you.\nNow I'd like to introduce Kiana Randi, Kiana Randi Gregory, and their mother, Marilyn.\nMarilyn and Randi Gregory will be speaking to discuss how their families are being impacted\nby the lack of leadership Republicans have shown and by the expiring healthcare subsidies\nin the state.\nHi, thank you for being here today. My name is Randy Gregory, and I'm here because what's\nhappening with health care right now is personal, not just for me, but for so many people\nin our state. Several months ago, I lost my job, and let me tell you nothing prepares\nyou for how fast life can change. One day, I had employer insurance, and the next I\nessentially rely on Medicaid just as they covered. I'm truly grateful it was\nthere because it kept me from going completely uninsured while I try to get\nback on my feet and started freelancing.\nThank you. However, trying to figure out which doctors take my plan, waiting\nforever for approvals, feeling like I'm doing paperwork every day is very\nexhausting. Not to mention demoralizing every time we hear someone say sorry\nare you, we don't take Medicaid.\nWell, you're already stressed\nnow that getting healthcare\nshouldn't feel like another full-time job.\nI recently got the notice that the plan I qualify for\nis jumping to over $150 a month\nafter previously being $0, aka free.\nI'm making money again, but nowhere near what I earned before.\nThat price increase might not sound huge to some people,\nbut for me and for so many others,\ntrying to stay afloat is the difference\nbetween stability and spiraling.\nIt was really scary and I know I'm not the only person\nwho was thinking how are we gonna do this.\nThese subsidies help healthcare within reach\nfor everyday people and losing them means thousand of us\nare about to see premium jumping away.\nWe simply cannot afford.\nSo I'm asking our leaders to please not let this happen.\nDon't let people be priced out of something\nas basic and essential as healthcare.\nLower the cost, fix the system so it actually works\nwhen we need it, make it so that getting care\ndoesn't feel like fighting through obstacles\nevery step of the way.\nWe deserve healthcare that is affordable and accessible.\nWe deserve a system that helps people stay healthy\ninstead of getting pushed deeper into stress and debt.\nAnd we just simply deserve better.\nAnd that is why I'm so happy to be supporting\nfor my Senator Jason Estevez and his renter governor.\nThank you.\nHello.\nGood afternoon, and thank you for allowing me\nthis moment to speak. My name is Marilyn Gregory, I'm 61 years old, and I work hard. And\nlike so many Americans, I live on a modest income. I've been planning for my future at\nworking towards purchase in a home next year, and that's what kept me focused and hopeful\nand determined. But hope shook just a little bit when I opened that letter, and it said\nthat my insurance premium was going from $86 a month to $522 a month.\nMy heart skipped a beat, y'all, because let's be honest, no matter how hard you budget,\nno matter how careful you are, there's just no room for $436 increase.\nNot with rent, utilities, groceries, and certainly not with a new mortgage on the horizon.\nAnd the weight of it isn't just financial, it's medical.\nI have appointments I've waited months for, for neurologists and a room, room of towel\nthis next year.\nAnd changing insurances could mean new doctors, new referrals, and starting the whole process\nover again.\nThat means more time waiting for answers, more time living with uncertainty about what's\ngoing on with my health.\nTime matters, especially when it comes to our health.\nAnd I know I'm not alone.\nThere are thousands, millions of people who are living paycheck to paycheck doing everything\nright and still being asked to choose between their health and their stability.\nI spoke to another Georgian who's 60 years old who had to have emergency surgery this year.\nHer insurance is going, she makes $45,000 a year.\nHer insurance is going from $286 a month to over $700 a month.\nNo one should have to choose between paying for insurance and keeping a roof over their head.\nNo one should have to choose between seeing a specialist and buying insurance.\nAnd that's why I'm here today to say I support former Senator Jason Estevez and his run for\ngovernor.\nThank you.\nThank you to any questions.\nWhat do you expect the whole change this next year as a live play session that's under\nthe way it comes to the field?\nCan you talk to your colleagues on the other side of the pile in the patient that you\ncan have bipartisan support for that?\nI think what's really happening is there's a hope that the ACC subsidies won't not expire.\nBut it doesn't look like that, so I want to take place.\nIt looks like they will expire.\nAnd so I think at that point in time a real conversation has to take place.\nThat conversation should already happen quite frankly.\nAnd this bill particularly just sat there.\nAnd anyone who could kind of read the tea leaves over the summer and also even during a legislative session\ncould see what we were kind of heading that these ACA subsidies were most likely going to be allowed to expire.\nAnd when we're in our positions to do these things to actually make decisions for people,\nthat's when we should have came together and said, okay, we have a piece of legislation.\nIt could have been somebody else could have drafted a legislation.\nBut we have legislation.\nLet's try to act on this because we see which way\nthe federal government is actually going.\nAnd that's the key.\nWhen you're actually tied to the federal government\nin this situation as we are, you have to look at that\nand say, we've got to make sure the people of Georgia\nare actually protected.\nAnd that's what's going to happen.\nSo we're going to continue to push this particular issue.\nIf the subsidies are allowed to expire,\nthis bill is going to be still pending as we know.\nAnother member of our caucus will pick that bill up\nand really fight for it.\nAnd at that point in time,\nWe know we have to have bipartisan support.\nWe can't pass anything without Republican help,\nquite frankly.\nSo we know that has to take place.\nThat's already a given.\nThe question is, are they going to be willing\nto actually come to the table and say,\nwe're going to do right for the Georgia's families?\nAre we going to continue to just pay politics?\nBecause I think it's important to note\nthat the governor has touted the fact\nthat 1.6 million Georgians are now ensured\nbecause of his health policies.\n1.5 million of those 1.6 are insured under Georgia access,\nwhich is the Affordable Care Act.\nSo with these expiring health subsidies,\nwhat that's going to mean is that close to a million people\nare going to find their premium skyrocket,\nand the Kaiser Family Foundation believes\nthat more than half of those folks are going to get dropped\nfrom coverage because they won't be able to afford it.\nSo under Republican leadership,\nunder this governor, we're going to go from having 1.6 million\nGeorgians insured through access to pathways of coverage\nand through Georgia access.\nAnd we're going to go to maybe having around 500,000 Georgians\ninsured.\nThat's close to 2 million Georgians being uninsured\nbecause of the failures, not only of what's\nhappening in Washington, DC, but the fact\nthat Georgia Republicans are sitting on their hands\nwith something, as the leader said,\nshould have been discussed and acted on a long time ago.\nThere's no reason that we could not have acted\non this legislation this year,\nbut they don't wanna do it\nbecause they don't wanna embarrass Republicans in Washington\nand as a result,\nGeorgians in this state are gonna be suffering.\nWe need leadership to step up\nand do something about it now.\nYeah, I mean, I certainly think that would be one of the ways we could find funding for\nthis when I think since as the best talked about $14 billion in surplus and we're talking\nabout you've heard the personal stories here.\nSome of these families are going to be suffering through this.\nWe have to try to find an avenue to make sure we bridge this gap that's going to exist.\nAnd this is one of those issues that is obvious.\nThere's no doubt what is going to happen if these subsidies are allowed to expire.\nEveryone agrees on that.\nThere's no doubt about that.\nThere's a consensus with that.\nTherefore, the only reason not to actually pursue this bill or similar legislation would\nbe just politics.\nAnd that's former Senator Esfet says it's just to protect those up in Washington.\nThat's the only other reason.\nSometimes you can have legislation where you say, well, maybe this will happen or maybe\nthat will happen.\nIn this particular situation, no one really doubts exactly what will take place.\nYou just heard from families talking about their previously gone up.\nWe know that is exactly what is going to take place.\nWhen you have that information, you have to act.\nAnd a refusal to act is basically just paying partisan politics.\nSo, the answer to both your questions, one, uh, you, uh, you, you, you, you, you, you,\nSo the answer to both your questions, one, the Governor can still act using executive\naction to make sure that we get people covered under plans that are more affordable.\nAnd to your point, price increases have already been filed with departments all across\nthe country, so there's a lot of support that would be needed.\nGeorgia has the tools that it needs to make sure, especially those who are covered through\nGeorgia access, to make sure that those insurance premiums are subsidized.\nIt just takes the governor and legislative leaders stepping up to the plate and making sure\nthat Jordan's get covered.\nBehind the scenes, Republicans know that health care is in crisis in this state.\nThey know that we should have expanded Medicaid over a decade ago.\nThey know that Georgia access needs a lot more support.\nThey also know that pathways the coverage has been a complete failure by spending $100 million\non a plan that covers less than 10,000 people in this state.\nAnd they also know that we have to do something about all of those things.\nSo what we need are leaders that are going to step up and actually get something done\nby putting Georgians first and ignoring,\nand not getting distracted by what's happening\nin Washington, D.C.\nYeah.\nThe fiscal note has not been prepared for this bill.\nNo.\nYou've filed a bill in a few minutes.\nWell, this bill in particular would have started\nwith a pilot program, so it would have been very limited,\nand would have cost under $100 million.\nWe didn't, we didn't do a fiscal note, it was just an estimate, yeah.\nSo part of the legislation, now I want to get back to one of your questions too, get\nback to your questions too.\nNumber one, when you're asking about the already closing, it's the subsidies, which means\nyou actually can help people even if they're actually as close, that's what the government\nwould actually be doing.\nThen secondly, as far as behind the scenes,\nlet's say you even talk about in front of the scenes,\nthis bill didn't even get a hearing actually.\nAnd that is very important.\nSo not only behind the scenes, we not really heard,\nbut also openly it did not even get a hearing.\nAnd so also part of this particular legislation\nmade note, please, part of this legislation\nwas that we would actually look at this legislation\nfrom a fiscal standpoint, but it had to get passed first.\nbut I do think the initial estimate about $100 million,\nwhich would help as far as being a subsidy is concerned,\nto actually lower costs, that's gonna be the key thing.\nBecause it's a subsidy, so you're actually helping\nsomebody as far as the premium may go up,\nbut you're actually helping them actually be able\nto pay that, that's the key thing, so.\nBut I think the key is, when a bill like this\ndoesn't even get a meaningful hearing,\nI think that is extremely key.\nYeah, and just to be clear, the program did not cost,\nor was not estimated cost $100 million.\nIt was gonna be much less than that.\nThe key about this program across the country,\nthere are states that have already implemented direct\nsubsidy programs through the Affordable Care Act.\nAnd the goal there is to supplement\nwhat's happening with the federal subsidies\nand provide direct subsidies to citizens of the state.\nSo to give you an example, if the premium was $150,\nthe state would subsidize a hundred of those dollars\nfor over the course of the year, that's $1,200, right?\nSo just to give you an idea of how much that would be\nfor each resident, and then when you talk about\nadministrative costs on top of that.\nSo it's much less complicated than, for example,\nexpanding Medicaid and having to deal with that\nkind of administrative burden.\nAny others?\nThank you so much for coming out.\nThank you.\nYou\n",
  "updated_at": "2026-02-12T18:37:59.093018+00:00"
}