{
  "video_id": "k8HVsGz18YQ",
  "url": "https://youtu.be/k8HVsGz18YQ?t=1176",
  "title": "Georgia House - Day 4 (2026-01-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-01-14",
  "duration_minutes": 69,
  "summary": "Here is a summary of the Georgia House session on 2026-01-14:\n\n**Overview**\nThis was a routine morning session with no major legislative actions. The focus was on a devotional message from the chaplain, Rep. Randy Nix, who discussed the importance of seeing one's circumstances as an opportunity to serve and reflect God's love.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Rep. Randy Nix delivered the opening devotional, sharing a personal story about being \"trapped\" in an airport during a snowstorm and finding ways to serve and minister to others in that situation.\n- The Speaker praised Rep. Nix for his work as chair of the House Ethics Committee, noting his integrity and leadership.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, with all members reporting to the floor and voting to signify their attendance.\n\n**Adjournment**\nThe session adjourned without a specific next session date mentioned.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe hour for convening, having arrived, all members of the police take their seats.\nAll members of this house will please report to the floor and take your seats, the clerk\nor ring the bell.\nAll members will report to the floor.\nWe're about to have the morning roll call.\nOkay, all members present in this house will please vote green to signify their presence\nin the chamber and the clerk will unlock the machines.\nall members voted, have all members voted. If so, the clerk will lock the machines.\nkeepers will please close the doors and keep them closed.\nWell, good morning and happy Friday.\nMost of the, I guess this is our first week is over,\neven though we weren't here all five days,\nbut it's always good to be here on Friday.\nWe'll talk a little bit more about next week near the end,\nbut we're going to begin our day-to-day\nwith scripture reading in prayer by the Chaplain,\nafter which we will pledge allegiance to the flag of our country.\nThis is not the first time that Chairman Randy Knicks has been called out of the bullpen in\nrelief or sent to bat when things were looking bad to pinch it and he always does an amazing job.\nAs all of you know, Randy's been here now for a number of years. He chairs our House Ethics Committee.\nwhich is not a job that wins you many friends, but I don't know of anyone who has integrity\nthat brings credit to all of us more so than Randy Knicks.\nhas become a friend of mine, someone that I lean on and go to and respect and admire just\nbecause he's such an honorable member.\nAnd I'm going to talk about his political future, but I'm going to say today, if you haven't\nheard Randy get be our chaplain you are in for a real treat so without any\nfurther ado I'm going to introduce to you our chaplain of the day to day the\nchairman of the Health House Ethics Committee chairman Randy Nick's chairman\nNick's\nthank you mr. Speaker this is a little bit of a of a pinch yet I was just getting\nready to get in the car this morning to drive in when I got the call.\nAnd it wasn't, it was a pretty short walk from the bullpen.\nI want to read, you're supposed to finish with the poem, but I want to start with the poem\nif I made a day.\nThis always spoke to me as a pastor.\nThe title of the poem is The Preacher's Mistake.\nThe Preacher's Mistake.\nit's by William Croswell Don. It says, the parish priest of austerity climbed up in a high\nchurch steeple to be nearer God so that he might hand his word down to his people. When the\nsun was high, when the sun was low, the good man said, unheeding, sublinary things from\ntranscendency was he forever reading. And now, and again, when he heard the\nCreek of the Weathervane attorney, he closed his eyes and said of a truth from\nGod I now am learning. And in Sermon's script, he daily wrote what he thought\nwas sent from heaven. And he dropped this down on his people's heads two times\none day and seven. In his age, God said, come down and die, and he cried out from\nthe steeple. Where art thou Lord and the Lord replied down here among my\npeople. So I am here among my people today. I have not had a tremendous amount of\ntime to prepare, but it's always good. And I just prayed that the Lord would\ngive me a word to say that might be meaningful to you and might help you. I thought immediately\nMr. Speaker of a passage of scripture here and maybe some of it fits and maybe some of\nit doesn't, but I want to go to the 10th chapter of Matthew. And the 10th chapter of Matthew\nJesus is calling the 12. He's calling his disciples and he's sending them out and telling\nthem what he wants to do and he's also preparing them for some very tough times for difficulties.\nIn verse 7 though it says, and this is probably the most important thing, it says, as you\ngo, preach this message, the kingdom of heaven is near.\nAnd then he goes on down in verse 17 and I read this a little bit with tongue and cheek,\nbut hopefully I can make a point.\nHe said, be on your guard against men.\nThey will hand you over to the local councils\nand flag you in their synagogues.\nI haven't been flagged yet.\nOn my account, you will be brought before governors\nand kings and state representatives.\nI'm adding that in as witnesses to them and to the Gentiles.\nBut when they arrest you, do not worry about what\nto say or how to say it, at that time you will be given what to say for it is not you speaking\nbut the spirit of your father speaking through you.\nSo I hope I don't get flogged.\nI hope I don't get arrested.\nIf I get flogged, then we're going to do it on the biblical method, the one that has\nnever made a mistake gets to hit me first.\nSo, Brother Al, we'll talk that over if we get to that point.\nWhen I don't have a lot of time to prepare, I usually try to find something that's meaningful\nand share it with you.\nI want to share just a brief devotional.\nThis came out of the upper room on Wednesday, December the 15th of this year.\nI think there's a great message in it for us as representatives and for us as people\nwho may profess Jesus Christ or just us as citizens in general.\nThe title of the little devotion is trapped in the airport and it's the scripture that's\ngiven one verse that says, the Lord says, seek the welfare of the city where I have sent\nyou.\nNow, this person writes, and it always tells you at the end who it is, it's a gentleman\nby the name of Leland P. Gamson from Indiana.\nAnd here's what he writes.\nHe said, we're calling because we need your prayers, Pastor.\nWe are trapped between flights in Chicago because of the snowstorm.\nOur pastor asks, are you inside where it is dry and climate controlled?\nYes, I reply.\nDo you have access to water and food?\nAgain, I said yes.\nThen he asked, are you sick?\nI answered no.\nHe said to me, then you aren't really trapped, are you?\nI'll pray for you to be of service to the Lord\nwhere you are.\nWe prayed together in my attitude changed almost immediately.\nI bought children's books at an airport store\nand offered them to families with children.\nMy wife struck up a conversation with an older man wearing a Korean war veteran's head.\nLater we offered to wait in the food line for others.\nIt became easy for us to approach others knowing we were all in the same situation.\nAdditionally, several worried-looking stranded passengers accepted our offer to pray with\nthem.\nThe 16 hours in the terminal went rather quickly when we made ourselves available to others.\nWe were not trapped.\nWe were in the right place at the right time to reflect the love of God, and I hope you\nwill just dwell on that last thought for a moment.\nI do believe that we're put in the places that we're put in for a reason.\nSome of them may seem difficult, some of them may be challenging, but I believe if we'll\nlook at them right, we come to the Lord, I think like this man some time, and we pray\nis if we've got some kind of major problem,\nsome kind of catastrophe on us,\nwhen we're just not looking at the situation right.\nAnd I think if we'll get that attitude\nthat says we are where we are to reflect the love of God\nand do that, then I think that all of these other things\nseem to work themselves out very easily.\nSo I challenge you today in this place,\nin your district wherever you are.\nThe scripture says, seek the welfare of the city\nwhere I have sent you.\nIt's the Lord sends you today.\nPlease do your best to reflect the love of God\nwherever you go.\nLet's pray.\nFather of grace and mercy, we thank you for this beautiful day.\nLord, we thank you for the privilege\nto be observant of service to others.\nLord, I pray that you would bless each person here today,\nbless each person in this house,\nthat their goal would be to serve you, Lord,\nand to share your love with all of those\nthat they come in contact with.\nLord, I pray for our speaker, is he ledges?\nLord, I pray for all of our leadership.\nI pray for our governor, our lieutenant governor.\nWe pray for those at the head of our federal government,\nLord, that you would give them your vision,\nthat you would give them the vision\nthat would bring this nation back to you.\nFor it's in Christ's name I pray.\nAmen.\nPlease join me in the pledge of allegiance.\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands.\nOne nation under God, indivisible with liberty and justice for all.\nDoorkeepers will unlock the doors.\nThank you, thank you, thank you.\nChair recognizes the Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the Journal of Revis legislative day\nand to find it to be correct.\nAnd Mr. Speaker, procrastination is totally a good thing.\nYou always have something to do tomorrow.\nPlus, you don't have anything to do today.\nChairman John Corbett.\nAnd I think that's the way he does his daily activities.\nChairman Hogan, the chair of the committee\nown information and audits, reports among other things that the journal of the previous\nlegislative day has been read and found to be correct. Is there any objection to the confirmation\nof the journal? The chair here is none, the journal is confirmed. The clerk will read\nthe resolution establishing the order of business for the day.\nMr. Burns, only 59 minutes following me establishes the order of business in the first\npart of the period unanimous concerns, introduction to bills and resolutions, first reading and\nreference of House bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, third reading and passage of uncontested local bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day. The chair here's none and the resolution is adopted. First reading of Bills\nand Resolutions, the clerk will read. House Bill 855, I represent Connard of the 102nd\nHitches on 61st, Eucaly, the 136th Jones of the 25th crowd, the 110th and others. Bill\nB. Todd, an act to amend chapter 9, a title 34 of the fish book of George Amitetti, relating\nto workers compensation. Industry and labor. House Bill 867, I represent Newton, the 123rd\nattached to 150th Parish and 158 Stevens, 164th and 930th.\nBill Mehton and act to men, chapter 64,\ntop of 33, the Fisherbook of Georgia,\nannotated relating regulation and licensure\nof pharmacy benefit managers.\nSpecial committee on access to quality health care.\nHouse bill 900 by representatives,\nscope fee to the 60th, scount of the 76,\nDavis the 87th, drier of the 59th,\nMitchell the 106th and others.\nBill Mehton and act to men, article on chapter 13\nTitle 50 of the official go to Georgia and Tater Relaying the General Provisions of Administrative Procedure.\nJudiciary, House Bill 901 by Representative Roberts, the 52nd Harlem 54th, Oliver, the 82nd\nBowdie, the 62nd winner, the 89th, and others, Ability Title, Mac to Men, Chapter 31,\nand Title 36 of the official go to Georgia and Tater Relaying and Incorporation and Municipal\nCorporations.\nGovernmental Affairs, House Bill 902 by Representative Scott Field, the 60th Hutchinson,\nand another in the seventh.\nWe're in the 96th, Mitchell of the 88th,\nScott of the 76th and others.\nBill B. Todd of NACTA,\nand an article on the chapter 24 of Title 33,\nthe official of the Georgia Annotated,\nrelating to general provisions,\nregarding insurance.\nInsurance.\nHouse Bill 903 by reps of Gullah,\nthe 19th, probably the 67th,\nwent on to the 17th.\nScott goes to the 14th and gambled with the 15th.\nBill B. Todd of NACTA,\nand an article on the chapter three of Title 12,\nthe official of the Georgia Annotated,\nrelating to general provisions regarding parks.\nPublic safety and homeland security.\nHouse Bill 904, my resident,\nbased more than 63rd, Beverly, the 143rd,\nMitchell, the 88th, Lansky, the 79th,\nand Euclide, the 136th.\nBill B. Todd, an act to amend Part 2 of Article 16\nand Chapter 2, a total 20 of the physical\nto Georgia and the state are relating\nto the student discipline.\nEducation.\nHouse Bill 905, by Representative Williams,\nthe 145th, Hitchens, the 161st,\nLumps, the Mid-12th, Gunner, or the 8th,\nCrow, the 110th, and others.\nBill B. Todd, an act to amend Code Section\n16, 11, 62 with the fish below George annotator,\nrelaying the eavesdropping.\nJudiciary non-simile.\nHospital 906 by reps of next to the 69th Collins\nthe 68th Williams the 168th Smith the 18th\nand Fleming the 121st.\nBill Binton and act to men chapter 7,\nTitle 40 of the physical that George annotator\nrelating off road vehicles.\nJudiciary non-simile.\nHospital 907 by reps of Smith the 18th lever\nto the 33rd Collins the 68th.\nThey'll be ton of active men code section 21 to 540,\nthe fiscal to Georgia annotated relay\nin the conduct of special primaries\nand special elections.\nGovernmental affairs.\nCouncilman 908 by Ratsen, Smith of the 18th lever\nto the 33rd in Collins of the 68th.\nThey'll be ton of active men code section 21 to 540,\nthe fiscal to Georgia annotated relay\nin the conduct of special primaries.\nGovernmental affairs.\nCouncilman 909 by Ropeson.\nNext to the 69th, Smith of the 133rd,\nJacob's the 132nd.\nHe'll be taught an act to amend the act\ncreating the Board of Commissioners\nof Troop County.\nIntergovernmental coordination.\nHouse Bill 910 by Robson.\nBoston 7 Jones in the 47th.\nBurns 159th, England in the 116th.\nHe'll be taught an act to amend the act\nmaking and providing appropriations\nfor the state fiscal year,\nbeginning July 1st, 2021.\nAppropriations.\nHouse Bill 911 by Robson in the 7th.\nJones to the 47th Burns 159th England of the 116th.\nBill B. Todd and Acta make a provide appropriations\nfor state fiscal year beginning July 1st, 2022.\nAppropriations.\nHouse Bill 912 by reps in the roster of the 7th Jones\nto the 47th Burns to the 159th and England of the 116th.\nBill B. Todd and Acta amend the NAC making\nand providing appropriations for the state fiscal year\nbeginning July 1st, 2021.\nAppropriations.\nHouse Bill 913 by reps in the roster of the 7th Jones\n47th Burns on 15th 9th, and England in the 116th,\nBill B. Todd and Active Man, the NAAC making\nand providing appropriations for the State Fiscal Year\nbeginning in July 1st, 2021.\nProperation on 914, there are up to the Rolston 7 Jones\nand the 47th Burns on 59th, and England in the 116th,\nBill B. Todd and Active Man can provide appropriations\nfor the State Fiscal Year beginning in July 1st, 2022.\nAppropriations on 915, there are up to the 7 Jones\nthe 47th burns on 159th in England of the 116th.\nBill B. Todd and Active make and provide appropriations\nfor state fiscal year beginning July 1st, 2022.\nAppropriations.\nHospital 916, my brothers and revered to the 33rd\nin Valensky of the 79th.\nBill B. Todd and Active,\nand title five with the physical\nof Georgia and Tated relating to appeal and error.\nJudiciary.\nHospital 917, my brothers and Cameron of the 1st\nand Tarvern of the 2nd.\nBill B. Todd and Active,\nin part three of Article 4, chapter 11 of Title 16,\nwith the official go to Georgia annotator relating\nto carrying in possession of firearms.\nPublic safety and homeland security.\nHospital 918, I represent Chokus,\nthe 38th Cooper, the 43rd newton, the 23rd,\nand Stevens, the 164th building,\nTotted an act to amend Title 31 of the physical\nto Georgia annotator relating to health.\nHealth and human services.\nHouse Resolution 576 by Grimmings,\ngo field of 60th Scott of the 76th Bernal,\nthe 77th Sharper, the 177th and Hutchinson, the 177th and others. Resolution\nencouraging support of urban agriculture by local governance. Agriculture and\nconsumer affairs. House of Resolution 577 by\nRep. Kofi, the 16th Scott, the 76th Mitchell, the 88th\nHoward, the 124th and Frazier, the 126th Resolution, recognizing the need for\nincreased awareness, education, and research. Helped in human services. House\nResolution 578 by Representative Scofield of the 60th Mitchell of the 88th Scott of the 76th Hudgenson and 107 Jackson 64th and others\nResolution recognized in the National Black Caucus of State Legislatures\nState planning and community affairs house resolution 579 by resident Parsons of 44th and all of what's in 42nd\n$1.45, welcome to the 81st and parish in 158th,\na resolution creating the Georgia Commission\non Sustainability and Economic Opportunity.\nSmall business development.\nThat completes the first readers.\nSecond rating of bills and resolutions.\nThe clerk will read.\nHouse Bill 865, I represent a curvy of the 114th,\nthe bill relating to labor and industrial relations.\nHouse Bill 866 by Representative Kirby of the 114th,\na bill relating to workers compensation, House Bill 875,\nby Representative Bowdie of the 62nd,\nMcLean of the 100th, Scuvio of the 60th,\nRoberts of the 52nd, Davis of the 87th and others,\na bill relating to administration of employment security,\nHouse Bill 876, by Representative England of the 116th,\nKirby of the 114th, Gaines of the 117th,\na bill to amend an act providing authority\nfor members of the Board of Education of Barrow County,\nHouse Bill 877, by Representative England of the 116th,\nKirby of the 114th, Gaines of the 117th,\nbuilt to amend and act, recreating and establishing a board of commissioners of Barrow County, House\nBill 878 by Representative Bernal of the 77th Scott and the 76th Goffield of the 60th\nBayesmore of the 63rd Neal of the 74th and others, a bill to amend and act creating a\nstate board of Clayton County, House Bill 879 by Representative Bernal of the 77th Scott\nand the 76th Goffield of the 60th Bayesmore of the 63rd Douglas of the 78th, the Bill\nto amend and act establishing a civil service system for the employees of Clayton County,\nHouse Bill 880, by Representative Nixon of the 69th Jenkins of the 130th Second.\nSmith of the 130th, bill to amend and act, providing for the right consultation with the Board of Education of Troop County.\nHouse Bill 880, one by Representative Williamson of the 115th Curb of the 114th, bill to amend and act, creating a Board of Commissioners of Walton County.\nHouse Bill 880, two by Representative Williamson of the 115th, bill to amend and act, providing for districts for the election of the Board of Education of Walton County.\nHouse Bill 887-883 by Representative Cameron of the first and\nTarvern of the Second, a bill to authorize the governing authority of the City of\nRossville to lobby an excise tax House Bill 884 by Representative Belton\nof the 112th Hitchens of the 161st Bonner of the 72nd Holcomb of the 81st Nix of the\n69th Bill relating to general provisions of professions and businesses House\nBill 885 by Representative Belton of the 112th Hitchens of the\n61st Bonner of the 72nd Holcomb of the 81st Nix of the 69th Bill relating to\norganization of schools and systems. House Bill 886 by Representative Powell, 32nd\nlever to the 33rd Jasper's at the 11th Blasper to the 141st of the 18th and\nothers. Bill would lead into primary selections House Bill 887 by Representative\nStevens of the 164th to Bill would lead into assessment of tangible\nproperty. House Bill 88 by Representative Thomas of the 21st Jasper's at the\n11th weight of the 9th Carson of the 46th Powell 32nd others to Bill would\nlead into education. House Bill 889 by Representative Hawkins of the 27th\nup into the 29th of Bill to amend an act providing for districts for the election of the Board of Education of Hall County.\nHouse Bill 890, by the way of the games of the 117th, with our 119th of Bill to amend an act providing for the unification of the existing governance of the city of Athens and Clark County.\nHouse Bill 891, by the way of the 115th, Williams with the 148th of Bill relating to installment loans.\nHouse Bill 892, by the way of the Mitchell of the 106th, Hutchinson of the 107th,\nout of the 76th.\nI believe the 143rd Mitchell, the 88th and others\nhave been led into corporal punishment.\nHouse Bill 893, by reps and mix of the 69th Smith\nof the 70th Buckner of the 137th Smith of the 133rd\na bill relating to hazardous site response.\nHouse Bill 894, by reps and body of the 62nd McLeod\nof the 105th, Clark of the 108th, Hutchinson of the 107th,\nmore of the 95th and others,\na bill relating to general provisions regarding\nLandlord and 10th House Bill 895, by reps and crow\nof the 110th, Gunther of the 8th, Thomas of the 21st Smith\nof the 18th, a bill relating to discovery\nand criminal procedure.\nHouse Bill 896 by rims of crow 110th homes with 129 to build relating to definitions for property tax exemptions\nHouse Bill 897 by rims of Stevens of the 164th Petrie of the 166th Tinkersley of the 160th Bill to amend and act providing the election of members of the Board of Education of Bryan County\nHouse Bill 898 by rims of Thomas of the 65th body of the 62nd Major of the 56th will play to the 100th\n117th Bill relating to the Department of Labor, House Bill 899 by Rep. Williamson of the 115th\nWilliams of the 148th Wilkinson of the 38th Bill relating to contracts, House Bill 8, House\nResolution 571 by Rep. Stephen's of the 164th Resolution proposing amendments to the\nConstitution, so to authorize the General Assembly to provide by law for the local\nreferendum to authorize an assessment and residential homesteaded property, House\nResolution 572 by Rep. now in the 77th County of the 76th Guilfield in the 60th phase,\nmore than 63rd, Glanton at the 75th.\nResolution recognized in Goldstar Fathers in Georgia,\ndedicating a road in their honor.\nHouse Resolution 573, by Rep. Bernal,\nthe 77th Scott at the 76th,\nGofield at the 68th base,\nmore than 63rd, Douglas of the 78th.\nResolution dedicating the Arnold Fountain,\nProfessional Club Highway,\nHouse Resolution 574, by Rep. Jones at the 53rd.\nResolution honoring the lives of Reverend Joseph Jones,\nSenior, Internella Jones,\nand dedicating a bridge in their memory.\nThrough second readers.\nReports of standing committees, the clerk will read.\nRepresentative Tantak will say that I'm 60th District Chairman of Committee on Intergovernmental\nCoordination Locals have been in the following report, and will speak to your committee\non Intergovernmental Coordination Locals.\nIs that a consideration to following bills of the House?\nMr. Dr. Media reports saying back to the House, following recommendations, House related\njust 836 do pass house related 70 do pass house related 71 do pass house\nwith 874 do pass respectively submitted\nperhaps an antagonist leaving 160th district\nchairman that completes the reading of the reports of standing committees\nokay we have a local calendar today\nso I'm going to ask all members to be seated for just a few moments and let's get that voted\nthird reading and passage of uncontested local bills. If there is no objection we will vote\non the local calendar as a whole with a recorded vote hearing none it is so ordered to clerk\nWe'll read the local calendar.\nHouse will lead 36 by represent Bruce Bruce, the 61st City of Atlanta.\nHouse will lead 70 by ropes and tankers, the 160th Bullock County House will\neat 71 by ropes and tankers, the 160th Bullock County House will lead 74 by ropes and\nnext to the 69th heard County.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bills?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills, and the local calendar will vote aye.\nThose opposed to vote no and the clerk will unlock the machines.\nIf all members voted, if all members voted, if so, the clerk will lock the machines on\nthe passage of the bills on the local calendar, the eyes are 134.\nThe nasor zero these bills having received the requisite constitutional majority are therefore\npassed for what purpose does Chairman Tankersley rise?\nMr. Speaker I rise to make motion.\nState your motion.\nI move that we immediately transmit the local calendar to the Senate.\nChairman Tankersley has moved that the bills just passed by this house be immediately\ntransmitted to the Senate.\nIs there objection to the ladies' motion?\nIs there objection?\nThe chair here is not in there on their way over.\nAll right, we're going on now to morning orders.\nGoing on to morning orders.\nWe're going to limit morning orders today to two minutes each and chair recognizes for\na morning order representative Susan Holmes.\nThank you, Mr. Speaker.\nAnd before any of y'all get up and start ready to get out of here because it's Friday,\nI'm very interested to know how many of you hold your raise your hand if you have served\nand local elected office, county or city level.\nLots, I behave, I know.\nThank you for your service, because it is so, so varied.\nIt's just the best training ground of all\nfor being where we are today.\nBut I especially want to know,\nI want folks who have been in municipal government.\nHow many mayor's and city council members\ndo we have in this body?\nI'll stand up.\nOne, two, three.\nOkay, then you all especially understand the value of the Georgia Municipal Association.\nAnd that's what I want to mention to you today.\nGMA is having that annual networking breakfast on Monday, January 24th.\nNow that's going to be Monday week.\nNow this coming Monday, the Monday after that, 7 o'clock in the Atlanta Hilton,\nIt's been for the last, well, 30 years anyway, that's how long I've been going.\nBut we're going to have the Governor, Lieutenant Governor, and our own Speaker Austin as\nspeakers.\nPlease put this on your calendar now.\nThis is a great way we all need to stay in touch with our local officials.\nThis is a great way.\nThey love to see their representatives at their events.\nAnd they will be there all weekend at the Atlanta Hilton.\ny'all come out and have breakfast with your mayors and your council members on the 24th of January.\nThanks so much. Have a great weekend.\nChair recognizes representative Al Williams for a morning order.\nThank you Miss Speaker. All of you and thank the lady for her announcement. All of you\ntook a picker to come serve raise your hand but I just want to remind you that\nin 130 today the state the Martin Luther King state commission will have a\nannual program on the North staircase 130 today there will be limited\nseeing and we certainly hope that all of you will make the time to come. We are announcing\nthis in the absence of Dean Smari who's been on the Commission Census Inception. Thank\nMr. Speaker.\nChair recognizes for a morning order representative Bennett, representative Hewgley, and representative\nKendrick. Thank you Mr. Speaker and good morning colleagues. I stand before you\ntoday with my sorority sisters and your colleagues representative Karen\nBennett and representative Carolyn Huley and we wanted to recognize Founder's\nday for our illustrious sorority alpha capa alpha sorority incorporated.\nTomorrow is actually the Founder's day but we are celebrating today so a\na little bit of history about our sorority.\nIt's an international service organization\nthat was founded on the campus of Howard University\nin Washington DC in 1908.\nIt is the oldest Greek letter organization\nthat was established by African American\ncollege educated women.\nAnd we have over 300,000 members\nthat includes the United States, the US version islands,\nthe Bahamas, Bermuda, Dubai, Japan, Liberia, Germany\nand South Korea, and we are led by our international president, Dr. Glendon, Linda Baskin Glover,\nand we are often hailed as America's premier Greek letter organization for African-American women.\nSo today is take a A.K.A. to lunch day. So if anybody is interested, we will be available.\nSo on behalf of all of us, we just wanted to say a very happy Founder's Day.\nHappy Founder's Day.\nChair recognizes Representative Lot for a morning order.\nGood morning, colleagues. As many of you know, the President and Vice President came to Georgia\non Tuesday of this week.\nThey were to supposedly promote voting rights legislation,\nbut in fact, the president spent much of his time\nat the podium making wild misstatements\nabout Georgia Republicans and our most recent election\nintegrity act.\nHis comments, lines that can last for hours, he said,\nillegal to bring food or water to someone, he said,\nwe were eliminating drop boxes and taking away\nyour options, he said, what in the hell, heck, are we talking about? Think about it, he\nsaid. Yes, Mr. President, and everyone that heard this speech and the many others that\nhave mischaracterized or blatantly lied about Georgia's Election Integrity Act, do think\nabout it. Use your own minds to gain a better understanding of the truth. Lines that can\nlast for hours, you say. Now, that actually is a form of voter suppression. And in Georgia,\nit was often occurring in our Democrat-led communities. And so, we, Georgia Republicans,\naddressed it by now requiring poll officials to make corrections if aligned as longer\nthan one hour at any point in the day. More machines, staff, or precincts. Illegal to\nbring food and water. Think about it, you say. Ah, that seems strange because it is absolutely\ntruly untrue. Anyone can provide food or water beyond 150 feet from the polling place.\nGeorgia Republicans were responding to the cries of those that were feeling uncomfortable\nor intimidated by groups approaching them while in the line close to the precinct doors.\nGroups that oftentimes had a clear partisan agenda and were politically aligned. Georgia\ntook the necessary steps to remove the potential intimidation and discomfort by allowing those\nsame groups and any other to provide the water directly to the poll workers so that they\nmay provide water stations within 150 feet of the precincts.\nAnd Mr. President, as far as removing drop boxes to eliminate options, we have the United\nStates Postal Service that can be used by any.\nLike our great Governor Brian Kemp always says in Georgia, we have made it easy to vote,\nbut hard to cheat.\nThank you, Mr. Speaker, and I yield the well.\nrecognizes representative Mitchell for a morning order.\nThank you, Mr. Speaker.\nYesterday I saw a news citation that a person in the USA dies every 46 seconds from COVID.\nEven being immersed in COVID data, that number really surprised me.\nAnd we're also incredibly, incredibly tired of what is happening all around us that does\nnot change our reality, that high cases lead to more hospitalizations and unfortunately\nmore deaths.\nIf you pull up statistics from this week at the Georgia Department of Public Health website,\nyou can see a couple of important facts.\nEvery county in Georgia has high COVID rates.\nThe lowest two-week average is in Eccles County at 252 cases per 100,000 residents, and\nIt is an exception.\nCases are continuing to rise for our school-aged children,\nwith the highest numbers reported in the entire epidemic\namong our 10 to 17-year-olds as of yesterday.\nIn the last day, outside the window of incomplete data,\nthere are around 550 health care workers\nreported with a confirmed case on a single day.\nThat is 1.5 times higher than the maximum number\nreported in previous peaks.\nWhile each person's individual risk for COVID\nis just that individual, our collective actions,\ndetermine whether our schools are staffed\nand our hospitals are able to keep up with demand.\nThat is our reality.\nWe have to work together to protect\nour societal infrastructure.\nThat means better masks.\nThat means decreasing our individual risks.\nThat means helping people find the information\nthey need to get vaccinated or boosted.\nWe don't have to be in this space\nand we can work together to get out of it.\nThank you very much, Mr. Speaker,\nand I yield the well.\nOkay, that completes our morning orders.\nThe clerk will read the caption\nto a group of privilege resolutions.\nHattering the life and memory of Miss Karima Reed.\nCommending a wane leneer, recognizing commanding Matthew DeWitt, Thomston, Jr., recognizing\nJanuary 15, 2022 as Alpha-Capa Alpha Sorority Inc. Founders Day at State Capital, commending\nTaiwan for its relationship with the United States and State of Georgia, congratulating\nhonoring the stakeholders involved in creating open doors to recovery, commemorating Martin\nLuther King, Jr. Day, recognized in January 19th as Dr. Nazera, Daywood, Reaffirmation\nof Diversity in Patriotism Day, and for other purposes that completes the reading with\nprivilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is done and the resolutions are adopted.\nWe are about to go on to announcements before we do and please listen up to this one.\nI don't think it's any great secret that there is currently a winter storm watch out\nfor a large portion of Georgia for Saturday evening and Sunday and I think it even extends\ninto Monday, and that affects just about all of Georgia north of I-20. That will obviously\nhave the potential for impacting our operating hours on Tuesday, January 18, which is next\nweek and I think that's the day Chairman England would have started the budget hearings.\nLet me leave you with one or two things. One, if necessary, if there are changes in the\nschedule, you will be notified by email late Monday afternoon, Monday evening. Updates\nand advisories to house operations will also be posted on the house website and social\nmedia.\nSo as always, monitor the weather reports and take necessary precautions to be safe.\nThe latest GEMA weather advisory that came out a little bit before we came in this morning\nseems to indicate that the impact here in the metropolitan Atlanta area may be less than\nwas first thought but will still be very significant in what we know as God's country in the North\nGeorgia and particularly Northeast Georgia. It's still going to be a significant weather\nevent up there. So I may not be seeing you again for two or three weeks if it\ngets bad but but but keep up with that and we'll we'll keep you advised of that.\nThe the final thing I want to mention I met yesterday afternoon with both\nCommissioner McMurray with the DOT and Governor Camp and I can tell you that\nDOT is deploying all of the state assets they have that they're disposal. I think that\nGeorgia will not repeat the events that happened in Virginia two or three weeks ago when I don't\nknow what happened up there. They just completely ignored all the warnings and the watches and it\nwas a terrible event, but we're preparing and we're going to be ready. The governor reiterated\nthe same thing and I think he's going to have maybe a briefing, public briefing later today,\nsometime to sort of bring everybody up to date on things. So that's kind of where the weather\nunderstands God's speed to all lobby through the the weather. Hopefully it won't be as bad\nas we think and it'll just be a beautiful snow that come Monday afternoon. It'll all\nbe melted away and life will go on as normal or not.\nAll right, we have a couple of announcements. If you signed up for an announcement, make\nyour way to the front of the chamber, the chair recognizes representative\nJasmine Clark for an announcement. Thank you, Mr. Speaker. Everyone, when you get\nback to your offices today, you will have a flyer on your desk that will tell you\nabout the blood drive that we are having on Monday the 24th. That is the\nMonday, we return after budget week. Right now, the supplies for blood are really, really\nlow. Blood banks usually want to have about a three-day supply, and most of them right\nnow only have less than a day's worth of blood. So, someone needs a transfusion. They\nare at risk of not having that life-saving blood available to them. The blood mobile will\nbe parked on the street between the capital and the CLOB, so very readily accessible.\nYou could make an appointment using the information that's on that flyer.\nWe really hope to get a good participation and thank you very much, thank you, Mr. Speaker.\nChair recognizes representative or Chairman Todd Jones for an announcement.\nA good morning, Representative Cunard and I wanted to let you know we'll be co-hosting\nour co-chairing the House Mental Health Caucus.\nThe verse meeting is going to be Tuesday, the 25th at adjournment.\nWe will get you the room number on the 24th, but please mark that in your calendars.\nThank you so much.\nMental health is health.\nOkay, we have some birthday, so I want you to listen up, and obviously we've got a number\nof them between now and when we return here to the chamber on Monday, the 24th.\nThe first one is on Monday, January 17th,\nRepresentative Josh McLaren, Representative McLaren.\nOn Thursday, January the 20th, Chairman Gerald Green.\nGreen. On Saturday, January 22, Representative John LeHood.\nOn Sunday, January 23, Representative Noel Williams.\nIs it true that your chairman Hogan's giving you a party that day with balloons and things to blow in and all that?\nI saved though the best one for last.\nI did.\nSometimes we forget who the really important people are here.\nand next Tuesday January 18th will be the birthday of Scotty Long in the Clarks\noffice. Happy birthday Scotty.\nChair recognizes the majority leader of the House for a motion.\nMr. Speaker, just FYI, I understand that they're going to have pony rides at Null's birthday party when they have that in case anybody.\nShetland pony, that is.\nMr. Speaker, I move that this house stand adjourned until 10 a.m. Monday, January the 24th, 2022.\nThe Majority Leader of the House has moved that this house stand adjourned until Monday, January 24, 2022 at 10 o'clock a.m.\n10 o'clock a.m. All those in favor of the motion will say aye. Those opposed will say no.\nThe eyes have it and this house will be adjourned until Monday, January 24 at 10 a.m.\n",
  "updated_at": "2026-02-12T16:40:36.85717+00:00"
}