{
  "video_id": "ka4GdmLqkEo",
  "url": "https://youtu.be/ka4GdmLqkEo?t=1434",
  "title": "Georgia House - Day 35 (2026-03-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-25",
  "duration_minutes": 116,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-03-25:\n\n## Overview\nThe session focused on passing several bills, including legislation related to opioid litigation, land surveying standards, and prohibiting student mask mandates in schools.\n\n## Key Actions\n**SB 500**: Provides a litigation bar for governmental entities regarding certain statewide opioid litigation.  \n**SB 581**: Amends the method for determining geographic boundaries by adopting the national geodetic survey standards.  \n**SB 514**: Prohibits local school boards, superintendents, and administrators from requiring students to wear face masks without a parental opt-out.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Debate on SB 514, the \"Unmasked Georgia Students Act\", with supporters arguing it returns control to parents and opponents raising concerns.\n- Procedural steps taken to advance the bills, including ordering the previous question and agreeing to committee reports.\n\n## Votes\n- SB 500 passed 133-0.\n- SB 581 passed 142-0. \n- SB 514 vote not reported in transcript.\n\n## Attendance\nQuorum was present, with all members voting on the bills.\n\n## Adjournment\nThe transcript does not indicate when the session adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you who are and are and are and have in Georgia. Recognizing Raven County is the wooden boat capital of Georgia commending the 222 women's history month's power women. Recognizing and commending Bishop Johnny B. Stroud. Recognizing and commending Atlanta check a cab on the occasion of its 75th anniversary. Recognizing commending Jordan's mothers on receiving their congressional award gold medal. Honoring the life of Mr. Huey Lawrence Bre. And for other purposes that completes the reading with privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here's none in the resolutions are adopted. All right we're back on the rules calendar. We're going back to the rules calendar. The clerk will read the caption to Senate Bill 500. Senate Bill 500 by Senator Strickland on the 17th Walker or the 20th Kennedy the 18th cows with 46 and others being titled an act to a men title ten of the Bishop go to Georgia and tell you relating to commerce. So we're going to provide for litigation bar and governmental entities regarding certain statewide opioid litigation. Mr. Lambert for the Committee on Judiciary that committee recommends a disbilled do pass. Chair recognizes chairman Bershitt to present the bill. Thank you Mr. Speaker. My colleagues in the corner here have used the word brevity several times so I'm going to be brief. Senate Bill 500 is a opioid litigation bar as a requirement of the settlement the national settlement and state settlement for the opioid litigation. Georgia stands to gain a significant amount of dollars by passage of a litigation bar. This litigation bar is only for subdivisions of the state of Georgia. So cities, counties, authorities. This would not allow those entities to be able to sue over opioid litigation into the future in the in the scenario that meets the requirements of lines 47 through 61. With that Mr. Speaker I am going to yield for questions if there are no questions I yield the well. You have no questions. Gentlemen has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines.\n\nAll members voted have all members voted If so the clerk will lock the machine on the passage of Senate bill 500 the eyes are 133 the nasa zero This bill having received the requisite constitutional majority is therefore passed Yes Clerk will read the caption to Senate bill 581 Senate bill 581 by senator Walker the 20th again to the 47th Gutes the 51st Dugan the 30th and Miller the 49th You can tell an act to amend chapter 4 title 44 in the fiscal to Georgia Antietta relating the determination of boundaries So does ignite the most recent system of playing ordinance for defining and stating geographic positions within the state Miss bill ever referred to the committee on Small business development that committee recommends a disbilled do pass Chair recognizes chairman jasper's to present the bill Thank you mr. Speaker Senate bill 581 is brought on behalf of samsauge That's the surveying mapping society of Georgia Professional organization consisting of professional land surveyors this bill will update the way land surveyors measure land We'll use the national geodetic survey will be the standard for measurement Do they ever increase the accuracy of measurement? This needs updating This change will put Georgia on par with requirements from federal agencies such as FEMA and USGS for measurement For my past work with surveying bills. I've learned that accuracy Is important and critical for our professional land surveying companies This won't require anyone to buy any new equipment And it will not invalidate any previous survey done This change is supported by all the associations involved and is driven by the national institute of standards and technology in IST That's the bill mr. Speaker. I'll be glad to answer any questions if there are any Have a question if you care to yield yes sir Chair recognizes chairman corbitt to your right for a question Thank you mr. Speaker does gentleman you yes, sir Is it not true that if uncle Don and his three persons survey team and had this back in 1818 We would be the sentencing river would be flowing through Georgia today That's absolutely true. It'll been accurate Thank you mr. Speaker No fair bill Or most all of us vote for the bill Tell me as yielded the well Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to Shall this bill now pass all those in favor of the passage of the bill will vote aye Those opposed will vote no in the clerk will unlock the machines Have all members voted Have all members voted If so the clerk will lock the machine on the passage of senate bill 581 The eyes are 142 the nasors zero this bill having received the requisite constitutional majority is therefore passed You Clerk will read the caption to Senate bill 514 Senate bill 514 by senator dixon the 45th mill of 49th booth Gucci the 51st and others Meantyle and act to amend chapter two a title 20 the fish go to Georgia and today relate an elementary and secondary education So survive that no local school board of education local school superintendent or school administrator teacher or the school personnel shall make or enforce any rule that requires a student to wear a face mask this bill having for a committee on education that committee recommends that this bill do pass chair recognizes representative lawrun mcdonald to present the bill mr speaker ladies and gentlemen of the house i bring you bill senate bill 514 so unmasked Georgia students act Which reaffirms what i always been true Parents are the best decision makers when it comes to the health and education of her children This legislation ensures that those rights are not infringed by misguided policies This bill ensures that no local board of education governing board Superintendent or personnel of a public school system or state charter school could impose any mandate or rule requiring students to wear mask without i again repeat without an opt out choice for parents It does not remove mask rules or say that students cannot wear mask Remember Georgia has never had a mask mandate Georgia and america moving safely out of this global pandemic We need to begin to return to normal and this is the first step in doing so I want to be clear This bill does not take away a person's ability to wear a mask Or say a school district cannot implement a mask mandate It is past time for our children returned to normal classrooms And for parents to make the decisions for the children not the government Miss speaker also want to thank you for allowing us to make these choices here on the house floor Just last year as a freshman and presenting a bill. I didn't get to see the smiles from the man from Dublin Or the smiles from the man from midway over here But the children in our state need the same opportunity At this time I'll yield for questions You do not appear to have any questions. I yield the floor gentlemen As yielded and but we have other members Who wish to be heard on the bill chair would remind Those speaking in opposition to the bill a total of 30 minutes for their side Those speaking in favor a total of 30 minutes on their side chair recognizes representative Carter to speak to the bill Thank you speaker roston sb 514 so as we look at this bill So It's really clear that the title of this bill unmasking our kids is erroneous Because this bill really isn't unmasking our kids The bill allows for Local school districts, local school boards, local school principals Administrators of the school if there is a policy they can still do that But they have to allow for the parents to be exempt for work now What's missing is private schools They get funding But more than anything as we talk about this pandemic that is still here You know the argument is I'm asked the kids Because we want to get back to normal That's absolutely nothing normal about this life that we have right now So let's say that the school district and the state of Georgia went according to the AJC The only district there's one Clayton County that has a mandate So the other district does it so I don't really again know how we got here but Let's say we have this situation where a school district does mandate So now you're talking to y'all right now talking to the parents Because a parent That decides to unmask their child Even though they're subjecting other children to this possible Disease this pandemic that could end up being sick I just want to know who are you really caring about Is it really just about you or is it about each of us Because one of the things you're saying the kids can't understand the teacher because they have on a mask Y'all can hear exactly what I'm saying right class Class can you hear me I want to read something because I want you to I want these parents that are hearing us to think about What we're about to do and I want each of you to think about what you're about to do Mark 1229-31 says Jesus answered him The first of all the commandments is here. Oh is riel the Lord our God the Lord is one And you shall love the Lord your God without your heart What are your soul without your mind and without your strength This is the first commandment And the second like it is this you shall love your neighbor as yourself There is no other commandment greater than these So when we bring these kind of bills that really It doesn't make sense. We're not taking the authority of the power from a parent of making a decision But in this climate where we still have children who cannot get fascinated and we're saying parents Take your mask off take your child's mask off if you want to don't care about the kid next to them Matter of fact don't even worry about if they're going home to a family member who may have weak immune system We'll just take that virus to the house Am I loving my neighbor? No We keep bringing these bills and we keep saying we want to get back to normal We may never see normal and we can't say that our children can't understand their teacher because They have on a mask because each of you can hear me and I intentionally kept it on I'm fascinated, but I wear a mask because you know what I care about you I won't even go to my other point. I'm just gonna leave you with this You guys are gonna vote for this bill There are no school districts separate one and Georgia as of today. There has a mass mandate We know we keep seeing these different variants Why do we want to continue to tie the hands of our local school districts That are caring for the most vulnerable of our population our children But if by chance There is some love for your neighbor in your heart Vote no speaker I yield a will Chair recognizes representative Roger Bruce to speak to the bill Thank you, mr. Speaker You know sometimes you know an issue has to hit home Before people will change the thought process on how They're being impacted by some of the things that we do And apparently Unfortunately some of the people Here present Have not yet been hit home on the fact that this virus Is here is deadly and people are still getting sick going to the hospitals and Unfortunately for me it has hit home My brother lost his son My cousin lost his daughter And one of my best friends lost his sister to this virus so Yeah, I take it personal when we do things to try to prohibit people from being protected By what is happening with his virus all of them died before They knew that masks were vital Had they known it prior to To them dying some of them may still be here But I keep hearing that what's being protested Is not the masks itself But the fact that we're mandating And the reality is that that's what we do here every day Every day that we're here we're mandating that somebody will be able to do something or won't be able to do something That's what we do that's what laws are every day We say if you pass the red light you're gonna get a ticket and you pass it enough times you're gonna get more tickets We even mandate that we have to be here 40 days We mandate everything that's what this general assembly does We mandate that you're either gonna do something or you're not going to do it If you think about it, you know With these masks we had a side effect that we weren't expected And that side effect was that very few people got the flu Very few people got the flu and just think about it, you know, because I know you guys like to think about things in monetary terms But just think about how much money was saved by the fact that people didn't get sick And have to go stay home because of the flu The CDC was very very clear that masks help save lives So why would we not want to allow that to continue? Why would we want to put anything in place That would prevent us from taking care of our children Taking care of our families Taking care of our teachers and taking care of each other I don't understand it So with that Mr. Speaker, I just asked that everybody Really think about what you're being asked to do here today You're being asked to put your children at risk Put your families at risk put your cells at risk Without a particular need to do so With that Mr. Speaker I year the where Chair recognizes representative McLeod to speak to the bill Thank you Mr. Speaker and little colleagues Indulge me for just a little bit as I take you down a trip down memory lane The 2020 Georgia legislative regular session began normally In the second week of January all lawmakers were back in town Those of us draft and legislation were busily Visually working with lawyers in legislative council to get the legislation completed Our constituents were calling and visiting the lobbyists filled the hallways In mid-January I heard the word COVID for the first time I didn't think much of it But by February it became clear that COVID was spreading in China It seemed a world away and I was not overly concerned about it But before long we started seeing more alarming pictures of this virus Not now called COVID-19 It was being compared to SARS Triggering many conversation about a mid speculation about who was likely to contract it By March 2020 COVID-19 was spreading in Georgia and concerns increased in the legislative body Prompting me to wear gloves to work Still not knowing how the virus spread As the spread increase legislators pressured the speaker to suspend session On March 16th the general assembly granted the governor a state of emergency under Georgia's law 38-3-51 and the regular session was suspended Three days later on my birthday March 19th 2020 I received a call from the Georgia from Georgia's down here at the Capitol stating that as at Georgia Senator at contracted COVID-19 and we had to quarantine for 10 days It was extremely upsetting to learn this senator was aware that he had the virus and still came into the chamber To interact Soon more colleagues got the virus and more deaths were being reported in Georgia across the country and across the world Georgia went on lockdown The former president proceeded to downplay the severity of the virus and a number of deaths and the number of deaths Governor's priority was to open Georgia for business because we're at a number one place to do business with an apparent disregard for human life Remained on lockdown for less than the recommended time and the lockdown was lifted before Georgia Met the CDC criteria for lifting it Atlanta and other cities across our state followed the CDC criteria before reopening With our state on lockdown The chairman of this house for the Democratic caucus James Beverly issued a clarion call to recruit To to members of of our house Democratic caucus subcommittee on COVID-19 By May 2020 a core team had formed it comprised of the chairman James Beverly and Representative Sandra G Scott representative Um Deborah bassmore represented Mary Boshaw Representative Shelly M. Hutchinson Represent Viola Davis Representative Kim Skollfield Representative Roger Bruce Ronda Bruno and myself We we locked out with two nurses in our mix along with two educators a business owner a social worker and an engineer Using zoom a new platform For most of us the Went and Facebook live we produced a daily 15-minute broadcast to provide COVID-19 information on infection rates Hospitalization Combating misinformation providing guidance on how to protect yourself family and your friends Because a death rate was increasing. We also spent time highlighting That those who have passed away were just not numbers. They were loved ones The advice to mask up Remain six feet distance wash your hands for 22nd was repeated several times during the daily Facebook live broadcast As time passed we saw discouraging development emerge there was a shortage of PPE Personal protective equipment Unemployment increase leading to more uncertainty We also saw saw an increase in conspiracy theories Lies misinformation disinformation and the politicizing of this virus This is a microscopic organism that have no political affiliation Viruses don't care about your constitution Your age your gender your color your skin your economic status or your personal freedom On June 18 2020 out of necessity after three months of after a three month long I ate us the general assembly returned to the gold dome to pass the 2020 budget House members spread in spread out into three rooms and cast Cast our votes and different parts of this building the budget was passed and As George's first hate crime legislation and a total repeal of the citizens arrest law With the state remaining in partial shutdown We continued our daily COVID broadcast a restrictive spring and summer saw black lives matter protests Unemployment protests and political campaigns in preparation for the presidential election All in the midst of a pandemic those of us seeking re-election had to find new ways of campaigning More in social media using social media text messaging no knock literature jobs zoom forums and mailers Misinformation on COVID-19 became increasingly bizarre when the former president suggested that people take Hydrochloroquine you be light to treat COVID-19 He refused to recognize the authority of the leading medical professional doctor Anthony Focci and ignore their advice Has the former president spread his anti-science rhetoric thousands of followers began denying the reality of COVID-19 They scorned a scientific advice to wear mask To to reduce inhaling or exhaling airborne virus and began subscribing To and spreading wild conspiracy theories This made it extremely difficult for data facts and true to be to prevail Just when I doubted that things could get worsened public school Board members were subjected to to organize a tact over public health guidelines for people to wear a mask including our children Yes, my grandson wears a mask and he understands the reason why he's wearing the mask the 2019 2020 and 2021 session has been grievous Grievously this this this heartening for those of us who probably see ourselves as employees of the people who we serve Protect and foster good governance many of my colleagues in this body has lost a loved one to COVID-19 But showed the public and indifference when they did not speak up As of yesterday we have 35,302 Georgians that have died from COVID Including 48 new deaths yesterday I remind I I am reminded that this is not about just a virus. It's about our loved ones that so many have lost and cannot they will never return They're also 974,000 dead A dead people in the United States from COVID This legislation was created for political games to the to the Republican base We have a public health crisis Masking is one way to mitigate the harm caused by COVID-19 Since it is after all a airborne disease This body knows better for this means this body knows better This means we are charged to do better as lawmakers We are sent here to look we took an oath to serve and to protect For God's sake you old public the truth Optin out doing a pandemic is not an option These are human beings I heal the well Chair recognizes representative Jasmine Clark to speak to the bill Thank you Mr. Speaker today I rise to tell you to vote no on this bill This bill is short-sighted and it is dangerous Unless you opt out of the public There is literally no way to opt out of public health Especially when it comes to breathing because guess what we all have to breathe When you share a space with others you also share the air within that space That means that there is a shared responsibility to do what you can to protect others Opting out of that responsibility puts others in harm's way Public health Bills like this create this false and dangerous sense of individualism For something that is collective People say things like if you're so scared then you wear a mask or you put a mask on your kid While not understanding that it is universal masking Masking by those that may be infected and by those that are not infected That is the most effective effective method of reducing the spread of respiratory viruses In fact When your surgeon wears the mask while you're lying wide open on the examination table He's not wearing that mask for him It's to protect you from their germs What if he decided you know what I don't like wearing a mask. I'm hot this surgery is taken a while I'm a opt out of wearing a mask Or frankly what if he decides the soap that he uses to scrub in before he opens up your body It's too harsh on his skin And he decides to opt out of washing his hands And that made you vulnerable to infection Would you be okay with that? Which brings me to my next point this is a preemption bill The last bill that we that came up that had to do with schools Every single person on the right side of the aisle talked about local control and how important it is Fast forward to right now We are all about to take a vote on whether or not to take away the control of local school boards To protect their students their teachers their staff and the community at large We are taking away the ability for them to enforce public health recommendations that help stop the spread of a contingent contagious respiratory virus We are taking away the ability for them to implement universal masking\n\nAnd by including an opt out, you are taking away that ability. And this preemption is, it's ridiculous. It goes beyond just removing public health measures. It basically effectively bans them. So bear with me here. Let's think about some other public health measures and what it would be like if we decided it's okay for people to opt out. This bill would be the equivalent of saying something like, localities can't mandate hand washing by food service workers, a public health measure. Unless you give the people that handle your food, the option to opt out of washing their hands after they go to the bathroom. This bill would be the equivalent of saying that localities can't mandate those little cute swim diapers for the unpotty train taught to them. If you have a potty train toddler in the swimming pool, unless they give parents the option to opt out and allow potential fecal contamination of the public pool in which everybody's got to get out now. This bill would be the equivalent of saying localities can't mandate that individuals can't smoke and enclosed public spaces where there are children. Unless there is an option to opt out and give children all the smoke. Is that what we're doing right now? Are we okay with giving an opt out to public health measures that help everybody? Frankly, this bill is a slap in the face to the parents who have lost their children, God rest their souls, to the teachers that have died just doing the job that they love, to those staff members, those cafeteria workers and those bus drivers that we will never get to see again. It's disrespectful to the parents of children who might not have died from this virus, but those children are still suffering long-term health issues after contracting it. Things like Missy and Heart complications and kidney complications and kids that were formerly very healthy. This bill tells the immunocompromised that their lives are dispensable. It tells our hospital systems and our hospital workers that they are on their own if there is another surge of this current pandemic virus, or if in the next five years we have the unfortunate circumstance of experiencing a new virus. So I'll end with this because I want to remind you all of what we all went through when we first experienced the spread of COVID-19. This bill really should be named, renamed, Close Georgia's Schools Act. Because if we enact this bill and we experience another surge of this virus, another deadly variant that may well affect our children more than the adults, or if we do have that unfortunate circumstance to see the emergence of a new, deadly, highly contagious respiratory virus in the next five years, then if we ban the ability for local school boards and local governments to protect their community through universal masking, then the only option they will have left is to close the schools down. And I know for a fact pretty much everybody hated that. Thank you, Mr. Speaker. I yield the well. Now other members that wish to speak to the bill and the chair recognizes representative camp to speak to the bill. Good afternoon and thank you, Mr. Speaker. I like choices. Psychologists have shown that people respond better when they have choices. Actually, they do more of what you want them to do when they have a choice to make a decision in something. And I'm sure if any of you have ever had any small children, you probably can know the same thing. You give them a choice and they feel like they've got some control over the situation they're going to respond better. I am a mom and when my daughter was young, I suffered very much on every single decision because I didn't want to get anything wrong ever. I think most of us feel that way. But the reality is parents should have the decision making ability if they cover their child's face. Simply put, children have so many socio-emotional learning techniques that take place in their deformative years that not seeing someone's face actually impacts them. I know I've heard people say that's not the truth, but my new son-in-law, Bryce, teaches fourth grade. And he struggles with kids who have trouble reading because they were not able to see people's mouths moving. They were not able to see facial expression. They were not able to fully understand how they needed to form words and how those related to the words on a page of a book. So I'm asking humbly as a parent, as a former school board member, and as someone who has a master's degree in communication studies to think about the impact that not allowing parents to make choices has. And I ask for your favor on the vote. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report and then we have the chair's time. And by rule, 20 minutes for each of those, chair recognizes representative Mitchell to speak to the minority report. Thank you, Mr. Speaker. I'm going to come before you today twice. And I'm going to speak about two different bills. And as a PhD infectious disease epidemiologist with more than 35 published papers, I actually see these bills very differently. And as a guennette parent with a child in public school, I also see these bills very differently. At the surface, you could look at both of these bills and think that they're only about COVID. But I see them as working at different purposes. This bill is not about a particular virus. Indeed, it's not even specific to a single virus. This one's about power. It's about the folks who are angry that they don't control the guennette school board anymore, wanting absolutely no power for this school board or superintendent to make decisions to prioritize community health and school staying open over their individual anger. There is an ocean of misinformation about masks and kids. And I'm sure we're going to hear a little bit more of it today. But at the moment, this is a bill in search of a problem. We already have mechanisms to make sure children who should not be in masks are not in masks. We also have off ramps for masking. There are right now few districts requiring masks in Georgia. And the call for this bill is from guennette primarily, which does not require masks because they're following CDC guidelines. Our job here is not to put barriers between our communities and common-sense safety precautions that we've all relied upon so heavily to keep our schools and our economy open in the past two years. We should be following CDC guidelines rather than relying on state elected who do not have that set of expertise to make decisions like this one that we rely on for keeping our schools open. Again, mask policies were implemented with necessary exceptions for children who need them because we all want our schools open and safe. Masks are truly a low barrier intervention. Though there's a lot of propaganda, masks do not cause social damage. They do not cause large learning loss. This is actually misinformation. Pandemics cause learning loss. Masks help keep schools open. The misleading arguments for insufficient masks, not being the best choice, is to recommend and provide better ones. The argument that a cloth mask is insufficient is simply a straw man, which does not hold up to scrutiny. Given all the available data, the right answer to robust evidence that better masks work better is to upgrade the masks our children are wearing when they need to wear them. I don't stop wearing jackets because one day I wore one that was too thin. I put on a thicker one. We have again heard a logical fallacy in committee discussing this bill that N95s do not come in children's sizes and therefore when we discuss masking the idea that we could upgrade masks is impossible. Let me either pre-bunk that for you or debunk it if you heard it in committee. Both because it turns out that children's heads in larger grades are similar sizes to small adults. And also because there are many masks that are not N95s, for example KN95s, that work great and come in sizes all the way down. There are more bits of information out there, but I want to make sure to give you the tools to start questioning them as you hear them. We should all value our educators and the many families and children in Georgia who cannot be vaccinated or for whom vaccination is insufficient protection. We owe it to our communities to not take away the ability to choose to protect students, families and educators as needed when needed. It's really easy to look at this bill and think, oh, it's no big deal. Likely be only a few parents who don't choose to protect their children and their communities during the surge. And I hope that's true. But this bill was written with intent. It does not simply give an option for children who do not need exemptions to be granted them, thus putting all of the children who cannot mask at a higher risk. It also forces all school functions to follow this rule. You know where that's going to get used? Gwyneth. To force our educators to accept risks that they did not contract for and our students after school at events when doing things that help our community. At early morning Lego club at my child's school right now the social punishment, meet it out for was public shaming and attempt to get schools to force that educator to accept risk against her will for a voluntary duty. She was performing. Can't we value our children, our educators and our immunocompromised community members enough not to introduce conflict and disruption to our children's education yet again? I can. I hope you'll join me. Thank you and I yield the well. Chair recognizes representative park to speak to the minority report. Thank you, Mr. Speaker. I rise in opposition to Senate Bill 514 because it undermines local control to the detriment of Georgia students and puts partisan politics in pursuit of political power before the health and safety of our children, teachers and communities. Now I can say a lot about local control especially during this past legislative session. But all I will say is that usurping local control not only undermines the will of Georgians who voted for these local elected officials, it weakens our democratic republic by removing the ability of Georgians to hold politicians accountable who enact legislation or public policy that affect their daily lives. In this instance, unaccountable politicians are supplanting the decisions of local elected officials who are closest to the people they serve. Underlining carefully vetted, multi-layered mitigation policies that are flexible and responsive to changing circumstances based on science to protect students and teachers in the midst of an unprecedented pandemic will unnecessarily increase the risk of illness and death from all of them. And death from a virus that's already claimed the lives of more than 30,000 Georgians and nearly 1 million Americans in approximately two years. Underlining local control as to the wearing of face masks or face coverings also has negative implications and unintended consequences for Georgia students. In my district, I have the privilege of representing Maxwell High School of Technology in Gwinnett County. As part of the Gwinnett County public school system, Maxwell provides career technical education and certifications to Gwinnett High School students. Programs offered include but are not limited to welding, firefighting and health care. Each of these three programs provided on school grounds or property owned by the Gwinnett County public school system taught by GCPS systems will likely require wearing masks to protect students without exception which may be prohibited under this bill unless a parent is provided an exception to the requirement. So if a parent says their 17-year-old child should not have to wear a mask in a health care program or in an instance where their child may be practicing to serve an immunocompromised patient population and that student cannot suffer any adverse disciplinary or academic consequences per this bill for not wearing a mask. Where does that leave us? Does that not undermine educational and career opportunities for the next generation along with legislative actions of this body related to dual enrollment and access to technical colleges and programs. Upon further research, the Georgia Department of Education seems to have a fairly robust career technical and agricultural education program for middle and high schoolers that include programs for welding, clinical lab, phlebotomy and patient care where the wearing of a mask is normal if not mandatory. Rather than impose a carte blanche prohibition on mask mandates and perpetuate the politicization of wearing a mask, perhaps as the career technical education example illustrates. This is an issue best left up to local school boards and districts as this may be more nuanced especially when you're not looking at it from a partisan COVID reactive lens in an election year. Now I appreciate the stated intent of this bill to return to some semblance of pre-COVID normalcy. Incidentally prohibiting a mask mandate in schools will not make things magically go back to how things were before and more importantly it will not address the significant learning loss experience by students which this bill does nothing to address. In my opinion, there are some hard truths we must accept to move forward. First, there is no going back to the old normal. We must find a new normal. As I lost my mother a few years ago, I share the pain of my colleagues in this body who have lost family members. We know there is no going back to how things were. We must adapt and find a new normal which is what the families of the 30,000 Georgians who have lost their lives from COVID must also do. As we are emerging from this pandemic, I would assert that now is the time in which we learn from our mistakes, address our weaknesses and the systemic challenges, expose and exacerbate by the pandemic. What better way to honor the lives of the 30,000 Georgians who are no longer with us than to invest in Georgians to invest in our state to ensure we are more prepared for whatever hardship or storm comes our way? Second, this pandemic is not yet over. I wish it was but it is not. As we are hearing of new cases, increase in Europe and Asia with a new variant and as this virus continues to mutate every time it is transmitted, what is the best way to navigate the uncertainty as to what may come next along with the unforeseen consequences resulting from long COVID? Now is not the time to handcuff our local boards of education who are closest to the people they serve and may best understand the needs of their communities which will enable them to best protect all of those they serve, students, teachers and staff. Local county boards are much better positioned to be more responsive to act in an event of an emergency compared to a part time legislature that will be out of session in 10 days. Throughout the debate of this bill, I have also heard statistics from learned legislators stating that only 24 Georgia children between the ages of 5 to 7 have died from COVID according to the Georgia Department of Public Health. DPH has also reported more than 2,000 hospitalizations and 257,374 positive COVID cases of school-aged children between the ages of 5 to 17. As we still do not know, the long-term impact this virus has on our bodies, our mental capacity and acuity are general health. I would think that the wise thing to do would be to err on the side of caution and be inclined to take more preventative and protective measures, especially for the next generation, to take refuge in the face of danger rather than seek to unmask students in the midst of a once in a 100 year pandemic that already killed more than 6 million people around the world. The repeated assertion that the governor could simply overrule this legislation and impose a mask mandate by executive order in the event of another airborne virus, COVID variant or other pandemic, to me makes clear that this bill really does put at risk our students in the midst of this ongoing pandemic, which is very unfortunate. So let's stop politicizing this pandemic for political gain. I assume the proponents of this measure, like with many of the other bills that we have been debating, will attack opponents, saying they oppose parent's rights. This is no surprise. Politics are a contact sport or so I've been informed. I anticipate this coming election cycle will be challenging and things will get heated. However, I hope every now and then we can take a moment to take a step back and remember that as Georgians, Americans, as human beings, we face a common threat, which is a virus, not someone who has a different political persuasion, and we will act accordingly to protect the next generation and the most vulnerable among us. For all these reasons, I urge you all to vote no, and thank you, Mr. Speaker. I yoke the wall. We have members speaking on the chairman's time, total of 20 minutes. Chair recognizes the vast chair of the Education Committee, Representative Erwin, to speak to the chairman's report. Thank you, Mr. Speaker. First thing comes to mind when we talk about local control. I don't think we can get any more local control in a school system than decisions that parents make and that we put that in their hands. And in an essence of time today, let's, if I could, Mr. Speaker, yield the chairman's time beginning to Dr. Newton. Representative Erwin waves a portion of the time to represent chairman Newton. And he's recognized. Thank you, Mr. Speaker. And thank you, Vice Chairman. I've been honored to be part of a team of healthcare providers that, that in March and April of 2020, where the ones when we heard somebody was COVID positive, we walked toward the room instead of running the other way like we felt like. Fortunately, we've learned a lot in the last year and a half, almost two years now. We've learned that thankfully this is an incredibly mild illness in children. And kids without significant come more big conditions. There's been really less than two dozen over a two, deaths in a two year period. We've learned that teachers can be protected much better by choosing to get vaccinated themselves than any number of masked worn by children or themselves. And frankly, nothing in this bill that I've, that I've read in it prohibits any parent from sending their kid to school in a mask that actually works. We found out with Omicron that a lot of these coverings that we were wearing, the cloth masks, even some surgical masks. There were people double in triple masking because we found out they really don't do anything for a real aerosol. And we saw that with the tremendous surge of Omicron. Fortunately, it was, it was very mild. So nothing in this prohibits a parent from using on their child a mask that they think will work. But the parent does get to choose. They get to balance what I think representative camp mentioned about the value of learning. I can tell you, one thing that's even safer than mask is a choice that many in the other party liked, which was remote learning. That was where everybody just stayed home until that stopped polling quite as well. And they realized that was a little of bridge too far. But I can tell you that is safer from a respiratory virus point of view. If that's all we care about. If all we care about is prohibiting a preventing very mild illness from a respiratory virus, you can keep kids home. I think that's incredible detriment. I know a couple of days ago one of one of the members pointed out that third grade reading level on level is a great indicator of how many prison beds we're going to need. Well, remote learning, I'm afraid it's going to mean we're going to need more prison beds because that's what happened. There are many in the other party that would like and frankly seem to appreciate the power that comes with excessive government intervention. A mask mandate and you heard a couple of times up here, a universal mask mandate. That's not just protect yourself. That's required everyone else to wear it all the time with prohibitions on where you can go. There was an earlier bill that discussed requiring people to show their papers, their vaccinating papers, even to access government services that they might need. There's something that would like us probably to go back to remote learning and pretty much shut down the economy. I can tell you if you're going to do it for COVID and the rates of illness and children, you're going to have to do it every year for influenza. You're going to have to do it for RSV and so many illnesses that are so much worse in children. I do think we heard a little bit about local control and the local ability to take care of things. I'm not sure there is anything more local than a parent being able to look at their child and their child's learning, whether their child learns through facial expressions, learning to talk, learning the difference between a smile and a frown. There's a lot of communication that goes on. As a matter of fact, we have the speaker and whoever's at this well often remove their masks because communication is important and we want to make sure communication is clear. It's even more clear in those kids that are trying to learn. I think we should stick with the ultimate local control, which is a parent who has raised a child who's legally obligated but far more important, morally and ethically obligated to take care of that child, to balance that child's risks that are out there. Certainly there's risk of driving to school but there's a risk of missing school. I think it's crucial that we give that ultimate local control. Let's don't do this with what we've learned. We've learned way too much to go back and start going to masks. If you look at how we wore them in here, it was pretty bad. If you look at how kids wear them in a school room or a playground, you'll realize it's really more of a decoration. Unfortunately, like I started with, it's been greatly appreciated that this virus has been incredibly mild in children. Listen, don't require kids to do this. Listen, allow parents that want their kids to do it, to have their kids wear a mask, and they frankly better be wearing an N95 that leaves a circle on your face when you take it off. If you really want one that works, let parents choose what kind of masks they want their kids to use. If that's what they think is in their kids' best interest, they can still choose it. But let's let the other parents and their kids decide what's best for them. Thank you, Mr. Speaker. I yield well. Chair recognizes for a portion of the Chairman's time. Chairman Todd Jones. Thank you, Mr. Speaker. Colleagues, I appreciate your time. I'd like to be able to frame my comments in three ways. One, the fact that we've learned a lot over the last two years, two, in terms of what is the challenge that we're trying to address and then three, the effectiveness of the modality. And I think beginning with the first one, there's two quotes I'd like to share with you. The first one from Dr. Fauci. All three vaccines are 100% effective against death and hospitalization. Mr. Fauci said that at the end of February of 2021, I believe he was being completely honest in the sense that he felt that at the end of February of 2021, but obviously things have changed, and I'm sure that would not be his quote today, and I give him credit for that. In addition, just a month later, in March of 2021, the CDC director said, our data from the CDC today suggests that vaccinated people do not carry the virus. Again, if given the opportunity, my hunch is now in March of 2022, that would change. And again, we've learned a lot since not just the not just early 2021, but also since this virus has started in the early parts of 2020. So let's go ahead and frame the issue if you don't mind. Dr. Newton started to speak to it just a bit, and I'm going to go ahead and give you just a little bit more data from some of our favorite three led or acronyms in terms of the NIH, the CDC, etc. But effectively, what we're seeing is that as we see how this particular virus moves, you will see effectively here on the chart, the goal represents adult inpatients, the blue that very, very low line towards the X-axis literally represents pediatric inpatient. I'm not trying to minimize the fact that a child went to the hospital, but what I am trying to create here is the picture in terms of the challenge that should we be addressing it. Next, for those of you who do not know, the CDC last week adjusted the numbers by 25% of pediatric fatalities due to COVID. I do not believe that was an intentional act by the CDC. I will accept their explanation that there was a quote mistake. But the fact of the matter is we now know that as we learn more about this virus, we're even seeing that the organizations that we're putting our trust in in terms of the data, you will see up here total 0 to 17, the number went down by 416 and one day due to quote the mistake that the CDC had made. I want to be clear, losing one child is never acceptable, losing anyone is never acceptable. But every day when we're here and making public policy, the reality is that we know that life is about calculated risk. Every year 100 children die from falling, but we've never thought about taking them off the stairs or taking them off the jungle gyms. So how do COVID deaths in children compare to other deaths?\n\nIn 2021, the total death count in America is less than we lose every year to drowning, the flu, pneumonia, and the car accidents. What we know is that children between 5 and 17 make up about 18% of the population. Thankfully, they don't even make up .1% of the folks that we lose in this country. And I do mean that thankfully. We need to understand what is the problem that we are trying to solve. I do agree with some of my colleagues. Let's talk about how do we solve it and what are the things. But let's give ourselves a little bit more color. We know if you look at what, well, there we go. I wanted to be able to give you a picture in terms of what exactly are we trying to solve. I'm originally from Florida, so I understand the drowning. I understand that in a big way. But there are so many things that present to our children that are 2x, 3x, 4x, 10x higher than what we are facing today. When we look at the incident fatality rate for basically all infections, what we know is this. If you look to the right, you will see we try to provide to you some relative risks in terms of what is it in relatively to the common flu. What is it in terms of vehicle accidents? What is it in terms of childbirth, etc. And hopefully this gives you a sense of, again, not to minimize it, but to give you an understanding that in fact, what we have here is a pretty profound virus, but not one that presents a risk to children between 5 and 17. So let's discuss the effectiveness of the mass. There are so many conversations going on around what technology works and what technology does not work. I know this, Forsyth County, the school system that my children are part of, never had a mass mandate. I believe closed down the fewest number of days in the state, especially in the metro area, we did not have a challenge. But one of the things I wanted to draw your attention to is have mass work. On your ULC in June of 21 implemented a mass mandate, latter part of that year you see a spike. Next in November of 21, they instituted another statewide mass mandate and you will see the massive spike in the early part of this year. Germany, who was so proud of their case rate and you see that towards the left side of this chart, but then you will see in October of 2021, they implemented not only the state and N95 mandate, but they also mandated passports in terms of your vaccine, what occurred still a massive spike. The point being is I'm not Dr. Newton, but I know this is an aerosol and the effectiveness of these mass have been shown that in fact they're just not there. Now that's stated, the bill says if you want to wear one, if you want to triple mass act face shield, if you'd like to go ahead and put a hazmat suit on, I say God bless, and I mean that wholeheartedly. But Dr. Chad Roy from the claim school of medicine said all this song and dance of wearing cloth mass was some presumption that you're being protected from an ambient virus is completely and positively 100% counter to how mass and respirators work. Further, the CDC has done three studies, one in Georgia, quote, masking students was not significantly significant in reducing transmission. Brown University, I'm an SEC fan, but I'll go ahead and quote the IVs, studied New York Massachusetts and Florida schools found no correlations between masking cases. David Siddling Williams and County in Tennessee, one with mask, one without mask, found literally virtual identical case counts, differing, nowhere with significant, statistical significance. County North Dakota, Lachor County, Florida, same thing. My point being is as we move forward, I'd like to be able to leave you with just a couple more quotes. If you could just look at the last sentence from Dr. Brombeil, Colorado's chief medical officer around children. There have been many weeks in 2021 that the number one reason for presenting to our emergency department is a suicide attempt. Our kids have run out of resilience and their tanks are empty. Let that sink in a little bit. The number one reason a children's hospital is seeing cases is suicide attempt. Here you can't quite see the highlight, but you'll see that Dr. Prasad out of the University of California says that a masking requirement of students failed to show independent benefit in finding of consequence and great interest, and I will leave you with his quote. The potential education harms of mandatory masking policies are much more firmly established at this point than their possible benefits in stopping and spreading COVID-19 in schools. I hope that we contemplate not just what the problem is, but how do we solve the problem and Mr. Speaker, I yield the well. Chair recognizes Chairman Dipsy to speak for the balance of the chair's time, five and a half minutes. Good afternoon. It's great to see you all. I feel like we're in a room where everyone is probably pretty much made up their mind about this, but I want to share just a little bit with you because we need to all get out of here actually. I've handled a lot of study committees and participated in a lot of conversations that deal with our children and deal with the challenges that they face when all is perfect. We've gone through a very unusual time. It's been hard on all of us as adults, but those little, little people that are being impacted so greatly in ways we cannot even truly measure until the years ahead. I want to ask you to focus on that. I want to ask you to think about children who were born during the pandemic and really are beginning to fall behind. They didn't have that emotional contact that they needed in daycare with everyone masked. As they became a little bit older and they went into pre-K, they fought to keep their own masks on. Eyes are great. You can learn a lot from someone's eyes, but that mouth, that smile, that emotional impact has been missing in many a child's life. I want to share with you simply as a mother and a grandmother. I'm so grateful that my children were groomed during this time. I feel for each of you that have had children in our elementary and secondary education at this point. My grandchildren though, ranged at the beginning of this from age 14 to twins that were four in pre-K. Their kindergarten experience began so unique. It's hard for me to even imagine. I was there and tried to help and tried to be a part of that. They had the cutest mask you'd ever seen, no doubt. But they didn't know their classroom. They were separated from each other. It happens to twins often. This was their first experience in their own room with their own teachers. They couldn't tell you much about any of the kids in the class when you talked to them. They all wore uniforms and they all had on masks. They began to be behind by the time they got to kindergarten. It was measurable. There were tutors used to get them through kindergarten to meet the milestones that are necessary and they were not unique. Most of the children in their school were going through that to help. There's just a difference and a disparity in being behind a mask and having that connection that involves all of the sensory gifts that we have been given. Also want you to think about another thing our special needs children. One teacher working in a classroom or a parapro with a child who has really serious developmental disabilities. Imagine one who is blind, who's deaf or even hard of hearing. How do you do it? I'm not really sure. It's time for us to get out of the way. I'm going to tell you that personally, I don't want to be the decision maker. I wanted to be the decision maker when I was a parent. I want those parents to decide to truly hold the balance of that responsibility of parenting to put it back in their hands and let them have that option to elect and decide at each and every moment in time what is best for their very own, very unique child. Thank you for listening. I hope your hearts will feel all of the opportunity that we have in this measure. Mr. Speaker, I yield the well. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The purpose is representative McLeod rise. Parliamentary inquiry. Is it not true that we have created mitigation for a whole host of things like drowning, like we were a vest. If you're in a car, we create seat belts. It's called mitigation and that is what a mask is. Thank you. The lady believes that to be true. What purpose does representative Mitchell rise? Parliamentary inquiry. That's right. Is it not true that part of the information just presented in that slide show was on pediatric deaths before April 2021 and that due to the shift in variance, we need to be considering the impact on Georgia's children looking at current and future variants which have had substantially more impact on the safety of our young children and immunocompromised individuals. I'm sure the lady believes that to be true. My own experience is that Chairman Jones is a very thorough, meticulous, what else? What's the advantage is I can use with you, Mr. Chairman, individual. All right. What purpose does Chairman Carpenter rise? Parliamentary inquiry. Stateary inquiry. Is it not true? I look around this room and I see a lot of people choosing not to wear masks and I'm just asking that kids get that same choice. The gentleman's so states, if all members voted, have all members voted. So the clerk will lock the machine on the passage of Senate Bill 514. The eyes are 93. The days are 52. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative Canada rise to make a motion? State your motion. I'm moving on reconsideration on that bill. He has moved for reconsideration of this House's action on Senate Bill 514 and that will be carried over to the next legislative day. Clerk will read the caption to Senate Bill 470. Senate Bill 470 by 7 Robertson 29th Alvers of the 56th Strict on the 17th and Kirkpatrick on the 30th. Be Todd and act to amend Article 13, Chapter 1 and Title 7 of the fiscal to Georgia and Tate related any licensing of mortgage goodlenders and mortgage brokerages to provide for different categories of felony convictions for the purposes of investigations of mortgage loan, originator, applicants, this bill I've referred to the Committee on Banks and Banking. That committee recommends that this bill do pass. They recognize this representative weed hour to present the bill. Thank you, Mr. Speaker. This bill simply removes the ban on mortgage lending companies to be able to hire somebody with a felony in their past. Should they not be in any fiduciary roles such as a janitor or administrator receptionist in the facility? That's all this bill does. It's been vetted by the Department of Banking and Finance and the Mortgage Bank for Association of Georgia. Mr. Speaker, I will yield for one question if there are any. Do you yield for questions? I will yield for one. Chair recognizes representative Kenner. Do you're left for a question? Mr. gentlemen, yield. I do. Isn't it true that there are roughly 11 million Georgians? In the last time I checked with the GBI, there are 4.32 million GCIC criminal records in Georgia. Only 6% of them are for nonviolent or perviolent felonies. And most of these criminal records are arrest only in no convictions. And so all these millions of extra records caused barriers between employment and housing. That would be correct. Mr. Speaker, I yield you well and I ask for your favor. We'll consider it right. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? We'll vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of Senate Bill 470, the eyes are 142. The nays are one. This bill having received the requisite constitutional majority is therefore passed. What purpose does Chairman Jasper's rise? Mr. Speaker, I'd like to make a motion. State your motion. I'd like the motion to recommit Senate Bill 345 back to the rules committee. Chairman Jasper's has moved that Senate Bill 345 be recommitted to the rules committee. Clerk will read the caption. Senate Bill 345 or Senate of the Mullis, the 53rd and others to be entitled to amend Chapter 1 of Title 50 that fiscal to Georgia and Tate River League and the General provisions regarding state government, so it's a private state and local governments for mandating vaccine passports. On the motion by Chairman Jasper's, Senate Bill 345 be recommitted to the rules committee. Is there objection? Is there objection? Chair, here's none and it is so ordered. What purpose does Chairman not rise? Speaker, I rise to make a motion. State your motion. Mr. Speaker, I'd like to make a motion that Senate Bill 82 be moved from the judiciary committee to the special committee on access to quality health care. I've spoken with both Chairman and they both have agreed. Chairman Knight has moved that Senate Bill 82 be transferred from the judiciary committee to the special committee on access to quality health care. Clerk will read the caption. Senate Bill 82 to be entitled to amend Chapter 11, Title 31 of the fiscal to Georgia and Tate River League and emergency medical services. On the motion by Chairman Knight, that Senate Bill 82 be transferred from the judiciary committee to the special committee on quality access to quality health care. Is there objection? Is there objection? Chair, here's none and it is so ordered. What purpose does Representative Gullet rise? I'm sorry. The chair recognizes Representative Gullet for a motion. Thank you, Mr. Speaker. I move that we insist on House substitute for Senate Bill 218. Representative Gullet has moved that this House insists on its position on Senate Bill 218. The clerk will read the caption. Senate Bill 218 by Senator Walker, the 20th, doogin, the 30th and others to be entitled to amend Chapter 5 of the Title 45 of the fiscal to Georgia and Tate River League and vacation of offices to provide for the suspension of compensation for certain public officers who were suspended be covered in indictment for felony. Chair recognizes Representative Gullet to explain his motion. Thank you, Mr. Speaker. Members of the body, we passed this measure last year and the Senate had some problems with it. So this will allow us to continue to move forward and insist and hopefully they'll appoint a conference committee and we can work out the differences in the conference committee. I might be answering your questions at the irony. You have no questions. Thank you. Representative Gullet has moved that the House insists on its position on Senate Bill 218. Is there objection? Is there objection? The Chair here is none. And this House has insisted on its position on Senate Bill 218. We have a group of local bills submitted by members of both parties. The Chair would ask for unanimous consent at this group of local legislation be that the rules of this House be temporarily suspended to allow these bills to be read for the first time in a sign to committee. Is there objection? Is there objection? The Chair here is none and they are all assigned to the Intergovernmental Coordination Committee. We'll read the caption to a group of privileged resolutions. That's got to be a first. We have, we're called up on privileged resolutions. It brings great joy to the body. All right. This end on a happy note. We have some birthdays to make note of. Today is the birthday of Representative Will Wade, happy birthday representative Wade. Today is also the birthday of Representative Sherry Gilligan. From Sunday on Sunday, March 27th before we come back, it will be the birthday of Representative Jody Lot. And it will be the birthday of Representative Joseph Gullet. We only have one announcement signed up so far. So I'm sure that may bring others, but Chair recognizes Representative Cannon for an announcement. Thank you, Mr. Speaker. Hi, members. You have all been provided with the state's child abuse and neglect prevention plan. This is called a vision for child and family well-being. I encourage you to look through the plan as it provides insight on how decision makers such as ourselves can help create policy solutions to help prevent child abuse and neglect in Georgia. Regional plans are also being developed and implemented by communities across the state. You also received your pinwheel lapel pin. We're asking that you wear these in the month of April, which is the month against child abuse. And we're hopeful that you'll learn about this prevention plan at PCAGeorgia.org. Thank you very much. Chair recognizes Chairman Knight for an announcement. Just a reminder, as we talked about the other day, putting March to 30th this coming Wednesday on your calendar. So as you go home, just remember, we're going to have the sportsman's legislative sportsman's caucus. It'll be a night at the range. So bring clothes or if you've got a favorite bar, if you want to fire, bring it back with you. And we're going to do that on Wednesday. So again, we'll get these invitations out in the details out to our caucus members today. Thank you. Chair wants to wish. Chair recognizes Representative Jasmine Clark for an announcement. Next week on Wednesday, the Westminster Robotics team is going to bring down the robots to share with us and to share about the advocacy that they're doing for STEM for K through 12. They would love to present their robots to you. It's at five o'clock at the South Wing steps and there will be snacks. So we would love if you would all join us. Next Wednesday at five o'clock. Thank you. All right. Chair wants to wish everyone a very restful and good weekend. And with that, the chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I moved to this House. Now stand adjourned until 10 a.m. 10 a.m. Monday, March 28th, 2022. The majority leader has moved that this House stand adjourned until Monday, March 28th at 10 a.m. All those in favor will give a resounding eye. Those opposed will whisper no. The eyes have it. This House will be adjourned until Monday, March 28th at 10 a.m.",
  "updated_at": "2026-02-13T23:00:31.640858+00:00"
}