{
  "video_id": "kACFjQHwUGY",
  "url": "https://youtu.be/kACFjQHwUGY?t=1179",
  "title": "Georgia House - Day 4 (2026-01-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-01-13",
  "duration_minutes": 66,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 4 (2026-01-13)\n\n## Overview\nThis session focused on responding to the severe weather that impacted North and Middle Georgia the previous day, including tornadoes that resulted in tragic loss of life. The speaker praised the state's first responders and Governor Kemp's actions, and the House paused for a moment of silence to reflect on those affected.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The House paused for a moment of silence to reflect on the victims of the recent severe weather and storms.\n- The speaker praised the state's first responders and Governor Kemp's response to the storm.\n- Chaplain Pastor Ken Smith delivered an invocation reflecting on Georgia's history, achievements, and the importance of civility.\n\n## Votes\nNone detected.\n\n## Attendance\nThe House held a quorum call and all members were present.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session would be.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning, Plurton-Ranged Bell.\nGood morning, the hour of convening having arrived, all members, all members will please\ntake their seats.\nWe've had the ringing of the bell, so...\nWell, good morning.\nWe're going to have the morning row call.\nAll members present will please vote green\nto signify their presence in the chamber.\nAnd the clerk will unlock the machines.\nThey have.\nhave all members voted, have all members voted, if so, the clerk will lock the machines.\nFor keepers, please close the doors and keep them closed.\nWell again, good morning.\nWe're going to pause just for a minute and bring you up to speed on the events of yesterday,\nwhich was a great day as we swore in the Constitutional Office of the Governor.\nAnd certainly then we had some tragedy in our state in this area.\nAs we go about our business of the day, I want to reflect this morning, I want us to\npause and reflect on severe weather that impacted our state last late yesterday afternoon\nlast night.\nThus far, we have four confirmed tornadoes that hit North and Middle Georgia, as I think\nwe all know damage was widespread.\nThe storm is confirmed to have claimed the lives of a five-year-old child in the\nmakin' area and a Walker County employee who was clearing debris. If you're\nrise with me and let's make it have a moment of silence as we reflect on those\nfolks' reimpact and certainly those families that have suffered this loss.\nNow despite this horrific news, we are thankful for all the first responders across the state,\nbut in this area.\nWe are always thankful for our first responders who have immediately went to work.\nI want to commend Governor Kemp for declaring a state of emergency.\nThanks also to the men and women at Jema, the State Patrol, DOT, DNR, and all of the other\nstate agencies that have worked throughout the night.\nOur members and impacted areas are in the districts they serve today, as they should\nbe.\nand Governor Kemp will visit those areas later today.\nI will join Governor Kemp at a press conference shortly to discuss our state's response.\nAgain, we pray for those impacted by the storms and will support our fellow Georgians in any\nway we can.\nThank y'all and we should all keep them as I know we will in our prayers as we support them.\nWe will begin our day with scripture reading and prayer by the chaplain, at which we will\npledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 73rd House District\nrepresenting Josh Bonner.\nThank you, Mr. Speaker.\nThis morning is my honor to introduce Chaplain of the Day and my friend Pastor Ken Smith.\nHe's joined today by his son, Adam, who's in the chamber with us.\nAnd Pastor Ken, along with his wife, Teresa, shepherd new beginning Baptist Church in\nSonnoi.\nThe mission statement of his church says they are committed to sharing God's love, fulfilling\nthe great commission and helping people understand the gospel.\nAnd having spent some time in worship in his church, that's exactly what they do.\nPastor Ken is a good man and is a great asset to his community.\nAnd we are so thankful that he was able to join us today, and with that, Pastor Ken.\nGood morning.\nThank you, Speaker Burns, and to the members of this chamber, it's a great honor for me\nto be able to join you today and speak, and also join you in condolences to the families\nand friends who also love ones and the storm.\nI also want to thank all the public servants that work so hard through the night to provide\nhelp and comfort for those who are affected by the storm and they are truly our heroes\nduring a time like this.\nGeorgia is a great state to live in when you agree with that.\nI heard you couldn't clap but you could say a man and it is a great state to live in.\nAnd I believe the secret is out about Georgia.\nThere are many people that are coming to live in this state.\nIt's home to the back-to-back national champion, Georgia Bulldogs.\nMy grandchildren wanted to remind me when I was here to say, go dogs or go dogs.\nIt's also home to some of the greatest universities in the world.\nHome of Chick-fil-A, Coca-Cola Delta, the birthplace of Martin Luther King, Jr., and we could\ngo on and on.\nAnd obviously our leadership has done some great things in leading this state, and obviously\nthere's some great citizens that live in the state of Georgia, and I'm proud to be a citizen\nof this state.\nFor my devotion, I need you to travel back with me if you would in the 1969.\nI was born at Georgia Baptist Hospital in 1964.\nWe lived near Lakewood at the Fairgrounds, but in 1969, I went into first grade in\nJones-Bertle at a school called Lee Street Elementary School. Some of you may be familiar\nwith that school and know where it was. My teacher was Mrs. Ham in the first grade and\nit was under direction of Mrs. Ham that I learned to read, write, I learned how to add\nand subtract, I learned manners, and also learned what my favorite subject was under\nMs. Ham's leadership, and that was recess.\nOn the first day of school, Ms. Ham said there's three things that I'm going to teach you\nthis year, and three things that you're going to learn, and I'm not going to be debatable.\nI'm not going to give any room on these three things, and as she was saying that, and you\nhave to understand, back in the later, later 60s and the early 70s, parents and the school\nhad a different way of looking at bringing up children and so as she was saying that there's\nthese three things that you will learn she was slowly reaching into the desk of her the drawer\nof her desk and pulling out a paddle a wooden paddle and laying it on top of the desk and some\nof you probably remember that I'm getting a few avians already Josh and and she gently laid that\non the desk in my mind as a first grader it looked like it was six foot long and I believe\nthat's really where my conversion started because she scared the devil out of me that morning.\nShe said there's three things you're going to learn about in this class and here's the\nfirst one is she said without without any leeway you're going to learn to respect me and\nto respect other people and I'm like yeah I got that I got that at home 100 time other\nand I father, I could do that.\nI can respect people, I understand that.\nI'm good there.\nAnd then she says, secondly, she said,\nyou're gonna learn how to be kind to people.\nAnd I'm like, yeah, I got that too.\nI know how to be kind.\nYeah, my brother, me and him getting a fight,\nmama makes us hug each other, say we're sorry,\nand treat each other with kindness, share our toys.\nI can handle that.\nI've got that.\nAnd as she said, third of all, she said,\nyou're gonna learn civility.\nAnd first grade, I was like civility.\nOh my God.\nWhat is that?\nI'm seeing the paddle.\nThere's no leeway on this.\nCivility, I don't know what civility is.\nIn the first grade, I'm in panic mode like,\nmaybe I won't be civility and I'll be punished for that.\nAnd I was, you know, really alarmed about what I should do.\nAnd then Rebecca, as I learned later,\nher name was Rebecca, raised her hand.\nThank God she did.\nAnd she said, Mrs. Ham, what does that mean?\nWhat does civility mean?\nAnd Ms. Ham said, it's the golden rule.\nYou treat others the way that you expect them to treat you.\nAnd I don't know if you know that,\nbut in the scripture in God's holy word,\nand as in fallible word, God laid that out\nin Matthew chapter 7 and verse 12,\nthat he expects us to treat others the way\nthat we would like to be treated.\nAnd then Ms. Ham went farther to say this.\nShe said this, when you treat other people with kindness, when you're polite to other\npeople, when you're courteous to other people.\nAnd they're in first grade, imagine this, they're in a first grade classroom at Lee Street\nElementary School in Jonesboro, Georgia.\nI learned how to be civil to other people, civil to my classmates.\nI learned how to say things like this, please.\nI learned how to say thank you.\nI learned how to say I'm sorry.\nI learned how to say excuse me.\nI learned pretty quickly how to raise my hand\nand wait to be called on before I spoke.\nAnd I even learned to say yes, ma'am, in first grade.\nIs it just me or to also the members of this hall\nfeel like there's a lack of civility in public life now?\nthat there's a whole lot of name calling,\na whole lot of smearing, a whole lot of screaming,\na whole lot of finger pointing,\nthat people have actually lost civility\nand they're ruthless in their interactions with each other.\nAnd all of this is unnecessary.\nWe don't have to act like that.\nWe can still follow the golden rule.\nAnd here's the thing about it\nthat I would like to say to you also,\nis unfortunately we live in a culture\nthat glamorizes bad behavior,\nuncivilized behavior, if you will.\nBecause if you're rude enough, vulgar enough,\nloud enough, you can become a rock star.\nAnd even in politics, you can be a hero for your party,\nor even a leader in your party\nif sometimes you display bad behavior or your uncivilized.\nI have eight grandchildren and I'm proud of and boy I could take a lot of time to talk\nabout them but five of them live near me and I called them all together because I was\nso excited about coming here and I don't know if you can know this but I'm really nervous\nabout being here too and I was just super excited and telling them about the opportunity\nthat I had to come to the state capital and speak to the representatives today and my\noldest granddaughter Susan the sixth grade she said you better be careful Paul Paul when\nyou go up there. And I'm like, why? She said, if you say the wrong thing, you could be\ncanceled. I said, canceled. What do you mean I could be canceled? She said, if you\nsay something, somebody doesn't like, they'll just make you disappear. Maybe some of you\nWe're familiar with that term.\nDisappear.\nI don't want to disappear.\nObviously, at this point, I hadn't said anything\ny'all wanted to prove it because I hadn't disappeared yet.\nBut in a strange country that we live in,\nwhere you can have an opposing point of view,\nand other people just want to make you disappear\nor silence you at all cost, no matter what it is.\nMy youngest grandson's three, and he said this to me.\nHe said, Paul, Paul, you go up there and say anything you want to say,\nbecause if they make you disappear, don't you worry.\nWe will find you.\nAnd I want to remind the members of this House,\nthe distinguished members of this House,\nthat this country survives, thrives,\noff of healthy debate.\nThat where people can have opposing opinions,\nsee things differently.\nBut at that, destroy us, it makes us better.\nBecause God reminds us in His Word that iron sharpens iron,\nthat you can have two opposing points of view.\nAnd we don't have to hate each other\nor try to make each other disappear or silence the other side.\nBut we can learn from each other.\nThat that healthy debate causes us to be better people,\nstronger people, sharper people.\nJesus said it like this, be you kind, tenderhearted,\nforgiving one another, even as God for Christ's sake\nhad forgiven us.\nSo how do you do that, Pastor Ken?\nHow do we act in a civil way?\nHow do we reach out and how do we embrace open debate?\nHow can we have opposing opinions,\nbeing different parties yet still get along\nwhere we have to understand what God did for us?\nthat we have this all-powerful, omnipotent, holy, perfect God.\nAnd then we're all part of this fallen race.\nAnd that Jesus Christ came into the world in hung and across.\nAnd when he was hanging on the cross,\nhe became the mediator between God and man.\nThat he reached up to our creator\nand grabbed the hand of a holy God.\nAnd then he also reached down to Jesus Christ.\nJesus Christ reached down his hand to the fallen creation.\nand he reconciled the two sides, brought us together,\nand that you and I have pieced through\nthe sacrifice of his cross.\nYes, we can live, civilize,\nbut only if we recognize, if God did that for me,\nI can do it for others.\nMay we stand in prayer.\nOur most kind and gracious Heavenly Father,\nthe creator and sustainer of the earth\nAnd the fullness thereof, we call upon you this day\nand ask that your favor may rest upon this state.\nThat your favor may rest upon this body of representatives\nthat we stand before today.\nAnd we specifically pray for each representative.\nAs your word, it monises us to do as Christians.\nWe pray for them that you would give them wisdom and peace\nand guide them with your presence.\nMay your face shine upon them,\nand may you help them to be able to prosper in your ways.\nWe ask you also this day to comfort those\nwho have been affected by this storm.\nMay you give them peace during this time\nand hope for the future.\nGive the communities the strength of God to come together\nand to be able to rebuild our communities better\nstronger and greater than they were. We ask for your guidance. May your favor rest upon us this\nday. Lead us not in the temptation but deliver us from evil. For Thine Lord is the kingdom, the power\nand the glory forever and ever. And we ask all this in the name of our Savior Jesus Christ. Amen.\nDo our keepers will please, excuse me, do our keepers will unlock the doors.\nmay greet the chaplain in the south any room.\nChair recognizes Vice Chairman Dunhu, the Vice Chairman of the Committee on Information\nand Audits.\nMr. Speaker your committee on information and audits has read the journals of the previous two legislative days and they have found them to be correct.\nVice Chairman Dunahue the vice chair of the committee on information and audits reports that the journal of the previous two legislative days has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nChair, here's none.\nThe reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nThe chair, here's none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business or the day.\nRepresentative Strachan of the 104th Moose Phylum me establishes the order of\nbusiness and the first part of the period unanimous consent instruction of\nbills and resolutions first reading and reference of house bills and\nresolutions second reading of bills and resolutions morning orders. Is there\nany objection to the adoption of the resolution establishing the order of\nof business for the day. Chair here's none and the resolution is adopted.\nFirst reading of bills and resolution the clerk will read. House for one by\nresident of Kendrick on the 95th clerk on the 108th scout of the 76 Davis the 87th\ncan and the 58th and others will be titled an act to amend title 31 of the fish\nto George Anatetti, relating to health,\nso survived for the compensation of pregnant women.\nThat was actually one.\nPublic health.\nHouse Bill 13 by Representative Mitchell of the 88th and Hewley the\n141st Bill being taught an act to a men article to chapter five or\ntitle 40. The official go to Georgia annotated relating the\nissuance expiration and renewal of licenses.\nMotor vehicles. House Bill 14 by rest of Kendrickly 95th Bill\nbe taught an act to men article to chapter seven and title 48.\nThe official go to Georgia annotated relating the imposition to rate\ncomputation exemptions and credits relative to income taxes.\nWays and means House Bill 15 by reps of Kendrick on the 95th\nBill B. Todd will act to amend article one on chapter 40 title 50 the\nFisher go to Georgia and attend to relating the general provisions\nrelative to promotion and deployment of broad bad services. Technology and\ninfrastructure innovation House Bill 16 by reps of Thomas the 65th McLean to the\nhundred and ninth Limer the 98th and Holly the 116th Bill B. Todd and\nan act of men Chapter one in Title 34,\nthe fiscal of Georgia and it's interrelated\nto general provisions relevant to labor\nand industrial relations.\nThe industry and labor House was 17 by ropes\nin Apollo 33rd, levered to the 123rd\nto launch the 167th Smith to the 18th,\nJasper's the 11th and others.\nBill B. Todd, an act of men chapter two,\ntitle 21 of the fiscal of Georgia and it's interrelated\nto primaries and elections generally.\nGovernmental affairs House Bill 18 by ropes\nof Burns 159 Jones, the 47th administration of the 104th\nand hatch of the 155th.\nBill Mehton and active men in that making\nand providing appropriations for the state fiscal year\nbeginning July 1st, 2022.\nAppropriations.\nHouse Bill 19 by Rose, the Burns 159 Jones,\nthe 47th administration of the 104th and hatch of the 155th.\nBill Mehton and active making provide appropriations\nfor the state fiscal year beginning July 1st, 2023.\n14th.\nAppropriations.\nHospital 20 by reps of burns 159.\nJones at the 47th administration.\nThe 104th and action to the 150 fifth.\nBill B. Todd and active men and act.\nAnd making a providing appropriations\nfor the state fiscal year beginning\nJuly 1st 2022.\nAppropriations.\nHospital 21 by reps of the burns 159.\nJones at the 47th administration.\n104th and action to the 150 fifth.\nBill B. Todd and active men and act making\nand providing appropriations for the state\non the state fiscal year beginning July 1st, 2022.\nAppropriations.\nHouse will 22 by Rose and the Burns on the 59th Jones\nto the 47th administration of the 104th\nand hatched to the 155th,\nbuilding top and act to make and provide appropriations\nfor the state fiscal year beginning July 1st, 2023.\nAppropriations.\nHouse will 23 by Rose and the Burns on the 59th Jones\nOn the 47th, frustration 104th and hatchet of the 155th,\nthey'll be taught on acting to provide appropriations\nfor state fiscal year beginning July 1st, 2023.\nAppropriations.\nHouse Resolution A by Repson of Mitchell, the 88th\nand Hucley, the 141st.\nA resolution encouraging the administration\nof President Joseph R. Biden Jr.\nJudiciary.\nHouse Resolution nine by Repson.\nBased more than $6.9, usually the 141st,\nprobably the 143rd, better than the 94th,\nPark of the 100th, 7th, resolution urging\nthe Georgia Department of Transportation\nto study safety and accents relating\nto vehicles emerging.\nTransportation.\nI complete first readers.\nSecond reading of bills and resolutions.\nThe clerk will read.\nHouse bill 11 by represent Campbell\nand the 171st to be able to provide compensation\nfor the chairperson and members\nReport of Education of Mitchell County, House Bill 12,\nby Representative Leveritt of the 123rd,\nand Bill to amend and act to provide a new charter\nfor the City of Comer, three second readers.\nYou\nYou\nYou\nroom.\nHouse will come to order, House will come to order. We have some further business of\nthe data tend to. House will come to order and members will take your seats. Y'all\nlistening very well this morning. I can tell it's Friday. I've got to be here all day.\nI don't know about you, but I will stay here for a while.\nThank you.\nThank you, Mr. Speaker, ladies and gentlemen of the House.\nIt's really a true honor for me to let you know that the Doctor of Day today is Dr. Brett\nhe is from my district and he's one of the one of the finest ER doctors that we\nhave in Cobb County in the state. He's very involved in trying to make sure\nthat we get good health care and a quick and meaningful way in Cobb County\nand interested that we do that across the state as he works with several\nmembers of his group. If you have an emergency or you think you might\nsome have something that would be an emergency over the weekend like you're\nbeginning to feel bad or you've got a foot that's killing you like mine go and\nsee Dr. Cannon before you leave the capital today and with that please do see\nDr. Cannon and thank you very much Mr. Speaker our yield well thank you\nchair lady Cooper we do appreciate our physicians coming here and serving\nit's a great service to us and we appreciate that very much\nnow if we get your attention continue to have your attention for a few more\nminutes we'll we can move on through and we have some members that want to be\nheard but first the clerk will read the caption to a group of privileged\nprivileged resolutions. Mr. Clerk committing the links in corporate and\nrecognizing February 6th 2023 as links day at the state capitol recognizing\nJanuary 23rd 2023 is Korean American day at the state capitol and recognizing\nJanuary 15th, 2023 is the Alpha Capa Alpha Sorority Inc. Founders Day at State Capital.\nAnd for other purposes, that completes the reading of the Privilege Resolutions.\nThank you, Mr. Clerk.\nIs there any objection to adopting the Privilege Resolutions Chair?\nHere's none, and the resolutions are adopted.\nNow, our first time to hear afternoon orders, we have a number of you who are signed up.\nWe'll give you each two minutes, two minutes to present your afternoon orders.\nSo first on our list is Leader Beverly.\nMr. Leader, good to hear from you this morning.\nDo you have two minutes, sir?\nThank you.\nThat shouldn't be counted toward my time.\nThank you, Mr. Speaker.\nToday, I'd rise and ask for your favorable consideration for two bills that the Georgia House Democratic\ncaucus is going to drop today.\nIt's LC520184 and LC520183.\nFor the past 10 years or more,\nGeorgia is certainly the leadership\nin the Georgia House Democratic Caucus has come to you\nand asked for us as a crew to expand\nand extend Medicaid coverage to all working Georgians.\nIt is past time.\nThis year, we're asking you those on the Republican side\nand certainly Democrats to please consider the kid\nwho works at Target who doesn't have health insurance,\nthat are families that are going to be unwind\nfrom Medicaid this year on April 1st.\nUnwinding Medicaid means this.\nThis year, there are multiple people in Georgia,\nabout 500,000 who have to requalify\nfor Medicaid extension benefits.\nThose people may be kicked off of the roles\nthrough no fault they're owned.\nThey may have moved on COVID.\nThere are things that are going on in their lives.\nWe're in a transition.\nIf we don't put money into a system\nto educate people around the state of Georgia\nthat this is going to happen,\nyou will have 500,000 joiners right now\nwho are currently enrolled that will be kicked off.\nSo I'm asking you to favorably consider that.\nThe second thing is we currently receive\n72% federal funding for Medicaid.\nIf we weren't to extend it, it goes to 90%.\nThe difference between that number 17, 72 and 90,\nis $3 billion that we leave on the table right now.\nWhat I would ask for your favor will consideration\nthat clerk has the bill,\ndon't let political theater get in the way of good actors\nin the general assembly.\nThank y'all, Mrs. Speaker, you're the well.\nThank you, Mr. Leader.\nChair, now recognize representing Bernal\nfor an afternoon order.\nThank you, Mr. Speaker.\nToday is Founders Day for Delta Sigma Theta Sorority Incorporated, and the members you see standing\nup here and a couple more. Our members of that sorority, our sorority is based on working\nfor education, for health, and so today is our Founders' Day. And so thank you very\nmuch, Mr. Speaker. And we will be having Georgia days at the State Capitol on February 22nd.\nThank you.\nThank you.\nChair recognizes Representative Drenner for an afternoon order.\nThank you, Mr. Speaker.\nGood morning, even though it's afternoon.\nI want to say congratulations to you, Mr. Speaker and to Governor Camp.\nI'd also like to say to Madam Speaker, congratulations,\nin my 22 years of service.\nI would never have dreamed of a woman being speaker,\nand I just wanted to say it one time publicly, thank you.\nI'd also like to applaud all the new members,\nand welcome you to the house,\nand I look forward to meeting and working with all of you.\nReally, today the reason that I rise,\nand let me just say, I did not speak to the preacher before.\nI drafted my remarks, okay.\nI rise today to take a moment out of our day to pay tribute\nand wish my mother a very happy 85th birthday.\nAs I thought about what I would say,\nfirst I would like for all of us to take a moment\nand acknowledge that each and every member has experienced\nor is experiencing the loss of someone they love.\nLosing people we love is by far the most difficult experience that anyone left living can endure.\nWe lost Speaker Rostin last week. My cousin Susie was buried last week.\nMy friend and fellow West Virginian chairman Parsons lost his mom a few years ago.\nAnd his words still resonate with me as I speak today.\nHe said, enjoy them while you can because when they are gone, it's too late.\nToday, I'm celebrating my mother, June Laverne Watson, who was born in Boone County, West Virginia,\nand was number eight in a family of 11.\nShe is now the oldest of her remaining siblings.\nShe spent 57 years of her life in public service, working for the City of Charleston, serving\nin various capacities most notable as the first affirmative action director and for\nthe State Board of Risk.\nShe did have the pleasure of working for now Senator Joe Manchin, who was then the governor.\nShe may not agree now with some of his actions, but she will be the first to say that he\nis health was Virginia.\nAt 77, she retired, and for multiple years,\nI had the pleasure of working face-to-face with her\nduring the legislative session.\nTo have the opportunity to work with one of your parents\nis a rare gift, one in which I will be forever grateful for.\nShe taught me so many things growing up,\nto believe in God, to be truthful,\nand to follow the golden rule.\nNot the one that says he who has the gold makes the rules.\nThe other one, which is so important today,\nmore than ever.\nThe golden rule is my favorite parable for living.\nDo unto others as you would want them to do unto you.\nThe latest time has expired.\nHappy birthday, mom.\nEven though I won't be there, I love you.\nAnd here's to many more.\nThank you.\nChair recognizes Representative Willis\nfor an evening order.\nGood morning.\nGood morning.\nThank you, Madam Speaker.\nThank you, House.\nI am Representative Willis.\nI stand with my sisters today before you\nto acknowledge Alpha Kappa Alpha Sorority\nand Incorporated's forthcoming Founders Day\nthat will always take place on January 15th.\nI first like to acknowledge our sister Greeks\nand congratulate Delta Sigma Theta\nSorority Incorporated on their founders day to day.\nIt was a cold day in 1908\non the campus of Howard University,\nwhere 16 college trained women\ncreated the blueprint for Black sorority life,\nthe architecture, the archetype, the assembly.\nI want you to think for a moment,\nwhat type of women were assembled at Howard University\nin Washington, D.C. in 1908.\nAnd how the best and brightest of us\ncan create something that matters 100 years later and beyond.\nTherefore, in honor of 115 years of sisterhood and service\nto global communities and the edification of women and girls,\nwe stand together as the Alpha Kappa Alpha women\nof the Georgia House, cultivating and encouraging\nperpetual service to all mankind.\nI'll leave you with a quote from our illustrious founder,\nEthel Hedgeman Lyle, and I hope that this may apply to our session.\nTo my mind, we should all be too busy for petty things.\nToo big for smallness, too intelligent to not see what happens when we stoop to them.\nAnd so we thank each and every one of you and the acknowledgement of the sisterhood that\nhas been created and the importance of unity.\nScripture states where two are more gathered, I am with you and we are with you in this\nhouse.\nI yield back the well. Chair recognizes representative Cameron for an afternoon order.\nThank you, Madam Speaker. First, I'm meeting knowledge. Representative Monahan for\nNotifying me of the death of one of our residents of Lafayette, Georgia, who was killed in a tragic accident yesterday\nThank you\nSean Kernack. He was a foreman with G dot\nHe was tragically killed doing his job\nHe was valued member of our community. He was originally from North, Tonto, Wanda, New York\nHe leaves behind a daughter and many family members and significant other and\nWe value G dot all of us do we work with him\nWe don't realize sometimes how dangerous the work they do is, and my condolences go out to Commissioner McMurray and the members of the G dot staff.\nSo I'd like to have a moment of silence in his letter.\nThank you Madam Speaker.\nChair recognizes Chairman Dickie for an afternoon order.\nI don't know a little lot of them, thank you Madam Speaker, out to that devotion this morning\non civility reminding me that I have a very important date tomorrow, I've got an anniversary\nand a very important one and I just want to tell my high school sweetheart Cindy happy anniversary\nfor putting up with me for 45 years.\nAnd I just appreciate her for her love and support,\nand most of all, her advice.\nDidn't realize after 45 years,\nhow little I knew sometimes.\nSo, but thank you, Cindy, I love you.\nChair recognizes Chairman Mitchell\nfor an afternoon order.\nThank you, Madam Speaker.\nOn your desk, I've been tasked to bring to your notice.\nThere's a flyer for the annual Dr. Martin Luther King Jr.\nCelebration of Service.\nYou're welcome to join us.\nIt will begin as soon as we get out of here this morning.\nThe governor and the speaker are part of the program.\nAnd we look forward to you being there as well.\nbeen asked to remind you the bills that the leader has mentioned are available here with\nthe clerk for you to sign if you are so inclined. Thank you so much Madam Speaker.\nBefore the House comes back to order next week we will have several birthdays that I'd\nlike to recognize. The first is on Wednesday, January 18th Scotty Long. We'll have in the\nclerk's office. We'll have a birthday. Happy birthday, Scotty. And on Friday,\nJanuary 20th, the new dean of the House, Representative Green will have a\nbirthday. And finally, on Sunday, January 22nd, Representative LaHood will have\na birthday. All right, we have a few announcements before we adjourn the first by\nRepresentative Inelowicz. If you have an announcement, please come to the\nfront. Hi everyone. The Cobb County legislative delegation is going to have\nof its first meeting of 2023 on January 23rd, 2023.\nThis is going to be the organizational meeting\nof the delegation.\nWe will be electing a slate of officers,\nand we are going to be adopting our rules\nfor the 2023, 2024 term.\nThis meeting is going to be in 514 CLOB at noon, again,\non Monday, January 23rd, or upon adjournment.\nIf you have any questions, you can reach out to me,\nand you're going to be receiving an email notice.\nIf you have an office, you'll also receive a hard copy\nof this notice very soon.\nThank you.\nChair recognizes Chairman Hatchett for an announcement.\nThank you, Madam Speaker.\nIf you're heading on your book, they are in 412s.\nThe governor's proposed budget for amended fiscal year 23\nand fiscal year 24.\nWe, again, we will be having joint hearings with the Senate and the House next week on\nthe budget.\nAnd for those of you who are on appropriations, we will be having subcommittee meetings\nnext Thursday afternoon and Friday.\nHouse subcommittee meetings will be held next Thursday afternoon, after the joint hearings,\nand then some will be held on Friday.\nIf you're on appropriations, you will be getting the notice of which subcommittees are\nmeeting, but we are here and we are ready to go to work.\nHave a great weekend.\nMr. Chairman, Chair would like to clarify for the members since we have so many freshmen,\nare there budget books available for all 180 members or just the members that are on\nappropriations?\nThere are budget books available for all 180 members.\nThank you.\nChair recognizes representative Roberts for an announcement.\nThank you Madam Speaker.\nThe Fulton County delegation we should have gotten noticed by email we are meeting to do\nour elections right after we leave here in CLOB 514.\nThanks.\nChair recognizes Chairman Stevens for an announcement.\nThank you Madam Speaker.\nSo today that we come back and reconvene on the 23rd, if your district touches the first\ncongressional district, we call that coastal district of Georgia, we'll be hearing it\nlunch from DNR DOT, an update on the 3000 acre Hyundai plant and Georgia ports and some\nothers.\nSo mark your calendar for the first day at lunch, lunch will be provided, if your district\ntouches the first congressional district 12 o'clock room 230. Chair recognizes the majority\nleader for a motion. Thank you, Madam Speaker. I move that this house stand adjourned\nuntil 10 a.m. on Monday, January 23rd, 2023. On the motion by the majority leader that\nThis House stand adjourned until 10 a.m.\nMonday, January 23rd.\nAll those in favor will say aye.\nAll those opposed will say no.\nThe ayes clearly have it and this House stands adjourned.\n",
  "updated_at": "2026-02-12T16:45:33.96408+00:00"
}