{
  "video_id": "KbH394f_HNs",
  "url": "https://www.youtube.com/watch?v=KbH394f_HNs",
  "title": "Hormone Replacement Therapy and Reproductive Rights: Georgia Lawmakers Discuss Women's Rights Bills",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript on Hormone Replacement Therapy and Reproductive Rights:\n\n**Overview**\nThe session featured discussions on bills related to providing state employees with hormone replacement therapy coverage and rewriting Georgia's laws on abortion and reproductive health. Democratic and Republican women lawmakers debated the need for and details of these proposed bills.\n\n**Key Actions**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**\nNo specific bills were introduced.\n\n**Notable Moments**\n- Republican Rep. Beth Camp discussed a bill to provide state employees who are biological women with full coverage for hormone replacement therapy (HRT). She argued this is important as women's hormones change with age, impacting health issues like bone density, muscle density, cognitive ability, and incontinence.\n- Democratic Rep. Jen Roberts and other Democratic female lawmakers want to pursue a sweeping rewrite of Georgia's abortion laws, arguing it's an important fight for women's freedom to decide when and if to have a family. Rep. Roberts shared her personal story of having to terminate a pregnancy due to fetal complications.\n- Rep. Roberts also discussed a bill to allow pharmacists to prescribe contraception, arguing it would increase access in areas without OB/GYNs, especially for unbanked, gig workers, and those without transportation.\n- There was discussion around whether this contraception bill would still require some doctor involvement, with Rep. Roberts noting 36 other states have similar provisions.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nNo quorum notes were provided.\n\n**Adjournment**\nThe transcript does not specify when the session adjourned or the date of the next session.",
  "transcript": "In 1922, two years after the 19th\namendment passed, giving women the right\nto vote, Georgia elected its first women\nin the general assembly. Currently, 13\nout of 56 state senators are women and\nmore than 60 out of the 180 members of\nthe House are female. These dynamic\nwomen, they wield influence, and some of\nthem are in leadership positions.\nTonight, we'll hear from four women.\nFirst, Republican Representative Beth\nCamp of Concord. She chairs the\njudiciary juvenile and her other\ncommittees include ways and means and\nagriculture and consumer affairs. Also\nwith us is Democratic representative Jay\nRoberts of Atlanta. Among her committee\nassignments are judicial, non-ivil,\ngovernmental affairs and creative arts\nand entertainment. Welcome to you both\nto Lawmakers this year. So I'm going to\nstart with you um chairman camp. You\nhave a bill to provide state employees\nwho are biological women with hormone\nreplacement therapy. Why do you think\nthis legislation is needed?\n>> Well, it codifies that the state healthc\ncare plan would provide\ncoverage for women needing HRT, hormone\nreplacement therapy. With the blackbox\nlabel warning removed from hormone\nreplacement therapy, I think it's\nimportant just to make sure that women\nwho are in the state healthcare plan,\nwhich are a lot of women, um teachers\nare included, state employees, a lot of\nothers, it gives actually an opportunity\nfor those women to make sure they have\nwhat they need. As we age, our hormones\nchange and um we're not all built um to\nbe 25 forever and bone density and\nmuscle density and cognitive ability.\nThere's, you know, incontinence, there's\nall kinds of things that are very\nimportant for women's health that\nhormone replacement have shown time and\ntime again to be helpful with.\n>> And right now, state insurance doesn't\ncover that.\n>> Um it does not fully cover it. Okay. For\nsome aspects, yes, but not all aspects.\nSo, what would your bill do? Cover all\nof it?\n>> It would cover all of it. Yes.\n>> Okay. All right. We'll talk about We\nhave You have more to talk about coming\nup. Represent Roberts, you and five\nother Democratic female lawmakers want\nto gain once again um a big one.\nSweeping\na sweeping rewrite of the Georgia law on\nabortion and reproductive health. This\nis something you've fought for for for\nyears, uh every year since 2019 in the\nheartbeat bill. So,\n>> yes. Isn't it still an uphill battle?\nWhat do you think?\n>> It is an uphill battle, but I think it's\nreally important that we continue to\nfight because um I just believe that\nevery Georgian should have the freedom\nto decide when and if they want to have\na family. I mean, we are facing\naffordability crisis right now and\nforcing women to have children that\nthey're not ready for, can't afford is\njust one more thing that we need to look\nat. And then there's the whole health\ncrisis. you know, doctors and lawyers\nhave to confer at critical care times um\nwhen women are in the middle of misaring\nand um we've got bad health outcomes. We\nknow Amber Nicole Thurman, Adriana\nSmith. Um, you know, these stories are\nreal and the people are re real here and\num so I'm I will continue to fight for\nit because um you know I've told my own\nabortion story publicly. Um I was\npregnant and and my baby was uh\nincompatible with life. We wanted it.\nUm, but I was able to make that choice\nbecause my doctor and my parinatlogist\nsaid you're 37 and it's hard on your\nbody and you have two little ones at\nhome and so um you know we recommend\nthat you terminate and my husband and I\nhad a hard decision to make but we did\nand my daughters now 22 and 25 can't\nmake the same healthc care decisions I\ncan. It's time for us to put these\ndecisions back in the hands of women and\ntheir doctors.\n>> Okay. We I I know it's personal for you\nand so thank you once again for sharing\nthis. We'll talk about more specifics in\na moment. Okay. I want to switch to a\nhearing you had today on one of your\nbills. Tell us about the bills. It bill\nit deals with contraception.\n>> Yes, it is actually a great bill um\nbecause it gives accessibility to women\num so women can make some more choices\nin their lives. Um for example um we\ndon't have we have 82 counties that do\nnot have OBGYNS in our state which is\nastounding. So this bill allows\npharmacists to operate at the top of\ntheir lure and prescribe contraception\nincluding depa and so most individuals\nin communities have there's a pharmacy\nif there's not a doctor in town there's\ngenerally a pharmacy um even box stores\nhavearmacies grocery stores havearmacies\nso it's a wonderful opportunity for\npeople to have more access to that\nhealth care um this bill also would\nallow individuals to get more than just\na month at a time and their insurance or\nMedicaid coverage\nSo they could get up to 12 months at a\ntime. So someone who's unbanked, someone\nwho's a gig worker, someone who um\ndoesn't have transportation. There are a\nlot of opportunities for individuals to\nbe able to get contraception and have\nthat discussion with a health care\nprofessional, a pharmacist.\n>> Are there any other states that have\ndone the same thing where you bypass the\ndoctor essentially?\n>> Well, it's not bypassing. Um\n>> you still have to go to the doctor.\nWell, they still recommend you have a\npapsmear and get all the the checkups\nthat anyone else would normally get, but\num 36 other states have provisions that\nallow pharmacists to prescribe\ncontraception. Um and there's things\nthat was one of the questions today.\nThere are medical reasons why a\npharmacist might not be able to. If you\nhave a family history of breast cancer\nor ovarian cancer, if you have a history\nof blood clots, if you're a smoker, um\nif you know perhaps you don't have a\nlifestyle that you might need to get\nanother form of birth control, maybe\nyou're not going to remember to take the\npill every day or something along those\nlines, you need to talk to your\ngynecologist to get um perhaps an IUD or\nmake other decisions about\ncontraception. So, a you'll have to give\nyour medical history to your pharmacist.\n>> They probably already have it. My\npharmacist knows a lot about me. They\nknow every medication that I've taken\nfor the past 15 years and um they they\nhave a lot of information on me and I'm\nsure yours does as well.\n>> I I'll think about that. You may be\nright.\n>> Uh Representative Roberts, you your bill\nwould mean a legal shift in\ninvestigating and prosecuting pregnancy\noutcomes. So, how how would that work?\nWell, it would take criminalization of\ndoctors and women out of the mix. So, um\ndoctors could go back to practicing the\nstandard of care that they um and follow\ntheir oath. A lot of times they're\nfeeling like they're being asked to um\ndeny the standard of care that they were\ntrained to give their patients. And so\nthat's put them in really difficult\npositions. I mean, there are hospitals\nthat have teams of people that meet to\ndiscuss whether or not care can be\ngiven. and we know women have died in\nthis state because of the lack of quick\ncare. Um, and so it's just really\nimportant that we remove the prosecution\nside of things. Um, we tend to be trying\nto pro uh to criminalize a lot of our\nprofessions these days. I was in lots of\nhearings this week about librarians\ntrying to criminalize them. Um, so it\njust seems like we could support them\nand make sure that we're not as\nlegislators, we're not practicing\nmedicine without a license. I feel like\nthat's kind of what we've been doing a\nlittle bit.\n>> Okay.\n>> Thank you.\n>> Y\n>> I want to ask you about your\ncontraceptive bill contraception bill.\nWould it um\nwe you're going to follow other states,\nbut would you would you still need to to\nhave some doctors involved at some\npoint? Yes, the um state composite\nmedical board and also I'm sure the\ndepartment of public health would be\ninvolved to some degree and um the\npharmacy board. They're all going to\ncome together and in other states they\nset up a protocol of what questions are\nto be asked and what facilitates a yes\nand what facilitates you need to go see\nyour doctor. So, everyone is going to be\nvery deeply involved. There's going to\nbe um continuing education for the\npharmacist. Um, the Georgia Association\nof OBGYNS came in today. They support\nthis bill\n>> because I know you look shocked. They\nsupport this bill because they going\nback to there are 82 counties without an\nOBGYn and out of 159, they can't get to\neveryone they need to get to. And they\nthey deal with complex pregnancies. They\ndeal with other women's healthcare\nneeds. someone simply needing to be put\non the pill or to a patch that doesn't\nalways ne necessitate going to the\ndoctor and so they recognize this could\nbe a great partnership to make sure\nwomen get the health care they need. Um\nour licensing in our state our\npharmacists are doctors and so this\nwould allow them to operate at the top\nof their lure.\n>> Okay. So they're did you have any of\nthem talk about the bill today?\npharmacist or obedies pharmacist.\n>> Um, no, but they are supportive of the\nbill of the measure. Um, it's not a\nmandate. All pharmacists do not have to\ndo this. So, if you're at home, you do\nnot have to do this if you're a\npharmacist.\n>> That's what I was going to say.\n>> But, um, but it does give them an\nopportunity and I know talking to my\npharmacist um I'm able to get a lot of\ninformation and um advice and so I would\nfeel comfortable doing it and I think a\nlot of people would.\n>> Okay. Well, we're going to keep up with\nyour bill and your bill too. I want to\nthank you both for coming on the",
  "updated_at": "2026-02-14T14:50:14.065914+00:00"
}