{
  "video_id": "kfVgvwwmmhc",
  "url": "https://youtu.be/kfVgvwwmmhc?t=1440",
  "title": "Georgia House - Day 35 (2026-03-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-14",
  "duration_minutes": 251,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 35 (2026-03-14) session:\n\n**Overview**\nThis session was focused on honoring the late Speaker David Ralston, with tributes and prayers led by Chaplain Mack Jackson. The House conducted routine legislative business like confirming the journal and establishing the order of the day.\n\n**Key Actions**\nNo substantive bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Chaplain Mack Jackson delivered a moving tribute to the late Speaker Ralston, reflecting on his purpose, service, and legacy.\n- The House acknowledged Ralston's wife Valerie and his staff in attendance.\n- The House pledged allegiance and recognized the presence of various guests on the floor.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nA quorum was present, and the House conducted business.\n\n**Adjournment**\nThe House did not adjourn, but moved on to the next item of business.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I've not introduced him, but recognizing our chaplain of the day today, Chairman Mack Jackson. As many of us in this house had the distinction over the years to have a fine, fine man call us his friend. And on many occasions I heard Speaker David Rolston call Mack Jackson his friend. And he also called Valerie Jackson his friend is well Valerie if you'll stand up and let us welcome you to the people's house. Thank you. Mack Jackson's a man of God. Speaker Rolston was a man of God and they recognize that trait in each other. Some of you probably heard this story but I'll tell you again unless you're going to tell it but I won't tell it.\n\nSo a surprise, I'm not sure if Corporal Moody was with them. The speaker that day when they showed up down in Sandersville. What's that other large city in Tintel? Yeah, Tintel. Those of you who'd been down to Washington County, those Tintels are really a really big city down there. So when some cars showed up outside this little country church, St. James Christian Fellowship Church, it created quite a commotion. Fair to say, quite a commotion. And it also surprised the pastor who was able to welcome his friend, his speaker, to a service in his church. It's kind of guy, it's kind of man David Ralston was. So with that, I want to invite our colleague, Chairman McJackson, to bring us a devotion for today. Mr. Chairman. Thank you, Mr. Speaker. It's an honor to be here today to help to celebrate this occasion for my friend, the late speaker David Ralston. Greetings to my colleagues, I'll special guest the Ralston family, and all that came with him. I see some of this staff from his old office sitting here with us, and it just seems like old times today. But I don't have a five minutes today, so I'll be very brief, so that we can get on with other programs. But in old church, they always taught us, when we get up to say, I give honor to God, who is the head of my life and to his son, Jesus Christ. When we're here today for a special occasion, and I'm truly honored, Mr. Speaker, to be called upon to participate in this event. Speaker Ralston was my friend, and as I was considering what would be appropriate from the Word of God, from the Scriptures, to say about David Ralston. I thought about Esther, 4 and 14, when Morty Catoe Esther, and who knows whether, that it been called to the kingdom for such a time as this. But then I thought about Jeremiah 1 and 5, before I formed in the belly, I knew thee, and before that came forth out of the womb, I sanctified thee, and I ordained thee a prophet unto the nations. I thought about 2nd Timothy 1 and 9, who had saved us, and called us with a holy calling, not according to our works, but according to his own purpose and grace, which was given us in Christ Jesus before the world began. You see, Speaker Ralston lived out his purpose every day. He was like someone who was in the right place at the right time to fulfill his destiny. And I remember a song that Charles Wesley wrote, a song that we used to sing to in the Old Church. And the song says, a charge to keep our health, a God to glorify, a never dying soul to save, and fit it for the sky. But this is what I like, and it epitomizes Speaker Ralston, to serve the present age, my calling to fulfill, or made all my powers engaged to do my master's will. And I believe that he was a man of purpose. He was a man that saw a need for the state of Georgia. And Georgia is a better place because of David Ralston. He was a friend to the least. And Jesus told us the way to be successful in life is to serve. And Speaker Ralston had a heart of service. He saw a need and he served the least of them. The ones that couldn't give anything back, he served them with all his heart. But on November 16th, 2022, I believe he heard these words that Paul said in 2 Timothy 4 and 6, for I'm now ready to be offered. And the time of my departure is at hand. I have fought a good fight. I have finished my course. I have kept the faith. Speaker Ralston finished his course. And now I believe he has a crown or righteousness because of what he did here in the General Assembly, in life, in Blue Ridge, and all over the state of Georgia. He was a man of destiny. And I believe he finished his course. You see, ladies and gentlemen, Speaker Ralston made the state a better place. And he finished his course. And may God continue to bless his family and may God continue to bless the great state of Georgia. Shall we pray? Guide me, O thy great Jehovah, pilgrim through this barren land. I am weak but thou are mighty, hold me with thy power for hand. Bread of heaven, bread of heaven, feed me till I want no more. Feed me till I want no more. Bless this family, Lord. Bless this General Assembly, Father. Bless the man, Lord, who is left behind footprints in the sands of time, Lord. And we ask for your wisdom and your guidance upon speaker burns and the rest of the General Assembly as we complete the great work that was started by our friend. Father, we thank you for this great occasion today and may your hand be upon each one of us in Jesus' name, amen. Would you join me in the pledge of allegiance? I pledge allegiance to the flag of the United States of America and to the Republic of Georgia sands one nation under the law in the middle of the war, with the liberty and justice of the world. I know you got a lot to do. Thank you, Mr. Chairman. I speak of Rolston, love you, and you inspire him as you do all of us. Thank you for those words of remembrance and certainly those words that encourage us to continue to work of a great man. Thank you, Matt. The doorkeepers, you may unlock the doors. Members, you can go to the south any room if you'd like and greet the chaplain, or you can do what you do every day. It's taught to him on the floor, but that's your choice. Members, I think you all know the order of the day will, the business where we will be about and I will let you know that we have many guests on the floor and they will be purposefully acknowledged shortly. One of my favorite things to do. I can hit that almost as good as he could there, but not quite. Members, I want you to give the chairman your attention. Chair recognizes Chairman Tarvan, the chair of the Committee on Information and Audits. Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. And if you will indulge me, I usually try to make my statements every day gender neutral, but today on this special day, the monument of a great man is not of granite or marble or bronze. It consists of his goodness, his deeds, and his compassion. Happy birthday, Speaker David Ralston. Well said, my friend. Well said. I can always can on you to be politically correct, I may say. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal, the previous legislative day, has been read and found to be correct, is there any objection to dispense with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with, is there any objection to the confirmation of the journal? Chair, here's none, and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, a situation 104th Moose following me establishes the order of business during the first part of the period unanimous consent, introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none, and the resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House Bill 1473 by the Reps, I abstinence into the 150th of the bill, be titled act to provide a new charter for the city of Fort Valley. Intergovernmental coordination. House Bill 1474 by the Reps, and I've luped into the 83rd, Holland on the 54th, Miller to the 62nd, Willis the 55th, Scofield to 63rd, and others, bill, be titled act to amend the act to provide a new charter for the city of Atlanta. The Intergovernmental coordination. House Bill 1475 by the Reps, and in flumbing of the 114th Henderson, 113th Carter, the 93rd, bill, be titled act to amend and act to provide a new charter for the city of Covington. Intergovernmental coordination. House Bill 1476 by the Reps, and the Honorable of the 26th Cox, the 28th Clark, and the 100th, Jazz Vist of the 11th Jones, the 25th and others, bill, be titled act to authorize the governing authority of Forsyth County to levying in excise tax. Intergovernmental coordination. House Bill 1477 by the Reps, and in flumbing of the 114th Henderson, the 113th Carter, the 93rd, bill, be titled act to amend and act to provide a new charter for the city of Oxford. Intergovernmental coordination. House Bill 1478 by the Reps, and a black men in the 146th, Beverly, and 143rd, Williams, and the 148th, jickey, the 145th, hatchet, and 155th, and others, bill, be titled act to create the mid-state energy authority. Intergovernmental coordination. House Bill 1479 by Reps, and a birchette into the 176th and Corb of the 174th, bill, be titled act to authorize the assessment and collection of a technology feed by the probed quarterware county. Intergovernmental coordination. House Bill 1480 by Reps, and a silk cox of the 53rd Jones of the 47th Thomas of the 65th Miller of the 62nd, bill, is the 55th and others, bill, be titled act to amend and act providing for the number of members and for the election of members of the Board of Education of Fulton County. Intergovernmental coordination. House Bill 1481 by Reps, and a can of the 58th schoolfield, the 63rd, Harlem of the 54th, Evans, the 57th, Evans of the 89th and others, bill, be titled act to provide a home-steady exemption from city of Atlanta, independent school district, ad ballorum taxes. Intergovernmental coordination. House Bill 1482 by Reps, and a Stevens, the 164th, Gillier, the 162nd, Hitchens, the 161st, Jackson, the 165th, and Westbrook, the 163rd, bill, be titled act to repeal and act to provide for the establishment of fire protection districts in Chatham County. Intergovernmental coordination. House Bill 1484 by Reps, and a null of its of the 42nd Williams of the 37th, the bluptin of the 83rd, Cummings of the 39th, Cooper of the 45th, bill, be titled act to amend, chapter 10 of Title 25, and chapter 60 of Title 36 of the Efficiency of the Georgia Anitated, relating regulation of fireworks. Governmental affairs. House Bill 1485 by Reps, and a lupton of the 83rd, Tran of the 80th, Taylor of the 92nd, Barnes of the 86th, been to the 94th, and others, bill, be titled act to amend, act to create and establish into Cabb County, Georgia districts from which the members of the county board of education shall be elected. Intergovernmental coordination. House Bill 1486 by Reps, and a lupton of the 83rd, all over the 82nd, Tran of the 80th, Barnes of the 86th, Draper of the 90th, and others, bill, be titled act to amend, act to incorporate the city of Brookhaven. Intergovernmental coordination. House Resolution 1434 by Reps, and a martin of the 111th of the Resolution honoring Mrs. Ashley McDonald, Callahan, and dedicating intersection and memory. Transportation. House Resolution 1435 by Reps, and a Stevens of 164th of the Resolution urging the State of Georgia and Department of Economic Development to support the Vince Dulley battlefield preservation from. The Economic Development Antirism. House Resolution 1477 by Reps, and a 15th, more than 91st, Tran of the 80th, Lupton of the 83rd, Resolution creating the House Study Committee on Offshore Wind Energy. The Energy Utilities and Telecommunications. Senate Bill 575 by Senator Williams, the 25th bill be titled act to create the Millage Mill public facilities authority. The Intergovernmental Coordination. A complete first readers. Second reading of bills and resolutions. The clerk will read. House Bill 1470 by Reps, and a martin of the 74th, Bonner of the 73rd, based more of the 69th Jackson of the 68th. A belt to amend an act provided for the recreation of the Board of Elections of Fayette County. House Bill 1471 by Reps, and a balance of the 23rd, Thomas of the 21st, Jones of the 47th. Carson of the 46th, Coggins of the 14th, and others, a bill to authorize the governing authority of Cherokee County to Levy and Excise Tax. House Bill 1472 by Reps, and a gamble of the 15th, and Coggins of the 14th. A bill to provide for the creation of one or more community improvement districts in Bartholow County. House Bill 1483 by Reps, and a lever to the 123rd, a bill to amend an act providing a new charter for the City of Washington. House Resolution 1416 by Reps, and a deal to 79th work, Kaiser of the 157th, the resolution creating the House Study Committee on felony sentencing and punishment in Georgia. House Resolution 1417 by Reps, and a cannon of the 58th and a bell of the 75th. Resolution honoring the life of Dr. Roy Charles Bell, dedicating a bridge in his memory. House Resolution 1418 by Reps, and a law of the 59th Washburn of the 144th. Friday of the 120th, we now have the 121st, Hughley of the 141st and others. Resolution creating the House Study Committee on the use of local fees to support affordable housing. House Resolution 1432 by Reps, and a pro of the 118th McCollum of the 30th. Resolution creating the House Disaster mitigation of Resilient Study Committee. House Resolution 1433 by Reps, and a bell of the 75th, Hodleston of the 72nd, Holland of the 54th, Maynard of the 56th, Clark of the 108th and others. Resolution creating the House Study Committee on the eradication of homelessness. Through second readers. The House will come to order. Mr. Clerk reports of standing committees will you read. Representative Tyler Paul Smith of the 18th District Chairman of the Committee on Judiciary, Non-Civil Submitted the Following Report. Mr. Speaker, your committee on Judiciary, Non-Civil has added under its consideration following Bill's and Senate as instructor of the committee report, same back to the House of the following recommendations. Senate Bill 465, due passed by committee substitute, Senate Bill 493, due passed by committee substitute, Senate Bill 533, due passed, respectfully submitted Representative Tyler Paul Smith of the 18th District Chairman. The police, the reading, the report, is standing committees. Thank you, Mr. Clerk. Members, if you will please take your seats. We'll move on to morning orders, and as most of you have been informed, we will not have any morning orders from the members this morning, but we do have an invite resolution. Members, we have guests on the floor today. The House will come to order. Members, please take your seats. As Speaker Ralston reminded me from time to time, I'll remind you all, take your conversations to any rooms or cease them and take your seats. We have an invite resolution. It's very appropriate for this time of year. I hope all of you have your green on. Mr. Clerk, will you read the caption to a resolution, House resolution 1224. House resolution 1224, my resident of Carson, 46, Bonner, 73, hatchet of 150, 5th, Stevens 164, and Peachery 166, a resolution recognizing and commending minister Peter Burke. Thank you, Mr. Clerk. We will now recognize Chairman John Carson to speak to the resolution. Chairman Carson. Thank you, Mr. Speaker. Good morning, everybody. Today, March 14th, we have St. Patrick's Day coming up, just like the speaker said, and it's coming up fast, including this Sunday is the 200th anniversary of the Savannah St. Patrick's Day parade. There's over 1 million Georgians that, like myself, have Irish ancestry, my own family immigrated from Newbury, Ireland, right around 200 years ago. With that, I'd like to recognize the delegation from the Ireland Consulate here in Atlanta, Quivey, Ni, Kirk, Kurt, Council General. Did I do that right? Okay. Emyr Nolan, Vice Council, Vice Council, Connor Madden, Private Secretary, and Laura Manion, Special Advisor. We welcome them to the house. In addition, we have, they're all with the consulate staff here on Peachtree Road in Buckhead, but we also have with us today, straight from Dublin, Ireland, the Minister, Peter Burke, Peter's constituency is from Langford, Westmeath, did I say that correct? That's in sort of north central Ireland, west of Dublin. He is the Minister of State for European Affairs and Defense, straight from Dublin, Ireland, Minister, Peter Burke, Minister. Good morning, everyone. Thank you, Speaker of Burns. Really appreciate your time and being here, and also Governor Kemp. I really want to acknowledge and thank both of you for facilitating this and representative Karson, which we really appreciate. Could I firstly just pay my respects to former speaker, Rosson, who was a great friend of my country, and I've heard the great remarks that have been made here this morning, respect of him, so I really want to pass on my respects as the country. He last visited, I understand, and had a very good and enjoyable experience there, and to your family as well, just acknowledge that. We really special day for us, obviously, with St Patrick's Day on Sunday, and we are very privileged to be here in the United States, our relationship, which we value so much, very dear friends, we have now nine missions in the United States, our councillor general here in Georgia open in 2010, a country that here, 9.5% of us population claim Irish heritage, about 32 million people, and as your representative said, about 1 million here in Georgia, and the definition I think of a good bilateral relationship, dear friends, is that it works both ways. Here in Georgia, we have about 7,000 people employed by Irish companies, a sign of the FDI investment, companies like Curry and C.R.H. on the ground here, operating people. I think that's a real evidence that the relationship is working well, both ways. So I really want to thank everyone for that. We are investing heavily as an Irish government in the relationship because we value the friendship. We know how much the relationship means to us, and we always remember the great help we got during Northern Ireland to try and get the assembly back up and running during the time of the Good Friday agreement was a very special time in our history, and the friendship really paid dividends again for us at that particular time. We have two points to make in our mission this year, which is very important to us in Ireland. Firstly, our dear friends in Ukraine, we think it is very important that we stand very clearly with Ukraine. I know from being a member of the European Union, it is the first war on mainland Europe in a generation, and a country's territorial integrity, the international rules based order, the right to self determination is at stake. And if we in any way yield or lose a resolution towards Ukraine, the consequences will be stark to your friends. We have agreed to 50 billion euro budget through the European Union to help them with their economy into the future. At so important we do stand firmly with them. The second very brief thing is I want to really acknowledge the US administration and the work they are doing trying to seek a ceasefire in the Middle East. We as a government have been very clear in our condemnation of Hamas under Act on October 7th. We are very crystal clear on our demand for all hostages to be released immediately. But we also see it is so important to protect vulnerable people. We need to get humanitarian corridors right into the heart of Gaza immediately, because we cannot have a collective punishment of very vulnerable people. And that is so important to us as an Irish country. We really need to see that. And I thank the US administration for working with interlocutors in the region to try and achieve that. So the last thing I want to say is that August 24th, Georgia Tech are going to win in Dublin. So go yellow jackets. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nyou you House will come to order you you you you you you you you you you you you you you you you You you he Kollege a couple of folks in here and I want to ask you to stand and be recognized and we'll start with them 3 very, very important Folks in speak of his bride, Sherry, and so we appreciate you all being here. Thank you for being here. I'm better if she's not on line now, she'll see this soon. Speaker Ralsas' mother, Miss Ernestine. We don't love the mama. That's a good, but I'll tell you what, Speaker Rolston loved his mother and was always so proud to talk about it and she stood with him. Stood with him day in and day out. And I think I thought about something else he was very proud of. A gentleman named Willard, Rolston, who was clerk of court for many, many years up in Fanon County. You know, I think Speaker Rolston got his love of public service from a lot of people, but I know his dad's imprint for public service and he cared about his fellow men and his mothers were always on his mind and on his heart. So we appreciate and remember his dad and Speaker Rolston always did finally. His brother, Dennis, Dennis, if you'll stand, we appreciate you. You know, there's no stronger bond than between brothers and sisters and I know that Speaker Rolston spoke often of his brothers and he loved them dearly. I'm not going to be able to recognize everyone that was so important to Speaker Rolston, but I'm going to hit a couple, but we'll move on through this. As I just recognized and Spiro Amburn helped unveil the painting. Speaker Rolston's chief of staff, a gentleman that Speaker Rolston felt so strongly about and I know that the Spiro saw Speaker Rolston as a father figure. So Spiro, we appreciate your service to Georgia, but especially your friendship and service and support for Speaker Rolston. Thank you for that. A couple. All of us know here in this place the work that we do cannot be done along. So I want to recognize three ladies that were especially helpful in directing Speaker Rolston. And I'll say that very strongly, directing Speaker Rolston. As executive assistants, Diane Hardin, if you'll stand. Thank you, Diane. We appreciate you coming back. You have a special place in Speaker Rolston's heart. Miss Lisa Johnson. Where's Lisa? Lisa. Thank you. She loved you as well. And certainly not last but not least at all. Kathy Little. Kathy. Appreciate you. Just a couple of comments from someone who was so proud to have Speaker Rolston call me friend. Speaker Rolston had a generational impact on our state. Not merely by his years of service, but the care and love that he had for the members of this house that he loves so dearly, but more importantly for the people of this state. Now I tell you, it's pretty special today that three gentlemen that have led this state that were friends of Speaker Rolston are here today to help us pay tribute to. But I think the measure of a person is built on relationships like this. But more importantly, is built on that relationship and caring about the least of us. Speaker Rolston was dedicated to the mental health and the well-being of the people of this state. His legacy will go on. This house, this General Assembly and this government will help us foster that legacy in the years to come. I believe that I'll close with that on my comments because I can think of no higher comment to see about an individual that they cared about their neighbor. They cared about their fellow men and that they were a good, good man. Speaker Rolston was all of the above. And I thank the good Lord for sending David Rolston to Georgia, to his family, to his bum and daddy, to his brothers, and all of us who care so deeply about him. Speaker David Rolston was a friend. And his legacy will live on in so many different ways, but his remembrance for us members and for the public will certainly be very, very strong as this portrait is placed on interest to this house chamber tomorrow. So anyone that enters the hall of doors of the Georgia House of Representatives, when they look to their right, they'll see Speaker David Rolston. They took, looked to their left. They'll see former Speaker Tom Murphy, two giants of this state who came from North Georgia, from the hills and mountains of North Georgia, who both of them loved early. And Speaker David Rolston has left a lasting imprint on us as individuals, but on the people and the well-being of all the citizens of Georgia. With that, I want to welcome the 81st Governor of the State of Georgia, Governor, if I may, Governor Sonny Perdue, who's held many, many titles and many important positions of responsibility in this state. I know of the high esteem that Speaker Rolston had for you, Governor Perdue. And it's because of your friendship. I think he served with you in the Senate. And he served this house very well as a member while you were governor, I believe. And certainly, Governor Perdue, you've made many important contributions to our state. If you would, I would appreciate, and the members would, if you'd come up and have a few words. Come on up here, if you will, sir. We'll let you come all the way up here. Thank you. Thank you, Speaker Burns, for offering me this honor of acknowledging the Speaker David Rolston. You've characterized him very well already. This thing we can say about David Rolston, he was a good man. I first had the opportunity in January of 1993 to understand that when David first came to the Senate. It was, I was in my second term, many of you know, I was serving as a Democrat at that time. David is a Republican. Those were the great days when we were able to reach across the aisle and really get a lot of good stuff done in that way because David wanted the best for Georgia. That was very clear, very evident from very time. He had the DNA in his heart and his life and his family of public service. And he just wanted the best solutions for Georgia regardless of where they came from. He continued to demonstrate that while he was in the Senate, sadly, I didn't get to serve within that long in the Senate. Or did I get to serve with him while he was Speaker that long? We overlap for one year. That's my regret, honestly, that we didn't get to serve together and those kind of roles were that long. But it was so clear to me. And I think, Speaker, you mentioned it, Speaker Burns, you mentioned it. The memory and the goal and the heart of David Rolston, you all have authorized to be perpetual at the University of Georgia with the mental health situation there at the University of Georgia. So his heart, his passion, his care for humankind, particular those unfortunate will continue to remain alive and well based on your actions in that way. We look forward to guarding that heritage, guarding that legacy very clearly as we go forward because he was a good man. He loved people. He cared for people. He governed in a way that every one of you members could tell that he wanted the best for Georgia. Thank you, Larry, to honor just to speak briefly about my love and affection and gratitude for the service of Speaker David Rolston. Thank you all. Thank you, Chancellor. Thank you, Senator Perdue. Now our next gentleman, we would love to come up and speak to his memories of Speaker Rolston, Governor Nathan Deal. Their service did not overlap. I thank Governor Deal. We talked about it. You were on your way to Washington when Speaker Rolston came into the Senate. And I think he had covered you previously as a reporter in games. How do you do on that? Was he fair? How sure he was. Reporters always are. I know doubt about that. So it's a great honor for me personally and for the members of this house to welcome you. The 82nd Governor of the State of Georgia, Governor Nathan Deal. Governor Deal. Thank you all. Thank you. Thank you. Thank you all. Thank you. Thank you, Speaker Burns. I am honored to be with you all today. See so many familiar faces and quite a few new ones. Welcome to the most deliberative body that you will ever be a part of. And I can say that having been as your colleague Doug Collins did at the higher level, this is the more deliberative body and closer to the will of the people. So thank you for having me. As Speaker indicated, my association with David goes way back. I had gotten out of the army and having come from middle Georgia, my wife persuaded me that the North Georgia hills were a good place to be. Although she warned me that if I went to Gainesville, that I would never make any money because she had so many relatives, they'd all want me to do free legal work. Fortunately, that was not the case. But that's where I met David Ralston for the first time. And yes, he was a reporter at the Gainesville Times, a young cub reporter. But he was always wise beyond his years, always going to extra mile to do his job the best he could. And he did. And then he decided to go to law school, having known him in his experience there as a reporter when I found out that he was getting close to graduating, I called him up and tried to persuade him to come join my law firm in Gainesville. But the pool of his part of the mountains was stronger. His family ties were stronger and he went back home, which proved to be a very wise decision on his part. All the things that had been said about David Ralston are true. He was a good friend. He was the kind of person that you didn't have to go back and try to recreate your friendship every time you saw him. You simply picked up where you left off. You knew that you could depend on him. And as governors will tell you, one thing that you need is a strong speaker of the house of representatives that you can depend on. Whose word is reliable. As you make decisions based on that, and he in turn has to have the confidence of the body that he represents, and David certainly had that. As I have had occasion to speak on various occasions, people always come up and say, well, we appreciate your wisdom. Well, you know, I got to thinking about that. I tried to decide what is wisdom. That David Ralston had it. And this is my definition of wisdom. It is common sense that has been marinated by experience. And that's what David Ralston brought to the table. One sense that has been marinated in the brine of experience. Thank you so much for having me today to the family. My best wishes. You will always be a part of me and my heart and all of you in this body. Thank you so very much. Congratulations to the family. I need I say more. A very, very wise man, Governor Nathan Deal. Thank you, Governor Deal. One of the things that always impressed me about Speaker Ralston. He always wanted his family, close by. And always impresses me about our current Governor. So this morning, we were very proud to welcome Amy Porter to the House. We're very proud to represent our First Lady Marty Kemp as they support our Governor, the 83rd Governor of the State of Georgia. Brian Kemp. Governor Kemp, will you come forward? Well, thank you very much. Thank you all and good morning, Speaker Burns. It is honor for Marty and Amy Porter to be with you today to honor a great man and accomplished statesman and a value Georgian whose memory continues to abide here in this chamber. I just am honored also to be standing with Governor Perdue and Governor Deal this morning. Governor Deal, I will tell you, I feel like I'm still being marinated. David Ralston had a big part in helping marinate me over the years. But as I said after Speaker Ralston passed, he was so many things to so many people. He was a man of faith and a man of family, a loyal friend, a lifelong Republican. No doubt he was a proud North Georgian who talked about the mountains a lot. He was certainly a commanding authority in this house, but I don't think he broke his many gavils as Speaker Burns has. He was also a fighter though. He was a fighter who always showed respect to everyone regardless of what's out of the issue they were on. He was a man of decency. And as we know, he was a passionate fan of the braves and the Georgia Bulldogs. He's mentioned a champion of mental health reform, but also a master of political and American history and as we know so much more. I know all of us has been expressed this morning have memories of Speaker Ralston and we will cherish them for many years. This portrait will serve as a lasting reminder of this man and of those memories. And for those that knew him, it will bring back moments of shared triumph in times of bittersweet defeat, made more bearable because of his friendship. It also will remind us of his booming voice that once reverberated through the halls of this capitol. And it will remind us of all that he achieved during his long tenure under this gold dome, not just for the people of North Georgia, not just for Republicans, but for all Georgians. He was no doubt a great partner, especially when it came to matters of economic development and keeping Georgia the number one state for business. Now I will just tell you, I'm sure when the portrait was unveiled and people saw that beautiful painting, they probably had many emotions and thoughts. But sitting right there where I was and those eyes coming right toward me, I just felt like he was looking saying, you all need to get your business finished. I'm not exactly sure what he might be wanting us to do, but I just feel like that gaze is telling us we need to continue our work here for the people of this state. And I know that every time we pass by this painting, certainly Marty and the girls and I will think about all that he accomplished during his years of public service, but also just those shared memories that we have with him. It will also remind us of his loved ones who are still here to safeguard that memory and that legacy. Sheree and Matt, Elizabeth, Dennis and the rest of the Ralston family just know that you all continue to be in our thoughts or prayers. It may speak a Ralston's memory, continue to live on as long as this portrait hangs in these hallowed halls. Thank you all for having me. God bless. Go and Rekeap. I can let you know from personal knowledge, speak a Ralston appreciated your leadership for this state through some very difficult times and in the good times as well. So thank you for your leadership and appreciate your comments and your family being here. We're getting down to the end here. Now a lady that I know, we all know in this room is Sheree Ralston, who speak a Ralston loved. How about that? So very much. So if you would, Sheree, we would love to have you come up. Sheree Ralston, my friends, the wife of our late speaker David Ralston. How did this? Ooh, it's daunting to be here without him. Every time I've been behind this podium, he's stood beside me. I'd like to first say thank you to this body for having our family here today with you. Thank you to Governor Perdue, Governor Deel, and Governor Kent for your kind words. Thank you and I think I have quite a few people from House District 7 here. Thank you for being here. David Ralston loved you and he worked hard for you, but he loved you so much. Thank you, Speaker Burns, for giving me this opportunity. Thank you all so very much. Thank you to the artist. But most of all, thank you to the University of North Georgia, who stays faithful to David Ralston and he was faithful to you. Thank you so very much. What a strong lady you are. We know that Speaker Ralston's work will always be on the forefront because you will make sure it's there, won't you. I can guarantee you as other members that love him. Two points of personal privilege that I want to take. Congressman Doug Collins, a dear friend. Thank you for being here. We appreciate you. You will work in this house for our country and your service and your service in Washington. Speaker Ralston thought the world of you as you know. And on a more personal note, another lady that worked very closely with Speaker Ralston, who also had the great distinction of working with me. I'm not sure if she'll agree with that. But as Pat Harris, Pat, we appreciate you being here. Speaker Ralston loves you very much. And we appreciate you. Thank you. All of our special guests in this Georgia House today, the members of this House appreciate you, Governor of the Congressmen, friends, family, District 7. We appreciate those of you who supported Speaker Ralston over the years. The great work he did for the mountains of this state. We appreciate each and every one of you that have been here. Now, we're going to close.\n\nwith a song. We're going to ask a gentleman from down in Dublin, Georgia, a gentleman who's Speaker Ralston, healed in such high esteem. Love him as a brother. Chairman Hatchett, how about leaders in a singing, a happy birthday to the Speaker Ralston, who would have been his 70th birthday. Let's all stand and sing happy birthday to Speaker David Ralston, Chairman Hatchett. Thank you, Mr. Speaker. And if I may, y'all all know, I'm a big guy, and he was a big guy. And just to remember to always tell each other that she loved him, because he did that to me and I did that to him. So keep that in your mind. And let's sing happy birthday. Happy birthday to you. Happy birthday to you. That concludes our work. Members, if you want to greet our guests, you may do that. We will pause for a few minutes. Thank you for all of our guests that made such a special effort to be here and for your words. Thank you so much. The House will come to order. We have some members we need to hear from as we continue into our morning orders. The House will come to order. Members will please take their seats. Great job, Travis. You captured the speaker. No doubt about that. House will come to order. Members will please take your seats. Mr. Clerk, if you'll ring the bell and bring our members back into the House. The House will come to order. Members, we are going to have our morning orders. Members, we will have strict construction. Morning orders this morning. You have one minute. Representative Lamb. Just be ready if you'll stand by just for a minute. Members, if you will give your attention to the gentleman in the well and take your conversations to another point in the chamber. We are not ready yet. We are about ready to begin with morning orders but I first want to recognize a former member of this House representing Roger Hines who also served as the best-in-ger of the House. It's always good to see you, brother. We are looking great. Good to see you. Thanks for coming back. Representative Lamb is recognized for one minute for morning order. Thank you, Mr. Speaker. I'm pleased to welcome Rockbridge Elementary and Principal McRaea here today. I believe they're over at the Senate right now. The school whose student body comprises students from over 40 countries and over 20 different languages is at the heart of my district. I want to acknowledge not only their scholastic achievements but also Rockbridge being the embodiment of communities and schools which I know is important to all of us. Housing rights training, health fairs, nutrition classes, monthly blood pressure screenings, events for home-based child care providers. These are but a few of the events we've been able to put together new events at Rockbridge just in the last 365 days. I want to take a moment to acknowledge them. Their commitment to communities and schools and Principal McRaea. Thank you, Mr. Speaker. Thank you, Representative Chairman. Steven is Ron Stevens is recognized for a morning order. Thank you, Mr. Speaker. I'm looking for my crowd. I think they're trying to work their way back in. Today is the Community Health Care Service Day. I can tell you that there's collectively 35 organizations and 243 sites in 132 counties. These ladies and gentlemen serve 750,000 patients in health care centers throughout the state of Georgia and they contribute $375 million per year to the Georgia economy. These folks are our safety net for those that are underinsured or uninsured and they were supposed to be here today and they're going to be in the aneroom if you'd like to come out and see your representative. Thank you, Mr. Speaker. Are you loyal? Representative Fleming. Thank you. I must be moving on with his group from the Senate. Representative Park Cannon. She's getting her group. Representative Stoner, how about you? His representative Park Cannon will recognize Representative Cannon. Thank you, Mr. Speaker. Any of the Paranatal providers, day, members, honorees, if you could stand. Super excited to be here with Representative Lydia Glaze, who has helped us through this year of understanding of maternal health appreciation. Today is Paranatal Provider's Appreciation Day. As many of you may know, midwives and OBGYNs are assisted by providers called DULAS. DULAS provide emotional and physical support and also work in conjunction with other providers. Today we have Naim Abond, wave your hand to his assisted over 100 births as a DULA, Tiffany Bryant, who is the manager of Georgia's first ever hospital-based DULA program at WALSTAR Health Systems. Shanti Moore, who is a midwife completing her training this summer, Natalie Hernandez from Morehouse School of Medicine Center for Maternal Equity, which has been funded through our state budget by this chamber and Amina Sacred Birth Keeper, as well as Umselama and Bethany, who are community midwives. We just want to say that we support you. We're proud of you. We're grateful for you and congratulations on today Paranatal Provider Appreciation Day. Thank you, Mr. Speaker. Representative Stoner. Representative Stoner is recognized for a morning order. Thank you, Mr. Chairman. One other thing I want to wear today is type one day here at the state capital, both here in the House and in the Senate. In particular, I want to ask some of our pages who are here today, if they'll stand up, who are type one diabetics themselves, they are here serving today us in the chamber and also there's several pages over in the Senate too. Thank you, Katie. Thank you guys. As y'all are aware, this is an issue that my wife and I have worked on for many years. In fact, this will be the ninth year that we've done type one day here at the state capital. And for those who are not familiar with what type one is, it's an audio immune disease that causes a person's pancreas to stop producing insulin. It's not type two, it is type one. There are differences. And like I said, just want to thank everyone who's support on these issues, all these members here that have worked on issues concerning diabetes. And again, want to thank the pages who've come down here today and their parents to page with us today as type one diabetics themselves. Thank you all very much. Thank you. Representative Paris is recognized for a morning order. Representative Paris. I was looking over there, you coming down the middle aisle. And friends. Representative Dickie? Chairman Dickie? Chairman Dickie. Colleagues, we are announcing again the Cherry Blossom Festival that starts tomorrow in Maycon. Of course, you know, it is a 10-day event. And if you want to find out about what is going to be happening in those 10 days, all you have to do is go to cherryblossom.com, cherryblossomfestival.com, and you can find out all of the events for the week. And it's going to be a great time. We have a great race that, you know, and yeah, thank you all so much. Thank you, Mr. Speaker. Cherry Blossom Festival. Representative Henderson is recognized for a morning order and she's bringing along Representative Fleming. You are recognized. Good morning. Thank you, Mr. Speaker. Good morning, House of Representatives. It gives me great pleasure to extend a resolution and an outstanding Georgia award to none other than principal of the year 2024 for the entire state of Georgia. It's none other than Newton High School principal, Dr. Shannon Richardson Buff, a company by her husband, Bart Buff, and family. During her tenure as principal of the Newton High School, the graduation rate increased to 92%. She elevates SAT scores and ACT scores, and she orchestrated $50 million secured in scholarship for the school. She has a rich background in education. Dr. Buff, thank you for the years of leadership. Thank you for your dedication, hard work, perseverance, so our children, my own daughter, Angel, was under your leadership for years. So I thank you wholeheartedly. Thank you for doing what you're doing in the halls of education. We are proud that you represent Newton County. We also are delighted to have none other than I was superintendent of education, Dr. Duke Bradley III. When you stand, Dr. Bradley, Colleys, can you give them both a hand for a tremendous compliment of principal of the year 2024 for the entire state of Georgia. God bless you both. Thank you, Mr. Speaker. Thank you, representing congratulations, and thank you for your work. We appreciate that. Representative Fleming has recognized for a morning order. Representative Henderson will join. And Representative Anderson, we got the whole crowd. Thank you, Mr. Speaker. I want to recognize. I want to recognize today is Newton Industry Day at the Capitol. We have many of our industry leaders at local elected officials. I don't think they're in the gallery. I think they're on the synoside. But we have Bridgestone, General Mills, Archer Aviation, Metta, BD Bard, and Sinneleys, some of the leading industries from Newton County. Today after the lunch break, you will be receiving a gift bag on your desk from Newton County and industrial development authority, which will include some Bridgestone golf balls, some Bridgestone hats, and some other good goodies from Newton County. So thank you, Mr. Speaker, we yield the will. Thank you. I think Representative Anderson has been giving me a hard time representing Crow, and that's why he was on my mind. So sorry about that. Members, I'm going to take a shot here. Representative Terry Cummins is excused today, but we are going to recognize this Miss Cobb County. Is that correct? Great to have you, Miss Cobb County of members. Let's bet with welcome the show lady to the house. Thank you for being here. We appreciate you and good luck on the next pageant. You'll do great. That concludes our morning orders. Members, we're going to move on to the rules calendar. Move on to the rules calendar. Mr. Clerk, will you read the caption to Senate Bill 387-387? Senate Bill 387 by Senator Capatric of the 32nd hatch of the 50th pain of the 54th Roberts of the 29th and others, we title an act to amend Article 5 of Chapter 5 of Title 40, the Fish go to Georgia and attended relating identification cards for persons without driver's licenses, so it's required that person identification card applications of certain applicants were either homeless or in the legal custody division of family and children's services do not require signatures by the applicant's parent. This bill I refer to the committee on juvenile justice, that committee recommends this bill do pass. Chair Lady Ballinger is recognized to present Senate Bill 387. Thank you, Mr. Speaker. Ladies and gentlemen, this is a really simple bill. Section 1, a desolate with a parental signature that's required to get an identification card. Section 2 indicates that the kids will have to pay for the identification card. In Section 3, just mandates that defects get every child that's between 14 and 19 years of age in their custody and identification card. I'll be happy to yield for any questions. You have no questions. Thank you, our urge your favorable consideration of the bill Senate Bill 387. Thank you. I think Lady is yielded the well. We have a member who wishes to speak in favor. Representative Higgley is recognized to speak in favor of Senate Bill 387. Lady is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, the House. I want to thank the chair lady and her committee for bringing us this bill. It's very important because we had a situation in Muscogee County where a new student arrived at a school. They left the campus on the first day. The school didn't have their records. There was no identification and public safety had a difficult time trying to deal with this. So this is going to really help our students who are in foster care. So I appreciate the bill and our urge your favorable consideration. Thank you, our yielded one. Thank you, Representative. She's yielded the well.\n\nIs there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill on the chair here is none? The report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. All members voted. All members voted. If so, the clerk will lock the machine. All in the passage of Senate bill 387, the yeas are 161, the nays are zero. This bill, Henry C. Duretka, was it constitutional majority is therefore passed. Members, the portrait of Speaker Ralston will be in the south any room until it's placed tomorrow. So, if you'd like a photo or something later in the day, that's where the painting will be. So, you can take advantage of that. Mr. Clerk, will you read the caption to SB-O-SB, excuse me, 233-33? Senate bill 233 by Senator Donald Zell of the 27th, brass of the 28th, still of the 48th, more of the 53rd, and others being titled back to amend, title 20 of the EFISCO to George Anitetti relating the education so to provide for the establishment of Promise Scholarship Accounts. The legislature will have a refer to the committee on education. That committee recommends a dispelled du-pass by committee substitute. This bill is on the supplemental rules calendar, and in the wisdom of the rules committee, we will consider this bill pursuant to House Rule 33.3, and the debate will be limited. So, if you have any questions or questions, please let me know in the comments. If you have any questions or questions, please let me know in the comments section below. Thank you, Mr. Speaker. It's not Groundhog Day, but many of you were here last year and you heard much of the debate. So, my primary objective today is to go through the bill and let you know of the many changes that were made to the bill, not only from when the bill originated in the Senate and came to the House the first time, but after listening to many members and others, we have continued to refine the bill. The bill you have before you is very responsible, responsible piece of legislation that will enhance the current educational options that we give children, including public school. I've personally worked on education policy since I was first elected to the Georgia House representatives. More than 95% of the education legislation over that time period and our $15 billion education budget is devoted to students attending public schools. The state's commitment benefited my four children, now public school and public college graduates. I'm grateful to the teachers and the administrators that helped shape their future and dedicated their life's work to their future. On the other hand, even though we made the choice to send our children to public school as a mother and now as a grandmother, I've never wanted fewer opportunities for my children. I was glad that there were a limited number of charter schools and a targeted school voucher program or two that the state currently had to provide options even though we did not exercise them. I have rarely encountered regular citizens who wanted fewer options. Georgia has offered a variety of state education programs with state funding for as long as 30 years for students, with no apparent downside to government-owned schools and colleges into the benefit of the students given educational choice. For example, you may have heard me say after studying pre-K over the summer and making substantial recommendations on how we could make it better, many of you may not be aware half of the 73,000 four-year-olds that attend state-funded pre-K classes or educated in four-profit childcare settings. The other half attend pre-K offered in public elementary schools. Of the 149,000 students receiving hope scholarship this year, 15,000 attend a Georgia private college and receive $5,000 yearly out of lottery funds, which by the way are state tax collections. Out of the general budget, the state provides an additional universal $500 per semester, $1,000 a year voucher, a tuition equalization grant oftentimes referred to as TEG to private college students in Georgia. The state also pays tuition for high school dual enrollment students satisfying class requirements at public and private colleges. 52,000 students take advantage of that. What you may not be aware, though, is that in the general budget, the state pays dual enrollment for students who attend private schools, private high schools. And there are 5,386 students attending private high schools in which Georgia pays a total of about $9 million per year out of the general budget so that they, too, may have further educational options, both at private and public colleges. Since 2007, some of you may have been here when we passed a special needs scholarship equal to the state funding for qualifying students whose parents prefer to private school to meet their child's educational needs. I haven't noticed it's been particularly controversial when we've made some minor tweaks to it over the years to update it. There are 3,000 students, some of them your constituents, who use this now to attend a school that they feel better meets their child's needs. Increasingly, other states have offered educational options, other programs to complement public education. Even Georgia has offered tax credits since 2008, directed to nonprofits to help students pay private school tuition. A program totaling, I believe I meant to ask John Carson, but I believe it's up to 100 million, might be 80 million a year. If it's 100 million, that equals 6% of 1% of the state's public education budget equal to a rounding error. So in that regard, I would like to spend a few minutes and go over the bill and some of the changes that we've made. In the first section of the bill, we will now have a, let me get my notes here. A new, Georgia Education Savings Authority will be created up under the Student Finance Commission. We will be composed of the same board members, and this is in keeping with how we have other authorities under the Student Finance Commission. This is the agency that is most able to handle funding that is moved out either to private schools, private colleges, public colleges, and otherwise. They have other authorities under them, but it will be a legal entity in which the funds will win appropriate, when it's enacted, would be put, and they would manage the funds for the parents who choose to use it. That's in, begins on part one. Next, another section, private schools must be accredited or going through the accreditation process. And the Education Savings Authority, which will be under the Student Finance Commission, that agency, will have the authority to examine and audit participating student accounts. I think it's very interesting. I've heard discussion about the accreditation, whether they're accredited or going through accreditation. You might be interested to know that many, many public elementary and middle schools, traditional public and elementary schools are not accredited. In fact, the accreditation process generally takes several years, and they, a charter school, for example, will open, start undergoing accreditation, usually as I mentioned, takes about three years. You can't pre-accreditate a school. It has to operate for a few years so that how they conduct business and how they educate the children can be evaluated. Accreditation most matters for high schools, because hope is accepted. A student can apply for and receive hope, or hope grant, if they attend a high school that is not accredited, for example, when Clayton County lost its accreditation. They could still apply for and receive hope scholarship. Accreditation is really needed, aside from, I will say, it is an indicator for quality, is if you are applying to a college out of state, and they require that your high school have accreditation. That said, 131 public school systems have waivers that waives, for example, certification of teachers. We have many teachers as well in Georgia that are not certified, but they are undergoing certification. We really don't know how many, because most of the charter systems have waived teacher certification, and most of the charter, not charter, but the contract school systems have also waived that. That is, that part is on page 13. To be eligible, a student's parent has to have been a Georgia resident for at least one year, that's on page 15. However, that one year requirement doesn't apply if the student's parent is an active military service member stationed in Georgia within the previous year. So, I have been asked about, can students hop back and forth? Of course, they can do that in public schools. You can move into one public school, and then move your location over to another public school. You could do it three times a year if you wanted to, although most parents have no interest in doing that. But your parent, you have to have continuously been enrolled for one year in a school that performs in the lowest 25%. Unless you're entering kindergarten. That isn't keeping with how we do our specialty scholarship and our education tax credit, because you weren't in school the previous year. And I just want to clarify that when I was here when we enacted the first student scholarship, the special needs scholarship, all the debate of attending a school for a year, should it be six weeks, should it be one semester, should it be two. The point of that is for the benefit of the public school. What we didn't want was for a public school who puts its contracts out in May for teachers to have students sign up to fulfill their requirement and then lead before the second student count in the spring. It wasn't because we thought it was necessary that the student had been in the public school. It was for the benefit of the planning and the future employment labor needs, teacher needs of the public school. And that is why it is in there. And it is consistent, although it is tighter than what we have in the special needs scholarship and with the tax credit. Priority, this is a new priority for promise scholarships will be given to students whose parents earn 400% or less of the federal poverty rate, which in 2024 is 120,000. That's about two for a couple that's married. That's about the salary of a police officer and a nurse. And they will be given first priority for whatever funding is appropriated by the legislature and the governor when this is enacted. If all of the money is taken by families that earn 400% or less, then there will be none available for anyone whose parents or parents earn more than that. Another new section and that is on pages 15 and 16. The next section is a cap and that is new and that came as a result of our conversations with members in this body. And of course any member of this body was more than welcome to give suggestions but those who did, this is one of them. And on page 20, there's a cap because I've heard this could be the most expensive program. It could be billions of dollars. Well the cap does give you some certainty. It could be as little as zero because it's only subject to appropriations. It's not a tax credit. Or it could be as much as 140 million, which would be the equivalent of 1%. And the QBE references for purposes of having a benchmark. On page 20, you'll see that the number remains the same. 6500 for qualified education up to 6500. If a parent utilizes 2,000, that would be the max if they could show qualified and approved receipts to the new authority that will be responsible for monitoring this. The number was arrived at by looking at QBE as a benchmark and coming up with an average excluding special needs increments which would have added a lot of money to the base amount and taking away other types of grants. We used the average because what the concern with the state is that this is state funds only not local funds is that overall these students on average do not cost the state more than what we are spending for a student to attend a traditional public school. The funds will be will be placed as I mentioned in a promise scholarship account and they are not directly provided to the parent. They are they have to provide receipts before they receive reimbursement. I just want to make it clear that the funds for promise scholarships must be appropriated yearly. I always looked at as there was a yearly sunset we had to decide every single year. Are we going to appropriate for this again and it comes out of the general budget just as the funding I mentioned for students attending private schools that are enrolled in dual enrollment that the state in total pays 9,000,000 dollars. I would like to thank the students for the support and the support that they have for the college. In 2023 last year the house version added yearly required norm reference testing or statewide testing in the aggregate to protect privacy. This will then also be reported to the legislature so that we can know in general how the students are done. I will mention this is the first time. We have ever required testing for the purpose of providing options for students who want to attend a private institution. We don't require that for public students who are in high school and attend dual enrollment at a private school. Private college for dual enrollment we don't require it for students who are private schools who are in high school and the state pays for their dual enrollment. We trust the parents in those cases and do not require the testing but we have added that at the suggestion of a number of you last year. I will mention something that is new on page 28. There is language on line 689 that makes it clear that there is hold harmless language in here as it relates to the program FTE accounts for local school systems and specifically with regard to if a child leaves a public school and attends a private school. This will be a two year lag to help the school system with their planning. New section is on line 705 to 807 and this last this added section puts into law all cumulative teacher pay raises since 2019 that were initiated by Governor Kim and equals $6,500. As you all remember those of you who have been here you have voted on the budget to have 9,500 in a cumulative teacher raises excluding the $2,000 in bonuses that we have awarded teachers over this time period. But since 2019 we haven't put the pay raises as we are required to do into state law. This is very important that we do that this year because we're allowed by law to be out of kilter about 1.5% for each weight. The weight would be for example a kindergarten student which has a lower class size. The ones that we are particularly out of sync with are the five special ed categories gifted in ESOL. So this brings them back into compliance going forward and it is very important that we do that this year. There is another new section on pages 34 and 35 and this is a provision as result of the working group that was a priority of the speaker for us to evaluate make recommendations for pre-K. All the other recommendations are budgetary and do not require legislation but one that requires legislation would provide public schools with the ability to utilize state capital construction funds. Should they add pre-K classrooms should they repurpose or renovate classrooms for pre-K. And we certainly want to increase the availability of pre-K because the state has 15% fewer children in pre-K over the last 12 years. And that is in part because we need to fund more. In addition thank you to representatives Tyler Smalls Paul Smith, Dubnec and also Senator Still on pages 34 and 35. We are changing what is in code regarding inter system student transfers. Not in trough but say from one county school system or city school system to another school system. Currently in law the state school board has the ultimate authority to deny a student being able to go from one school system to another and take their QBE with them if they still continue to live as a resident in the other school system. This changes that and the decision maker will be solely the parent and the receiving school system. The sending school system would have no say so and neither would the state board. Additionally we added a section on lines 833 to 835 that sets a maximum cap that a school system may charge for tuition. Should they choose to offer this choice to students who live outside their school system and that would be they cannot charge more than the school system currently raises and distributes to the school systems what we commonly refer to as their local share. They can't charge more than what they're paying to support the students that live there. So that is a public school choice provision that is in the bill. Another new section on let's see a page is 35 to 39. This is a current program that we're enhancing and modifying. It's referred to as the Georgia Foundation for Public Education Tax Credit. Most of you here if you've been here a few years have voted for this before I call it the Brooks Coleman Tax Credit. It was very important to him to that we have as we were doing these other tax credits like the rural hospital tax credit. I think we now have the foster care one and the SSO Education Tax Credit. He wanted one for public schools. So it's been in code for a few years. It's not fully utilized up to the current $5 million that's allowed because it only currently allows individuals to contribute up to $2,500 and then take a dollar for dollar tax credit off their state income tax. What this does is it adds S-corp's that might be more inclined to contribute and so I feel sure that that $5 million will be fully utilized and distributed. What changes in the bill is we're tripling the amount of money. It's going from $5 million to $15 million and the additional $10 million will be reserved to only be used and distributed to schools that are deemed by the school. Deemed by the DOE as performing in the lowest 25% the very schools with which we are discussing today. So that is a new tax credit that will be reserved for them and them only and the other $5 million will be reserved for schools performing in the top 75%. And finally, the last major change is that that pertains to the Georgia Promise Scholarship is it will have a sunset. Now me personally, I thought it had a sunset already. It was called the appropriations process. But to give better definition to make sure that you know the Georgia legislature, Georgia General Assembly would have to renew this. It has a sunset now that would end 10 years after it commences. And if I didn't point out the authority and the scholarships will not be awarded for over a school year. So not this upcoming school year. It won't be until the 25-26 school year to give time for it to get set up fully vetted and be put in place. And so 10 years after that, or June 30th of 2035, this act, the portion only pertaining to the Promise Scholarship, the other provisions will remain. That will expire with the exception that students that have already enrolled in a private school and are receiving the voucher will continue to receive the voucher until they return back to a public school, graduate, or leave the education system. And with that, Mr. Speaker, I'll take a few questions. That is the bill. Lady Yulfe, for a couple of questions, representative Parsons to your left. Has a question? Yes, sir. Thanks, Speaker. The lady Yulfe. I certainly do. All right. Madam Proton, I wanted to ask you. I have some, I guess, questions. If I could ask you just a couple of questions about the failing schools. A lot of this is based on failing schools and students from those schools being able to take advantage of getting the $6,500, their parents getting $6,500 to go to a private school. Do you think, well, let me ask you, on these private schools, or on these, what we call the failing schools, are those failing schools as a grade just based on tests that are giving on what has been won. What has been learned at the school? Is it based on any kind of behavior problems there? It's based on a number of different factors that are determined by DOE, including school climate, safety, test scores. It's many, many different items, but you know, we, it's hard. The DOE is currently changing that. It's changed a number of times, but it is based on a number of different factors. We do know though that if in the, you know, the way one typically determines what is a failing school meeting, do your students, you know, can they read in third grade, can they, you know, read in eighth grade. We know that about half of the schools in Georgia could be deemed failing based on the reading scores, but that is not how these would be determined. They would be determined by a variety of factors that DOE puts together. And it's available on their website. I do. My question is, well, these failing schools, and I'm asking you what you believe on this or what you think. Do you believe in these failing schools that the administration there and the teachers have just thrown their hands up and say, we're not going to do anything else, or do you think that maybe in those schools, even though they're listed as failing because of many problems there that you alluded to, that it could be that a child could actually get an adequate to excellent education. There at that same school, if they had to print.\n\ninvolvement and the ambition to actually get an education there. You know, I, I, I, that is an innouable for me to know if which I'm sure it varies by school and by, by, by child. What I know is that if this is one way for us to narrow up the program so that Georgia can try another way of providing students with other educational choices. And to me, ultimately, I don't know the answer to that. I think it's unknowable when we're dealing with so many different schools and students. What I do know is that who, um, who is affected most? And it is certainly not the school. It's not an administrator. It's the parent and the child that will live with the outcomes. And if that parent in that school feels that their child would be better served in another, then I'm all forgiving them that option. Thank you, Madam Protin. I know you've worked very hard on this and I appreciate your work. Thank you. Thank you. Lady Yield. Yes, yes, your place. Oh, for, let's see. Recognize Chairman Hatchett to your right for a question. Thank you, Mr. Speaker. It is the Speaker Protin. You. I do. Thank you. Is it not true that if future budget cuts are enacted for public education, that equivalent cuts will be applied to the school choice scholarship? That is true. And that was very important to me and those of you who served during the great recession when we saw that we had to make cuts upon cuts throughout the entire budget. And this assures through a formula that Todd Jones helped me come up with that as QBE grows, the amount could grow, but as QBE so that it remains dynamic and doesn't become obsolete. But most importantly, if we ever have cuts, which we have fully funded QBE now for a number of years now, but if we ever reduce that amount that the per student maximum 6,500 would also go down and commence her amount. Lady has a couple more of she'll take them. I'll take one more, Mr. Speaker. And then I'm welcome others who want to speak on this. To your left, Representative Hilton has a question. Okay. Thank you, Mr. Speaker. Does General Hadeal? I do. Thank you, Madam Protin, for that great presentation. Read the Minority Report. It reads, this program would place a financial burden on school budgets. Is it not true that we have fully funded QBE six of the last seven years, increased teacher paid, the highest in the southeast? And we as a body have put more dollars than ever toward public education. Is it not further true that a child and a family taking advantage of this program would actually leave the local school in a better financial position because that school would be able to keep the federal and local dollars leaving that school and their budget in a better position than they were before this program. Well, I think generally speaking the answer is yes. And we were very careful. It is state funding only that a school system would no longer receive for services no longer rendered. But they would continue to keep their local funding that they could spread across theoretically fewer students, depending on how many students left that was true. Is it generally forward for the year? Yes. It also references unaccountable private schools. Is it not true that since 2019 we have spent billions of dollars on public education, but we have not produced a single score CCRPI to measure those results? Well, I know that that is definitely an interest of yours to make it easier for parents to be able to evaluate their schools. I think transparency is always a good thing, but I just want to make clear before I sit down, and I'll leave it to others, that this body has a strong record of supporting public education. I'm very proud of that. And it's not just teacher raises. It's been literacy efforts and counselors and public safety grants and a vast array of initiatives that Brooks Coleman and then Matt Dubnick and then Chairman Jasperson now Chairman Irwin truly have devoted time, energy and effort along with you to support our public schools. Offering educational choices is a compliment to all the efforts we've done to public schools and to give public education students the best resources we can. But one size, as we've discussed many times from this well, others that other than me, one size does not always fit all. And this is designed in a very narrow, measured, accountable, and careful way. We'll give some students, some additional students in Georgia, some further options that might best fit their family. And I would encourage you to give it every consideration and all the measures that we put in to make it a stronger bill. With that, Mr. Speaker, I will yield the well. Thank you. Ladies, yielded the well. Okay, members, we have members that want to speak, they're opposed and those that want to speak, they're in favor. So we're going to give both sides 30 minutes to make their points. We'll begin with those opposed representative Paris is recognized and speak to the bill. After representing Paris and will be representing Becky Evans will be second. Now this time, representative will be allocated to the members as how you present. So I'll let you members make a determination how you allocate your time representing Paris. Thank you, Mr. Speaker. Members of the House, here we are again with the voucher bill. You know, I thought about a couple of things last night when I thought how I'm going to address this without being redundant. It's like we all have the same ideas about it that we had last year. Vouchers don't work. They don't work for poor people. They don't work for underserved. They don't work for Title I schools. They only work for a certain few. And generally, those few don't need the help. They are not the answer to our education woes. With the state of Georgia ranking and the lowest percentile of education in the nation, our focus as a governing body should be to strengthen public schools where approximately 90% of Georgia students attend. Vouchers simply put our defunding of public education, which is the very bedrock of civilization and democracy. If the goal is to provide equal opportunity to all students, vouchers still once again do not answer the call. We have curriculum problems. We have the zip code problem. Those are the things that we need to be attentive to. Those are the things that we should be fixing. Not cherry picking students from public school to go to private schools. And that's pretty much what we have here with this bill. I thought about makeup. That's something I know a little bit about. There's organic versus toxic drug store versus department store. And then there's the various types of makeup. Foundation, blush, concealer, mascara, eyeliner. And then there's lipstick. It matters not how many enticing lines or sections. We've added to Senate Bill 233. It still and remains a tool to defund public education. It is still a pig with lipstick. It is not only a pig with lipstick, ladies and gentlemen. It is a pig with lipstick, mascara, foundation, blush, and all of the rest. I think that this house doesn't need a big lecture on it. And I think that we can do better. I think that we all should pull together the resources that we use to make Georgia the number one state to do business. We should make it the state, the number one state for education. Ladies and gentlemen, I urge you to vote no on SB 233. Thank you, Mr. Speaker. I yield a well. Ladies yielded a well. Representative Becky Evans has recognized speak to the bill. Representative Evans. Thank you, Mr. Speaker. Colleagues, today I rise to my opposition to Senate Bill 233. And I just wanted to talk a little bit about the funding part. And today we heard from the general lady from the 47th, the example of how state funds are used for private schools like pre-K and childcare and private colleges. But I do just ask us to all remember that we do have in our constitution an obligation for the provision of an adequate public education for the citizens. She'll be a primary obligation of the state of Georgia. Public education for the citizens prior to college or post-secondary shall be free and provided for with taxation. So that is an obligation in our state constitution. And I wanted to also talk about choice. We have worked so hard in our public schools to provide choice. We have magnet schools, theme schools, charter schools. We've now passed the completion schools. So I'm proud of all the work we've done to provide choice in our public schools. And we do not need choice for private schools. And I am very grateful that we are fully funding QBE, Quality Basic Education Act for six of seven years. But I says my question to my colleagues, do you truly believe, are you hearing from your families that their schools are totally and completely adequately funded? I am not hearing that. I am hearing that we need to do more for our school counselors. I saw Scott, we need to increase the ratio for school counselors, school psychologists, school social workers. We need to do more to provide for funding for our literacy. And there are many ways that we, that are, and of course we know we're the one of the six states that doesn't fund for poverty in our schools. So I would argue that that QBE is not fully funding our schools. So yes, we're fully funding QBE, but we are not fully funding our private schools. And the other thing I would say is if you want to argue, yes, we're fully funding schools, I would just like to say there are other ways we could use dollars, 140 million to help our parents. This is about a parent choice bill. You know what I'm hearing about what parents need? They want after school care, they want summer enrichment, and they need help with child care. So let's invest this 140 million in those programs to help our working parents not in this money for private school vouchers. Thank you, Mr. Speaker. I yield the well. Ladies yielded well. Representative Howard, Representative Carlton Howard has recognized to speak to the bill. Representative Howard. Thank you, Mr. Speaker. Well, I stood here last year about the same time for the same purpose. And that is the opposed this Senate bill 233. Clearly, it's a bad bill. It's simply a bad bill. And I know that it has good intentions. I know that the folk that authored the bill, I know your hardest in the right place, but I think we're taking the wrong method to do this. In this idea of providing families with more options for their children's education, it may seem appealing on the surface, but this bill ultimately what it does is perpetuates inequality in our educational system. And frankly, I'm not swayed by the promise of teacher pay raises or kindergarten improvements. If it comes at the cost of defunding our public schools, why don't we instead invest in our public school education system supporting policies that promote equality, equity, and fairness for all students. It is clear who this bill serves. It serves the wealthy. We all know that school vouchers primarily benefit families who can afford to supplement the voucher with their additional funds, leaving lower income families at a disadvantage. This does is create that a halves and have not system. A two-tiered system where wealthier families are able to access better education opportunities while those who are already marginalized are left with fewer options as a matter of fact, they are only left with one option. It is leaving the least and the less behind to fend for themselves. It's not a myth. It's clearly diverting public funds toward private schools through vouchers, taking resources away from our already underfunded public schools. This aggravates the achievement gap and furtherwise the disparity between schools in the affluent neighborhoods and those in low-income communities where I come from. These disparities are too numerous to list, but just one of those is that the advantages that we're giving private schools is they will receive taxpayer funds but can refuse a student's access without any qualifications. Public schools cannot do that. So instead of supporting policies that increase disparities in our educational system, we ought to be investing in our public schools, putting this voucher energy and resources that I have seen for the last two sessions, ensuring that every student has access to a higher quality education. Regardless of their socio-economic status, I urge my fellow legislators to reject Senate Bill 233 and prioritize equity and fairness in our educational policies. We talk about evidence-based policies and bills. Where is the evidence that this will work? I close with Proverbs 22-16. It says, oppressing the poor in order to enrich oneself and giving to the rich will lead only to loss. We must not allow these policies that benefit the wealth at the expense of the poor to stand. I urge all of us to vote no on Senate Bill 233. Thank you, Mr. Speaker. Are you back to well? Thank you, Representative. Representative Lisa Campbell is recognized to speak to the bill. Representative Campbell. Thank you, Mr. Speaker. Colleagues, today I rise to ask you to join me, but not just me, the vast majority of everyday Georgians in opposing vouchers again this year. And I just want to say that all of those, all of us who choose to vote no today, will not be aligning with a specific party in this body. Voting no means you will be aligning with the majority of our constituents. Constituents who pull both Democratic and Republic ballots. Voting no today aligns us with our families back home, who do not wish to send their public tax dollars to unaccountable, unknown, and unproven private schools. It's not just my opinion, a recent AJC poll nearly two thirds of Georgia voters said they oppose vouchers. 60% said they opposed, while only 35% said they approve. The majority of our constituents in every county in this state do not approve of this bill. But voting no today is not an active opposition. It's actually a positive affirmative constructive choice to be an active part of our solution, not a passive bystander, ignoring the problems of declining student outcomes. I think writing checks to private schools is the easiest way out. A path that not only lacks creativity and strategic vision, I think it lacks legislative courage. Let's not wash our hands of our duty to provide leadership needed to deliver adequate public free education. That's what it says in our Constitution. Instead, let us confidently choose evidence-based research, input from our trusted educational leaders in the classrooms. Let's get serious about the causes of the academic declines that we all agree are happening. And let's instead spend time, money, and energy on solutions that impact every single one of our students, not just some. You know, we could be taking meaningful action to make all of Georgia's public schools the best in the nation by investing, not defining them, strengthening them, not abandoning them, and working to solve problems, not shirking our duty. We could come together for all of our kids, not just the lucky few, and make up the gap between the $6,500 and the average cost that is more than double that in private schools. So what could we be doing to invest and deliver $120 million? And that equates to 2.000 million annually for each one of the possible 42 school districts in the bottom 25% losing $2.8 million. Instead of writing checks to private schools, we could invest $120 million in child care and early learning. Tons of evidence here. It's the least expensive and the best return our investment for lifetime. And studies show that this investment has at least a four to nine times return on investment per dollar that not only benefits the health and the education of young children, but their lives in the future. We could also be investing $120 million in innovative curriculum. We've said literacy is important, but we've not allocated a single dollar to literacy curriculum. What if we had invested $6,500 for every student for literacy curriculum? We could finally address poverty and its direct and proven correlation with performance. What if we took that $6,500 and applied it to those students in the bottom 25% of schools? And finally, teachers. If we really want to invest in improving outcomes, we could take that $120 million. It's enough to pay the salaries for $2,200 new trained qualified teachers. And guess what? We could also retain the teachers that we've got. This is not only the wise investment. It is the moral and right thing to do. And I just want to read, again, our constitutional duty is the provision that an adequate public education for the citizens shall be the primary obligation, the primary obligation for free. It does not say complimentary, it does not say additional services, it does not say choices. It says, public, adequate, education, that is free for every one of our students. And I hope for these reasons you will affirm that the better investment is to come together and improve all public schools, not destroy them with this bill. And I encourage you to vote no on SB 233. Thank you and I yield the well. Ladies yielded the will. Representative Audenio, he waives. Representative Carter, Representative During Carter has recognized, speak to the will. Good afternoon and thank you Speaker for the opportunity to share. I always start with the question, how do we get here? austerity cuts, bad policy, and politics. How did Georgia become the number one state to do business? Or how did Georgia become the Hollywood of the South? There were intentional investments and strategic planning to ensure that we invested in our priority. We said children or our future. Children education is important. So why aren't we taking the same level of strategy and investment in education in Georgia the way we do to ensure that we are the number one state to do business? But we don't. Year after year we come, you've come before I was here and we've intentionally cut through austerity cuts, bad policies that continues to defund public education. And the question is, y'all why? Why? So what if the education committee took some time when we're not in session and we all come to the table and consider what would it take for Georgia to be number one in education? But we don't. Instead there are some folks that have some meetings when we're not in session. Then they hold their legislation to kind of like the last time part of year, like what we're doing right now. And the education committee gets an omnibus bill a couple of hours before a committee. No time to really read it instead of yet. But their strategy, bring on a big guns into the room. Listen intimidate some folks. That's not about educating children. You know last year the conversation was, hey it's not going to cut education budget because it's an appropriation. We got a lesson on appropriation. But this year we did add a little piece that we're going to set aside out of QBE. There hasn't been amended. But yes, we funded it over the last few years. But doesn't equate to the 10.2 billion of austerity cuts over the last decade or so. Again, how do we get here? Some of it was austerity cuts. But a lot of it has been bad policy. And a lot of it is politics. Y'all, let's lay the politics on the table. Let's vote no on this current version of SB 233. The items that were added to last year's bill is only to get some of y'all to say yes, but there are things that we've already taken care of. It was something you could do outside of this bill. Don't make Georgia's children continue to suffer and make Georgia a laughing stock when it comes to education. But we're the number one place to do business. And y'all, we are Hollywood, other South. Can you imagine Georgia being the number one place when it comes to public education? And the only way that's going to happen is us working together. Provide appropriate funding. Update QBE. Reverse some of the bad policy. And none of that will happen if we don't sit down at the table together. Speaker, I yield or will. I'm voting no. I hope you'll vote no. And then let's come together and really come up with some good policy for education in Georgia. Thank you. And lady, as you're the well, we have one final speaker. I represent Vance Smith has recognized the speak to the bill. We're going to dismiss. Thank you, miss Speaker. Ladies and gentlemen, you don't see me down here too much in the well. I guess I could say today I personally have some concerns. I just have some concerns. I've lived with a great lady over 50 years. Michelle and a lot of y'all know Michelle. She was a school teacher retired from being a school teacher. I stopped by there a lot of times when she was teaching that class, pulling those five or six students out EIP, early intervention program, trying to help them reading in math. She'd always make me read them a story. I don't know if they learn much from that, but this whole issue of education and I'm not an educator but she is. It just concerns me and a couple of concerns are this. I arrived in this house, honored to be here and swung in in 1993. I think there are some of us that in this house today, they're a handful of us, I guess, that got here in 1993. I know Carolyn and I got here, but excuse me, Representative Parish was here. A lot of good people. I was here about 17 years, left the 10, came back about six years ago, honored to be here. Representative Parish State, Harris County, my home county, got a little bit of Muscogee, a good portion of truth, Lagrange, some good folks down there along the river on the Chattahoochee. We live on the Chattahoochee river. And we're proud of it. Since that year in 1993 and we started going through the budget process, I want to say back then, and I could Google it, or y'all can, probably faster than I can. I'm going to say the budget was probably around $7 billion. Right now, we're looking 36 billion. It's grown. Georgia's grown.\n\nIndustry is grown. Number of people in our state, what do we bump in 11 million? That's great. People come over here y'all when it was the tough times, 9, 10, 11, and 12. They came to Georgia because they saw an opportunity. I just visioned people coming here looking for jobs. They met some people maybe in this room and then our communities. They saw the coast, they saw the mountains, they saw south Georgia. They went back home and they told their spouse, pack up the children, we're going to Georgia. And the spouse said, oh, you found a job. Well, no, I didn't find a job. But let me tell you, there's some opportunities in the state of Georgia. And they came and we grew. I don't think we ever took a deal during that 9, 10, and 11, 12 when things were tough. Y'all know how tough they were. Your constituents know how tough they were. Educating our children and we had, fortunately, thank you Lord, we had three. Three good children. They've grown up. We've got eight grand size. They go from about nine months to one's fixing to be 20 years old in July. And you know, I think about this, school choice. Michelle and I, older sons, 47. Michelle and I about 40 years ago, we used the option of school choice. We put our older son in the private school. Next child came along, private school. Third child came along, private school. Michelle started back working. I was working. We made the choice of where to send our children. We paid our county tax. We paid the tuition to go to these private schools. There was a point there that a couple of our children went to the middle school in Harris County. But when he got to high school, we sent him to a private Catholic high school. We made the choice again. We kept working. Paid that tuition and I admit to you, that tuition back then won as high as it is now. But we worked. It was tough. They got a good education. They grew up and got great jobs. I'm just wondering and I just think with me a minute, I'm just thinking out loud here, I guess. If we've spent since 93 when I first came, in the general proximity of around 50 percent, sometimes lower, sometimes higher, of our budget on education. And we're at this point 31 years later, and I've only been here 23, my 23rd session. If we're spending that much on education and then we're taking this program to help families and children education, are we performing the teaching of our children correctly? Is there something that needs to be tweaked at the Department of Education with our State School Board, our State School Superintendent, our local school board, our local school superintendent? We teach in what we need to be teaching to reach our children. And that concerns me. That's a concern of mine. A big concern of mine. Personally, I think we need to dig deep. I think we need to look at that. I think possibly we should have already looked at it, but no better time than the present. I think we need to look at it. And look, I hope that I'm friends of all of you. I'm not trying to make an animal of all of you. I love this family. It's great, this great institution. I've got people to friends of mine that will hear years ago and still talk to them. I'm honored to come back. But I just think we need to slow down a minute. Let's don't come up with some program or a way to do something better. Let's look into the education program and see if we're doing it right. I think we owe that to the students of today and the future students that come to this state of Georgia to do that. One other thing, I know sometimes running short. So you take a county like Harris County. You got a low performance school, there are Title I school. And so some of the kids, their parents, okay, they can take their children and they can go somewhere else. They've got the means to do that. You got to drive pretty good ways. Harris County is a big land county, big county land-wise. A few families go north, few families go south. And one of the dust settles, you still got children in the classroom. We've got children in Harris County that live with the grandma. They live with our aunt. What are we doing for those children that are left in the classroom? Are we raising that level education for those children? Could we go into the Department of Education statewide and locally and get our program going so that we just raise the level education for all students right now? Or do we give this option for some to leave? I can't give you the answer, but I can just give you the thoughts and the concerns that I have. I wish I knew that. Be honest with you. I know this is our responsibility. We're standing here in the people's house and we make decisions that affect some 60,000 people in each one of our districts. That's us. And ladies and gentlemen, whether it's this issue, whether it's a transportation issue, which I'm passionate about, your vote in your district. And Mr. Spreaker, I appreciate the few minutes to make some comments. Thank you very much. Mr. Chairman, she ordered the well. That completes the members who wanted to speak in opposition to bill. Now we'll hear from members in favor of the bill up to 30 minutes. Allow the members to, um, divided that time according to their comments. Represent Maynard has recognized, speak to the bill, represent the mission Maynard. Thank you, Mr. Speaker. I do have some prepared statements, but I want to just start by saying, um, what is the Democrat battle cry? The Democrat battle cry is do this instead. We admit there's a problem. We admit that the schools are failing. We admit that the children are not learning. We admit all of those things, but let's not give them a choice. Let's also not give them a choice because the kids that whose parents have the ability to go to another school through this program, that is unfair to the kids that stay. But we've already, they've already said, but there's a problem. So instead of helping some, let's not help any. Fact check. The bill is 38 pages. This is campaign season. People are going to use this bill on the campaign season. And I switched parties because I do not agree with lying to people. And so this is what I want to tell you on page 19. When people in my district asked me, well, what about this? They said that the school choice bill discriminates. I'm going to say, look on, look at line 454. You can't discriminate. They're going to ask me another question. Well, it's about the wealthy. This bill is for the wealthy. I'm going to say, look at page 21. You are not going to believe this. But on line 502, it says it's not for the wealthy. It's for family incomes that exceed 400% of the federal poverty level. You can't lie about that. These are the words that are on the paper. The other thing that they're going to say, this is just so people in higher performing areas can go to better schools, private schools in their already higher performing areas. I'm going to say, look at page 27. Because on line 667, it says it's only for the lowest 25% of all public schools. And then I'm going to go a step further for the kids that have special needs. I'm going to say, look at page 31 where it adds the weights, increase weights for children with special needs. Then I'm going to say, they're going to say, well, this is going to destroy public schools. I'm going to say, that's not true. That is simply not true. Look at page 39. Look at page 39. Because on page 39, it gives a sunset. Let's give some kids an opportunity. We're not saying it's forever, but for the past 50 years, something has not been going right. Is this the hill you want to die on? For me, this is a hill I refuse to die on. For most Democrats, educational freedom is merely a hill. Democrats are bounded by Georgia's version of the Teachers Union and the donations they promise to them over children. So much so the president of this Teachers Union has decided, she's going to jump into a Senate race because she is determined to tell the Democrats what they must do. And if they don't, she's saying, I'll do it for you. When I was elected in 2020, I came here to serve District 56. I didn't know about anyone else's district except mine. I knew when I was a little girl, I got off at a Marta bus stop. A Marta bus stop where there was a liquor store across the street and there were crackheads at the corner store. I would run home. The reason I was getting off of a Marta bus stop was because my mom sent me to another school outside of my district so I could have a chance. The area I grew up in, it's called the Bluff, Simpson Road, Bankhead Highway. These are areas that I still represent today. This is also an area highly esteemed, higher education institutions for black middle class at one point. Unfortunately, it was devastated by drugs, pimping, and failing schools. In District 56, some of these schools have two to three percent math and reading proficiency. That means 97 to 98 percent of the children in the school cannot read or perform simple math, but yet some of our colleagues want to tell you that is okay. If we can't help 100 percent, we don't care about the two to three percent. We don't want to help anybody. Goldman Sachs did a study. It says 30 million people will lose their jobs in the next 10 years to artificial intelligence. The people that will lose their jobs to artificial intelligence are the people that can't read or perform simple math. So if you can't read, you can't perform simple math. Now you do not have access to 30 million jobs. It might actually be 300 million jobs. What happens when you can't provide for your family? You don't have bread. You don't have electricity. You can't do your homework. You're outside playing because you can't do your homework. You become desperate. And ladies and gentlemen, I'm just trying to tell you that desperate people do desperate things. Let's stop the cycle of desperation. Joshua 2415 says, but if serving the Lord seems undesirable to you, then choose for yourselves this day whom you will serve. But as for me and my household, we will serve the Lord. We are elected to serve Georgians by God's divine will. Everyone in this chamber has a responsibility to provide for the least in our state. Don't say we should do this. We should do this instead. Let's stay focused. We're talking about children that can't read and perform simple math. These are children living in poor communities in rural and urban areas. They are growing up in a cycle of poverty and a cycle of desperation today. You can make a change for them. We can't legislate parenting. Some parents don't do what they should do. But we can legislate choice. We can legislate teacher pay raises. We can legislate increased funding for pre-K programs. SB233 is about parental choice. Teacher pay raises, pre-K funding, tax credits for schools that have children that want to participate in this program. If you vote yes for 233, you codify into law the pay raises for the teachers. If you vote no on SB233, the teachers in your district may return the favor. If you don't value them, they may not value you. If you feel so strongly about only one portion of this bill, are you willing to abandon the teacher pay raises? Because of one portion. Under leadership, we have given a thousand dollar teacher bonus last year, a thousand dollar teacher bonus this year. And now Georgia leads because of us increasing teacher pay raises. We are now the highest, we are now Georgia is now the state, the leading state in the southeast that pays teachers the highest amount. We have given them a 95 hundred pay raise. I want to end with something and it's Matthew 7 non-versus. Matthew 7 chapters versus Matthew 7 non-3 11. It says, which of you if your son asks for bread will give him a stone? Or if he asks for a fish, will give him a snake? If you want to know how to give good gifts to your children, how much more will your father in heaven give good gifts to those who ask him? This is a hill I decided I am not going to die on. I switched parties because children in my district deserve better. Children in my district do not care about the teacher pay raises. Children in my district do not care about the capital funding for pre-K programs. Parents actually may not even care about their neighbors children, but they do care about their own children. And for that I say vote yes for SB 233 because parents in these desperate situations want you to. I yield the well. Ladies yielded the well. Representative Scott Hilton has recognized to speak to the bill. Representative Hilton. Thank you Mr. Speaker. I'm going to keep my comments short because I know I stand between you and launch and a vote on here. Thank you Mr. Speaker. I rise in full support of Senate Bill 233 which provides a critical lifeline of hope across our state to families who are currently trapped in failing schools. I want to thank first and foremost our governor who has invested his own personal political capital into getting this done. A governor who according to a recent CBS poll has broad support amongst Republicans but even has 55% support amongst Democrats in our state. I want to thank Lieutenant Governor but most importantly I want to thank Mr. Speaker you who attended our education committee sat next to us yesterday to help shepherd this measure through. You know we're told while we're down here not to take wins and losses too seriously and for the most part I've tried my best to do that but last year when we voted on this bill and it unfortunately did not cross and we had a portion of our body stand and cheer when a very measured laser focused lifeline to students failed that was very disappointing and I want to applaud the Speaker Pro Tem and all those who did not vote yes on it for the work they've done over the last 12 months to get us here to even further improve the bill. This bill has more guardrails and I can ever imagine it is capped at 1% of QBE. It has an annual, it has a 10 year sunset but as the Speaker Pro Tem mentioned it really has an annual sunset as the funds have to be appropriated every single year for this to be an existence. If we cut QBE you've got to cut this program proportionally. So again so many guardrails to protect against a lot of the concerns that have been mentioned here but the end of the day this is a public education bill that just so happens to have a savings account attached to it. By voting yes on this bill you are voting yes to codify a increase to teach your pay. By voting yes on this bill you're voting for pre-K funding. By voting yes on this bill you are increasing the tax credit that goes to our public schools. This is a public education bill that just so happens to have an education savings account attached to it. There's a lot of talk about accountability and transparency. As I mentioned in my inquiry to the Speaker Pro Tem I was surprised to learn that since 2019 we have not produced school performance ratings for our public schools. Yet at the same time every year we spend billions and billions of dollars while flying blind not knowing how that money is performing and how the results are coming forward. Now fortunately this year we have finally gotten back to that. We'll be producing five performance scores for every single school in the state and I'm working on legislation to help consolidate and make that more efficient for parents but we need transparency on both sides and I think this is what this bill accomplished. I've never had a constituent come to me and say Scott you know what I've got too many choices in education. I wish you'd please pair them back. In fact it's the opposite. I have parents coming to me to say every single one of my kids is different. They learn different, they hate different, grow different. This is an easy bill to vote for because you can go back to your constituents and say listen instead of giving you less options I've given you more and I've invested in public education in our state students and I've given them a lifeline so this time I want us together to stand up and cheer because we've given hope to kids who are trapped and let's we don't have another year. We don't have another year to leave here because what's going to happen next August those same kids are going to attend those same failing schools and so I urge you to vote in favor of Senate Bill 233. Thank you Mr. Speaker. General Maggio to the well representing Vrees is recognized speak to the bill representing Vrees. Thank you Mr. Speaker a few additional points in support of this family empowerment scholarship this opportunity scholarship and my Gwyneth County School some of the things that I've heard that are on the top of their list consistently are teacher pay. I checked with the appropriations chairman since governor camp has become governor nearly $10,000 a year increase in teacher pay has occurred transportation funding that's pretty much number one on the list in my big county with 200,000 students and and a lot of geography they've asked for transportation funding and the chairman informs me around $200 million has been added on that pre K pre K you heard the speaker pro tem say what is in this bill which is now a 39 page bill rather than a 10 page bill pre K is in this bill and I know that many folks here in this body have worked on pre K this year and this is this bill is part of improving pre K money as well as programs in Georgia and then number four my local schools have asked for education splosts repair and maintenance flexibility speaker pro tem education chair representative Townsend representative Franklin introduced me to his senator who's working on that that effort is underway those are going to be tangible public school benefits this bill that's before us today some of y'all who voted know on this last year you got this quality spectacular 39 page bill in front of you which is primarily a public school benefits bill with pre K those kids they need to learn to read so they can read to learn and this bill delivers on pre K additionally public school scholarships the chair in which I sit now was filled faithfully for decades by Brooks Coleman the peach scholarship the public school scholarship is being tripled under this bill and and S corpse can now give under this bill and that money will go to public schools who were innovating and have bright ideas to improve public schools the senate is watching the vote in addition to the governor and the speaker and this is a good public school bill that you could vote on with them watching changes scary in education but the same whole thing can also be scary in education it ought to be I've asked the chairman on education how many schools is a quarter of our schools it's there are 582 schools in Georgia that are currently on the list of the bottom quarter schools 582 schools we've got to change we've got to make a change zero of those schools are in my district and many folks in here you have zero schools in your district but your homeowners are paying for that year after year after year we owe it to all the folks in Georgia to do something that will do some good this year two things to to conclude on I read an article since our vote on this last year about justice so to my or on the US Supreme Court she grew up in New York City she was in an immigrant family in a in a neighborhood that had difficult schools she had a health issue that her single working mom took her to the doctor for and that doctor saw that the justice future justice was an exceptional student the doctor died and left her a bequest and her single mom took that money from the doctor along with her savings from work and sent her to a local Catholic school in New York City and now she's on the US Supreme Court there are many stories like that and then my own mom and your own mothers they know best what is good for their kids my mother is now in heaven but one thing she did right in life is she fought for my education every day growing up those moms those grandmoms they know what's best for their kids this bill empowers them and it gives them funds to do what's in the best interest of their kids and I hope you'll support it this year thank you gentlemen's here to the well representative will wait governor's floor leader is recognized speak to the bill representative Wade good day colleagues happy pie day 3.14 I know my dad who I celebrated his life when he went to be in heaven three years ago today actually and I was one of his favorite days as a math teacher I'm a son of two public school educators I have two children in public schools my wife is a public school teacher and now she's an administrator to high school in my district I want you to hear me as a person and a colleague that loves each and every one of you and I love all children no matter what zip code they're from I am voting yes on Senate bill 233 as a former school board member who is an advocate and a passionate believer in the value of all education including public education but this bill codifies teacher pay raises pre-K investments tax credits to help improve schools especially those lowest performing schools that we are hearing need additional investment and this does not cut any funding from our QBE fund funding formula which I remind you is fully funded within our FY 25 budget governor camp and this house has passed a budget that has increased our funding of schools to a record high of over 13 billion dollars just in the K-12 setting within the enacted amended FY 2024 budget the governor's fiscal year 2025 budget proposal compares as follows I'm a math guy I love the numbers fiscal year 2024 was 12.2 million two billion dollars for public schools fully funded and FY 2025 it now will be an increase of 13.2 to 13.26 over a billion dollar one point over a billion dollars of investment folks that's 8.6 percent year over year increase our student population is not growing 8.6 percent in this state in one year we are investing more dollars than we ever have in Georgia in public education this legislation highlights governor camps and this general assembly's investment in educators parents grandparents families and folks the most important investment our students the students are our primary focus here all students I want the child that is in the most difficult school system to receive the fantastic education that my child receives back home at Blackburn Elementary School every child needs options I believe this is serious I love the comment can we work on this next year there's more to do it's not perfect folks there's not one bill that's ever been passed in my opinion in Georgia that's perfect we're not perfect we are always constantly pursuing the next best policy\n\nOur Education Committee Chairman is dedicated his life to the benefit of students. He has made sure that we are coming up with good policy that we can continue to improve upon next year. I love the idea of making changes to the QBE formula. I'm on record as a former president of the Georgia School Board Association advocating for us to do just that. And I want to be a part of that work. It's a complicated job. I'm ready to roll up my sleeves. We can continue to do so. But we cannot diminish the fact that our governor in this General Assembly has fully funded education and we have increased that investment over 30% in the last four years. It's not just about more money. That's one important component. And lastly, I want to leave you with this. As Governor Kimms said last week, there are no more next years. It's time to send this bill to his desk and send a message to all students that their education is a priority no matter their zip code. Thank you, Speaker. Jim was yielded well. Chairman Ty Jones has recognized the speak to the bill, Representative Jones. Thank you, Mr. Speaker. I'd like to just hit six points. The first one is I'd like to thank my colleague. He was the final individual who spoke opposing the bill. And I want to thank him because he made a point that I think resonates across this entire chamber. And that's this. We have to work together to improve opportunities for the children inside of the state of Georgia. We know more today about neural development than we've ever known in the entire history of our state and frankly of humanity. For us to not take advantage of the things that we have learned and how it is that we can affect students positively, I feel as if we have that moral obligation to do that. And I thank him and I join him in that effort. The second thing I want to mention to you is I was first introduced to choice in the late 1990s, which makes me old, but it was also when we had modems that sounded very different than what we have today. And the reason I mentioned that is it was down with the Florida Virtual School. They were putting in a public virtual school for the very first time in the history of the country. And the whole idea of it was to serve the underserved. And I thought they were going to be putting it into the Miami-Dade area, the Florida, the Tampa area. When in fact, they were putting it into the agricultural belt. And that showed that there was a need that they needed to target and they were able to hit that need through basically virtual education. And we have that type of choice within this bill. Third, want to make sure that there is a little bit of intellectual honesty and integrity brought into the chamber when we talk about polling. I think polling has a way and we know this as being part of a political body of basically being able to get the quote answer that you want. But I think historically we have seen over the last one year, two years, five years that this issue has strong bipartisan support, strong bipartisan support. And I'm not talking 52, 48. I'm talking 60, 40 in the areas that you don't necessarily expect it to be that high. We have areas where we have strong bipartisan, I'll say citizenship. And those areas may be traditionally politically 55, 45, but they're polling on this 62, 38. I think it's important to note that. There's been comments made in the well around the austerity cuts. And I think it's important that we highlight just two things. There is no doubt that we had the challenge during the Great Recession every state faced that challenge. But I think it's also important to note that we are one of a very, of a very few number of states that held the AAA bond rating. And thank you to our former appropriations chair and our current appropriations chair. But I think it's also important to note that we absolutely today, our 181 school systems, have more money than the state of Georgia. The reserves of the public school system are a little over six billion. The state of Georgia has just under five billion. Over the 24th largest economy in the world, 8th largest economy in this country, and yet they have more. And that's okay. I'm not criticizing that. But to suggest there is not available cash to make targeted investments is intellectually dishonest. And then finally, I'd like to note this. In the state of Florida, we have seen choice for over 20 years. When they first implemented, they were in the bottom 10. Today they're in the top 10. Their public school systems are thriving. I would suggest to you choice has been really implemented by less than 1% of that population. And we expect it to be the same down there and most likely here in the state of Georgia. I ask you to think about this. My last comment, my public school mentor, and I've been within the public school system working as an advisor for a couple of decades. She said to me back in 2000, she said, place the child at the center of every education decision we make. And I guarantee you, we will make the right decision for that child and for every family in the state of Georgia. Thank you so much, Mr. Speaker. Gentlemen, you are the well. That completes those speaking opposed and in favor. He has been objection to the previous question being ordered. Chair, here's another previous question is ordered. Okay, here's our posture now. Members, we'll have up to 20 minutes for a minority report. Up to 20 minutes for the chair's time. And no matter what the outcome, then we're going to stand in recess and get some lunch and come back and hear from a few members and take up a couple of other important pieces of legislation. So for planning purposes, that's what we'll do. This time I'm going to represent Rep. Draper for up to 20 minutes for the minority report. Rep. Draper. Thank you, Mr. Speaker. I rise today in opposition to SB233. I believe in our public schools. I believe in our public schools. My children attend public schools. My oldest is in the third grade. My daughter, she's in kindergarten and my youngest son will be starting pre-K next year. And like you, I will do anything I can to see my kids school succeed. And as a parent, I am frequently asked to chip in. Each year on the kids first day of school, I'm asked to donate a huge box of supplies with pencils, erasers, notebooks, all the stuff you need to make that classroom function. My kids school has a wonderful PTA and they raise a lot of money. And that money goes to support many programs at the school and all kinds of school improvements, including physical building improvements. It also goes towards supporting our teachers who I'm sure most of you would agree are not sufficiently compensated for the tremendous work that they do. So in my neighborhood school, there is a lot of effort made to fill what I see as a coverage gap, a significant gap between what the school needs and what we and what they are currently receiving from us here at the Capitol. And I am so lucky to live in a community that has the resources to cover that gap. But not every community in Georgia can cover that gap. Not every community in Georgia can make up for years of chronic under-investment by this body. And not every community in Georgia can make up for where we have fallen short. And I have to tell you, it has been disconcerting to hear today how much emphasis members of the majority party have put on the fact that our education formula has been fully funded over the past several years. Because any parent navigating our public school system can clearly see that fully funded does not equal sufficiently funded. If that were true, they wouldn't be asking me to donate school supplies. Teachers wouldn't be digging into their own pockets. Fully funded does not equal sufficiently funded. And I see that very clearly every single day. So that got me wondering how many members of our body have little ones in the public school system. And you might have seen me this morning walking around, I was taking a quick poll of our members and my numbers probably aren't perfect. But as far as I can tell, of our 180 members in this body, 180 members, about 14 of us currently have children in primary school. And of those in primary school, I can confirm that six of us, six of us have children in public school in primary school. But I think that's remarkable. Remarkable. Because as we stand here with the future of public schools in our hands, six of us interact with that system every day. Outside the walls of this building where the dome is literally gilded and gold, 80% of Georgians send their children to public school. I humbly submit to you colleagues that that is a big problem because we need to represent the people, all of the people. To interact with our public schools is also to know that our teachers and our school administrators and our support staff do more with less to support our kids. And are the most dedicated people in the world when it comes to helping our children succeed. So why would we make their jobs harder? Let's talk about intellectual honesty. Fully funded does not equal sufficiently funded. Joan me in voting no to SB233. Mr. Speaker, I yield the well. Thank you. The lady has yielded the well representative David Wilkerson has recognized the speak to the bill representing Wilkerson. Thank you, Mr. Speaker. Today I rise in opposition to Senate Bill 233. I want to thank the Education Committee for all the work that we've done over this past session focusing on literacy and school safety. And I'm just going to touch on a few things. During committee meetings I've heard a lot of talk about hope. So let me, you know, how this kind of equates to hope and how we fund private schools through hope. Hope was done on the ballot by going to our constituents and finding a new source of money. So we didn't pull out of the general fund to experiment. And then what we're doing today is believe it or not, we are experimenting. And it may be a successful experiment or it may be a bad experiment. But if you look across the country, it is not, it has been a lot more expensive than what we thought. And I've never seen a government program that starts, that goes away. Each year we come back and ask for more money because it's successful. An arbitrary cap of 140,000 could be erased next year. Actually, it could be erased in the Senate. They could decide 2% is the right number. Make it decide 200,000 is the right number. So I just want to touch on a few quick things. The waiver, I got a call from a school system. We talked about the waiver in the bill. Someone had asked for an amendment to say that you have to be certified. Cobb County has that ability but they don't use it. I don't know about your districts but they don't use that waiver even though it's available. You don't have to wait if you're in kindergarten. If your kid comes in, students start school. All those parents had that ability to access this voucher so you don't have to wait. And the biggest thing for me is the $6,500. I don't know how we get to that $6,500. Taking QBE and backing out other things, I can't add other things. I can add different numbers. So if you're giving $6,500 but a high school student only gets $4,000, you are automatically pulling more to the out of that school than what you were putting in initially. So I would be curious and I would love to find out. It's been 351 days to find out how we get to that. Now if we had a fiscal note to be very easy to see, kind of where that money's coming from but we don't have that. And the final piece we do appreciate the things that were added to the bill but they were already added in House Bill 941 and 1221 when we started talking about. Every K and school access across district lines. So with that Mr. Speaker, I thank everybody for their time and I ask that you join me. And supporting a bill that will stop money moving from rural areas to the metro areas because we have private schools. Half of our counties have one or less. The metro area is going to make some money off of this at the expense of our rural folks. And I ask you join me in voting now. Thank you. Thank you Representative. Representative Debbie Buckner has recognized to speak to the bill. Representative Buckner. Thank you Mr. Speaker. I was asked to give this bill a fair chance. And I want you to know I read every word of it and gave thoughtful consideration to the bill. I listened to the committee's presentation and I listened to the excellent presentation by the sponsor this morning. I also read news accounts of polls that have been done and I read text, many text from constituents, emails and took phone calls until way late last night and they started again early this morning. What I know about this bill is that for rural Georgia it has some problems. There's no way we can get around it. What we know is that in the majority of the counties that are rural in the state of Georgia there are no private schools for kids to take vouchers to. What we also know in the rural areas of the state is that if you take your voucher to a private school they do not have to accept you. What we also know is that if a child goes to a private school using a voucher and they don't fit in they don't achieve. They come back to the public school which is like an emergency room. It has to be there for them. They have to accept them back and they have to catch them up to the school level that they have missed out on. What we also know in the rural areas that the $6,500 of which is for transportation is not going to cover the cost. It will not cover the cost of the tuition. It will not cover the cost of the incidentals like uniforms potentially or the activity fees. What we also know in rural areas is that participating in a private school does not have the same accountability and transparency that we require of our public schools. They do not have the same services that we require of our public schools. And many times they do not have the qualified teachers that we have in our public schools. I received letter emails from teachers who were so very grateful for the pay raise but they said in their email just because you put it in this bill doesn't mean it will keep coming. It has to be in that special bill called the budget bill. In reading the bill it bothers me when we grow government and that is on page 3 with a whole new authority. But what bothered me even worse is on page 11 where it talked about individuals who owe any amount of education to the educational savings authority relating to any loan scholarship grant made by the educational savings authority without judicial action could become subject to garnishment for their pay and loss of professional licenses in Yadayata. We are talking about punishing them without due process. That bothered me. And further back it talks about the lowest 25%. That's where I had the biggest beef with all of this. And I'll tell you why. It's personal. There is a school in my district that is owned this list of the lowest performing 25% that is not even open. Has not been open since 2020. So if we're going to use some arbitrary list to say that they're owned the 25% that criteria needs to be very clear and it doesn't need to be that they perform poorly this year but they move forward next year. Maybe they still aren't at the number one. Maybe they still aren't at the top of the list but they're moving in the right direction. That is not. It appears being taken into consideration. I agree with another speaker that came up here that talked about some of the same schools that I represent and did a magnificent job. And he said we aren't talking about the right things. If we're going to talk about improving the stailing schools which I hate that term but the low performing schools are the schools that are in the bottom 25%. What are we looking for? What do we need to improve and how do we make that happen? I have always tried to be fair in everything I do. Just because I've been against this bill every single time it's been here didn't mean that I was going to be against it this time. I did read the bill. I did listen and I did give it consideration. But in the long run public schools cannot or will not receive the funding that they need to be successful if this goes into play. It just will not happen. This funding is based on the number of children in the desk. And if the desk are empty because children have gone somewhere else using this voucher there will be less money for schools. Public schools in Georgia are serving about 90% of the students. And we have a financial and community stake in the future of all of our children everywhere in our state. Our children deserve a system of education that allows them to achieve their best. And we need to be the ones to help provide that. Do parents have choices? Do they need choices? Yes. I have three children and we had a patchwork of education. But I never came to the state. I never went to an agency and said give me some money to pay my way. I went to work and I paid the way with my husband to put them where they needed to be to achieve what they needed to achieve. And that's what I think we need to instill in all of our parents so that they can receive the education that they need for their children. We need to be serious about education but we need to change the conversation. And we need to be honest with each other and we need to talk about what we need to do to make Georgia the number one place for education. And I don't think it will be without you. Mr. Speaker, I yield the well. The lady has yielded the well that completes the member's speaking on the minority report. We'll now have up to 20 minutes. On Chairman's time, this bill came from education so Chairman Irwin has recognized to speak to the bill. Thank you, Mr. Speaker and colleagues. I stand before you today to ask you to vote yes on Senate Bill 233. So often in my career, I saw children without options. That word has been used a lot today in this well. We try hard in education to squeeze kids into the same box, the same schedule, the same timeline, the same test. The children need options because they're not all the same. They don't experience the same things. They don't experience the learning at the same time. So we must always continue to look for options for our children. Now I've got quite a bit I can reiterate from a 39 page bill that I've heard defended on or opposed on both sides. And I'm going to try to eliminate some of that as we go through what I'm telling you. We often say children's zip code shouldn't determine his or her future. Our estate and its communities provide most of our students with outstanding world class education opportunities. We're all very aware and it's been stated in this well, some by their zip code are trapped in those failing schools. The Georgia Promise Scholarship Act gives parents and students more educational options to make the best decisions possible. Fully supports our ongoing fully funded QBE, codifies teacher pay raises to historic levels and supports pre-K, which is something we studied this summer and we're putting a very strong focus on in this house for our youngest most needed needy of our students as far as their learning. This act provides accountability and transparency to the programs with a sunset and caps on spending and a strong accountability that has been put in there for our students. Not only can we use that as I've heard from this well today to assess the viability of the program when the cap is nearing. Mr. Speaker, what I'd like to do is ask colleagues again. Vote yes on Senate Bill 233 and I ask you if you haven't already done it, read every single word of that 39 page bill and understand what it does for the students and the young people of this community. And Mr. Speaker, I'd like to leave the remaining time, chairman time to somebody's work very hard on this bill. Pro Tem, Jones, that's okay. Gentlemen, has that privilege to pro Tem of this house has recognized to speak during chairman's time, representative Jan Jones. Thank you and thank you, chairman Erwin, for those words. I just had a couple comments, maybe I wanted to comment on some things that had heard up here and maybe clarify a few things. I heard that this is not the answer to fix our schools and I just want to make it clear. This particular, the provisions related to the promise scholarship, the goal is to help children, that's the goal. And we've done many other things that are also contained in this bill to fix the schools, to fund our schools and there are certainly many measures in this bill that make this a responsible initiative to see that our institutions, our traditional schools are not harmed. But don't forget, the goal is to help individual children, that's the goal. I heard that this would defund education. I encourage you to read through the bill as the chairman mentioned and note the cap that restricts, should we ever reach it, should a governor, current or future choose to fund the maximum, the maximum number of children that could utilize this statewide would be 21,000 students. For context, we have 1.7 million children that are utilized public education. I hear about, and I heard about it years ago, about the Constitution, and it is true, that in our Constitution, public safety is paramount. That is our primary, that is our number one constitutional mandate in the Constitution. And I will say this body has done a lot of things to make our citizens safer. And it is a primary obligation to provide an adequate public education. Let me tell you what the Constitution does not say. It does not state that the Georgia budget, our general budget, cannot provide a modicum of support for parents who know that another educational option would best serve their students. It does not exclude what we are doing today. And we certainly are making sure in the other provisions of the bill that we are fulfilling our primary obligation to provide an adequate education, a free adequate education for those who utilize public education as did my four children. I heard about polling, and I will just say most parents do want more options, not fewer. And I heard the same argument back in 2012 when we passed a constitutional amendment to allow the state to authorize public charter schools. Most of the minority party railed against it. They voted against it. It barely passed with the help of a few members of the minority party. And when it went before the people, which is the best way to vote on something, or the best way to get a real sense of what they think, 58% of Georgians voted for it to allow the state to authorize public charter schools because local school systems refuse to. Not only did it pass by 58% every single House District passed it on the general election. And let me tell you which county voted the highest percent. Clayton County, 71% of Clayton County voters voted in support of more options, and every member of their delegation at the time had voted against it on this floor and in the Senate. Today, only 11 systems out of 180 approved locally approved charter schools. No wonder parents want more choices because they're not being given enough. And I encourage our local school system to partner with us in offering more options within the public school system, but to date that just has not happened. I also heard, how did we get here? How did Georgia become the best state to do business and the Hollywood of the South? Well I just might add that on the ladder, I think a little tax credit had something to do with that. Maybe a lot to do with that. But I will say that it's been strong sound decisions at the local and state level and by the individuals and businesses that call Georgia home. It's not always a government that makes for a great climate and a great growth for a state. It's actually individuals, it's not always a government. I will say that by, we have supplied our individual teachers and we've increased the state education funding over and overing. But fear mongering doesn't change the narrow breadth of the Georgia promise scholarship and it certainly is not going to harm our business and climate but rather enhance it by serving more children with more educational options. I heard the suggestion that money is the only answer to children learning and thriving. I would suggest every parent knows that child's well-being and educational attainment is affected by many more factors. For example, the most well-funded school in the state absolutely may not meet the needs of every child in that school. We have high schools with 3,000 and 4,000 students and I don't think anyone in this room can tell me that that is sufficient for every child, a child that might be bullied, a child that needs a smaller environment, a child that needs a more structured environment.\n\nmoney, although we've done a great job of supplying it, it's wrong to suggest that money is the only answer. Here's more money, and I'd be happy to go home, because government always has the answers. I reject that, and I hope that you will too. I heard that there are not any private schools in rural areas, that's simply not the case. I can show you a map, and I'm happy to supply it to you, that shows that 79% of students in the state live within 10 minutes of a private school. That doesn't mean they're going to utilize that private school. It doesn't mean that it's the answer to what the parents want, but there certainly are private schools around the state, and many more I might add than there are charter schools that are approved by local school systems. This is one tool. It is not a panacea, and I don't think anyone who's in favor of the bill has suggested that it's a panacea. It's one narrow tool to support children and their parents in making educational decisions for their most precious loved ones, their children. This legislation does not dictate those decisions for the children. It does not put institutions above students. And even with this modest measured support for parents, most parents will choose the public school to which their child is assigned. But for those that do not, I encourage you to vote for Senate Bill 233 and put a child a few children first. With that, Mr. Speaker, I yield the well. The lady has yielded the well. That completes our discussion on Senate Bill 233. Is there any objection to adopting the Committee's substitute? Here's none of the Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? Chair, here's none of the Committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? For what purpose is representing Dubent Grise? Parliamentary inquiry? The State's inquiry. Mr. Speaker, is it not true that because of the way this state and this house budget that a child and a family does not have to look at us and have us tell them that we are choosing one choice from one family over another choice from another family, but instead we can say that we allow this family and another family to receive the school of their choice. Is that not true? I'm sure the gentleman knows what he speaks. If all members have voted, we've talked about this one an awful lot today. If all members voted, if so, the clerk will lock the machine. On the pass, if Senate bill 233, the yeas are 91, the nays are 82. This bill, having received a requisite constitutional majority, is therefore passed. For what purpose does minority leader rise? Move for reed consideration. No, no, no. Rule 144, the rules of this house does not allow a bill to be reconsidered a second time. This bill has already been reconsidered once already, so the gentleman's motion is out of order. We're moving on. This house is going to stand in recess after we have a couple of announcements. The first members, I need your attention. Mr. Leader, I need you to come back to your desk just for a minute. I discuss this motion with you. This comment that I'm getting ready to make, I want members to please take your seats. Ladies and gentlemen, this is a clear demonstration. We just debated a bill for a couple of hours here. You did it with respect for the other members no matter how they voted. That is not the case over in the Senate with some of their members. It was a portrait right down front this morning. We honored a great Georgian, a member of this house, a former speaker of this house. We celebrated David Ralston's service to the people of Georgia, to Georgia, with joy and celebration, along with his family, his family of this house, three governors of this state of Georgia, and with his mama looking on at home. A member of the Senate, the senator from the 53rd district, took it upon himself to go to the well of the Senate, make some of the violence comments that you can make about a good man. His comments impunged the integrity of my dear friend. And we all know they were not true. Speaker Ralston was a man of integrity, a man of service to this state. His reputation will live on in Georgia for years and years to come. For generations because of policies that he empowered, we will impact Georgian's lives. And the work of this house will continue that work. Now I must say, Lieutenant Governor and several members of the Senate defended the honor of Speaker David Ralston on the floor of the Senate. But I'm going to tell you what I'm going to do today. I'm going to ask the doorkeeper of this house, Cory Moky. No time in the future will the senator from the 53rd be allowed to come into that any room or any property of the Georgia House? Mr. Munnori later. Mr. Speaker, absolutely 100% second that motion. Even though it's inappropriate, we as a Democratic party as a Democratic caucus, stay with you in solidarity for what you just said. Thank you for saying that. We'll stay with you. Thank you, Mr. Leader. Thank you members. Cory, you have the orders. I expect you to enforce the McCarrion out. Mr. Leader, Mr. Leader, members is a motion with emotions as it should be. Okay, we have a couple of announcements. Thank you members. Representative Duy McLean is recognized for announcement. Thank you, Mr. Speaker. I just want everyone to know that the working family caucus will meet in room 310 and there are box lunches in 310 and the CLEB. Working family caucus 310 CLEB. Thank you, Mr. Speaker. Thank you. Representative Clayton, Chairman Guster is recognized for announcement. Thank you, Mr. Speaker. Judiciary Committee will meet in 132 on the break. We have one bill that should go very fast and we also have lunches. Representative Allen Powell is recognized for a motion. The members of the regulated industry committee, you've got lunch over in 613 and immediately upon adjournment today, you have a committee meeting and bring your lunch bag. Members, I think they're okay but we do have them. EMTs can check them in the doctor of the day if necessary. Representative Billy Mitchell is recognized for an announcement. The Democratic caucus will have a brief meeting in room 605. Lunch will be served. Thank you, Mr. Speaker. Members of the House, we will stand in recess until 245. Excuse me, Gerald any Cooper needs to make out of announcement? I'll have your attention. Gerald any Cooper? Thank you, Mr. Speaker. Ladies and gentlemen, the House will pay attention if you are on the committee on public health. We will be meeting at 2 o'clock in room 606 of the CLOB. 2 o'clock, that's about 10 minutes. So we need to have you there. Thank you very much, Mr. Speaker. The House is in recess until 245.",
  "updated_at": "2026-02-13T20:25:09.850322+00:00"
}