{
  "video_id": "kGuWE9e2-OQ",
  "url": "https://youtu.be/kGuWE9e2-OQ",
  "title": "Georgia House - Day 29 (2026-03-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 29,
  "video_date": "2026-03-13",
  "duration_minutes": 32,
  "summary": "Overview:\nThis session of the Georgia House of Representatives featured the introduction of several bills on a range of topics, including education, labor, environment, and criminal justice. While no major legislation was passed, the session highlighted the chamber's active legislative agenda.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\n- **HB 1163**: Act to amend and reconstitute the Board of Education for Randolph County\n- **HB 64**: Act to amend the act to provide for a supplement to the compensation, expenses, and allowances of the district attorney of the Piedmont Judicial Circuit\n- **HB 1165**: Act to repeal the act creating the joint Liberty County City of Gumbranville, City of Midway, City of Riceboro, and City of Waterville Fire Protection Facilities and Equipment Authority\n- **HB 766**: Act to provide for new homestead exemption from Fayette County School District ad valorem taxes\n- **HB 767**: Act to revive for a new homestead exemption from the City of Atlanta ad valorem taxes\n- **HB 768**: Act to amend Code section 20-2-142.1 of the Official Code of Georgia Annotated, relating to coursework and the founding philosophy and principles of the United States of America\n- **HR 1474**: Resolution creating House study committee on recovery, recycling, and reuse of scrap tires\n- **HR 1475**: Resolution encouraging the Georgia High School Association to perform a thorough assessment\n- **HR 1476**: Resolution supporting National Internet Privacy Standards\n- **HR 1477**: Resolution supporting the passage of H.R. 1384\n- **HR 1478**: Resolution supporting parity for breast pump collection and storage supplies\n- **HR 1479**: Resolution supporting the creation of a gender parity task force\n- **HR 1495**: Resolution creating House Study Committee on Regulatory and Oversight Processes\n- **HR 1496**: Resolution urging all 159 counties in Georgia to be designated Second Amendment constitutional counties\n- **SB 40**: Act to amend Code Section 16-6-5.1 relating to sexual assault by persons with supervisory or disciplinary authority\n- **SB 102**: Act to amend Chapter 2 of Title 20 in the Official Code of Georgia Annotated, relating to elementary and secondary education\n- **SB 272**: Act to amend Part 1 of Article 2 of Chapter 13 of Title 16, the Official Code of Georgia Annotated, relating to schedules, offenses and penalties\n- **SB 288**: Act to amend Code Section 35-3-37 of the Official Code of Georgia Annotated, relating to review of individual criminal histories\n- **SB 327**: Act to amend Chapter 1 of Title 34 of the Official Code of Georgia Annotated, relating to general provisions regarding labor and industrial relations\n- **SB 349**: Act to amend Part 3 of Article 16 of Chapter 2 of Title 20, the Official Code of Georgia Annotated, relating to health\n- **SB 375**: Act to amend Article 7 of Chapter 12 of Title 16, the Official Code of Georgia Annotated, relating to sales or distribution to minors\n- **SB 379**: Act to amend Title 43 of the Official Code of Georgia Annotated, relating to professions and businesses\n- **SB 384**: Act to amend Part 1 of Article 2 of Chapter 8 of Title 12, the Official Code of Georgia Annotated, relating to general provisions relative to solid waste management\n- **SB 408**: Act to amend Code Section 34-1-10 of the Official Code of Georgia Annotated, relating to the uses of sick leave\n- **SB 410**: Act to amend Code Section 48-5-311 of the Official Code of Georgia Annotated, relating to the creation of county boards of equalization\n- **SB 412**: Act to amend Code Section 33-7-6 of the Official Code of Georgia Annotated, relating to property insurance\n- **SB 413**: Act to amend Chapter 67A of Title 36, the Official Code of Georgia Annotated, relating to conflicts of interest\n- **SB 416**: Act to amend Code Section 20-2-157 of the Official Code of Georgia Annotated, relating to the office of college and career transitions\n- **SB 418**: Act to amend Part 1 of Article 5 of Chapter 9 of Title 45, the Official Code of Georgia Annotated, relating to the Georgia Board of Pharmacy\n\nNotable Moments:\nNone detected\n\nVotes:\nNone detected\n\nAttendance:\nQuorum was present.\n\nAdjournment:\nThe session adjourned. The next session date was not specified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThey are of convening, uh, having arrived and passed. Uh, we're coming in a little bit late,\nbut, uh, Georgia House of Representatives will come to order. Uh, we're going to dispense\nfor the roll call today, and since I had asked members not to be here, I'm assuming that\nwhoever had chaplain of the day has listened to that because we do not have a chaplain\nof the day. So we're going to go into first readers, Mr. Clark. If you would read, please.\nHouse Bill 1163 of our represent of green and 151st Bill of Utah, an act to amend and\nand act to reconstitute the Board of Education\nor Randolph County.\nIntergovernmental Accordination.\nHouse bill number 64 of our resident Williams\non 68th, work rise with the 157th and Jones on 67th.\nBill Mehton and act to amend the act to provide\nfor a supplement to the compensation expenses\nand allowances of the district attorney\nthat land on judicial circuit.\nIntergovernmental Accordination.\nHouse bill number 1165 by Representative Williams\non 68th, Bill Mehton and act to repeal an act\ncreating the joint Liberty County City of Gumbran,\nCity of Midway, City of Riceboro,\nand City of Waterville, Fire Protection Facilities\nand Equipment Authority.\nIntergovernmental Coordination.\nHouse Bill 766 by Robson.\nA bonner of the 72nd single women,\n71st and Mithiac of the 73rd.\nBill B. Todd and Act to provide for new homes\nto the exemption from Fayette County School District\nad ballorum taxes.\nIntergovernmental Coordination.\nHouse Bill 767 by Robson of Canon of the 58th time\nwas the 56th Garden of the 57th Dryer,\n159th the Scofield the 60th\nBill Beton and act to revive for a new homestead exemption from the city of Atlanta ad ballorum taxes\nIntergovernmental Accordination House Bill them 68 by Representative Hill of 3rd\nBill Beton and act to amend Code section 22 142.1 of the Fisher go to Georgia and Tady relating the coursework and the founding philosophy and principles of the United States of America\nEducation House resolution 1474 by representative next to 69th\nWell, so the 110th Smith on 33rd, tremolo 130 second buckner and 137th and others\nResolution creating house study committee on recovery recycling and reuse of scrap tires natural resources and environment house\nResolution 1475 I've said of Watson and 170 second mark on the 49th hogan and the 179th and Douglas at 78th\nResolution encouraging to Georgia high school association to perform a thorough assessment\nEducation, House of Resolution 1476 by Representative Drenner of the 85th\nhence in the 86th and Carter the 92nd Resolution Supporting National Internet\nPrivacy Standards, Science and Technology, House of Resolution 1477 by\nRepresentative Drenner of the 85th hence in the 86th Davis, the 87th Evans of the\n83rd, Stevenson the 90th and others, a resolution supporting the passage of\nH.R. 1384.\nSpecial rules, House of Resolution 1478,\nby Representative Drenner of the 85th,\nhence in the 86th,\nguard of the 92nd,\na resolution supporting parity\nfor breast pump collection and storage supplies.\nHealth and human services,\nHouse of Resolution 1479,\nby Representative Drenner of the 85th,\nand hence in the 86th,\na resolution supporting the creation\nof a gender parity task force.\nspecial rules House of Resolution 1495 by Representative Couch, the 50th\nWilliams of 37th Gilear to this 160 second Oliver, the 82nd Evans, the 83rd\nand others of Resolution Creating House Study Committee on Regulatory and\nOversight Processes. Natural Resources and Environment. House of Resolution 1496 by\nreps of Gertler, the 8th, more of the first, Singleton, the 71st, Calville, the\n20th Cook of the 18th and others of Resolution urging all 159 counties in\nthe state of Georgia to be designated second amendment constitutional counties.\nRules.\nSenate Bill 40 by Senator Jackson, the second Jones of the 10th,\nhence in the 41st, Sims of the 12th,\nRobin of the 5th and others,\nBill Detonant Act to amend Code Section 166, 5.1 and the official bill to\nGeorgia and annotated relating sexual assault by persons with\nsupervising or disciplinary authority.\nJudiciary non-civil.\nSenate Bill 102 by Senator Jones of the 10th,\nor Rock of 36, hence in the 41st,\nButler of the 55th Jones of the 22nd and others,\nwill be titled act to amend chapter 2,\na title 20 in the Fisherhood of Georgia Annotated,\nrelayed an elementary and secondary education.\nEducation.\nSenate Bill 272 by Senator Robertson of the 29th,\nwill be titled act to amend part one of our two\nchapter 13, the title 16,\nthe Fisherhood of Georgia Annotated,\nrelayed the schedules, offenses and penalties.\nJudiciary non-civil.\nSenate Bill 288 by Senator Anderson, the 43rd Jones, the 22nd Jones, Jordan of the 6th parent of the 42nd Jones of the 10th, and others, the Bill of the Title of the Act of End Code Section 353, 37th fiscal to George Antating relating to review of individual criminal histories.\nspecial committee on access to the civil justice system.\nSenate Bill 327 by Senator Kerrinshak of the 48th,\nBlackly 8th, James 35th, Tate of the 38th, Martin of the 9th and others.\nBill B. Todd on active in chapter 1 and title 34 of the official go to Georgia and\nand Tate relating the general provisions regarding labor and industrial relations.\nHealth and human services.\nSenate Bill 349 by Senator James 35th, Kerrinshak of the 48th,\n7-4 to the 44th, Tate to the 38th,\nto say to the 34th, bill be a title to act to amend\npart three of Article 16 to chapter two of Title 20,\nthe official go to Georgia annotated relating to health.\nHealth and human services.\nSenate bill 375 by Senator Mulles,\nthe 53rd Watson in the first,\nBerk or the 11th, Karpatric of the 32nd,\nMiller of the 49th and others,\nbill be a title to act to amend\nArticle 7 chapter 12 of Title 16,\nthe official go to Georgia annotated relating\nsales or distribution to minors.\nWays and means.\nSenate Bill 379 by Senator Stone of the 23rd Anderson to the 24th of the bill be titled act to amend title 43.\nThe official go to drove annotated relating to professions and businesses.\nRegulated industry Senate Bill 384 by Senator Ligon of the 3rd Miller of the 49th.\nDugan of the 30th Stone of the 23rd until or either 19th.\nBill be titled act to amend part one of Article 2, chapter 8 of title 12.\nThe official go to Georgia annotated relating the general provisions relative to solid waste management.\nNatural resources and environment Senate Bill 408 by Senator Strickland of the 17th\nDougan the 30th Miller of the 49th on a run of the 45th Anderson's 43rd and others\nThere'll be Todd on act of men code section 34 1 10 of the official go to Georgia annotated relating the uses sick leave\nIndustry and labor Senate Bill 410 by Senator Kennedy 18th Dougan the 30th Gucci the 51st Miller the 49 stone of the 23rd and others\nwill be tunnel act to amend code section 485, 311, the official go to Jordan annotated relating the creation of county boards of equalization.\nGovernmental affairs Senate bill 412 by Senator Robertson, the 29th Wilkinson, the 50th Gooch, the 51st.\nHarvestson, the 15th, Paine, the 54th and others, bill be tunnel act to amend code section 337, 6th of the official go to Jordan annotated relating to property insurance.\nInsurance Senate Bill 413 by Senator Martin of the 9th Kirkpatrick of the 32nd, Don Zell of the 27th, Halvers of the 56.\nBill B. Donald and act to amend Chapter 67A of Title 36, the official bill of Georgia annotated relating the conflicts of interest.\nThe Senate Bill 416 by Senator Mullis, the 53rd, Miller, the 49th, Dugan, the 30th, Kennedy, the 18th, Walker, the 20th, and others.\nBill Beton and active men code section 24, 37 in physical to Georgia, annotated, relating the office of college and career transitions.\nEducation.\nSenate Bill 418 by Senator Thompson, the 14th, Alvers, the 56th, honor, men, and the 45th, Mullis, the 53rd, Harvard, the 16th, and others.\nBill B. Todd and active men part one of Article five, chapter nine to title 45, the official go to Georgia annotated relating the Georgia state in the indemnification fund.\nPublic safety and homeland security Senate bill 423 by Senator Alvers, the 56 beech of the 21st, Kropatric of 32nd, Mark of the 9th.\nBill B. Todd and active men code section 16, 5, 61 of the issue of the official go to Georgia annotated relating the hazing.\nEducation Senate Bill 426 by Senator Strickland on the 17th, Hillary the 19th,\nKirkpatrick in the 32nd, red of the 33rd, James the 35th and others,\nBill B. Toddl, an active man, Article 1 of Chapter 9 of Title 12,\nthe official go to Georgia annotator relating to air quality.\nNatural resources and environment.\nSenate Bill 428 by Senator Couser to the 46, Mollos the 53rd,\nagain to the 47th, Miller to the 49th,\nMartin to the 9th and others,\nBill B. Toddled Act to Ben,\npart two of Article 15 to Chapter 1,\nand Title 10 to the fiscal to Georgia,\nthey have attended relating to the Fair Business,\nPractices Act of 1975.\nWorking Group on Creative Arts and Entertainment.\nSenate Bill 432 by Senator Harvard,\nthe 16th Jones to the 25th, Walker,\nthe 20th, Robertson to the 29th,\nHarveston to the 15th and others,\nBill B. Toddled Act to Men Code,\nMen Chapter 25 at Title 33, the Fisher go to Georgia annotated relating to life insurance.\nInsurance Senate Bill 446 by Senator Walker, the 20th, Kennedy, the 18th, Gucci, the 51st.\nAgain in the 47th, Miller to the 49th and others, Bill being titled back to amend Code Section 1764,\nthe Fisher go to Georgia annotated relating the authorization of posting cash bonds.\nJudiciary non-civil Senate Bill 451 by Senator Kennedy, 18th,\n1,000 to 46, I'll start with the 52nd,\nagain to the 47th, and a ligand to the 3rd.\nBuilding title, an act to amend.\nArticle three, chapter three, a title nine,\nthe Fisherhood of Georgia Amitated,\nrelating the limitations on recovery.\nJudiciary.\nSenate Bill 463 by Senator Kennedy,\n18th, Dugor to the 30th,\nGucci to the 51st, Jones to the 25th.\nMellos of the 53rd, Bill Bintado, an act to amend chapter 2, title 21 of the Fisher go to Georgia annotated relating to primaries and elections generally.\nGovernmental affairs.\nSenate Bill 464 by Senator Kennedy, 18, due to the 30th, due to the 51st Jones, the 25th, and Mellos of the 53rd.\nBill Bintado, an act to amend title 9 of the Fisher go to Georgia annotated and relative to civil practice.\nJudiciary, Senate Bill 476 by Senator Capatric of 32nd Black of the 8th,\nhonorment of the 45th, stone of the 23rd, parent of the 42nd and others,\nBill B. Tonnell, act to amend Article 11 of Chapter 11 of Title IV,\nthe fiscal code of Georgia annotated relating the general provisions relative to animal protection.\nAgriculture and consumer affairs, Senate Bill 477 by Senator Capatric of the 32nd,\nSecond, strictly to the 17th parent of the 42nd.\nKennedy, the 18th, and Jones to the 22nd.\nBill B. Todd, on act to amend code section 174, 20.1,\nwith the official code of Georgia annotated relating the investigation of family violence.\nDo you have an old justice?\nSenate Bill 480 by Senator Huffstead, live in the 52nd.\nBill B. Todd, on act to amend article 1 of chapter 2,\nTodd of 48, the official code of Georgia annotated relating the state administrative organization.\nWays and Mains Senate Bill 484 by Senator Capatric of the 32nd, Burke of the 11th, Bill B.\nTitle and Act to men, Title 31 of the official go to Georgia, and attend a relating health.\nHealth and human services Senate Bill 489 by Senator Gooch of the 51st, Capatric of the 32nd,\nBeech of the 21st, Jones of the 25th, and Watson of the 1st.\nBill B. Title and Act to men, part two of Article 1 of chapter 8 of Title 40.\nThe Fisher go to Georgia annotated relating the lighting equipment of motor vehicles.\nMotor vehicles.\nSenate bill 493 by Senator Thompson.\nThe fourth beats is 21st.\nHarvest in the 15th.\nCowsr to the 46th.\nHarvest in the 16th.\nThey'll be in town on an active men's chapter one.\nA title 10 of the Fisher go to Georgia annotated relating to selling and other trade practices.\nJudiciary.\nSenate resolution 841 by Senator Kennedy.\n18th Cowsr to the 46th.\nHuffstutler to the 52nd.\nStone to the 23rd.\nIn a ligand of the third and others, a resolution proposing an amendment to the Constitution.\nJudiciary.\nSenate Resolution 844 by Senator Miller, the 49th Wilkinson of the 50th,\nRobertson of the 29th, Gucci of the 51st,\nUnderman of the 45th and others.\nA resolution honoring the life of Deputy Nicholas Blaine Dixon.\nTransportation.\nSenate Resolution 885 by Senator Harper, the 7th Hill of the 4th,\nof the 11th Jones of the 25th,\ndue to the 51st and others.\nA resolution proposing the amendment\nto the Constitution so as to authorize the state\nto encourage general obligation debt.\nAppropriations?\nSo this working for abenious disabled because I am has not given a boarded point.\nDO not stay the Valley we need to board this evening.\nOkay, before we go to second readers, the chair wants to recognize the temporary, and\nI will emphasize temporary chair of the Committee on Information Audits, temporary chair\nThere are sayings, you got a little learning curve on how to be a chairman there.\nMr. Speaker, the self-appointed guardian of the chair of information and\naudits has skimmed the journal of the previous legislative day and has\ncertified it to be present.\nTemporary Chairman Sains reports that he has read the journal of the previous\nlegislative day and found it to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nreading of bills and resolutions.\nHouse bill 1146 by the representative.\nParsons the 4th.\nBill B. Donald and act to amend code section 166 5.1.\nThe fiscal to Georgia annotated relating\nimproper sexual contact by employee or agent.\nHouse bill 1147 by represent and pull them to the 131st.\nBill B. Donald and act to amend the act to provide\nfor the merger and consolidation of the existing\nUps and County school system.\nHouse bill 1148 by represent of housed in the 170th\nwill be tunneled act to amend the act, change provisions relating to the Magistrate Court of Bering County.\nHouse Bill L.M. 49 by reps and a McLeod of the 105th Alexander the 66, Thomas the 56, Duke's the 154th.\nCarter the 92nd and others, will be tunneled act to amend chapter 9 and\ntitle 17 in the physical to Georgia, annotated relating to verdict and judgment in criminal cases generally.\nHouse Bill 1150 by reps and a McLeod of the 105th, Thomas the 56th Alexander the 66,\nDuke the 154th Davis of the 87th building title and act to amend title of the 48th fiscal to Georgia and Tate relating to revenue and taxation.\nHouse bill 1151 by represent Scofield the 60th building title and act to amend title 33 the fiscal to Georgia and Tate relating the insurance.\nHouse bill 1152 by represent Scofield the 60th Hutchinson of the 107th Mitchell the 88th car of the 92nd building title act to amend Article 9 of Chapter 4 title 49.\nfiscal to Georgia annotated relating to temporary assistance for needy families.\nHouse Bill 1153 by reps on scope field, 60th Hutchinson to the hundred and seventh, Mitchell to the 88th.\nBill being titled an act to amend chapter 24, title 33, the fiscal to Georgia annotated relating the insurance.\nHouse Bill 1154 by reps and a more of the first, Bill being titled an act to authorize probate court of day county to charge a technology fee.\nHouse Bill 1155 by reps of Douglass 78th, Holly the hundred and the 11th.\nOctober show of the 48th, Wilkerson the 38th,\nhops into the 153rd,\nthere'll be a ton of active men chapter 31,\na ton of 36, the physical,\nthe Georgia, and the Teddy relating\nto the incorporation of the initial incorporations.\nHospital 1156 by Representative,\nCarson the 46, Wilkerson the 38th,\nthey're hard of the 36,\nThomas the 39th, Cooper the 43rd,\nand others, there'll be a ton of active men,\nand that consolidating the office of tax collecting,\ntax receiver, and the office of tax commission\nto Cobb County.\nHouse Bill 1157 by Representative England, 116th Kirby, 114th Gaines, 117th Bill B.\nTodd and Act to create the State Court of Barrow County.\nHouse Bill 1158 by Representative Ridley, the 6th Bill B.\nTodd and Act to amend Chapter 5C, Todd 48, the fish go to Georgia and\nannotated related alternative, add Valorum taxes on motor vehicles.\nHouse Bill 1159 by Representative LaRickia, 1169th, a lot of the 122nd Rodgers of\nthe 10th and Reeves of the 34th Bill B.\nTitle NAC to men, Article 4, Chapter 18 to Title 50.\nThe fish go to Georgia and Tater relating inspection of public records.\nHouse Bill 1160, by the way, more than 156 of building\nTitle NAC to provide a new charter for the city of Ovala.\nHouse Bill 1161, by the way, represent Charleston, the 7th of the building,\nTitle NAC to men in NAC to provide a new charter for the city of Blue Ridge and\nFannie County.\nHouse Bill 1162, by the way, represent Charleston, the 7th of the building,\nan act to authorize the governing authority, the City of Blue Ridge, to lead me in next-size\ntax.\nHouse Resolution 1444, by reference of Howard of the hundred and twenty-fourth resolution\nhonoring the life and memory of Miss Jessie Norman, and dedicating interchange in her memory.\nHouse Resolution 1472, by reference of Work Highs of 157th and Meeks of the hundred and\nseventy-eighth.\nResolution recognizing Mr. Willie, Mr. William Billy E. Clanton, and dedicating the bridge\nin his honor.\nSenate Bill 28 by Senator Jackson,\nthe second, Huffstutler, the 52nd,\nAlvers, the 56th, Rahman, and the 5th,\nHarvinson, the 15th.\nBill B. Toddl, the act to amend Article 1 of chapter 24,\nthe title 33, the fish go to Georgia,\nand Tati, relating the general provisions regarding\ninsurance.\nSenate Bill 321 by Senator Huffstutler,\nthe 52nd, Watson, the 1st,\nhonor him in the 45th, Butler, the 55th,\nGrapatric, the 32nd.\nBill B. Toddl, the act to amend chapter 34,\nTitle 43, the Fisher go to Georgia and\nTative relating to physicians.\nSenate Bill 337 by Senator Thompson,\nthe 14th Roberts in the 29th,\nDugan in the 30th, Gucci in the 51st,\nMiller in the 49th and others,\nBill being titled an act to amend\nPart 3 of Arc 3, Chapter 11,\nTitle 16 in the Fisher go to Georgia and\nTative relating the invasion of privacy.\nSenate Bill 338, by Senator Cropatica,\n30 second black of the 8th Walker,\nthe 20th Couser to the 46th, Anderson in the 24th and others,\nBill B. Todd on act two, men are go on chapter 11,\nthe title four, the official go to Georgia,\nannotated relating the general provisions\nrelative to animal protection.\nSenate Bill 358, by Senator Harper,\nthe seventh seems to the 12th.\nBerkeley 11th, Walker, the 20th, Black of the 8th,\nand others, Bill B. Todd on act two, men are three,\nchapter three, a title 50,\nthe official go to Georgia, annotated relating\nthe state symbols.\nSenate Bill 381, by Senator Kirkpatrick,\nthe 32nd, Berkeley 11th, Black of the 8th,\nMarker, the 20th, Wilkinson, the 50th, and others.\nBill Minton, an act to amend Article 2 of Chapter 2,\nTitle 26 of the Efficient Go to Georgia Administrative Related in the Georgia Food Act.\nSenate Bill 386 by Senator Unerman of the 45th Gooch of the 51st Brass of the 28th Robertson of the 29th.\nMartin the 9th and others.\nBill Minton, an act to amend Article 33 of Chapter 2 of Title 20 of the Efficient Go to Georgia Administrative Related in the Georgia Special Needs Scholarship Act.\nSenate Bill 387 by Senator Jordan of the Sixth, a building to be entitled to an act to amend code section 22187.\nThe official go to Georgia annotated relating the statewide school lunch programs.\nSenate Bill 388 by Senator Kennedy, 18th Miller, the 49th Alboros, the 56th.\nWalker, the 20th, Huffsteadler, the 52nd and others.\nBill be titled an act to amend Article 1 of Chapter 7 of Title 48.\nThe official go to Georgia annotated relating the general income tax provisions.\nSenate Bill 405 by Senator Tipens, the 37th red of the 33rd\nGrapatric of the 32nd Jordan of the 6th,\ntimes of the 14th and others,\nBill Binton and Act of Men Code Section 1562,\nwith the official go to Georgia and\nand Tate River Lane, the number of security court judges\nfor each judicial circuit.\nSenate Bill 417 by Senator Grapatric of the 32nd,\nWatson of the 1st, I'll start with the 52nd,\nBerk of the 11th, Oracle of the 36th and others,\nBill Binton and Act of Men Chapter 34,\nTitle 43, the official code of Georgia and Tattoo relating to physicians.\nSenate Bill 430 by Senator Ligon in the third and Miller in the 49th,\nI'll start with the 52nd, Robertson in the 29th,\nHarvinson in the 16th and others,\nBill being titled an act to amend part 14 of Article 6 of Chapter 2,\nTitle 20, the official code of Georgia and Tattoo relating to other special educational programs under the Quality Basic Education Act.\nSenate Bill 443 by Senator Stone in the 23rd Anderson in the 24th,\nMellos of the 53rd, the bill be titled an act to amend chapter 4, title 18 of the official go to Georgia annotated relating to garnishment proceedings.\nSenate bill 445 by Senator Kennedy, 18th Jones of the 25th and Lucas of the 26th, bill be titled an act to amend chapter 7 of the title 12 of the official go to Georgia annotated relating a control of soil erosion and\nSenate Bill 447 by Senator Martin of the 9th stone of the 23rd,\nMulles of the 53rd, Dugan of the 30th, Miller of the 49th.\nBill B. Todd of the Act of NCO Section 22, 161.2.\nThe official put a Georgia annotated relating to work-based learning programs.\nSenate Bill 466 by Senator Martin of the 9th, black of the 8th, brass of the 28th.\nA parent of the 42nd, and Sims of the 12th.\nBill B. Todd of the Act to amend part 6 of Article 6 of Chapter 2, a title 20.\nSenate Bill 468 by Senator Onterman of the 45th, Bill B. Todd and active men article 1 of chapter 8 of Title 4 of the fiscal to Georgia and Tated relating the general provisions regarding dogs.\nSenate Bill 473 by Senator Harper of the 7th, Bill B. Todd and active men chapter 3 of Title 12 of the fiscal to Georgia and Tated relating the conservation and natural resources.\nSenate Bill 474 by Senator Harper, the seventh, Bill Meantown, an act to amend Article 1 of Chapter 7,\nTitle 50, the Fisher Bill of Georgia annotated relating the general provisions regarding the Department of Economic Development.\nSenate Bill 482 by Senator Burke of the 11th, Miller of the 49th,\nDewey the 30th, Watson the 1st, and Kropatric of the 32nd, Bill Meantown, an act to amend Chapter 53,\na Title 31 of the Fisher Bill of Georgia annotated relating the Office of Health, Strategy, and Coordination.\nSenate Bill 483 by Senator Brass, the 28th in Berkeley of the 11th,\nBill Nitton, an active man, Title 31 of the fiscal to join an annotated relating health.\nSenate resolution 194 by Senator Kirk of the 13th,\nDugan the 30th Walker, the 20th hon.\nAmendment of the 45th, Beech of the 21st and others,\nthe resolution creating the joint study committee on transferring oversight developmental disabilities to the Department of Community Health.\nSenate Resolution 793 by Senator Beech, the 21st,\nGucci, the 51st, Watson, the 1st, Alvers, the 56th,\nand Harveston, the 15th, a resolution creating the joint\nprivate financing of Infrastructure Study Committee.\nSenate Resolution 833 by Senator Martin of the 9th,\n2nd and 30th, Gucci, the 51st Jones, the 25th,\nMiller of the 49th, and others, a resolution creating\nthe Joint Study Committee on preparing our future workforce.\ncomplete second readers. Well the rules committee failed to set a rules calendar for today.\nNo one has signed up for a morning order. We do not have an invite resolution.\nAnd there's no announcement. Is anyone got an announcement?\nIf not, Chair recognizes the majority leader of the House for a motion.\nMiss Speaker, I had some doubts last night as early as the Senate turned out the lights\nover there, but it was good to hear they did pass a few bills and resolutions yesterday\non their work.\nSo it was good to hear that this morning.\nMiss Speaker, I move that the House stand adjourned, pursue it to part five of House Resolution\n1473 and further pursuant to the resolution, the schedule of meeting set fourth and house\nresolution 1473 be discontinued until so each time as a speaker of this house and president\nof the Senate may, by joint agreement, provide for the reconvening of the house and senate.\nThe majority leader has moved that this house stand adjourned pursuant to part five of\nHouse Resolution 1473, and further pursuant to the resolution, the Schedule of Meeting\nset forth in House Resolution 1473, be discontinued until such time as the Speaker of this House\nand President of the Senate May by joint agreement provide for the reconvening of the House\nand Senate.\nAll those in favor of the motion will say aye.\nopposed will say no. The eyes have it and this house will be adjourned.\nYou\n",
  "updated_at": "2026-02-12T13:54:54.268459+00:00"
}