{
  "video_id": "KL-c9YzXVpA",
  "url": "https://www.youtube.com/watch?v=KL-c9YzXVpA",
  "title": "House Rules Session for day 35 for the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Here is a summary of the Georgia House Rules Session for day 35 of the 2025 Session:\n\n**Overview**:\nThe session focused on the introduction and discussion of several bills, including Senate Bill 79 (the \"FEAR Act\" for fentanyl eradication) and a rules substitute for Senate Bill 69 (part of the governor's lawsuit reform package). The committee approved the rules substitute for SB 69 with some minor changes.\n\n**Key Actions**:\n- **SB 69**: Rules substitute approved with changes to disclosure requirements and joint/several liability provisions.\n- **SB 79**: \"FEAR Act\" for fentanyl trafficking penalties discussed.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- Explanation of SB 79 \"FEAR Act\" by Senator Govind, highlighting the severity of the fentanyl epidemic.\n- Discussion of changes to SB 69 rules substitute, including exceptions for litigation financing investors and discretionary joint/several liability.\n\n**Votes**:\n- SB 69 rules substitute approved.\n- Supplemental calendar set for bills including SB 40, SB 56, SB 69, SB 79, and SB 105.\n\n**Attendance**:\nNo specific quorum notes provided.\n\n**Adjournment**:\nThe session adjourned, with a rooms meeting scheduled for 9am the next morning.",
  "transcript": "Come on in and take your seats and we'll call the meeting to order\nGot a little housekeeping to do here first. I'd like to hear a move to send Senate Bill 111 to the judiciary committee\nI won't move second any opposition. Okay, it's now in judiciary\nOkay\nI want to call on Senator Govind to explain Senate Bill 79 to us, please.\nThank you, Mr. Chairman and members of the committee.\nThis is Senate Bill 79, the fear act, a fentanyl eradication removal act.\nThis is Lieutenant Govinders' Bill.\nWe made a little bit of what we're doing to strengthen the penalties for fentanyl trafficking.\nAnd the reason that is is fentanyl, as we know the fentanyl epidemic.\nThis is a Splendid packet.\nIt's one gram.\nOne gram of fentanyl killed 500 people.\nWe made some changes in the civil non-Judy house.\nWe took out the portion that was concerning possession\nand kept all the language regarding trafficking.\nIt works.\nIt's just a continuation of our efforts of the Austin's law\nthat Whipershit carried in the house\nlast year trying to address the fentanyl epidemic.\nwell you've heard the explanation or any questions good job senator don't\nsee thank you thank you thank you mr chairman we also have a rules\nsubstitute for Senate bill 69 and we'll recognize Chairman Leveritt to\nexplain the rules substitute to us please thank you mr chairman ladies and\nJim, and this is the second part of the governor's lawsuit\ninformed package you've heard me speak.\nIt linked about it the other day, it came out of the subcommittee\nand then actually came out of the rules committee.\nWe do have two changes, however, to that bill\nthat are in the proposed substitute.\nThe first change is on lines 107 through 110.\nThat's on page five.\nIt just adds a new exception to the operation of the statute\nfor basically someone who is an investor in a company\nthat provides the litigation financing.\nSo the idea is the litigation financier\nstill has to, when they apply, disclose ownership\nthat's over the 10%, so they would be disclosing\nsome of the people who invest in that litigation\nfinancing company, but the investors themselves\ndon't have to actually register under the act.\nSo disclosure of the investment is still required\nby the applicant, by the financier,\nbut the investors, the people who might invest\nin that litigation financing company itself,\ndon't have to actually register under the act.\nAnd then the other changes online,\nI'm sorry on page 12, online 278.\nThis was the provision that would require\njoint and several liability.\nWe've just changed the word shall online 278 to May.\nSo the court would have some discretion\nas to whether to impose that joint\nseveral liability in a given case and that was a Charlie Miller's amendment which we are now\nmaking in this substitute and those are the only changes Mr. Chairman I'm glad to ask any questions.\nOkay you've heard the explanation do we have questions?\nDon't see any? Okay do I hear a motion to approve rules substitute to Senate Bill 69 as LC\nthe 49, 23, 9, 4, S, have a motion and second is in the opposition, okay, it's approved.\nOkay, now what we want to do is set a supplemental calendar for today under modified structured Senate\nbill 40, have a move in a second in the opposition, it's on Senate bill 56, move in the\nsecond in the opposition, it's on Senate bill 69, rule substitute, LC 49, 239, 4S, moved\nseconded in the opposition it's on sent bill 79 moved and seconded in the\nopposition it's on sent bill 105 moved and seconded in the opposition it's on\nokay that'll set our supplemental calendar for today you'll get a notice we'll\nhave a rooms meeting at 9 a.m. in the morning and we'll see you then if not\nThank you.\n",
  "updated_at": "2026-02-12T17:34:50.958072+00:00"
}