{
  "video_id": "KlL9tAaVqiY",
  "url": "https://www.youtube.com/watch?v=KlL9tAaVqiY",
  "title": "08/26/2024 Sen. Islam Parkes Press Conference on the Georgia State Election Board",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 32,
  "summary": "Here is a structured markdown summary of the key points from the Georgia 08/26/2024 Sen. Islam Parkes Press Conference on the Georgia State Election Board session:\n\n### Overview\nThe press conference addressed serious allegations against three members of the Georgia State Election Board - Janice Johnston, Janelle King, and Rick Tafaris. The lawmakers and community leaders claim these board members have violated state laws and undermined the integrity of Georgia's elections.\n\n### Key Actions\nNone detected. The press conference focused on allegations against the election board members rather than specific legislation.\n\n### Bills Introduced (First Reading)\nNone detected.\n\n### Notable Moments\n- Sen. Islam Parkes demanded that Governor Camp investigate the claims against the election board members and remove them from office.\n- Rep. Lucy McBath spoke about the importance of protecting voting rights and democracy in Georgia. \n- Attorney Wayne Kindle detailed allegations that the board members violated the state's Open Meetings Act and ethics laws.\n\n### Votes\nNo recorded votes mentioned.\n\n### Attendance\nNo quorum notes provided.\n\n### Adjournment\nNo adjournment details given.",
  "transcript": "Thank you all for being here today.\nWe gather at a crucial time for our democracy,\nand time when the integrity of our electoral process\nis under serious threat.\nRecently, I filed a formal complaint against three members\nof the Georgia State election board, Janice Johnston,\nJanelle King, and Rick Tafaris, who have violated\nthe very principles they swore to uphold.\nThese violations are not just legal technicalities.\nThey strike at the heart of a democracy\nin the trust Georgians place in our election system.\nThese individuals have taken deliberate actions\nthat interfere with free and fair elections in our state.\nThey voted for rule that allows local election officials\nto delay or even refuse to certify election results\nand action that could plunge Georgia into electoral chaos.\nThis is not just unethical.\nIt is illegal.\nTheir actions undermine the will of the people,\nand we cannot stand idly by while they subvert\nthe democratic process.\nThese MAGA extremists are attempting\nto legalize voter suppression, and we cannot go back.\nMoreover, these board members have been caught illegally\ncoordinating with the Georgia Republican Party\nto advance their partisan agenda.\nThis was done in secret, in violation of the Open Meetings Act, further eroding public\ntrust in our electoral system.\nThey have shown a blatant disregard for the law and their continued presence on the board\nplaces our state, in legal and financial jeopardy.\nThe state election board does not exist to help Republicans win elections or to enrich\nits members.\nToday I stand before you to demand that Governor Camp take immediate action.\nWe need a formal investigation into these claims.\nIt's the least he can do and is obligated to do per our state code.\nAnd then the facts will show that we need to remove these corrupt board members.\nThe people of Georgia deserve leaders who respect the law, uphold the precious and sacred\nright to vote and protect our democracy. Not individuals who conspire behind closed\ndoors to disenfranchise voters. So today you will hear from my house colleagues, community\nand faith leaders from across the state. And as we move forward in this fight, I'm honored\nto introduce a champion of democracy, my congresswoman, congresswoman Lucy McBath, her\ndedication and leadership inspires all and is my privilege to welcome her. Thank\nyou.\nWell good morning and thank you senator islam parks for your kind words and for your\ninitiative. I am so grateful for your leadership and all of the leaders that\nstand with me here, but your leadership in the State Senate, and I always continue to\nstand up and fight with you in Washington, as I know you were doing right here in the\nState of Georgia. And I know, leader Butler could not be here with us today, but I just\nwant to say thank you to her for her tireless advocate advocacy in the Georgia State Senate.\nOur state is undoubtedly stronger and more resilient because of Senator Butler's leadership.\nAnd I'm so thankful that I've been able to see her work up close and to learn from her\ndirectly.\nI'd also like to thank Representative Park, Representative Draper, and everyone who\nis joining us here today.\nThese are phenomenal leaders in the state of Georgia that are standing up and leading\non behalf of our communities.\nThe fight for equal rights is personal to me.\nGrowing up, my father led the Illinois branch of the NAACP.\nI saw up close every single day as he and my mother sacrificed day after day after day\nto ensure that we were treated equally under the law.\nMy parents believed in their shared stake\nholdership over America, that though they had not\nbeen born with the same rights and the same privileges\nas other Americans, they owed their diligence\nand wits to ensure that no American's voice\nwould be left out or left behind in the decision-making process.\nAnd my parents weren't alone.\nCountless Americans marched.\nThey fought.\nAnd they perished to uphold the principles of this nation.\nThanks to all of their efforts, each succeeding generation\nhas pushed the front line forward.\nMake no mistake.\nWhat is unfolding in Georgia is nothing less\nthan a concerted effort to subvert democracy\nand move us backwards.\nIn the last decade, Georgia has seen folks\nlike Raphael Warnock, John Ossoff, and Stacey Abrams\nwork to lay the groundwork and change our state.\nGeorgia made history by sending a Democrat to the White House and not one but two Democratic\nSenators to Capitol Hill.\nThe people of Georgia spoke out.\nWe spoke out against hate, against divisive rhetoric.\nWe stood together to say unequivocally, we deserve better.\nIn direct response, we witnessed something much more sinister.\nWe saw numerous efforts to silence our voices, to silence us at the ballot box.\nRepublicans passed restrictions on ballot access throughout our entire state, making it\nharder to vote, especially in communities of color.\nAnd in 2022, Donald Trump blatantly attempted to reverse the results of our election, something\nwe are used to seeing in dictatorships throughout the world, but not here at home, not here\nin Georgia.\nfederally we've introduced the John Lewis Voting Rights Act to codify\nelection protections into law but those seeking to tear our democracy down have\nworked to stop it at every step of the way. Now here at home here in Georgia the\nGeorgia State Elections Board is becoming an equal co-conspirator in this\neffort to suppress our votes. With passing this new rule, they are creating\nbarriers to counting votes and certifying the elections. So Donald Trump can\nonce again attempt to throw our country into chaos. We are here today to say we\nare better than this. One of the most basic responsibilities of our government is\nto ensure the process of free and fair elections.\nAs Americans, we must defend and protect our democracy to ensure the voices of the people\nare heard, not some voices, but all voices.\nToday I am joining my esteemed colleagues in calling for Governor Kim to hold members\nof the State Elections Board accountable.\nstand up for the rule of law and to ensure that our democratic process is protected.\nHe must not allow our state elections board to be taken over by Donald Trump, because\nif we fail to protect our state democracy, our sacred democracy, we will risk falling\ninto chaos.\nThank you my name is Wayne Kindle I'm an attorney here in the state of Georgia I have the honor and\nthe privilege of coming before you this morning to bring attention to what we consider to be a\ngraven justice perpetrated on the voters in the state of Georgia about three members of the\nstate election board, Janice Johnston, Janelle King, and Rick Jafaris. I have also the privilege\nof standing before you and these elected leaders, community leaders and religious leaders\nto bring attention to what we consider to be several ethics violations about these three\nparticular members who have demonstrated a concerted effort and a desire to be hell-bent\non subverting the election laws of the state of Georgia through these rules and regulations\nthat they have recently passed after election officials have asked them to stop and halt\nwhat they have considered to be a concerted effort to inject confusion and chaos into the\nelection machinery of the state of Georgia.\nFirst we have a violation of the Open Meetings Act whereby these three members initiated\na meeting on July 12th to institute several rules and regulation changes that were given\nto them by the Republican Party of Georgia, which had never been sent through the process,\nthe original and a proper process, which is called for by the Open Meetings Act, which\ninvolves notice of the proposed changes that involved posting of these changes on the\nwebsite and involved sending out notices to all the constituents, including the public,\nAnd other members of the state board of elections, they failed to uphold the laws.\nThe state ethics law requires that all members of board's commissions and authorities should\nuphold the laws of the state of Georgia.\nAnd when members of the state election board taken upon themselves to totally ignore the\nAdvice of Council, the State Law Department,\nwhich advised them that the meeting that they held\non July the 12th was an illegal meeting,\nthen these particular individuals have shown a disdain\nand a desire to violate the law\nthat they should be called upon to resign their positions.\nAnd if they don't resign their positions,\nthen the governor has an absolute duty\nunder the State Ethics Act to act\nto remove these particular individuals from office.\nThree persons, Kathy Willard,\nRandall Mangum, who's a candidate for District 55,\nSenate District Head and State of Georgia,\nand Senator Nabila Islam Park,\nhas called on the governor\nto remove these particular individuals\nfor violations of state law.\nThe Governor should for with act\nto remove these rogue members of his party\nfrom the election board here in the state of Georgia.\nWe call upon him to do so,\nand we call upon him to do so forth with.\nThe law requires him to hold a hearing\nand what has been the practice in the past\nis that he would refer those complaints\nover to the state office of administrative hearings\nfor them to appoint an administrative law judge\nand for that law judge to hold a hearing\nto inquire into the facts and evidence to make a determination as to whether a recommendation\nshould be made to the governor to remove these particular individuals from office.\nWe think that with all of the media attention that has been brought to bear the facts that\nhave been put for the emails that have been uncovered, which indicate that these individuals\nare more or less pursuing an agenda of partisan political motives that they should be removed\nfrom office and should be removed from office fourth with.\nSo we call attention to those complaints.\nWe ask the governor to fourth with go forward and hold a hearing, send this matter over\nto the office of administrative hearings for an administrative law judge to be appointed\nand for these particular three complaints to be heard,\nand to be heard before the November elections,\nso that these particular individuals can stop the chaos\nand the confusion that they are engendering\ninto the election machinery of the state of Georgia.\nThank you.\nAll right, all right, all right.\nAll right.\nGood morning, my name is Sam Park, and I serve\nas WIP of the Georgia House Democratic Caucus.\nAs y'all may know, three pro-Trump anti-democracy members\nof Georgia State Election Board are overstepping their authority\nby changing our election rules.\nAfter Trump praises them, they pass new rules that can enable Trump\nand his allies to obstruct certification of Georgia's 2024 election results.\nOne new rule gives partisan, county election officials more power\nand allows them to delay or block certification\nof election results if they disagree with the outcome.\nThis directly conflicts with Georgia law,\nwhich states that local election officials\nshall perform their duties, making their responsibilities\nmandatory, not discretionary.\nHouse Democrats have urged Speaker John Burns\nto remove Trump-aligned Genelle King from the election board.\nTime is running out, and we've received no response.\nSo now we are escalating our concerns\nby calling on Governor Kemp to investigate\nelection board members, Jeffries, Johnston, and King\nfor potential conflicts of interest, ethical issues,\nand unlawful actions that raise serious concerns\nabout the integrity of Georgia's election administration.\nGeorgia Law grants Governor Kemp the authority\nto investigate and remove election board members\nif they violated the law.\nEven though Governor Kemp supports Trump for president,\nhe should agree Trump should win Georgian's votes\nfair and square.\nAgain, even though Governor Kemp supports Trump\nfor president, he should agree Trump should win\nGeorgian's votes fair and square.\nIn the face of this threat to the fair\nand lawful administration of Georgia elections,\nGovernor Kemp must investigate these members\nand set an administrative hearing as soon as possible.\nAs we know, democracy dies in darkness,\nso thank you to members of the press\nfor highlighting this ongoing attack against our right\nto have our vote counted.\nTo my fellow Georgians concerned about the brazen attempts\nto undermine election administration,\nthe best way to counter these undemocratic,\non American efforts, is to turn out and vote in numbers\nthat leave no room for doubt.\nNow is a time to organize, volunteer,\nand most importantly, vote.\nWe are 70 days away from election day.\nTalk to your friends, your family, your neighbors,\nespecially those who don't usually vote.\nIn the words of John Lewis,\nthe vote is the most powerful, non-violent change agent\nwe have in a democratic society.\nWe have the power to protect our democracy,\none vote at a time, and we must use it.\nWith that, I will turn it over to Representative Saira Draper.\nThank you.\nThank you.\nGood morning.\nMy name is Saira Draper, and I'm a state representative\nfor House District 90 in Atlanta.\nThe Georgia State Election Board no longer\nworks in service to Georgians or in furtherance\nof fair and free elections.\nThis state election board has been taken over\nby far right, MAGA extremists.\nThe new majority is made of Trump loyalists,\npeople willing to ignore the Constitution, fairness,\nand facts, if that means getting Donald Trump back in power.\nTheir strategy is clear.\nThey will continue to make 11-hour changes.\nAnd when something goes wrong, no matter how minor,\nthey will point to the errors as justification\nfor questioning any election results they do not like.\nAnd simultaneously, state election board\nis loudly signaling to their MAGA allies at the county level.\nThey should delay or refuse to certify election results\na move that will inflame passions, that will so distrust,\nand that could even foment violence,\njust as Donald Trump's false claims of a stolen election\nled to an insurrection at the Capitol.\nI want to be very clear about what this all boils down to.\nYou've got three hyperpartisan, unelected individuals,\nexecuting a plan to nullify the votes of millions\nof Georgians if Kamala Harris wins our state.\nWe are talking about a level of mass disenfranchisement\nthat demands immediate action and condemnation\nfrom Georgia's leaders, and yet so far we have been met with silence.\nHere's what I want to say directly to Republican leadership in this state.\nYou got us into this mess.\nNow you need to have the courage to get us out.\nWe would not be in this precarious position with a MAGA election deniers in control of\nthe State Election Board had Republicans not totally\ncapitulated to the far right.\nAnd what do I mean by that?\nRepublicans passed legislation to kick the Secretary of State\noff of the State Election Board.\nThe governor signed that bill into law.\nThe Speaker of the House folded under pressure\nnot to reappoint his former appointee to the State\nelection board, someone who respected the rule of law,\nand he replaced that member with the far rights pick,\ngiving Mag of the majority.\nAnd Republicans have largely remained silent\nas the SEB passes illegal rules,\nas members attend Trump rallies,\nand as they disclose that they have pecuniary interests\nthat can only be realized if Trump wins the presidency.\nGovernor Kemp, you and your party talk a lot about election integrity.\nWell, Georgians know that the highest form of election integrity is allowing election\nresults to reflect the will of the voters no matter what that is.\nThe time to take a stand is now.\nGood morning.\nMy name is Reverend Dr. David Alexander from the Spiritual Living Center of Atlanta and\non Monday when I opened social media feed and read my State Senator, the Bill of Islam\nParks's letter to Governor Kim.\nI knew that we had not just a civil rights issue, a legal issue, but also a moral issue\nbefore us.\nAnd so we crafted a letter, sent it out to clergy across the state, and I'm proud to be\nstanding here today with clergy from across the city and the state behind me on the steps\nrepresenting 97 signatures that have already been added to the letter and the list is growing.\nOur letter that we are delivering to the governor today says this.\nDear Governor Kim, we, the undersigned clergy from across the great state of Georgia, write\nto you out of a deep sense of moral urgency regarding the actions of these members of\nthe Senate election board.\nSpecifically we were requesting the immediate investigation into the actions of the aforementioned\nmembers for violation of their statutory code of ethics applicable to state employees,\nas well as their intentional disregard of the Open Meetings Act.\nAs outlined in the letter your office received from Senator Nebula Islam Parks on August 19th,\nThese violations warrant immediate investigation and corrective action in order to protect\nthe integrity of public trust in our elections.\nOur concerns extend beyond mere legal violations.\nWe believe these actions strike at the very heart of the democratic process and the sanctity\nof the voice of the people of Georgia.\nAs clergy, we are tasked with nurturing the spiritual well-being of our congregations,\nAnd part of this duty involves standing up for justice, integrity, and the protection\nof every person's God-given right to be heard.\nI'm Reverend Misha Sanders, Community Minister and Chaplain in the Unitarian Universalist\nTradition, part two of this letter drafted by my colleagues.\nIn the ancient Hebrew creation story, the word coal is used for voice, the very essence\nof divine communication. That same word in modern Hebrew translates to vote. It is no coincidence.\nWe believe that for people created in God's image, which includes all of us, our voice\nis our vote. When actions are taken to suppress, manipulate, or undermine that voice, it is\nis an affront not only to our democracy but also to our shared moral values and the inherent\nspiritual dignity of all citizens.\nThe behavior of the previously named members of the State Elections Board undermines the\ntrust the people of Georgia have placed in their leaders to administer elections fairly\nand openly.\nOur violations of transparency and ethical conduct see to threaten and hinder the true expression\nof the will of the people and put at grave risk the very integrity of our electoral system.\nGood morning.\nI'm Bishop Sanya, E. Williams of the Fellowship of Affirming Ministries, South Region,\nand also RIM Fellowship UCC here in Atlanta.\nWe are well aware, as you are Governor Kemp, of the high stakes of this election and the\nhigh tensions in our communities.\nThe nation's eyes will focus squarely on the great state of Georgia in November, and\nwe cannot afford even the smallest implication of bias or unjust handling of our citizens'\nmost sacred right.\nWe ask you, Governor Kim, as a leader with the responsibility to uphold the principles of\nfairness and justice to act in defense of our state's democratic values.\nWe request the immediate removal of these individuals from the SEB in accordance with the law\nand in alignment with the moral and imperative to ensure that every Georgian's voice and\ntheir vote and our election integrity is protected.\nIn the spirit of justice and the pursuit of righteousness, we trust you that you will\nconsider this request with the seriousness it demands.\nAnd, serially, Georgia Clergy.\nThis concludes our press conference, and we are also open to any questions that the\nmedia may have.\nThe governor of the office has released a statement during this press conference saying he does not know how to get forward in the past, related to the state election board to best make it a review.\nWe've seen a river of hatred during the office, and we've been in.\nDo y'all believe in that he does have the authority?\nFirst aid code, he absolutely has the authority to convene a hearing.\nAnd there's also precedent on former cases, as well.\nThank you very much.\nI'm Spokane, the Chief of the Render,\nand the Governor of Finland,\nand the Governor, and the Renator offices\non this matter, and the Governor of Canada,\nand the official letters that house that was absent.\nAbsolutely.\nSo with respect to the house side,\nwe sent out the letter last week on August 19th,\nSpeaker Burns office.\nWe have not received any reply yet.\nWhat's the time line for every deadline\nthe government would have made an decision if that was a winery.\nOCGA 4510-4 sets forth the procedure that the governor must follow.\nHe must send a request over to the Office of Administrative Hearings.\nThat office will then appoint an administrative law judge.\nHowever, there is no time frame within the statute.\nThis procedure has been adhered to in numerous other cases prior to this case.\nIt's clear that Governor has the mandatory requirement to send it over to the Office\nof Administrative Hearings for the appointment of a Administrative Law just.\nThe hearing cannot be held before 30 days notice to the persons who are charged.\nCan you give an example of the precedent you're talking about?\nYet as a case out of Spalding County involving Oscar Stokes,\nI know about that case because I'm from Spalding County.\nI read that case.\nThat case occurred several years ago.\nI can't tell you the exact date without looking at the case.\nBut that case involved a very same procedure.\nOscar Stokes was a member of the school board.\nHe was charged with certain ethical violations.\nThe matter went to the governor's office,\nthe governor appointed an administrative law judge\nthrough the Office of Administrative Hearings,\nand that matter was held,\nrecommendation was made to the governor.\nHow much of the issue that you're raising today\nis related to the law and laws that the Republican\nlegislature passed over the last couple of sessions\nthat sort of encourage the kind of voter suppression\nevery suppression that you're describing versus merely asking the governor to do what you call the right thing.\nWell, look, after Trump lost the state in 2020, we saw Republicans in the state legislature pass law after law taking bipartisan local election boards and making the majority Republican.\nWe had never done that before, and now with these new rules, it has set up an unfair advantage\nfor the Republican Party if they choose to do so to delay or deny certification of county\nelection results.\nAnd so this has just been a slow process, a death by a thousand cuts, and we are standing\nhere today to object to that and demanding that the governor take action and remove these\ncorrupt election board members.\nThat's a good question. These changes that have recently been made were made after persons\nwho are candidates for office qualified to become candidates for office. That's a good\nThe good question is as to whether or not these changes can even apply to those persons\nafter they have basically set forth their course of action to around for office and then\nthe rules of the game are changed after they became candidates to that particular office.\nThat question is a good question and I have to be answered by a court probably that would\nbe an injunction file that will seek to keep these rules from going into effect at the\nlast minute.\nIn fact, the Attorney General, excuse me, the Secretary of State has indicated that these\nrule changes are misguided, they're being implemented by individuals who are unelected bureaucrats\nwho have no election experience and who refuse to accept the advice of people who do.\nSo there's a good question as to whether or not these rule changes, some of which violates\nthat existing state law should ever be considered in the first place.\nSo that's some questions there.\nThat's a good question.\nWe'll have to answer that through the courts.\nSo look, I mean I think what we're calling for is a lowering of the temperature right now\nto call out these extremists who want to go beyond the law\nand bring them back within the confines of the law.\nAnd what's going to happen is if we don't do that now\nbefore temperatures are even more heightened,\nwe're going to get to election night,\nand one side's going to be very upset,\nand one side is going to be very, very happy.\nAnd we're going to have even more divide\nin between the two factions that are in Georgia.\nThat will get evil worse.\nThat will be exacerbated if we get\ninto these election certification delays, right?\nIf we start calling into question the result of the election,\nWe saw that plainly in 2020.\nIt will exacerbate divides that already exist.\nSo we need the governor and Republican leadership\nto step up to be the adults in the room,\nto call out these extremists and tell them\nwhat they are doing is wrong.\nAnd if they want their candidate to win,\nthen he has to win fair and square.\nThat's what we need.\nAll right, well, thank you so much.\nThat's it for questions.\nWe appreciate you being here.\n",
  "updated_at": "2026-02-12T19:11:26.746998+00:00"
}