{
  "video_id": "KlvCsLa4l5A",
  "url": "https://www.youtube.com/watch?v=KlvCsLa4l5A",
  "title": "1/23/2024 Senate Committee on Education and Youth",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 24,
  "summary": "Here is a structured markdown summary of the Georgia 1/23/2024 Senate Committee on Education and Youth session:\n\n### Overview\nThe session focused on two notable bills related to education funding and school choice. Key actions included passing bills to allow impact fees for fast-growing school districts and introducing a constitutional amendment to enable those impact fees.\n\n### Key Actions\n**SB 147**: The Boundless Opportunities for Georgia Students Act, which would allow students to seek public education options outside their home district.\n**SB 208**: Enabling legislation for a constitutional amendment (SR 189) to allow counties with fast-growing school districts to levy impact fees for capital construction.\n**SR 189**: Constitutional amendment to allow counties with fast-growing school districts to levy impact fees for capital construction.\n\n### Bills Introduced (First Reading)\nNone noted in the transcript.\n\n### Notable Moments\n- Senator Dolezal provided detailed explanation of the impact fee legislation and the rationale behind it.\n- Committee members asked questions about the potential impact and reach of the impact fee bill.\n- Senator Steele reintroduced the Boundless Opportunities for Georgia Students Act.\n\n### Votes\n- SB 208 (impact fee enabling legislation): Passed unanimously.\n- SR 189 (constitutional amendment for impact fees): Passed unanimously.\n\n### Attendance\nNo specific quorum details provided.\n\n### Adjournment\nAdjourned after considering the bills, with no next session date mentioned.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThere's no comments or questions. I would look for a motion. Motion do pass. We have a second.\nAnd it's LC number one seven two seven four seven two seven two eight yeah\nlittle rusty and flip to the wrong page there we go thank you it's LC\nNumber 472728S.\nAll in favor, raise your right hand.\nAny opposed?\nBill passes unanimously.\nMoving on to SB 208.\nThat's Senator Dolezal.\nThank you, Chairman.\nWe have a central QA, which is an enabling legislation\nfor Senate Resolution 189, which we'll take up next.\nwhich would be a constitutional amendment to allow counties in fast growth,\nI'm sorry, boards of education in fast growth school districts to choose to\nlevy impact fees for capital construction.\nSenator Still and I both represent for\nSouth County, which is the fastest growing county of the state.\nAnd we have seen significant burden placed on taxpayers to essentially fund\nthe new construction of capital projects for schools.\nWe currently in law allow the collection of impact fees for roads, for park and wreck,\nfor libraries, for 911 and fire, but we do not allow the levying of impact fees for schools,\nwhich is oftentimes the largest expense borne by a community that is fast growing.\nHigh schools now are pushing AD to $100 million a piece.\nSo, if you're not familiar with the impact fee laws in the state of Georgia, this comes under those,\nBut it's quite the process to, if your municipality to get to levy and impact fee, you have to form an impact fee committee.\nIt has to be made up of largely members of the development community.\nThey make a recommendation after a study is done.\nAnd then essentially the county, and in this case the Board of Education, can levy up to new developments, pro-rata share of the bird and their placing on the infrastructure.\nSo, when it comes to the types of things that we have fees or taxes around, this is probably\none of the most fair ways that we collect revenue in the state of Georgia because it's\ndirectly tied to studies and has limits on them such that they are only funding their\npro-radar share.\nOne thing that I think is worth pointing out in the enabling legislation, this is not\na statewide mandate.\nThis would only apply to fast-scrolling school systems.\nThe key to that is on line 41 to 45.\nWe have two separate triggers of what defines a high growth system and needs to have had\na 20% or more growth during the immediate 10-year period, which right away limits the vast\nmajority of school systems in the state, and then the second one narrows that and\ntailors that even further to those that have had expenditures of $250 million or more\nof capital construction during the same proceeding 10-year period.\nSo with that, Mr. Chairman, I'm happy to answer any questions.\nDo you appreciate the committee passing this out last year?\nAnd hopefully we can do the same today.\nAny questions, comments for the author?\nGo ahead.\nThank you.\nThank you, Mr. Chairman.\nSenator, how many districts across the state with this impact?\nAnd second question, did the school boards\nask for this because you're using it based on\npopulation of that particular county, right,\nor school district.\nGrowth of the district, yeah.\nGrowth.\nCorrect.\nOkay.\nSo we can't do population bills, as you know.\nSo this looks at those systems\nsort of having hyper growth and hyper capital outlays.\nTo answer your question, my home district\nof Forsyth County, the Board of Education Pass,\nyou now have this resolution in support of that,\nthey actually came and testified.\nThe first time that we heard this last year,\nI know that the chairman I've had a conversation,\nthis is something that Gwyneth some districts\nwithin his area are interested in,\nI know Cherokee County, his express interest in this,\nI know Henry County, his express interest in this as well.\nWe really only have a couple pockets in the state\nthat are growing that much and spending that much money,\nso this will be pretty narrowly tailored to just those.\nI'm not worried, Savway's joy.\nWe're shrinking with that, we're hoping to get you the point\nwhere you need this one day.\nI'll be dead and gone.\nThat's how I'm feeling.\nI should not say that.\nBut so only a few, have you had any feedback\nfrom any of these counties that may be included\nor have they come to ask for your assistance with?\nWe were saying like if we were to broaden it\nand make it apply to more.\nNo.\nThe ones I mentioned before have all either one off\nor collectively as a collective board\npassed resolutions in favor of it.\nBut you've not had any negative responses\nfrom those potential.\nCorrect.\nThe only negatives that I've heard,\nI think we heard testimony of this,\nwas from some developers and some members\nof maybe the apartment association.\nI think may have came and testified against this\nif my memory serves correct.\nBut I don't know if you caught this the first time I said,\nI think it's worth saying it again.\nI was part of the formation of road impact fees\nin Versailles County back in 2015.\nI was appointed to a commission\nby a county commissioner to look into that.\nBut that committee had to be made up\nof at least 50% members of the development community.\nSo the resolution that we passed\nwas essentially the people that worked\nin the development community,\neither developers, road builders, home builders, et cetera,\npast a resolution in favor of impact fees for the roads because they basically said look\nwe got to fund this infrastructure we're going to kill the golden goose.\nAnd so it creates this tension that ultimately tends to usually not land at the maximum\nout that would be allowed in a lot of be charged but usually falls somewhere underneath\nthat but does still provide a revenue stream to fund capital construction to ensure that\ninfrastructure keeps up.\nBut this is something we see in a number of states around the country that allow local municipalities to pull that lever if they wish to pull it.\nThank you.\nAny further questions or comments?\nAnd I've seen this Senator Sims even in surrounding counties to my home county where they've had to put zoning moratoriums and other things in place.\non schools that come in just because they, you know, completely run out of room to put\ntrailers in and move students around, so it would become the real issue in Metro Atlanta.\nWith that, if there's no other comments or questions, would entertain a motion?\nI'll make a motion to pass.\nSecond.\nAll in favor, raise your right hand.\nPasses unanimously.\nnext LC-49-1280.\nMoving on to SR-189, it's also Senator Dolezal.\nAnd this is just a constitutional amendment to put this on the ballot to allow the voters\nof Georgia to decide whether we should allow the collection of impact fees for schools.\nAny comments or questions from the committee?\nSeeing none, would Chair would entertain a motion?\nWe've got a motion in a second.\nAll in favor, raise your right hand.\nMotion passes unanimously.\nMoving right along to SB 147, Senator Steele.\nI'm going backing up to the previous one, the LC number on that was LC 491675S.\nNo backing up to the previous one, it was LC 491327, now you're all set to go to the\nsenator\nWe had to make sure we had the right LC number, which we do.\nThank you, Mr. Chairman, fellow education committee members.\nI come to you today to bring again for your consideration SB 147,\nthe Boundless Opportunities for Georgia Students Act.\nLast year, as you can recall, this bill received passage in this committee and\nin Senate rules did not make off the Senate floor table prior to crossover.\nBring this on behalf of my constituents in Fulton, Quinnett, and\nForsyth, which I share with three of the folks here on this committee.\nThis legislation is simple, it allows toward families to seek the best public education options for their child.\nA child zip code should not be the deciding factor in determining their future.\nThat's why this bill is called boundless opportunities.\nCounty and Sydney boundaries should not determine educational opportunities or outcomes for our students.\nThis is particularly true in Metro Atlanta, where moving even one block can place a child in a different school system without the parent ever realizing it until they go to register.\nfor the upcoming year and discovered their student\ncan no longer attend the same school.\nCurrent law says that a school or school district\ncannot receive state funds for a non-resident student\nunless the residency district permits it.\nThis bill simply clarifies these important\noften life changing decisions regarding a child's\neducational future should be left up solely\nto the discretion of the family and the enrolling district.\nIn other words, the district of residency\nshould not be able to hold a child hostage\nand refuse to allow state funds to transfer with the student.\nThere are several things this bill does not do.\nIt does not take any money out of the public system.\nIt does not take any money from a local school system.\nAll local property tax revenue, including the amount paid by the student's family will\nremain in the residency district.\nIt does not leave the residency district worse off.\nThe bill before you ensures that no money will be transferred if it would result in a residency\ndistrict being left with less than $10,000 per student.\nthat's the floor is $10,000.\nIt also includes a cap on the tuition\nthat can be charged by the enrolling school district\nfor providing only virtual instruction.\nThis is a small but important step to empowering students\nand parents who should be the primary decision maker\nwhen it comes to their education.\nRight now, a parent's public school options in many areas\nof the state are limited unless they\nhave the resources to move to a higher performing school\ndistrict or pay for private school.\nIn discussing this bill in the off season with my local delegation, which I share with\nSenator Dolezal, I've learned that Forsyth County's highly successful virtual program is\nnow available to enroll out of district students if this bill receives final passage.\nThis would be a game changer for students in other regions of the state who currently\nhave little or no educational options other than Georgia virtual.\nIn closing on a reiterate, this bill is a win-win.\nIt keeps public money in the public education system.\nWhile also giving parent a greater voice in determining the best school for his or her child regardless of residency or zip code.\nThank you, Mr. Chairman, and I'm willing to take any questions.\nAny questions, comments from the committee?\nNo number three.\nThank you, Mr. Chairman.\nThank you, Senator, for bringing this bill.\nI was in a, we had our pre-legislated breakfast, and I remember hearing how excited our superintendent\nwas over this bill, and I'm wondering if you could maybe just give us an example.\nHypothetical example, you know, Johnnie's in South Georgia, maybe they don't have a great\nSTEM program.\nForsyth County's got one of the best in the state.\nJohnnie wants to enroll virtually in Forsyth's STEM program.\nWhat happens in terms of flow of funds and what would happen should this bill pass?\nThank you for the question, Senator.\nLet's take a full spreadsheet of every county here.\nLet's take Clayton County, just going off an example here.\nClayton County receives on their FTE local $3,463.\nTheir FTE state is $6,942.\nTheir equalization is $1,064.\nSo the total cost to educate that child\nbetween state, federal, and local dollars\nis 10,406 and 50 cents.\nBecause of the $10,000 floor on this,\nthe family would be able to use $406 and 50 cents\ntowards the total cost of that full-time virtual transfer\nleaving $10,000 in the residency district.\nAnd there would be no additional expense\nto educate that child.\nand then the family would still have\nto cover the difference on that,\nbut at least it's giving them a small amount of money\nto use towards that virtual transfer.\nThank you.\nThank you.\nAny further questions, Comments?\nYes, sir.\nQuestion.\nGo ahead, Senator Sims.\nOkay.\nThank you, Mr. Chair.\nOkay.\nSo how do we, give me again,\nHow do we determine the validity of the transfer of the students with the tax dollars,\nwith the money flowing with them?\nHow do we make that determination?\nWho makes that determination and how do we do it?\nThe receiving district sets the tuition rate.\nThe residency district superintendent and the receiving superintendent would have to\nagree on that so there still have to be an agreement between them on that and then nothing\nwould transfer below. So if we were to use an APS as an example where it's over $20,000\nto educate a child compared to less than 10,000 in Forsyth County with drastically different\noutcomes. The tuition fee would still be set. Superintendents, superintendents. So if\na child wanted to transfer from APS to, again, just using foresight as the example, if\nthat number was, say, $5,000, then only $5,000 would be transferred out of that equalization.\nSo if a parent comes to the district and says, I want to be transferred based on the formula\nthat you gave me. And also based on the scores, what are you going to use to say what's good\nand what's bad? Are we using test scores? Because you're saying that they are transferring\nfrom a low-performing school or not necessarily. They're just anywhere they want to go.\nwhere they want to go.\nAny further questions, comments?\nSenator Settler.\nAnd to the author, is this limited to online learning, or can this be a bricks and mortar\ntransfer?\nThis is just a virtual.\nVirtual only.\nYes.\nOkay.\nOkay.\nSo in that, which makes it simpler and gig, okay.\nIs the, does the language you've added online, 75 through 79, that limiting language, is\nthat, does that exist anywhere else in code, I mean, is that, is that limiting to a certain\npercentage, I'm on 1675S, the charge to extrude shield non-exe 2 thirds, just explain what\nthat means, I'm just trying to understand.\nIt's just essentially saying that we're not going to drop\nbelow the $10,000 threshold on the floor.\nSo there's always going to be an amount left behind\nof the residency district.\nWhat we don't want to do is cripple low-perform to the\ncenter sense point.\nI don't think we want to do anything to take the local\ndollars out.\nAnd so this is just saying that the amount of the tuition\nsuch local unit of administration may charge,\nshall not exceed two thirds of the total revenue.\nLess the federal, it's just giving us a formula\nto work off of on the federal dollar contribution.\nOkay, so the receiving district can't chirp some premium.\nIt's gotta be essentially take the $10,000 out\nor whatever that amount is.\nAnd then it limits what they can charge.\nSo they're not asking for, you know,\nfor example, if the students,\nI'm district or in $14,000 you keep $10,000 behind they have $4,000 to bring with them the receiving district can't charge them 10,000 to get in\nBecause you're correct. It's it's putting some limits on where they can go without okay\nThank you. That's all right\nAny further questions\ncomments\nChair would entertain a motion\nWe've got a motion and a second due pass all in favor, raise your hand.\nAny opposed?\nPasses four to two.\nAnd as all we have on the agenda today, I think this is probably the quickest education\ncommittee hearing I've ever had and probably ever will have with these bills that already\npassed through, but with that we are adjourned.\nYou\n",
  "updated_at": "2026-02-12T19:47:21.940608+00:00"
}