{
  "video_id": "KMNFRisz5i0",
  "url": "https://www.youtube.com/watch?v=KMNFRisz5i0",
  "title": "Georgia Senate 2026 - Day 7 PM Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 7,
  "video_date": null,
  "duration_minutes": 109,
  "summary": "Here is a summary of the Georgia Senate 2026 - Day 7 PM Session:\n\n**Overview**:\nThe session included the introduction of several new bills, reports from Senate committees, and procedural matters. Notable was the suspension of a rule to allow assignment of a gubernatorial appointment to a committee.\n\n**Key Actions**:\n- **SB 411**: Bill to amend Title 43 related to professional services\n- **SB 412**: Bill to amend education code related to Part 4 of Article 17 of Chapter 2 of Title 20\n- **SB 605**: Bill introduced (first reading)\n- **SR 605**: Resolution introduced (first reading)\n\n**Bills Introduced (First Reading)**:\n- SB 411-420, SR 584, SR 593\n\n**Notable Moments**:\n- Suspension of Senate Rule 3-3.1A to allow assignment of a gubernatorial appointment to the Judicial Qualifications Commission\n- Morning devotion led by the Rules Committee Chairman\n\n**Votes**:\nNone recorded.\n\n**Attendance**:\nThe Senate granted unanimous consent to excuse several senators from the session.\n\n**Adjournment**:\nThe transcript does not include the time of adjournment or the date of the next session.",
  "transcript": "Good afternoon, the time for convening has arrived, the Senate will come to order.\nAt this time it will ask all one authorized personnel to exit the chamber.\nI recognize the senator from the six from the great town of Noon in Georgia.\ngood afternoon, Mr. President. Sorry we missed you yesterday, but thank you\nfor keeping us on time, keeping us running. Mr. President, I got a great\ngroup of pages here today. Out of Brazlton, we have Elisa Bodine. Out of\nDeCula, we have Addy Grace Card, out of Millageville,\nAlexander McMillan, and out of Perry,\nwe have Nights and Walker, who has our very own\nPresident, Protem's nephew.\nI hope the Protem knew his nephew was here.\nPaging Protem.\nMr. President, the journal has been read\nand found to be correct.\nI move, we dispense, with the reading of the journal.\nThere is objection to dispensing of the reading of the journal.\nno objection. The reading of the journal is confirmed.\nIt is their objection to the confirmation of the journal of Legislative Day 5 and 6.\nChair here is none and the journal is confirmed.\n1st reading references, 6th year, Senate Bill 411 by Senator Still of the 48th and others.\nA bill to be entitled an act to amend Title 43 of the official code of Georgia annotated, related to the services.\nSenators, is Senate Bill 412 by Senators Hickman of the Fourth and others.\nA bill to be entitled to an act to amend Part 4 of Article 17 of Chapter 2 of Title 20 of the Official Code of Georgia, Annotated Senate Bill 411-413 by Senators Jackson of the 41st and others.\nA bill to be entitled to an act to amend Article 3.\nSenate Bill 414 by Senators Jackson of the 41st and others.\nA bill to be entitled to an act to amend Part 2 of Article 15 of Chapter 1 of the Fourth.\nSenate Bill 415 by Sen. Stickerson of the 21st and others.\nA bill to be entitled and act to amend Article 4 of Chapter 2 of Title 26 of the Official Code of Georgia Annotated Relay Culture.\nSenate Bill 416 by Sen. Halpern of the 39th and others.\nA bill to be entitled and act to amend Part 2 of Article 15 of Chapter 1 of Title 9.\nThe economic development.\nSenate Bill 417 by Sen. Merit of the 9th and others.\nA bill to be entitled and act to amend Chapter 19 of the government.\nSenate Bill 418 by Sen. Burns of the 23rd and others.\nBill.\nState and low government general.\nSenate bill 419 by Senator James of the 28th and others.\nBill to be entitled to an act to amend chapter 8 of Title 35.\n418-418.\nI don't stop here.\nHow do we start?\nI'll start with 418.\nSenate bill 418 by Senator Burns of the 23rd and others.\nBill to be sent.\nSenate bill 419 by Senator James of the 28th and others.\nBill to be entitled to an act to amend chapter 8.\nI'll decide to.\nSenate Bill 420 by Senator Eccles of the 49th and others.\nA bill to be entitled to an act to amend Code Section 27-2-23 of the official code of Georgia Anatine.\nI'm a development.\nSenate Bill 421 by senators, cap of the 38th and others.\nA bill to be entitled to an act to amend Chapter 80 of Title 36 is the official government general.\nSenate resolution 5A4 by senators Eccles of the 49th and others.\nA resolution to ratify amendments to a certain comprehensive statewide water management.\nSenator Resolution 593 by Senator James of the 28th, a resolution honoring his most eminence\nprophet, Dr. Emmanuel Adawale.\nRules.\nMr. President, that can we see order?\nSecretary, report, sustaining committees.\nMr. President, the Senate Committee on Ethics has a head.\nMr. President, the Senate has received a communication from the Governor\nrequesting that the Senate confirm the following appointment to the Judicial Qualifications Commission.\nThe Honorable Richard Hyde, the communication has been placed on each Senator's desk.\nThank you, Mr. President, that could be the order.\nRecognize the pro-tum.\nMr. President, I ask unanimous consent to suspend Senate Rule 3-3.1A to allow for the\nassignment of the appointment to the Judicial Qualifications Commission.\nAll right, that communication has been placed on your desk.\nSenator should have that, and Senator Walker, excuse me, the pro-tam has moved.\nDo you like to, do you wish to speak to the motion, Senator?\nHe waves his objection to the motion.\nSenator from the 20th to the As Humanities can consent to spend the rules of 331 to allow for the assignment.\nthe appointment to the Judicial Qualifications Commission, his\ntheir objection, hearing none, the rules are suspended, and the\nappointment is further to the Committee on Assignments.\nIt is now time for the morning roll call.\nSecretary Ree reports the standing committee's first.\nMr. President, the Senate Committee on Ethics has had under consideration the following legislation as instructed me to report the same back to the Senate with the following recommendation.\nSenate resolution 563 do pass, respectfully submitted by Senator Watson of the 11th district.\nDear Mr. Secretary, pursuant to Senate rule 2-1.6, I hereby give notice that will introduce\na minority report to be read along with the majority report of Senate Resolution 563,\nwhich was passed by the Committee on Ethics on January 22nd, 2026.\nSincerely, minority leader Harold V. Jones, the second of the 22nd.\nMr. President, the Senate Committee on State and Local Government Operations has had\nunder consideration the following legislation has instructed me to report the same back\nBack to the Senate with the following recommendation.\nSenate Bill 407, do pass, House Bill 896, do pass.\nRespectfully submitted.\nSenator.\nDixon of the 45th.\nThank you, Mr. President, that's the police's order.\nHere's now time for the morning roll call.\nAll senators, who is to make a motion to excuse.\nSenator from the 50th, 41st.\nThank you, Mr. President.\nI ask for unanimous consent to excuse the senators from the 9th, the 43rd, the 34th,\nThe fifth, the 55th, 36th, 7th, and 17th.\nAnd 33rd.\nYou know, Senate and I lost count there at the beginning\nright there, so I wasn't expecting the whole roster\nto be out today, so let me repeat it back to you.\nThe 41st, which is at the 9th, the 43rd,\nthe 34th, the 5th, the 55th, the 36th, the 7th,\nthe 17th, and the 33rd, be excuse, is that correct?\nMr. President, I'm from the 41st, and I am here.\nWell, we won't excuse you then.\nThank you, Senator.\nAny other motion to excuse?\nSecretary, we'll call roll, Senator.\nSignify your presence by voting the A switch.\nSecretary, I'm not a machine.\nYou\nYou\nYou\nIt is now time for the morning devotion afternoon devotion.\nAll senators, please take your seats and cease all conversation.\nI would ask that the doorky rescuer the chamber at this time.\nI'd like to recognize our rules chairman, the purpose of leading us in our pledge and\nintroducing our chaplain of the day.\nThank you, Mr. President.\nPlease join me in the pledge of allegiance to our nation's flag.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands, one nation under God, indivisible, with liberty and justice for all.\nAnd now our Georgia flag, I pledge allegiance to the Georgia flag, to the principles for\nwhich is hence wisdom, justice, moderation, and purge.\nLadies and gentlemen, I've got a treat for you today.\nI've got Pastor Chip Gordon with me.\nChip lives right around the corner for me, and I get to see him very often,\nbecause he's out walking, and I'm not out walking,\nbut I am out driving in my car a lot as y'all can relate to.\nbut when I do walk I'm usually not very happy and when I see Chip and I see Joe\nEllen his wife when I see them out walking they're both very happy and it just\nkind of makes me feel happy and but Chip has a very rewarding job. He works at\nCity of Hope which is formerly known as Cancer Treatment Centers of America\nwhere he is the director of pastoral care.\nHe was instantly impressed by them in their mission.\nHe knew right away that he wanted to be a part of the team.\nAnd since it was purchased,\nhe has continued to serve patients,\ntheir caregivers and the staff.\nAnd he has done that for the past 15 or 13 years.\nHe earned a master divinity from Southwestern Baptist Theological\nSeminary in Fort Orch, Texas.\nand a bachelor's degree in communications from,\nI don't like to say it,\nAuburn University.\nThrough, excuse me, it's making me cough.\nThroughout his more than 30 years of ministry experience,\nhe has served as a youth pastor and senior pastor\nfor various churches in North Carolina, Alabama, and Georgia.\nHe served as an North American Mission Board church planter,\nplanning a church in Henry County, Georgia,\nat the time one of the fastest growing counties in the US\nserved on many local boards in Caledity County.\nHe's born and raised in Noonan,\nand he met his wife, Joe Ellen, at Auburn University.\nShe is a retired mathematics teacher at Noonan High School,\nmy alma mater, and Chip and Joe Ellen have two daughters,\nKatie and her husband, Hunter, Abbie and her husband,\nAndrew and four incredible grandchildren,\nwith one more on the way.\nSo y'all give a warm Senate welcome to Reverend Chip Gordon.\nWell, thank you, Senator Brass and Lieutenant Governor Jones.\nWhat a joy to be with y'all this afternoon.\nAs I begin, I would like for you to look around\nat the people around you, just the people near you.\nLook around.\nThey don't look like you, they don't talk like you,\nthey don't act like you, they don't have your background.\nWe are all different.\nI love the fact that God knit each one of us together.\nWe are fearfully and wonderfully and uniquely made.\nNow we may not always agree with one another,\nbut one thing you can agree on is that you are here\nto serve this great state and what is to do what is best for the state of Georgia.\nAnd today I would like to talk about unity and peace.\nWe are told in Psalm 133 1 how good and pleasant it is when God's people live together in unity.\nRomans 14, 19 tells us, let us therefore make every effort to do what leads to peace.\nWhen you stop to think about it, you are either a peacemaker or a troublemaker.\nYou might want to ask yourself, am I a spoon in the bowl of discontent?\nDo I stir others up?\nWell, friends, peacemaking is not always popular.\nUnity is not always popular.\nSome people prefer to fight for what they believe in.\nIn a battle, the hope is winning, but someone must be the loser.\nPeace-making and unity actually produces two winners.\nPeace-making is God's way.\nThe Apostle Peter wasn't known as a peacemaking kind of guy when we first meet him.\nIn fact, when we first meet Peter, he was impulsive and strong-willed, but Peter changed,\nand he developed some good qualities the hard way.\nThe Holy Spirit changed Peter.\nPeter was now a man that God could use.\nListen to what it says in 1 Peter 3, verse 8,\nFinally, all of you be like-minded, be sympathetic, love one another, be compassionate and humble.\nPeter lists five characteristics, things we should strive for in order to maintain peace and unity.\nWe should first be like-minded.\nBeing on the same page, having the same goals, it does please the Lord when we have unity.\nYou all agree that you are here to serve the people of Georgia, right?\nOkay, hopefully so.\nThe second characteristic Peter talks about is sympathetic, being\nresponsive to the needs of others.\nAnd then thirdly, love one another.\nWe must look at others and treat them as brothers and sisters.\nIn fact, John 1334 tells us, a new command I give you,\nlove one another as I have loved you,\nso you must also love one another.\nThe fourth characteristic that Peter talks about\nis that of being compassionate.\nEverybody needs compassion.\nWe all need compassion.\nAt City of Hope Cancer Center,\nwe want to show compassion through\nhow we say what we say to our patients.\nand sometimes that involves holding their hand,\nmaybe even giving them a hug.\nWe all need compassion and let me tell you,\nif you have not had a hug today,\nyou come see me after I'm finished\nand I'll give you a hug, okay?\nShowing compassion.\nAnd then that last characteristic\nthat Peter talks about is humility, being humble.\nColossians 312 says,\ntherefore as God's chosen people,\nholy and dearly loved,\nclothes yourselves with compassion,\nkindness,\nhumility, gentleness, and patience.\nFriends, ask yourself, how can I be a peacemaker?\nHow can I help establish unity, not just as a senator\nin the state of Georgia, but in all areas of my life?\nUnity and peace do not come about by us just sitting\nand not putting forth any effort.\nToo often we think of peacemaking as a passive role,\nsimply the absence of conflict.\nBut that is not the case.\nYou and I must work at peace.\nWe must strive to have unity.\nPeter was quoting David in Psalm 34\nwhen he wrote in 1 Peter 3.11,\nseek peace and pursue it. We are all different. Are you going to always agree? No. But when\nwe seek to live out these characteristics that Peter shared in First Peter 3.8, it will\nmake a difference and it will bring about unity. Will you pray with me? Lord, I humbly\ncome before you this afternoon and I ask your guidance on this Senate. I pray for each\nlady and man present that you will guide them in all that they do. Protect them, strengthen\nthem, encourage them as they seek to live lives of peace and unity. I pray they will be\nlike-minded, sympathetic, they will love one another, be compassionate and humble. Bless\nthem today in Jesus' name. Amen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nAll right, if I could have your attention, I want to call upon the senator from the 41st\nto introduce our doctor of the day.\nThank you, Mr. President, it's good to see you up here.\nIt's my honor today to introduce to you all, our doctor of the day, or really introduce\na few of you all and welcome back to so many.\nHe's been here a number of years, but this is Dr. Daniel Lopez.\nHe's a board-certified family medicine physician with the Kaiser Permanente Group and provides\ncomprehensive care to diverse groups of clients, of patients, focusing really on prevention\nand management of chronic medical conditions and their complications.\nDr. Lopez, he's been here a number of times over the years,\nso hopefully you've gotten to know him.\nIf you haven't, of course you can go see him\nor Narsjulia downstairs.\nHe is the proud father of triplets.\nThey're now 15 years old, so he gets more sleep than I do,\nand I'm grateful for that for him.\nHe enjoys running, mountain biking, hiking,\nand the North and Biturge of Mountains,\nand practicing yoga.\nWithout further ado, I introduce to you all Dr. Lopez.\nThank you.\nGood afternoon.\nIt's always an honor and a pleasure to come back to the House of the People and serve\nour youth serving.\nAs you know, I'm a proud member of the Permanente Medical Group for more than 13 years and we are\ncurrently celebrating our 40th years in Georgia, serving Georgia communities and Georgia\npatients.\nThe permanent medical group is a unique, you can check a unique model of healthcare delivery\nsystem that probably can tell you we have the highest quality in patient care in Georgia,\nthe highest patient satisfaction scores and also as well, one of the highest Medicare\nratings.\nWe have the largest medical group in the state that is physician-owned, physician-managed,\nWe work for our patients, no for the insurance company.\nBut I just want to leave you with a little gratitude and I wish you a healthy and productive\nlady's sessions.\nWork for us.\nFor doctors like me that want to use to practice medicine with barriers.\nAnd work with our worries that you run into the medical problems.\nYou're going to be a very good hands.\nThank you.\nThank you very much.\nAll right, we have a very special guest with us in the back.\nSenator Shelley Eccles is with us today, so welcome back.\nWe also have some other special guests today, the Secretary will read a resolution.\nSenate resolution 581 by Senator Sigmund of the Fourth and others, a resolution recognizing\nJanuary 27th, 2026 as reach out and read day at the state capitol to recognize the power\nof reading to young children every day and for other purposes.\nWhereas over 1,000 medical providers and staff have been trained in evidence-based early\nliteracy intervention programs of the reach out and read Georgia program, offering each\nchild an opportunity to be read to and to learn to read.\nWhereas, over the past 12 months, 388,516 well-child checkups,\napproximately 194,258 children and families were conducted across Georgia\nwith pediatricians and providers implementing the Reach Out and Read program.\nAnd whereas, Reach Out and Read is the only early literacy intervention endorsed\nby the American Academy of Pediatrics and has the most extensive body of research\nsupporting the efficacy of the program model with 26 studies supporting its work.\nAnd whereas, now therefore be it resolved by the Senate that the members of this body\ncommend the efforts of reach out and read to give young children a foundation for success\nby incorporating books into the existing pediatric care infrastructure, encouraging families\nin Georgia to read aloud together each and every day and recognize January 27th, 2026\nas reach out every day at the state capitol.\nThat completes the order.\nAll right, the Secretary has read the resolution.\nIs there objection to the adoption of the resolution?\nThe chair here is none, and the resolution is adopted.\nI'd like to call upon the Senator from the fourth district to introduce our special guest.\nThank you, Mr. President.\nExcuse me, Mr. President, colleagues.\nI'm very honored today to introduce Ms. Amy Erickson,\nwho is the executive director of Rich Out and Reads,\nMs. Carolina Clinker, program director,\nMr. Cedric Forbes, over here, is the development director,\nKim Thomas, program director,\nand Leslie Vessel, program director.\nToday is Rich Out and Reads day at the Capitol.\nThe mission mindset and strong business acronym\nreflect a deep commitment to the belief\nthat we must be bold in how we support\nGeorgia's youngest children.\nI also recognize her team, which I just did who are standing before you for their service to families across the state.\nThe powerful role Peter Attrade care plays in preparing children for success and school and life.\nThe books on each of your desk and you have two of them and please take them home.\nThe books on each of the next layers of death today are meant to be shared with the child because reading opens the world to possibilities.\nI'm proud that last year, the General Assembly,\nmade its first direct investment in Reach Out and Read, Georgia.\nAnd we hope to build on that.\nWe must invest in early interventions that are evidence-based\nand scalable to support Georgia's younger children\nin the earliest days and stages of development.\nAmy, we have for you a resolution signed by the Lieutenant\nGovernor dedicated today at Georgia Reach Out and Read's Day.\nSo if you would please ask them to come in.\nThank you so much, Senator Hickman.\nFor your long standing advocacy and leadership in Georgia.\nThank you also to every member of the Senate who is here today.\nFor your tireless efforts advancing outcomes for all of us in Georgia.\nThis is such an incredible personal moment for me right now.\nI've been with the organization for 13 years and for 13 years.\nI wanted to stand before you and advocate personally for the mission of Reach Out and Read.\nSo thank you so much for that opportunity to do that today.\nWe received our first line item last legislative session and we know that there's much more room to go.\nWe are located in 84 counties across the state and we need to be in all 159 counties from the rural parts of the state to the Metro Atlanta area.\nThank you so much for your investments.\nThank you for your time and dedication.\nIt's truly, truly an honor for me and for my amazing team\nto be here today.\nThank you.\nThank you very much.\nYou\nAre there any unanimous consents?\nDoes any senator waste a rise on a point of personal privilege?\nChair recognizes a senator from the 30 second for a point of personal privilege.\nThank you, Mr. Pro Tem.\nToday is International Holocaust Remembrance Day, in which we remember the six million\nJews, along with millions of others who were systematically martyred by the Nazi regime.\nThis occasion reminds us that we're all part of combating hate and\nbigotry, including anti-Semitism.\nUnfortunately, we have recent examples of anti-Semitic behavior right here in Georgia.\nI'd like to recognize some special guests that are with us today in the gallery.\nAnd the center of 15th is with me because he and I are the liaison's to the Georgia\nCommission on Holocaust on the Senate side.\nSally Levine is up there.\nShe's the Executive Director and Leader of the Georgia Commission on the Holocaust,\nFran Putney is with her Communications Director for the Commission on the Holocaust,\nKaren Eisenberg-Jones, the Executive Director of the Georgia Solidarity Network,\nSam Halpern, American Jewish Committee, and Mack Parnell, the Executive Director\nof the Faith and Freedom Organization that you're all very familiar with.\nLet's give them a warm thank you and welcome to the Senate.\nThe Senate from the 15th and I strongly encourage you to visit the exhibit on the first floor\nthat recognizes Holocaust survivors and liberators from right here in Georgia.\nIt's an exhibit that we installed a few years ago,\nand it's quite well done,\nand we walk past that area all the time,\nbut please stop and read it\nif you haven't had the opportunity.\nThis resolution, honoring,\nor recognizing the International Holocaust Remembrance Day\ncame in late, and if you'd like to sign it,\nI will be dropping it later today,\nso please stop on my desk if you're interested.\nAnd thank you to our guests for joining us.\nI yield the well.\nThank you, Senator Chair recognizes the center from the 56 for a point of personal privilege.\nThank you, Mr. President.\nI rise today to offer our sincere gratitude to all of the emergency operations folks throughout\nour state, all of our public safety professionals,\nfor reacting to our winter storm so well,\nbeginning with our governor, our lieutenant governor,\nour head of Jima, which is director Lam,\nall our emergency managers, your fire chiefs\nand their department's police chiefs, EMS 911,\nour linemen, our road crews department of transportation.\nAnd while some areas our state felt very little impact,\nothers got some pretty severe damage.\nAnd it was because of that planning and that reaction\nthat I'm proud the report that I believe we had,\nprobably one of the best responses to a public storm\nthat we've seen in some time.\nSo take a moment today and find someone\nwho is involved in that, shake their hand,\nsend them a note, send them a text, and just say thank you.\nI yield the well.\nThank you, Senator.\nWe do greatly appreciate the men and women and\nand all our public safety officials keeping us safe.\nChair recognizes the center from the 40th\nfor a point of perseverance.\nThank you, Mr. President.\nI rise today to tell you the story of a woman\nwho is eight months pregnant.\nShe is afraid, she is young.\nShe is being forced to travel a long distance\nso close to her delivery.\nShe is experiencing shooting pain\nthrough her back and her abdomen.\nWise people advocated for her to stay here,\nto receive medical care, but they were not listened to.\nSo we don't know how the mother and baby are doing.\nSirique Daniela Bretrago Ortiz is a Colombian refugee\nseeking asylum.\nShe was deported from Hart's Field Jackson Airport\nin her eighth month of pregnancy,\nwhile experiencing symptoms that could be life-threatening\nfor her and for the baby.\nThe flight took off in a rush, preempting the court\nfrom being able to make a decision regarding\nSheree's medical care.\nI can only surmise that these officials risked two lives\nto hurry her deportation from the United States\nbecause if the baby was born here,\nit would strengthen Sirique's asylum case.\nSirique was forcibly removed from our airport.\nIt was the federal court in Atlanta\nthat ruled that her deportation be halted\ndue to serious risk to her health and safety\nand that of her unborn child.\nWe passed a law in this chamber\nthat forced a Georgia woman\nbeing kept alive by machines\nto give birth to a baby\nbecause that baby's life was so precious.\nBut we willingly risked two lives,\nmother and child to force a pregnant Colombian woman\nseeking asylum to go back to her country.\nShame.\nWhat's wrong with this picture?\nDoes it bother your soul?\nJesus would say that all life is precious, whether it's Samaritan, American, or Colombian.\nAs we await news of a simple birth from a refugee mother in danger, a story so similar\nto Mary.\nI pray for Sirriq Daniella, Britrago, Ortiz, and her baby.\nI ask that light be given to those who sit in darkness\nand in the shadow of death, and that we find our way\nto peace.\nAmen.\nThank you, Mr. President.\nAll right.\nChair recognizes the center from the 14th\nfor a born and personal privilege.\nThank you, Mr. President.\nI was at dinner last week, and I was sitting next to a Democrat.\nAnd I was talking about you guys.\nI was telling her about Senate Republicans.\nAnd I told her something she didn't expect, which was, do you know most of these guys\nthink that Donald Trump is unfit for her office,\nthe vast majority of them think that he's a lunatic\nor a narcissist or something like that.\nAnd she said, you're blowing my mind\nbecause for her, what she sees on TV, what she sees in the news,\nyou guys are some kind of like cartoonish evil villain, right?\nYou guys are pro-Trump, MAGA.\nOf course, that's why you win your primaries\nbecause you communicate that very well.\nAnd you come here and you're just all aboard the MAGA train.\nAnd what's interesting about that, the crazy thing about that,\nis that assumption that you guys are super MAGA in your hearts,\nthat you actually like Donald Trump and support him,\nis not just an easy assumption for her.\nIt's actually an easy and comfortable assumption for you.\nYou are comfortable with the idea that she thinks\nthat you are crazy like Trump.\nAnd the reason is because it allows you to draw very clear lines\nand stay very comfortable and safe from the fray.\nYou get to say, well, those crazy Democrats, they don't know.\nThey don't know these far left loonies that I actually have,\na more subtle and complex approach to this.\nThey don't realize how hard this is to manage my relationship\nwith my base.\nThey think I'm some cartoon villain and I'm not.\nI'm a principled conservative, a Reagan conservative\nwho just wants lower taxes.\nAnd I hate all this Trump stuff,\nand I'm waiting for it to blow over.\nAnd if only she knew that,\nthen she would realize the truth.\nTo be her villain is much easier for you\nthan confronting the fact that you still have a voice.\nI think this is the hardest part of being you right now\nis that for 10 years,\nwhile Donald Trump has showed his cards,\nthat he was gonna invade cities,\nkill people in the streets,\nwith untrained agents that he's paying $50,000 bonuses\nto to rev up his numbers really fast.\nWe've always known that he was capable of that,\nbut for 10 years, a series of rationalizations has enabled you\nto stay quiet.\nRationalizations like, it could be worse.\nIt's not that bad yet.\nThe water's not boiling around the frog,\nso it could be a lot worse.\nNumber two, I have to win my election,\nAnd if I don't win my primary, somebody much worse\nwill replace me.\nOne of my friends from Pauling County in the house once said,\nif you don't elect me, it'll be a Nazi, a literal Nazi.\nSo you guys are comfortable in your feeling\nthat you're as good as it gets.\nYou're also comfortable with the rationalization\nthat even if you throw your body on the grenade\nand you speak up, oh, I'm going to be noble.\nI'm going to say the truth.\nWell, you get replaced and it doesn't do anything.\nAnd so we're back to square one anyway\nbecause your voice doesn't matter.\nI think this is a tremendously sad thing\nthat you guys are going through\nand that you have gone through for years.\nThe diminution, the destruction of your own voices,\nyour own public consciences, not your private conscience,\nbut your public conscience.\nThe one where you say out loud what you really think\nis happening.\nAnd when people talk about the platitudes of speaking\nwith your grandkids remembering where you were\nwhen this all happened and what you said\nor what you didn't say, that's what they're talking about.\nIs did I say something would it matter?\nDid I say something when a law abiding gun owner\nwas murdered in the street by a handful of ice agents\nall at once when he had no opportunity to comply\nwith their orders before they wrestled him to the ground,\ntook his gun away and then shot him multiple times\nin five seconds.\nNow, you're lucky because the people of Minnesota and Democrats and others,\nindependents, are raising their voices instead.\nSo, right now, you may feel like you don't have to.\nBut I'm only in politics as of 2017-2018,\nbecause I was diagnosed with Trump during engagement syndrome,\nbecause I felt like I did have to say something.\nBut again, as the water continues to boil and the frog spins around,\nunconscious of its future fate, apparently.\nJust remember that somebody's voice has to be raised\nfor this to stop.\nSomebody's has to.\nAnd it may not be yours.\nBut I ask you what that does to you.\nNot the country.\nToday, I'm not even talking about the country.\nWe're about the well-being of my colleagues.\nWhat does it do to you to spend 10 years, 15 years,\ntelling yourself day in and day out\nday out that your own voice doesn't matter and what then will that do to the\ncountry? Thank you, Mr. President, I yield.\nChair recognizes the center from the twelfth for a point of parcel privilege.\nGood afternoon, colleagues. I stand before you this afternoon with a very heavy heart\nto honor the memory of Mrs. Bernadine Span and her 13-year-old daughter, Jalia Span,\nwere killed instantly in a tragic car crash by a drunken driver. And also the\ndeath of Jackson span, age seven, who succumbed to his injuries several days\nlater. Their lives touched many. Their memories will live forever. Will you please\nPlease stand and pause for a moment of silence as we pray for the span family of Randolph County.\nThank you.\nSenators ask for a moment of silence.\nThank you, colleagues.\nChair recognizes the senator from the 28 for a personal privilege.\nShe's going to do it from her desk.\nThank you, Mr. Chairman.\nTomorrow is Saving Lives Day at the Capitol.\nMany of us have been working to make sure that we do everything to keep our community safe.\nAnd several bills have been introduced in some past.\nTomorrow we're going to highlight the one is the Autism Alert Act in Erick's ID law.\nAnd both of them are to help autistic young people.\nAnd one is personal to me because my grandson is 15, almost 16, six to big guy look like\na man.\nAnd I know that he's on the high end of the spectrum.\nBut sometimes he gets nervous about something.\nfor police stopped, the car he was in,\nhe might start frilling his hands\nand might end up dying or pulled out of the car and beat up.\nAnd that is happening here in the state of Georgia.\nSo that is one of the bills\nand the other one is a high-speed chase bill.\nSo I want to invite everyone to look at these bills\nand many of us that are here to save last,\nlike the DUI laws that we passed already\nand the senators just talked about three people dying.\nAnd I lost my son to a drunk driver,\nso of course you know I'm always trying to do things\nto make the streets safer.\nSo tomorrow it's on your desk already.\nWe'll have a press conference,\nwe'll have a room with food in it, food, food.\nSo please come by and give us your opinion\nwhat this legislation means to your community as well as if you have a bill so we can add it\nto our saved lives package. Thank you, Mr. President. Thank you everyone for listening. I yield\nthe will. Thank you senator. Chair recognizes the senator from the 29th for a\nof Point of Personal Privilege.\nThank you, Mr. President.\nColleagues, I stand up here to remember coach Tony Dmitry,\nthe head coach at Harris County High School,\nformer head coach at Russell County, Alabama High School,\nextremely successful baseball coach from Waverly Hall, Georgia,\nin my district.\nCoach said the high school I graduated from.\nIt was a teacher, an incredible athlete,\na graduate of a Jordan High School in Columbus, Georgia,\nand the father of two.\nHe was killed this weekend in a side-by-side\nrollover on private property while out riding\nwith families and friends, leaves behind a devastated\nstudent body at Harris County High School.\nHe was involved in all the lives of the children there.\nHe was looked up to as a mentor,\nas a father figure to some,\nbut as a coach and friend to all.\nSo Mr. President, I ask,\nif it's the will of the Chamber\nthat we stand for a moment of silence\nand members of Coach Demetri.\nSenator, I ask for a moment of silence.\nThank you, friends.\nThank you, Senator.\nChair recognizes the center from the 35th for a point of personal privilege.\nThank you, colleagues, I've come before you today, I didn't originally plan to speak,\nbut I wanted to share with you that our goals matter, but our methods and our route toward\nthose goals matters are just as much.\nWe know that we want the rule of law.\nWe know that we both are in parties and we have certain things that we want to see with\nimmigration, with gun safety, with protecting all of our constitutional rights.\nBut I just want to share with you all that our in-game, it matters.\nBut the route that we take, the methods that we take matter just as much.\nSo I ask all of you that as we think about what's happening in Minnesota and we think about\nwhat's happening all over this country, we may agree or disagree on the goals, but I bet\nthat we can agree on methods and let us seek out those areas where we do have agreement.\nAnd I think that we can agree that human life matters.\nSo let's find those routes, let's hold onto them because outside of these walls, we live\nin a society that's ready to just rip at the seams.\nFolks are ready.\nPeople want fracture, people want division because people are angry and for good reason.\nSo all I ask is that we seek out where we have that common ground.\nAnd from everything that I've learned, from those that I've met over the last few weeks,\nis that we agree that our methods matter just as much as our destination.\nThank you so much.\nThank you, Senator.\nChair recognizes the Senator from the 38th for a point of personal privilege.\nI'm hoping that one of our colleagues from the other side of the aisle would join us\nand speaking up for Alex Pretty and what occurred in Minnesota.\nAs my colleague from the 35th just shared,\nwe can have an end goal in mind,\nbut we all can agree that the methods that are being used\nto get to that end goal are not right\nand should be used in a way to honor American lives\nand not take lives in the streets of our cities.\nI also rise to speak out against a sitting congressman who, in the face of what is occurring\nin Minnesota, had the tone deaf goll to call for more ICE agents to be released on the\nstreets of Atlanta.\nThis is a congressman who is seeking to represent this whole state in the United States Senate.\nAnd so as a state senator, I am hoping that one of my colleagues will join from the other\nside and joining us in condemning what is happening in the streets of Minnesota.\nAnd saying we do not want that to occur in the streets across the state of Georgia.\nAnd so my hope today colleagues is that we will honor Alex Pretty's life, a VA nurse,\nsomeone who was holding a cell phone in his hand, someone who's gun was taken from him\nprior to being shot multiple times,\nsomeone that was trying to protect a woman in distress.\nAnd so my hope is that we can join together\nand say enough is enough.\nWhat is happening from the direction\nof what is coming out of Washington has to end.\nWe should not have cabinet officials\nlying to our face as we see what is occurring\nin plain sight from multiple angles on video.\nAlex was not posing a threat to anyone, he is not a domestic terrorist, he is someone\nthat saved lives, not that was trying to take away lives.\nAnd as someone who represents this city, I condemn the idea of a sitting congressman\nto call for more of that to occur here in our city.\nWe do not need more ICE agents on the streets of Atlanta or across the state of Georgia.\nWith that, Mr. President, I yield.\nJust as a reminder, colleagues, we don't allow appalls from the Chamber or the Gallery,\njust as a reminder there.\nChair recognizes Senator from the 34th for appointing a personal privilege.\nThank you Mr. President.\nI stand with you colleagues in solitude with Alex from Minnesota.\nHe was a 37-year-old nurse, caring for our American veterans at the veteran's hospital.\nAnd me being a 30-year Army veteran, it hurts my heart.\nHe was a lawful gun owner, peaceful.\nHe was attending a public protest.\nHe was defending a woman.\nHe was shielding her.\nThe Trump administration said he was dangerous.\nAt the end of the day, colleagues, I just\nwant us to remain peaceful, regardless in a red state or blue\nstate.\nWe expect the federal government to protect our rights\nat all times.\nThank you.\nChair, recognize the minority leader\nfor appointing personal privilege.\nThank you, Mr. President.\nQuick question will be that everyone will ask\nover the years to come.\nwill be where were you at?\nWhere were you during these particular times?\nFor years, those on the right insisted that\nusing having an opportunity to own a firearm\nwas not meant just to protect a person in their home,\nbut it was really meant to have protection\nagainst government tyranny.\nWhen we heard that for years and years,\nthat that's what it was meant for.\nAnd it was not meant to protect government tyranny\nwhen the person was just being silent\nor when they were protesting meekly.\nIt was meant when a person actually may have had a loud voice,\nwhen a person might actually try to protect somebody,\nbecause it was felt by those on the right,\nthat if you really are insisting\nthat this government is doing you harm,\nif you really are insisting that the government is doing wrong,\nyour voice may raise, you may protect somebody,\nit may not be as neat and clean as people may want.\nBut that is what democracy is about.\nAnd what they were claiming was that their fear was,\nAnd if the voice was raised or if it was not neat and clean and just sitting back real\nmeekly and just quote unquote protest in the silence, that then the government would\nuse force against them.\nAnd of course, most of their vision was that that's forced to be used by some left wing\nadministration.\nBut that is exactly, unfortunately, where we're facing today.\na government now that is using force, deadly force,\nto enforce its ideals of what it wants this nation to be.\nAnd yet, unfortunately, there are those who are conservative,\nthose on the right, those on the opposite side who sit silently\nand do not say this is exactly what we have been saying\nfor years, and that I want to fight against that.\nInstead, they don't say anything.\nAnd in fact, as I said, the principal question,\nor be answered is, where were you?\nAnd there will be those who say, well, wait a minute.\nThe person maybe said something loud,\nor the person got a little bit,\nwhat they think is out of control.\nBut I would then ask you this, this weekend,\nall over this country, at different little locations\nand clubs, people were getting loud, people were yelling,\npeople were screaming, people were using\nprofanity at deputies, and no one got shot.\nBecause they're there actually to enforce the law.\nAnd they are there to just make sure\nthings go smoothly.\nAnd they understand what they're really there for.\nBut what we're facing today is not that.\nWhat we're facing today is an organization\nled by this administration that is there\nto actually clamp down on democratic values.\nAnd so therefore when a woman maybe says something\nthey don't like, they push her.\nAnd so therefore when someone then tries to shield her,\nthey're murdered.\nBecause this is not about keeping order.\nThis is now about tyranny.\nIt is now truly about destroying\nthe democratic process.\nIn this process, started 10 years ago\nthrough trying to steal an election.\nIt has continued now through kidnapping American citizens\nor those who are here legally.\nAnd now it has continued to the very death\nof the United States citizen.\nAnd so the question that I started off with\nwill be the one that will be asked of you.\nWhere were you?\nAs people asked, where were you during\nwhen Kennedy was shot, where were you in the moon landed?\nThey will ask you, where were you\nwhen democratic values were destroyed,\nnot by outside force, but by an inside force,\nby the administration that was duly elected supposedly,\nhere in the United States.\nWhere were you to stand up?\nWhat did you say?\nWhat did you do to stop it?\nThat's the question.\nAnd so today, myself and my colleagues say,\nwe are here to stand up.\nWe are speaking out against it.\nThe question becomes, where were you?\nThank you, and I will yield the well.\nChair calls on the senator from the 37th for a point of personal privilege.\nPresident ladies and gentlemen, the Senate, I stand before you today, joining with millions\nof Republicans around the country and in Georgia whose hearts go out to those who've lost\ntheir lives in civil violence.\nOur heart goes out because in the very, very difficult work that's done across our communities,\npassions are very high.\nThe heart goes out to those who've lost their lives, those who've also losing faith in\nthe democratic process because they believed in stories and narratives and reports of the\ntruth is this way or that way or it's his truth or my truth, there's confusion.\nI wanted to say that Americans don't want chaos in their streets.\nNone of us do.\nThese are real lives that are lost.\nThese are real property that's being damaged in these communities,\nwhether it's lives in Minnesota,\nor whether it's lives that are lost in the southern border,\nor in other communities around the United States.\nThese lives are real, they matter.\nAll life matters.\nI share this because this is not a partisan issue.\nPeople who have all political backgrounds care about their families, care about their\nstreets, and care about their rights.\nWe've gotten emails from folks over this past weekend, over this past weeks, pointing\nspecifically to the circumstances in Minnesota, and these are significant circumstances.\nI will tell you personally, as I've shared with some of my constituents, I do believe\nthat citizens ought to be able to videotape things that are happening in their communities.\nI believe if something's happening on the street,\nand I'm a citizen, and I'm in a public place,\nI'd be able to hold my phone up and videotape it.\nThat's one of the difficulties that our law enforcement face\nwhen they do their jobs.\nThey're always on display.\nYou know, when our grandfathers were fighting in wars\noverseas, they weren't on camera.\nBut as we know, Gen X and millennials and Gen Z\nthat have been fighting wars around the world\nof the last 30 years, CNN cameras are over their shoulder\nwhile they're fighting and winning our nation's wars.\nThat's the law that our law enforcement officers face as well.\nI share this because any responsible conversation\nabout this starts with discussion of the loss of life.\nFull stop.\nThere's nothing that I could say or anyone else can say that's\ngoing to minimize the importance of that.\nAnd to say that, in context of a country where our laws and our citizenry have also looked\nthe other way, or there's a desire for many of our citizens to look the other way on\nenforcement of our most basic laws in our nation, and we've seen a professional demonstration\nclass that goes law enforcement officers, that provokes law enforcement officers, that\nlifts up the rejection of our nation's laws and suggests that law enforcement officers\nthat are doing their best with the best decency they can enforce our laws.\nBecause you're any member of the State Senate who would like to be a federal law enforcement\nagent who's called upon to enforce immigration laws.\nAnyone here want to do that job?\nWould anyone step in, subject yourself to being videotape, your face being posted online\nfor enforcing immigration laws so that you and your family could be targeted for detaining\npeople who are in this country illegally, who knowingly.\nAnd for years have violated international laws and are turning their nose at it.\nIs it okay that we can have tens of millions of people in this country who are not in this\ncountry illegally that we're funding with our tax dollars and we're providing this threat\nof protection across our culture with our own resources?\nWe're a nation of immigrants.\nWe welcome people from around the world who follow the rules.\nThe immigrants who I know personally, who went through the process in the years of difficulty\nto go through the process to get to the states with their green card and apply for citizenship\nand after a course of six or eight years, in some cases ten years, become American citizens,\nthey care about the enforcement of our laws more than any natural born person I know.\nSo as we recognize the loss of those in our country who have tragically died in law\nenforcement encounters. I want this Senate and all people of goodwill to also commit\nthemselves to enforcement of law, that people who violate our borders and in our country\nillegally simply can't stay forever. Senator, your time's getting back to Mr. President,\nI share this on behalf of a number of our colleagues because the issue is real, but\nI also call for our colleagues to stand equally by to stop chaos and\nthe provocation of law enforcement who have a very difficult job.\nAnd let's redouble our efforts also to the enforcement of our nation's laws,\nas we affirm the value of life, because we can do both.\nThank you.\nChair recognizes Senator from the 39th.\nThank you, Mr. President.\nFor the last several days, many of us watched the tragic killing of Alex Pretti in Minnesota.\nIt's a situation that has raised serious questions nationwide about public safety, constitutional\nrights, and the narratives we tell the American people.\nFor years, we've been told that good guys with guns make communities safer, and yet when\na lawful gun owner is killed, and the justification from the White House appears to be the mere presence\nof a firearm, it should force all of us to pause.\nRegardless of where we fall on gun policy, every American deserves clarity, due process,\nand truth, not shifting explanations after life has already been lost.\nWe have introduced SR 605 and I look forward to passing that tomorrow so we can all say\nunequivocally that we protect the gun rights of all Georgians.\nThank you.\nChair recognizes the center from the 36 for a point of personal privilege.\nGood afternoon, colleagues.\nWe're facing a grave moment in this country.\nWe are being asked by the administration not to believe our eyes when we see, in the case\nof Minnesota, two people within the span of less than two weeks, the shop, co-blooded murder.\nBut we're asked by the administration to believe a tale, a false narrative made up and coming\nout of the mouths of cabinet members that Alex Freddie was a domestic terrorist, shame,\nshame, shame, and it is time in the spirit of the remarks that several people have made\nfrom the well today.\nIt's time to take a stand.\nIt's time to take a stand.\nHow long are you going to continue to posture that this reign of terror coming from this\nadministration is somehow normal and acceptable and within the bounds of appropriate behavior?\nHow long are we going to do that?\nWe saw the first amendment and the second amendment torched on the streets of Minneapolis.\nWe saw an intensive care nurse highly trained to care for veterans in intensive care.\nShot down and cold blood.\nall happened and he was dead, you know, 25 seconds after the video started running. We're\nfaced right now with a situation that inarguably tells us and shows us that the administration\nis putting armed masked men and a few women, I'm sure, unidentified without names or without\nagency identification and allowing them to run a muck, what could go wrong? Well, we just\nsaw what could go wrong. And there are many, many more stories that don't rise to the\nlevel of press coverage that we've heard of. People being dragged out in the yard in\ntheir underwear. I mean, just, it just, it goes on and on and on. You heard the story\nfrom my colleague from the 40th, a woman within a month\nor less of delivering a baby, being yanked on a plane\nand shipped out of state, out of the country,\nback to Columbia.\nSo we're not imagining this.\nThis is not some fever dream.\nThis is, we wish it were.\nWe wish it were going away.\nI say each of us, it's time to say, stand up and say, which side of history are you going\nto be on?\nI watched and participated as a committee member of the Ethics Committee before we went home\nlast week, a resolution that was an attempt to strong arm our Secretary of State to come\ntestified why he didn't break the law for Donald Trump when they wanted our voter roles\nunredacted, sent up to the Justice Department.\nI watched the majority party vote that way.\nThis morning, ICE opened up operations in College Park in my district.\nThey sent out 75 unmarked Chevy's Tahoe SUVs out there scouting.\nSo it's only a matter of time before you face it right here in our state.\nAnd I will say to you, we have Senate Bill 389, Senate Bill 390, and Senate Bill 391,\nwhere all bills introduced and pending have had no action on them from the majority party.\nIn this chamber, that would curb these excessive behaviors that we have seen.\nWe call on you to bring those bills to light and we call on you to pass SB 605, at least\nbring it up for an open debate.\nThese are grave times we are all called on what standard we are going to take.\nThe guy running for GOP candidate in Minnesota just said I can't stay in this party any longer.\nI can't look my daughters in the face and tell them that and he withdrew from the GOP candidate\nfor governor.\nWatch closely, think deeply.\nThe time is now.\nThank you.\nI'll leave it well.\nChair recognizes the center from the night.\nThank you, Mr. President.\nAs we have been witnessing the tragedies that have happened in Minnesota, I'm asking\nmy colleagues, my Republican colleagues, what's the bridge too far?\nwith the silence. We have the armed terrorists paid for by the Trump administration with our\ntax dollars and our money. We don't know who these folks are. But I know they're terrorizing\nour communities. They're terrorizing the communities in Minnesota. We've seen these type\nof lollest terrorists before. They just wear different hoods. The ones we knew were,\nthey wore white hoods, dragged people from their house.\ndecided they were going to take the laws in their own hands and here we are. When is\nthe bridge too far? I keep looking for it. It wasn't the murder of an unarmed woman.\nThat wasn't too far. That we all saw with our eyes and that Republicans in the Trump administration\nis telling us that we did not see and now we just hit a new bottom. That would just murder\nthe man, not shot one time, ten times. For trying to give aid to someone who was legally\nprotesting, we see this with our own eyes and yet my colleagues on this side are out\nare staying silent. We have a U.S. congressman, a Republican who is defending these actions.\nWhen is the bridge too far? You guys keep getting up here and you know, you keep saying,\nyou know, I hear from you all the time you're the party of law and order. This is not law and order.\nLocking up five-year-olds is not law and order.\nMurdering an innocent man and an innocent woman is not law and order.\nICE is not even supposed to be going after American citizens.\nDid y'all know that?\nThat is not what homeland is supposed to do.\nThere's supposed to be protecting Americans.\nYet here we are.\nWe have an administration that is getting free reign\nto ruthlessly murder an American citizen's, too.\nAnd yet you all stay silent.\nWe have several pieces of legislation on how we can protect Georgians here.\nWe dropped at least three.\nI haven't heard any of our chairman assign them to a committee.\nI mean, they've been assigned a committee, but I have not heard when we're having those\nhearings.\nYou know, bills like just making sure we know who these mass gentlemen, these mass men\nare, I want to say gentlemen, these mass murderers are, who are they?\nYou know, I was commenting to my husband the other night and I said, you know what?\nAnybody right now that has an ice uniform on and say their ice come knock on our door\nand just drag us out and we have no idea who these people are.\nTaking people off the street.\nWe have no idea.\naccountability. We have a legislation here we can protect\nGeorgia's and yet none of my colleagues have supported us. We have SR605. Please\nlet's pass that resolution. Let's pass it today. Can we pass it today? But if we\nWe could support us in it.\nLet's show Georgia that we can do real bipartisan work, that we do care about our citizens here,\nthat we do care that we have the possibility of unchecked thugs going around our streets,\nmurdering and snatching people and we can do what we can here in the state of Georgia to\nprotect Jordan's.\nWhat's that, Mr. President?\nYour time has expired.\nI yield the vote.\nChair recognizes the center from the 5th or point of parcel privilege.\nThank you, Mr. President, dear colleagues.\nFor decades, we have said in this chamber, and heard every single Republican defend\ngun rights as a protection against tyranny.\nNow, someone lawfully possessing a gun\nhas been killed by the federal government.\nWe always hear, don't trade on me.\nWe have been trade on.\nThe president defended this murder solely\nbecause someone has a gun.\nTomorrow, we should pass SR 605 on consent calendar\nto show we all support protecting constitutional rights,\nincluding right to bear arms.\nThank you, Mr. President, I yield the well.\nChair recognizes the majority later for a point of personal privilege.\nThank you, Mr. President.\nAs my colleague from the 37 said, the last few days has a minute tragedy.\nAlex Pretty was his life, that is a tragedy.\nBut I like to remind my colleagues that life in all life is important on all days, not\nsome days.\nNone of you were there in Minneapolis.\nThe review should take place.\nWe should understand the facts.\nAnd I will say I allow that the government must be transparent, honest, until the people\nwould happen.\nBut at the same time, sewing chaos is not appropriate.\nChaos we've seen in so many times of our history has created tragic events.\nTeaching our kids to be chaotic beyond talking creates chaos even in their lives and their\nschools.\nSo for people to come down to the well to share your thoughts about the loss of life,\nI think is completely appropriate and we should talk about Alex.\nBut to come down here when you weren't there, just because it was on social media, because\nit was on video, for whatever it is, until there is a review and the facts come out that\nthe public transparently sees with their own eyes to hear the entire story.\nI think it's going a little bit too far.\nAnd then let's talk about the irony, my colleagues,\nthat want to come down here and talk about,\nwhat is the definition of a lawful weapons carrier\nin protecting the Second Amendment?\nThe Second Amendment protects our God-given rights,\nand in this body to confirm those rights a couple of years\nago when we passed bills to protect that right as Georgians.\nAnd in this state, related to the Second Amendment or other things, this state and even\nAtlanta's leadership in law enforcement have handled emotionally charged situations properly.\nSo we talk about Alex and we talk about lots of life from the minority party.\nLet's also talk, let's not forget about having correct law and order.\nLet's talk about enforcing the Constitution.\nIf you're unlawful and breaking the law, you should go to prison.\nlike the individual who killed Lincoln Riley then nobody wanted to say her name. So as I\nclose, the loss of life is very tragic. But the politicians, they want to run for president\nand go to Minneapolis, DAC like they were there from the minority party, the ones that\nwant to run for U.S. Senate and ask for an investigation and review the facts that's\ngoing to happen anyway is completely irresponsible.\nLet's show up for Georgia and let Georgia continue to lead the nation, Mr. President, I yield.\nChair recognizes the senator from the 7th for a point of personal privilege.\nThank you, Mr. President.\nI rise today to speak about public safety.\nand our broken immigration system.\nWe've been told the same lie for generations.\nGive up your rights and we'll keep you safe.\nTrade freedom for security,\ntrade privacy for protection,\ntrade due process for order.\nThat lie has never kept us safe.\nIt has only made the government more dangerous.\nI grew up in a family that knows exactly what happens\nwhen people in power decide your rights are optional.\nMy parents came here because America\nwas supposed to be different\nbecause here the law is supposed to protect you,\nnot hunt you.\nThe Constitution is not a slogan, it is not a prop,\nit is not a suggestion, it is a shield,\nand when the government shatters that shield,\npeople get hurt.\nPublic safety does not collapse because people demand their rights.\nIt collapses when the government decides it can ignore them.\nSo let me be very clear.\nI demand justice for Alex Freddie and Renee Good.\nISIS lawlessness is no longer debatable, deniable, or defensible.\nWhat we're watching is state-sponsored cruelty carried out under the dishonest label of enforcement.\nAnd I'm sorry, if you watch those videos and cannot see that these people were not fighting\nback, that they were murdered by these federal agents, then you need to get your eyes checked.\nOver recent weeks and months, federal immigration enforcement has crossed a line.\nAt the insistence of the Trump administration, we have seen tactics that resemble paramilitary\noperations in neighborhoods, at protests, and around families.\nLet's stop pretending this is about safety.\nIt isn't.\nIt is about control.\nAnd here's the truth, they don't want to say out loud, these tactics make us less safe.\nWhen people learn that speaking up gets you targeted, they stop speaking.\nAnd communities learn that calling for help puts them at risk, they stop calling.\nWitnesses learn that being present can get you killed, they stop helping.\nThat is not law in order, that is fear as policy.\nWe just saw a 37-year-old ICU nurse, Alex Petty, who cared for American veterans,\nmurdered by federal agents during protests tied to immigration enforcement.\nAnd instead of accountability, this administration called him a terrorist.\nThen they tried to justify his killing by pointing to the fact that he lawfully possessed\na firearm that argument is obscene.\nIf protesting is enough to get you killed, the first amendment is dead.\nIf legally carrying a firearm is enough to get you killed, the Second Amendment is dead.\nAnd don't dismiss this as partisan outrage, even the NRA said plainly that this justification\nis dangerous and wrong.\nThink about how far we fall in with the NRA, understands the Constitution better than\nthis administration.\nThat is not public safety, that is instability.\nThis is a government testing how far it can go before we push back.\nBecause once the government proves it can label you a terrorist and kill you for exercising\nyour rights, people retreat, communities fracture, violence escalates, and the country becomes\nless safe for everyone.\nAnd in the middle of this crisis, this body demanded that the Secretary of State break the\nlaw, not for the Constitution, not for public safety, but because Donald Trump demanded it.\nSo I'll ask this question plainly, what rights are left that you're not willing to sacrifice\nfor him?\nReal talk.\nFor 10 years, the majority has bent the needs of Trump again and again, and now you're\nwilling to throw the Second Amendment on fire.\nThe same amendment, you've spent decades pretending to defend.\nIf y'all abandoned that, y'all would abandon anything.\nAnd if the price of obedience to Trump is a destruction of our rights, then the answer\nis no.\nLet's pass SR605 on the consent calendar tomorrow.\nAnd let's show that Georgia will not be complicit in this assault on the Constitution.\nThank you.\nAnd I yield the will.\nAll right.\nWe have before you a consent calendar of privilege resolutions.\nDoes any senator wish to remove a resolution from the consent calendar?\nIs there objection to the adoption of the resolutions on the consent calendar?\nThe chair here is none and the resolutions on the consent calendar are adopted.\nAre they?\nAre there any motions to withdraw and commit?\nChair recognizes the Senator from the 9th.\nThank you, Mr. President.\nMay I ask for unanimous consent for SB 166, be withdrawn from the committee on state and local government operations general and be committed to the committee on urban affairs.\nThe center from the night has asked for unanimous consent that SB 166 be withdrawn from the committee on state and local government operations general and be committed to the committee on urban affairs.\nI'll rate the caption.\nSecretary, sorry, that we're in the Senate, not the House.\nSet a bill 1-6-6, a bill to be entitled an act to amend Chapter 1 of Title 36 of the official code of Georgia annotated relating to general provisions applicable to counties only.\nSo as the revised provisions relating to ordinances for governing and policing unincorporated areas of counties to amend Chapter 60 of Title 36 of the official code of Georgia annotated relating to provisions applicable to counties of municipal corporations.\nSo as to authorize enhanced monetary penalties for repeated violations of certain county immunisable codes or ordinances to provide for a definition, to provide limitations on such penalties, to provide for related matters, to repeal conflicting laws and for other purposes.\nThank you, please see her.\nAll right. The senators are from the 9th has asked that Senate Bill 166 be withdrawn from\nthe Committee of State and local government. Operation General be committed to the Committee\non Urban Affairs. Senator have the chairman of both committees agreed to this. Do I see\nthe chairman nodding? Is there objection? Hearing none, Senate Bill 166 is referred to\ncommittee on urban affairs. Does the senator wish to speak?\nAll right.\nThe chair has now the board of the committee is agreed to.\nHang on a second, guys.\nI have before you a consent counter of local bills, Mr. Secretary of any objections been\nfiled to any of the bills on the local consent calendar.\nThe objections have been filed.\nIs there objection to agreeing to the report of the committee on state and local government\noperations, which is favorable to the passage of the bills on the local consent calendar?\nHere is none. The report of the committee is agreed to.\nChair recognizes the senator from this 22nd.\nMr. President, pursuant to rule 7-1.10b, I give notice that on next legislative day I intend\nto move that the senate consider House Actional SB 170.\nMr. Leader, that comes later, I'm being told, so sorry about that.\nAll right, is there objection to agreeing to the report of the Committee on State and\nlocal government operations which is favorable to the passage of the bills on the local\nconsent calendar?\nThe chair here is none, the report of the committee has agreed to.\nThe question is on the passage of the bills on the local consent calendar, all those in\nIn favor of vote, yay, opposed nay, the Secretary will unlock the machine.\nYou\nOn the passage of the bills on the local consent calendar, the yeas are 46 and the nays are zero\nof the bills on the local consent calendar having received the requisite constitution majority\nare there for past.\nI recognize the center from the 56th.\nMr. President, pursuant to Senate Rule 7-1.1B,\nI give notice that on the next legislative day,\nI intend to move that the Senate consider\nHouse action on Senate Bill 9.\nSecretary, read the caption.\nSenate Bill 9, a bill to be entitled\nand act to amend part one of Article 3 of Chapter 12\nof Title 16 of the Official Code of Georgia Annotated,\nrelating to general provisions relative to obscenity\nand related offenses.\nSo as to repeal and replace,\nCode Section 16-12-80,\nrelating to obscene material, distribution and penalty,\nto amend Article 1 of Chapter 10 of Title 17\nof the Official Code of Georgia Annotated,\nrelating to procedure for sentencing\nand imposition of punishment.\nSo as to provide for sentencing of defendants\nwho utilize artificial intelligence\nin the commission of certain crimes,\nto provide for related matters\nto repeal conflicting laws and for other purposes.\nThank you for the notice, Senator.\nI recognize the senator from the 50th.\nThank you, Mr. President.\nA presumed to senator rule 7-1.10b.\nI also give notice that on the next legislative day, I intend to move the Senate consider house action on Senate bill 148.\nSenator's given notice the Secretary will read the caption.\nSenate bill 148, a bill to be entitled and act to amend Article 11 of Chapter 2 of Title 20 of the official Code of Georgia annotated to relate to public school property and facilities.\nSo as to provide for an outdoor learning spaces pilot program to provide for pilot program evaluation and report to provide for\nrelated matters to repeal conflicting laws and for other purposes.\nThat could be the order.\nThank you for the notice, Senator.\nNow I recognize the minority later.\nPresident was so big, I couldn't wait early, but here we go.\nMr. President, pursuant to Senate rule 7.1.B, I give notice that on the next legislative day,\nI intend to move that Senate consider a house action on SB 170.\nThank you, Senator Secretary, for the caption.\nSB 170, a bill to be entitled to an act to amend chapter 12 of Title 50 of the official code of Georgia annotated relating to commissions and other agencies to as so as to create the Georgia interagency council for the homeless to provide for the purpose membership and duties of such council to provide for reporting of activities to provide for compensation to provide for legislative findings to provide for related matters to repeal conflicting laws and for other purposes. That will be sooner.\nThank you for the notice. I want to take a point of personal privilege myself and recognize\nmy nephew whose page for us today, Nighten Walker. Nighten, raise your hand. Glad to have\nyou with us today. And my brother Russell, his father is here somewhere, but I don't know\non the floor, but glad to have them with us today.\nAll right, I recognize the majority later for a motion.\nMr. President, I move that the Senate stand adjourned\ntill 10 a.m. on Wednesday, January 28th, 2026.\nThe Secretary of the Announcements.\nThe Rules Committee upon adjournment in 450, CAP is TBD.\nThe insurance and labor committee at 3 p.m. in mezzanine 1 has been canceled.\nBesides in technology committee in 310 CLOB at 3 p.m. has been canceled.\nThe higher education committee in 307 CLOB at 3 p.m. has been canceled.\nThe children and families committee is in 450 C.A.P. at 330 p.m.\nThe Education and Youth Committee in 307 CLOB is at 4.30pm.\nThe Regulated Industries and Utilities Committee is at 4.50CAP at 5.30pm.\nThe Special Committee on Investigations is in 4.50CAP at 6.30pm.\nThat completes the order.\nAre there any additional announcements?\nChair, I recognize the center from the 54th.\nThank you, Mr. President, you look good up there, by the way.\nThank you.\nYou didn't know.\nMr. President, I want to remind everyone that tomorrow, our district attorneys today,\nfor breakfast, today, 30, and room 216, loved everybody come and show up and meet with\nyour district attorneys.\nAnd also, tomorrow morning at 7 a.m., we have our fellowship and it's going to be in\ntap 132 at 7 a.m. encourage all of you to come.\nIf you haven't been to our fellowship on Tuesday mornings,\nit's a special time, both by partisan, where we sit down\nand we just take a lot.\nThe really important things are appreciative of each other\nand the things that really matter in this life.\nSo I just encourage you to come take part\nin our fellowship at 7 a.m. in the morning.\nThank you, Mr. President, I'll yield the will.\nThe majority leader has moved that the Senate\nstand adjourned until Wednesday, January 28th, 2026 at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed, no.\nAll those in favor of the motion will say aye.\nThose opposed, no.\nOn the motion, the ayes clearly have it and the Senate is adjourned.\nYou\n",
  "updated_at": "2026-02-12T01:25:54.34478+00:00"
}