{
  "video_id": "Kq3gUyRt_I0",
  "url": "https://youtu.be/Kq3gUyRt_I0",
  "title": "Georgia House - Day 7 (2026-01-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 7,
  "video_date": "2026-01-29",
  "duration_minutes": 68,
  "summary": "Here is a summary of the Georgia House - Day 7 (2026-01-29) session:\n\n**Overview**\nThis session focused on the introduction and referral of several bills to various House committees. No major legislation appears to have been passed or debated.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- **HB 824**: An act to amend the O.C.G.A. relating to special license plates for motor vehicles\n- **HB 825**: An act to amend an act providing authority for members of the Board of Education of Barrow County\n- **HB 826**: An act to provide for a new charter for the City of Meigs in Thomas County\n- **HB 827**: An act to amend Article 1 of Chapter 9 of Title 10 and Article 2 of Chapter 7 of Title 48 of the O.C.G.A. relating to the Georgia World Congress Center Authority\n- **HB 828**: An act to amend Title 30 of the O.C.G.A. relating to handicapped persons\n\n**Notable Moments**\n- The session began with a prayer by Brody Hughes, a local pastor and high school principal.\n- There was some procedural discussion about seating arrangements for members.\n\n**Votes**\nNo recorded votes took place.\n\n**Attendance**\nThe session appears to have had a quorum, as the doors were closed and locked for the proceedings.\n\n**Adjournment**\nThe session adjourned, but the next session date was not provided.",
  "transcript": "You\nYou\nYou\nhave all members voted have all members voted if so the clerk will lock the\nmachines. Doorkeepers will please close the doors and keep them closed. Good\nmorning. Welcome to another legislative day. It's going to be a great day. We will begin\nour day with Scripture reading in prayer by the chaplain after which we will\npledge allegiance to the flag of our country. Our chaplain this morning will be\nintroduced by the gentleman from the ninth house district, the chairman of the\nHouse Transportation Committee Chairman Kevin Tanner. Chairman Tanner.\nThank you, Miss Speaker. It's my great honor to come before you today and\nintroduce a fine man in our community. He's not only a pastor at a local\nchurch but he also happens to be the high school principal at our local high\nschool. So he's leading not only a congregation but he's leading many many\nyoung people in a very good direction at our local school system. Brody Hughes\nis the pastor at Juno Baptist Church in Dawsonville. He's pastor there for the\npast five years. He's been in the ministry for the past 15 years. He's enjoyed\nthe opportunity to earn that time to serve several local churches in and around\nour community. He also has been a part of several overseas mission trips to Kenya, Uganda,\nIsrael, and Egypt. And he's again been in education now 12 years and is the principal of our school.\nHe is the father of two boys, Sutton and Landon, and has a wonderful wife, Brittany,\nwho is an nurse, and they're expecting another boy in May. He brought with him a good friend of\nhis and mine today, former City Council member from Dawsonville, Jason Powers. So if you would\nwould make him welcome.\nAppreciate him being here with us.\nThank you.\nIt's my great pleasure to introduce Rodi.\nNot only is he a pastor of a local church,\nold-fashioned Southern Baptist like I am,\nbut he's also a friend.\nSo make him welcome today.\nThank you.\nYou say it's an honor and a privilege to be with this body.\nThis morning, and we've been praying for you all\nknow you have tough decisions and things tasked that are set before you. We want to read\nout of the 28th chapter of the book of Isaiah in the 16th verse, therefore, thus saith the\nLord God behold, I lay in Zion for a foundation of stone, a trod stone, a precious cornerstone,\na sure foundation. He that believeth shall not make haste. At the turn of the 20th century,\na German philosopher Frederick Nietzsche in his satirical work, the madman, said that if\nGod died or proclaimed the death of God that they would run into city streets, the madman\nand proclaim that we would have to light lanterns in the morning to see our way.\nJust a few years after that, 40 or 50 years later, Dietrich Bonhoffer, as he said in America,\nconcerned with the events that had gone on in Germany at the time as a dark seat of war\nand destruction had ravaged his land and he considered his place in what he should do.\nScripture came to his mind, he that believes it shall not make haste, or as he said, he\nthat believe it should not make or should not flee.\nI just came to encourage you all this morning as you have a great work set before you, each\none of you to represent the people of the state of Georgia, to represent your hometowns and\nto represent the beliefs that you have within your heart, to stand firm on the foundation\nthat God has laid, a cornerstone for each one of you to stand on as you begin to build.\nI thought about Nehemiah in the 6th chapter, the Bible said, now,\nSanberle and Tobia had come to Nehemiah and tried to distract him from the work that he was doing\nand said, come, let us meet in O know that you might take a break and we might get together\nand talk about these things.\nAnd Nehemiah responded, I'm doing a great work and I cannot come down.\nCertainly, all the distractions of life in the world come and then come to you about\nI hope and pray that you stand on the firm foundation\nthat your convictions have led you to this place.\nAs God has driven you and your life\nto be at the place that you are right now,\nand you might be as Dietrich Bonhoeffer was,\nthat you believe in that foundation\nand you would not flee but stand firm\non what he has given you.\nThe Bible also teaches us in the book of Galatians\nin the fourth chapter, Paul says,\nhaving begun therefore in the Spirit,\nwhere shall we now turn?\nhaving begun in your spirit and having God's conviction\non your life, and as He has driven you this way,\nI hope and pray that He'll ever lead and guide you\nin your decisions as you make these great choices,\nnot only for yourselves, but for this great state\nand these great people.\nI would that you might stand and join us now\nin a word of prayer.\nOur Lord and Heavenly Master, God,\nwe thank you for this day.\nFather, we thank you, dear Heavenly Master,\nfor your grace and your mercy that you've extended to us.\nGod, by your graceful hand, God, we pray for each one that is gathered in this house this morning.\nGod, may you lead them and God them, Father, speak to their hearted, that still small voice.\nGod, let them proclaim the foundation that you have set before them. Let them stand strong and\ntall upon it. God, and let them not flee from the task that is set before them. God, now go with\nus, lead us, God, us, and direct us in these things. We ask in our sweet and holy precious name, amen.\nled allegiance to the flag of the United States of America and to the Republic for which\nit stands, one nation under God, the indivisible, with liberty and justice thought.\nDoorkeepers will unlock the doors.\nChair recognizes the chair of the Committee on Information and Audits, Chairman Hogan.\nYour committee on information audit has read the journal of the previous legislative\nday and found it to be correct.\nThank you.\nSome of your seat mates back there, I think they're questioning whether in fact you have\nread the journal.\nmajority whip. I got him moved over there and could have\nwe get no Williams moved over there. Well I can't put him\nat the same desk that it's one I'm being the other's lap.\nChairman Hogan the chair of the Committee on Information and\nAudits reports that the Journal of the previous legislative\nday has been read and found to be correct. Is there any\nobjection to the confirmation of the journal? The chair here\nnot in the journal is confirmed. The clerk will read the resolution establishing the order of\nbusiness for the day. Mr. Burns on 59 who's following me establishes the order of business\ntheir first part of the period unanimous consensus. Introduction of bills and resolutions first\nreading and reference of house bills and resolutions second reading of bills and resolutions\nbefore the standing committees. Morning orders.\nis there any objection to the adoption of the resolution establishing the\norder of business for the day? The chair here is known and the resolution is\nadopted. First reading of bills and resolutions the clerk will read House\nbill 824 by Ripson Valin of the 40th Bill being taught on the act of men code\nsection 40 to 86 the fiscal to George annotated relating special license\nplates motor vehicles House bill 825 by Ripson of England 116 gains the\n117 Kirby the 114 will be tied on an act to men and act providing authority\nfor members of the Board of Education Barrow County.\nThe Intergovernmental Coordination.\nHouse Bill A26 by ribs of Watson the 112nd Taylor 173rd will be tied on\nact to men and act provide for a new charter for the City of Miggs in Thomas County.\nThe Intergovernmental Coordination.\nHouse Bill A27 by ribs of Stevens the 164th.\nBill B. Tidal and act to men article one of chapter nine of title ten of the article two which\nChapter 7 of Title 48 in the fiscal of Georgia,\nannotated, relating the general provisions relative\nto George L. Smith to Georgia World Congress Center Authority.\nWays and Means House Bill H-28,\nour resident of Stevens, on on on 64th,\nBill B. Tyler, an act of men in Title 30,\nthe fiscal of Georgia,\nannotated, relating the handicap person.\nJudiciary House Bill H-29,\nour resident of Stevens, on on on 64th,\nand Harlow-106,\nBill B. Tyler Nack to men code section 48, 5, 7th.\nBishop of the Georgia Annotated relating assessment\nof tangible problems.\nWays and memes.\nHouse for late 30 governments.\nInventing the 31st,\nBill B. Tyler Nack to men code section 47, 20, 87.\nBishop of the Georgia Annotated relating\nto eligible large retirement systems.\nRetirement.\nHouse for late 31 by resident of Houston in the 170th.\nBill B. Tyler Nack to authorize the assessment\nand collection of a technology feed\nby the probate cord of Cook County.\nIntergovernmental coordination.\nHouse for late 32 by resident.\nCarpenter, the 4th, purple, 155th Bowdie,\nthe 62nd Douglas, the 78th, and Silcox, the 52nd.\nBill Bintado, an act to amend Code Section 80 of Title 36\nat the fiscal to Georgia,\nand Tadda, relaying the general provisions\napplicable to counties, minister for corporations\nand other governmental entities.\nGovernmental affairs.\nHospital 833, by rep.\nSteven's 164th, Bill Bintado, an act to amend Title 52\nat the fiscal to Georgia, and Tadda,\nrelaying the waters of the state.\nNatural resources and environment.\nHouseville, 834 by resident Jasper's,\nthe 11th Watts in the 172.\nPerkle, the 155th,\nHouse into the 171, the 116th and others.\nHe'll be in Tottenham,\nthat command code section 36,\n82-61 of the fiscal to Georgia,\nand it's really the definitions regarding revenue bonds.\nThe governmental affairs.\nHouseville, 835 by resident Turner,\nthe 21st,\nCalvall, the 20th single women's 71st,\nand pull into the 131st.\nHe'll be in Tottenham, that command chapter five,\na total 48 of the fiscal to Georgia,\nand Tadea Relay to add Valorium taxation to property.\nWays and Maines.\nTadea Relay, 36.\nBy reflection of Carp from the fourth.\nHarold, 106, Powell of the 32nd Friday,\nthe 118th and Williams of the 148th.\nBill and Tadea Relay to the men,\nTadea Relay to the fish go to Georgia\nand Tadea Relay to the alcoholic beverages.\nRegulated Industries.\nTadea Relay, 37 by reflection of Martin, 49 Jones,\nthe 47 Jones of the 25th Settle Cox,\nthe 52nd Stevens of the 164th.\nBill and Tadea Relay to the men, chapter 62 of Tadea,\n30-60 fiscal to Georgia annotated relating the development authorities.\nWays and Means.\nNow it's really 38 by Representative Hitchens and the 61st lot of the 120-second\nchastras to the 11th gravely of the 67th and Lumps to the 12th.\nThere'll be Todd and Actamen Code Section 24-5-5-10 in article 8 of chapter 2,\ntitle 35 of fiscal to Georgia annotated relating to privileged communications.\nPublic safety and homeland security.\nHouse Resolution 875 by Representative Kendrickly,\n93rd, Bennett of the 94th, Mitchell of the 88th,\nBeverly of the 143rd, and Marin of the 96th,\nand others, a resolution for creating\nthe House Study Committee on Financing Option\nfor Cannabis Space Businesses.\nSpecial Room.\nHouse Resolution 876 by Representative Kendrickly,\n93rd, Mitchell of the 88th, Beverly of the 143rd,\nBennett of the 94th, and Marin of the 96th,\nand others, a resolution urging the United States Congress\nto enact legislation removing cannabis\nand the Federal Control Substances Act.\nSpecial rules.\nHouse Resolution 962 by Resow.\nStevens the 164th Resolution Proposing.\nAnd remember, the Constitution serves\nto authorize the General Assembly to provide\nby General Law for a local referendum.\nWays and Means.\nThat completes first readers.\nSecond reading of bills and resolutions,\nthe clerk will read.\nHouse bill A2 by represent Green in the 111st\nto build to amend an act providing\nfor the compensation and expense of the members\nof the Board of Education of Calhoun County,\nHouse Bill 803 by reps of green of the 150 first\nto build to provide a home study exemption\nfrom early county school district at Lauren taxes.\nHouse Bill 804 by reps of galeared of the 160 second\ngardener of the 57th Prince of the 127th Bruce\nof the 61st Bill of the 3rd,\na bill relating to the Georgia equality employment\nfor persons with disabilities code,\nHouse Bill 805 by reps of galeared of the 162nd\ngardener of the 57th Prince of the 127th Bruce of the 61st\nBill relating to the Georgia minimum wage law,\nHouse Bill 806 by Representative Bowdie of the 62nd\ndryer of the 59th Scofield of the 60th.\nBill relating to water and sewer project and cost tax.\nHouse Bill 807 by Representative Montaghan of the 17th\nPowell of the 32nd hatchet of the 150th.\nTanner of the 9th, Yarta of the 150th second and others.\nBill relating to Levy on business or practitioner.\nHouse Bill 808 by Representative Montaghan of the 17th\nPowell of the 32nd.\nTanner of the 9th, Corbid of the 174th.\nHatchet of the 150th.\nbill relating to alternative Adelorn taxes on motor vehicles, House Bill 809 by\nremissor Coucher, the 50th McLaren of the 51st Rebelshow, the 48th, the clerk of the\n108th, the bill relating to offenses against public health and morals, House\nBill 810 by remissor Harold, the 106th, the bill relating to imposition rate\ncomputation exemptions from income taxes, House Bill 811 by remissor Harold, the\n106th and Williamston of the 115th, the bill relating to administration of\nrevenue and taxation, House Bill 812 by remissor Coucher, the 105th, the bill relating\nto elections on primaries, House Bill 813.\nMy reps are in the cloud of the 105th,\nwhere I will show the 48th,\nhighly of the 111th McLean of the 100th.\nClark of the 108th and others.\nA bill relating to public assistance, House Bill 814\nby reps of Welch of the 110th,\nthe bill relating to statewide business court,\nHouse Bill 815 by reps of the gains of the 117th,\nEngland of the 116th.\nWe now are of the 119th Pent,\nand of the 31st Kirby of the 110th,\nthe bill relating to sales and use taxes,\nHouse Bill 816 by reps of Mathiac of the 73rd,\nWilliams of the 145th, Hawkins of the 27th,\nto honor the 72nd, green of the 151st,\nto build relating to professional services,\nin which a professional corporation may engage.\nHouse Bill 817 by Representative Fleming\nof the 120 first, lot of the 120 second,\nNewton of the 123rd, and McCall of the 33rd,\nto build to a midnight providing for the election\nof the members of the Board of Education\nof Columbia County, House Bill 818\nby Representative Welch of the 110th,\nWilliams of the 115th, Hawkins of the 27th,\ngravely of the 67th, called well of the 20th,\nbill relating to compact for a balanced budget, House Bill 819 by\nRosa Park of the 101st, the Hitchens of the 161st, Williams of the 168th,\nLansing of the 75th, when of the 89th and others, a bill relating to\ninsurance, exploration, and renewal of licenses, House Bill 820 by\nRosa Tanner of the 9th, Spire of the 135th Carpenter of the 4th, McCall, 33rd,\nPall of the 32nd, a bill relating to officers in the Department of\nTransportation, House Bill 821 by Rosa, Buckner of the 137th, and Green of\nthe 111st, a bill relating to retirement and pensions, House Bill 822 by\nRepresentative Gamble of the 15th,\nSkoggins of the 14th, Kelly of the 16th,\nbuilt to a midnight, providing board of education\nof Bartow County, House of the 823,\nby Representative Gaines of the 117th,\nJones of the 47th, lot of the 122nd reads of the 34th,\nwith our 119th and others,\na bill relating to trafficking of persons\nfor sexual servitude, House resolution,\n933 by Representative Bowdie of the 62nd,\ngravely of the 67th,\nBruce of the 61st, Collins of the 68th,\nAlexander of the 66th,\nResolution creating a house study committee on home owners associations,\nkind of any members associations or property owners in community associations.\nHouse Resolution 934, bribes of Carol, 106, the wealth of the 110th.\nResolution proposing a member to the Constitution says provide that the governing\nauthority of any county or facility government shall be authorized to adopt an alternative method of\nappraisal assessment, a real property located within such county for\ntaxation, House Resolution 935, bribes of Tanner IX,\nwith the 130-second smears of the 135th Carpenter of the 4th McCall of the 33rd Resolution\ncreating the Georgia Commission on Freight and Logistics, through the 2nd Readers.\nYou\nYou\nReport of Standing Committees, the clerk will read.\nRepresentative Dom Parsons, the 44th District Chairman of the Committee on Energy, Utilities\nand Telecommunications submitted the following report, and the Speaker Committee on Energy,\nUtilities and Telecommunications has added a consideration of following bills of the\nHouse and this is Dr. Metri report same back to the House of the Filing Recommendations SB 43 Dupass was\nrespectfully submitted. Representative Don Parts of the 44th District Chairman.\nPresident Barry Fleming of the 121st District Chairman of the Committee on Judiciary submitted to\nfollowing report for speaker committee on Judiciary. Is that under consideration the following bills\nof the House? This is Dr. Metri report same back to the House of the Filing Recommendations House\nHouse bill 765 due pass,\nrespectfully submitted,\nRepresentative Barry Fleming of the\n121st District Chairman.\nRepresentative Benton of the 31st District\nChairman of Committee and Retirement\nsubmitted the following report.\nMr. Speaker, your committee on retirement\nis set in consideration to following bills of the House.\nThe instructor meeting report\nto same back to the House following recommendations.\nHouse bill 67 due pass,\nHouse bill 195 due pass,\nHouse bill 292 due pass,\nHouse will 652 do pass by committee substitute, respectfully submitted, representative Tommy Benton of the 31st District, Chairman.\nThat completes the reading of the reports of standing committees.\nWe're going on now to morning orders.\nThis House will come to order.\nwill be in order. Chair recognizes for a morning order, Chairman John Corbett.\nThank you, Miss Speaker. Members of the House, I rise this morning to say thank you.\nI want to thank the this body, the administrative staff, my friends in the hall, my friends across\nthe hall, the love and support that this body has expressed to Rebecca and I, been amazing.\na few days been tough. But two things has helped us get through this. First is the faith\nin knowing that we're going to see them again. You can't lose something if you know where\nit's at and we know where he's at. And the second thing is the phone calls, the emails,\nthe texts, the cards, the personal visits, the flowers, the food that we have received\nfrom this body and the friends of this capital\nhave been nothing short of amazing.\nWe thank you for that.\nMr. Speaker, I want to thank you personally.\nI can't tell you how much your phone call man.\nSo anyway, I just can't express how much that man.\nYou know, I'm blessed beyond measure\nto serve with this body.\nI really am.\nThank you and God bless you.\nWe're going to limit morning orders now going forward to one minute each.\nApparently yesterday some of you did not hear me say that.\nSo let me be very, very clear, one minute, one minute.\nAnd then the messenger has the ability to turn your microphone off.\nChair recognizes for a morning order representative Petri.\nGood morning, thank you, Mr. Speaker.\nI will be very brief, but I want you guys to direct your attention to the screen here.\nMy friends, I've got an op-ed that I put in the Savannah Morning News on Saturday that\nI'd like y'all to look at.\nMany of you may know I'm someone who is very interested in environmental issues, land\nmanagement.\nI grow timber.\nI'm an avid sportsman.\nI want to tell y'all something.\nI'm real proud of what this conservative legislature has done over the last 15 years\nand beyond that to protect and preserve land in this state, we have preserved over 200,000\nacres of land in the last 15 years alone. As a coastal boy, many of y'all may not be\naware, 12 barrier islands and only four have any appreciable human population. We have\nprotected our marshes. We have a third of the marshland in the entire coast Atlantic\ncoast folks we've been very protective of our state and I want to tell you\nsomething we're just real proud to announce today a brand new wildlife management\narea 6300 acres preserved in Bryan County in my district proud of that thank\ny'all\nchair really regrets having to do this I know these are important matters but we\nbe here all day, I'm warning orders. So if you want to sign up for part one today and\ncome back for part two tomorrow, we can do it that way. Chair recognizes Representative\nWilliams, Mary Frances Williams for a morning order.\nThank you, Mr. Speaker.\nI've put something on everyone's desk with some quotes about the budget cuts that have\nbeen proposed by the governor.\nFirst of all, I want to thank the Speaker and Appropriations Chair Terry England for encouraging\nall of us to attend the Appropriate, the budget hearings last week and making us feel welcome.\nI was grateful for that.\nlast year was my first session, but I've been around the budget process for years.\nAnd last year was a good budget.\nIt was done in good faith, good people who really care, worked really hard to consider\nall the requests that were made, and factor in all those decisions.\nAnd I voted for that budget, and I left, and I thought, that was a good budget we did\nlast year.\nThat was a good budget.\nSo we went home and then we learned about the budget cuts that are having to be made\nand that were made beginning October 1 and saying that they were necessary.\nAnd I just wanted to go on the record and say, I'm not buying it.\nI was, I'm not buying it.\nLadies, time has expired.\nThank you.\nChair recognizes representative Lot and representative Newton for a morning order.\nGood morning, we would like today to welcome to the House the advocates and members of the\nSickle Cell Foundation of Georgia, Dr. Mark Newton, Dr. Mark Newton and I are here as representatives\nwith the working in the area of the Medical College of Georgia and we would like to say\nthat Georgians with Sickle Cell are blessed to have access to the Augusta University Sickle\nCell Center, which serves approximately 1,500 patients throughout the state.\nlocal clinics in Augusta and outreach clinics in Savannah, Dublin, Valdosta, Waycross,\nSylvester, Albany, and Macon. The Centers Laboratory Services, the Centers Laboratory\nserves as the reference lab for the statewide newborn screening program. In addition, physicians\nand scientists affiliated with the Center have successfully competed for federal research\nfunding on sickle cell disease, putting the Augusta Sickle Cell Center at the cutting\nedge of sickle cell research.\nAnd I just want to do a shout out to the Medical College of Georgia.\nThat's the only public medical school.\nIt's your university.\nIt's your public medical school for each of your districts.\nI'm excited 20 years ago when I was there.\nThey were doing this work that has now made groundbreaking advances\nin treating sickle cell and devastating disease.\nSo thank you to them.\nRemember to say thank you to your medical school,\nthe Medical College of Georgia.\nChair recognizes representative William Sun and representative Kirby for a morning order.\nThank you, Mr. Speaker.\nToday we want to help welcome to the House the leadership Walton and the youth leadership\nfrom Walton County. Would y'all stand up there in the gallery? I don't see them right now.\nThey must be over in the Senate. So if you get a chance, we appreciate them coming down here.\nAnd thank you very much. Chair recognizes Chairman Dempsey for a morning order.\nThank you, Mr. Speaker. Good morning, members. Today I want to recognize this day as\ntogether Georgia Day at our state capital.\nMany of you have worked with together Georgia over the years.\nThere are nonprofit alliance of service providers that provide state-wide services and care\nto Georgia's most vulnerable children, working across a wide spectrum of ways to help and\nmake their lives better and create opportunities.\neducate and train but they are most well known as a servant leader organization providing\nhelp to those that many might consider the least of these so that one day they may have\nthe opportunities to become the greatest of these.\nTogether Georgia if you would please stand up any of you that are in here and let us\nrecognize you and thank you.\nThank you Mr. Speaker.\nI yield the well.\nrecognizes representative Stovall and the Clayton County delegation for a\nmorning order. Thank you, Mr. Speaker. I want to give thanks to the Agricultural\nCommission of Black, Commission of Black and his team for the new sign at this\nat the farmers market in Clayton County. It is no longer the Atlanta State\nfarmers market but now the Atlanta Clayton County produce terminal and market.\nSo with thanks to the members of the House study committee on the revitalization of the farmers market\nThat was one of the recommendations from the committee and also to our Clayton County delegation and many others. Thank you, Mr. Speaker\nChair recognizes Chairman F. Strachian for a morning order.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House, this is Human Traffking Awareness Month in the United\nStates.\nJanuary is.\nHuman Traffking is an evil practice of modern slavery in which victims who are adults\nand children are sold for labor or sexual servitude. This evil is perpetrated throughout communities\nwho are rural, suburban, or urban. In homes where the victims come from poor middle class\nor affluent backgrounds, it impacts everyone. And I'm very grateful for the leadership of this house\nover the past decade, working to address this issue where Georgia had been one of the primary hubs for human trafficking,\nnationally and internationally, and through the fine work of this General Assembly, that has been\nstemmed, and I want to thank you, Mr. Speaker, for your leadership on this issue.\nToo many in here to name, but of course, Chairman Andy Welch, who initially got me involved in this issue.\nI'm very proud of the efforts and I thank the House. Thank you, Mr. Speaker.\nChair recognizes representative Hutchinson for a morning order.\nThank you, Mr. Speaker. Good morning, colleagues. Today I'd like to introduce you to\nLaDairy. LaDairy is one of almost 2,000 children available for adoption in Georgia.\nLaDairy is an adorable, outgoing 13-year-old boy who enjoys playing and watching football\nand basketball.\nHe enjoys watching action movies and comedies.\nHis favorite subject in school is math.\nLaDairy looks forward to going to medical school after he completes college.\nSo say hello to LaDairy, and thank you very much, I yield the spell.\nThank you very much.\nYou\nchair recognizes representative gravely for a morning order. Thank you Mr.\nSpeaker. We all enjoy when constituents can come down and visit with us and\ntoday I have the pleasure of having two Douglas County constituents with me. Dick\nJones and his son Kyle Jones. Dick is retired from a career in law\nenforcement and I just want to welcome him here. He also participated in\nfor all investigations and the law enforcement continues first responding continues in the\nfamily because Kyle tomorrow starts EMT school so if y'all would just welcome them here if\nthey'll stand in the in the gallery force for their service and for his career in law\nenforcement. Thank you, Mr. Speaker.\nChair recognizes representative Frazier for a morning order.\nThank you, Mr. Speaker.\nI would like to be joined by all the members that support Sickle Sale.\nThank you all so much for wearing your red today.\nIt is actually Sickle Sale Awareness Day at the State Capitol.\nAnd we are honored to have all of our folks that have traveled across the state.\nstate, would you all please stand and be recognized. These are all people that\neither live with sickle cell and know some money that has sickle cell. We are\nhere at the state capital in room 216 today for lunch. Please come by and meet\nyour constituents that have traveled across the state to be here. Thank you and\nI look forward to seeing you all in 216.\nI recognize this chairman can trail for a morning order.\nThank you, Mr. Speaker, on a much lighter note.\nColleagues, I want to remind you about our free showing\nof the movie Just Mercy, starring Jamie Fox and Michael B. Jordan.\nThis afternoon at 530 at the landmark theater.\nEveryone's welcome to attend. We strategically planted at 530\nso that your staff could come with you.\nyou so please invite everyone you want to come we have 350 seats so I think we\ngot plenty of room but it is first come first serve so hopefully we'll see\nthis after in 530 thank you miss speaker miss chairman would I have an inquiry\nus state your inquiry would would was that was that okay you did well don't get\ntoo good at it. Would you give me a list of those who do not stay to see the credits\nroll? I will be happy to do that, Mr. Speaker. I was going to provide a quiz afterwards\nto make sure who was paying attention and who wasn't. Very good. Thank you. You're welcome.\nrecognized as Representative Rick Williams for a morning order.\nThank you, Mr. Speaker.\nWe're going to be introducing Grace's law today.\nIn 1990, the federal government passed a law that prevented discrimination.\nThis bill will make sure in Georgia has a law that stops organ or tissue transplants\nagainst challenged physically or mentally challenged people.\nThe bill is on my desk if everybody would like to come sign it will and we have Gracie\nand her parents if they would stand to be recognized in the gallery please.\nThank you.\nThank you Mr. Speaker.\nChairman Lynn Smith and Chairman McCall, are they?\nAll right, we're going to move on.\nHouse will remain at order. We have some distinguished and special guests with us today. The clerk will read the caption to House Resolution 985.\nHouse Resolution 985 by resident of Princeton 127th, Nelson 125th, Howard\nof the 24th, Fraser of the 126th, a lot of the 22nd, and others, a resolution\ncongratulating commending Dr. Ben Kasella and for other purposes.\nChair recognizes representative Brian Prince for an invite resolution.\nThank you, Mr. Speaker and colleagues.\nToday, we have an opportunity to recognize one of our own, a Georgian from the great state\nof Augusta.\nYou didn't get that.\nYou can't stay out of the way home, but a Georgian who has been awarded by the American\nAtomatric, Atomatric, Atomatric, Atomatric, Atomatric, Atomatric, Atomatric of the Year.\nPlease help me welcome a good friend of mine, my families, Dr. Ben Cassella.\nThank you, Mr. Speaker.\nThank you.\nThank you so much.\nThank you very much.\nI will be out of your way in no time.\nI want to thank Representative Prince.\nThe Georgia delegate, thank you all, the Augusta CSRA delegate in specific my, my optometry\nfamily without you, there is no me.\nMy father's here, my father, Dr. Tom Kasella, I'm a third generation optometrist and I've\nknown him my whole life.\nI feel like this was a win for the little guy.\nI practice in downtown Augusta.\nI, I, I, the bulk of my patient base is children and the bulk of my patient base relies on the\nstate of Georgia for its health care.\nSo I want to thank you from the bottom of my heart and the bottom of my patient's hearts\nfor the hard work that this legislative body does to ensure access to care.\nThank you so much for the work that you do and Mr. Speaker, I yield my time.\non the floor of the House two former members, former State Representative\nShaw McVey from down on the Georgia coast. Let's give him a hand. And I saw former\nState Representative Rendon Mangum earlier. Is he still on the floor?\nApparently not, he was with us earlier.\nClerk will read the caption to House Resolution 963.\nHouse Resolution 963 by Representative Frazier 126.\nA resolution recognizing January 29, 2020 as Sickle Cell Day in Georgia and for other purposes.\nChair recognizes representative Gloria Frazier for an invite resolution\nThank you, Mr. Speaker\nAs we continue this great day\nRecognizing our sickle cell\nConstituents who have traveled across the state. I am so honored to have with us today Georgia sickle cell poster child for 2020\nHis name is Camarth Burton and we initially his nickname is redhead\nSo I would like for you all to, he's a 13-year-old 8-grader living with sickle-sale\nanemia and he currently resides in Savannah, Georgia. Please give our poster\nchild a round of applause.\nI'm also honored to have with us today Dr. James Eggman. He is a professor of the\ndepartment of hematology and medical oncology at Emory University. Dr. Emman\nactually established the world's first 24-hour comprehensive acute care\nsickle sale clinic at Grady Memorial Hospital where he served as a\ndirector for 35 years and also joined with us as Dr. Otis Powell, Dr.\nhe is a board certified practicing family medicine practitioner with\nextensive treatment in sickle sale also honored to to know that Dr. Powell\ngraduated from the Medical College of Georgia in Augusta at Augusta University\nAt this time, Mr. Speaker, Dr. Edmund will bring us a few words.\nThank you, Representative Frazier, Mr. Speaker and members, for allowing me to say a few\nwords about this important disease that affects over 8,000 individuals in Georgia.\nThe outlook for individuals with sickle cell diseases improving dramatically.\nChildren born in our state are now reaching adulthood virtually all of the time.\nThere are new treatments available.\nTwo new drugs just to prove by the FDA adds to the two already present giving us few\nfour preventive treatments for the disease.\nAnd a few individuals are being cured by bone marrow transplant and genetic therapy\nthat is on the cutting edge of genetic research.\nUnfortunately, despite all of these advances,\nindividuals throughout the state of Georgia\nare not reaching the benefits of these treatments\nbecause they don't have adequate access to health care.\nThe Sickle Cell Foundation of Georgia\nis working very hard with Augusta and Emory and Choa\nto really improve services throughout the state\nby doing outreach activities.\nThe Sickle Cell Foundation of Georgia\nis having seminars for primary care physicians\nto increase their knowledge so they can take care\nof these patients.\nThey have a network of community health workers\nthat are coordinating services.\nThey are actually starting clinics\nusing federally qualified clinics, faith-based clinics,\nand public health clinics to provide direct patient care.\nThey are also helping youth transitioning to adult care.\nAnd so they're working very hard to improve the services.\nSo all individuals in Georgia can have these benefits.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nOkay, we're going back now to morning orders.\nChair will remind the members of the one minute time limit.\nChair recognizes representative Houston Gaines for a morning order.\nThank you, Mr. Speaker.\nToday, I want to take a moment to recognize occupational therapists for the crucial work\nthey do in our communities.\nOccupational therapists provide essential care to patients across our state who have experienced\ninjuries and illnesses that affect their ability to live self-sufficiently through helping\nindividuals learn or relearn the skills that they need to thrive every day, including\ntasks as simple as brushing their teeth and as complex as relearning to walk on uneven\nterrain.\nCurrently, there are approximately 4,000 active occupational therapists and occupational\ntherapist assistance in the state of Georgia.\nAccording to Bureau of Labor Statistics,\ndemand for this field will grow 33% faster than average\ndemand because of increased aging population.\nI want to thank you for your dedication to your work\non behalf of patients across this state.\nThank you so much.\nThank you very much.\nChair recognizes for a morning order, Chairman Lynn Smith and Chairman Tom McCall.\nThank you, Mr. Speaker.\nChair and McCall and I are here today to explain to you about a return to normalcy in our\nstate of Georgia as far as navigable waters are concerned.\nA few years ago, the previous administration expanded the rules and regs on what's called\nnavigable waters and that's understandable, it means you can run something down a river\nand it started including ditches, furrows, I can't name to you all the things that were\nincluded in it.\nThere's a campaign to try and make the point of a family of four in a canoe and a dry\nditch trying to paddle so it's mainly a best explained through a farmer's viewpoint\nSo I'll turn the rest of my time over to Chairman McCall.\nThank you, Madam Chairman.\nIt's a major, major win for agriculture in your state, not only for agriculture, but\nalso for homeowners with a yard and a lawn that might have water running out of your\ndownspouts.\nThe federal government could control, and I tell folks a lot of times now, you can go to\nthe bathroom on the outside and not create a femoral stream that will come under federal\njurisdiction.\nSo thank you for reading to me.\nThank you.\nFor what purpose does Representative Buckner rise?\nI move I make a motion to move House bill eight ask it to be removed from the\nbit committee of ways and means to the committee of health and human services in\nboth chairman have agreed. The lady has moved that House bill eight be withdrawn\nfrom the ways and means committee and committed to the health and human\nServices Committee, the clerk will read the caption.\nHouse Bill A. Poverty, so I've put in 137th and others\nto be titled an act to amend chapter 8 of Title 40,\n80 of the physical to Georgia, and set everything\nto sales and use taxes.\nOn the ladies' motion, that House Bill 8 be withdrawn\nfrom the Ways and Means Committee and committed\nto the Health and Human Services Committee,\nIs there objection?\nIs there objection to chair here's none and it is so ordered?\nClerk will read the caption to a group of privileged resolutions.\nCommending the University System of Georgia outstanding scholars on academic recognition\nday for 2020, recognizing commending Heather Williamson, recognizing commending Simone\nCrane, Recognizing Commending, Liner, Argaida, Recognizing January 28, 2020 as\nAddiction Recovery, Awareness Day in Georgia, Commending the Georgia Future\nFarmers of America Association, and Recognizing February 18, 2020 as Future\nFarmers of America Day at the State Capitol. Recognizing Commending\nColumbia County's River Ridge Elementary School's River Ridge 313,\nand recognizing the week of February 3 through 7, 2020\nis National School Counseling Week,\nhonoring the life and memory of Cassandra Elizabeth\nCasey Rayford, commending and congratulating Deputy\nSheriff Roger Kenneth Mies upon the grand occasion\nof his retirement, honoring the life and memory\nof Mary Javelin Arp, honoring the life and memory\nof Bill Mason Senior, honoring the life and memory\nof Christine Davis-Stobal, honoring the life and memory\nof a neta bunch, honoring the life and memory\nof Jackie Milam, honoring the life and memory\nof Oscar C. Henry.\nCommending Assistant Chief Community Supervision Officer\nTravis Rucker on being named the Department of Community\nSupervision's 2019 Officer of the Year,\nrecognizing commanding John W. Weaver upon the grand occasion\nwas retirement, recognizing the lunar New Year celebration and for other purposes that\ncompletes the reading of the Privilege Resolutions.\nYou\nYou\nYou\nIs there any objection to adopting the privilege resolutions that Chair here's none in the resolutions\nare adopted. We're going on now to announcements. Chair recognizes representative Kendrick for an announcement.\nIf you have an announcement, please come up to the front and be prepared.\nThank you, colleagues. You have a flyer on your desk. There is going to be a Facebook\ntraining, like the Facebook is coming down to give an exclusive training to legislators\non how to engage with constituents and they're going to give you a data and IOT update.\nSo please come next Tuesday from 12 to 1 in room 307. They will be providing lunch and\ngiving you a training on how to get the blue check and all those fun things with Facebook.\nThank you.\nThank you very much.\nChair recognizes representative Maren and representative Moore for an announcement.\nThank you Mr. Speaker.\nGood morning.\nI just want to remind the Wynette delegation that we're meeting today at noon on room\nfive, ten, over at the CLOB for our monthly win-ed delegation meeting.\nWe have Mr. Rudy Bowen candidate for DOT for re-election speaking to us.\nSo again, thank you, thank you, Mr. Speaker.\nAnd members, following the GUNAT delegation meeting today, we will also be meeting for\nthe 7th Congressional District G.Election.\nSo if you have any territory within Congressional District 7, we are meeting today 2 p.m. Senate Chamber. Please be there. Thank you.\nto recognize his representative Evans for an announcement.\nbut the cab delegation will meet in room and CLOB 514 upon adjournment. Thank you.\nChair recognizes Chairman Sam Watson for an announcement.\nThank you, Mr. Speaker.\nRule caucus will be meeting today at 201\nin the Department of Agriculture at noon.\nWe've got our Georgia EMCs coming in to talk\nabout broadband and where they are today.\nHope to see you there.\nThank you.\nChair recognizes Chairman Darlene Taylor\nfor an announcement.\nAnd before you give your announcement,\nDo y'all know that today is her birthday?\nOh, thank you.\nWish you a happy birthday.\nThank you, Mr. Speaker.\nThank you.\nSome people do anything to get in the well on their birthday.\nI know.\nIt doesn't hurt too bad.\nThank you, Mr. Speaker.\nThe House Committee on Appropriations, Transportation\nSubcommittee will be meeting in the morning, Thursday,\nJanuary 30th, at 8 a.m. in CLOB 515.\nThank you.\nChair recognizes Chairman Beverly for an announcement.\nThanks, Mr. Speaker.\nThe Georgia House Democratic Caucus will meet tomorrow morning 8 a.m. please be there\non time.\n8 a.m. breakfast will be served, thank you.\nto recognize this Chairman Harrell for an announcement.\nThank you, Mr. Speaker.\nThe Abelorm Subcommittee, O'Waison,\nmeans we'll meet this afternoon at two\nand the newly, Chris and Jay Powell Conference Room\nin 133, and we'll be taking having a hearing\non House Bill 504, two o'clock and 133.\nChair recognizes Chairman Dickey for an announcement.\nThank you, Ms. Speaker.\nThe House of Propreation's Education Subcommittee will meet this afternoon at 3 o'clock in\nroom 606, Education Subcommittee. Chair recognizes Chairman Dempsey for an\nannouncement. Thank you, Mr. Speaker. I'd like to make you all aware that the\nHouse Appropriations Human Resources Committee will be subcommittee. We'll be\nmeeting today and 406 over in the Coverdale building at one o'clock.\nI know these are issues that each of you care about and are hearing about\nfrom your constituents. So as we tackle the conversations\nabout these potential cuts, I hope you'll all show up\nand help us do the work that we are charged with doing.\nThank you, Mr. Speaker. I yield the well.\nChair recognizes representative Douglas to introduce the\nthe doctor of the day.\nI was waiting on him.\nGood morning.\nThank you, Mr. Speaker.\nColleagues, it's my pleasure to introduce the doctor of the day.\nDr. Tom Smith is a board certified by the American board\nafter ophthalmology.\nNo, orthopedic.\nOrthopedic.\nWe were talking about this earlier with the ophthalmologist.\nAnd then I get up here and do the same thing.\nSurgery in American Academy of Ortho Surgeons.\nFellow, Dr. Smith is fellowship trained in both shoulder,\nsurgery, y'all listening up.\nY'all might need him, shoulder surgery, and sports medicine.\nDr. Smith is the founding member of Ortho Atlanta.\nHis practices include orthopedic surgery\nwith specialties and interests of sports medicine,\nshoulder, hip, knees, knees disorder,\nfractures, and orthoradic joint reconstruction.\nSo if you're listening, you need him.\nHe's also my constituent.\nGreat guy, great family guy.\nis my pleasure to introduce the Doctor of Day, Dr. Schmidt.\nThank you, Representative Douglas, Mr. Speaker, thank you.\nJust one minute to say it's my pleasure to serve here.\nI appreciate the service, the hard work, the commitment,\nthe instruction that you give us as citizens.\nAnd on behalf of the Medical Association of Georgia and the Georgia Orthopedic Society,\nit's my pleasure to be here and spend a day with y'all and know that I'm here with\nNurse Mac all day and I'm happy to serve.\nSo do well, thank you.\nYou\nChair recognizes the majority leader of the house for a motion.\nMr. Speaker, I moved to this house stand adjourned until 10 a.m. Thursday, January 30, 2020.\nThe majority leader has moved that this house be adjourned until Thursday, January 30 at 10am.\nAll those in favor of the motion will say aye, those opposed will say no.\nThe ayes clearly have it.\nThis house is adjourned until Thursday, January 30 at 10am.\nYou\n",
  "updated_at": "2026-02-12T16:07:22.183529+00:00"
}