{
  "video_id": "KrrO3CGLIY4",
  "url": "https://youtu.be/KrrO3CGLIY4?t=967",
  "title": "Georgia House - Day 10 (2026-01-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-01-26",
  "duration_minutes": 93,
  "summary": "Overview: The Georgia House session on January 26, 2026 featured a prayer and scripture reading by a retiring pastor, as well as a report from the Committee on Information and Odds. No substantive legislation was discussed.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- Pastor Duane Huitt, who recently retired after 23 years as pastor of Ridge Road Baptist Church, gave the opening prayer and remarks. He encouraged the representatives to make their mark and do something meaningful for the people of Georgia.\n- The representative from the 64th district, Kimberly New, introduced Pastor Huitt and spoke about his long career and dedication to serving the community.\n- The Chair of the Committee on Information and Odds noted that this was the 10th day of the session, marking 25% completion of the legislative session.\n\nVotes: None detected.\n\nAttendance: A quorum was present, with all members voting to signify their attendance.\n\nAdjournment: The session adjourned, with the next session date unspecified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you good The Ottawa for convening heaven arrived. All members will please come into the chamber and take their seats. Mr. Clerk will you ring the bell. Good morning members. We're going to have the morning row call. All members present will please vote green to signify your presence in the chamber and the clerk will unlock the machines. All members voted. All members voted. If so, the clerk will unlock the machines. Good morning. Glad to see you all. If I forget to tell you later, hope everyone has a good weekend and everyone's safe. Doorkypers, will you please close the doors and keep them closed? As is our custom, we will begin the day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 64th House District represented Kimberly New, representing New. Good morning colleagues. Thank you Speaker. It is my honor today to introduce my friend, Pastor Duane Huitt. He's highly respected individual who has dedicated his life to serving God and spreading the gospel. Pastor Huitt was born in Haram, Georgia. He has deep roots in Pauline County and he accepted Christ at the young age of 12 years old. He felt the calling to preach the gospel when he was only 16. After graduating from Kingsway Christian School in Douglasville, Georgia, Pastor Huitt joined the Navy Reserve and served a country for six years. He also pursued his education at the West Georgia Biblical Study Theology Seminary. Through his 23 years as pastor of Ridge Road Baptist Church in Hiram, Georgia, he has made a significant impact on the lives of the community and the congregation. I would be remiss to Miss Vicki if I did not say he's not only a dedicated pastor, but also a living husband. They have been married for 38 years. They have three children, Chris and his wife Chloe, Caleb and his wife Diana, Amanda and her husband Chad, and today he's joined today by brother George Hill. Pastor Huitt also has 12 grandkids. He's been a source of support and inspiration to many, including myself, offering prayers and guidance to anyone in need. We are truly honored to have brother Duane here today. His faith, friendship and dedication to serving God make him a remarkable individual. And he retired this past Sunday. So fresh, at a retirement, he's been gracious to come and visit with us today. So it is my honor to introduce my friend, Pastor Duane here. Good morning. Mr. Speaker and distinguished House members, thank you for the opportunity. I appreciate the honor that's been bestowed upon me today. This can't thank you for your time words. I'm just an old country preacher boy from the Pauline County, Georgia. If this is a big deal for me. As I began to consider my thoughts, I was drawing a blank as often I do. And I received a phone call from a pastor friend in North Georgia. And as representative, new stated, I just retired from redrobed by discharge after 23 years. And this pastor friend called to wish me best and let me know that he was thinking of me. My friend from North Georgia said probably one of the most humbling compliments that I've ever heard. He said, Pastor, he said, you made a difference. Redrobed is better than it was when you got there. And I thought, my, what a thought. And I'm humbled by that thought. But I began to ponder what my friend said. And I thought about the words of the apostle Paul on 2nd Timothy chapter 4, where he said, I thought of good fight. I finished my course. I've kept my faith and henceforth is laid up for me a crown of righteousness, which the Lord, the righteous judge, shall give me at that day. And not to me only, but also unto all them also that believe that love has appeared. And not that I'm wishing, you know, Paul was, Paul was preparing for his death. And I'm not wishing death on anybody today. You understand that right? But I'd like to consider this thought for just a second. When we leave this chamber today, will the state be any better because of what we've done today? When we, when this session is over, will the state and the, and the, your constituents be improved, or their life be better by what's accomplished here today? But most importantly, when we leave this dirt ball we call earth, with our family, our friends, our relatives, those close to us, being better off for having known us. And that's my goal in life is to leave a good footprint. We leave our mark everywhere we go, good, bad or indifferent. We're going to, we're going to leave our mark. And folks, if I can encourage you today, make your mark count. Make what you do today, count, because we're not promised tomorrow. And I appreciate this. Listen, let's do something today to make a difference, okay? Can we do that? All right, let's stand as we pray. Pray with us, our most high God, our Heavenly Father, we come to you today as needy creatures. We ask forgiveness for our sins and our shortcomings in life. And, Lord, since we last spoke, we ask you to forgive us of those sins. Lord, we thank You for Your love and Your kindness toward us, we're unworthy of all Your gifts. We especially thank You, dear God, for the greatest gift of all Your precious Son, Jesus Christ, who, through His death, on the cross, we are forgiven. Now, Lord, we ask You to bless the efforts that's put forth in His chamber today. Please be with each representative as they go about their business. Lord, I pray that You give the speaker wisdom and guidance as He oversees the business of the day. May much be accomplished for the people of our great state of Georgia today. Give a safety to God, and Lord, I pray for our law enforcement, I pray for our military, Lord, I pray to God for those that are serving us to keep us protected. Lord, I pray that You had just protect them today. Protect everyone in this house, Lord, God, and direct, and use us today for Your honor and Your glory. We ask this in the Holy Name of our Lord and Savior, Jesus Christ, Amen, and Amen. Let's pledge. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible, with liberty and justice for all. Thank You all so much. That was awesome. Thank You, Lord. It's a message we need and I appreciate You. Thank You, Brother Dwayne. We appreciate that message, and I can assure you that's what this house is about, getting things done for the betterment of all Georgians, and thank You members for that, and thank You, Brother Dwayne, for being here. Doorkeepers unlock the doors and let the members go into the any rooms, and you can join Brother Dwayne into the south any room and meet Him, and express your appreciation and take a photo. Thank You. Members, our Doctor of the Day has been invited and brought to this place by Dr. Skis, by Representative Carlton Howard. Representative Howard, thank You for the invitation to Dr. Eric Luc Witts. That's pretty close. We appreciate Him being here. And if you need Him, He's down in the aid station, so take advantage of Dr. Eric. Be in here and take care of our needs. Chairman, Tarwin is recognized. The Chairman of the Committee on Information and Odds. Mr. Speaker, your Committee on Information and Odds has read the journal from the previous Legislative Day and found it to be correct. And just on another high note, this is a day 10, which is one-fourth of the session being through. 25% ends today. And when you think there's always remember that nothing's impossible, because the word impossible, the letters in the same order, with a little spacing and punctuation, says, I'm possible. You're good, I'm sorry. Great mathematician and a philosopher. Thank you there. That's good. Chairman, Tarwin, the Chair of the Committee on Information and Odds reports that the Journal of the previous Legislative Day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair, here's none. And the Journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none. And the Journal is...\n\nfirm. Mr. Clerk, will you read the resolution establishing the order of business for the day? Perhaps an optional 104th Moose filing be established as the order of business in the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of House Bill and resolutions, second reading of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business business for the day? Chair has known and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 1033 by Rochden of Lever, the 123rd Smith of the 18th Anderson, the 10th Williamson, the 112th House, the 72nd. Bill B. Toddl, the act of a men chapter 5 of the title 16 of the official go to Georgia, and it's a relief to crimes against the person. Judiciary non-subal. House Bill 1034 by Rochden of Franklin, the 160th Corb of the 174thagan, the 156th Dickey, the 145th Parish, the 158th. Bill B. Toddl, the act of a men chapter 4 title 1 of the official go to Georgia, and it's a relief to holidays and observances. Special rules. House Bill 1035 by Rochden of Cooper, the 45th Hawkins, the 27th Seapall, the 34th. Stoner of the 40th, the dumpsey of the 13th. Bill B. Toddl, the act of a men, art of 3d chapter 13 to title 16 of the official go to Georgia, and it's a relief to the dangerous drugs. Public and community help. House Bill 1036 by Rochden of Daniel 117th, Duke Nick of the 29th ballot of the 147th. Jones of the 25th, new of the 64th and others. Bill B. Toddl, the act of a men, go to section 22, 142, the official go to Georgia, and it's a relief to the prescribed courses. Education. House Bill 1037 by Rochden of Daniel 117th, hatched to the 155th main, or the 56th. Vance of the 133rd, new of the 64th and others. Bill B. Toddl, an act of a men, chapter 2A, title 31 of the official go to Georgia, and it's a relief to the Department of Public Health. Public and community help. House Bill 1038 by Rochden of Daniel 117th, lever of the 123rd, hill of the 48. Vance of the 133rd, made the act of 74th and others. Bill B. Toddl, an act of a men, art of 2, chapter 5, a title 16 of the official go to Georgia, and it's a relief to the relating assault and battery. Judiciary non-subm. House Bill 1039 by Rochden of Hilton of the 48th, ballot of 147th, Daniel 117th, bombed Han of the 17th, saints of the 180th and others. Bill B. Toddl, an act of a men, art of 2, chapter 5, a title 21 of the official go to Georgia, and it's a relief to the campaign contributions. Governmental affairs. House Bill 1040 by Rochden of Hilton of the 48th, Williams of the 148th, bearer to the 24th, McCollum of the 30th, Chastain of the 7th and others. Bill B. Toddl, an act of a men, art of 13, chapter 1, a title 7 of the official go to Georgia, and it's a relief to the licensing of mortgage lenders. Bikes and banking. House Bill 1041 by Rochden of Stephens, the 64th, Hitchens, the 61st, featuring the 166th, Westbrook, 163rd, Jackson, the 165th and others. Bill B. Toddl, an act of men, code section 57, 55 of the official go to Georgia, and it's a relief to the creation of the Savannah Georgia Convention Center Authority. Economic development, enterism. House Bill 1042 by Rochden of Kendrick of the 95th, McCleen of the 109th. Martinez is the 111st, frustration of the 104th, Clark the 108th and others have built a title act to a men, the act creating a court of squart of the Coeneth County. Governor, intergovernmental coordination, excuse me. House Bill 1043 by Rochden of Hilton of the 48th, Rochden of the 124th, Jackson of the 128th. Bill B. Toddl, an act of men, title 7, 10, 36, 46, and 48 of the official go to Georgia, and it's a relief to the banking and finance. Yes. Banks and banking. House Bill 1044 by Rochden of Anderson, the 10th, lumps into the 12th. Hawkins of the 27th year to the 150th, lever to the 123rd, and others. Bill B. Toddl, an act of men, title 10, title 13, if the official go to Georgia, and it's a relief to contracts for public works. Governor, mental affairs. House Bill 1045 by Rochden of Clark, no 100th, Jones the 25th, Jasper's the 11th, Barrett of the 24th, Ridley the 6th and others. Bill B. Toddl, an act of men, title 2, title 20, the official go to Georgia, and it's a relief to elementary and secondary education. House Bill 1046 by Rochden of Clark, no 100th, Jones the 47th, Barrett of the 24th, made the act the 74th and others. Bill B. Toddl, an act of men, title 16, 13, 72, 16, 31, 62, and article 7, chapter 7, title 31 of the official go to Georgia, and it's a relief to the sale. Distribution or possession of dangerous drugs. Hilt. House Bill 1047 by Rochden of Bird of the 20th, the bill be title, an act of men, code section 48720, the official go to Georgia, annotated, relaying individual tax rates. Ways and means. House Bill 1048 by Rochden of Carpenter of the... House Bill 1048 by Rochden of Carpenter of the 4th, Hottleston and 72nd, Cameron of the 1st Hilt and the 48th, Mance of the 133rd, bill be title, an act of men, article 3, chapter 3, title 50, the official go to Georgia, annotated, relaying other state symbols. Special rules. House Resolution 871 by Representative Coie, the 102nd of Resolution, proposing an amendment to the Constitution so it's to provide that numbers the General Assembly elected in 2026 and thereafter shall serve four year terms. Governmental affairs. House Resolution 872 by Rochden of Bird of the 20th of Resolution, voting impeachment chargers against Affanti T. Willis. Rules. House Resolution 901 by Representative Dempsey the 13th, Resolution compensating Mr. Daryl Lee Clark. Appropriations. House Resolution 902 by Representative Dempsey the 13th, Resolution compensating Mr. Joseph Samuel Watkins. Appropriations. That completes first readers. Second reading of bills and resolutions, Mr. Clark will read. House Bill 1010 by Representative Jones of the 47th, Dempsey of the 13th, Silk Hots of the 53rd Ballard of the 147th, Daniel of the 117th and others. The bill relating to personnel administration relative to public officers and employees, House Bill 1011 by Representative Montana of the 17th, followed the 19th, Daniel of the 117th, Lever to the 123rd, Canada of the 172nd and others. The bill relating to other unfair methods of competition and unfair and deceptive acts for practices and business of insurance, House Bill 1012 by Representative Williams of the 148th. A bill to provide for the compensation of the Wilcox County Board of Education, House Bill 1013 by Representative Thomas of the 21st, Parsons of the 44th, Carson of the 46th, Bird of the 20th. A bill to amend and act to provide a home say exemption from all city of Woodstock, Adelor and Taxes. House Bill 1014 by Representative Workhyes are of the 157th, Reeves of the 99th, Silk Hots of the 53rd, Hulcom of the 81st, Smith of the 18th and others, a bill relating to criminal procedure, House Bill 1015 by Representative Donald of the 26th. The bill relating to the imposition rate, competition exemptions, credits relative to income taxes. House Bill 1016 by Representative Bruce of the 61st, Thomas of the 65th, Blaze of the 67th, Miller of the 62nd, Willes of the 55th and others. A bill to create the city of South Fulton Public Facilities Authority. House Bill 1017 by Representative Sebal of the 34th, Reeves of the 99th, Pratchett of the 176th, Crow of the 118th, Silk Hots of the 53rd and others. A bill relating to criminal trespass. House Bill 1018 by Representative Ridley of the 6th, Roads of the 124th, Pratchett of the 176th, Williams of the 148th, Ridley of the 22nd. Others are bill relating to commerce and trade, crimes and offenses respectively. House Bill 1019 by Representative Reeves of the 99th, Burns of the 159th, Blackwood of the 146th, Jones of the 47th, the 134th and others. A bill relating to tax exemption. House Bill 1020 by Representative Seins of the 180th, Ballard of the 147th, Pratchett of the 176th, Loaded of the 175th, Blackwood of the 146th, a bill relating to tax credits for business enterprise and less developed areas. House Bill 1021 by Representative Daniel of the 117th, Burns of the 159th, Blackwood of the 146th, Willes of the 112th, Silk Hots of the 53rd and others. A bill relating to the imposition rate, computation exemptions and credits relative to income taxes. House Bill 1022 by Representative Seins of the 180th, Smith of the 18th, Demptsy of the 13th, Maynard of the 56th, Towns of the 179th. A bill relating to the cruelty to children. House Bill 1023 by Representative Williamson of the 112th, Blackwood of the 146th, Squirre of the 118th, Silk Hots of the 53rd, Hilton of the 48th and others. A bill relating to the imposition rate, computation exemptions and credits relative to income taxes. House Bill 1024 by Representative Blackwood of the 146, Willes of the 112th, Wade of the 9th, Hong of the 103rd, Meeks of the 170th and others. A bill relating to management of budgetary and financial affairs. House Bill 1025 by Representative Ridley of the 22nd, Thomas of the 21st, Jasper of the 11th, Balancer of the 23rd, Jones of the 47th and others. A bill to amend and act, providing a home study exemption from Cherokee County School District at Lauren, Texas. House Bill 1026 by Representative Hagan of the 156th, Abstration of the 104th, Preshed of the 176, Jones of the 47th, Sains of the 180th and others. A bill relating to state symbols. House Bill 1027 by Representative Ballard of the 147th, Jones of the 25th, or one of the 32nd, Dominic of the 29th, Corner of the 3rd. A bill relating to competencies and core curriculum under the Quality Basic Education Act. House Bill 1028 by Representative Le Heard of the 175th, Cooper of the 45th, Dempsey of the 13th, Hilton of the 48th, Oliver of the 82nd. A bill relating to education. House Bill 1029 by Representative Matthew of the 74th, Cooper of the 45th, Maynard of the 56th, Camp of the 135th, Hagan of the 156th, Abil of the 186th, Abil of the 186th, Abil of the 186th, Control of Hazardist Conditions, Provincible Disease, Metabolic Disorders. A bill relating to the 30th by Representative Provincible, the 118th, Daniel of the 117th, Camp of the 135th, Mathiac of the 74th, Sains of the 180th and others. A bill relating to domestic relations. House Bill 1031 by Representative Blackman of the 146th, Knight of the 134th, Martin of the 49th, Provincible of the 118th, Abil relating to Advalor and Taxation of Property. House Bill 1032 by Representative Scott of the 76th, Davis of the 87th, Scofield of the 63rd. A bill relating to regulation. A special land transactions relative to property. House Resolution 854 by Representative Huttleston of the 72nd Chaspers of the 11th, Collins of the 71st, Smith of the 18th. Resolution honoring the life of Mr. Keith Jackson and dedicating an intersection in his memory. House Resolution 869 by Representative Bruce of the 61st Jackson of the 68th, Williams of the 168th, Alexander of the 66th, Canon of the 58th and others. Resolution urging the Secretary of State to keep down on John Trump, Anya and all ballots relating to the nomination of candidates. For or election to the office or president of the United States. House Resolution 870 by Representative Scofield of the 63rd, Kendrick of the 95th. Scott of the 76th, Davis of the 87th Hutchinson of the 106th. Resolution urging Congress to renew or extend the affordable connectivity program to 2024. So, it's all qualifying households in Georgia will have access to affordable high-speed internet service. Senate Bill 338 by Senator Satsulur of the 37th. Her Patrick is the 32nd Albers of the 56th. A bill to amend an act providing for the election of members of the Board of Education of Cobb County. Three Second Readers. We have no reports from standing committees this morning. Understand Mr. Clerk, so we'll move on to morning orders. Representative Wilkerson. I'm sure the world is a safer place because of what y'all have been talking about this morning. Representative David Wilkerson has a morning order. He has some friends with him. I think you're going to recognize some folks. I am. Thank you, Mr. Speaker. The member you're attention so he can adequately speak to his friends. Now you're ready. Thank you, Mr. Speaker. Today I rise along with my colleagues to recognize Gotcha Covered Blankets. Gotcha Covered Blankets was founded to honor the life of Mitchell, Georgia. We lost Officer, Georgia in 2021. We've talked about the importance of recognizing the signs of suicide and those that we have lost. In tragedy though, sometimes great things happen. And I've gotten to know that your Georgia and the family by the great work they have done and tonight I'm going to be attending their gala. And what they do is they raise money to purchase blankets, which was a passion of their son. And through these blankets they give them people when they run into homeless families or a car accident. But Mrs. some amazing work that you guys are doing. And I want to I just want to thank the family members that are here and I want to let you know that we are here to support you and continue to support you. No, not going. Today we have their parents Donna and Paul. We have family members Katie. Tyler Black is here. Mitchell Cook. Debbie Holyfield, Janice Betts, Dave Betts, and Captain Chris Michael, who I understand works with a lot of these officers because we have a lot of law enforcement in here and many of you lost friends. First responders that have lost friends and it's times like this that make the work that we do so important. And I just want to thank you all for standing with us and I just want to recognize the family. If you don't mind, give them a round of applause. Please stand. Thank you. Bless you all. Thank you, Mr. Speaker. To the family, thank you. I know of no greater tribute and help our fellow man to honor a loved one. So thank you for being here and thank you for what you're doing for the people who need the help and appreciate that help. This is a great tribute. So thank you. I know you're suffering, but we appreciate it. I know it's got to be warm. Jaws Hart, too. So thank you so much. I don't remember. I don't remember. I think my point was that. I don't remember. I don't remember. I don't remember. Okay, members, our beloved rules chairman, chairman Smith has presented us with a rules calendar this morning. So we're going to call our first bill on the rules calendar. Mr. Clerk, will you read the caption to House Bill 434 or 434, Mr. Clerk? House Bill 434 by resident of Hawkness, 27th, 127th, Dempsey, 13th and others. Bill B. Toddle, Mac to amend article on chapter 34, title 43. The Fitch go to Georgia, annotated, relating to Georgia composite medical board. So it's a reminder of the licensing of radiologist assistance. Ms. Bill lemma, for the committee on health, that committee recommends the dis bill do pass. Chairman Hawkins, you ready? Okay, members, give the member and the well your attention. He's presenting the bill that's been well-vited. So the chair recognizes chairman Hawkins to present House Bill 434. Thank you, Mr. Speaker. This is a straightforward bill brought to me by the radiologist of Georgia. We have a situation in this state where we've got a vastly growing population, but the production and of education, of residents of radiologists is not keeping up with that. So they have actually asked for this legislation which allows the radiologic technicians to become assistants. They can actually do more diagnostic treatments under the supervision of the radiologist. This will thereby allow folks to get in much quicker for their diagnostic procedures and then resulting treatment would occur much quicker, which is something we need to do in this state. If you look at the inside of the bill, it allows the board to promigate rules to develop the educational requirements for these RAs. These will be known as RAs. And if there are no questions, Mr. Speaker, that is the bill. Thank you, Mr. Chairman, you yield for a question. Yes. Representative Jasmine Clark has a question to your left. Representative Clark. Thank you, Mr. Speaker. Does the gentleman yield? Yes. Can you just clarify for us right now prior or before we vote on this bill, what exactly is the different roles between a radiation technologist and a radiation technician and a radiation assistant? That's a great question. Right now, the technician goes to school for two years to be able to do some other procedures like when you go in and they do ultrasound and things like that. An assistant goes to school in additional 18 months and they can do additional procedures, contrast mediums and things like that. So a decision on further yield? Yes. So with this bill, would that mean that radiation technicians should now have to do that additional schooling or will they stay at the two years and the position of radiation assistant pretty much goes away? I guess the position of radiation technician, essentially. No, no, the technicians will still have their jobs and still be doing what they do. You'll just have an added layer of additionally trained assistance. That will not lose their jobs. They're very important with what they do. Thank you. Uh-huh. General, you yield for a couple more? Yes, sir. Representative Park Cannon to your left has recognized for our question. Thank you, Mr. Speaker, do you yield for a question? I do. Just curious, is this include Arthur Graham's or mammograms? I think it would. You know, the board's going to be making the decisions of what they're doing. So I think I'm pretty sure that's the direction they're heading in. Thank you. You have one more Chairman Martin to your right has a question. Uh-huh. I think you recognize for a question. Yes, sir. Would the gentleman yield for a question? I will. Just to clear this up, because I know people are thinking the same thing that you and I talked about yesterday, isn't it true? Can you assure us the people that are doing whatever they're doing today? If this bill passes, they can still do that without any further licensure. It's just if they want to do more, they would have to get the lost. Is that the case? Yes. So what you're doing is taking a technical, allowing them to go to that 18 months of extra schooling, which is happening in other states and then they come back here, North Carolina predominantly. This codifies it in our laws. We're modernizing what the laws say right now. We're behind technology. Just brief follow up the gentleman yields. Yes. So this doesn't, if anybody doesn't want to take advantage of this, they can continue to practice for the citizens, George, just like they ordered that. Absolutely. Thank you, gentlemen. Thank you. No further questions? I'll yield the well. Gentlemen, he has a good, another question you want to take one more? I'll take it, sir. Representative Bennett to your left has a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Is it not true that by the licensing of the radiologist, radiologist assistance that it is a further layer of protection for our public by the licensing? You're exactly right. Thank you. Thank you for the question. Good be on. Good questions, good answer, good bill. Thank you, sir. You have no further questions. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the port of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Have all members voted if so, the clerk will lock the machine on the pass of the bill. The yeas are 400, excuse me, that's the bill, remember. Yeas are a 152, y'all had grown in size. They are really fast on me. The yeas are a 152, the nays are two. The bill, having received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 502-502? House Bill 502 by Representative Silcox, 53rd, August 27th, M.C., 13th, and others to be entitled to amend Article 9 of Chapter 34, Title 43. The Fish Code of Georgia annotated the Georgia Cosmetic Laser Services Act, so as to revise a definition, this bill might refer to the committee on Health Act Committee recommends that this bill do pass. Chair recognizes, Chair Lady Silcox to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House, I'm bringing you this morning House Bill 502. This bill was requested by the Georgia Dermatologist Association, specifically Dr. Alex Gross, who serves on the Medical Composite Board for our state. The bill has essentially two parts. Number one, it updates the definition of cosmetic laser services in the Georgia Code to include all advanced dermatological procedures, and includes ultrasound, cryolypolicis, which is also known as cool sculpting, and as well as microwave procedures. Number two, it revises the supervision requirements of an assistant laser practitioner by eliminating on-site supervision of a senior laser practitioner, but that assistant laser practitioner will still have to be supervised by the senior laser practitioner. I do want to bring your attention to the striking of lines 17 and 18, and those are struck in the bill because the practice of medicine is defined elsewhere in OCGA 433421, and specifically says that practicing medicine is for the diagnosis or treatment of diseases, and since this is only cosmetic, that language is stricken. One also note that, of course, senior laser practitioners have to receive a license under our state law. Either PAs, APRNs, or RNs can obtain that license if they wish to supervise assistant laser practitioners. If there are no questions, Mr. Speaker, how will you yield the well? You have a question, Lady, will you yield for a question? I will. To your right, Chairman Martin has a question. Chairman Sills Cox, you yield for a question? Yes, sir. It's going to be brief, just like I asked the previous gentleman, this will not prohibit anybody that's out there doing work for the Georgians to continue doing what they're doing now. Is that not true? That is absolutely true. I appreciate the question. In fact, it's not true that this will give them the ability to do more with indirect supervision rather than direct supervision. Absolutely. I appreciate your question. Thank you. Thank you. You may have no further questions. Thank you so much. I appreciate your favorable consideration. Is there any objection to the previous question being ordered? Chair, has none of the previous question is ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, has none of the report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill, will vote yes? All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Take your time. I got meetings all day. I'll be glad to stay here with you. Have all members voted? If so, the clerk will lock the machine.\n\nOn the passage of House Bill 502, the yeas are 153, the nays are 1. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 804? House Bill 804 by the ropes and on the seaball, 34th Crow, the 118th Crow, the 174th and 174th. And others, me, a title, an act to amend Article 7 of Chapter 2, a title 40. The official go to George Anitetti relating to motor vehicle license fees and classes, so as to provide for issuance of a distinctive license plate for owners of ambulances. This bill I refer to the committee, motor vehicles, that committee recommends a disbill, do pass. If you haven't noticed this phenomenon before, I'm glad to represent seaball is going to fix this for us. Representing seaball is recognized to present the bill. Thank you, Mr. Speaker. Colleagues, I bring this bill to you at the request of members. This bill comes at the request of members of the Georgia Association of EMS. Members who take great pride in their profession as emergency medical first responders. The current license plate issued to the owners of ambulance services, have the words, hers slash ambulance, at the bottom of the plate. The single plate issued to both the funeral car and the ambulance. The present day, a hersst on the road is usually headed for a cemetery and an ambulance is headed to the hospital. But historically, that has not always been the case. Prior to 1980, the funeral director used the hers to take people to the hospital. And the funeral caucus has confirmed that a hersst was often used to transport people to the hospital, so want to make clear that that was the case. But the same hers was also used to take people by the last people to let you down to transport you to your grave. And some of my North Georgia friends in the back hinted to me that the hersst may have also been used to transport bootleg liquor, but H. Bill 408 does not address that. H. Bill 404 fixes these troubling issues and requires the DMV in the Department of Revenue to issue two distinct plates, one for the ambulance owner with the word ambulance, and one for the hers owner with the word hers. There are no specific design standards, other than what is currently being issued and there's a picture of the plate. The ambulance owner will get their own plate and the hers owner will get their own plate. The bootlegger will still have to decide which vehicle works best for them. Thank you, Mr. Speaker. If there are no questions, I ask for your favorable consideration. You know better than that. You have a question. And I'm going to hold you in the well to answer these questions because maybe not all of them go there mounting up. Let's see this ought to be appropriate. Several of them are. For Lee to make Donald is recognized for a question. Do you know you had a question? Your buttons matched. Does the gentleman yield? I do, to my friend. Isn't it true that many times at a moment, wait a cemetery and there might be a wreck on the side of the road and the people out there flagging me down to stop when I'm in the hersst. And they get out and I'm like, what do you need? They're like, it says you're an ambulance and I have to tell them I can't do nothing for you. Is that true? The man knows of what he speaks. Very practical. No doubt about that. Representative Stenson, right front of you in the back, is recognized for a question. Does the gentleman yield to the strawberry queen I do? Is it not true that I am the queen of the funeral home caucus? And is it not further true that my 2018 hersst that I'm about to trade in for a 2022 and for hers will not have the word amlis written on it? If this bill passes that will be true. And with that I will support your bill. Thank you, Mr. Stenson. Well, I'm interested about what representative hewgley can add to this discussion. The lady is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it true? I want to thank you for making this distinction because in the old days, in the African American community, the hersst was the only thing that would come and get you. And take you when you needed to go to the hospital. So this takes away a vestige of the past that I'm very pleased to see. Isn't that true? That's true. Thank you for that question. Well, this one's been on here for a little bit. Let's see. Representative Jason Griddley is recognized for a question to your extreme right over here. It's gentleman yield. I do. Is it not true to you how a whole lot more leg liver and amlis than you can a hersst? I hope the gentleman doesn't know what he speaks. Representative Reese is recognized for a question to your left. Thank you, Mr. Speaker. Does the gentleman yield? I do. Representative Seaball, you got to be the smartest man in this chamber because I am trying to figure out how did you get a tag deal pass my esteemed colleague, the chairman of rules, who say he is not handling any tag deal. I got to know. That's a good question. I want to know that one too. In fact, I asked that when Representative Reese and I didn't get an answer. So let's see what this is going to be. Well, some folks in the room said that this bill might be dead on arrival. And after a conversation with the chairman, we agreed that it might make it easier for people to know which side to get in. I think one more will do it. The committee. Does this come from your committee? Chairman Corbett is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that this will absolutely help the funeral home caucus because with this present tag, they are not clear whether they need to speed up or slow down? Is that not true? The man knows of what he speaks. Thank you, Mr. Speaker. I yield the well and ask for your favorable consideration. Sorry, chairman Dickie, but... The gentleman has yielded the well. Well, this is really a serious issue, Mr. Chairman. Thanks for recognizing it. We do appreciate what both of these groups of folks do for us, but especially those folks who men, the ambulance, is in our state. As we all know, they run into danger just like any other public safety folks. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. All members voted if so, the clerk will lock the machine. Well, on the passage of House Bill 804, the yeas are 157, the nays are zero, the bill having received the requisite constitutional majority is therefore passed. Congratulations, and thank you for that. I'm sure that'll be a challenge for the Senate to understand, so you've got to work hard over there. That concludes the rules, calendar for the day. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Fountain B. Wims. Honoring the life and memory of William A. Bill Russell III. Congratulations, all of any. Area Chamber of Commerce in recognizing January 30th, 2024 is Albany Dirty County Day at the State Capitol. Recognizing February 13th, 2024 is Georgia Farm Bureau Federation Day at the State Capitol. Recognizing February 2024 is career in technical education month. Commending and congratulating Martha Wheeler. Recognizing commending several nurses at Piedmont, Henry Hospital. Commending Dr. Topey Fapahunda. Commending Dr. Tamika C. in Shannon Mayfield. Commending the Third Infantry Division, the United States Army of Fort Stewart. Hunter Army Airfield, recognizing January 31st, 2024 as Third Infantry Division Day at the State Capitol. Recognizing January 23rd, 2024 is maternal health awareness day. Commending and congratulating William Lefwich. Recognizing commending Trevor Hall. Recognizing February 7th, 2024 as children and advocacy centers of Georgia Day at the State Capitol. And recognizing February 6th, 2024 as good Gwyneth Chamber Day at the State Capitol. And for other purposes, that completes the reading of the privileged resolutions. Is there any objection to adopting the privileged resolutions that Chair here has done? And the resolutions are adopted. We'll move on to afternoon orders now. We recognize representatives Higley and Representative Frazier. The General Lady will hold just for a minute. So members, here's what we're going to do. We want to work on this. I want to work on this and give you all adequate time. Today, we're going to start a new process. We're going to have 15 minutes. I'm not going to cut any of you off, so you can take as much time as you like, up to 15 minutes. And then you can talk to your neighbor. This sign that if you want to take all their time as well. I'm not up here to police each and every one of you and everything you do. So be respectful, be considerate, come to the will. You know about how much time you have a couple of minutes should be adequate. So we'll let you police yourselves on that. We're all adults in this room. Representative Higley and Representative Frazier, you're recognized for an afternoon order. Thank you, Mr. Speaker. Ladies and gentlemen of the House. As the longest-serving woman in this body, I want to bring something to your attention. The most important things we learn in elementary school is please and thank you. We need to recognize and honor those people who make it possible for us to be in this chamber. Those people who are behind the scenes working for us. Those people who are giving us curses. We should honor them by showing them respect and giving them the proper courtesy. So as we go through this session, we're going to get more and more busy. We're going to get more and more anxious. But don't forget about the people who are opening the door for you, who are providing messages to you. Because they are so important to what happens in this chamber. With that, Mr. Speaker, I ask everybody to be considerate and I yield the will. Thank you. Thank you members. Thank you, Representative Hegley. You've been here for a couple of years. So you understand about who makes this place work. Thank you for that. Chairman Carson has recognized for a morning order. Morning, colleagues. I just wanted to come up here and say thank you again for your vote yesterday. I can't tell you how much it meant to the Jewish community. After everything they've been through for, let's face it for thousands of years, but just looking at the last one year, Esther, in regard to the leaflets, the pro-Nazi demonstrations, and not to mention the events internationally on October 7th. I do want to point out to you that tomorrow, tomorrow, Saturday, January 27th is International Holocaust Remembrance Day, just a very sacred day to remember everything that the Jewish people have been through. Mr. Speaker, I'd like Esther to say a word if she could. Yes, you may represent. She's also recognized. Thank you, Chairman Carson. Thank you, Mr. Speaker. John may not be able to tell you how the Jewish community feels, but I can. And last night, they were overjoyed and grateful. And relieved. So I want to extend on behalf of the majority of the Jews in Georgia, I want to extend my personal thank you to each and every one of you that voted yes. And I still have work to do with those who know voted or didn't vote. But I appreciate everybody who voted yes and stood with the Jewish community yesterday. Thank you. Representative, tell the members in case any of the neighborhood would like to be in Savannah tomorrow. Yes. Tomorrow, Saturday, there is the Shabbat services that we had had throughout the state on, this feels like years ago. I think it was the 20th, the 12th, January 12th. And it was incredibly successful. We had over 330 in Atlanta. We had 60 in Macon. We had a group in Augusta. And tomorrow is Savannah's. So whoever can join 11 o'clock in Savannah tomorrow, I will send out the flyer again for the synagogue and directions. And whoever can go is encouraged to go. I promise you'll be treated as heroes tomorrow. Because the entire state, the Jewish community and the entire state is celebrating. Thank you for that information. I will get it for you. Thank you, Miss Speaker. Thank you both. Holocaust, remember it's day, January 27th, that's tomorrow on Saturday. Representative Nollowitz, I want to make sure we recognize you. You recognize for it in afternoon order. Thank you. And if any of my colleagues from the Cobb County Legislative delegation would like to join me, I am here before you this afternoon to note that Cobb County lost a giant yesterday morning. David Hankerson, who's photo you can see up there on the board, was the longest serving county manager in Georgia. He served in Cobb County beginning in 1984. And in 1993, he was named County Manager. Under his tenure, Cobb County earned a triple A bond rating, which it has since maintained for nearly 30 years. More importantly, Mr. Hankerson was a person of tremendous integrity, of tremendous honor, of tremendous fairness. He helped shepherd Cobb County from pasture land to Major League Baseball. Cobb County that you know, the Cobb County that you see today simply would not exist, were it not for David Hankerson. This is a tremendous loss to Cobb County. And I hope his memory is forever honored. He is an alum, a Fort Valley State University here in Georgia. He belonged to numerous professional organizations. He was greatly renowned, greatly beloved, and he will be greatly missed. And I would like to have a brief moment of silence in his honor. Thank you. Thank you so much. Thank you, Rift and Nowoods, and the Cobb delegation. You obviously don't serve that long without doing it right. And no, it's just to the family. And we had a special event this week that we worked hard on, did we cheer Lady Cooper? So cheer Lady Cooper, Rift and Steve, Michelle Owl, are you? You ladies are recognized. Where were you? Thank you, Mr. Speaker. Well, following in what Caroline said, at Caroline said earlier this morning and being thankful to every member of this chamber and to the people listening out across our Capitol, I want to say a great big thank you and Michelle. It wants to join me because of you. The blood drive was a huge success. And we were able to help 72 patients across the state of Georgia get the blood that they needed so desperately. So thank you very much for your help. We're going to do it again. Let's make it even bigger. The next drive will be on March 21st. So get ready then to roll up your sleeve and let's beat this, the great record that we did on this room we had this week. Thank you again. So I was a strategist. Did you give them our totals? Yes, sir. We were able to put it down and break it in that we were able to help 72 patients. Also, donated goes to hospitals all over Georgia, including Emory, Piedmont, Northside, Choa, and Georgia Northeast Medical Center just to name a few. But life, South, you know, supplies blood to all hospitals in Georgia. Thank you so much for your help. We broke a record. Let's break another one next time. March 21st. Put it in your calendar. Thank you, Representative D. Supreme. I'm rich right now. We have about three or four more. So I'm going to ask y'all to be brief. Representative Bell is recognized for an afternoon order. Thank you, Speaker. For the opportunity to speak to our colleagues again. Greetings, everyone. I just want to tell you a quick story about the opportunity that I had to go to Morocco this summer. I studied Invasion Entrepreneurship. Pretty much like here. We've got to other countries and they had panhandlers. But these were little kids as well. Pretty much like the water boys you see here. Very charismatic. They'll come up to you. And, sir, please, missua, missua, buy this, buy this, please, please. And obviously, as an American, I'll say no, thank you, no, thank you. And they will still, hey, missua, missua, please, please. But eventually, I learned a little Arabic. And at the time, I learned was La La Shukran, which means no, thank you. And then I say, oh, no, missua. And they'll still come and say, please, please buy. But then, if you say La La Shukran in Shalah, which means if God wills it, they go, oh, in Shalah. Because there is the sense of if God wills the meaning, there's an opportunity that you may say no. But if you say, my Shalah, they're really sad. Because that means God willed it. And if you tell them, no, thank you, God willed it. That's what the God said. So, it's maybe God's will that we're here doing His work. But we're already doing the work or we're doing the elections. I've noticed that we're on one year off another. And it's kind of like we're really just working for elections. So, please look past the elections. Look at the legislation and know that you'll get reelected if you're working for your district. If you're working for your constituents. So, whether it's red or blue, bipartisan, make sure we're doing the work of our constituency. And you'll be covered. I'm not a pastor, but my grandmother is. She's an her father was too. So, I'll leave you with a quick word. Ephesians 6, roughly verses 11 through X, Y, Z says, put on the full armor of God. And you'll be prepared for whatever battle comes to you. So, I'm telling you, put on that legislation that saves lives of Georgians. Put on the legislation that makes your constituents not only happy but thrive. And you'll be covered in your election. Thank you. Gentlemen, as you do the well, we have about three more. And we have four and a half minutes. Represent Rees is recognized for an afternoon order. Represent Brinnell, you're next. Thank you, Mr. Speaker. I already went for a shed. Asked me to get the word out on House Bill 1019. Mr. Speaker, I appreciate your leadership and chairman Blackman's leadership on tax relief for homeowners in Georgia. It's House Bill 1019. The hearing on that was postponed. It will be in the coming days. But what this does is, for the first time since 1978, it increases the statewide homestead exemption for tax payers. It doubles the homestead exemption. It makes it sends the message that Georgia supports the American dream of homeownership and a time with rising home prices, interest rates, and other costs that make homeowners concerned about keeping their home or buying their home for the first time. And to my 21 colleagues from Gwyneth, help get the word out on the work you did last year, which will go to the ballot in May of this year for the two ballot questions to further reduce the tax burden on homeowners in the past year. The first ballot question would be doubling the homestead exemption in Gwyneth, which is above the state minimum already. And then secondly, giving some additional money to public service employees, hospital, school, law enforcement, and active duty military. And then secondly, Mr. Speaker, really briefly, Holocaust Memorial. I tell school kids about the museum on the fourth floor, and I also tell them now about the new Holocaust Memorial on the first floor. Go to the judiciary committee room, and in that hallway, there is a great Georgia Memorial about the Holocaust. We're doomed to repeat the mistakes of the past if we don't learn from history, and there's a good history lesson here in the people's house on the first floor. Thank you, Mr. Speaker. Thank you. Representing Bernal. Represent Clark, you're next. Thank you, Mr. Speaker. At first I wasn't going to say anything, but after waiting so long in an honor of my dad, who took us to the Detroit Thanksgiving parade, and then to the Lions game. We spent many, many, many, many cold days at Tiger Stadium watching the Lions play. And also I was a babysitter for Tommy Bond who played for the Lions. This is a great day in Detroit. There are two Georgians playing for the Lions from Clayton County, Sutton from Jonesboro High School, and Bill Doher from North Clayton High School. So if you don't have a team to cheer for this weekend, you can cheer for the Detroit Lions. Thank you, Mr. Speaker. Go Lions, Riveting Jasmine Clark is recognized for an afternoon order. Thank you, Mr. Speaker. The lady has about a minute, about two minutes. Thank you, Mr. Speaker. Good morning, colleagues. Today I rise to talk about an important issue impacting way too many Georgians, and that is maternal mortality. I had the opportunity to thoroughly read through the Georgia Department of Health's Maternal Mortality Commission report, and something stood out to me starkly. Out of the top six causes of Georgia's abysmal maternal mortality rate, which include hemorrhage, mental health conditions, cardiomyopathy, cardiovascular and coronary conditions, embolism, and preeclampsia and ekelenopsia, most of them involved a chronic or underlying condition. And throughout the report, a common contributing factor to maternal death was chronic conditions prior to pregnancy. So while yes, the state of Georgia will give you access to Medicaid if you're already pregnant, and yes, I was glad to support legislation that extended Medicaid coverage to one year postpartum, I recognized that fully expanding Medicaid could have saved some of those lives. To clarify, if thousands of working Georgians that fall into the healthcare coverage gap had access to care prior to pregnancy, so they could manage chronic conditions for life-saving medicines and establish a relationship with a doctor for preventative health and education on risks associated with their condition, they may still be here. The department's report specifically states that a contributing factor to maternal mortality is, and I quote, patients had issues accessing medications and primary care to manage chronic conditions due to lack of insurance. That's directly from this report. The red light is on, so I want to yield. Lady needs to get to the end of her statement. I am Mr. Speaker. I will end by saying this. You should not have to be pregnant or have just had a baby to see a doctor in the state of Georgia, and with that, I yield the well. Ladies, you are the well. Thank you for your statements. We got them all. Appreciate y'all signing up and caring about your neighbor that everybody have their say. We have a couple of announcements of very important issues, so we are going to recognize Chairman Tarvan, who has made his way down front. Chairman Tarvan. Thank you, Mr. Speaker. The insurance committee, subcommittee on property and casualty will meet Monday morning at 830 in CLOB. Monday morning at 830 in CLOB, you need to be there because it's very colorful meeting. We have a bill to hear. Thank you. 830 Monday morning. I think we are going to get paid on Monday, so be here. That works. I don't remind the members, don't take off. We have a group of wonderful pages today, so if you have a page, make sure you come down and we adjourn and get a photo with your page. Representative Carter is recognized, Representative Doreen Carter for an announcement. Good morning and happy Friday, y'all is Friday. And because it's Friday, those of you who do not live in a metro-atlanta area that go home for the weekend, I want you to do this one thing for me.\n\nbefore you unpack, pull that red outfit out. To ensure that when you drive back into the city on Sunday afternoon or Monday morning, you have your red outfit for Thursday, February the 1st. It is go red for women. So when are you wearing red? Thursday. Yes, and it's very important because the more awareness we make, the more we'll be able to save a few more lives. Thank you. Have a great weekend. Remind us again. Not now. Next week. Yeah, yeah, we'll, yeah, you got to work Monday. Come on here. You can go back to the well then. Mr. Chairman, Richard Smith, you have an announcement. Chairman Smith has recognized for an announcement. Thank you, Mr. Baker. The rules will meet Monday morning at 9 o'clock, room 341, 9 o'clock Monday morning. Thank you. Thank you, Mr. Chairman. Rules at 9 a.m. Monday. Cheerly to camp, you're recognized for an announcement. Thank you, Mr. Speaker. This is for all Intergovernmental coordination committee members. We are having a meeting upon adjournment in room 341. Meeting today upon adjournment in rooms 341. Thank you. And that'll be in just a few minutes, probably about 1030. Would you say there, Chair Lady, we, yeah, I think you'll be there. So be there at 1030. That concludes our announcements. Now we have a trio of birthdays this weekend. Now we actually have one today. Representative Carlton Howard, happy birthday, my friend. We appreciate you. You all show him some love about their neck corner now. Tomorrow on Saturday, Saturday, 27th of January, Representative Greg Kennard has a birthday, so we appreciate big poppy. And while Sunday, January to 28th, what a special day. The Speaker Pro Tem of this House has a birthday. Is that right? Pro Tem Jones, happy birthday on Sunday. Majority leader of this House has recognized for emotion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 AM on Monday, January 29th, 2024. On the motion of the majority leader that this House stand adjourned until 10 AM, Monday, January 29th, 2024. All those in favor will say aye. Opposed, no. What name close today, the ayes have it. We are adjourned. Thank you all for a good week.",
  "updated_at": "2026-02-13T19:48:09.136313+00:00"
}