{
  "video_id": "kwuv_O7xcpU",
  "url": "https://www.youtube.com/watch?v=kwuv_O7xcpU",
  "title": "Sen. Kim Jackson | Southern Poverty Law Center on Sheltering Injustice | 1/29/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the Georgia Senate session transcript:\n\n## Overview\nThe transcript discusses a report titled \"Sheltering in Justice\" released by the Southern Poverty Law Center (SPLC) Action Fund, which calls for Georgia to stop criminalizing people experiencing homelessness. The report highlights the human impact of these harmful policies, including personal stories like that of 80-year-old Ms. Sylvia and entertainer Jerry Hertz.\n\n## Key Actions\nNo bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- SPLC Policy Director Isabella Tarot announces the release of the \"Sheltering in Justice\" report.\n- SPLC Policy Analyst Gina Azito Thompson shares the story of Ms. Sylvia, an 80-year-old woman experiencing homelessness in Athens, Georgia.\n- Jerry Hertz, a Georgia resident who recently experienced homelessness, shares his personal story and vision for reform.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next scheduled session.",
  "transcript": "Thank you for being here today. My name is Isabella Tarot. I am the Georgia Policy Director for the SPLC Action Fund.\nThe SPLC Action Fund is a catalyst for racial justice in the South and beyond.\nWorking in partnership with communities to dismantle white supremacy, strengthen intersectional movements, and advance human rights for all people.\nWe are very excited to be here today to announce the launch of our latest report titled Sheltering in Justice.\nThis report is the result of a year-long collaboration with many of the advocates that you see here today as we call for our state to stop criminalizing people experiencing homelessness, especially those who have been experiencing poverty for a long time.\nFirst, you were here from the author of this report, my colleague Gina Azito Thompson, who is a policy analyst with the Southern Poverty Law Center.\nGood afternoon. My name is Gina Asido Thompson and I'm SPLC's Eradicating Poverty Policy\nAnalyst. I'm also the author of our new report Sheltering and Justice, a call for Georgia\nto stop criminalizing people experiencing homelessness. I'm honored to be here today\nwith these esteemed guests to discuss the issue of Georgia's harmful practice of criminalizing\npeople experiencing homelessness. Housing is a human right in access to safe and stable\nhousing is essential to a safe and vibrant community, state, and country. Yet the rising\ncost of housing and lack of supportive services mean that many across the state, the majority\nof whom are people of color, especially black people, are deprived of housing and subsequently\nexperience homelessness. Importantly, this is an urgent matter, both in Georgia and across\nthe country. In fact, a recent Harvard report found that more than half of renters could\nnot afford to pay their rent in 2022. And, because of these harmful laws, people experiencing\nhomelessness in the Peach State are also subject to constant interactions with law enforcement.\nFurther compounding the overrepresentation of people of color, both in the criminal legal\nsystem and in those who experience homelessness, the matter before us today.\nTo understand the human impact of this issue, I want to tell you about someone I met around\nfour months ago.\nI was honored to speak with Miss Sylvia, an 80-year-old black woman experiencing homelessness,\nwhose story is featured in sheltering injustice.\nMiss Sylvia was living in a shelter in Athens, Georgia, but sometimes she'd also sleep outside\nusing a poncho to cover herself when it rains.\nNow Miss Sylvia uses a mobility walker\nto assist with her walking.\nAnd while speaking with her, she lifted her dress\nto show me her ankles.\nThey were covered with ulcers,\nand she mentioned they were quite painful.\nYet she had walked three hours the night before\nto get back to the shelter\nbecause she'd missed her last bus of the night.\nTo top off the hardship she experienced,\nMiss Sylvia has also had to deal with criminalization,\nsimply because she didn't have access to housing.\nShe shared with me a story about a time\nwhere she sat down at a shopping center in Athens\nto rest after a long day in the hot Georgia sun.\nShe sat down with a drink to cool off\nand was met with law enforcement\nhanding her a trust pass warning\nafter she accidentally fell off to sleep.\nShe said that she still had a year left on her band\nbefore she could return to the shopping center.\nIn that instance, she was simply sitting and resting,\nthings that we all have probably done in the past few hours,\nbut don't have to think about.\nUnfortunately, Miss Sylvia's story is not an outlier.\nIn 2022, over 10,000 Georgians were reported\nto be experiencing homelessness across the state\nwith more than half of those people living unsheltered.\nFrankly, with all the resources available\nto provide affordable housing,\nthat number was over 10,000 too many.\nIn many of Georgia's districts,\nthe number of people who are living unsheltered\nare disproportionately people of color.\nFor example, between 2017 and 2022,\nblack people accounted for 28%\nof the total population of Athens-Clarke County,\nyet 40% of the unsheltered individual population.\nWhat's more is people, like Miss Sylvia,\npeople experiencing homelessness,\nare also disproportionately impacted\nin the criminal legal system.\nFor example, one in eight,\npeople booked in Atlanta City jail\nwere experiencing homelessness.\nGeorgia has a number of laws\nthat are putting thousands of people\nexperiencing homelessness at risk of arrest.\nIn 2023, the Georgia legislature passed Senate Bill 62,\nwhich forces cities and towns to enforce bans on public camping\nand punishes people for simply sitting\nor sleeping in public places.\nSitting and sleeping are both essential to being human,\nto surviving, yet what defines them as legal\nis whether a person has housing to perform these activities in.\nAs we highlight in our new report,\nthe criminalization of people experiencing homelessness\nhas a human cost.\nMany of the people we interviewed often felt fear, shame,\njudgment, and stress during a time where kindness,\nrather than criminalization, would have gone a long way.\nWe should not expose people to further trauma\nwith the threat of arrests and punishment.\nRather, people experiencing homelessness should be given\nthe opportunity to choose what's best for them\nby providing them with access to resources and housing.\nFortunately, our report sees a path forward.\nSpecifically, as we outlined in the report, we urge Georgia and its localities to take\nthe following steps.\nRepeal, defund, and stop enforcing current laws that criminalize homelessness and\nreform policies that especially impact people with low incomes who are involved with the\nlegal system, like cash bail and probation fees.\nstop sleeping encampments and instead invest in creating pilot programs that allow people\nto access quality housing with cash assistance.\nAnd add housing status as a measure of homelessness to the list of protected categories in relevant\nanti-discrimination laws.\nBut first and foremost, Georgia should always begin with speaking and hearing from those\nmost impacted by its policies, such as those that criminalize people for experiencing\nhomelessness.\nIntegrating and censoring people with lived experience in the efforts to prevent criminalization\nis crucial to preventing further harm in undoing the damage that criminalization is causing.\nThat's why I'm so honored today to be joined by Jerry, one of the people with lived experience\nthat I interviewed to for the report and whose story and vision for the future informed\nits policy proposals.\nAs you'll hear, Jerry is a successful Athens-based entertainer who hasn't let his circumstances\nand experiences with homelessness deter the plans for his future and family.\nJerry's experiences underscores the urgent need for reform so that other people don't\nhave to go through similar situations.\nAnd yet, despite Jerry's experience, he remains warm-hearted.\nI'm inspired by Jerry's determination, strength,\nand hope for the future.\nOne where people experiencing homelessness\naren't criminalized and housing truly is accessible for all.\nThank you.\nGood afternoon.\nGood afternoon.\nMy name is Jerry Hertz.\nI'm a resident of Georgia,\nand I'm honored to be with you all today\nto share my story.\nSo you can see the human impact of historic and ongoing efforts\nto criminalize people experiencing homelessness today.\nLook at me today, and success story,\nwho I have a career as a street entertainer,\nalso known as busking, and a hobby that I also love and enjoy.\nI'm a father of a two-year-old daughter, her name is Journey.\nAnd I've been in my current relationship for over two years now.\nAnd just until recently, I was also experiencing homelessness.\nFor over nine months, I lived in a hotel\nand had not much permanent housing on my own.\nBut before I was in a hotel, I couched her a little bit,\nbut I may live outside, sometimes in a parking lot.\nNow, a single day outside, living is OK, not one day.\nIt also affects and impacts every aspect of your life,\nand it tends to make you hard to trust people.\nEspecially since I became a new father,\nliving outside was something I couldn't let happen\nto my daughter.\nJust trying to revolve for my child,\nI was often approached by law enforcement officers\nwhen I was living on the streets.\nMany times it felt like officers had no respect for me\nsimply because I didn't have housing.\nFor instance, I remember times where police would miss\nhaving my personal items, and on several occasions,\nthey destroyed my property.\nThe things that I used to make a living, like my microphones and my five gallon buckets\nthat I used as drums.\nThis stuff made almost nothing to them, but really meant so much to me.\nI call them priceless.\nIt never broke my spirit though.\nHowever, does the humanizing and embarrassing feelings made me feel like I didn't matter,\nbut I matter.\nAnd I have a right to dignity and respect regardless of my housing situation.\nThat's why it means so much to me that the first proposal of SPLC's new report is that\npeople that with lived experiences like me should be at the center of the efforts to fight\nback against criminalization of people experiencing homelessness.\nWe are statistics, we ain't just numbers, we are real people.\nstories just like the one I just shared with you today, my truth. We are people who need\nsafety and secure housing, affordable rent, and livable wages. At other resources meant\nto support us and securing a full-time housing. This is what we need, not living in constant\nfear of being arrested for just trying to have somewhere to eat and sleep. Today I'm living\nin my new apartment safely thanks to the support and service providers in Athens, Georgia.\nsomething that is permanent to share with my partner and my daughter.\nI will continue to be the voice for the people, such as my hero, James Brown,\nthe Godfather of Seoul as a gentleman.\nWe got to bring this to the frontline.\nWill you stay with me today in the fight for all people who want better,\nbut just don't know the way.\nWe, the people, divided we stand, together we stand, divided we fall.\nThank you for all your time.\nThank you.\nThank you to both Gina for her excellent work\nand for Jerry for lending his voice to this fight.\nNow we will hear, finally, from our last speaker,\nI mean, is going to be Senator Kim Jackson from District 41,\nwho is a longtime advocate in one of our champions.\nWell, good afternoon.\nI am State Senator Kim Jackson.\nand I represent District 41,\nwhich covers portions of the cab and Gwinnett counties.\nI have spent several years fighting to solve a statewide issue\nthat's incredibly near to my heart,\nand I'm excited to be here today\nwith the Southern Parvity Law Center\nand the SBL Action Fund,\nas they release their new report, sheltering injustice.\nAs many of you know, we are dealing with a real crisis in our state.\nAgain, as of 2022, approximately 10,700 people were reported as experiencing homelessness\nin Georgia.\nAnd 52% of those who are experiencing homelessness are sleeping outside in cars or in other places\nnot meant for human habitation. We must address this crisis now. And I want to take a moment to\nacknowledge that the incredible steps of the city of Atlanta has made an alleviating homelessness\nin this city, including the fact that they opened a brand new 40 unit, rebrap it re-housing\ncommunity just this Saturday. A huge thank you to the mayor, Andre Dickens, for signing an\nexecutive order allocating $4.6 million towards continued efforts to end homelessness.\nBut let me be clear. Homelessness is not just an Atlanta issue. This is a statewide crisis that\nthat requires a statewide coordinated response.\nWe and the Georgia General Assembly\ncan and must do more.\nIn 2022, as part of a continued step to address this crisis,\nthe Senate formed a bipartisan study\ncommittee on unsheltered homelessness.\nAnd the Department of Audits and Accounts\nrecently performed an audit on homelessness spending.\nThose reports, the final report from the study committee\nand from the state's audits and accounts initiatives\ncalled for a better, higher level coordination process\nacross agencies in Georgia.\nThe SPLC Action Fund explored this idea\nand together we've come up to the place\nwhere we are wanting to create an interagency council\nto enact practical solutions for this crisis.\nThere are similar councils like this across the states\nand we need one in Georgia.\nThe good news is that our state is not lacking in resources\nto solve the problem.\nWe're just lacking in coordination to solve the problem.\nAnd that's why I am proud to announce today\nthat in coordination with SPLC Action Fund\nand Legislative Council, we will be introducing legislation\nthat revamps our previous efforts\nand helps to create an interagency council on homelessness\nand one that ensures that the council includes people\nwho have first-hand experience with homelessness.\nThis legislation, I want to introduce this legislation\nin the coming weeks.\nAnd I look forward to my colleagues supporting me\nin this effort to do proactive good legislation on behalf\nlove and with those who are experiencing homelessness.\nThank you for your time.\nThank you, Senator Jackson.\nThank you all for being here.\nThank you to all of the advocates behind me\nwho have been part of this fight with us.\nThat concludes today's press conference.\nWe know that other folks need this space,\nso we're going to huddle over here\nto answer any questions from the press.\nThank you all again and have a good afternoon.\n",
  "updated_at": "2026-02-12T19:35:29.229555+00:00"
}