{
  "video_id": "l7uV9GF9AY0",
  "url": "https://www.youtube.com/watch?v=l7uV9GF9AY0",
  "title": "Rules Meeting for Day 35 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 35,
  "video_date": null,
  "duration_minutes": 22,
  "summary": "Here is a structured summary of the key points from the Georgia Rules Meeting transcript:\n\n**Overview:**\nThis session covered a variety of bills, including creating a study committee on motor vehicle dealer regulation, addressing student chronic absenteeism, expediting appeals for municipal immunity cases, expanding support for military children in schools, improving teacher preparation for teaching reading, renaming a bridge for a fallen police officer, regulating human composting, and expanding medical marijuana access. The discussion focused on the substantive details and impacts of these legislative proposals.\n\n**Key Actions:**\n- **HR 558**: Creates a House Study Committee on the State Board of Registration of Used Motor Vehicle Dealers\n- **SB 220**: Expands access to medical marijuana\n- **SB 298**: Allows direct appeals for municipalities challenging immunity determinations\n- **SB 46**: Renames the Hulken Bridge and 400 interchange for Fallen Police Officer Jeremy Obonte\n- **SB 63**: Allows homeschool students to take AP and college placement tests at their residential public schools\n\n**Bills Introduced (First Reading):**\n- SB 236: Expands support for military school-aged children\n- SB 93: Ensures teacher prep programs teach the science of reading\n\n**Notable Moments:**\n- Discussion of using deceased persons' remains as compost, including for growing medical marijuana\n- Debate over whether homeschool students should be able to use public school testing facilities\n\n**Votes:** \nThe bills discussed were generally described as being passed or having unanimous support, though no specific vote counts were provided.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe transcript does not mention a specific time of adjournment or the date of the next session.",
  "transcript": "You\nmorning everybody. If you would please come on in and have a seat and we'll we'll\nbegin our meeting. We're going to ask Chairman Jasper's if he would please\nopen up with order prayer. Spire heads together please. Heavenly Father thank you\nfor another wonderful week. We've worked up coming but what a great weekend we\nhad being with our families and taking care of our health and mental health and\nAll that good stuff. Please look after us. Keep us wise. Help keep us fair and just. We know what this work in your name. Amen.\nThank you, sir.\nOkay.\nChairman, come on out.\nThank you, Mr. Chairman. Members of the committee.\nFirst page six from the top. HR 558.\nhave a House Study Committee on the State Board of Registration of Use, called Motor Vehicle\nDealers. What we're doing with this is just creating a study committee to determine whether\nthe regulation of the use motor vehicle industry would be better suited within the same agency\nthat actually issues the tops and the dealer plates. They've got access to all of the data\nRight now it's in the Secretary of State.\nThey don't have access to the data and it's just a better fit to move it to the Department of Revenue.\nOkay, go see any places.\nThank you, Mr. Chairman.\nKevin Dooming.\nThank you, Mr. Chairman.\nMembers of the Committee, top of the third page, under modified structure.\nI am not Senator Kennedy, but I am here on his behalf to present Senate Bill 123.\nThis chairman unfortunately last year our state faced a very troubling statistic that 23%\nof our students were chronically absent, that's just not a number, that's 380,000 students\nwho missed 10% or more of the school year.\nThis bill is not aimed at fixing that overnight, this is the first step in defining and\ncode what chronic absenteeism is and taking a number of steps to correct it.\nOkay. Go see any questions. Thank you, Mr. Chairman.\nMr. Robertson. Thank you, Mr. Chairman and committee. On page four down toward the bottom\nSB 298, judgment and rulings. What this does is offer a direct appeal for those municipalities\nwho want to challenge a determination that they do not have immunity in cases. Currently,\nthey have to wait until the trials over before they can go back and appeal the question\nof immunity in this case would give them a single bite at the apple on the front end\nof the appeal process and expedite the process protects our counties and city governments.\nOh, get out. Don't see any questions. Thank you. I also have 99 and 100 on there that\nappreciate any consideration.\nThanks, sir.\nYes, ma'am.\nGood morning, Mr. Chairman, committee members.\nPage two of the modified structure room.\nSenate Bill 236 expands the supported military school-aged children\nto streamline a better process for a well-in-air\nto the military orders to involve the children into school?\nI'm sorry.\nPhase 36.\nPhase 36.\nThe modified structure room.\nI'll do a apologize.\nOkay.\nNo questions.\nThank you.\nThank you.\nYes, sir.\nGood morning, Mr. Chairman and committee members.\nI'm on page two, Senate Bill 93.\nAs we all know, we have a reading crisis in the state that we began to address with\nthe early literacy acts.\nWe have 70% of kids that are not reading on grade level, and so this bill seeks to ensure\nthat our teacher prep programs are preparing teachers properly and not teaching the 3QM\nmethod, which is now included in House Bill 307, Representative Dollar's Bill.\nSo this just makes sure that we have an alignment with the PSC and preparing our future teachers\nto be in alignment with the science of reading.\nOkay, I don't see any questions.\nAll right, thank you.\nHave a good time.\nThank you, Mr. Chairman.\nThe distinguished members of this committee on the first page\nin the middle is Senate Resolution 231.\nThis is to rename the Hulken Bridge\nand 400 interchange for Fallen Police Officer Jeremy Obonte.\nI would just like to mention that\ntypically these will fall under an omnibus bill\nand I'm going to ask this not be the way\nbe the way. This is the first and only person we have ever lost in the\nline of duty in the city of Roswell and we want to be able to present this\nresolution to the family by itself not in a big bill in order to know how much\nthat we care about them and his sacrifice for us. The next one is just down a\nfew more on the first sheet. Senate Bill 9, great work led by Representative Brad\nThomas on making sure we keep deep fakes out of elections and other areas to\nto keep our ethics straightforward.\nOkay.\nNo questions.\nThank you, sir.\nSenator, how are you doing?\nThank you, Mr. Chairman.\nOn page four, Senate Bill 241, middle of the page.\nThis is a bill that's going to regulate how human remains\nare a method of disposition through human composting.\nThis is to make sure that Noble Georgia does not take place again.\nThis is being proactive rather than reactive to make sure that if this is ever done,\nthat you're licensed, and regulated, and inspected, okay.\nHave a question.\nThere's no Williams.\nThank you, Mr. Chairman.\nTo the author of the bill, just some clarification,\nAnd I know the funeral director's caucus has unanimously\napproved this, but there's a room\nthat's in clarify, please.\nWill this include the fertilizing of tomatoes and okra\nunder your bill using dear beloved departed as a compost?\nThe compost would be returned to the family member\nif they so desire and then it's up to that family member\nwhat they do with it.\nThey can donate it to a lamb bank.\nYou can put it in your tomato garden, if you wish, or whatever you wish to do.\nI think that's all on that line of questions, there we are.\nThank you.\nThank you, sir.\nI don't see any more questions.\nChairman Brass.\nGood morning, Mr. Chairman.\nI bring SB 220.\nIt could be another use for the compost.\nYou could grow medical marijuana with it,\nwith your loved ones.\nBut this bill simply expands access for those\nthat are already qualified with one of 17 conditions.\nOkay.\nDon't see any questions.\nThank you.\nExcuse me, we do have a question.\nProbtem has a question.\nWhat question does this allow vaping?\nIt does.\nIt does.\nfound that in some of our patients that need immediate reaction or immediate\nrelief from the medicine such as seizures or potentially even PTSD having an\nimmediate episode they would need that immediate relief so that was the purpose\nof vaping.\nOkay. Don't see any other questions. Thank you.\nYes, sir.\nMr. Dixon.\nGood morning, Mr. Chairman.\nCommittee members, I've got two bills on both of them on page two. The first one is SB 63.\nAnd it has to do with the home school students and\nallowing them to take their advance placement testing, their\ncollege placement testing,\nat their residency school if they had chose to go to that school.\nThe issue arose not from anybody under the gold dome.\nIt was actually started a couple of years ago with families in my home county in Gwinnett\nthat were home school parents started reaching out to me saying that they were having issues\nwith Gwinnett and the school system some years they would allow the testing some years.\nThey wouldn't, the years that they would, it would be at a designated location in one\narea in the county and as many of you know, it's visited when our traffic, you know,\ngetting across when it can take over an hour depending on what type of day you're traveling.\nSo parents would have to take off work to do this.\nWhat this bill simply does is in what I believe are these parents are paying their taxes locally\nand at the state level just like all of the other parents are that's going into school\nsystem, so it's not a negative on the school system. They would still be a\nplus, I believe, but it would allow these students to take that testing at\ntheir residency school. They would have to register with that school, so the\nschool would know the student is coming. They would be prepared for that\nbecause that testing, as many of you know, the way they set the desk up and\neverything, you know, they have to be prepared and other other things for the\ntest. But that's what it does, Mr. Chairman. Okay. Don't see any questions on\nYes, I do. It's on page two, SB 82. And it has to do with our charter school system in the state.\nIn the past five years, there's only been one charter school approved locally here in the state of Georgia with over 30 being approved at the state level.\nYou know, that other states, you know, typically 90% of charter schools are approved at the local level, 10% of the state level.\nI believe it's more efficient that way, you know, because they are, you know, going to be, you know, teaching the kids in that local area plus it cuts the burden on the state in half.\nYou know, it's typically about 4 million for a state charter school, and then if it's approved locally, it's about half of that.\nWhat this bill does is got to carry it in a stick.\nIf the local school system's approved a charter school within that year, they would receive an additional $250,000 for three years, in second of years.\nAfter approving that school, if the school system denies, two charter schools, if they've got students between 10,000 and 60,000, if they deny two charter schools, and they're approved by the state later that year.\nthey would lose their flexibility funding.\nAnd if it was a school system that was $60,000 plus,\nit would have to take three to nine.\nWho at Park has a question for you?\nThank you, Mr. Chairman.\nSo can you clarify the penalties\nthat would be imposed on local school districts?\nAnd do you have concerns that this is undermining\nlocal control?\nYeah no I don't believe it is you know I think that you know the movement we've\nhad in the state with more school options you know I think that our charter\nschool system is is a unique option for children and it does fit you know\nmany families and students you know their education options very well there's\nabout 65,000 students that are rolled in charter schools currently in the\nstate and I believe it's yeah 21,000 on a waiting list so there is a need a\ndemand for this and I would say you know that we're able to hold these schools more accountable than\nthe other school system in the state it's a five year charter and if they don't perform then\nthey can be shut down and can you speak to the penalties and the potential financial cost this\nwould impose on local school districts yeah it would it would just if they were denied it would\nwould do a way with reflectability contracts.\nThank you.\nHeagley, you have a question.\nThank you, Mr. Chairman, to the author of the bill.\nJust trying to understand, we elect local school boards\nto make these decisions based on what's\nbest for their communities.\nAnd Gwynette is very different from Columbus, Georgia.\nAnd so you're telling me that if my school system\ndo not find that a charter is in line\nwith what we need in our area and they go\nand the state gives them a charter\nthat our schools are going to lose their loose funding.\nThat would you say?\nIf it was from 10,000 to 60,000,\nthey would have to deny too that we're later approved.\nA pro-TAM has a question.\nI just wanted to ask a question to the senator.\nIs it not true that they would not lose one dime?\nWhat they would lose is flexibility that the state gives them\nin exchange for state priorities.\nWe have priorities that students achieve,\nthat they have a good graduation rate,\nthey have good school climate, all the things that go into\nwhether or not they get the renewal of that flexibility contract and what you're I think\nsuggesting we have since 2008 when we first passed state charter schools that it is a state\npriority that students in Georgia have more public school options and unfortunately that\nhas not borne out at the local level to take further the numbers that you cited there\nhave been three locally approved charter schools in the last 10 years and 56 at the state level.\nWe're simply trying to encourage local school systems respond to our shared constituents\nwho are begging for more public school options.\nThat is correct.\nThank you.\nChairman Newton has a question.\nThank you, Mr. Chairman.\nDo you say it's 250,000 a year for three years as the goal of that, if that's the correct\namount.\nthat to help offset some of the startup expenses\nand students begin to decide or parents and students\nbegin to decide which option is best for their student.\nIs that just to help offset some of those expenses\nand get these schools started?\nThat is correct.\nThat's two, 15 year for three years, is that correct?\nThank you, sir.\nOkay.\nDon't see any other questions.\nThank you, Mr. Chairman, committee members.\nSenator Walker.\nGood morning, so I have three bills on the blue sheet on page three toward second from\nthe top Senate bill 125.\nI've already spoken to this one, Miss Chairman, but it would allow engineers in waiting to\ntake their peak professional engineering exam prior to completing their field work, hopefully\nto improve the pass rate. On page top of page 4 Senate Bill 201, we've seen after especially\nlarge natural disasters, large weather events, contractors come in that are trying to take\nadvantage of our homeowners and rush them into signing contracts for work, especially\nafter Hurricane Michael, Hurricane Elaine, but others, this would give the consumer an\noption to get out of that contract if it happened during, after a state declared\nemergency. And then on down on the same page, Senate Bill 284 would give the Secretary\nState's office a fourth option when they're dealing with securities fraud. Currently they\ncan suspend a license or issue a cease and assist order and they can enforce civil fines,\nthat they do not have in the code,\nthe ability to require the criminal, basically,\nto return invested funds to the defrauded investors.\nThis would give them that fourth option\nand the enforcement of that.\nA lot of times that is negotiated out on the front end\nwhere funds are returned,\nbut it's not in the code.\nSo the party that was defrauding investors\ndidn't cooperate or didn't strike a deal.\nThere's no option to have those funds returned\nto the investor.\nOkay, you don't see any questions.\nThank you.\nYes, sir.\nSenator, come on up.\nMr. Chairman, thank you very much.\nMembers of the committee, page number two,\nfive items down is SB 46.\nThis entitled government serves the people\nand what this is is creating a service matrix\nfor the departments that are in our state.\nThis would be used GTA as the administrative arm\nand then each department would assign one person\nto report to them what we're looking for,\nanywhere from a whole time, what's the response?\nWe're looking at service to our citizens\nand what happens is there's not really a measuring stick\nand our idea behind it with them is to create\na best practices for what's expected and turn around\nand many of the larger departments do a really good job\nbecause they have the resources.\nYour smaller departments don't.\nThe other part that we have had conversations,\nI've met with them even after our last meeting\nis this we need to be aware that many people\ndon't have internet, don't have access to the internet\nand we need that service level to also be available.\nAnd that's one of the things\nthat does not get measured really well.\nSo that's the first one that's there.\nI said this is that we need service metrics.\nYou can't manage what you can't measure,\nand we also have a physical note on it from that standpoint.\nThe second one is that-\nSenator, you've already presented it 46 times.\nYes, yes.\nYou don't have to come, but one time.\nOne time?\nYes, sir.\nI had such a good time, I wanted to-\nWell, we're always glad to have you,\nbut it's not necessary to make another trip,\nbut you're welcome to come anytime.\nAnd if you have a member who has a question,\nmaybe I'll get you to get it offline,\nyou can talk about that. Thank you sir. I appreciate it but it was so much fun. I wanted to come back\nagain. Glad to have you anytime. Senator, come on up. Morning, Mr. Chairman. Ladies and gentlemen of\nthe committee. The only reason I came by is because I miss y'all so bad and I noticed Senate Bill 12\nhas not been picked. It's on the lower end of not the bottom but the lower end of your front page.\nit's a it's a good bill and I hope that you can get it on the floor because it\ndid get modified over here in the house and I need to make sure it comes back\nover to the Senate and we can adopt your recommendation and your changes and\nI just ask for your consideration on that it's one that's supported by not only\nthe Georgia Chamber, the Metro Atlanta Chamber, ACCG, GMA and I think it's a good\ncleanup on a court case that was settled with the Supreme Court.\nNo questions. Thanks, sir. Thank you.\nOkay. We have any members of the committee with a request.\nHave you got one today?\nOkay. All right. Nothing's okay.\nNow we have set a calendar earlier for four bills on for today.\nLet's set a supplemental calendar for today also under modified structured.\nSenate Bill 112, move in second. Is there any opposition? It's on. Senate Bill 123, moved\nand seconded in any opposition? It's on. Senate Bill 149, moved and seconded in any\nopposition it's on Senate bill 193 moved in second any opposition it's on okay\nso that'll give us a total of eight for today\ncall on Chairman Leveritt for an announcement just want to thank you\nMr. Chairman it's one of my everybody that the subcommittee rules on lawsuit\nWe'll meet today at 3 o'clock. We're going to take up Senate Bill 69 so I hope everybody who is interested in that bill will please attend now be in this room.\nThank you. Also the subcommittee will meet from 3 to 5 and then the full committee will meet upon adjournment are immediately there after to consider that bill.\nbill the full rules committee, so we need to see all of you back this afternoon.\nAnd then also on Wednesday tomorrow, we'll have a full rules standing committee meeting\nat 2 o'clock to take up Senate Bill 255, which is in the rules committee.\nAnd then we'll meet upon the German of the rules committee to set a calendar for the\nnext legislative day.\nSo we've got a lot going on, but there's a lot we need to get done.\nThank you.\n",
  "updated_at": "2026-02-12T17:44:59.189349+00:00"
}