{
  "video_id": "L_dgE97eBpQ",
  "url": "https://www.youtube.com/watch?v=L_dgE97eBpQ",
  "title": "1/11/2024 Senate Committee on Health and Human Services",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Health and Human Services session on 1/11/2024:\n\n## Overview\nThis was a brief and routine committee session focused on passing a bill to update reporting requirements for the Georgia Alzheimer's and Related Dementias State Planning and Advisory Council. The bill passed unanimously with little discussion.\n\n## Key Actions\n**HR 571**: Updates the Georgia Alzheimer's and Related Dementias State Planning and Advisory Council to require a mid-point report every 2 years instead of updating the full state plan every 3 years.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee chair noted this bill was being re-referred to the committee after not reaching final passage last session, but was a straightforward update.\n- Committee members praised the importance of the advisory council's work and the value of more frequent reporting.\n\n## Votes\nThe bill passed unanimously.\n\n## Attendance\nA quorum was present, with the chair noting a \"quorum plus\" of members in attendance.\n\n## Adjournment\nThe meeting was adjourned with no further business. The next session date was not specified.",
  "transcript": "Thank you.\nBody to the first meeting of the Senate Health and Human Services Committee, and I'd like to call the meeting to order and\nAnd Senator Jackson, if you wouldn't mind saying\ninvocation force, please, your own mic number 10.\nLet us pray.\nHoly God, we come this day giving thanks\nfor the opportunity to gather to make decisions\nabout this our great state.\nWe pray for all who live, work, and play.\nWe pray especially for our health care workers,\nand for all who help keep us safe and healthy.\nAnd on this day, especially we pray for those who are living\nwith dementia or Alzheimer's and for all who care for them.\nMay they know peace, enjoy and love.\nI'm in.\nThank you, Senator Jackson.\nSo let me just give us a little bit of housekeeping here.\nThe first order of business is gonna be a bill\nthat was in rules and was sent back\nand because it did not get to the finish line.\nAnd it's a very straightforward bill\nand it was not held up for any particular reason\nother than time, but as we were reminded last year\nand reminded again this year, it is a two year session.\nSo that bill will sent back to us.\nAs you can see in your folders,\nit's not a complicated bill, changing some dates,\nbut I'm not going to, let me, I'm not here to present the bill,\nbut we're representative to Silcox is.\nSo if you would, if you would like to come down here,\nor the podium, whichever one you would like,\nwe'll let you present the bill and we'll have questions\nand then we'll, then we're going to take a vote.\nThe floor is yours.\nOkay.\nThank you, Mr. Chairman.\nI bring to you all today House Bill 571\nand House Bill 571 is a DHS department bill.\nAnd it basically says that the Georgia Alzheimer's\nand related dementia's state planning\nand advisory council, which is also known as guard,\nshould include, first of all, the chairperson\nof the House Committee on Public Health\nsince the name of that committee has changed\nin the Georgia House representatives.\nAnd second, that the Georgia Alzheimer's and related\ndementia's state plan should be amended every four instead of every three years as it\nwas previously starting January 1st, 2027.\nAnd starting January 1st, 2025, and every four years, the advisory council should submit\na midpoint report that is every two years detailing that latest data showing the impact of\ndementia and progress toward goals in the state plan.\nSo essentially this bill changes the reporting requirements for a two-year report or update\nand I think this is critical because as we know thousands of people, more and more people\nare dying of Alzheimer's so I think to have this be more timely every other year is stepping\nthe right direction and we'll help our department to stay better on top of the subject so\nwould appreciate your consideration.\nI'd like to thank everybody for being here.\nWe certainly have a quorum, a quorum plus.\nDon't everybody get up and leave, but I appreciate that, Chairman.\nDo you have any questions from the committee?\nSenator?\nI'll just wait for a comment.\nThank you for bringing the legislation.\nIt's more than timely, certainly, as you understood, representative.\nAnd the original study committee originated on the Senate side to move us into this\nposture that we're in today of having a plan, because each state had to initiate it,\nand we were with that one for some time, and under the leadership of this committee,\nwe worked to get that plan advanced.\nIt took a study committee, it took this and the other, as things do around here, but it's\nbeen a night and day change for the state of Georgia and we've had great professional staffing\nI would say on the staff side of this. So I applaud the legislation and you said it's\nchanging from three year plan to redo the plan every four years.\nTo redo the total plan but every two years they'll have a midpoint report that will be\ndue and again that will I think that keep everybody more timely and on top of the issue\ninstead of every four years.\nThanks for filling us in.\nI kind of missed that two-year thing.\nYeah, excellent applause.\nThank you.\nThank you.\nI would make a motion when the chairman is ready for.\nI'll hold that reserve it and listen to any other questions.\nAny questions is pretty straightforward.\nSenator Kirkpatrick.\nJust one question.\nCan you show me where the two-year interim report is in here?\nLet's see.\nIt's near the end.\nIt's probably on page four, isn't it?\nIt is.\nRight.\nI agree.\nIt is one of the seven because that starts as a 2025, the data.\nSo it will be on every two years.\nSo in two years, we'll have a major report, and then we'll get the statistics and analysis\ntwo years later, and then a major report and then two years later.\nIs that right?\nIs that right?\nAll right.\nAll right.\nIt is confusing.\nThe major report will be everything.\nSo we have two lawyers that agree with that, and another lawyer is presenting it, and\nI think we're perfect.\nOkay.\nWhat would the doctors do without that?\nI guess.\nOkay.\nAll right.\nSo any other questions, motion from Senator Orang, move to pass, second Chairman Brass,\nall those in favor say aye, all those opposed, like sign, the motion passes and unanimously.\nAny other business?\nIf not, who's carrying that for you?\nThat's right.\nThat's not right.\nThat's right. She doesn't have enough bills to carry already. She needs more, so we appreciate\nthat. If there's no further business meeting as adjourned. Thank you. Thank you, Mr. Chairman.\nYou\n",
  "updated_at": "2026-02-12T19:56:35.003314+00:00"
}