{
  "video_id": "LAWKF2YLRgQ",
  "url": "https://www.youtube.com/watch?v=LAWKF2YLRgQ",
  "title": "2-27-2025 | GLBC Priorities Press Conference",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 12,
  "summary": "Overview:\nThe Georgia Legislative Black Caucus held a press conference to outline their legislative priorities for the 2025-2026 session. The priorities focused on expanding healthcare access, affordable housing, supporting Black-owned businesses, ensuring equitable education, criminal justice reform, and protecting voting rights and Black cultural heritage.\n\nKey Actions:\n**SB 50**: Peach Care Plus Act of 2025 to expand Medicaid under the Affordable Care Act\n**HB 149**: Health Mothers Act to address high maternal mortality rates, especially among Black women\n**SB 65**: Mandates kindergarten before 1st grade\n**SB 54**: Establishes statewide database to track school safety threats\n**HB 135**: Prohibits housing discrimination based on hairstyles associated with race or ethnicity\n**HB A**: Renews state investment tax credit and removes barriers for investors\n\nBills Introduced (First Reading):\n- Legislation to define housing habitability standards based on federal definitions\n- Restrictions on corporations buying up homes in Georgia\n\nNotable Moments:\n- Chair Nikki Merritt outlined the GLBC's key priorities across healthcare, housing, economic empowerment, education, public safety, and advocacy.\n- Whip Terry Cummings and Vice Chair Doreen Carter provided additional details on the legislative agenda.\n- References were made to the Trump administration's education reforms and the new conservative White House administration's proposed cuts to arts/culture funding.\n\nVotes: \nNo specific votes mentioned, but several bills were described as passed or in committee.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo adjournment time given, but this appears to be an ongoing press conference.",
  "transcript": "Good afternoon, everyone. We're going to go ahead and get started.\nThank you all for joining this afternoon. My name is Senator Nikki Merritt,\nand I have the pleasure of serving as chair of the Georgia Legislative Black Caucus.\nAnd I'm very happy to share our 2025, 2026 priorities. As you guys know, we're in the\nthe biennial so it's every two years so this would carry us for the next two years.\nSo whatever we don't have of our priorities that we don't get completed this year, we\nwill continue that work next year.\nAnd at the Georgia Legislative Black Caucus, we remain committed to policies that uplift\nblack communities across the state.\nWe're fighting to expand health care access.\nThat is just one of our priorities, pushing for full Medicaid expansion, enhanced maternal\nhealth programs and increased community-based mental health services. In the area of housing,\nwe are advocating for incentivizing affordable options, instituting, rent stabilization,\nand strengthening tenant protections. On the economic front, our agenda supports black-owned\nbusinesses through tax incentives, grants, and low interest loans, improving workers' rights,\nand financial education programs. For education, our next priority, we demand equitable,\nK through 12 funding, increased support for our HBCUs, expanded scholarships, and a statewide\ninclusion of black history, curriculum, and public safety and justice, our next priority.\nWe are calling for reforms. We call for trust-based policing, comprehensive background checks,\nand accountability measures to protect Black communities.\nLastly, advocacy extends to improving environmental justice,\nexpanding and protecting voting rights,\nand preserving Black culture through dedicated funding\nfor the arts and community spaces.\nAnd with that, I'm going to turn it over to our caucus\nwhip representative, Terry Cummings,\nand she is going to share some more of our priorities.\nand I'll just leave that there and I'll take this with me.\nGood afternoon.\nMy name's Terry Cummings.\nI'm State Representative for District 39,\nwhich is Mabelton, the smirner.\nAnd it's an honor to be the housewhip\nfor the Georgia Legislative Black Caucus.\nToday is the 27th, of course,\nand next to the last day of Black History Month.\nBut our priorities are in line with not only black history,\nbut the future.\nFirst, our first priority is health.\nEveryone deserves access to quality affordable health\ncare when they need it and where they need it.\nThat's why it is essential for the Peach Care Plus Act of 2025\nfor this bill to be passed to build\nwhat advocate for full expansion of Medicaid\nunder the Affordable Care Act.\nThis legislation is SB 50 and is authored\nby Leader Senator Harold Jones of the 26th District.\nWe also much work to combat one of the highest\nmaternal mortality rates in the country,\nespecially among black women,\nby passing the Health Mother's Act.\nHV 149 led by Representative Imani Barnes of the 86.\nWith education, the Trump administration's aggressive push for education reform threatens\nto undermine access to quality education for Black youth in Georgia, proposals to cut\npublic funding and promote school vouchers risk reversing progress, setting our children\nback instead of propelling them forward.\nIn contrast, state-level efforts like Senator Derek Mallow's SB65, which mandates kindergarten\nfor all children before beginning the first grade, and by minority leaders Senator Harold\nJones's SB54, which establishes a statewide database to track school campus safety threats\nserved to strengthen the very foundation that federal and local policies aimed to weaken.\nmore than ever we must empower our Black youth by standing up and fighting for their right for a strong and\nectoal education. With housing this is our third priority and we're clear on this. Black\nGeorgians have disproportionately affected by race-based housing discrimination for far too long in\nthis date. Under representatives Kim Skowfield's legislation, House Bill 135, the GLBC fully\nbacks the push among housing discrimination based on hairstyles of all things associated\nwith race or ethnic backgrounds. Not only will this legislation provide further safeguards\nfor potential homeowners in ethnic groups, but will also give our Georgians an equal shot\nat becoming home owners at an affordable price.\nIn addition, I'm introducing legislation\nthat will define habitability.\nAnd this is important because most states\ndefined it in their housing bills, Georgia did not.\nAnd this definition is based on the unfederal definition.\nAnd hopefully that will be introduced this week.\nOur fourth priority is wealth.\nWe must always work to create wealth in the black community\nbecause everyone knows and hand up its worth more\nthan a hand out.\nWe build wealth by creating tax incentives, grants,\nand low interest loans for black owned businesses.\nWe expand workers' rights, protections, and industries\nwhere black workers are underrepresented, underrepresented,\nUnderrepresented, I'm gonna get that word right, and overworked.\nAnd we fund financial education programs to help build wealth through home ownership,\nwhich is extremely important.\nAnd relation to that, we do have a bill by representative Phil Allaleway who actually got to committee.\nAnd that would put restrictions on these corporations coming in to buy up homes in Georgia.\nEven though the natural purchase rate is 3% in the country,\nand Georgia, the purchase rate is over 30%.\nWhy?\nBecause there are no restrictions to corporations coming\nto Georgia and just buying up these homes.\nAnd when you buy up these homes and you take them off the market\nand you turn them into rental, you have just destroyed\nanybody's chance at a first home by opportunity.\nWe also have representatives, the Shawn Kendrick,\nwho introduced House Bill A.\nThis bill will renew our state's investment tax credit.\nWe move barriers for investors\nand assure transparency and finance.\nNow I'm turning this over to my friend\nand our vice representative, Doreen Carter.\nThis is gonna be good.\nWe're gonna do it with him.\ngood afternoon everyone I am Doreen Carter and I'm the state representative for\nGeorgia House District 93 and I have a pleasure serving as the Georgia\nLegislative Black Caucus Vice Chair. So we are really excited that you are\nhere listening and the GLBC does plan on providing legislation in the following\nareas as well. In the area of public safety and justice reform according to the\nJohn Hopkins University, Bloomberg School of Public Health, fire arms were the leading\ncause of death among children and teens in the state of Georgia in 2022.\nIn 2021, there were at least 185 domestic violent related homicides, 75% of which were\nfire arm related.\nGiven this, it is imperative that we safeguard our children through supporting comprehensive\nfire on programs, such as those laid out in the Mort Minority Leader's Senator,\nArizona, the second legislation SB 53 on the establishment of an education\nprogram on safe fire on storage. Lastly, in advocacy, we must always continue to\nadvocate for expanding voter rights to make voting more accessible and\napproachable for everyone in all zip codes. Right now, there are people trying to\ntake us backwards to pull us back to make believe pass that never was.\nNow is the time to fight to preserve Black culture because the cuts being sent down\nthe pipe by the new administration will cut funding for the arts, community space and\nhistoric landmarks.\nWe must not seed hard fought hard one ground to the cult to the cutters in the White House.\nWe must always look out for the most vulnerable among us,\nand that means protecting Georgia's\nfrom the discriminatory tactics\nof a forcefully conservative legislature.\nThank you for your time,\nand I will turn it back over to our chair,\nSenator Nikki Merrick, for our closing remarks.\nThank you Vice Chair, woman,\nRepresentative Carter, for those remarks,\nand thank you to our Representative Terry Cummings.\nIn 2025, the Georgia Legislative Black Caucus is saying true to the mission by pushing\nfor policies that tackle deep-rooted issues affecting black communities across the state.\nWhat we've rolled out is everything from health and housing to education, wealth, public\nsafety, justice reform and advocacy.\nWe are committed to creating a more equitable and just Georgia.\nOur legislative goals are not just proposals, they are a call to action, and it's time\nwe break down barriers and commit to uplifting our communities and create real opportunities\nfor progress.\nTogether, we are dedicated to forging a more equitable and just Georgia for all, and we\ncontinue to live by that mission, which is our mission, legacy in action, progress in\nmotion.\nYou can find out more about our priorities.\nThey will be listed on our website at GeorgiaBlackCockets.org.\nWe will also have our listing of all of our priorities and the legislation available to the\nmedia.\nWith that, I will take questions and I did speak out about, you're talking about SB 120.\nWe heard that this morning and clearly that is a tack on our black institutions but just\nany of our private institutions and all of our schools here.\nIf those of you that don't know about that bill,\nbut it's going to prevent any type of DI initiatives\nor studies from being taught or rolled out\nat all of our education.\nAnd I believe it's public schools isn't that as well.\nWe is the same type of a tax that we're\nseeing at the federal level.\nAnd it is up to us to push back and fight back\non what on these very regressive policies.\nI said before, Georgia and Atlanta, we are the center of civil rights here, and I'm\nvery disappointed to see our legislature taking up that type of policy.\nOkay, all right, we're going to end.\nThank you all for joining us.\nGood afternoon.\n",
  "updated_at": "2026-02-12T19:01:39.932239+00:00"
}