{
  "video_id": "lC-rhjxU6es",
  "url": "https://www.youtube.com/watch?v=lC-rhjxU6es",
  "title": "10-26-23 Senate Study Committee on Expanding Georgia's Workforce",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 149,
  "summary": "Here is a structured markdown summary of the Georgia 10-26-23 Senate Study Committee on Expanding Georgia's Workforce session:\n\n## Overview\nThe session focused on workforce development and featured presentations from various stakeholders, including representatives from the Georgia Association of Colleges and Employers and the Technical College System of Georgia. Key discussions centered around preparing Georgia's workforce for both current and future needs.\n\n## Key Actions\n**HB 808**: No specific details provided on this bill.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- The session was held in a renovated facility at Dalton State College.\n- Senator Chuck Payne, who was expected to attend, was unable to do so due to another commitment.\n- The committee members introduced themselves, highlighting their roles and perspectives on workforce development.\n- The committee chair, Senator John Kennedy, provided an overview of the committee's work and website (expandinggeorgiasworkforce.com).\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nA quorum was present, with the committee members in attendance.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "I'm going to say a quick thanks to the State Assembly members who are here. Nothing more important than workforce development. Certainly one of our highest priorities here at the college. You're going to hear a lot about that today, I believe. I'll let you get to it in just a moment. I want to say a quick thanks to the State Assembly members who are here. The legislative body because the room you're sitting in was made possible by you. We just opened this facility back up on September 1st after an 18-month renovation. Every wall in this place was moved, torn down. I used to be a gym. I was swimming pool right out here. If you ever were in bandy gym in the old days, it is quite a makeover. So I can't say enough. Thank yous to you for making that possible for us here at the college. And with that, I'm going to turn it back over to John and wish you all the best in your meetings today. Thank you. Thank you very much for hosting us as well as our friends with the NFIB. We've got a wonderful breakfast over here. For those who want something, please make yourselves welcome. As well as for those that need facilities. If you walk back out with the front desk is around to your left. Please feel free to use restrooms and there's an exit in the back door that will make things a little easier for everyone. Unfortunately, Senator Chuck Payne has another study committee today for foster care down in Columbus. He was going to join us. He represents this area and is the chair of the Science and Technology Committee for the Senate. He does a phenomenal job and he and I are also working together on artificial intelligence and how that's going to impact our state local governments as well as cities and businesses. So on behalf of Senator Payne, he welcomes you to his district and the great city of Dalton. We're going to take over and pass the microphone around to a very brief introduction of each one of our committee members. Senator Beech is hopefully parking right now. He got turned around a little bit, but then I think we've got a full house. Good morning. Senator Sonia Halpern. I represent District 39, which happens to be in Fulton County and covers five cities in that area, including Atlanta. The rule to be here today with each of you to talk about workforce development, which of course connects very deeply to business and industry and it's great to be in the carpet capital of the world. Floor covering, I was corrected earlier. Yes, thank you, Senator Halpern. I too love being in the floor floor covering capital of the world. No, I just want to make sure I got it right. Jason Estevez, state senator for Senate District 6. That's Northwest Atlanta representing parts of Fulton and Cobb counties. Champ Bailey, Prof. Ball Hall of Famer, entrepreneur. Happy to be here. Greg Dozier, Commissioner of the Technical College System of Georgia. I'm glad to be here as well and really excited for my friend John Futchko. That's the present here now. Joseph McDermott, Vice President of Delta Airlines. Pleasure to be here. Thank you. Ryan Pranese, rest of the tour. Got three restaurants in Roswell, Georgia. Danielle LaParry, Vice President for the Georgia Chamber of Commerce. Dave Williams, Senior Vice President for Public Policy and Talent at the Metro Atlanta Chamber. Thank you committee members for your presence and your input. Everyone here today can see on the screen. This is our website for the study committee. It is expanding George's work for study.com with the exception of my high school picture. Most of the content is excellent. What you'll see on here, which is importance, is the background of all the meetings we had in the past, as well as specifically a way that everyone can be involved. Now it would be impossible for us to hear testimony from everyone in Georgia. But we do have the ability for folks to submit testimony. Kenan, thank you for clicking on that. Where you can go on here, you can send us any form of media that you feel appropriate. All this gets sent back out and Haley with our Senate Research Department. What is your new name now? The Office of Policy and Legislative Analysis. This is going to be like the form we know as. But Haley is really quarterbacking this process of assembling all the information that we are gathering. And then utilizing that information for us to compile into the report. For the committee members, you have already gotten a couple of emails throughout this process. But specifically after this meeting, we're going to ask you to read through those and make sure that you either agree or added content or modified something because it our final committee meeting, which will be coming up here in November. If you click on the committee meetings for just one moment, Kenan, the last one is going to be at the Capitol, which will be our six committee meeting. That will be on November the 14th at 10 a.m. At that time, the Lieutenant Governor, Bert Jones, will be presenting to our committee as well. And this was his initiative and asked me to chair the study committee for him in his vision to make sure we're preparing our workforce both for today as well for the future. So we hope that those that can be attendance will be there, but I believe we'll also livestream that one as well. The last part is if you missed any meetings and you want to go see what happened, we've got the video archives. And thank you to the great work from Kenan, Lexi, and everyone else and Emily from our Senate Press Office. We've got all of that available at your disposal. Should you want to look through those. So again, that's expanding George's work for study.com. And we thank everyone for the work they did. None of this would happen without all the great work from all the staff. And I just want to take a moment to thank each and every one of them. Specifically, we also want to mention Allison in the back who helped coordinate this. Allison, wave your hands, whoever you can see you way in the back. Thank you for all your efforts. At this time, we're going to start moving to the meat of the agenda, but I want to give Senator Beach a moment to introduce himself. Hey, sorry, I'm late. It was not the easiest place to find, but I'm Brandon Beach. I represent District 21 in the Senate. I'm in my sixth term, which is North Fulton, Alfredo Milton and Cherokee County. And I'm glad to be here. Thank you, Chairman, for chairing this committee. Workforce is vital as we continue to be the number one state in the country to do business. I also am chairman of economic development tourism. So, workforce is dear to my heart. Thanks. Thank you, Senator Beach. Well, you've been here a long time. Six terms. All right. Moving on, we're going to begin today with Mallory and Stephanie with the Georgia Association of Colleges and Employers. We're going to have speakers come right here where you see Keenan sitting with the laptop today. He will guide you through advancing slide decks if you brought a presentation. And when you're done, if we can get you to sit back in the main area, we'll have the next group come up. And if you grab the microphones to your left or right, we will turn it over to you. We're going to ask everybody to speak for about 10 minutes and then give about five minutes for the committee members for questions and answers. Thank you. Well, thank you. Good morning. Yes, we are here to represent Gase as we like to call it, which is the Georgia Association of Colleges and Employers. And I first wanted to just tell you a little bit about who we are. My name is Mallory Safely. I work here at Dalton State College as the assistant director for Career and Professional Development, helping our students from A to Z when choosing a career path, helping them to develop the necessary skills that they need before heading out into the workforce and then helping them towards the end with whatever their next chapter is beyond on state going into the workforce or going into grad school. And I'm Dr. Stephanie Walmak. I am the director of education and workforce development here at the Greater Dalton Chamber of Commerce. So I am tasked with working with our students to make sure that they can be successful in their educational attainment from birth to career. And so Mallory and I both serve on the board of directors for the Georgia. I was president for 18 months and I'm now the past president and Mallory is our communications and marketing director. So we're going to tell you a little bit about Gase. We know that we're not a very well known organization, but we do serve the entire state of Georgia. So the mission of Gase is to provide a link between employers and career services professionals, provide professional development and promote professional and ethical standards and foster relationships among employers and career services professionals. So our goal is to ensure that our students that are graduating from the University System of Georgia and the Technical College System of Georgia are connected to keeping our talent in the state and our employers statewide are getting the talent that they need. And so we do that in a number of different ways, but we truly hope to connect our students to the professional workforce and what that truly looks like. We can, we talk about first. So I mean, I'm not going to necessarily read the screen to you because I know all of you can read, but we have our main focus as Stephanie has said is to make sure that our employers have easy access to our early talent, our students and our students have early access, easy access to wonderful career opportunities. Not just jobs, but career opportunities that will last them. The only ones that allow them to use the skills that they're developing in college to go on and provide great service to our communities. So we do things by eating in their selection and creating strength and provide all those things. So and all of this can be found on our website as well. So here's a couple of benefits of being a member of GACE. So we have college and institution, you know, University and institution memberships. And then we have our employer partners memberships as well. And then we have, I said partners, but we have partner ships, employer members and call institutional members. So there's lots of benefits to being a part of GACE. Currently we have over 55 plus institutions that are a part of GACE with over 182 active members. We can touch over 380,000 students and even more alumni. And of course we host several different events, workshops, professional development opportunities for our members to help them get to whatever point is next to help cover trending things that are happening in workforce and trending things that are happening in higher education. So that we're staying on top of where the workforce is heading, making sure our students are prepared, making sure our employers know what's happening in higher ed so they can easily access our students. And some of them never. Yeah, so member benefits, our goal is truly to connect our talent acquisition people and talk about best practices. So for the employer side of things and we'll get into that in just a second. We want our talent acquisition professionals to be able to share how they are attracting their workforce, how they're recruiting and how they are retaining their workforce. And so that's a critical need. And also we want to make sure, like I said before, that they stay in the state. And so for GACE, that's our goal that all of our graduates can find gainful employment within the state, whether they are graduating with a credential or a degree from a technical college or a four year degree or a graduate degree. We have previously hosted the largest career fair in the state. We have since the pandemic have transitioned away from that because we have noticed our student attendance has gone down and we are currently in a process of trying to figure out what will that look like next, but it was the largest career fair in the entire state of Georgia had representation from all over the state. And so we are looking now, how do we serve our employers for that next area? How I, from the higher ed side of things, how I benefit and use GACE, goes in many different ways. Obviously my students have access to not just our local employers here in our service area, but access to employers all across the state and really almost all across the South. So any of our students have access to jobs to professional development opportunities, hiring events that those employers might be hosting and vice versa are those employers here about Dalton state. They hear about the Dalton state's students, what our students are doing and how they can find their early talent through our pipeline of students. Obviously, like we mentioned earlier, the association offers professional development opportunities for people like me looking for ways to use AI in helping students understanding, interviewing or networking or even developing their documents like cover letters and resumes. So they host many different topics that are trending in hiring and workforce development as we get ready to help our students. And of course, just that leadership piece, there is actually Stephanie is overseeing what we call GLI, GACE leadership institute. And so we get to actually graduated from the 2022 class of GLI where we went through lots of different workshops to cover all kinds of different things to develop our leadership skills as individuals in our own careers. So I love working with GACE and of course just partnering and networking with others across the state, whether it be employers or like minded, care services professionals like me. And then on the employer side of things now a chamber of commerce is obviously much different than a typical employer, but I use it to help our members. And so if I know that people are looking for employees, I'm able to recommend the association because of the connections to Georgia Tech University of Georgia, we work with our independent college system as well. And so we are able to connect employers to every single college if they need to find students that we might not be able to provide them locally with Dalton State or Georgia Northwestern Technical College. And so I use the same networking opportunities and professional development that Mallory has said, one of the opportunities that we see for GACE is to kind of ramp up our employer engagement in a couple slides. You will see the partners that we have and the employers that are heavily involved with the work that we're doing. But what we know as an organization is we have not historically been great at telling the story of who we are. And because we are connected to over 380,000 students in the state, we know that our employers are looking for talent and we can help be that connector. And so an opportunity is for our employers to get to know us, become members of us. Our membership is $60 a year, which is very affordable. And that way we can get people connected to get the talent that they need. So on the slide, you can see these are some of our partner members. These are employers that are heavily connected to GACE and the work that we have done and have been historically involved in the work. Yeah. And so obviously Mohawk is very local for us. And so we were happy that they joined as a partner of GACE, I think about three or four years ago. And so they are heavily involved in GACE and obviously very involved here in Dalton State Service Area and GNTC's service area. So we are very excited that they joined as a partner of GACE. And then we also have several others. I have another slide that will show you who all our partner level employers are. But our students have direct access to these employers. So even though Mansfield isn't locally here in the Dalton Service Area, they are still heavily connected to Dalton. They post their jobs on handshake, which is our career management system where our students can find jobs. So we come to our events when they can and again find early talent through this pipeline. So we are very excited that we have access. And of course they love being a part of GACE too as you can see on the screen. And this is just a quick snapshot of our partners. We do have three different partner levels. We have gold level, which is currently enterprise holdings. We have several level, which is Comcast and then we have several bronze levels. Childcare careers, Mansfield, Fassanol, Mohawk Industries, Persponsive Logistics. Sonobis, Team Georgia Careers and Yardi. And I think, yeah. So we are very excited about having them be a part of GACE. They help support us in many ways. They have first dibs on a lot of things with our colleges across the state because they are our partners in GACE. So we are very proud and we love our partners. Any questions? Thank you very much for your presentation. We appreciate that. Are we on? I'm fascinating for what you're doing. Great job connecting obviously students to the employers as students are graduating. Or even still in school. Is there a deficit of those who are trying to find a job at this point or are there multiple jobs available for them in the area? There are many jobs in the area. I think it really depends on what that students aspirations are if they are having struggles or how soon they start. I am a one person office here at Dalton State. So servicing all 4,300 students plus all of our alumni is a wonderful job. I love my job, but please don't miss and understand me. But to get around to all of them to make sure that they know all their options is one thing that I work very hard to do. So they do have access to jobs through handshake. We do lots of workshops throughout the semester. Do they have access? Is there a large percentage of students that struggle? No, it's not a large percentage. It's very small and we work with them one on one to make sure that they find what they need. That's fantastic. The model that you're doing obviously is extraordinarily successful. Are you aware of other areas in the state that are doing something similar? Specifically with the way you're connecting everyone together. Yes. I would say from our understanding we are kind of the premier organization that's doing this work. So bringing together these two groups of individuals to kind of cross the barrier to this level where they were the only organization in the state. But luckily we connect all corners of the state together in our annual conference. Everybody comes together. We hop between the mountains and the beach every other year to try to make sure that everyone can get where they need to go. And then the majority of our in-person professional development events take place in the Atlanta regional area because that is where the highest number of our membership is. And we are a subset of NACE which is the National Association of Colleges and Employers. And GACE is one of the top sub branches of NACE across the definitely across the South. But I would say across the US we a lot of other ACEs come to our conference each year to see what we're doing because we're doing it up right. Let me tell you we love it. We have a great time. This is one of our pictures from our last conference that we had up in Brasstown Valley area. And of course in May of of 24 will be down in St. Somers. So we do move the conference around the state to make sure that we're covering everybody. Fantastic. Other questions from the committee members pass a microphone down to Ryan. Thank you for the presentation. Interesting to hear your comment about a job fair falling off in relevancy and you're in a unique position to comment. So I own three restaurants and I can tell you job fairs used to work. Now they don't work. And I think it's a useful microcosm of what is happening in hiring right now. It ties together. We've talked in this committee before about soft skills. I've got maybe 58% of my interviews just don't show up. So the job fair of the future, where do you see that going? Is it as simple as it just moves online? Is it just I need a robot to talk to other robots? What does that look like? That's a really great question. So, um, Gase was actually one of the first people to do a virtual career fair when the pandemic took place. And our first career fair in 2020 was wildly successful because we had students that needed to find work. And we have hosted three since then. And we have had a complete drop off of students to where we'll have 900 students register and under 200 actually show up. And so that's actually what we are currently as a board talking about. So we are as past president. I'm kind of overseeing what we bringing together our employers, our partners and our colleges to talk about how do we see this moving forward? Because career fairs are just not working. You can ask almost every college. I think Kennesaw State is the only one that has had incredibly successful career fairs in the last 24 months. And everyone will tell you that the engagement on the student level is just not there anymore. And so we, if you keep up with us, we are spending the next 12 months figuring out what does it look like and what do our graduating students, what this generation, what do they want, what do they need? And how do we make sure that they're finding the employment that they desire? Other questions from the committee members? Seeing none, Mallory Stephanie, thank you so much for your testimony today. We appreciate you. Okay, let's have our friends with the NFIB come up. I'm going to set that down right there. Hopefully you guys get to hear me and it's taking it up. All right, I'll hold it then. We've got thousands of people watching online that you hear each and every word, Hunter. Thousands, all right. Well, thank you, Mr. Chairman, members of the committee. My name is Hunter Logins. I am the State Director for the National Federation of Independent Business. And with me, I have Blake Glenn, our grassroots manager. NFIB is the state's leading small business advocacy organization. We have a little over 6,600 members. Some of them are here with us today. Our mission is to promote, protect the right of our members to own, operate and grow their business. We of course do that by our lobbying efforts at the state capital. But more importantly is our grassroots and advocacy programs, getting our members plugged in with you, elected officials and members of the committee and educating them on the issues. And Blake's going to touch a little bit about that. Thanks, Hunter. And I'm Blake Glenn. I'm the grassroots manager for Georgia. So as Hunter alluded to, you know, advocacy, getting our members involved. And these are small businesses. So they're out there, you know, running their businesses every single day, you know, from being the accountant to being the other person, you know, at the front desk to everything. So we try to make it, you know, as easy as possible. So sorry for all the emails and phone calls that we end up leading to with that. I appreciate all of your time that you've given our members. So we want to go through. We did a survey recently with our members and just want to know that this is an anecdotal survey of our members in Georgia. Just a little snapshot. Just to kind of give you like how our folks are feeling currently. But this is not, you know, an overall NFIB national opinion here. So out of our member responses, you know, the average number of employees that our folks are having in this survey was 24. But you know, a lot of our members tend to be in that, you know, five to 10 range. So we asked them, you know, are you, do you have an open position? You're trying to fill. So out of the survey 71% said yes. And then even, you know, hires, you know, 92% are having trouble, you know, finding qualified qualified applicants, which I think, you know, most are feeling that. And so we also asked, you know, what positions are you trying to fill? And so the bigger, you know, the word is is, you know, the most it's come up in our survey. So you can see it's across the board between, you know, journeyman electric electrician mechanic, you know, salesperson. So just about across the board, you know, every different industry, you know, folks are looking for people and just are having a hard time finding them. And so here, you know, some of the reasons why that we've heard from our members in this survey, you know, education, work experience, worth work ethic. But also note that having no applicants has been a really big issue. And I think a lot of our members had said that were they post indeed and they end up, you know, hearing nothing. And so then we started asking, you know, have you tried, you know, changing things up. So have you tried, you know, putting, you know, new benefits to recruit or retain. So almost half of our respondents said yes. So you kind of see examples that they've given about like what they've done, whether it's, you know, providing more insurance for a one K eligibility, increasing vacation time, cell phone stipends and whatnot. And then we asked, you know, are there other unique ways. And I think we can all appreciate masters week off is a great way to attract potentially some new candidates. But you know, they've done, you know, new vehicles, you know, flexible work hours, four day work weeks, you know, things that are, you know, maybe going a little, you know, above and beyond kind of what normal benefits might look like. And this one was probably the most striking for us. This is, you know, members who have heard of or used the registered apprenticeship program. So 0% of our members have even heard of this program. And, you know, none of them use it. So I think it'd be really great for us to somehow tap into that and make sure that they're taken, taken full advantage of that program. And here are just some, you know, snippets that we've pulled out from our members. You know, some quotes from them throughout this survey that we thought we'd highlight for you folks. Thanks, Blake. And I'm sure you've all heard throughout the several committees that we've done are the problems. Let's try and get to some solutions. First and foremost, we believe most importantly, and I had the pleasure of talking with Senator Halpern about this last week is education. It starts with our young folks in the classrooms and getting involved in wanting to learn a skill or a trade. We applaud the efforts of the legislature and in the commissioner for increasing the funding for our technical programs. They're expanding their CDL programs and other technical licensing. Also relevant curriculum like the ag education program this required now in schools and financial literacy that's now required in schools. And of course, we saw recently the governor's announcement of the joint.\n\na match program which we think is a fantastic step in the right direction for getting our young folks plugged in to skilled labor and trade. Automatically graduating high school and having a place to go is a huge, huge deal. And then lastly, education is educating you guys, educating our leaders on the issues. So thank you for putting together these study committees. We have one on truck force, truck truck trucking and workforce. There's others on occupational light sensing. I think Senator Walker's heading that. So these are all steps in the right direction. A brief look at what other states are doing. South Carolina is putting a lot of investment in the workforce. They created the workforce scholarships for the future program. It it provides scholarship for all at need careers and those are assessed I think yearly to figure out what folks need. And also the emergency educational relief fund that provides retraining programs for those high demand careers like truck driving and others. Also the scholarships to cover the cost of tuition at these sort of technical school or these technical schools and we think you know perhaps the governor's initiative is a step in that direction which we would certainly appreciate. Another thing we kind of need to tread lightly on is in Iowa with youth employment. We helped update decades old laws pertaining to youth employment. There was a law that they couldn't operate a microwave. And we think we're not giving our our young folks enough credit. I was operating a microwave to cook popcorn I think when I was five. Just make sure you don't put any metal in there but I think they figured that out a long time ago. But we cannot stress this enough. We need the parents involved. Perennial consent is vital for these programs. Getting these children in the workforce so to speak it has to be it has to start with the parents and what they could provide and how many hours they could work. Next up is licensing. Governor Junkin recently in Virginia signed into law a program which will recognize 85 different professional licenses in the state. We think a streamlined licensing process is vital. They will now recognize out of state license things for relevant experience. And of course you know you can see the the requirements there at least three years or in good standing and underwent training and examination in the state that they're working with. And this applies to 85 I said but this could be barbers real estate agents plumbers electricians gas feeders chefs HVAC tradesmen all sorts of stuff. So we think that's a very good program. Also in Virginia with trucking I recently testified in the Senate truck for trucking and workforce committee so I could spend another hour on what we could do in regards to licensing and getting more folks in the trucking industry. But this one was very interesting the state partnering with associations to find and plug in workers into the field. I think Mallory touched on this recently they have something similar but if the the state could partner with someone to find who's hiring and then directly plug them into the workforce would be beneficial. I can't on trucking and we think this is very important is getting our veterans easier access to the workforce as well as our second chance nonviolent inmates with the right technical skills and we could we think it could expand more than this just trucking if they have relevant experience in their military service or within programs in the the pinnitentiary system we think we could get them plugged in easier and make it more accessible for them to to getting into the workforce. And before I get on to Q&A I want to go back briefly to this slide here. Our small businesses have a difficult time competing with larger chains to get employees just because they don't have the resources available to provide higher wages. I want to say the latest survey of Georgia over 90 percent of the state's revenue is from small businesses and 85 I believe or higher are employed by small businesses so we are the backbone of the state and how do you continue to compete with higher wages. We like to say small businesses are dying by death of a thousand paper cuts and what that means is inflation higher taxes higher insurance so if those burdens were eased they could offer higher wages or better benefits increase vacation time and hire more employees. One of the things that the legislature could help do is address the legal climate. I know the governor came out recently and said he wants to do something to address the litigious system in Georgia if that were to be addressed in just the most minimal way insurance premiums would lower and they would have money to do whatever they can to hire other employees. Secondly there's an initiative going through next session it's HB 808 it will deal with the tangible personal property tax on our businesses real briefly what this is is if I own a business and I have a computer a desk a TV what have you sometimes it's pencils and paper the counties will come in and tax that because I'm using it for my business even though I already bought it and paid sales tax on it they'll come in and continue we it's essentially an infinite tax so this bill next session will raise the diminimus threshold for which businesses are exempt so up to 50,000 so if you have up to 50,000 that is exempt from tangible personal property and after that we think it's a good compromise for our local governments and hope to see that passed and last thing is cutting red tape the lieutenant governor recently made his announcement that he wants to help small businesses and businesses in general and so Blake's putting together a survey to for our members to see what is honoris and what y'all could do to help just cut that that BS essentially so happy to take any questions if you have any. Well thank you for your presentation one of the things you brought up that we've discussed a few times during the committee meetings is the fact that high school and college students are just not working like they used to be and it's causing a lot of problems not just gaps in the workforce which are certainly an issue but also they are not gaining those very basic experiences like Ryan was talking about whether it be the soft skills you know the the basics of how to talk to someone how to get to work on time and and do your best is the NFIB doing anything in particular to address that issue I realize some of that is a parent issue but also it's just I think educating the students. Sure and like I said we have fantastic members who have those values already and just speaking with them they don't obviously represent the entire parenting apparatus of Georgia but they understand those values but in terms of a program not so much but something we could definitely look into. Questions on the committee members Commissioner Joe is your yeah I was just going to offer the registered registered apprenticeship program falls under TCSG and the governor's office of workforce development we love when you have a session to come do some education and make sure your members are aware of that obviously you probably know and I know members of the general assembly know we for a long time have had some funding that comes in with the WEO Act that helps with registered apprenticeship training but two sessions together by the Senate a little over a million dollars was put in to help employers do some of that so it's a brand new program it's a brand new opportunity the governor also provided some of the gears money to help on the training side likewise but there's different opportunities like three different programs we'd love to do some education so just let me know when when your next event is and we'll make sure somebody's there. Sure happy to partner with you guys and we had the opportunity of joining the governor for his CEO summit recently just to touch on education and there was one gentleman that hammered the point that we need to get that information out there whatever the legislature could do to increase funding to get those programs into the schools whether it be through the council or social media what have you because taking advantage of the apprenticeship program would be huge in a no senator helper and recently took a trip and has my days on how they did it over there and look forward to seeing what comes out of that other questions right do you know of a single jumping off point for any small business owner in the state where I can go to an online portal and say here's my business here are my needs here's what my pain points are and I could be presented with here are all of the programs that are available that could help with that that you probably don't know about because as you're survey attests there are likely dozens of programs that would help me in my hiring but I have no idea or even out there because as you alluded to earlier I got my head down run of my business I you know senator Al was just coming in at 730 I gotta have his table ready I gotta have these so I gotta make sure we're ready for guests I'm not on there researching what's available so is there anywhere I could go that's one stop shop for here's what I can do I'm sure there are but as for a one stop shop I don't believe there there is and if there is I have not heard about it so educating folks on that would be great but as I talked about earlier Virginia is partnering with several associations to to create something like that a portal a one stop shop to get folks plugged in on their needs and not only feeding the workers to them but what sort of training they might need so be happy to help put something like that together this is a real important point Haley if you would please take this down as part of our report and recommendations I think this is a critical point the program's only as good as it utilized as she could have the best program out there I mean you all remember in 2020 my covid experience was I felt like a student applying a college again because I was just applying to all of these things to help get us through the next three months the next six months that took so much time that I only could afford to do as we were an open for business at the moment so I think the ability to quickly and easily identify what are the programs that already exist that I just don't know about would be a huge show the other fun thing I'll mention is I enjoyed reading your bit about unorthodox benefits being offered because we started offering two days of pet bereavement pay and it resonated very deeply with my staff so I'm glad to hear other people are doing those things and I'm right there with it see it and as a small business owner attracting and keeping workers is the most difficult thing we hear and something like that that is super unique and I mean you probably shouldn't have said it out loud because now you're going to have competition that's right and that's another point I want to make small businesses they care about their employees they're not in the back you know just counting their money they're the first in the last to leave in the last to get paid and they care about their employees and want them you know just want to see them succeed and generate some money great point other questions from the committee members seeing none thank you very much hunter thank you Blake we appreciate everything you and the NFIB does you got my contact information right there feel free to reach out any time okay next up with the home depot was Hillary and Aaron come up I was mentioning them earlier my phenomenal customer service experience with the home depot from my home store and online as we all know that any of us in the business world typically you don't get people to call us up and say thank you same works and elected officials so maybe we should spend more time pointing out the positives in this world and we appreciate everything that the home depot does you've delivered many to the Albers household thank you turn it over to you all right well good morning and thank you so much for having us really appreciate the opportunity to be here I'm Hillary Throer and I'm the senior manager of state and local government relations for the home depot so I cover the southeastern states again thank you so much point of personal privilege really glad to be in Dalton this is my hometown so I was able to have breakfast with my grandmother this morning before the committee meeting but really just excited to be here special place to me so as you as I'm sure you know workforce development is extremely important to the home depot we have almost half a million employees nationwide over 2300 stores and we have plans to open another 80 stores over the next five years so we're going to need associates to work in those stores so really excited about the discussion today we have Erin Eisen here she is the senior director of workforce programs at the home depot she's been with the company for almost 20 years across a variety of different roles so she knows the company inside and out and most recently now in her current role she is responsible for the home depot's workforce development strategies and is responsible for our national military relations program so I could go on and on about Erin but I'm really excited for you all to hear what she has to share so thank you well thank you for having me today like Hilary I'm actually one of the few native Georgians I'm somewhere in one of your two two areas this where I grew up and so this is very this is home for me as well so thank you for this opportunity you guys know home depot we're not generally new when we walk into a room so we have 33,000 associates in Georgia we are the largest company headquartered in Georgia we're down in bindings we were founded here off Monroe Drive in 1979 and so this is home for us too as a company so over 33,000 of our Georgia natives were the orange apron as well but and while we were as a company really struggled through COVID I think as everybody did what I'm here to talk to you today is not about us because as the economy has stabilized we're the big guy we figure it out and we are now being able to staff our stores and DCs with also relative ease to the challenges everybody else has but who is not able to do the same is our pro customers and that's who my team is working on is helping the small and medium guys who do not have the resources that they need to hire so that is what we're focused on right now I feel hit the next slide is tackling some of the skilled labor gap so 94% of our pros are telling us they cannot find labor they need to grow their business and this is not necessarily the big guys this is the small guys we call them Chuck and a truck who are looking to hire their second fifth 10th 15th person they do not have the time to go and make connections with the technical college system to find the plumbers that they need they're really as you mentioned earlier you're trying to get tables ready they're under you know people's cabinets fixing pipes and and doing electrical work they don't have time to be doing that and so they it's really constraining them it's the number one constraint for them being able to grow so right now there are 400,000 jobs in the construction industry that's projected to grow to 3.9 million by 2029 and Georgia is ranked number 12 on that list so we have a problem here in Georgia that I'm sure many of you are feeling not just in the construction industry I'm so left and addressed this is really going to hurt our not just the Georgia economy but it hurts him deep as business too so that's why we're stepping in to help and hit the next slide so last November we introduced what is called the path to pro program and our goal is just to kind of reduce that barrier to entry for the next generation of trade professionals and there's three things that we're really trying to do number one is generate interest and as I'm sure Commissioner Dozer can tell you getting people interested in the trades it's kind of like the military to now is a very difficult thing and there are a lot of hurdles less than 3% of young people coming out of high school are interested in the trades and a lot of that has to do with an incorrect assumption that there's not wealth to be made here that it's dirty that it's not reliable mom doesn't want her son to be a plumber my son's a plumber he's doing great but there's there's a we got to flip the script on what it is to work in the trades and so our investments there um through our path to pro program is a consolidated website like you said earlier there's not one place to go for a lot of things and the trades is no exception to that so we built one website called pathpro.com go take a look that has information on what it's like to work in the trades and the different industries within the trades how you can go about doing it and what it means for a career and it really talks to not just students but parents influencers and guidance counselors as well we've built youth programs with our foundation and getting into everywhere from fifth grade all the way up through construction programs trying to get people more involved earlier in the funnel so then after that we are trying to help people train for the job site one of the things that we hear from our pros is it's not about necessarily being able to find the people it's finding the people they're going to show up we hear the same thing about not showing up for interviews and it's soft skills and when we say soft skills we often think of resumes and being able to interview and that's actually not it they say it's showing up on time having a positive attitude and being willing to learn the art our project like I'll teach them how to use a tape measure I'll teach them how to use all this all I'll teach about everything once they get to the site they don't have to know if you can just have them show up that's all I need so what we did is we built a skills program whether than having people have to go and do a 12 week construction program and those are great don't get me wrong but we can have them working next week if they could just go online and they take these couple hours of online classes for free it is on path to pro.com they learn about job site safety they learn about showing up on time having a positive attitude being willing to learn the basics of the construction tools they might get in there's there's six different tracks right now we'll have 19 by the end of next year but you learn the basics of what's what are the different tools and electrical what are the different tools and plumbing what does it mean to wear still toad boots all of those things are in that skills program I encourage you to go check it out and it is free online and self-paced so whenever you have time to do it you can go on and do that and when our pros see that someone has graduated from the skills program that shows somebody that has shown up somewhere and tried to learn so they know that that's going to be a candidate that's probably going to be good for them we do still support the certifications our foundation has partnerships um on mid 10 military bases as part of the skill bridge program and to date we've sponsored four different um a community academies too we also offer scholarships path the pro scholarships most people falling out of technical college are actually for very small amounts so we have twenty five hundred dollar trades scholarships available and then finally the big part of this is once you're trained or you're interested in the trades when we get you there how do you find that job because there's not one place to go career builder is not where you go to become an electrician um so how do they find those jobs so we built what we call the path to pro network and if you want to flip to the next slide um this was built based on what our pros told us they want to see when they're hiring people so it is essentially linked in for the trades this is this is new it is free it is behind pro extra which is our pro loyalty program so candidates sign up for free and pros can go in and view those candidates and then post their jobs for free so it is a specific to the trades job board that is built with trades people in mind so if we went on there and clicked on Gerald's baseball card is what I call these you see here it would open more info on Gerald it's going to show you pictures that Gerald took a work he's done it's going to talk about the different skills he has that's applicable to the trades and our pros can go in there and find the people they need in their area we just launched this as of this morning they're over 21,000 candidates in this portal already the challenges we have 15.5 million pros in the portal as well so there's 2200 jobs have already been posted we need to get more prospects into this portal and so we're doing everything we can partnering with technical college systems partnering with nonprofits partnering with workforce development groups the challenges we're a team my whole team is a team of and we can't go have meetings with everybody we want to have meetings with so trying to get the word out is really our biggest challenge but if you come here you can find a job today and start your entry-level career in the trades and then finally a little bit of other info with him Depot I'm passionate about paths to probe but we do a lot of other great things as well we have a military relations team I am a wife and mom to Marines so this is also some of super passionate tens of thousands of veterans working for us we have things called fellowship programs which is the skill bridge program for transitioning service members we've had 18 in Georgia come into that program in the last two years we last year announced a military spouse transfer policy with our 2300 locations it's easy for us to be able to transfer a military spouse wherever they might go with the United States on orders we have generous L.O.A. benefits we just added a seven day L.O.A. if you're going to be deploying so that you can go and get ready and have paid time to go get ready and mission transition online just launched in May it is free online courses on resumes building your brand and interviewing with a flare for helping military transition to civilian lingo because that's a big challenge for them so those courses are also online and free for anyone I encourage you to go see it our biggest initiative within our foundation and I'm on the board for our foundation is we're investing half a billion dollars to veterans causes by 2025 excited we're ahead on our on our announcement there so watch us around veterans day and we are also putting 50 million into the skilled trades so we are really trying to take these veterans that are coming out of the military about 200,000 a year and also give them not just career paths to the HMDPA but career paths to the skilled trades we're involved here with the HBCU's in Georgia our retool your school program helps do upgrades on the school campuses and also we have scholarship programs at those as well so final page I know I got a lot of content how can you help so I'm going to give you a to-do list to walk away with um one of the biggest problems we have like I mentioned is just getting young people into the non-traditional blue color career paths and I'm feeling I'm speaking commissioner dozers language here it's just getting people in there because school counselors are often incentivized to place into four-year degree programs since the no child left behind act and so there's just not as much emphasis on these so can we bring back college you know promoting trade tracks bring back shop class outside of just um college prep help you know fund the clubs expand community funding and grants for the technical college system and so even certificates would be wonderful um having outreach programs because like I mentioned we've got a program but me getting it to the hands of the right people it has been our biggest challenge because it's hand-to-hand combat building these relationships there's been in Georgia there used to be what's called go build Georgia which was like a consolidator for this information and kind of built that excitement here in Georgia it would be great to have something like that in Georgia again and then as you're able share this program with your constituents they can go today and create a profile and be ready to um and get a job or get free skills training they can be working next week that's the exciting thing about this so my team would be happy to give you all the social media graphics and collateral you could want to pass on to your constituents just send us an email and we would love to do that but again this is where um deep is really trying to help our pros grow and none of this is for us it's really for the betterment of the industry but it has been a real challenge getting this stood up thank you both uh inspiring to say the least I was what looking at your path to pro solution I'm thinking well we need to apply that to almost every industry have something similar there uh so hailey again one of our recommendations to be is how uh as a state can we work with all the different industries to facilitate something like this uh because clearly it's it's it's a needled in working but I can just see the same thing applying across the board that is fantastic work thank you thank you hi we may come back to you with the to-do list uh and asking you to help us to get there happy to do that all right other questions committee members there and we just touch a little more on the military hires and the retention raid obviously they make pretty good employees happy happy to yeah we really see when we hire veterans that they first of all they meet our values him deep it was a customer service service driven organization we have a values wheel and they aligned very closely to our company values they tend to be more loyal they tend to have lots more leadership experience um they they just fit well and they tend to stay and be committed so we really love having veterans on the flip side um we do a pretty good job of helping them transition to the civilian life it's really difficult so what we assign them a veteran mentor that is a veteran so they help with the things like I know in my husband my husband was in Marines for 20 years when he came out he didn't know you mean I can go to lunch when I want to and what what does the words business casual mean because you've won you know cammy's his whole life so we have programs that kind of help with the basics it's things you don't really think about and then we have training classes for our HR team too to tell them what it means to be in the military what they're when they say they were their MOS was tanks what does that mean kind of things to help the translation on both sides but we really love our veteran associates. Thank you for your time. Chair? Okay you you mentioned you have 15 million pros right so what obviously you love to have 15 million people looking for them right but what ways are you getting the word out to them. Great question so so there's kind of two different groups of people that that would go into the network it's it's the prospects and that's the one that's the the challenge that's finding the people that want jobs or need jobs and so we're doing everything from trying to get posters in the Department of Labor unemployment offices to working with their friends at Goodwill to get out that to to nonprofit partners like that to working with workforce study boards you will start seeing more from HUMDibo as a brand I will say this false specifically with some NFL football that I didn't say that and so we're really trying to get it out to get people interested in the trades on the pro side we've not really even marketed it much to them because to get that balance right like I said 20,000 versus 15 million we we know they're gonna come and eat up all the candidates we're trying to get the right number of candidates in their first. Chairman just one question you mentioned the investment that you'll be making in the military organizations it was 500 million I think was the number I was trying to I was writing to not running fast enough what was the time frame we first announced that we were going to focus on veterans causes in 2011 it's when we learned that veterans homelessness was at an all-time high it was at a critical peak it was actually 2010 so we decided to focus on veterans housing we made a small commitment then over time it's grown so 500 million from 2011 to 2025 is where we'll be half a billion dollars and we do things every it's veterans housing and support so it's everything from critical home repairs helping with shelters trying to find places where they have spaces to live I think we've touched is it 50,000 spaces at this point I know numbers in my head but I don't remember which ones are now versus future and so it's about 50,000 spaces and as of last year veterans housing issues have dropped by 50 percent so we're starting to see you know that we're getting to a point where the people that want to be helped are being helped and now we're trying to focus a little bit on the workforce development and helping them get jobs as well. Thank you. Other questions from the committee members? Seeing none thank you so much Hillary, Aaron and everything Home Depot does for us okay next up but we're going to have the Georgia Automobile Deals Association I saw Ben and Bill back there and I think we're going to have\n\nSome good local business owners come up to you. And I understand you're going to make a deal for them to drive home and afford today. Is that right Jason? All right, so make sure. I'll turn it over to you guys. Well, Senator Albers, members of the committee, Ben Jordan from the Georgia Automobile Dealers Association. The young man behind me, Bill Mori, is our president, Emeritus, and on behalf of everyone at GADA, we just want to say thank you for forming this committee. Thank you for tackling this very important issue. And thank you for giving us the opportunity to be a part of the conversation. I'm joined by a special guest, Mr. Jason Dinson, a Ford of Dalton, local Ford dealer here in town. And we're going to discuss an issue concerning workforce development that's quite a challenge for us in the dealership world, and that concerns automotive technicians. I'm going to provide a brief overview of the issue, and then I'm going to kick it over to Mr. Dinson to give some first-hand experience about what works for him, and why it's such an important issue for all of us to be aware of. Mr. Chairman, if there's any time after, we'd be happy to entertain some questions, and then I'd be happy to go through some of the information in the pamphlet that we've distributed beforehand. With that, we can get started. What is GADA? We are the franchise, or we are the trade association that represents the franchise, new car and truck dealers in Georgia. We have about 500 dealership members who collectively employ almost 35,000 Georgians. One fact we're very proud of is that the average compensation for an employee at a new car dealership in Georgia is now over $90,000 per year. So those are strong middle-class jobs located throughout Georgia and all of our communities. Speaking of jobs, there are a number of opportunities at a franchise, new car, and truck dealership. Of course, there are folks who work in sales like the traditional salesmen or women. There are folks who work in marketing, and these days there are more and more people working in things that we call digital retailing, internet commerce. There are folks who work in the business operations side, and then there are folks who work on the back end, what we call fixed operations. That involves the parts department and the service department. So for us, our biggest workforce challenge is, and for some time has been related to the service department concerning automotive technicians. What exactly is an automotive technician? Will these days it's much more than just a mechanic? These are very highly trained professionals who, whose job it is to diagnose what's wrong with our cars, to fix a vehicle when it needs repairs, and to perform regular maintenance as recommended by the manufacturer. These folks also utilize special tools. They are constantly being trained and retrained by the dealership, and by the manufacturer, and they can make a very, very good living doing so. So what's the nature of the workforce development challenge with them? Simply put, there is more demand for repair services than there is a supply of technicians to perform. Retta report recently that estimated that nationwide the shortage of automotive technicians is 800,000 throughout the country. That number is expected to increase to 900,000 by 2026. Why do we have such a supply demand imbalance for automotive technicians? Well, there are a couple interesting factors at play. First, the vehicles that we are purchasing that are new these days are simply much more complex than they were generations ago. They come with all kinds of sophisticated systems and technology on board, and when these systems have a problem and need to be fixed, it simply takes folks time and resources to work it out. Another thing is that we as consumers are keeping our vehicles longer. The vehicles are being made better than they were generations ago, which is a good thing, and they are lasting longer, which is a good thing. But the longer we keep our vehicles, the more repair services those vehicles will ultimately need. The average age of a vehicle on the road in the United States today is 12 and a half years old. So that's the demand side. How about the supply side? Well, our profession experiences what many other professions do as well, which is natural attrition. These are folks who try their hand at being an automotive technician and then leave for whatever reason. We're probably not getting enough folks graduating from technical schools in this particular profession in Georgia. We're doing a great job. Thanks to our friends with the technical college system, but nationwide, we're just not graduating enough. And one thing that's particularly relevant for our industry is that there is a pool of very experienced industry veterans who've been doing this for a long time. They're very efficient technicians, they're very proficient technicians, but a lot of them are in the baby boom generation. And those folks are reaching retirement and it will be very difficult to replace them if some corrective action is not taken. So what will this ultimately mean if corrective action is not taken? Well, obviously it's going to have an impact on our members and their dealership operations. But for us consumers, I think we've grown accustomed to getting our car fixed quickly and efficiently and for competitive prices. From GADA's perspective, we certainly think that's a facet of the franchise dealership system with a lot of independent dealers competing against each other for our consumers' businesses. But if corrective action is not taken, we're going to be frustrated as consumers when our vehicles are not repaired as timely as we're used to. So a lot of dealers are doing good work throughout Georgia to meet this challenge. Almost all of them probably are working with their local TCSG institution to address that. And one of the individuals who's doing a great job is with us today. So it's my pleasure to introduce you to our friend and GADA board member Jason Denson from Fort Adolton. All right, thank you, man. I appreciate you guys hosting us today and having us today. Good morning, Jason Denson. Born and raised in Dalton, Georgia. I actually attended this college, Dalton State. But after my first year and a half, I left the school and got in the automobile business in 1997. In 2017, 2018, I purchased my first dealership and renamed it Fort Adolton. I just south of here on, I'm sort of north of here on exit 336. I've been mentioned. I serve on the Georgia Automobile Deeders Association Board of Directors and the Ford Deeder Direct, Deeder Advisory Board. I've been on active member on several local and nonprofit organizations here around the Dalton Whitfield area. My operations manager, John Upton, serves on the Georgia Northwestern Technical College Advisory Board for the College and Career Academy. At our dealership, we employ 80 employees. 23 of those are technicians and another 25 support staff that also have, they're also technically trained. So 60% of my workforce has some sort of technical training or background. In 2022, we serviced and repaired 15,961 vehicles at that dealership. Approximately three and a half million dollars in sales, not including parts just in services. We've now expanded that to offer remote services. So we have a remote technician that goes to people's homes and does work. Can do recalls, can do basic old changes. And if you would have let me know and I understand we have some Ford F-150s represented here. We could have had them serviced in the parking lot today. But, you know, technicians, as you can see, are a vital part of our business. And with this field being such a high demand, we're constantly having to focus on keeping them well compensated, engaged, and up to date with all their technical training. Upon hiring them, we try to give them a career path during that interview process. And a timeline to achieve these steps. This has really worked for us. They can see a roadmap. They can see what it looks like to start out, to see across the Bay, what one of those senior master technicians that may be one of the baby-bender generation that Ben mentioned, that this guy is making great money. How can I get to that point? We offer assistance in helping them purchase their tools and toolboxes. These tools and boxes are lifeline of their business. After a period of time with our company based on training and job performance, some of these tools can mostly become theirs at no cost to them. It was interesting I was talking to some this week. I have four technicians that have over $100,000 in their tools and toolboxes. And you just think, wow, I need to increase my insurance. I'm sure to cover that. In 2021, the average median household income in Whitfield County was $53,000. It's been mentioned also, our technicians and their support staff are some of the most highly compensated employees in our company with several making over just by themselves over that 53,000 mark. And some making over six figures. How do we find these talented individuals? We try to start in the middle school level. Being there for career days, special sponsorship, people like cars. They like to talk about them. So we try to just be there and have a presence. Also, obviously, the Georgia Northwestern Career Academy, just to name a few. Something that we started three years ago is we partnered with junior achievement in Northwest Georgia and their facility located at the Hammock Creek Middle School campus here in Dalton. We have actually have a Ford of Dalton store front in that facility. In 2022, over 9,000 middle and high school students came through that facility. And these students are taught life skills from preparing a household budget to given them simulated careers. One of our focus career paths in that area is based on a technical service career pathway. We send volunteers to serve in this space each month, working with these students, telling about our company, telling about the fields that we offer. And I fund this project 100% with the staff, the volunteer hours that they put in during our business hours, and offer other resources with no assistance from Ford Motor Company. What do I believe could be done to get more people interested in the technical careers, just put a greater emphasis, and we've heard it a couple of times on the technical career pathway, starting at the middle school level, and having a statewide focus in importance emphasis on how important these careers are today. Years ago, I read about a lady that was having some car trouble broken down on the side of a busy highway, and she raised her hood of her car and quickly realized she knew nothing about what she was looking at. I thought it was interesting for her to mention she held several degrees in several fields, even holding a doctorate in one of those fields. And she described using the term uneducated to describe people that didn't hold such degrees, someone, myself, I presume, broken down with no help, she found herself calling her pair of shops trying to get someone to help her. Soon a man appeared and began to try to assist her to get her vehicle back up and running, and it ended up being a simple fix from what I remember in that article, but maybe just a dead battery. But after he got her vehicle repaired, and as he pulled away, I remember reading this lady begin to think, now who in this situation is uneducated. What a powerful story to hear about the importance of these jobs in our town, our state, and our country. I went by saying my two older children graduated from college already, and with a soft born freshman in high school, I've tried to drill into them that colleges it for everyone, but find a career to serve and find the field that has an excellent training program and go be good at it. Whatever it is, if it's sweeping floors, go be the best floor sweeper you can possibly have. So thank you for your time today, but forward to some questions. Jason, thank you, a great presentation from both you and Ben, and thank you for employing people in the community and helping them out and giving them transportation. It was interesting to learn that it's 12 and a half years that people are keeping cars now, and I just learned Senator Halperns was that old, so we can get her in a new car where I'm sure before she leaves Dalton, our servicers. There's a question for you Jason, you know, in some areas of the state we still have auto shop and high schools, but not nearly to the degree it was years ago. Do you have any of those in the surrounding high schools that you all are involved with or helping to recruit or participate in? Not in high school, other than the college and career academy, yet over here on the Dalton bypass, they have a shop class there that's not a traditional high school. But mostly not in the high schools, but we provide them with tools, we provide them with that particular school with shirts and hats and the like once a student expressed interest in our field, but not that I'm aware of. At Cherokee High School, which is an area that both Senator Beach and I, both represent constituents for, has a pretty significant one and you don't like to see that as we're working on our recommendations again, Halie. We need to, and I think it was mentioned earlier, to get those back into schools, you know, whatever it happens to be to make sure we're getting more hands on education. So thank you. Thank you, Mr. Chairman. I don't have a question so much as I just wanted to say that I appreciated what you were saying though about the middle schools. And I just wanted to kind of underscore that idea as well that, you know, no, we don't have enough of these kinds of programs in school at all, but maybe there's some thought around what level is it high school? Or we better serve to get children when they're a bit younger as students really at the point at which, you know, they kind of should be starting to think about what path they may take in general. Commissioner Jojo. I was just going to first thank you all for the presentation also all the support we get from all our industry partners, but you guys have also stepped up in that in many ways locally, but also globally when you look at the Ford pass at what net tech, but also up here part of your question, Mr. Chairman, we do have a pretty robust deal enrollment pathway and automotive. So we do try to help fill that with that partnership, but just great partners. And when you look across the technical college system, wouldn't be where we are in this area without them. Thank you, Commissioner and technical college system is so critical. We need more folks going to your schools. Danielle. Yes, Mr. Chairman and Jason, thanks so much for the presentation, but I mean, kind of on the list of best practices that employers should be doing. I think you're all hitting all of them. Is there anything that you found that's really moving the needle or is it one of those things that you feel like you've got to continue all these pieces to continue to drive growth in every area? We're talking about on the service side of things and hiring. Yes, we're constantly looking for good talent. It seems like that's something we meet on and talk about on a weekly basis. Who do we have? Who has one foot out the door? What can we do to try to salvage that person? We're constantly trying to make sure that we're in front of those situations before they leave because if someone has technical background, they can leave and go become a, you know, a, they could go to work at Home Depot, repairing washing machines or what have you. So we try to create a culture to make sure because it's been, we're almost 16,000 vehicles that we service last year. We can't afford to lose any one of those. You ask about local. So the career academy of Northwest Georgia is they have an automotive program in there. One of our former technicians teaches in that school, you stumped me. I'm not good on my feet. But yes, we are in that program as well. Did that answer your question? Dave. Thank you, Chairman Hours. Question for you about the junior achievement program. You mentioned that I think there were 9,000. So, I think the first thing that I would feel like for kids students that came through there is that beyond Woodfield County, is that like Northeast Georgia or what's the geography that you pull from for that experience? Great question. So we have the Northwest Georgia. So it's pulling from this, this area. There was one down at the World Congress Center as well. And Delta has a place there. Actually, that's how I found out about it was two weeks before Mr. Shaw put the endowment available for that facility. To be built here in Dalton. But two weeks before that, my son in middle school at the time had gone down to the World Congress Center in Atlanta. And he came home and he was, I think his career path was a pilot with Delta. And he came home talking about his budget that he had. And so I was like, this is unbelievable. And then two weeks later, they asked me to become a partner with them up here. But it is just the Northwest Georgia. And that was to keep those schools from having to go all the way down there that has just they were able to remain in our area. And there's, I'm not mistaken, that's a number of those throughout the state. So there's several facilities. Yes, they're more coming online. Yeah, I think there's four. I really wish they would have been here today with me because they're a great partner. I've know they're building one in Savannah. And then if I may, Chairman, one last question. Can you talk just a little bit about the impact of the transition to electric vehicles and what impact that may be having on your, your technicians and. Yeah, good question. So, you know, those electric vehicles have tires. They have windshield wipers just like the rest of them. And we actually service quite a few of those. There is some additional training that the technicians have to go through. You can't just easily go and just unplug the battery and start working on them. So there's, they're, they can be very dangerous at times. So they have to go through special training to be able to work on those vehicles. But last year or last, this month alone, we've sold four electric vehicles from the lightning, which understand that you have a couple of makies and some electric, an electric transit van. So it's becoming more and more part of our day day to day routine, even in a somewhat real area like Dalton. But yes, there's still the technical piece of that because there is moving parts in it. And they will at some point in time, not work the way that we want them to work. And so you're going to have to have people to be able to fix those. Any other questions? All right. Thank you so much. We appreciate it. Jason Ben and Bill. We appreciate everything. All right. Next up, we'll have a Q sales lease. I come on down. Thank you for having us. Thank you for having us today. And I want to introduce, cheering on. She's with my HR team here in the Dalton facility. So I want to begin by just introducing you for those of you who don't know. Could you hold the microphone up? Thank you. We need it because of the folks who are watching. Okay. Just introduce you to just briefly to Q sales for those that you who don't know. We manufacture solar panels. And this is a beautiful rendition of our factory that is in progress. We have a very good first slide of construction on the left hand side. That will be the Carter'sville facility. And we will manufacture both modules, wafers, and sales there, including ingots. The Dalton factory, you can see on the left hand side, we manufacture solar panels. And we've been here in Whitfield County. We began manufacturing in 2019 with the first building in the background. And then you can see we just completed our second factory just this month. So we have created 2,000 jobs in Whitfield County. There'll be an additional 2,000 jobs in Bartow County total of 4,000 clean energy jobs in the state of Georgia. With the exception, the next slide. So in addition to the 4,000 jobs that Q sales is creating, we are creating a complete ecosystem. Which will manufacture the raw materials that takes to create our product because we want to make all of that manufacturing process domestic. We don't want to rely on any materials from foreign investors. So we are looking to do that. So our factories here in Dalton and Carter'sville will create partnerships with these other companies, including some of our sister companies, Hanwai, who have already started manufacturing our construction in other areas in Georgia to support our factories. So talking about workforce development, what we're here to talk about, all of those jobs that we have created here in the state of Georgia, which Q sales, we are very excited to be in Georgia. I'm very excited because I'm a Georgia native and the regeneration of manufacturing. And I can tell you that manufacturing jobs today, the workforce in manufacturing is not my dad's manufacturing. And I think everyone mentioned it's someone mentioned earlier, it's not as putting up a job advertisement or putting up a, having a job fair, those are not working. When we opened our first factory in 2019, we hired 700 people in two months. We had over 300, 400 people show up for job fairs. Now job fairs, you're attracting if you're lucky, 50 people, if you're lucky. So what we're doing and what we're investing in and someone else mentioned middle school. We are investing as early as middle school and how do we get kids interested in manufacturing. Four-year education, as everyone has mentioned, that's great, but we want them to understand that whether they go to four-year secondary schools or technical schools or just right out of high school, that there are career opportunities in manufacturing. And not just jobs, traditional jobs, their robotics jobs, the largest, the survey that was recently done with economic development in the state of Georgia. The number one jobs searched in Georgia now are machine operators, but it's mechatronics and robotics. Those are very critical. So we want to get kids interested. Frankly speaking, I think it has to start before middle school. We are investing, my daughter is a fourth grade teacher, she teaches kaleidoscope. And part of that kaleidoscope touches second and third grade. And I said, in your kaleidoscope, are you talking about career opportunities? And she said, yes, we're promoting them because those are the students who are going to get a college. And I said, are you introducing them to other opportunities? So I would like to see, and we are starting to work with elementary schools. We have host tours for elementary schools because we want to see more interest from the schools in promoting jobs. And more of the, we work with the counselors, the schools counselors. We've had every school counselor and Whitfield County come through and Dalton school system. And Gordon County come through our factory so they can see what opportunities are available to promote them. Some of the things that we need in order to make our, you know, to fill those jobs are transportation, housing, branding Georgia as a place to work. Those are all the things, but what I want to talk about is we need to get away from promoting, we promote that the unemployment rate is so low for Georgia, which that's a great thing for headlines. However, that's not great for job, you know, we're creating all of these jobs. But what that means is when the UI rate is that low, the employers here today, we're all just taking from each other. So I'm not recruiting unemployed people. I'm recruiting people. Sorry everybody. I'm recruiting. I'm recruiting people that are working somewhere else. And so that means that myself or Mohawk or Shaw or all of the other employers, we are investing in training and development. And then they're going to leave and go to another employer. So what we need to do collectively is brand Georgia in the states that are seeing down ticks and jobs brand Georgia as a place for people to come because the elementary middle school are great for the future workers. But for right now, these jobs are here now. And in order to meet that need, so going back to transportation, the high school graduates that we see, we want to keep this population, not just attract new population, we want to keep the population, but what we're seeing is as employers that they want to move to more urbanized areas. So where the jobs are, better transportation, affordable housing, those are things that we are, you know, we're seeing that really needed a need a focus. And I'd like to, you know, close and then open it up for questions by saying that every job that is, you know, every job from service industry, my husbands and the automotive industry and my dad was in aerospace, my mom was in textiles. All of these, my brothers and education, my daughters and education, all of these jobs are important. But what we need to do is we have to understand that every job no matter what job it is, and I think someone said it best with the situation with the car not working is when I was younger, I wanted to be at the end of the day. I wanted to be a pilot.\n\nMy dad worked for Lockheed and he made, he was an engineer and when I ask him what he did he said he made airplanes and I said well I want to fly airplane. And he reminded me well you know you really can't fly an airplane without somebody making it. And that's always stuck with me and I think we forget that. That it is the person on the line and those people making our products those people serving our food. Those are the missed population because of this transportation because of the lack of affordable housing. And so it's impossible for us to employ those people. So I'm open for questions. Well thank you appreciate the presentation and your very significant investment in the community we appreciate. Questions from the committee members. Daniela. Thank you so much for being with us and again for QSELS huge investment in northwest Georgia. But I was wondering if you kind of talk a little bit more about the sheer volume of you know people that you're trying to employ now. I know you talk so much about kind of that future workforce pipeline you're developing but just kind of the you know again the sheer volume of people you're trying to bring online so that you can keep operations on pace. Sure so we hired a thousand people and we began this year with hiring another thousand we're around 80% to our goal and that last 20% truly is a struggle. And sometimes it feels like you're running in quick sand because you're hiring you're filling the same job just over and over and over because again we're competing for the same population of workers. So our Carter's will factory we're still in construction but we've already began the recruiting for that and by January we'll have roughly around 200 people but by first quarter we'll have over 800 people in that factory by the end of the year we hope to have 2000 people. Again when we talk about we're hiring five years ago or ten years ago that was so such a positive thing because you were taking people unemployed and putting them to work. Now when we're hiring people that challenge is again we're we're having to be so creative you're paying hiring bonuses you're having people at events that you wouldn't know giving out coffee and you know come have coffee with us come and come meet our team all of these things that we really are investing in just to try to get that in you. So we're having to get that in the interest that traffic and it's so many things there's not just one thing that works anymore but the 2000 people by the end of the year next year for the Carter's will factory and then you know we will have expansions after that as well. So thank you for your investment in Georgia we appreciate the jobs that's great. Two questions one are the principles receptive to you promoting manufacturing jobs in the middle schools and then secondly being so close to the Tennessee line are you pulling from Tennessee employees. So principles we have found we've had principles in our factory for the tours so the entire school system the thing that Georgia does like I I lived in multiple states and I'm a proud Georgia we do education right that is the one thing that we not the only thing but is the one thing educators are interested in having employers in their schools they're interested in engaging it's just the message at home is in the message collectively is these are the jobs available but they're still that stigma for manufacturing and service industry that if you're not going to college you're going to as a last resort you're going to be working in a you know in a factory and that's the stigma we have to take away and educating educators that instead of saying here's your last option it needs to be at the top of the list here are your options college and not college or Tennessee I apologize so Tennessee we are we work really close to the city we work really closely with schools and Tennessee we I think someone even mentioned earlier canisol state canisol state and GNC to Chattanooga have been our top recruiting locations but even for elementary and mental schools as well. Any further questions thank you so much for your presentation we appreciate it next up we're going to have ACT Fred if you want to come on down when he's getting ready to talk on remind people we've got some good breakfast over there and some coffee and some tea and some waters and other things and I will turn it over to you and take us away I'm going to get some fresh coffee. Well good morning thank you Senator Alvers and the committee for the invitation today my name is Fred McConnell senior director of workforce at ACT it's my pleasure today to talk with you about ACT work rate communities before we go too much farther however I didn't want to clarify that yes this is the same nonprofit ACT that delivers the college entrance exam that so many people are familiar with what fewer people are familiar with is that since the early 1990s ACT has been delivering a work readiness assessment called work keys this assessment is really developed based upon employer demand employer needs for a long time probably the first 10 15 years work keys was solely focused on the interaction between an employer looking to hire an individual with the right skills and that job seeker. It wasn't until around 2007 that one state in particular came along and changed the workforce conversation change the game and really started hiring a new way for workforce development to start being discussed as ECON development proposal. Some may have guessed it but that state was actually the state of Georgia you may recognize the logo up here if you've done any driving around the rural areas of the state you've probably seen one of these road signs in fact if you've gone 46 going into meta Georgia coming in from the east I actually help put that sign up because it was my great pleasure to work with then governor Sonny Padoo in 2006 through 2011 to really employ and develop and put out his workforce development system. Georgia work ready was the first state in the country to really start seeing how are we going to compete with our other states how are we going to show that a workforce in our state is the best that there is so governor Perdue and his initiative at the end of that four year period had 146 of the 159 counties certified it really became a best practice immediately recognized across the country. There are challenges however though when it comes to governor led initiative one is governor led when you have a governor change office sometimes the initiatives and those priorities change we also were really entering a workforce development area that was in his infancy being discussed you cannot development was about tax incentives rail power the sites workforce development was not a huge conversation at point yet now today to have a workforce committee. Completely has changed the entire environment have employers look to try to find out where they're going to locate where they need their jobs and who's going to help them supply those jobs going to the future. So after Georgia work ready we had one major challenge we asked of course they were using ACT work keys at the time to be their building blocks for developing and showing what our workforce looks like big issue was our remember the day it happened an employer came in from Germany we were in the Dublin area they said well this is a great initiative this is a great campaign we like the idea well who really set up these standards who set up these goals be the state let initiative we said well we did we love this but I remember them saying well isn't that a little bit like giving yourself a gold star how do we know that you didn't make the goals so that you knew you be successful and we said you got something there so at that time we actually turned around to ACT our partner the time and said ACT with your 30 40 years of research and back and we think you should be helping us determine what the national standard for the ACT work rate community looks like that way we can compare our communities to any other community around the country to show what our workforce looks like and how it can compare. So in 2012 ACT did just that all ACT work rate communities all agreed to the same standard practice again we want to make sure that we're comparing apples to apples when it's the individuals or when it's the actual communities all work rate communities agreed to have a certain percentage of their emerging current and transitioning workforce earn a work keys assessment or what is called your acronym of the day and NCRC the national career readiness certificate we also have to build employers as the beginning of that pipeline if we're going to build a pipeline from your students your community and technicologists through your workforce boards to your four year colleges to your employers you have to make sure that you have your starting point and your ending point the biggest piece of all of this though is creating that common language we were talking a little bit earlier about this we've been talking a lot of high schools that say well if the employers would just tell us what do you want in the student in order to be successful and they tell us in our terms and things that we understand then maybe we can provide it. Flip it over the employers say well if the education entities would just tell us what they can provide us in terms that we understand maybe we can do something in these communities what they're community doing is creating that common language how do you know individuals work readiness skills from high school up to your level of intelligence and intelligence colleges through their workforce boards to the employers once you're talking the same language then you're really able to see the impact and be able to see where our gaps how do we improve these areas of need how do we make sure that we are providing a good workforce pipeline that allows students to benchmark their skillsets with every credential they receive every degree they receive will make sure that their skills are increasing along with those initiatives. Work keys of course made up of assessments then CRC we covered earlier which is a billion block for ACT work rate communities we have curriculum but I think the biggest part of this is that job profile piece ACT has gone out to over 30,000 employers over the past 30 years talk with them ask them what do you need an individual to be successful and that's what really influences and make sure that our assessment are asking individuals what the best skill sets are to make sure that any employer needs. Through those profiles we found that 80% of all jobs we have ever profiled over the past 30 years require these skills on a daily basis applied math graphic literacy and workplace documents the big differences so let's talk K12 versus a workplace area so when ACT I can do this in the ACT world you're asking out reading we might do a Edgar Allen Poe reading figure out what is the message is trying to tell us and workforce world it's going to ask you how do you drive a forklift. You have to read the manual be able to interpret the data and be able to drive that forklift in the math world as a liberal arts major they're going to ask you to start putting letters into your math that's heresy I don't understand it doesn't make sense to me but if you put into real world world terms of your contractor trying to resurface the floor of a gym a bucket of paint covers it 20 by 20 feet the gym is 200 by 400 feet how many buckets of paint do you need. It puts those goals into real applications. So today we stand at almost 6 million in CRC is delivered is a nationally recognized credential with digital badges out there now it is transportable between states a gold certificate in Georgia means the same thing as a gold certificate in Tennessee South Carolina Alabama or Hawaii. We have 28,000 employers who are requiring a recognizing in CRC and over 2 million work he's assessments are conducted every year. So how does that really help us when it comes to economic development linking our education and our workforce together to line to economic development needs of a state or its regions. The secret sauce and work rate communities is the communities themselves what ACT is providing is the data. We now know what the individual community looks like when it comes to their workforce we have an infrastructure that we've learned from other work rate communities that have launched. But the secret sauce is the community themselves we have 541 communities that have launched over the past 10 years all 541 go about this differently because they are different communities they have different needs they have different strengths and weaknesses. We want to make sure that all of these participating partners of work rate communities are involved you cannot have a work rate community be successful if it's one group trying to do it by themselves. I'll go back to my early days and my family's old stomping grounds in K-road Georgia if you might be familiar with it. I had some folks in the room that I was familiar with they all had their mission statements but they're all pulling in different directions. We talked about their mission statements and said well they're all kind of saying the same thing just with different terms what if you had a common language to really connect all those things together. After a little bit of arguing they had their kumbaya moment and they started pulling the same direction. And once you start seeing that language established and understand how that creates the benchmarks for individuals through your pipeline then you can start seeing where every individual group plays within that pipeline. Being ACT we have years and years of research to back up what we see in these communities and what we see with work keys for employers of course we see them reduce turnover boost productivity and of course reduce training time. For the educators it helps them and helps their students understand what actual skills are needed to do a job successfully if they want to be a mechanic and they're in the 11th grade. Well you're going to need a goal certificate in order to be a mechanic you're currently asked silver you're going to have to get some certifications along the way but you're also going to improve your skillset to make sure that you go in that position knowing exactly how to do that job. For your learners it helps them learn and work sooner it helps them work longer also and I think this is overlooked helps them build confidence individuals who say well I've been on the workforce for 10 15 years I must not have the skills necessary be successful. You'll be surprised how many individuals go in take the assessment say man I got a silver certificate I would never thought what does that mean I can do oh I can go in Georgia and actually get a $50,000 job as a car mechanic. That changes the attitudes it changes life trajectories and it changes narratives. And then last but certainly not least for each on development piece how does all this put together how does this allow communities to say to perspective and current employers we have the employees you need to be successful today and 10 15 years in the future because we have done the alignment between what our workforce actually looks like now and what we think your workforce will look like 15 years in the future. We knew we were on to something when the site selection magazine started using the ACT and CRC as its workforce development metric and it's really state of the state and workforce rankings. So coming full circle where we were in 2007 I as a much younger man going on tall 159 counties at least once and having the time of life pushing incredible work force initiative by then governor Perdue. We have now grown that initiative to 32 states in the territory of Guam all of these states are now able to go individually and say we can compare apples apples not only our individual students for where their works workforce skills are but we can start comparing apples apples of communities to one another. And you're going to those RFPs site selectors how do we know you have the workforce needed to do what we need you to do this is an interactive map that's on our website that allows you go in individual to each community see how many NCRC's they have what level they burned and how that matches to an employer the timing of this is excellent. Because as of last week you heard me say earlier that after the governor's initiative went dormant in about 2011 when he changed office last week we actually launched our first four new work ray communities in the state of Georgia. We had a big county peach county house and and Polesky we had 11 counties in the central Georgia part of the state joined what is called a boot camp every single work ray community that signs up goes through the same 16 hours to make sure that all the same level playing field where we train them how to launch sustain and grow a work ray community. We have seven more that will launch hopefully with by 2024 and this really has been a huge step being that what you see in earlier is that while we didn't have official work ray communities continuing the state of Georgia the infrastructure and what was established by the employers and accepting in CRC's is still there being that bib county and housing county just launched bib county already be at 96% of goals house and county being 87% of goals. The infrastructure is there the fabric which makes a work ray communities there and we're seeing them be successful in a very short period of time. So again I want to thank you all for your time today of course looking forward to your questions. Well excellent update hopefully you'll continue to expand back in Georgia to all the other counties now that you're your back home will need you to be. Oh yeah notice that Hawaii was a little bit behind though I'm going to make a site visit with you if need be to help them get a line on that one because just about everybody ACT is trying to get that Hawaii one it has been the Guam ones a little far the Guam no one's made that site visit yet but Hawaii's next fair enough outstanding work questions from the committee members. So on the learner or the people actually becoming certified. What is the average age or experience level or are these people who are literally starting careers or these folks who are more mid career just give us a little bit of a profile of the person. Great question because this isn't a one time like the ACT where you're taking that assessment one time right for intercollege work keys is designed basically for anybody that is trying to transition jobs start new job. Get back in the workforce anywhere from 11th grade sometimes it always 10th grade all the way up to someone trying to come out of retirement going to go back to work because it is trying to measure based upon actual work skills. If they're looking for a job and they have need that confidence boots and they need that identifier they can come at any point I would say majority of our test takers right now are usually that 11th to 12th grade. We also have a very high population in our community and tell colleges that are in that trying to find my next job trying to find my first job. How do I match up to welcome players being able to see what they need for me to be successful with their workplace and master skills to those individual jobs. I'll tell you Fred I think one of the things you brought up about these seniors coming back in the workforce is critical as well. I mean we've got a massive part of the workforce that is some of the most responsible and skilled but their skills again from their perspective sometimes may or may not apply we need them back in the workforce and and can do with 40 year high inflation in the stock market that's been pretty rough the last year and a half two years. They need to work and we need them as workers so thank you for helping us connect the dots. Any other questions. Great job. Thank you so much. All right next up Shaw Industries. Come on down Brian I think you're going to present to us this morning. Thanks a lot. Thanks a lot. Chairman Albers and distinguished members of the study committee. Thank you for the opportunity to be with you today. My name is Brian Cooksy and I am the Director of Workforce Development for Shaw Industries. On behalf of our outstanding Shaw Associates and our president and CEO Tim Balkham I'd like to welcome you all to Dalton and Whitfield County and the floor covering capital of the world. Thank you for focusing on this important topic. George has always been a great place to live and work and our company is proud to call Georgia home. And since our founding one of the keys to our success has always been attracting developing and retaining talented workforce. So this is very important top it does. I'd like to share with you a little bit about Shaw just to give you some background. Shaw was founded here in North Georgia more than a century ago. We have built on our legacy and carpet manufacturing to become a six and a half billion dollar global flooring and turf provider offering solutions for every possible place and space for residential and commercial properties around the world. Simply put if you can walk on it we make it. Of our 20,000 associates over 13,000 of them live and work here in Georgia. Of course we're headquartered here in Dalton and have a large presence across Northwest Georgia but also have operations in numerous other communities across the state. Well my slides are not there they're changing but they're not. Let's see sorry went the wrong way. One more there we go. Okay for the talent standpoint Shaw has diverse talent needs that span across many segments including information technology engineering supply chain business sells and marketing data analytics production design robotics nursing and many other fields. We're a company of makers and innovators. We desire to employ individuals who want to build a career not just find a job. Our business has invested over one and a half billion dollars back into our company over the past couple of years. This investment has resulted in new technologies systems and automation across the enterprise. Every hourly job at Shaw is engaging with technology in new ways using data to make decisions and working side by side with automation and robotics. Our use of automation and robotics is focused on eliminating repetitive tasks further improving safety and enabling our associates to be decision makers rather than using their physical attributes. While we have many diverse careers our top talent needs at Shaw today include on the hourly side production industrial maintenance and transportation and on the salary side engineers automation related roles data analytics and information technology. So I'd like to share a few things with you around what's working for us today in terms of workforce development. First apprenticeships and partnership with our TCSG partners. Shaw is using the rest of the apprenticeship model through the technical college system to upscale existing associates into industrial maintenance roles. This model creates new opportunities for those associates to grow their career and earn additional income and learn new skills and also enables us to employ individuals to backfill those roles that they're coming from in production. We're currently using apprenticeships not only here in Georgia but also in South Carolina but we desire to continue to grow our apprenticeships over the next few years. In addition to that Shaw is leveraging first robotics to engage with K-12 students in hands-on ways. This platform provides us with an opportunity to mentor students and expose them to skills and careers that they were not thinking about in the past. First is helping us build a pipeline of talent for engineers, technicians and programmers. Talent that is becoming interns, co-ops and full-time hires with our company. The students and first robotics are learning problem solving, troubleshooting and teamwork skills that are needed by our industry. In addition to first robotics there are several other education partnerships that are providing beneficial success for us in workforce development. One of those is college and career academies. Shaw currently works with five college and career academies in northwest Georgia. We have associates who serve on governing boards and help drive strategic plans for these schools every day to focus on workforce needs in those communities. College and career academies provide industry with a seat at the table to influence the educational programs and the credentials that students are receiving. We leverage these partnerships to build relationships with students, identify work-based learning opportunities and engage with pathways to share our career messages. Another education partnership that is working for us is manufacturing education through CTAE. The Georgia Department of Education has invested in manufacturing pathways recently. During the last school year the Department of Education awarded $4.5 million to 12 schools through the SME Prime Program to expand and update manufacturing pathways across our state. This funding has helped update manufacturing labs and brought industry to the table to make industry driven decisions on the curriculum and credentials that students will earn. We appreciate the DOE's investment and we need to continue that. That's only 12 communities but there are a lot more needs around our state. Additionally the Department of Education will soon be introducing for the first time elementary level manufacturing career education, which we're excited about. In addition one last education partnership I'd like to highlight is right here at Dalton State College. At the USG level, Shaw has worked with Dalton State to develop a four-year engineering technology degree. This bachelor's of applied science program has enabled individuals with a two-year TCSG degree to seamlessly complete their four-year engineering degree at Dalton State. This has helped provide a platform for existing associates who have a two-year degree to enable them to stay with our company while continue to advance by earning their engineering degree. As well as also allowed local students from RK-12 system to complete their engineering degree locally at a very cost affordable rate. Having these latter in articulated programs is a great best practice to continue between TCSG and our USG system. Finally another program that's working right now is second chance employment. 40% of Georgia's population has a criminal record and Georgia is in the top five states for most residents with a felony conviction. Historically the unemployment rate within the second chance community can be as high as 27 to 30%. As a second chance employer, Shaw has established almost a dozen community partnerships with local and state level organizations that are connecting us with talent in this space. Talent that has been just as involved homeless is overcoming addiction or facing other life challenges. The second chance talent that we're finding is ready to create a better future for themselves by going to work. We have found a strong retention rate within this population and we're excited to see many of these individuals grow with our company. This type of program is a win for Shaw, a win for the individual, a win for our communities and a win for the state of Georgia. I'd also like to share with you a few challenges that we're facing in the World of Workforce today. As we discussed earlier, the World of Work at Shaw is ever changing. But we're also seeing a change in the desires and needs of the Labor pool that we're recruiting today. 32% of the Labor Force desires some amount of remote work. 17% of the Labor Force desires part-time work. Many millennials in Generation Z are showing a desire for short-time job assignments or gig type jobs rather than full-time jobs. And individuals are also desiring a lot more flexibility in schedules and flexibility to adapt to life challenges. These changes along with the decline in birth rates and labor participants.\n\ncontinue to make it challenging for manufacturers to maintain talent levels. As a company, however, we are adapting and adjusting as quickly as possible to engage with today's labor force. We are working to keep our talent funnel as wide as it can be through improving our flexibility options. And as I mentioned, continuing to engage with traditionally underserved or untamped talent populations, such as justice involved individuals, homeless individuals, refugee populations, veterans, those are disabilities and other talent pools. To be more flexible for talent, we are leveraging apps to provide shift swapping options. We are offering part-time roles more than more of those than ever before. We are using services that provide gig or short-term work assignments for those that want to work when they want to work. We have adapted our policies to continue to be more flexible for life challenges and for allowing folks to address the obstacles they might face in their life. In addition to the new world of work in rural communities where Shaw operates all of our manufacturing facilities, we continue to see challenges with applicants and associates related to child care, transportation, and housing. In every location where we have manufacturing operations, there are limited public transportation options. Childcare centers are also facing labor challenges that are unable to meet non-traditional work-hour needs for child care. Available in affordable housing is also challenging in many of those communities. In each of these areas, Shaw is exploring what we can do as a company for our associates and we also continue to be involved in local community conversations. As more and more jobs come to our state, these three areas will continue to be a challenge across Georgia. As I close my remarks, I'd like to offer a few suggestions for you to consider as you continue to do your great work. First related to apprenticeships. In 2022, the Senate passed Senate Bill 379 which established the High Demand Career Initiative Apprenticeship Program. We are thankful for the state's investment in apprenticeships because they are working. This program can grow and be improved however. One challenge for Shaw is that we have multiple locations across the state, but the HGCI program limits companies to only five apprenticeships per company. Additionally, there is an opportunity to also include pre-apprenticeships in the program to allow high school students who are working as apprentices to learn skill or trade. I'd recommend that the state reduce the available funds per apprenticeship to a lower amount, but add additional flexibility to the program. We'd be glad to work with TCSG to help establish some of these parameters that will incentivize more engagement in this program. College and Career Academies. Georgia has over 50 of those across the state, but more communities desire to have this workforce-driven model. In past years, the General Assembly has funded a competitive grant process that brings communities and industry together to establish a College and Career Academy. This past year only one grant was funded, but four communities were competing. I'd encourage you to expand College and Career Academies into communities who are willing to commit to this best practice by funding more of those College and Career Academy grants. Support for second-chance and refugee individuals. Continue our efforts in Georgia to support individuals from the second-chance community, as well as those who are refugees in our state who desire to enter the workforce. This program includes providing GED and job skills training prior to someone being released from prison, providing support services such as counseling after they are released, and helping with document support services. Speeding up the process for these individuals to be able to obtain the documents that they need to be able to go to work. Also, what can we do as a state to encourage more employers to consider working with these individuals from underserved populations? The next thing I'd like to suggest is robotics programming with first robotics. With all the advanced manufacturing jobs in our state and those coming to our state over the next few years, we need more programs like first robotics in Georgia. These programs span the K-12 spectrum and provide experiences for students to apply their math and science skills to real-world problems. Students learn problem-solving collaboration and time management skills. At the high school level, they also learn technical skills such as CAD design, fabrication, programming, and other relevant skills that are much needed in our companies. These programs exist in Georgia today largely because of private sector funding. We are behind other states such as Michigan, North Carolina, and Texas that are providing state-level funding to help grow and expand these programs across their state to more and more students. And finally, regional infrastructure challenges. As we discussed, in many of our rural communities where Shaw operates, transportation and childcare are obstacles for many people in the labor force. The Georgia Department of Early Care and Learning recently awarded the Georgia Association of Manufacturers a Child Care Grant to pilot non-traditional child care solutions in 14 communities across our state. In these 14 communities, manufacturing companies and local childcare providers will work together to explore various solutions. The goal is to find what can move the needle so that plants can be made to permanently implement effective solutions. Could a similar pilot program also be used to explore public-private partnership options to solve transportation challenges in these areas? And are there other options that could also be done to encourage public-private partnership solutions for things like housing? Appreciate your time today, and thank you for the work you're doing, and we welcome any questions that you might have. Thank you, Brian. I think there's a couple of questions. You mentioned about the limiting to five apprentices. That kind of seems like a no-brainer for us to modify that one. And then what you're saying is, maybe we could use the existing budget, but just giving a little more flexibility. I want you to make sure I capture your words correctly. Yes, sir. And there have been other apprenticeship options as well. I think some of those have been federally funded. Obviously, the one I mentioned was a state-controlled solution. It offers, based on the length of the apprenticeship, a tiered model of funding that starts at $5,000, $7,500 to $10,000 per apprentice. So what we found is we don't necessarily need that much money. We would rather that money be used to pay for tuition of some of the fees at the college. But as an employer, we're paying folks to go get that education. We're buying tools for our folks. We're providing steel-toed shoes, uniforms, different things like that. So there's a lot of investment we have plus the tuition. So this, again, is a public-private-type partnership to help with these things. So we think you could lower that top-level investment, which would expand the opportunity without creating more budget. Thank you, Commissioner Mike. Have a little context for us. Yeah, I was just going to say, Mr. Chairman, we'd be happy to work with you. It's just a recollection. That was a new initiative put in two sessions ago. We launched it this year. Those tiers are set just by policy at TCSG so we can work with you on those tiers. The companies are limited to five based on reimbursement. This money was specifically put in the budget to assist the companies with the cost of the company on having an apprenticeship. So just when you say it's limited to five, it's based on reimbursement to the company who applied for that cost internally. There's no limit on number of apprenticeships across companies. We also have two other funding opportunities for the actual cost of training. So when you look at those, obviously I'll sit down where you won't spend a ton of time, but we have the federal funding that comes in and then we had some one-time cares money that came in for actually training of the individuals beyond just the mentorship cost and company cost for the employers. But love the program, I think it's widely successful and love to kind of match up what makes the best sense. And if we can do more, but less, I think that'd be wonderful. Yeah, apprenticeships are working. So we're certainly in favor of continuing that and we appreciate what y'all've done so far. Thank you, Ron, and thank you for the job, Joel Creep, with Sean, what you do for our state. My question is on the second chance of program. Are you working with the wardens at prisons or the parole board? How are you finding these folks coming out of prison? Yes, we work directly with the Department of Corrections, both at a state level as well as our local prisons and where we have operations. We also are working with nonprofit groups throughout the state that are serving individuals who are coming out of prison who are looking to find housing, get a job, provide support services. So it's a combination of directly with the prison system, but also with nonprofits who are servicing that population. They're pretty loyal employees if they come in and get into a job and do well. We are finding tremendous success with this program. I mean, well over 75% retention rate with folks beyond 90 days, which we can get someone to stay with us beyond 90 days. We usually have them a long time at Shaw. So we're having a great success and seeing these folks come in with a desire to work. Like any population, you're not going to be 100% successful, but we've found a lot of folks because we work with these community partners. They know their folks well. They know when they're ready to go to work and they're connecting them with us and we're providing that platform to give them a job to help. If they can't find a job, that's a big obstacle to being able to turn your life around. But if you can find a good paying job, you can find housing, you can re-boil it your life, you can reconnect with your family, you can do all these different things, but that job is a big challenge. Other questions from community members? Seeing Brian, thank you very much. Great presentation today. Thank you so much. We're going to bring us home here. We've got the Georgia Alliance for Career Education. We have two GACEs today, ironically enough. Mark and Bob, come on down. We'll look forward to hearing from you. Good afternoon, everybody. We want to thank you, Chairman Albers, for having us today. Community members, we thank you for your time. We don't have a presentation today, but we've instead prepared some remarks that we'll just kind of read through to ensure brevity. I think we probably stand not only between the committee and the German, but probably lunch as well. So we will try to be brief and then get to any questions that you might have for Bob or I at the end of our remarks. Again, my name is Mark Williams. I have the pleasure of serving as the president at Fortis College, SFOR, TIS, Fortis College, located in Sumerna, Georgia. We operate out of a 45,000 square foot facility right in the heart of Sumerna on South Cobb Drive. Since its inception in 1969, as then Medics College, and then with the change to Fortis College in 2011, we've been focused on providing post-secondary education to both traditional and non-traditional students through a variety of skilled trades. We have been in the Allied Health Diploma and Degree programs. This includes training, future, qualified employees in the high demand Allied Health fields, of medical assisting, dental assisting, dental hygiene, and radiologic technology. What we believe at Fortis College is that what we get the opportunity to do every day with our students not only makes a difference for them, their families, and their futures, but we think that ultimately it makes a significant contribution to the economic growth and social well-being of our local community and to the state of Georgia at large. So with that in mind, we certainly appreciate the committee's focus on the state's workforce challenges, including the need to examine the healthcare workforce issues that are not only being experienced in the state of Georgia, but in the United States at large, quite frankly, the studies are everywhere. So that's not new information to folks on the committee. The three things that are driving the decline in the healthcare workforce community as you probably know, aging population, folks who are aging out in the healthcare sector and retiring, and then especially what we've all been through in the last three years, people are leaving because of burnout. And retiring or seeking other avenues of employment, just really quickly, again, studies are everywhere, but in May of 2023, the HRSA, the Health Resources and Services Administration, examine this issue. And in areas where healthcare workforce shortage has been identified in the United States, there's a need for more than 17,000 additional primary care practitioners, 12,000 dental assistant practitioners, and 8,200 mental health practitioners. And so we know that again, that's not new information, that's information that's out there for everybody, but this healthcare worker shortage is a multi-faceted issue. And stakeholders at every level, I have got to work together because in silos, we can't educate and train enough healthcare workers fast enough to meet this challenge. So the last thing I'd say is just in our effort at Fortis College, we partnered with over 140 doctors offices, dental offices, medical laboratories, healthcare facilities, major hospital systems like Piedmont, children's healthcare, Atlanta, and through these employer partnerships, we not only provide on-the-job experiences for our students, but ultimately that education process turns into an opportunity for those students to be employed with that employer partner, or certainly, and insures that they acquire the skills that align with the evolving needs of the healthcare industry. So, in concluding my remarks, I'd just say to the committee that through Fortis College and the Georgia Alliance of Career Education, you have partners who are ready and willing to work with you to help make sure that we're meeting physician's needs, dentist needs, and our healthcare systems needs in the communities that we all serve. And I'll turn it to Bob. Thank you. And thank you, Senator Alvers, for the opportunity to speak to the committee. I'll start to tell you a little bit about my background. I grew up in the Marrietta area, graduated high school, there's really two options. You either go in the college or you go in the military. One of the very gifted students I went in the military had the honor of serving a more two nuclear-powered submarines. Got out of the military, went to a chat of Hitch Tech, a study of the HVAC program. Enter the field, made a good living, worked my way up, field technician, field supervisor, service manager, operations manager, eventually vice president and had the opportunity to start purchasing equity in the company I was working for. We sold that company in 2019 to a private equity company, stayed on board for a couple years and then decided I'd do other stuff. Earlier in my career, I worked part time with the Mechanical Trades Institute, which is the local union 72 apprenticeship program. The line of area taught down there for seven years and actually taught at as an adjunct instructor from 1921 to 23 at the Hitch Tech. I spent the last ten months before joining Lincoln Tech, working, setting up apprenticeship programs with Mechanical Contractors across the US, I was working with a, excuse me, working with a peer network and a talent development company in which I'd have registered apprenticeship programs throughout the country. At Lincoln Tech, I've been there since August, so relatively new in the position. Lincoln provides training, job-ready skills and just one year. You're not aware Lincoln Tech's been around, just celebrated at 77th anniversary. They got 22 campuses throughout the US and after the first year we're opening a campus down the East Point area. The Marrietta campus where I work at has been open for 17 years. We offer career training programs and medical assistant, electrical and heating and air conditioning. Obviously what I'll be talking about is the heating and air conditioning side of it. At the Marrietta campus, we currently have about 350 students, 140 of them's an HVAC department. Our students tend to be adult learners, average age is 33 years old. About 20 to 25% of our students are veterans. I won't spend too much time, you know, hashing over the skilled labor gap. A lot of people's talked about it, but just highlight the problem in my industry alone. We need to recruit over 41,000 HVAC technicians year over year for the next 10 years to meet the projected demand by the Bureau of Labor and Statistics. The HVAC department at Chattahoochoo, we bring in about 40 new students every month. Our curriculum allows for multiple entry points and it's structured with 10 separate modules, different classes covering various subjects. We use a blended program, so a portion of the coursework is done at home online with the students and then a portion of it is in person. The students go to school four days a week, about five hours a day, and they're all required to get the EPA 608 certification for safe handling of refrigerant along with OSHA 30 certifications. And really the goal is to make each student work ready when they graduate, so they're able to meet the needs of the employers in our state. A couple things I've noticed in the short time I've been there that seems to be working well at Lincoln. They have small class sizes, classrooms and the labs are designed for about 30 students, but they're averaging about 20 students per class. All of the courses that I've seen are trade relevant, meaning you're probably not going to get Shakespeare Greek mythology as you go into an HVAC program. One of the things that's very nice is the simulated workplace environment. All the students wear a uniform, very similar to what they may wear out in the field. They walk into the space, the students actually look like service technicians. They get comfortable with the dress code. Students clock in, they clock out on their cell phones. Many employers require the technicians to have their own hand tools. So the students as part of their tuition, they actually get a tool kit that includes refrigerant gauges, meters and a sort of professional quality tools. They include in the curriculum professional skills development, really emphasizing some of the soft skills. They call it the Career Edge program. Each training module actually contains online assignments for the students, and they're required to complete them. And these cover everything from financial literacy, interview, resume, writing skills, customer service skills, how to deal with angry employees, angry customers, career success skills. They really focus on the soft skills, including monthly they have workshops where different employers will come in and work with the students. There's a lot of partnerships with employers. By far one of the big things I noticed and I've came to Lincoln is the partnership with the different employers, both at the corporate level, the Fortune 500 companies, and a lot of our local partners. A lot of our employers that actually sponsor a room, when they sponsor the room, one of the things they'll do is they'll actually go in there, they'll paint the room, they'll put their logo on it. If you walk into the room, the technicians think they may be working for a mechanic, or a mixer, or a Linux mixer, or a mixer, or a mixer, or a mixer, or a mixer, or a mixer, or a mixer. That really starts building, cultivating that engagement with them. Some of the employers are actually offering some pretty good incentives to the top students, things such as specialized training, potential job offers. One of the manufacturers that we work with is actually offering the students, top students in each class, when they graduate, they go to their manufacturing facility in Texas for six weeks. They give them an option when they finish their paying for their room, their board, their airfare, they give them a small stipend, and then they offer them a job anywhere in the country they want to work at any other locations. The thing that's really been most surprising to me since I've been there is the strong connections with some of the union contractors. Again, I mentioned from a background, previously I came from that union background, where I worked at the apprenticeship school. I was a union contractor, and back in those days, union, non-union didn't always play well together. Right now, union contractors are hiring majority of our students. There's a strong collaboration with them. The contractors are providing valuable career paths. They're bringing the students in. They have their own five-year apprenticeship program. They're bringing them a different way. Some of them will actually give them a year-for-year credit. Some of them are testing them based on life experiences. Some of them are just paying them based on whatever their life experiences are and then having them complete the apprenticeship program. But those are, by far, the jobs the students like the most are the ones that are offering a career path, such as the union contractors and the manufacturers. All these things are working well, but we need to find a way to attract the next generation of skills tradespeople, specifically generations of the millennia. I heard a podcast recently that said 10 years ago, 98% of the high schoolers wanted to go to college. And in that podcast, they said, now it's less than 50% that's really interested, but out of those, they don't, the other ones don't know what options they have and what they want to do. Currently, 70% of the trade positions that are found are found by word of mouth. I believe that better exposure to the skill trades will solve this problem. And again, somebody else had mentioned it also, this starts at the middle school and high school level. I think guidance counselors really need to provide options in the skill trades the same way they talk about college or the military. And we need to shift the narrative and make the trades more appealing as an alternative to our high school graduates of in just traditional college. And I have nothing in traditional college. I live in a fairly affluent area in North Cherokee. And I paid for three of my kids to go to college and I got a daughter that's a junior at UNC now. And they'll all graduate debt free, but it's not because they're a really good academic students because my check cleared the bank. Young people need to know that in the trades, they can make $100,000 relatively easy in less than 10 year period. And many of my peers and leadership roles in the industry have started using social media over the last couple years. I think HVAC and the trades in general were a little slow to jump on the social media ban wagon. But now a lot of them using it in different platforms to encourage people to join the trades. I got a friend of mine that recently launched a website called join the trades.com. And it's designed to connect potential trades people with local schools, unions and employers. It's almost like a career fair for the skill trades online. Lincoln Tech, surprisingly, was actually on. I didn't know it at the time. When I talked to her last night, she said they actually have several other schools that signed up on it. And what she did, she took it and it's not just HVAC, electrical, they include culinary, truck drivers, anywhere, any of the skill trades. And it's like that basically just puts them employers with the people that's looking to join the skill trades. But that's just one route. The reality is currently there's 110,000 unfilled HVAC jobs in the US. 23,000 technicians are retiring annually. For every technician in the center in the field, you got three old guys like me that's retiring. The schools are doing a good job, but we really need to help get the word out there. Continue the narrative and educate people. There are other options out there. I think Lincoln's doing our part along with many other industries, but we need to encourage them. Thank you for your comments and your update. I completely agree with what you're saying. Mark and Bob, you guys did a great job kind of cleaning up a wonderful committee meeting here today. We have any questions from our committee members? Certainly. Did you say that your average student is 30 something? Yeah, Lincoln Tech, average student is about 33 years old. So the one question I have you guys are doing an amazing program. I loved everything that you said about the work you're doing and you're preparing students for sure to get into these good jobs. You said something though that just made me think if we need 41,000 HVC HVAC techs year over year over year. And our students are 30 something on average. That means they're probably already working or earning a salary. And yet the program is four days a week, four hours a day. So I'm just wondering if there's any conversations at all about how do we get people who already have to work into programs where we know that we need them. And how do the programs actually work around a working person's schedule? So we offer both evening classes and night classes and it is challenging for them. In fact, we're able to, since I've been there in the short period I've been there, anybody that graduates has a job waiting for them. But one of the challenges is just like I said, these are working adults. There are already other 30s. They've got most of them already have families. So they may have been working in a warehouse job where for several years and they're making 19, $20 an hour. And they're not always willing to take one step backwards in order to actually get that entry level job, which they'll be obviously make a lot more money in the next few months. Other questions? Thank you very much. Before we wrap up, committee members, I want to remind you that Haley is going to be emailing out the updated recommendation report in the very near future. And when she does, this is really important that you all read through that thoroughly. Make sure that everything has been captured that you want to be in that report, specifically into the recommendations. As well as if there's any corrections. In our last meeting on November the 14th, we will take a vote to adopt those. And ultimately, the recommendations could become legislation. They could become recommendations. They could become rules. They could become budget items. Obviously, the goal is to help solve this problem of both short term and long term and making sure that we're working together as a team, because it's not going to be solved by anyone organization or government. It's going to be done by teamwork. Again, the reminder, the last meeting will be at the Georgia State Capitol in room 450 up on the fourth floor. That will be at 10 a.m. again, the lieutenant governor, Bert Jones will be speaking to us at that time. It should be a reasonably short meeting. However, I'm going to ask everyone if you want to wear your Sunday best. We're going to do a committee photo when that's done as well. So I'd appreciate your participation and attendance. Is there anything else for the good of the order before we conclude our meeting today? At least you do. Champion wherever we want because he's a celebrity. All right. If there's nothing further, this meeting is here by a adjourn. Thank you for your attendance.",
  "updated_at": "2026-02-14T02:13:16.324459+00:00"
}