{
  "video_id": "LC9rruEC9Ok",
  "url": "https://www.youtube.com/watch?v=LC9rruEC9Ok",
  "title": "Sen. Steve Gooch | 2024 Senate Majority Caucus Priorities",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 22,
  "summary": "Here is a structured markdown summary of the Georgia Senate Majority Caucus priorities session:\n\n# Georgia Senate Majority Caucus Priorities 2024\n\n## Overview\nThe Georgia Senate Majority Caucus laid out their legislative priorities for the 2024 session, focused on key issues like education, public safety, economic development, and tort reform. The caucus leaders emphasized bipartisan collaboration with the Governor and Lieutenant Governor to deliver results for Georgia families.\n\n## Key Actions\nNo specific bills were mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Senate Majority Leader Steve Gooch and Senate President Pro Tempore John Kennedy outlined the caucus priorities, including:\n  - Continuing work on foster care, adoption, and child welfare issues\n  - Prioritizing public safety measures like bail bond reform\n  - Expanding school choice and the Georgia Promise Scholarship Act\n  - Reducing the state income tax\n  - Implementing tort reform to support the business community\n  - Recruiting healthcare workers and supporting veterans/military spouses\n- The leaders praised the work of the caucus members and the collaborative relationship with the Governor and Lieutenant Governor.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo specific quorum notes were provided.\n\n## Adjournment\nThe session concluded, but no next session date was specified.",
  "transcript": "Good afternoon. It is good to be with you each and every one of y'all like to\nthank and welcome all my Senate colleagues and members here today. This is to\ntalk about the majority caucuses agenda for this upcoming legislative session.\nI think it's if it's not clear already what what some of our top priorities\nare going to be we will we will crystallize it for you here today so but\nBut obviously, one of the things that we're going to lead on this legislation session,\nsomething that we started last year, and I know we got Chair Lady Kille Kirkpatrick here\ntoday.\nAnd that is on the children and family front.\nThat's something we've taken a lot of pride in, is leading on our foster care system,\nour defect system, as well as making it access to adopting children more affordable and\nmore efficient to you the truth. So I'm proud to know that\nSenator Kirkpatrick is going to be leading on that. Public safety is a big issue.\nObviously we we led with a number of things whether it's on bail bonds issues\nor making it a repeat of tough wrong crime making it for repeat offenders\nand things of that nature. We're going to continue our work in public safety.\nWe're proud to give our state troopers the largest pay increase that\nin the history of the state and with the help of this body as well as obviously the governor's office\nand the house we were able to accomplish that and we're going to do more on that front.\nObviously school choice is still going to be a priority something that we were able to pass\nlast year out of the Senate for the first time was a school choice measure which would I think\nand power our parents and students and give them the ability to have more options for their\nchildren. We think it's a common sense approach to things and we're looking forward to when\nthe House takes that up. This legislation session, I will tell you right now, oh and no\ntort reform. We're going to take the lead on tort reform and try to get some measures\ndone for our business community and that's something that I'm proud to work with the\ngroup behind us here. Also had a very good, had a very good working relationship with\nour majority leader Steve Geuch as well as a President Pro Tem, John Kennedy. I've\ngot a long history with these two gentlemen working in the Senate myself and we can continue\nto work together, and I think have a very, very good coalition here.\nI will happy to take any questions afterwards, but I want to kick it over to the pro-tem\nof the Senate, Senator John Kennedy.\nKennedy?\nThank you.\nAll right.\nWell, good afternoon, thank you for being here, and thanks for covering what will be our\npresentation of our priorities for the majority caucus.\nI'm going to first thank the Lieutenant Governor Jones for his remarks and all of the\nstate Republican colleagues that are working to deliver real results for the people of\nGeorgia.\nI also want to thank Governor Kim for his steady hand and visionary leadership for our\nstate.\nFor those following along at home, I want to point out that the legislative priorities\nfor our caucus come from the members that you see behind me, the Republican elected\nsenators from around the state.\nThrough the interim, our caucus members have worked overtime.\nWe've been listening to folks back home.\nWe've been working with our constituents from across the state to determine what the\nvery priorities will be that you're going to hear about today.\nFrom Dalton to Savannah, from Bainbridge to Raven Gap, our priorities reflect the issues\nthat Georgians are focused on.\nOur members are committed to delivering on good, common-sense policies for Georgia families.\nIn 2023, Senate Republicans launched an ambitious agenda to tackle what matters to Georgians,\nkitchen table issues with an aim to keep Georgia on track to be the best state to live, work,\nand raise a family.\nSenate Republicans have focused this last session and will continue to focus on expanding\neconomic opportunities and innovation, cultivating an educated workforce which is so critical\nfor the continued success of our state.\nand also increasing the safety of our communities\nand ensuring the well-being of the most vulnerable\nthat live among us as our neighbors.\nFor the past two years,\nunder the leadership of Chairman Blake Tillery\nand Chairman Chuck Huffsteller,\nSenate Republicans have delivered over $2 billion\nin income tax and property rebates\nfor hard-working Georgians.\nBuilding on that success,\nwe're committed to accelerating the reduction\nof the state income tax in 2024.\nBecause unlike some politicians in Washington,\nSenate Republicans believe that the unused tax dollars\nthat make their way to the Capitol\nreally belong to the pockets of Georgians\nnot overfunded government programs.\nIn addition to Chairman Billy Hickman's undeniable passion\nto improve literacy rates for our children\nacross the state,\nSenate Republicans believe it is time to put parents\nin control of their children's education\nand pass the Georgia Promise Scholarship Act\nto expand educational opportunities for all of our students.\nWe believe that student success\nshould not be limited by the zip code\nin which the child lives,\nand students should not be trapped\nin an underperforming school.\nI wanna thank Chairman Greg Dolezal\nfor sponsoring this legislation.\nAnd I wanna thank Governor Camp and Lieutenant Governor\nJones for your commitment to getting school choice done\nthis year in the 2024 session.\nWith $24 billion in economic development in 2023 alone,\nSenate Republicans are committed to building a robust workforce\nand cutting red tape to ensure that our businesses stay open\nand Georgians are able to stay on the job.\nSpear headed by Chairman Larry Walker,\nSenate Republicans are working towards streamlining\nemployment pathways for veterans and military spouses\nand recruiting much needed medical personnel for our state\nas staff, the health care needs that we have across Georgia.\nIn addition to growing our workforce, it is past time to provide relief from frivolous\nlawsuits that clog our courts, delay justice for everyday Georgians who need access to those\ncourt houses, and stifle the business community.\nI want to thank Governor Camp and, again, Lieutenant Governor Jones for their willingness\nto support new tort reform initiatives this session.\nAlthough our economy continues to boom, there is no denying that rising crime continues\nto be on the minds of citizens every corner across this great state that we love so much.\nWe believe that safe communities are in our prosperous communities and that our law enforcement\nofficers are the real life superheroes.\nCenter Republicans will always support our men and women in uniform and those first responders\nand we will continue to crack down on games,\nviolent criminals, and hold rogue prosecutors accountable.\nThat's why we must pass bail bond reform\nto keep violent criminals and repeat offenders off the street.\nI want to thank Quip, Randy Robertson,\nand our Public Safety Committee Chairman John Albers,\nboth behind me for leading the charge\non creating a safer Georgia for all of us.\nBefore I hand it off to my good friend,\nthe majority leader, Steve Gooch, to reveal exactly what our caucus priorities are for 2024.\nI want to thank each and every member of this caucus for your tireless efforts to improve\nour state.\nIf your senator is behind me right now, I want you to know that they are focused on delivering\nresults for you at home.\nThis team, under the leadership of our Pro Tem Office and Majority Leaders Office and\nour Lieutenant Governor who has worked so hard to work with our Senate and is making great\nstrides and the efforts that we need for a better Georgia know that our brightest days\nare ahead of us.\nAnd with that, I'd like to turn it over to our majority leader for him to share more\ndetails on our caucus priorities.\nThank you.\nThank you, sir.\nThank you, Pro Tem Kennedy.\nThank you, Governor Jones.\nI stand before you representing the men and women behind me\nto discuss further the details and follow up\nfrom last year's huge success we had\nin the General Assembly and primarily in the Senate.\nBig ideas can come at an instant,\nbut big wins take preparation, study, hard work,\npersistence and time to accomplish.\nSo here we are in 2024.\nThe second year of our two-year session,\nand we're looking for a big finish.\nWe've had several momentous efforts\nthat in one form or another began a year ago,\nand Senate Republicans are determined to finish the drill.\nBefore we get down to the unfinished business,\nI want to highlight a few senators\nthat helped us get off to a great start last year.\nFirst, Senator Billy Hickman began a comprehensive\nSenate led effort to improve literacy in our state.\nOur aspirational goal of bringing our literacy rates\nin line with rising graduation rates\nare becoming a reality.\nThis kind of ambitious undertaking doesn't happen overnight\nand requires a multifaceted approach.\nSo Senator Hickman has a few more tools\nhe wants to add to the toolbox,\nincluding expanding access to pre-K.\nAs these new ideas take shape over the coming weeks, Senator Hickman has our\nunwavering support. Thank you for your leadership, Senator Hickman.\nSimilarly, Senator Kate Kirkpatrick has spearheaded the Senate's efforts to\nstrengthen our foster care system. As chair of the newly formed children and\nfamilies committee and with the full backing of Lieutenant Governor Jones,\nSenator Kirkpatrick ushered several bills to improve conditions for foster\nchair foster children and parents last year. Senator Kirkpatrick hosted a study\ncommittee over the summer looking to build on our initial success that will\nproduce several new initiatives this session including increasing\npermanency within the foster care program and retaining case workers at\ndefects. Thank you Senator Kirkpatrick and thank you Lieutenant Governor Jones\nloans for all that you do for our state's most vulnerable children.\nAdditionally, last year was marked by a monumental tax relief effort, a billion dollars for state\nincome taxpayers, a billion more dollars for property owners, multiple suspensions of the\ngas tax throughout the year while hardworking Georgians were filling the crush of\nof Biden inflation, all at the time when Washington, D.C. was racking up massive debts, high\ngas prices, and unaffordable mortgage rates. We did not get into the strong fiscal position\nto deliver historic tax relief without strong leadership, leadership from Governor\nKim, leadership from Governor Jones, and leadership from our speaker, John Burns. And within\nIn our caucus, steady strong leadership from Senate Finance Chair Chuck Huffstettler and\nSenate Appropriations Chair Blake Tillery were there the whole step of the way.\nThis year we will be accelerating the largest income tax cut in our state's history.\nBut our caucus wants to do more, even more, for the taxpayers, specifically homeowners.\nAnd Hustettler Senate Bill 349 will provide a floating homestead exemption statewide to exempt\nproperty tax increases over 3%.\nWith homeowners being squeezed by increasing assessments and high interest rates, Senate\nBill 394 is a Republican-led priority.\nTax policy is one of the main drivers of our state's overall economic prosperity.\nLower taxes are welcomed by residents and by businesses like.\nAnother important contributor to our overall economic environment is our litigation climate.\nThe Senate has tested the waters on civil justice reform in recent years.\nNumerous senators that stand behind me, such as Senators Kennedy, Senators Calzert,\nSean Still, Jason Antivatarte, myself and many others have spent the last four years\ntraveling this state, gathering data and facts on the needs for civil justice reforms in\nour state.\nNow with the Lieutenant Governor's help, we will pass legislation limiting direct action\nlawsuits in Georgia.\nThis legislation will lead to more access for personal and commercial insurance coverage\nfor all of Georgia's.\nIn addition to his important budget duties, Chairman Tillery, you heard me, Chairman Blake\nTillery is going to help us get a meaningful tort reform bill across the finish line in\nthis year's session.\nSenator Greg Dolezal has also been working on a premises liability bill, which I believe\nshould receive strong consideration by the Senate this session.\nBut I know Senator Dolezal is going to be busy finishing the drill on another piece of\nimportant legislation called the Education Bill, primarily dealing with parental choice.\nSenator Dolezal, Senate Bill 233, the Georgia Promise Scholarship Act, will provide school\nchoice for students trapped in underperforming public schools. This bill is a thoughtful\npiece of compromise that came through our Senate last year. It received unanimous support\nfrom our caucus before stalling in the House late in last year's session. We believe\nthat the House has come to grips with this piece of legislation and they will be moving\nit forward in the coming days and weeks ahead. Senator Dolezal will not stop. Governor\nwill not stop, our caucus will not stop until we deliver a historic opportunity for a better education for students by giving engaged parents school choice.\nToday, we have talked about better education opportunities for the citizens of this state.\nThat's because Georgia has an abundance of economic opportunity for those who are prepared to seize on it.\nOpportunity is also the reason why we had three separate study committees looking at ways\nto improve our workforce readiness.\nSenator John Albers sent Senate study committee on expanding Georgia's workforce.\nSenator Bo Hatches, study committee on rural health care personnel recruitment and Senator\nLarry Walker's study committee on occupational licensing are three examples of the work\nthat we have done preparing for this year's session.\nWhile several of the key recommendations from the committees will result in legislation\nthis session, one stood out as a top priority for our caucus this year.\nWith Senator Walker's help, we will develop a military medics and corpsman's program\nsimilar to the Virginia model, where we can offer career and credentialing pathways for\nveterans and military spouses seeking employment and Georgia's health care system.\nThis effort supports veterans, it expands our health care workforce, and contains elements\nin line with Lieutenant Governor Jones' red tape rollback that he announced previously.\nThis initiative with many other senators behind us are going to implement these priorities\nas we go forward in the coming weeks.\nFinally, I would be remiss if I did not mention one of the most overlooked components to\neconomic development, and that is safe communities.\nby Senator John Albers, our Public Safety Chairman, and our majority whip, Randy Robertson.\nSenate Republicans had an impactful year for Public Safety in 2023, cracking down on\ngangs, repeat offenders, and violent felons in our state.\nThat said, we have one legislative priority remaining from last year.\nThat's Senator Robertson, Senate Bill 63, also known as the bail bond reform legislation\nto eliminate no cash bail for violent offenders\nin our state.\nWill Robertson got it all the way\nto a conference committee in last year's session.\nAnd I know he is ready to go to work\nand he's ready to finish the drill\nand to bring that conference committee report\nto the floor of the Senate in the house.\nIn doing so, we will close the revolving door\nthat lets violent criminals back out on our streets\nway too easily in Georgia.\nIn summary, the Senate will be laser focused on big ideas,\nboosting literacy, improving foster care,\nexpanding our workforce, and big wins,\nmassive tax relief, school choice, and safer streets\nin our state.\nEvery one of these accomplishments in their own right\nare generational opportunities to make life better\nfor the people we serve.\nBig ideas, big wins, and a big finish to this 2023-2024\nconvening of the Georgia General Assembly.\nThese are very important issues Senate Republicans\nwill deliver for everyday Georgians in 2024's session.\nAnd that's why Senate Republicans are committed\nto finishing the drill.\nThank you for attending today's press conference.\nI'm happy to take a few questions at this time.\non the floor, you know, if, uh, once they're presented, uh, brought to us by, uh, members,\nBut if there's one thing I heard from the business community as well, I know these senators\ncan speak to this.\nOne thing we heard from the business community more than anything else was the climate\nin which we're in right now, as far as the tort climate that we're in right now and\nthe need they need to see something subsequently from the general assembly.\nI think what the governor's doing is great in gathering a lot of information and leading\non that from gathering it from the business, from the insurance companies and things of\nthat nature.\nBut there's some things out there that we already know that could be done that we presented\nin years past and we just didn't have the horsepower to get it done.\nYes, ma'am?\nWe made the move as a Senate body last year to say that we want access to health care\nto be a priority and that was the whole reason why we wanted to reform CON.\nThat's something that we have led on.\nWe passed it out of the Senate last year.\nIt is in the hands of the House right now.\nI've heard rumors, nothing concrete.\nI've heard rumors that the house is going to come with a proposal of some sort, so we're\nopen to see what that proposal is, but our stance has been in order to improve access\nto health care, you're going to have to reform this certificate of need and that's what we're\ndoing.\nNow, let me let me let me clarify that our what we said is we wanted to have a grant program that would enable locals to determine how to\nbeef up the security and safety of their of their school respected school districts and that's what exactly what we have we have a grant\nprogram. Also the governor now is also put in a hundred million dollars to go\ntowards school safety, but our whole initiative is about improving school safety\nand allowing the locals to determine the best use for that money when they apply\nfor that grant. But thank you though. Well y'all easy crowd. Thank y'all for\nWe're having us here today, and one last question.\nI think mental health is obviously going to be\na part of the conversation, this legislative session,\nand parts of 520, or of things that our committee,\nour chairman, Watson, brought, discussed last year\nlast year and their parts of it that that we really like on the\nSenate side. There's other parts that we thought needed a little work and we're\ngoing to continue to work on those things and and and we also wanted to get a\ngood feel as far as the price tag that went with the mental health from last\nyear. Also get some feedback on just two years ago we put in I think 60\nmillion dollars to that agency for mental health since well and see what kind\nof benefits we've gotten from that. So like I said it is a two-year process and\nAnd we're going to take the two years that we have here and vet that mental health bill,\nbut it's definitely a priority for us to do something on mental health.\nSo thank you all very much.\nAppreciate it.\n",
  "updated_at": "2026-02-12T19:36:34.202389+00:00"
}