{
  "video_id": "lJkwj4ScqJk",
  "url": "https://www.youtube.com/watch?v=lJkwj4ScqJk",
  "title": "4/3/2025 | Democratic Caucus Press Conference on HB127",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Here is a summary of the key points from the Georgia legislative session transcript on the Democratic Caucus press conference regarding HB 127:\n\n**Overview**:\nThe Democratic caucus strongly opposed HB 127, describing it as a bill that would take Georgia \"backwards\" on issues of race, discrimination, and civil rights. They accused the Republican Party of being \"afraid\" to condemn slavery and the Confederacy.\n\n**Key Actions**:\n- **HB 127**: A bill that was originally about providing extra sick days for teachers, but was amended by Republicans to include \"DEI\" (diversity, equity, and inclusion) provisions that the Democrats opposed.\n\n**Bills Introduced (First Reading)**:\nNone mentioned.\n\n**Notable Moments**:\n- Democrats accused Republicans of trying to \"hide\" and \"sneak through\" the bill by bringing it up late at night.\n- Democrats said they were prepared to fight for \"5-6 hours\" to either defeat the bill or amend it, but were denied that opportunity.\n- Democrats criticized Republicans for not allowing amendments that would have affirmed that slavery was a cause of the Civil War and that evolution should be discussed.\n\n**Votes**:\nNo specific votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nNo adjournment time or next session date mentioned.",
  "transcript": "So up until last week this bill HB 127 was actually a bill to give teachers a\ncouple of extra days sick time it was one that was bipartisan everybody could\nsupport it but the Republicans decided that they wanted to take that away from\nteachers and put on this DEI bill supposedly was this called a DEI bill which\nhas really taken us back to prior days of discrimination so let's kind of\nget into the weeds for a second one of the things that we talked about was our\nwere not germane. They were very germane and they also had not created a substitute.\nOf all the amendments we had, all we did was try to add to this bill and actually make\nit something that all Georgians could actually kind of work through. But they didn't want\nto do that. Now the real deal to all of this, this bill takes us back. This is a sad day\nfor the Georgia State Senate. One of the saddest I've ever been in 10 years, quite frankly.\nWe heard one of my colleagues, Senator Lucas, talk about the fact what he grew up with,\nwhat he's dealt with, Senator Magnum, others, Nann Orrah, others have fought the civil rights\nmovement and here we are again fighting the same movement again and it's really a\ntravesty that we'll be here doing these particular fights and I also believe\nand I firmly believe this and one of the things I said in the well is they were\nafraid of those amendments that actually talked about slavery and actually talked\nabout the Confederate States of America because they could not vote on those\nparticular amendments. One basically saying that slavery was a cause of the\nCivil War, they were afraid to vote on that. So I want you to talk about people\nhaving fear. The Republican Party today was afraid to say that slavery actually\ninstrumental to the civil war. They were afraid today to say the Confederate States of America\nactually was a rebellion set of states. They were afraid of that. That's what they were afraid of\ntoday. So mark that in your notes. That is the key. That is your takeaway from this. The Republican\nParty of Georgia was afraid to actually condemn slavery. The Republican Party of Georgia was afraid\nto actually condemn the Confederate States of America. And that's why they made that motion. And\nthat's why the lieutenant governor said we don't want to do this anymore. But that's exactly what\nwhat was going on. I also want you to make note of this. This caucus was prepared to fight for\nnext five, six hours, whatever it was going to take to either defeat this bill or make it better.\nWe were going to make sure that that took place. We were not going to be afraid of that fight.\nWe were ready. And yet that was taken from us. So I wanted the people of Georgia to know\nthat tonight was the night that your Democratic caucus stood up for all people of Georgia.\nBecause this doesn't represent the people of Georgia. But tonight was the night the Republican\nparty said they're going to take Georgia backwards. Backwards today is when people did not have\nhave four rights. And that's exactly what it was. It cannot be any clearer than that.\nOne particular part of Democratic Party said we want to move forward as far as race relations\nconcerned. As far as gender relations are concerned, another party said we're going to\ngo backwards. And this state is going to refuse to do that. And we're going to continue to fight.\nAnd this fight will continue over the next months into next year or two without taking\nquestions. You know I'll go ahead. I was going to say what you can\nattach on to what are your thoughts about them? Well first one was when\nthey actually do the motion to resolve debate to begin with. So that's\nalready tells you right there. They did not want to actually debate this\nparticular bill. This is a bill basically about human rights that they basically\nsaid look after a couple of speakers we want to resolve the debate. That is\na travesty. That in itself is a travesty. This is a bill that talks about\nsupposedly reverse discrimination taken away basic human rights from people and\nafter two speakers they were willing to say we don't want to hear anymore. Also\nas a travesty the fact let go of time this bill even came up. This will be one of\nthe first bills that we tried to tackle so we could have a true honest hearing\nabout this particular bill. They didn't want to do that. They wanted to do it in\nthe dead of night. Hopefully try to sneak it through and but we were ready and\nwe're gonna make sure we fought against it. So number one it came up at a time\nthey were trying to hide this particular bill. They aren't proud of this\nparticular bill but they voted for and they're stuck with it and we're going to hang the next\nwith it. The fact that they're not ever going to forget what they did to Georgia tonight.\nThey never hurt this bill, never had one person speak and testify at the committee in favor of this bill.\nThat's exactly right. They were shut down and shut down and continue tonight. And\nthis is not how purple it. When you read this bill, when you heard with the Senate from 23rd\nor talked about people are not qualified.\nHow dare anybody say that?\nAs I said it in the well,\nyou're talking about over 450 years\nfor the first African-American law student\nwas allowed into law school.\nFirst African-American was allowed into medical school.\n450 years, and somebody dares talk about qualification\nin that situation when we've been locked out\nof actually any opportunities that existed\nwithin this state, within this nation,\nand to stand up there and say that people may not be qualified\nbe where they are today is just sickening quite frankly and we're not we\nweren't going to tolerate it we're going to continue to fight it and as I said\nthis is what this party will be not the Republican party to be known from\nto this point forward as party that wanted to take us backwards it was basically\nwas trying to say that we were trying to create a committee substitute and to\ndo that you really trying to change the whole bill really we were just trying\nto add a couple of things to the bill one of the things that we were talking\nabout was that DEI would not mean that you cannot say that slavery was caused by slavery.\nWhy would you not want to add that to that particular bill so you can say that when you're\nteaching DEI, one of the things that would not be excluded because they're trying to\nexclude a lot of things is the concept, the slavery actually was a contributing factor\nto the Civil War.\nAnother thing would be, hey, you got to talk about evolution.\nThey didn't want to talk about that.\nSo those are the things that we were actually talking about.\nWe were not necessarily trying to substitute this bill, made no mistake.\nWe were trying to add to it to make sure we clarified what could and could not be taught\nwithin our classrooms so we can continue to have robust and open classrooms.\nThat was the key.\nThey don't want to do that.\nThey don't want to continue to have open and robust classrooms.\nAs I said, they want to continue to pull us backwards and we're just not going to stand\nfor that anymore.\nThank you.\nThey were also sort of Democrats in the House to walk out during a vote over medical treatments\nfor prisoners in the state of the prison system.\nI'm wondering if you could talk a little bit about some of the limitations that Democrats\nhave in pushing back on some of these bills, the strategies that you're trying to avoid\nhere at the end of session to do that when you don't have a lot of tools at your disposal\nand any lessons you learned from these new strategies.\nBut one of the things, one of the things we,\nthe lesson we always have known,\nour tools are right here, these 23 folks.\nThat's our tool.\nOur tool is to make sure we push the envelope\nand make sure we stand up for the people of Georgia.\nSo we've always had that tool.\nThere may be certain strategies here and there,\nbut these amendments were not necessarily a strategy.\nI believe in these amendments.\nI believe we want them to make sure\nwhat could not be taught.\nAnd so that's why you didn't see a walk out.\nYou saw us ready to fight.\nAnd that's exactly ready to do it.\nWe were going to do that tonight,\nbut the Republicans didn't want to do that.\nThat was the key.\nWe're going to mitigate what you are going to do.\nOh, there's no doubt it's going to court.\nAnd most of it, most likely, will be declared unconstitutional.\nWe're absolutely going to be struck down.\nMany DEI programs have already been,\nmany of these laws have already been struck down.\nMany of these DEI laws that come about,\nthey've been struck down.\nSo there certainly will be court procedures\nthat will take place once again, waste and taxpayer dollars\nbecause they realize that a lot of these parts\nare going to be declared unconstitutional.\nSo just waste and taxpayer dollars.\nBut 100%, we will be fighting this in court\nand we will be threatening to win, too.\nand elections are coming up.\nAnd elections are coming up, that's right.\nYou'll see the results of this.\nMeasures that they took tonight\nare gonna be showing up and people turn out to vote.\nSenator Harbyson, what was the last time you would say\nyou saw 20 and then it's presented on a bill?\nSenator Harbyson.\nI can't remember, but it probably has happened,\nbut it's beyond my memory right now.\nThat's over three decades.\nThat's just on candy and the life of the fact\nthe passion behind this effort.\nThe very fact that we were fighting for a legacy\nof civil rights that we inherited from the 1960s\nand beyond, and this was sort of squashed\nin the face of the disembowel of those members.\nAnd of course, we've never seen a bill\nlike this probably for like 20 years or so,\nquite frankly, a bill that actually tries to restrict\nthe rights of African-Americans, women, also LGBTQ.\nWe haven't seen a bill this comprehensive\nthat basically says you're not included in Georgia.\nSo this is a different type of bill also.\nSo it has to have different type of consequences too.\nAnd a complete violation of academic freedom.\nAnd freedom of speech.\nIf Trump wasn't elected, this big aluminum\nis discussing tonight.\nWe'll be talking about it.\nAnd that's the reason we're talking here tonight.\nAt the committee meeting, there were at least 15 people\nwho signed up to speak on this bill,\nand they would not allow them to.\nthey closed everything like they did tonight with us.\nThey had no way of saying anything.\nI asked for, what is this gonna cost us?\nThey told me I shouldn't ask,\nit's no fiscal, no required.\nHowever, it's gonna cost a lot of money,\nso where's the money coming from?\nThat's exactly right.\nSo what you see here is a unified caucus\nagainst this particular bill.\nWe've been a unified all session.\nWe continue to do that after session two.\nSo I would say it's two people in Georgia.\nThe fight will continue.\nIt's going to be in the courthouse.\nThe fight now goes to the courthouse.\nBut the fight, that's right.\nBut the fight will also continue.\nAnd the fight also will continue at the ballot box, too.\nThat's going to be the next key.\nAbsolutely.\nYou need to take the fight together.\nThere you go.\nThank you guys so much.\nAppreciate it.\n",
  "updated_at": "2026-02-12T18:51:53.15449+00:00"
}