{
  "video_id": "lPb_287VHrA",
  "url": "https://youtu.be/lPb_287VHrA?t=1254",
  "title": "Georgia House - Day 16 (2026-02-09)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": "2026-02-09",
  "duration_minutes": 112,
  "summary": "Here is a structured summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThe session featured a prayer by a Korean-American pastor, discussions of missionary work in Korea, and references to notable historical figures. The session appears to have focused on substantive legislative business, though specific bills were not mentioned in detail.\n\n**Key Actions**\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Prayer delivered by Pastor Jung Hoon Sun of the Korean Community Presbyterian Church, who discussed the importance of political leaders keeping their promises and seeking God's wisdom.\n- Pastor Sun highlighted the missionary work of William A. Linton and Horace Grant Underwood in Korea, as well as the sacrifices of U.S. soldiers in the Korean War.\n- Pastor Sun encouraged the legislators to have the courage to lead their constituents in the right direction, even if it differs from public opinion, drawing parallels to figures like Moses and King David.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nNo specific quorum notes were provided.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session would be.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Mr. Clerk, will you please ring the bell. We're going to have the morning roll call vote. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted. Have all members voted. Yes, so the clerk will lock the machines. Doorkeepers, will you please close the doors and keep them closed. We will begin the day as is our custom with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 103rd House District representing Suhong. Thank you, Mr. Speaker and good morning, colleagues. I am delighted to introduce pastor Jung Hoon's son from the Korean community Presbyterian Church or KCPC in Gwinnit County. Many Korean immigrants like my family did find a sense of home community and resources at our churches when we first moved to America. KCPC is one of the oldest and the largest Korean American churches here in Georgia. They have over 2,000 members and they focus a lot on missionary work all over the world as well as a lot of the prison systems here in Georgia. Before pastor Sun started at KCPC in 2019, he started his own ministry in Seoul and grew it in San Diego as well as Hong Kong. His wife Rachel Ann is here if you can stand up. She is a professor at the Denver Theological Seminary as well and they have two sons who attend B for schools which is in the great district of 103. I'm excited to have pastor Sun as our chaplain this morning and I'm excited to hear from him. Pastor Sun. Good morning everyone. Thank you, Mr. Speaker, representative Su Hong, met Reeves and all the chamber members for inviting me to this special occasion. I'm so honored. I'm so honored to be here. As I was preparing my sermon, I asked AI, Artificial Intelligence Service. What do politicians and pastors have in common? The AI service replied, well, they always promise a better future and never deliver. What? At first I thought that was not fair, but I began to think about it more seriously. Am I a really a promise keeper as a pastor? How about yourself? Are you faithful? Are you faithful to the promise you made to God and people who sent you to this chamber? If you are having difficulty delivering the promise you have made, let me introduce you to the words of advice from the Bible. For Samuel 268 says, the Lord brings death and makes a life. The Lord sends poverty and wealth. He humbles and he exalts. He raises the poor from the dust and lifts the needy from the ash hip and prowls to six sevens as. But the Lord gives wisdom from his mouth comes knowledge and understanding. He holds success in store for the upright. He is shield to those whose walk is blameness. Bible clearly says that he is the provider and protector of his people. He is the source of every good thing we need, such as wisdom, courage, and wealth. He is also the shield of everything we cherish. Therefore, no matter how hard the issues we confront, we should never settle for a mediaco solution. Instead, we must pray hard, think hard, research hard, or even debate hard until we come up with this best solution for the wishes we need to tackle for the great state of Georgia. I know a wonderful man of God who was not satisfied with this mediaco solution and used God given inside to transform countless Korean lives. His missionary William A. Linton from Thomasville, Georgia. He graduated from Georgia Tech with top honors and left general metrics where his future was secure. He boarded a ship to an unknown country of Joseon, Joseon, presently Korea, to serve as a missionary. Representative Dallin Taylor, she is from Thomasville. Where are you by the way? Thank you for sending that great man to Korea 111 years ago. Let's see the picture of the family. Once he landed at Kunsan, a small town in South Korea in 1912, he taught Bible and English and he established many schools including Gurswony School and started modern education. But during the Japanese colonial period, he refused to bow down before Japanese got the Shinto shrine so he was expelled from the country by the Imperial Army. However, he returned to Korea after the liberation and founded this Hannam University that you are seeing right now, the picture, and when the Korean War was ended. In fact, one of our associate pastor Greggit from that university, Samoksan, would you wave your hand? It's one of the graduate of that Hannam University. Not only that, Linton's family is Third Sun, Hugh Linton, and his son Steve and John became missionaries too that helped to build colossus victims in Korea. Also, the fourth generation of the Linton family is still helping North Korean hospital and patients. Missionary Horace Grant Underwood and his descendants were another faceful man of God and we create deeply owe to him. Would you show a picture of this Horace missionary? Horace Grant Underwood, especially my wife here and I are the direct beneficiary of his ministry because we got the best Christian education from the university called Yonsei and which was founded by this missionary when he was 26 years old and in 1985. He and his four generations of children continued missionary\n\nin Korea, building schools, hospitals, and churches, publishing Korean English dictionaries, and contributing significantly to the country's democratization. As we talk about the great man of God, we cannot pass by without mentioning the 50,000 U.S. officers and soldiers who lay down their lives during the Korean War. Without their dedication, South Korea would not have been able to attain the freedom and democracy that we enjoy these days. That's why we, our church ministers, to the Korean War veterans like this. There are now only 30, 30 Georgian veterans left, all of whom are well over 90 years. So we really appreciate their effort. Those are the people who have the wisdom and courage to live out the promises they made. They have made to God and the country to the people. I can't say that I fully understand the difficulties you face daily to accomplish the mission given to you. But I know for sure that what you are experiencing is not the first time in history, because history appeared itself. Most experienced racial, gender, and moral issues when he lay head to lead two million refugees out of Egypt to the promised land. King David also had to persuade those who had won great booties in a battlefield. So they fought this fight and collected these booties. And then these soldiers didn't want to share it with the other soldiers who were defending their families and their properties. A good leader, I believe, does not always follow the people to where they want to go. But instead, they tell and guide people where they must go. You not only represent the voters of your district, but I believe you are also supposed to lead them in the right direction. If Moses had followed the people's wishes, he would have returned to Egypt, because they complained. That way, we were better off when we were in Egypt in slave. But Moses didn't listen to them, because he had a clear vision of the promised land. If King David had followed the opinion of the soldiers who fought on the battlefield and wanted to keep all the booties themselves, the nation would be divided. But David did not. He said, no way, we're going to share all the booties with the people who are left behind. But still doing their job. That way, David were able to unite the kingdom together. To be a good leader, we need a godly wisdom to discern the truth and the courage to practice that truth. Dear fellow leaders in the chamber, if you seek wisdom from God, our provider, our protector, I firmly believe that he will surely give it to you. May God bless you and all the Georgians abundantly. Let us pray. Heavenly Father, we pray that you may grant wisdom and courage to these representatives who serve on behalf of the state of Georgia. Please give them the wisdom to discern the truth in this chaotic age, and the courage to practice what they promised before God and people. Help them all to be promised keepers. Also, I pray that you may help them. Device the best policy for all God's children. That's just for us. That's just for our generation or our region and our country. Help us to remember God's word, that says, when Colonel of Wheat falls to the ground and dies, he produces many seed. Help us all to lead. Our state by serving them diligently, we are Georgia, become one state under God, and the safest and strongest and most prosperous state in all of America. So we can be a great channel of blessing for others. We pray all these things in the precious name of our Jesus Christ, the Savior of the Lord, Amen, and amen. The door keepers will unlock the doors. Members, you may greet the chaplain in the south any room and we do appreciate that message here this morning at devotion. Very important. Thank you. You Chair recognizes chairman tarvin the chair of the committee on information and audits. Mr. Speaker your committee on information and audits has read the legislative journal from the previous day and found it to be correct. And on another note on this long weekend if opportunity does not knock build yourself your own door. We can probably work with that. We can probably work with that. Chairman tarvin the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal the chair here's none the reading of the journal is dispensed with. Is there any objection to the confirmation of the journal chair here's none and the journal is confirmed. Mr. Clerk would you read the resolution establishing the order of business for the day. Is there any objection to the adoption or the resolution establishing the order of business. Is there any objection to the adoption or the resolution establishing the order of business. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair his none and the resolution is adopted. First reading of bills and resolutions the clerk will read. House Bill 288 by Mr. Parrish, 158th, Bill Mintado, to create the East Georgia Regional Airport Authority. Intergovernmental coordination. House Bill 289 by Mr. DeBruce, 61st, Beverly, 143rd, McLean, 109th, Marendra, 96, Bayesmore, 69th and others. Bill B. Toddl, act of men, Chapter 5, 5, 5, 50, the fiscal to Georgia, annotated, related to Department of Administrative Services. Governmental affairs. House Bill 298 by Mr. Skoggins, 14th, Smith, 18th, Gamble, 15th, 3rd, U.S. of the 99th, Seapall of 34th and others. Bill B. Toddl, act of men, Article 6, Chapter 5, 5, 5, 5, 40, 80th, fiscal to Georgia, annotated, relating to Municipal Taxation. Ways and Means. House Bill 291 by Mr. Skoggins, 14th, Smith, 18th, Oliver, 80, second, Bill B. Toddl, act of men, Title 29, and fiscal to Georgia, annotated, relating to Guardian and Ward. Juvenile Justice. House Bill 292 by Mr. Rees, 99th, still conks, the 53rd. Hilton, the 48th, Kelly, the 16th, Stoner, the 40th. Bill B. Toddl, act of men, Part 7, of Article 5, Chapter 3, a Title 44 of the fiscal to Georgia, annotated, relating to Missalini's provisions regarding time share projects and programs. Judiciary. House Bill 293 by Mr. Berder, the 20th, Donald Houth, 31st, Park, 100th, Bonner, the 73rd, Horner, the 3rd and others. Bill B. Toddl, act of men, Article 4, Chapter 11, Title 16, in the fiscal to Georgia, annotated, relating to dangerous instrumentalities and practices. Judiciary. None. Civil. House Bill 294 by Mr. Lodge, the 167th, Lumps, into the 12th, Williams, 1148th, and Taylor, the 173rd. Bill B. Toddl, act of men, Article 3, Chapter 37, a Title 33, the Fischer, go to Georgia, annotated, relating to procedure for rehabilitation. Insurance. House Bill 295 by Mr. Hawkins, the 27th, Bennett, the 94th, Newton, the 27th, Cooper, the 45th, Jones, the 47th, and others. Bill B. Toddl, an act of men, Title 33, the Fischer, go to Georgia, annotated, relating to insurance. Insurance. House Bill 296 by Ropes of Nielus 79th, Vance the 133rd, Gilier, the 162nd, Holcomb, and the 81st, Hitchens, the 161st, and others. Bill B. Toddl, an act of men, Code Section 35, 8, 7, the Fischer, go to Georgia, annotated, relating to powers and duties in the Georgia Peace Officer, Standards and Training Council. Public Safety and Homeland Security. House Bill 297 by Ropes of Nielus 79th, Bill B. Toddl, an act to amend some part two of our part six, Particle 6th, Chapter Two, the Title 20, the Fischer, go to Georgia, annotated, relating to conditions of employment professionals and elementary and secondary education. Education. House Bill 298 by Ropes of Daniel, the 117th, Hilton, the 48th, Gunnar, the 8th, Oliver, the 82nd, Silcox, the 53rd, and others. Bill B. Toddl, an act to amend, article 1 on Chapter 12, the Title 15, and the Fischer, go to Georgia, annotated, relating to the title provisions regarding juries. Judiciary. House Bill 299 by Ropes of Nielus, the 21st, Bonner, the 73rd, Clark, the 100th, Ballard, the 147th, Tarvern, the 2nd, and others. Bill B. Toddl, an act to amend, Code Section 15, 9, 2.1, Title 16, Title 19, Title 20, and Chapter 2, the Title 38, Chapter 2, and Title 40, the Fischer, go to Georgia, annotated, relating to appointment compensation and the thaw. Defense and veteran affairs. House Bill 300 by Ropes of Nielus Smith, the 138th, Kelly, the 16th, Williamson, the 112th, Stevens, the 164th, Blackwood, the 146th. Bill B. Toddl, an act to amend, part 4 of article 1 on Chapter 3, Title 46, the Fischer, go to Georgia, annotated, relating to the solar, power-free market finance. Energy utilities and telecommunications. House Bill 301 by Ropes of Nielus Smith, the 6th, Smith of the 18th, Collins, the 71st, Rose of the 124th, Burtchett, and the 176th, and others. Bill B. Toddl, an act to amend, Title 40, the Fischer, go to Georgia, annotated, relating to motor vehicles and traffic. Motor vehicles. House Bill 302 by Ropes of Nielus, Franklin, 160th, Smith, the 18th, Hitchinson, the 61st, Miller, the 62nd, Silcox, the 53rd. Bill B. Toddl, an act to amend, Code Section 16, 5, 94, the Fischer, go to Georgia, annotated, related to restraining orders and protective orders. Judiciary non-civil. House Bill 303 by Rose, and Davis, the 87th, Beverly, 143rd, scouting 76, go field, the 63rd, 10th, 90s, second, and others. Bill B. Toddl, an act to amend, Chapter 3, Title 44, the Fischer, go to Georgia, annotated, relating to regulation, of specialized land transactions. Governmental affairs. House Bill 304 by Rose, Nielus 79th, Bill B. Toddl, an act to amend, Title 44, the Fischer, go to Georgia, annotated, relating to property. Judiciary. House Bill 305 by Rose, I'm Dickey, the 145th, Hitchinson, the 170th, Gillier, the 160th, Carpenter, the 4th. Bill B. Toddl, an act to amend, Title 2, the Fischer, go to Georgia, annotated, relating to agriculture. Agriculture and consumer affairs. House Bill 306 by Rose, Flaming 114th, Rhodes, the 124th, Townsend, 179th, McCollum, the 30th, Martin, the 5th, and others. Bill B. Toddl, an act to amend, Code 6, and 22, 506, the Fischer, go to Georgia, annotated, relating to definitions of authority to enter in multi-year leases. Governmental affairs. House Bill 307 by Rose, and Apollo 33rd, Parsons, the 44th, Gullet of the 19th, Dickey, the 145th, and Martin of the 49th, and others. Bill B. Toddl, an act to amend, Title 46, the Fischer, go to Georgia, annotated, relating to public utilities, and public transportation. Technology and infrastructure, innovation. House Bill 308 by Rose, and the 127th, Dutnik, and the 29th, Hawkins, the 27th, Cooper, the 45th, Parish, the 158th, and others. Bill B. Toddl, an act to amend, Chapter 7, and Title 48, the Fischer, go to Georgia, annotated, relating to income taxes. Ways and means. House Bill 309 by Rose, and the Cooper, the 45th, Lumbing 114th, M.C., the 13th, and LaHood, the 175th. Bill B. Toddl, an act to amend, Martin of the 177th, Title 31, the Fischer, go to Georgia, annotated, relating regulation of hospitals and related institutions. Human relations and aging. House Bill 310 by Rose, and the Wilkerson, the 38th, Evans, the 57th, and we're now the 77th, Carpenter, the 4th, Green, the 154th. Bill B. Toddl, an act to amend, Title 20th, the Fischer, go to Georgia, annotated, relating to education. Higher education. House Bill 311 by Rose, and Smith, the 70th, Stevens, the 164th, Knight, the 134th, Green, the 154th, Black, Winal 146th, and others. Bill B. Toddl, an act to amend, Article 1 of Chapter 5, and Title 40, 80th, Fischer, go to Georgia, annotated, relating to general provisions regarding, adding the alarm taxation to property. Ways and means. House Bill 312 by Rose, and the Hugley, the 141st, and Buckner, 137th. Bill B. Toddl, an act to amend, Chapter 10, and Title 25, the Fischer, go to Georgia, annotated, relating regulation of fireworks. Public safety and homeland security. House Bill 313 by Rose, and the Stevens, the 164th, Smith, the 38th, Hugley, the 141st, Higley, the 145th, and Jackson, the 165th, and others. Bill B. Toddl, an act to amend, Chapter 4, Title 20, the Fischer, go to Georgia, annotated, relating to vocation of technical and adult education. Higher education. House Bill 314 by Rose, and the Stevens, the 164th. House Bill 770, the 13th, green, and the 154th. Hugley, the 78th, Bill B. Toddl, an act to amend, and Title 12, with the Fischer, Georgia, annotated, relating to conservation and natural resources. Game, Fish, and Parks. House Bill 315 by Rose, and the Taylor, 173rd, Cooper, the 45th. So the Cox, the 53rd, Matthew, the 74th, Ben, and the 94th, and others. Bill B. Toddl, an act to amend, Chapter 24, Title 33, the Fischer, go to Georgia, annotated, relating the insurance, generally. Insurance. House Bill 316, by Rose, and the 157th. Stevens, on 64th, Williams, on 68th, green, and the 154th, and Wilkinson, the 38th. Bill B. Toddl, an act to amend, Part 7, on the Garl 7, and the Chapter 3, and the Title 20, that Fischer, go to Georgia, and the 10th, relating to hopes, scholarships, and grants. Higher education. House Bill 317, by Rose, and the Taylor, 173rd, Matheson, the 49th, College of 71st, Sebald, 34th, and Mathy Ack, the 74th. Bill B. Toddl, an act to amend, Chapter 19, and the Title 47th, and the Fischer, go to Georgia, and Tate, relating the state, and employees, assurance, department. Insurance. House Bill 318, by Rose, and the Pilton, the 48th, Jones, the 47th, Duke, and Nick, the 29th. Thomas, the 21st, remainder, and the 56th, and others. Bill B. Toddl, an act to amend, Chapter 2, and Title 20, the Fischer, go to Georgia, and Tate, relating the elements, reading secondary education. Education. House Bill 319, by Rose, and Martin, 49th, Bill B. Toddl, an act to amend, art in 7, Chapter 3, Title 20, and the Fischer, go to Georgia, and Tate, relating the scholarships, loans, and grants. Higher education. House Bill 320, by Rose, Scott of the 76th, Davis, the 87th, Scofield, the 63rd, and Hutchinson, the 106th, Bill B. Toddl, an act to amend, part three of Article 16, and Chapter 2, and Tate, the Fischer, go to Georgia, and Tate, relating the health of students, generally. Education. House Bill 321, by Rose, and Oof, Scott of the 76, David, the 87th, Bill B. Toddl, an act to amend, Article 1, Chapter 2, and Tate, the 48th, and 49th, and the Fischer, go to Georgia, and Tate, relating the General Prohibition, Trello, from the Department of Human Services. Agriculture, and consumer affairs. House Bill 322, by Rose, and Scott of the 76, Davis, the 87th, Scofield, the 63rd, Bill B. Toddl, an act to amend, Article 1, Chapter 5, and Tate, the Fischer, go to Georgia, and Tate, relating the General Prohibition, starting out of the lower and taxation to property. Ways and means. House Bill 323, Barn階, and Scott of the 76, Davis, the 87th, Scofield, the 63rd, and William, the 68th, Bill B. Toddl, an act to amend, Article 1, Chapter 4. Title 38, Fischer, go to Georgia, and Tate, relating the Department of Veterans Service. Judiciary, House Bill 324, Barn階, and Scott of the 76, Davis, the 87th, Scofield, the 63rd, and William, the 68th, Bill B. Toddl, an act to amend, Article 1, Chapter 4, Title 38, and Fischer, go to Georgia, and Tate, relating the Department of Veterans Services. Defense and veteran affairs. House Bill 325, I wrote down a Miller to the 62nd homecoming of the 81st and Neil to the 79th. Bill B. Todd will be an active men article in the child. 35 with the fish go to George Ante, everything the general provisions are all law enforcement officers and agencies. Public safety and homeland security. House Bill 326, I wrote down a brief, the 99th Hilton to the 40th, Kenner to the 101st McLean to the 101st. Mug all of the 105th and others. Bill B. Todd will be an active men chapter 4 title one. The fish go to George Ante, everything the holidays and services. So it's doesn't a January 17th is Muhammad Ali Day. Special rules house resolution 139. My brothers of Neil the 79th. Crow with 118th, Gilear 160. Second, Daniel 117th Jackson 128th and others. Resolution creating a house study committee on alternatives. Last shooter prevention methods. Public safety and homeland security. House resolution 140 by resident Davis, the 87th Kendrick of the 95th part of the 93rd, Bennett of the 94th and Mitchell, the 88th. Resolution urging the Metropolitan Atlanta Rapid Transit Authority to reaffirm its commitment to extension of the rail system. Transportation House resolution 141 by resident caucus of the 27th green to the 154th, P3 166th, Bennett of the 94th, Towns of the 179th and others. Resolution creating a house study committee on expanding long term care options. Human relations and aging. That completes first readers. Second reading of bills and resolutions. The clerk will read. House bill 263 by represent Thomas of the 65th, the bill will aid to income taxes. House bill 264 by represent Smith of the 138th. Roads of the hundred and 24th. Williams of the hundred and 48th, corporate of the hundred and 74th, black one of the hundred and 46th. A bill will aid to cremation of county boards of equalization duties, review of assessments and appeals. House bill 265 by runs a quarter of the 93rd. Kendrick of the 95th, more of the 91st and Taylor, the 92nd bill to amend an act of writing its supplement to compensation salary expenses and allow us to the judges of superior court of Rockdale, judicial circuit. House bill 266 by represent Bertha 20th, Matthew Hacke of the 74th. Dunne who the 31st clerk of the 100th, bonner of the 73rd and others, a bill relating to control of hazardous conditions, preventable disease, metabolic disorders. House bill 267 by represent Smith of the 18th, corporate of the hundred and 74th roads of the hundred and 24th ditches of the hundred and 61st, Evans of the 57th and others. A bill relating to general provisions, relative to income taxes. House bill 268 by represent corporate of the hundred and 74th, Powell of the 33rd, Ridley of the 6th, Matthews of the 149th, the heart and of the 5th, a bill relating to criminal justice coordinating council. House bill 269 by represent Black women of the 146th, Douglas of the 78th, gains of the 120th, all over the 2nd Roberts of the 52nd and others, a bill relating to meetings open to the public. House bill 270 by represent Schofield of the 63rd, pretty so the 61st Miller of the 62nd, based more of the 69th, the bill to provide a homestead exemption from City of College Park, Edville, or in Texas. House bill 271 by represent, Park of the hundred and 69th, corporate of the hundred and 74th, and the 12th, Jasper's of the 11th, Williams of the 148th and others, a bill relating to murder, vehicles, and traffic. House bill 262 by represent, Hamilton of the 72nd, Collins of the 71st, Smith of the 18th, Smith of the 70th, the bill to authorize municipal court of the City of Carrollton to charge a technology fee. House bill 273 by represent, all over the 167th, council of the hundred and 79th, Williams of the hundred and 68th, Petri of the hundred and 66th, a bill relating to general provisions, relative to the department of natural resources. House bill 274 by represent, Jones of the 60th, Scott of the 76th, Davis of the 87th, Gladney of the 130th, the bill relating to holidays and observances. House bill 275 by represent, Powell of the 33rd, corporate of the hundred and 74th, Jasper's of the 11th and Park of the hundred and 69th, the bill relating to general provisions, relative to towards. House bill 276 by represent, Scott of the 14th, Dundt of the 8th, the 150th, Kelly of the 16th, all over the 82nd, others, a bill relating to definitions regarding tuition and equalization grants at private colleges and universities, House bill 277 by represent, Scott of the 14th, Dundt of the 19th, Kelly of the 16th, Smith of the 18th, Fleming of the 114th and others, a bill relating to income taxes. House bill 278 by represent, the 100th and 175th, Buckingham of the 137th, Powell of the 33rd, corporate of the 174th, the bill relating to athletic trainers. House bill 279 by represent, Gamble of the 15th, five, the 120th, second, we now have the 120th, Washington of the 144th and Dundt of the 19th, the bill relating to property insurance. House bill 280 by represent, Gamble of the 15th, Lumps of the 12th, Williams of the 148th, Taylor of the 173rd, Smith of the 18th, a bill relating to insurance. House bill 281 by represent, the main of the 56th, Thomas of the 65th, Lim of the 98th, the bill relating to local government, budgets and audits. House bill 282 by represent, the main of the 56th, where Akai is of the 150th, Wilkerson of the 38th, Smith of the 41st and Lim of the 98th, the bill relating to complicities and court curriculum under the Quality Basic Education Act. House bill 283 by represent, camp of the 135th, Jasper's of the 11th, Bonner of the 73rd, corporate of the 174th, Smith of the 18th and others, the bill relating to general provisions, applicable to sales and use tax. House bill 284 by represent, camp of the 135th, night of the 134th, Cameron of the 1st Mathiac of the 74th, Green of the 154th and others, the bill relating to general provisions, for insurance, House bill 285 by represent, Franklin of the 160th, Carson of the 46th, Martin of the 49th, Williams of the 148th, Roads of the 124th and others, the bill to amend the Public Retirement Systems Investment Authority law. House bill 286 by represent, part of Owl of the 50th, Bruce of the 61st, camp of the 135th, all over 80 second, Gellier of the 160th, second and others, a bill to amend the Surprise Bill and Consumer Protection Act, House bill 287 by represent, Thomas of the 65th, Scoffield of the 63rd, Miranda of the 96th, a bill relating to standards labeling and an alteration of food. House resolution 125 by represent, and burnout of the 77th, Scott of the 76, Jones of the 60th, Douglas of the 78th and Neil of the 79th, resolution recognizing, Dr. Barbara Polium, dedicating a road in her honor. Senate bill number one, by Senator dollars of the 27th, good to the 51st and the Vartee of the 31st, Kennedy of the 18th, more than 53rd and others, a bill relating to general provisions, regarding state government. Senate bill 26, by Senator dollars of the 27th, again, in the 47th, Goodman of the 8th, walk out of the 30th, pickman of the 4th and others, a bill relating to state government, House bill 36 by represent, Roberts of the 29th, the 50th, heard Patrick of the 32nd, and others, a bill relating to penalties, for violating code section 16-6-9, through 16-6-12, House bill 37 by Senator Roberts of the 29th, hours of the 56th, hatch of the 50th, summers of the 13th, Kirkpatrick of the 32nd and others, a bill relating to general provisions, regarding sheriff's, through second readers. Thank you. Thank you. The bill goes up. According to United States Any Lums to the 12th District Chairman and Committee and Insurance submitted the following report. The Speaker Committee on Insurance had a consideration of following bills to the House. Instructed to me to report same back the House following recommendations. House Bill 63, do pass. House Bill 85, do pass by Committee substitute. Respectfully submitted representative. Any Lums to the 12th District Chairman. Representative Williams, the 48th District Chairman on Committee on Banks and Banking submitted the following report. The Speaker Committee on Banks and Banking has had a consideration of following bills to the House. Instructed to me to report same back the House following recommendations. House Bill 84, do pass by Committee substitute. Respectfully submitted representative Williams, the 48th. Chairman. I also have John Lohoe to the home of the 75th District Chairman on Committee on Government Affairs. Committed to submit the following report. The Speaker Committee on Government on Affairs has had a consideration of following bills to the House. Instructed to me to report same back the House following recommendations. House Bill 17, do pass by Committee substitute. House Bill 193, do pass. Respectfully submitted representative John Lohoe to the 175th District Chairman. Representative Beth Camp, 135th District Chairman of the Committee on Intergovernment of Coordination Locals submitted the following report. The Speaker Committee on Intergovernment of Coordination Locals, I don't consideration of following bills to the House. Instructed to me to report the same back the House following recommendations. Constable 93, do pass by substitute. House Bill 134, do pass by substitute. House Bill 160, do pass. House Bill 199, do pass. House Bill 210, do pass. House Bill 240, do pass. House Bill 255, do pass. Respectfully submitted representative Beth Camp, 135th District Chairman. Representative Gunner of the 8th District Chairman on Committee on Judiciary submitted the following report. The Speaker Committee on Judiciary has had a consideration of following bills to the House. Instructed to me to report the same back the House following recommendations. House Bill 91, do pass. House Bill 176, do pass. House Bill 182, do pass. Respectfully submitted representative Gunner of the 8th District Chairman. Representative Tyler Paul Smith of the 18th District Chairman on Committee on Judiciary, now and civil submitted the following report. The Speaker Committee on Judiciary, now and civil has had a consideration of following bill of the House. Instructed to me to report the same back the House following recommendation. House Bill 160 passed by Committee Substitute, respectfully submitted representatives. Tyler Paul Smith of the 18th District Chairman. That completes the reading of the report's standing committees. House will come to order. Third reading and passage of uncontested local bills. If there are no objection, we will vote on the local calendar as a whole.\n\nWith a recorded vote Hearing none it is so ordered the clerk will read the local calendar House bill 93 by substitute by reps of Campbell 171st Mitchell County House bill 134 by substitute by reps of carpenter The fourth city of Dalton House bill 160 by reps and a green 154th city of all men House bill 199 by reps and will hold on 75th Brooks County House bill 210 by reps and a Smith 138th Harris County House bill 240 by reps and a green 154th Clay County House bill 255 by reps and a quarter to the 174th Brantley County Is there any objection to the previous question being ordered on the local calendar? Chair his none the previous question is ordered Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bills chair? Here's none Report of the committee has agreed to Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote yes All those above opposed will vote no and the clerk will unlock the machines You Have all members voted Have all members voted if so the clerk will lock the machines On the passage of the bills on the local calendar calendar the eyes are 166 the nays are zero these bills having received requisite constitutional majority are therefore passed Representative Representative penic Representative penic will talk to us about our doctor of the day and Tell us exactly what's going on with that doctor right now they're doing their job. So we'll Let the representative explain and introduce us to You Good morning everybody It's my pleasure to introduce the doctor of the day who is doing what doctors do taking care of a patient Our doctor is doctor Matthew Keede He is an associate professor of the Department of Emergency Medicine at Emory He's the vice chair for clinical practice of emergency medicine at Emory University School of Medicine and an associate professor of emergency medicine at Emory He got his masters of health administration from the University of Cincinnati and his MD from the East Virginia Medical School He also got his bachelor's of science from Duke University his focus is His primary research interest involves emergency department throughout and innovations in the science of health care delivery He He wants to improve emergency department's operations including exploring the impact of clinical information managers On through put and provider productivity the impact of electronic pathways in our medical records to standardize and streamline line care Even though he's not physically here in this room because he is taking care of a patient let us all warmly welcome him to the capital I Will convey your regards. Thank you So noted Thank you represented punish we appreciate you uh Introducing the doctor and we certainly appreciate the physicians that come here to serve us And certainly we understand and do a very appreciative appreciative of him Providing that service right now. So if you see him later on today, be sure and give him thanks We're moving on to morning orders We have a number of folks in our gallery that Will be recognized this morning. So members. I'll ask you to give your attention to the presenter in the well. We'll start with chairman Petrie will be joined by chairman Stevens And the chattam county delegation And chairman Petrie. I know this is going to be difficult But keep this just as close to one minute as you can I know you have a lot doing I'm being serious about that to adequate Ediquity recognize them But we do have ladies and gentlemen. We do have numerous morning orders this morning. So do your best Thank you mr. Speaker ladies and gentlemen of the house. It is indeed my honor To recognize today the Benedictine military school high school for a champions 2022 and 2021 two years in a row and I want to let y'all know something else fourth time state champions in nine years And uh, yeah, thank you And by the way, I'm the only Benedictine military school alum In the legislature, but I before I introduce you to these fine young men. I've got to tell you something I want us all to offer our condolences to representative tre Kelly And representative prince if you would offer some emotional support because you see the team that we we beat and we've got a picture I want y'all to look at this the team we defeated Was the cedar town bulldogs and Accordingly I now because of this um owed a stake dinner at Rathman's because of this victory. So so anyway Folks, I want to tell y'all real briefly look at this picture. So here. This is the most amazing game There's one and a half minutes left in the game We're up 14 to 13. We're up by one point The bulldogs are inside the two yard line It's first down And our boys our cadets hold them four times to win the game 14 to 13 ladies and gentlemen coach Coach Danny Brit Benedictine military school first one should meet coach Brit Zakwan Brian Charlie Ionone And James Moore the three co captains of this team And the last thing I'm going to say folks our coach Danny Brit four time Georgia high school Coach of the year we're so proud of you young men. I've got the resolution here for you These are fine young men fine athletes, but fine cadets. Thank you young men bye bye You Congratulations cobrate and bitter dick teen. Let's see young men are going to Auburn the citadel And Minnesota So exceptionally young men met him this morning. Thank y'all for being here and Thanks for being good students as well as great athletes Cheer lady Cooper you're recognized for a morning order Thank you mr. Speaker ladies and gentlemen the house obviously today I think you know that the audience and upstairs we are a lot of dental hygienists with us And they have passed out this kit so you can have improved dental health care I hope you'll take it home and use it and say thank you to any of them that happen to talk to you in the hall They've been doing this and working for the better oral health of our citizens for 75 years And a few years ago we passed a great bill that allows them to go out and work with our most needy children in some of the schools and in health care For a lower income families to let them check the teeth and Let them clean the children's teeth. So thank you to all our dental hygienists if you're in the balcony Please stand up and let us thank you You You Keep up the good work. Thank you mr. Speaker. I yell the well Thank you cheer lady Cooper and ladies welcome to the people's house good to have y'all here cheer lady Lynn Smith is recognized for a morning order You're Cheer lady smith You're up The clock's running Now you're good Good morning everyone and if the delegation will join me and appear There are about 40 kids and up here in the balcony at the V up there and they're from the heritage school They are studying us today. They have a civics project. They've already presented me with petition for our group and It's too many for us to get a photo with them. I'm afraid but please to help me welcome them to the great house of Georgia Welcome to your capital Chairman John Carson is recognized for a morning order Felicit Christian Hey, everyone good morning. I've heard Actually, we have a great group of kids here from a fellowship christian school I've heard a little bit about truck weights, but it's actually fellowship christian day here at At the Georgia State Capitol where you can stand up. These are all 12th graders and AP government From miss orgos class from rossville, Georgia fellowship christian school. Welcome to your capital Thank you miss speaker Welcome good to have you chairman work eyes are recognized for a morning order Thank you miss speaker. We have some of our brightest and best students from Evans County that were brought to us With adam candy his the ideate director from Evans County is no stranger to the capital Tammy hall the executive director Gina Roberts mayor of hagan neohamic Evans County commissioner and then the two advisors Candace curvy from claxon high school and bitty land from pinewood Would y'all stand and let us recognize y'all. Thank you for coming to your capital Thank you miss speaker You Represent advanced smith recognize for our morning order He has friends I have a few miss speaker. Thank you Miss speaker we'd like to take this moment along with the delegation representative Buckner Representative helston representative jinkens and we would like for the house to help me in a few minutes Congratulate a great baseball team from down at Lagrange college We have with us the president dr. Baxter with us the coaches with us coach kelton and some fine young men That went a long way in the championship playoffs matter fact they won 44 games this year and they only lost nine So I consider that a pretty good season. Would y'all help me give a warm welcome as y'all stand please and give them warm welcome to the captain Thank you miss speaker and thank you members of the house Thank you represent Smith Good group there that's quite a record yeah chairman blackman For a morning order Thank you mr. Speaker we have a group of Perry proud leaders here today Would y'all stand and let us welcome you to the people's house? Thank you so very much. Thank you mr. Speaker Thank you and welcome chairman chokus recognize for a morning order Thank you mr. Speaker with redistricting I gain four new counties and one of those counties is Webster County And today in the gallery stand up I've got Dorothy Ingram the superintendent from Webster County school system here visiting the capital She's checking it out because Monday I'm going to be bringing all a bunch of students from Webster County She wanted to make sure it was safe. So with that being said welcome to Dorothy. Thank you for being here. Thank you mr. Speaker chairman chokus you in the way all more than I am You're doing good work chair recognizes Reps active gasman nil for a morning order represented nil Thank you mr. Speaker my colleagues from Clayton County delegation can step up another one or two might be missing today Um either way good morning everyone good morning colleagues today is chamber day at the capital for my Clayton County Chamber of Commerce and the ATL Airport chamber the chamber is one that is so vital to us so vital to our community so vital to Our airport and everything surrounding that space between here and traveling across the world by starting in Clayton County when you get To Hart'sville Airport. So I want to say thank you to all of our Clayton County citizens that are here. Thank you to our chamber. I know they are actually in programming at the moment They want to be at the at the top, but either way. Thank you so much and thank you for having us. Thank you mr. Speaker Thank you Thank you representative nil Members we're ready to move on to the rules calendar Mr. Clerk the clerk clerk will read the caption to hb 119 House bill 119 by version of corporate of the hundred seventy-fourth and others to be titled back to To article one of chapter six at title 40 the physical to George annotator relating to general visions relevant uniforms rules of the road so it's to provide for procedure for passing stationary vehicles This bill I refer to the committee on motor vehicles that committee recommends this bill do pass The gentleman needs your attention on this bill It's a very important subject so chair recognizes chairman corporate to present the bill Thank you, mr. Speaker members of the house. I'll bring before you house bill 119 LC 393568 this bill was brought to me by triple a auto Club Presley has our move over law in Georgia if you first responders emergency personnel Anybody flashing light sanitation workers out there on side of the road Georgia law requires you to move over when you can If not slow down What we're doing with this bill we're just going to extend that same privilege to the disay will notice This out there on the road if they're broke down with their flashing lights on Let's get they have to have their flashing lights on then you get the same curse So you have to you either slow down if you can't move over and that's all this bill does And I appreciate you can favor consideration and if you have any questions, I'll try to answer Gentlemen you owe four questions. I owe you four one. Yes Representative cannon To your left has a question. Thank you to you Yes, I just a quick question. Is this not just a rule that could be otherwise done by a department Is this bill the only way to get this done? I think to make it a statewide to be uniform rules of the road for the whole state it needs to be done In code to Decartify this. I don't believe we can do it otherwise in rules Thank you. I ask for your favor consideration. You have no further questions We have a member who would like to speak to the subject matter as representative Teddy Reese is recognized to speak to house bill 119 representative Reese Thank you, mr. Chairman Thank you, mr. Chairman mr. Speaker You're doing good. Keep on going to representative We just want to hear what you got to say man Yes, sir. I'll stand in favor of this bill today Uh I'm glad that we're standing the coverage, but I think this is a great time too for Georgia To remember why this bill is in place here on the screen you have a gentleman by the name of Jonathan Begley He was 41 and on December the second 2022 Just days before Christmas. He was working for Griffin towing company Columbus, Georgia and he was called to To a state patrol officer who had been disabled on J. R. Allen Parkway A motorist came along and hit him and the state patrol car Thank God the office is okay, but unfortunately mr. Begley lost his life He left behind a wife two children And a tow family that loved him dearly He was a great man with a full heart full of energy and he loved everyone There was never an instance where I visited the tow yard and he wasn't Just glad to see everybody there So mr. Speaker If you would allow I would like this chamber to join me in the moment of silence for all Georgians that we have lost on the roadway Doing a job doing their duty to the people this great state Mr. Speaker you're the will Thank you Representative We appreciate your Your view is there any objection to the previous question being ordered chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill chair here's none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of the bill will vote yes All those opposed will vote no and the clerk will unlock the machine You Have all members voted Have all members voted This so the clerk will lock the machine on the passage of the bill the yeas were 167 the nays zero This bill having received the requisite constitutional majority is therefore passed The clerk will read the caption to hb 120 House for 120 by resident of corporate the 174th and others to be entitled back to amend code section 40 five 64 Of the fish go to Georgia antenna relating a limited driving permits for certain offenders So as we're required for standards for issues of such permits this bill I've referred to committee on motor vehicles that committee recommends a Dispilled do pass chair recognizes Representative German Corbett to present the bill Thank you mr. Speaker I bring before you the small-in-house house bill 120 lc 393525 This is the department of the driver services bill they come to me to ask for some Basis some cleanup languages from a bill that was passed in 2020 house bill 799 And what we did in 2020 it removed the language that prohibited someone with a DUI drug charge From receiving an early reinstatement or limited driving permit so we removed the language that prohibited However, it didn't put the permissive language was inadvertently left out of the bill So what we're doing here just codifying they're doing it and rules and regs now But they want it codified to clear up did they do have that authority to do that and that's all we're doing with this bill And I appreciate your favor consideration and mr. Speaker you'll well You No questions Is there any objection to the previous question being ordered? chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill chair here's none the report of the committee is agreed to Shall this bill now pass all in favor the passage of the bill will vote yes All those opposed will vote no and declared will unlock the machine You For what reason does the gentleman from the 17th represent Montaghan Uh, thank you mr. Speaker of present a house rule number one thirty the rate I'd be excused from the vote So noted will be in the record. Thank you. Representative You Have all members voted Have all members voted if so the clerk will lock the machine On the passage of the bill the yeas were 169 the nays or two The bill having received your requisite constitutional majority is therefore passed The clerk will read the caption to house bill 175 House bill 175 by resident Daniel 117th and others to be titled knack to men code section 40 1-8 of the fiscal to Georgia and Tate are relating to safe operations and motor carriers commercial motor vehicles and drivers and safe transportation of hazardous materials So it's to update the reference date to federal regulations regarding the safe operation and motor carriers and commercial motor vehicles Miss Bill ever referred committee. I'm motor vehicles that committee recommends that this bill do pass chair recognizes Representative Daniel to present the bill is is this your first bill Really how long have you been here? Just a few day. Oh Good luck. Thanks, sir. Thank you, mr. Speaker Good morning y'all Y'all are about to find out how passionate I am about motor vehicle carrier bills Today I rise on behalf of house bill 175 This is a piece of legislation that amends code section 40-1-8 of OCGA It is an annual bill that we do to replace the previous year with the current year in the code section This definition change efficiently codifies updated commercial vehicle and driver safety rules for proper safety enforcement in our state um However without this legislation amendment um To Georgia law enforcement officers primarily in the motor carrier compliance division would be unable to enforce The law as it stands. So we We are favorable to this and I hope you will be too Uh further it could put Georgia at risk for losing federal funding for these enforcement issues Each year the date must be codified into Georgia law to legally correspond with codified present Regulations of federal commercial vehicle safety standards And plain people words um, this bill updates the year to make sure that the state stays and Compliance with federal regulations and keeps our drivers on the road safe And I ask for your favorable consideration Will the gentleman lady yield for a question? I will Have one here from the one hundred and seven oh no, that's you Somebody you mentioned you master button for a question in the back Did not Well, you do have one from the gentleman from the twenty-night chairman d'Ivnick is Has an important question for you straight straight in front of you on the left. Thank you mr. Speaker with a lady yield I do Representative I was looking over this last night late in the night and I ran out of a little bit of time if you'll look with me online 14 I have a question you reference here this bill reference the present regulations promulgated under section 49 of the code of federal regulations I'm sure you're aware there's a subtitle a with 99 parts and subtitle b with 12 parts But I was curious if you could Address this body and explain to us which of those regulations are promulgated and in effect as of January 1st of this year I believe that in the same way you found them anyone curious can also find them in section 40-1-8 Yeah, I was really curious about that 99th section where it refers back to the powers being Related and conveyed to the state. So how will these federal regulations and your new state law be in Support of one another or are they going to be in conflict one? No, they should be in support of one another That is the entire purpose of this I look forward to seeing that written description of how they'll be in concert with one another I think the gentleman can go with to the ladies desk when she completes this and she can explain it to him That was kind of my question, but I thought I think the next Question will really get drilled down to what my question is about This bill and that's someone to recognize the gentleman from the 125th House District Represented for him in for her question Thank you miss speaker to the general lady in the well I appreciate you bringing this and actually I think you did a good job for your first bill But here's my concern if you'll look on page two of the bill Even if we pass this and the Senate passes it and the governor signs that there is no enactment date on the bill I believe that once the Senate signs it and the governor signs it the enactment day and the Constitution is July 1st The lady has done her homework. Congratulations Well Will that scare to will a lot of questions right there without answer I'm just telling you I think you're pretty much ready But let's do one more to maybe two more The gentleman from the fourth chairman\n\nhas a very important question. Does the general lady you? I do, or now. I actually tried to call you from your microphone and the speaker would not let me speak to you. But my question is, would you like me to hit the green button or the red button on this boat? You know, I'm pretty young. I think it can make my way back to my seat to vote for my own bill. How are we done? Two more. He said two more. The gentleman from the 116th has a burning question representative, Holly. Thank you, Mr. Speaker. Does the general lady yield? I do. It's not true that while this is necessary to match our state regulation with the federal regulation with regard to the commercial or the trucks that are on our expressway, the truth is is that while I miss the local scroll that you now have in your district, the truth is that this will do nothing to improve the load of traffic in Henry County. Is that true? That is absolutely true, which is why I'm excited. I am on the Transportation Committee. Hopefully we can do something for the traffic in Henry County. And, you know, he's doing an excellent job. Thank you for bringing this. Thank you, Representative. She needs your help and all our help on that. This is the last one I think we have here. And he's been asking for a while. So seatmate back there, the gentleman from the 17th representative, Montaghan. Thank you, Mr. Speaker. This is the general lady yield. Of course. So I was looking at this bill that you've got. And congratulations on your first bill. But, hitting on the bank page, it says that all vise and porceless and conflict with this act will reveal. Can you tell me in detail what vise you're revealing? I love that question. I yield the will. The lady has yielded the will. The lady has yielded the will. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. We could lock the machine, Drew. Have all members voted? One more time. Have all members voted. If so, the clerk will lock the machine. On the passage of the bill, the yeas, well, 171 yeas were 171. Well, the nays were zero. You'll change your minds. The bill having received the requisite constitution majority is therefore passed. The clerk will read the caption to hb183. House Bill 183, members, an apartment of the fifth to be entitled back to amend. Code section 1611112 in chapter 2, a total 40. The fiscal to Georgia annotated relating vehicles with false or secret compartments and registration and licensing of motor vehicles. This bill lemme refer to the committee on motor vehicles. That committee recommends that this bill do pass. Representative Barton is recognized to present the bill. Ladies and gentlemen, I have with you a house bill 183. The LC number is 39624. This is the bill we passed last year and made it through the committee and rules at the Senate side, but it got hung up at the very end. This is the Department of Revenue bill. This bill pretty much is just changing the verbiage of temporary loss of the plate to temporary operating permit. And the reason why dealers, the Department of Revenue and commissioners, they all call them tops. And they just want the lingo, the state law to go along with what they're saying. And that's the essence of this bill. Gentlemen, you have no questions. Will you do have a question? Does the gentleman yield? I yield. The gentleman from the 100th and the 9th representative declined to your left. Has a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. Yes, I just noticed you were up, but we missed you in HB 175 because we were looking for you, but you were presenting the bill. So Mr. Speaker, I would like to make sure that you noticed that he was present, but he didn't vote on HB 175. But now does the gentleman yield for my question? Yes, sir. So on HB 183, online 62. You were asking about the operating permit. Do you know exactly when, in accordance with the paragraph, when it will go into effect? With the paragraph, if it went into effect, it will go into effect upon the Governor's signature or your last question. Thank you. Thank you, Mr. Speaker. I yield the bill. Thank you for the question, and thank you for the presentation. Is there any objection to the previous question being ordered? The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favour of the passage of the bill? Will vote yes. All those opposed will vote no. The clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 172, the nays 0. The bill haven't received the requisite constitutional majority. Is therefore passed. That completes our rules calendar. We're going to move on to afternoon orders. Representative Crawford is recognised for an afternoon order. Representative Murray Crawford. You're recognised, Representative. Representative Murray Crawford. Thank you, Mr. Speaker. Members of the body and friends, good morning. I am Murray Crawford from the 84th District. It's an honour to stand before you today for this black history month moment. Don't ask what the world needs, but ask what makes you come alive and go and do it. Because what the world needs is people who have come alive. And as you go throughout this journey, you will have to understand that there will be challenges. But you can overcome those challenges with hard work and preparation, most importantly, to be successful. My person took her chance and cracked the glass ceiling with a strong serve and an even more impressive backhand. Out the Agipson became the first African American to win a grand slam title, but long before making history, she was born in the segregated south and moved with her family up to New York, where she began to fall in love with tennis at a young age. After just a year of playing, she became a local star. And her talent would take her to this school in Tallahassee, Florida, and the University on a full athletic scholarship. She was successful in college, but as a professional, she struggled because she could not play in a lot of the segregated matches, but nonetheless, her talent would make room for her. And she would get her chance. In 1950, she became the first black woman to play in the US nationals. In 1958, she became the female of the year after winning the French Open, the Wimmelton and the US nationals being the first black tennis player to do so. She was inducted into the International Tennis Hall of Fame, and what did she do after she retired from tennis, or she went on to break the color barrier, and the Ladies' Professional Golf Association. Out the Agipson is a strong and emblematic example of what happens when your preparation meets opportunity and you're given a chance. So ladies, the next time someone tells you that you play like a girl, take it as a compliment. Mr. Speaker, thank you and I yield the well. Thank you, Representative. Chairman Jasper's recognized for an afternoon order. Thank you, Mr. Speaker. For the 35 members of the Transportation Committee, we do have a meeting this afternoon. It's in 606. You know, there will be a two-hour meeting. There will be a vote held on Representative Meeks, this bill 189. The members of that committee, please check your email. There has been a sub, and so you need to take a look at it. Thank you, Mr. Speaker. Representative During Carter is recognized for an afternoon order. Representative Carter. Okay, I was hoping we have a picture. Thank you, Mr. Speaker. Today, I want to bring your attention to a great Georgian. His name is Thomas Wiggins, born May 25, 1849. Thomas Blin, Thomas Blin, Tom Wiggins was a virtuous pianist, gifted composer, and one of the most in-demand musicians of his time in America, in a 19th century. He was able to perform any musical piece in his entirety with little effort and a mass, a repertoire of thousands of pieces of literary art over his lifetime. Wiggins was born Thomas Green in Harris County, Georgia, blind at birth. He was sold in 1850, along with his enslaved parents, charity and domingo Wiggins. At an early age, he showed an interest in the piano after hearing instruments played by the age of four, reportedly he had acquired some piano skills by ear and gained access to a piano. By age five, Tom reportedly had composed his first tune, the rainstorm, after a torrentia downpour of ten roofs. The line-time began touring the United States at the age of eight, and at the age of ten became the first black musician to give a headline performance at the White House. In 1866, at the age of 16, Tom was taken on a European concert tour, testimonials about Tom's natural talus from composer pianists Ignat's Mochiles, and pianist conductor Charles Helle. These were printed in the booklet, the marvelous musical prodigy Blind Tom, and used to bolster Tom's international reputation. He is referenced as the 167th most famous autistic person in the world. If you would, if you have the opportunity there doing a documentary, you can look up Blind Tom, but he was born blind and autistic into slavery and look at what he did. That is my moment in Black History. Thank you, Mr. Speaker, I yield the will. Thank you, Representative. Chairman Cooperter, quickenized for an afternoon order. Thank you, Speaker. Yesterday my community lost a great man, a man that never made a stranger. Robert Buie, aka Baby, was an icon at the Oakwood Cafe. He was loved by all who met him. Robert came directly to us from incarceration. He is an illustration that criminals deserve a second chance, and if put in the correct environment they will succeed. With all this talk about tough on crime, it's easy to forget that it's people, not government, that will solve the revolving door of our prison system. We must learn to forgive, love people where they're at. Julie and I and the kids will miss you dearly. Rest in peace. Chairman Sains is recognized for an afternoon order. Thank you, Mr. Speaker. It's fitting that this commemoration happens on Black History Month. My district commemorated the 52nd anniversary of the Thigh Commemorial Explosion, which Chairman Hitchenson responded to 52 years ago. The factory workers who lost their lives that day were making trip flares for the Vietnam War. I'll share a small excerpt of a constituent poem. Chairman Will, members I think it'd be appropriate if you stood and paid attention. Thank you, Mr. Speaker. I'll share a small excerpt of the poem that was made by constituent in their memory. But we rose from the brightness of a new day, memories of our loved ones, which will never fade away. For those who are inclined to there is a petition for a congressional gold medal for those individuals that you can find on their Facebook page. Thank you, Mr. Speaker. Thank you, members and thank you, Chairman Sains. That concludes our afternoon orders. The clerk will read the caption to a group of privileged resolutions. Honoring the Life and Memory of Donald Don Linear Plunkett. Honoring the Life and Memory of Adele Marie Domenico Benny. Honoring the Life and Memory of Reverend Joe Robert Harrison Jr. Commending Mrs. Barbara Andrews Landruth's retirement and services Georgia's longest serving teacher, recognizing commending represented by Glant and Senior on his Outpen Standing Public Service. Commending the State of Georgia Organization Omega Phi fraternity for their dedication, commitment to empowering youth strengthening families and uplifting communities. Honoring the Commending the Multi-Agency Alliance for Children, recognizing commending University of North Georgia punish 150th anniversary. Is there any objection to adopting the privileged resolutions? Chair, here's none and the resolutions are adopted. We're going to move on to announcements. Representative Betsy Holland has recognized for an announcement. Thank you, Mr. Speaker. The Atlanta delegation joint Senate and House side will meet this afternoon at 4 o'clock in CLOB 328. Space is limited, so if there are stakeholders who want to view the meeting but cannot attend in person, just contact our office for the Zoom link and it went out by email this morning. Thank you. Representative Beesmore has recognized for an announcement. Thank you, Mr. Speaker. My colleagues, I want to invite you to attend the inaugural Fulton County Day here at the Capitol on Thursday, February 16th. And that will be in the cap, um, Rome 341 at 4 p.m. Please come and join us and put it on your calendar. Thank you. Thank you, Rivers. That was the 14th 16th 16th. Representative McLean has recognized for an announcement. Thank you, Mr. Speaker. The working family caucus will meet upon a German in room 307 in the CLOB. We've got to get out by 1 o'clock because committees are meeting, so please come on over. And today's presentation will be on the 2023 key education policies and budget issues. So in 307 in the CLOB, because we got to be out by 1 o'clock. Thank you, Mr. Speaker. Chairman Torven recognized for an announcement. Chairman Speaker, the committee on information and audits will meet today at 1 p.m. CLOB 406. CLOB 406, 1 p.m. Information and audits. Chairman Winson recognized for an announcement. Thank you, Mr. Speaker. The House majority caucus will meet at noon upon a German for lunch in room 403. Well, I saved the best to last. The Savannah delegation is led by Representative Ann Allen Westbrook has an announcement. Thank you. Thank you. Thank you, Mr. Speaker. And good morning colleagues. Today is the best day of the whole session. It is Savannah Chatham Day. It's the hottest ticket in town and every single one of you gets to get in with your badge. So please come and join us 5 p.m. at the depot. We're going to have all kinds of seafood. And I know we all in here eat seafood. There will be oysters, there will be low country bowl, there will be a variety of beverages I understand. And there will be some other things for you to enjoy as well if you don't eat the seafood. But please do come. We're legendary for our hospitality and we're bringing it to the Capitol today. So see it 5. It's a great day to be with Savannah and all the good folks looking forward to it. So that completes our announcements. We do have a couple of birthdays. We're actually celebrating a birthday today. Cheer up of game, fishing, parks. You got a birthday? Wow. We're celebrating tre roads. Happy birthday sis. Birthday today. February the night. February the 10th tomorrow. Representative Yasmin Neal will be one year older. Representative need happy happy happy birthday. And on Saturday. Representative Medisha Thomas. Medisha Thomas will be another year old too year old as well. Happy birthday to you many more. We do have pages today if you have a page we'll ask. Meet you down front. We'll text on page photos. Thank you young people for being here and working with us. Hope you've enjoyed your day so far. Chair now recognizes the majority leader for a motion. Thank you miss speaker. I moved that this house stand adjourned until 10 a.m. on Monday, February 13th, 2023. On the motion of the majority leader that this house stands adjourned until 10 a.m. Monday, February 13th, 2023. All those in favor will say yes or aye. Got both trying to double the count there or all those opposed will say no. The yes and the eyes have it no doubt we are adjourned.",
  "updated_at": "2026-02-13T03:54:13.827806+00:00"
}