{
  "video_id": "lqzXF2_NGuY",
  "url": "https://youtu.be/lqzXF2_NGuY?t=845",
  "title": "Georgia House - Day 9 (2026-01-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-01-30",
  "duration_minutes": 68,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-01-30:\n\n## Overview\nThe session included a prayer by Reverend Vandy Carl Simmons, who was introduced by Representative Rhonda Taylor. The prayer focused on being a \"difference maker\" and referenced John the Baptist. No major bills or votes were detected in the provided transcript.\n\n## Key Actions\nNo bills were passed or referred in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Prayer by Reverend Vandy Carl Simmons, who spoke about the importance of being a \"difference maker\" and referenced the story of John the Baptist.\n- Representative Rhonda Taylor introduced Reverend Simmons, providing background on his career and service in the community.\n\n## Votes\nNo recorded votes were detected in the transcript.\n\n## Attendance\nThe transcript notes that all members were present for the morning roll call.\n\n## Adjournment\nThe transcript does not contain information about when the session was adjourned or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nI guess we won't do that anymore.\nWe do have a backup.\nWell good morning, obviously I don't know my own strength.\nThe hour of convenient has arrived.\nAll members, all members, please take their seats.\nMr. Clerk, will you please ring the bell.\nWe're going to have the morning roll call, all members present.\nSo please vote green to signify their presence in the chamber and the court will unlock the\nmachine I see representing Taylor, Alexander has voted representing Taylor\nThank you. Have all members voted? Have all members voted? If so, the clerk will\nlock the machines. Doorkeepers will please close the doors and keep them closed.\nWe will begin our day with script reading and prayer by the chaplain, after which we will\npledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 92nd House District\nrepresenting Rhonda Taylor.\nGood morning, thank you, Mr. Speaker.\nAgain, good morning colleagues, it is with great pleasure that I introduce to you, my pastor,\na Monty Barnes, representative of Barnes's pastor, as today's chaplain.\nThis is a man that I greatly admire.\nHe is a leader who loves his church, his church family, and he knows all of his members\npersonally.\nAnd he loves ministering, which means a lot to so many of us because he enjoys what\nhe does, and you can see that by some of the members from our church that are here with\nus today in the gallery.\nHis name is Reverend Vandy Carl Simmons, and he is a native of Tifton, Georgia.\nHe earned a bachelor's degree in secondary education from Baudosta State University,\nand a master of divinity degree from Turner Theological Cemetery in Atlanta.\nSimmons is a retired teacher who taught and coached in TIFFT,\nDaughtery and Clayton counties.\nDuring his residency in TIFFT and Daughtery,\nhe served as scout leader and local NAACP president.\nIn October of 2016, Bishop Reginald T. Jackson appointed him\nto serve as the senior pastor of Antioch AME,\nAfrican Methodist Episcopal Church in Stone Mountain.\nAnd I can tell you that under his leadership,\nwe have groaned immensely.\nWe have, for the past six years,\nnewly renovated, the sanctuary, the fellowship hall,\nhave new paved parking lots.\nSo you can see that he is a man with vision\nand he likes to do things going forward.\nWe don't stay in the same place.\nAnd our mission is to be in the community for the community.\nAnd he has worked with the Cap County\nand to receive $23,000 from Commissioner Steve Bradshaw\nto provide financial assistance to the surrounding counties.\nAnd we recently secured an additional $50,000\nto continue providing that financial assistance.\nAnyok is known for hosting town hall meetings,\nmental health forums, summer camps for learning disabled,\nand we do career fairs.\nAnd we were very active during the pandemic.\nand actually today serve as a COVID-19 testing site.\nPastor Simmons is married to his high school sweetheart,\nDr. Bonita Marrow Simmons, and employee\nof the Atlanta Public School System.\nPastor Simmons is a man of God who is deeply committed\nto his family.\nHe is a proud father of two sons,\nVandorian of Lake City, Florida,\nVanquith of North Dakota,\nand one daughter, the late Vanquila of Atlanta.\nHe is also the grandfather of Nakhai and Dorian.\nI present to you, Pastor Vandy Carl Simmons.\nThank you, Representative Ronda Taylor.\nAnd certainly, we thank God for our speaker of the house,\nRepresentative John Byrne and one of my good members,\nand I love the others of you who are gathered here,\nall you public servants, we greet you in the joy of Jesus.\nAmen, praise the Lord.\nIt is so good to see you and I am honored for this opportunity\nto share with you just for a moment.\nwith you just for a moment, I have my time limit and I'm AME but I used to be\nBaptist. So if I go over the five minutes blaming on the Baptist, I want to\nI'll share with you from the Gospel\naccording to Matthew the third chapter,\nAdvent text.\nIn those days, John the Baptist came preaching\nin the wilderness of Judea and saying repent\nfor the kingdom of heaven has come near.\nThis is he who was spoken off through the prophet Isaiah.\na voice of one colon in the wilderness. Prepare the way for the Lord. Make\nstraight paths for him. John clothes were made of camels hair and he had a\nleather belt around his waist. His food was locust and wild honey. People went\nout to him from Jerusalem and all Judea and the whole region of the Jordan.\nconfessing their sins, they were baptized by him in the Jordan River. But when\nhe saw many of the Pharisees and Sadducees coming to where he was baptized and\nhe said to them, you brood of vipers who warn you to flee from the common wrath.\nProduce fruit in keeping with repentance and do not think you can say to\nyour says we have Abraham as our father. I tell you that out of these stones God can raise\nup children for Abraham. The axe is already at the root of the trees and every tree that does not\nproduce good fruit will be cut down and thrown into the fire. I baptize you with water for\nrepentance. But, after me, comes one who is more powerful than I, who\nsound as I am not worthy to carry. He will baptize you with the\nHoly Spirit and fire. Amen, somebody. I just want to share with you\njust for this few minutes we have here to hang out about being a\ndifference maker, a difference maker. You know, I really like\nJohn the Baptist. How about you? Anybody in here know about\nJohn the Baptist? Isn't he something special, isn't he? We\nknow him, those of us who've been to the church today or\nto know him as the front runner of Christ, Jesus' cousin, who led the way, opened up the\nway for Jesus. Just as you and I are called to open up the way of peace and love and joy,\nthat's our job. And I would be hard pressed to, if I did a survey, if anyone in here regardless\nor why you're here. If any of you in here, if one of your reasons\nwant to be to make a difference, I'll be surprised.\nWhen you agree with me that all of you who are serving here,\nyou're here primarily to make a difference.\nWouldn't you say that? And so John the Baptist,\nHe models for us how to make a difference.\nFirst of all, if you look at the text,\nit's very clear that as a difference maker,\nwe understand the power of one.\nLook at John the Baptist saying,\nhe's a bad man, isn't he?\nLook at him, out there in the wilderness,\none voice, one voice.\nDo we understand the power of one when you ran\nfor your office?\nYou understood that you would be working collectively\nand collaboratively with other people.\nAm I correct?\nBut you also understood the power of your one voice.\nAnd so if we have to be different makers,\nregardless some time of how the crowd is moving,\nwhat everybody's saying and what everybody doing,\nmy mom used to say, don't be doing like everybody else.\nAnd I'm sure that all of us\nhave been told that by our parents that,\nif everybody else jump off the bridge,\nYou going to jump off, too?\nBut we understand and John the Baptist understood\nthe power of his one voice.\nAnd you understand the power of one vote.\nAnd that's why we work so hard to get somebody, anybody,\nvote because we understand the power of one and we understand how that\nhelped us and being a difference maker. Hey, man, I can't\naccount for everybody, but I'm you caught on me. My grandma, I\nused to say my grandma used to say, if I have to go by myself, I'll\ngo. You know, that's a Baptist. I know I got one witness in here. But I hear you. But\nthe second piece that I think John the Baptist helped us with in making a difference.\nIt's that we must wear our own clothes. Difference maker, wear their own stuff. Comfortable in\nown skin. I mean, I look around and I, I was trying to find somebody from\nTifton. I couldn't find nobody from Tifton. I heard a lot of people saying they\nYou were from South East Georgia.\nAmen.\nWhat anybody from Southwest Georgia in here?\nWhat do you understand that we have representatives from all over the place, don't we?\nAnd to me, that's a good thing to have this variety, that different voices.\nAnd I believe when you bring in diversity, you bring in unity.\nI mean, you, you get to hear from everybody but you have to be authentic and comfortable\nin your own stuff.\nI, I don't know about you but I can't hall the stand for Kuwait themselves and I can\nread it pretty, I mean it don't take me long to read you.\nI can tell when forgain wearing their own stuff.\nIt is so important.\nI may not always agree with you,\nbut brothers and sisters, I can appreciate you\nbeing uniquely who God has created you to be.\nAnd if we can accept each other,\nfor who we are. I think we can do so much together. So John the Baptist making a\ndifferent, how I'm doing with time. I'm getting there. So he won? Tell your\nneighbor, y'all, we do what we do in our church when we think folks are\nsleeping on us. We make them start talking to each other. Tell your neighbor a\ndifferent maker knows the voice of one and a different maker where he's her\nown clothes comfortable in their own skin but finally as John the Baptist modest\nfor us and by the way did y'all hear what the Bible say what John the Baptist\nwas wearing that camma hair, what clothes made out of camma hair, and a leather belt.\nI mean, he sounded like he was a hot master, but look at the impact he made in his own\nstuff.\nFolk couldn't understand what he was wearing, but they appreciated him being himself.\nI'm through. I'm through. The final piece and I think is so vital and important. A different\nmaker makes a difference in others' lives and give the credit to God. Amen? Just know that you\nYou are a different maker and you make a difference in others' lives, but always remember\nto give God the glory, amen, let us pray.\ngracious God. Thank you God for all of these\ndifferent makers. Dear God, we just pray as you\nhave allowed us and called us to be a part of your\nmission. You have called us the salt of the earth, the\nlight of the world. And you have empowered us with such a great light to let our light\nso shine before the world that they will see our good works and glory\nFind you God who heals in heaven.\nHelp us, O God, to be all that you have called us to be.\nAnd when it's all over said and done, we'll be able to declare\nwe made a difference while we yet had time.\nGod bless you.\nLet us continue to stand and pledge allegiance to the flag.\nAs allegiance to the flag of the United States of America,\nto the Republic of which it stands,\none nation in the middle of liberty and justice law.\nAll right there.\nDoorkeepers will unlock the doors, members made great chaplain summons in the south\nany room.\nThank you for that difference maker.\nThis is a whole group of different makers.\nWe appreciate your more of your message.\nYou\nChair recognizes Chairman Tarvan, the Chair of the Committee on Information and\nAudits.\nChairman Tarvan.\nMr. Speaker, your committee on Information and Audits has read the journals in the previous\nlegislative day and found it to be correct. And on another word, Mr. Picker, for my entire\nadult life, I have always said that the trees are beautiful in the fall, but I waited a\nlot way too old before I took time to look at them.\nTrue awards were never spoken, Chairman Tarvan. Is there any objection to dispense with the\nThe reading of the journal, Chair Here's None, the reading of the journal is dispensed\nwith.\nIs there any objection to the confirmation of the journal?\nChair Here's None and the journal is confirmed.\nThe clerk will now read the resolution establishing the order of business for the day.\nMr. Clerk.\nThat's that situation. The 104th news following be established. The order of\nbusiness to the first part of the period unanimous consensus. Introduction of\nbills and resolutions. First reading and reference of House bills and\nresolutions. Second reading of bills and resolutions. Reports of standing\ncommittees. Morning orders. Is there any objection to the adoption of the\nresolution establishing the order of business for the day.\nChair, here's none, and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHospital 81, by the way, some corporate of the 174th, or one of the 32nd, green and\n154th, purple 169th, and meeks of 178th, will be taught an act to amend Code Section 2262.\n262 of the fiscal of Georgia and Tate\nare relating a low wealth capital outlay grants.\nEducation House relating to my\nresident Jackson 128th Hawkins the 27th\nCooper the 45th Williams on 68th\nBeverly and 143rd others will be\ntaught an act to men are due chapter 7\ntitle 48th fiscal of Georgia and Tate\nare relating the imposition rate\ncomputation exemptions and credits\nrelative state income taxes.\neight.\nWays and means House Bill 83 by\nRose of Gunner of the eighth\nSimp Smith of the 18th.\nSee all the 34 threes of the 99th\nlever to the hundred and twenty\nthird and others.\nIt'll be Todd and act to a men\nchapter four.\nBe a title 43.\nThe Fisher go to Georgia\nannotated relating to Georgia\nathletic and entertainment\ncommission.\nRegulated industries House Bill 84\nby reps of roads.\nof the 124th Williams, the 148th Corp. 174th Williams, the 112th, and Lahuda, the 175th.\nHe'll be top of an active man in chapter 1, and title 10 of the Fischer go to\nGeorgia, annotated, religious selling, and other trade practices.\nBanks and biking.\nHouse bill 85, I represent Cooper, the 45th, Hawkins, the 27th, and Lomston, the 12th.\nHe'll be top of an active man, article 24, title 33.\nThe Fischer go to Georgia, annotated, religious, and gentle provisions regarding insurance.\ninsurance house really six by\ngrams of rose on 24th Stephen's\nphone 64th quarter of the 174th\nWilliams on 48th and saints of\n180th will be titled an act of\nmen code section 48 8 3 the\nfish go to Georgia and today to\nrelay the assumptions for\nstales and use taxes.\nWays and Maine House of\n87 by roasted or one of the\n30 second Jones the 47 to do\nmake the 29th Jasper's the 11th\nway to the 9th and others will\nbe titled an act of men chapter\nTitle 20, the physical and Georgia annotated relaying the elementary and secondary education.\nEducation.\nHospital 88% gains the 120th workides of the 157th pile of 33rd crowd with the\n118th Evans the 57th and others will be titled back to amend.\nTitle 17, the physical and Georgia annotated relaying the criminal procedure.\nJudiciary non-civil.\nhospital 89 by Rose and Bruce, the 61st February, the 14th, 43rd,\nBayes, more than 69th, and Gilleer, 160 second.\nThere'll be a total of an act to amend chapter 12, a total of 50.\nThe fish go to Georgia, annotated, relating to commissions and other agencies.\nGo for mental affairs.\nHospital 90 by Rose and Steven's, a total of 64th and Smith, a total of 138th.\nThere'll be a total of an act to amend code section 485, 32.1.\nin the physical and Georgia annotated relating to certification of assessed taxable value\nappropriate.\nWays and means.\nHouse will 91 by rose to the way to the 9th.\nGod knows the 14th got through the 8th Smith in the 18th and lever to the 123rd.\nThey'll be titled act of an article to bench after five a total of 53 to just go to\nGeorgia annotated relating to probate.\nJudiciary House bill 92 by ropes and gains the 120 and Smith of the 18th parts of the 44th\nThomas the 21st Carson the 46th and others\nBill B. Todd will act to amend title 46 the Fisher go to Georgia annotated relating to public utilities and public transportation\nEnergy utilities and telecommunications house resolution 48 by resident of Evans the 57th miller the 62nd\nPrince of the 132nd, welcome to the 81st of resolution compensating, Mr. Mario Snitchko.\nAppropriations.\nHouse of resolution 49, my resident, that was the 57th mill of the 67th OLA, the 59th.\nPrince of the 132nd, welcome to the 81st of resolution, compensating, Mr. Michael Wolflick.\nAppropriations.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse bill 76 by rims of Powell, the 33rd, all over the second air heart of the 36th\nminute of the 94th, Hawkins of the 27th, others, a bill relating to licensing provisions regarding professional\ncounselors, social workers, marriage and family therapists.\nHouse bill 77 by rims of green of the 154th, Chokas of the 151st Samson of the 150th\nthird and year to have the 150 second, a bill relating to the number of judges of Superior\nCourts, House Bill 78 by Representative Alexander of the 66th, Bayesmore of the 69th,\nGladney of the 130th, the Nailowicz of the 42nd, Jackson of the 165th and others, a bill\nrelating to labor and industrial relations, House Bill 79 by Representative Park of the\n107th, February of the 143rd, Evans of the 57th, Clark of the 108th, Greece of the 140th\nand others, a bill relating to income taxes, House Bill 80 by Representative Lever to the\n123rd and all over with the 82nd Bill relating to general provisions regarding proof House resolution 43 by representative\nOwl the 50th limb of the 98th and all come with the 81st Barnes of the 86th clerk of the 100th and 8th and others a resolution creating the cost and\neffects of smoking joint study committee through 2nd readers.\nI know we've all missed each other with this long weekend the House will come\nback to order. House will come back to order. Reports of standing committees\nthe clerk will read.\nRepresentative Rick Jasper, the 11th District Chairman and Committee on\nTransportation submitted the following report to speak your committee on\ntransportation. It's not a consideration following Bill of the House and\nstruck the meeting report same-backed, the House of Following Recommendation\nCouncil of 52 who do pass, respectfully submit and represent the Chancellor's, the 11th District,\nChairman, that completes the reading of the Reports of Standing Committees.\nThank you, Mr. Clerk.\nNow we'll move on to morning orders.\nChair will recognize representing ten degrees of the 140th to introduce the doctor of the day.\nWe're representing Reese.\nWe're representing Reese.\nMust be at a doctor's visit so we'll move on and we'll land that to occur in just a\nfew minutes.\nWhen we're on the morning orders, we have one morning order this morning.\nChairman Hitchens, if you may, if you'll hold just for a second, I'll take the\nprivilege to get ahead of you just a little bit. Members, if you will, come to\norder. You come to order. We have a distinguished group of\nGeorgia's House will come to order, distinguished group of\nGeorgians who are making a difference down in Effingham County in\nSoutheast Georgia. We have all our folks from down our way that\nhere for Effingham, the capital will be today and tomorrow. So\nwelcome to them. And just a little bit of procedure here, Mr.\nChairman. We know that you know that we have 10 minutes for morning orders and you're the\nonly one signed up so that does not mean you have 10 minutes for morning orders. Chair\nrecognizes Chairman Hitchens for morning order. And that's nothing new when we're at home.\nJohn always makes me go first and ask you and everything else because he says I talked\nlongest and say the most and there's nothing left for him to say after after I get done.\nBut today is a special day for us for our folks from Effingham County and I think we've\ngot 180 of them signed up and I think a lot of them are up there today.\nThe balcony is pretty much full of them.\nAnd you know as I traveled around the state, I've worked in state government for 43 years\nbefore I came here and I was the Homeland Security Director for about right after 9-11.\nI traveled to the state speaking all over and everybody would ask me where Effingham County\nwas and where the city of Brinkin was nobody had much heard about it but the truth of the\nmatter is is Effingham County was one of the original eight counties in Georgia a\nreally known as St. Matthew's parish and the the first governor of Georgia John\nAdam Trutland grew up about four or five miles down the road from where I live\nand it's only taken us 246 years to get the speaker so I think everybody\nfrom Effingham County. He's pretty proud of John and all that he's accomplished.\nAnd it may have had a little impact on the fact that we we filled the balcony today and we're\nvery proud of John and wishing well and I've become known in Effingham County now as the\nother state representative from Effingham County. But and I'd be remiss if I didn't recognize\nsomebody from the dark side over there too. We have another F&M County that was\npretty prominent here for years and that's Eric Jonton. Is Eric up there with us?\nI don't think so. He was down at the reception but Eric served over on the\nother side for many years and he retired about 10 years ago but he was\npresident of the Georgia Senate and he retired and he just come out of\nretirement. He was an architect and he just come out of retirement to be the\nchief architect for the Honda plant that's going to be built in Southeast\nGeorgia so we're pretty proud of that. We have a full agenda for our people. We\nhave a reception tonight at the downtown and we we would welcome those of you\nthat wish to attend and the speaker told me I should recognize a couple of\nother people. The truth is I see the chairman of the county commission up there\nthe mayor of the mayor of\nGaiton and our county commissioners and\nschool superintendent and the Board of Education.\nBut I'm not going to be able to recognize all of them,\nbut we do have a couple special people that we'd like to recognize.\nAnd the first is the oldest African American business in F&M County.\nSmallest funeral home, we recognize them.\nThey just celebrated their 75th anniversary.\nAnd the CEO and owner, Smalls Funer Home, who was formerly the mayor of\nGaiton, Mr. Michael Garvin is here. Where's Michael? There he is.\nAnd I'd also like to recognize Effingham County High School's Dr. Jackie Brown\nPickney, who was recently received the Social Work Association of America,\nSocial Work of the Year Award for the whole United States. Would she stand please?\nWe're proud of Effingham County and all the growth. As I said, I used to go\naround and speak all over the place. People would say, where's Effingham County and\nwhat do you grow there? We had a rural county for many years. I said we used to\nto grow cotton, peanuts, soybeans, corn.\nBut today we grow subdivisions.\nMy district is the third fastest growing district in the state.\nI lost 20,000 people in redistricting.\nAnd it's a very progressive district.\nWe have Effingham County has the highest per capita income\non the coast, the lowest unemployment rate,\nand the highest public school test scores.\nWe don't have a private school in our county.\nWe have a great educational system,\nand we're very proud of it.\nAnd I yield the well, Mr. Speaker.\nYes.\nYes.\nYes.\nYes.\nYes.\nYes.\nYes.\nFor those of you who are new members,\nthat's one of Chairman Hitchens' shorter presentations as he comes to the well.\nThank you, Mr. Chairman.\nAnd certainly, welcome to everyone from F&M.\nWe appreciate y'all being here.\nNow, I want everyone to really pay attention to this next morning order\nthat we're now ready for, I think this one's special,\nbecause of the relationship between Representative Teddy\nReese and the doctor of the day.\nI'll let him tell the rest of that story.\nYes, sir.\nRepresentative.\nThank you, Mr. Speaker, to the leadership here,\nto my colleagues, it is truly an honor\nto introduce you to the doctor of the day.\nDr. Chastity Renee Reese, if you will stand up for me, please.\nDr. Reese, Mr. Speaker, Dr. Reese is the Speaker of my house.\nI gather that.\nI understand that as well.\nSmart man.\nYes, sir.\nThe sweetness in my tea and the wind beneath my wings.\nand it is truly an honor to introduce everybody\nto the better half of the resource.\nA determination to succeed has always\nbeen the driving force of chassis degrees.\nBorn in Houston, Texas, and raised in Jackson, Mississippi,\nchassis degrees is a family medicine physician\nwho works for Pete Montgomery's regional physicians\nat Northside in Columbus, Georgia.\nShe attended Dylan University\nwhere she earned a Bachelor of Science in Biology.\nShe later attended Tennessee State University\nwhere she obtained a Master's in Biology.\nLastly, she attended Edward Viag, Virginia College of\nOptiopathic Medicine on the campus of Virginia Tech.\nAfter a successful completion of her medical training\nand residency, she moved to LaGrange, Georgia,\nwhere she accepted her first full-time physician job,\nwhile there she met me.\nAnd here we are today.\nDr. Reese is an active member of Gamma Ta Omega,\nchapter of Alpha, Kapa Alpha, Sorority Incorporated,\nan active member of Columbus, Georgia Links,\nan associate member of Junior League of Columbus\nand a proud mother of Jack and Jill of America.\nShe serves our church, Greater Bill Wood,\nas a dance instructor for the youth dance group.\nDr. Reese was fortunate to dance with Avon Ailey,\nAmerican Dance Theatre in New York.\nDr. Reese was selected as the Columbus\nin the Valley magazine, Rise and Star.\nAnd as a God-freeer woman who loves her family\nhas a passion for helping the lease of these.\nWhen asked about her service as a woman\nand women shattering glass ceilings.\nDr. Restates has been a delight to work\nwith women throughout the years\nwho have selfishly given back to their communities\nto make a difference.\nThe higher we climb, the better position\nwe ought to help other little girls dream big\nand break new records.\nSo Mr. Speaker, it's truly my honor\nto introduce my wife today,\nand I say to the gentleman today\nit's not the day to fake a sickness.\nShe is married.\nMr. Speaker, I yield the will.\nWell put, representative, representative, Dr. Reese, we appreciate you being here.\nWe appreciate you sharing your husband with us.\nHe's a good friend.\nHe's going to do a great job as a representative and thank you for being here and taking care\nof us. Most appreciated. Well that completes our morning orders. We'll move on to afternoon\norders. Chair now recognizes leader Beverly for an afternoon order.\nThank you, Mr. Speaker.\nArise today to honor Tyrede Nichols, a son, father, avid skateboard enthusiast,\nfriend more importantly a man, a black man trying to get home. Tyree deserved to make\nit home. Eric Gardner deserved to make it home. George Floyd deserved to make it home.\nBut they didn't. Their fate was in the hands of officers who pledged to provide safety\nand stability to our communities, their culture\nate this man's life for dinner.\nPeter Drucker said, culture, each strategy for breakfast,\nwhich means that no matter how well designed your strategic plan\nis, it will fall flat unless your team\nshare the appropriate culture.\nOur culture, the Georgia House of Representatives,\nwill not stand utterly by, while injustice prevails.\nSo I'm calling on this House, the Georgia House\nof Representatives in general, and the Georgia House\nDemocratic Caucus specifically to hold hearings\nto pass legislation so that this tragedy does not come to our state.\nI'm reminded by Dr. King's words, and I'll read it,\nbecause I think it's very profound for this time.\nHe said in 1963, now that now the other myth that gets around is the idea that legislation\ncannot really solve the problem, and that it has no great role to play in this period\nof social change because you've got to change the heart, and you can't change the heart\nthrough legislation.\nYou can't legislate morals.\nThe job must be done through education and religion, well, there's half-truth involved\nhere.\nCertainly, if the problem is to be solved then, in the final sense, hearts must be changed.\nReligion and education must play a great role in changing the heart, but we must go on\nto say that while it may be true that morality cannot be legislated, behavior can be regulated.\nIt may be true that the law cannot change the heart, but it can restrain the heartless.\nAnd maybe true that the law cannot make a man love me, but it can keep him from lynching\nme.\nAnd I think that's pretty important also.\nSo there's a need for executive order, there is a need for judicial decrees, there is\na need for civil rights legislation on the local scale within states and on the national\nscale from the federal government.\nSo we honor Tyree Nichols' life today by agreeing that this culture, our culture, will do\nsomething so that never arrive to his day in Georgia.\nFor moment of silence, Mr. Speaker, you don't mind.\nMr. Speaker, I yield the well.\nThank you, Mr. Leader.\nIt's always meaningful when we hear the words of Dr. King.\nAnd thank you for bringing those.\nChair now recognizes Representative Carter\nto read Carter for a afternoon order.\nHere she is.\nGood afternoon.\nGood morning, for the afternoon order.\nThank you, Mr. Speaker.\nSo I've come up a few times,\nsince we've been back in session\nto talk to you guys and invite you to join us in our advocacy\nfor women, for go red, for women,\nto bring awareness to heart disease and women.\nBut today, I come sharing some sad news.\nWow, I didn't think it was gonna be this hard.\nOkay, so I am really good for an amine\nand someone who really helped me\nas I was recovering when I had my heart attack.\nAnd just someone who's really been there,\nwe all have, it's hard to find that person\nthat you could just always be authentically you.\nBut on last week, June 25th,\nthose senior, we affectionately call her Doe.\nWinfrey passed away.\nShe was a Spellman grad, mortgage professional.\nShe was working at Sonovus, wife, mother, grandmother, and as I said, an amazing friend.\nAnd her passing and the date that they set for her service reminds me why it's so important\nthat we take care of ourselves.\nHer service would be Friday, but go red for women, a woman who died of a massive heart attack.\nSo as I close, I want to just ask everyone in this room, go get checked out.\nTake care of yourselves.\nMe too.\nI'm the guilty one here to his will and on Friday her service will be at the\ndreams in a church of Atlanta where she worshiped and a few bleuages. Let's\ntake a moment of silence for my Priyendo Wimpery and remember her family in\nyour prayers.\nAmen. Thank you. Mr. Speaker, I yield the will. Thank you, Representative. Thank\nThank you for your passion for all of us on this issue, and we're sorry for the loss\nof your friend.\nChair now recognize Representative Glaze for an afternoon order.\nDon't get in the rush coming down that hill, take your time.\nWe don't want the other one to be on a boot.\nIt's a grand morning in Georgia.\nthe house, John Burns and this illustrious group of colleagues that have come to do the\nbusiness of the people of Georgia in 2023. As your new colleague from District 67, I came\nthis morning to say how good and pleasant it is for brethren to dwell together in unity.\nGod has commanded the blessing, and I'll tell you I was blessed because falling down\nthe club steps, seeing one of my representatives pray for me.\nAnother representative come help me.\nMy speaker of the house asked you guys to pray.\nIt could have been worse, but I'm back here today to say we fall down, but we get back\nup again.\nWe fall out, but we've got places to come together again.\nAnd so I say to you, we're not going to leave this place in a sombre mood.\nWhat we're going to say is that we can work together.\nThere is intersections where we bring together the best of Georgia, the best of God's people.\nAnd we do the business of getting back up again and making sure that all of us thrive\nin Georgia.\nme thrive on Tuesday till today, and I say thank you, thank you, thank you.\nYou can't keep a good lady down or a good representative down, can you?\nThank you.\nTake the elevator for a while.\nThat completes our afternoon orders.\nyou representative we're glad you're back and we know you're blessed and we're all blessed\nbut thank you that you're in that healing process.\nThe clerk will read the caption to a group of privileged resolutions.\nCommending key vehicles, manufacturing and impact on the state and recognizing January\n31st, 2023 is key to state capital.\nCommending Delta Sigma Theta sorority for its 110 years of service and recognizing that\nFebruary 27th, 2023 is delved the day at stake-up.\nCommending and congratulating Dr. Frank,\nOfficer Opia.\nRecognizing and commending, Dr. Jamal Bryant.\nRecognizing commending, Bishop Mark L. House.\nAnd commending, Bartow County's 2023,\nstar students and star teachers.\nCommending leadership comm,\nand the leadership comm class of 2023.\nRecognizing commanding small funeral homes and for other purposes that completes the reading with privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nChair, here's none and the resolutions are adopted.\nWe're ready for announcements now, so members, I'll ask you to give your attention to the member in the well.\nThe first announcement is Representative Sharon Henderson,\nRepresentative Henderson.\nThank you, Mr. Speaker.\nAs chaplain of the Georgia Legislative Black Caucus,\nI invite you to come to get prayer vitamin\nevery Wednesday morning at 9 a.m. in Club 318.\nI will be inviting as chaplain various classes\nfrom across the state, leading the prayer,\nas well as some of our colleagues\nthat are ministers and pastors in the house\nand in the Senate to lead us in prayer.\nThis is a bipartisan, non-denominational,\nholy ghost power prayer that will be conducted\nand we're calling it in the legislative black caucus\na prayer vitamin.\nWe recognize our chair, the Georgia Legislative, Black Caucus, none other than pastor representative\ncalled Gayard.\nHe's been newly elected and he's our colleague.\nCan we just give him a hand?\nMr. Speaker, we thank you and we know you have a busy schedule as well, but we would\nWe'd love for you, Mr. Speaker, to join us out of your busy schedule.\nLet's take time to visit us doing one of these fair hours.\nWe would be delighted to have you graces with your presence.\nThank you, Mr. Speaker, I yield back.\nRepresentative Henderson, I'll do that.\nThank you for the invitation.\nI knew was there anyway, but thank you.\nRepresentative Nullowitz, so you're ready for an announcement.\nRepresentative Nollowicz is recognized for the announcement.\nThank you.\nHi, everyone.\nThe Cobb County legislative delegation is meeting today at noon.\nLunch is provided.\nWe are meeting in room 514 of the LOB.\nSee you there.\nRepresentative Pennage is recognized for an announcement, thank you\nThank you mr. Speaker\ncolleagues the Fulton County Delegation will be meeting immediately after a adjournment no lunch and\nC-L-O-B\n506\nThank you, and we'll see you immediately upon adjournment. I yield the well\nThank you, Mr. Speaker, the cab delegation will be meeting right after adjournment and the capital\n16. So there is lunch provided in room 216 here in the capital building for the decapt allocation. Are you the well?\nRepresentative Gamble is recognized for an announcement. There he is.\nThank you, Mr. Speaker. Members, tomorrow morning at seven o'clock in the Judiciary Committee room,\nthe fellowship will be meeting. This is member led by partisans, so encourage all of you that\nthat have the opportunity tomorrow,\nget up early and come join us for a time of fellowship.\nThank you.\nThank you, sir.\nChairman Bonner is recognized for an announcement.\nThank you, Mr. Speaker.\nToday, in cap 403, Defense and Veteran Affairs Committee,\n1,400 for the military,\nand that's 2 p.m. for all you civilians.\nThank you, Mr. Speaker.\nLeader, illustration is recognized.\nOh, for an announcement.\nfor announcement.\nThank you, Mr. Speaker.\nThere will be a chairman's lunch in room 403 at noon.\nRoom 403 at noon, chairman's lunch.\nThank you.\nThank you, Mr. Leader.\nThat completes our announcements.\nNo birthdays today.\nWhat a day.\nIt's a great day in the neighborhood.\nNo birthdays.\nSo members, I want you to pay attention just for a second.\nAnd then we're going to be out of here.\nToday is the first day since 2020 that we've had pages in this house since 2020.\nSome of them pages please stand there in the back of the chamber, we're in the back of\nthe chamber.\nSo what a great tradition that some up and running again, thank you pages for serving\ntoday and on a German we'll be having page photos. If you have a page today if you\nmake your way down join us here and we'll have a photo with you in your\npage so we're looking forward to that a great great tradition starting back\nin the house. The majority leader is recognized for a motion. Thank you Miss\nSpeaker. I moved that this house stand adjourned until 10 a.m. on Tuesday\nJanuary 31st, 2023.\nOn the motion of the majority leader that this House stands adjourned until 10 a.m. Tuesday,\nJanuary 31st, 2023, all those in favor will say aye, opposed, no, it's very clear the\nguys have it, we are adjourned until tomorrow morning.\nThank you.\n",
  "updated_at": "2026-02-12T15:58:29.850877+00:00"
}