{
  "video_id": "lS2H2stGaj4",
  "url": "https://youtu.be/lS2H2stGaj4?t=2085",
  "title": "Georgia House - Day 7 (2026-01-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 7,
  "video_date": "2026-01-26",
  "duration_minutes": 96,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured a prayer from Rabbi Joshua Heller, who provided a thoughtful message about courage, freedom, and the responsibility of legislators. No substantive legislation was discussed.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\n- **HB 980**: Reconstituting the board of education of Early County\n- **HB 981**: Authorizing the city of Cornelia, Georgia to exercise already defined powers\n\n## Notable Moments\n- Rabbi Joshua Heller delivered an inspiring prayer, drawing parallels between the Israelites' journey to the Promised Land and the challenges facing Georgia. He called on legislators to have the courage to \"dive into deep swirling waters\" and lead the state to a better future.\n- The session opened with the Pledge of Allegiance.\n\n## Votes\nNone recorded.\n\n## Attendance\nNo quorum issues noted.\n\n## Adjournment\nThe transcript does not specify when the session adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you You you you you you you you you you you are allegiance to the flag of our country. Our chapel in this morning will be introduced by the gentleman from the 79th House District Representative Mike Wolensky. Representative Wolensky. Thank you speaker members of the House. Today I introduce Rabbi Joshua Heller. Rabbi Joshua Heller's in his 18th year as Senior Rabbi of Congregation of the Benetor and Sandy Springs. Under his 10 year Benetor has grown to be the third largest Jewish congregation in the whole state of Georgia. Rabbi Heller's congregants enjoy his caring, powerful, emotional sermons and he has an amazing sense of humor which always makes it very enjoyable. Rabbi Heller is a former president of the Atlanta Rebynical Association and is a member of the International Committee on Jewish Law and Standards. Rabbi Heller graduated from Harvard with a degree in computer science and passed on job offers from Silicon Valley to become a ninth generation rabbi. During the period after 9-11 he also served as the rabbi of the downtown synagogue in New York. One of the synagogues that's closest to the side of the World Trade Center. He and his wife Wendy are proud parents to three children to which born here in Georgia. I'm grateful and honored to call Rabbi Heller not only my Rabbi but a friend who I can always call for advice or help. Speaker Ralston, Honorable members of the house. I want to offer my profound gratitude for the opportunity to be with you today and in particular to thank Representative Wollensky for that gracious introduction. In our Jewish tradition as we read the book of Exodus we see it as our story and we read how the Israelites had been liberated from slavery in Egypt and they have witnessed ten horrific plagues and now they are free and heading towards the promised land not realizing that Pharaoh is close on their heels. They find themselves caught if you will between the devil and the deep red sea. There's a miracle the sea parts and the Israelites cross through joining together in a song of freedom. This is a story that I and members of my Jewish community hold dear and I hope that many of you do as well. I know what it means to have the pharaohs of many generations motivated by implacable hate stalking me through barren places and indeed one only needs to read the news of what happened in Texas just ten days ago to understand that that is not just an ancient story and I know that many of us here in Georgia understand the evil that was slavery and what it means for some of our brothers and sisters to be on a continued journey towards freedom and I would hope that all of us here understand what it means to be pilgrims on a journey to a better to a promised land and unfortunately all of us as Georgians understand what it means to live through a time of plagues and this is no plague of the first born the angel of death has not stopped with the old but sees as young as well and I pray that you join me in prayer and support for our medical professionals our first responders our educators and all the people whose simple honest work makes it possible for us to live our lives even as they are in harm's way because even as we see the light of dawn some of them have yet not yet emerged into light standing here today all Georgians know what it means to be caught between the pharaohs of our past forces that seek to take away cherished rights and freedoms and a deep sea ahead over which there seems to be no bridge in this moment of darkness turning to dawn of a sea about to part I would like to offer a word of hope to you our Jewish tradition a legend teaches us that as the Jews stood at the sea calling to God praying to God for help the prayers the supplications of Aaron the priest accomplished nothing the staff of Moses man of God had no effect created no path 12 tribes each sought their own route through raging waters it was only when one man not shown benamina dav stepped into the water not just up to his ankles not just to get his knees a little damp not just up to his chest or his neck not until the waters reached his nose his very soul no shown had the courage to dive in and the waters made a dry path for the Israelites to pass through what courage we must have my friends what courage must we have to leave behind pharaohs of our past what courage must we have must you have to have come here to have volunteered to service you leave homes and jobs and families and communities to serve the better the betterment of our state what courage we must have to leave behind the pharaohs of our past we must dive into deep swirling waters we must earn the right to celebrate on the other side when the Israelites finished crossing the sea they sang a song and it was a nation that sang a song not a song of unity but a song of harmony of call and response there is a great song of celebration that we have yet to sing but only if we cross and sing together let us pray members of the legislature I offer thanks for the service that each of you provide I pray that God grant wisdom to each of you I will not pray that you agree on all matters for that would surely be a false prayer but I do pray that you each come to see your work as holy you are guided by your faith your principles your integrity to bring a listening ear a caring heart a discerning soul and a mouth that speaks only truth I pray that you are able to seek the good of every resident of this state whether you see them as the least or the greatest and I pray that you are leaders are like our biblical hero not shown I do not ask that you walk on water but I ask that you lead us through it by example and make sure that each of us that every resident of our state every citizen every dweller is guided on a path to freedom and the promised land that God has promised each of us and let us say amen I pledge allegiance to the flag of the United States of America and to the Republic for which it stands one nation under God indivisible liberty and justice for all doorkeepers will unlock the doors Chair recognizes chairman Hogan the chair of the committee on information and audits thank you mr. Speaker your committee on information and audits has read the journal of previous legislative day and founded to be correct and furthermore mr. Speaker what is the meaning of life to be happy and useful alley llama representative Kelly help you with that one okay chairman Hogan the chair of the committee on information and audits reports at the journal of the previous legislative day has been read and found to be correct is there any objection to the confirmation of the journal the chair here's none in the journal is confirmed the clerk will read the resolution establishing the order of business for the day mr. Burns on 59th miss volume be established as the order of business and the first part of the period unanimous consensus introduction of bills and resolutions first reading in reference of house bills and resolutions second reading of bills and resolutions reports of standing committees third reading and passage of uncontested local bills and resolutions morning orders is there any objection to the adoption of the resolution establishing the order of business for the day the chair here's none in the resolution is adopted first reading of bills and resolutions the clerk will read hospital 980 by represent green and 151st bill be taught on active and enact reconstituting the board of education of early camp the intergovernmental coordination hospital 981 by reps and advantages of the 10th and Erwin of the 28th bill be taught and act authorize the city of Cornelia Georgia to exercise already development and other powers under governmental coordination hospital 982 by reps and green and 151st will be taught and act to amend the acting and title enact provide education districts for Calhoun County Board of Education intergovernmental coordination 983 by reps of Campbell 171st bill be taught on act to amend the act providing for board of commissioners and Mitchell County intergovernmental coordination hospital 984 by reps and Jones the 53rd Scott of the 76 Davis in the 87th Gilligan one of the 24th bill be taught an act to amend chapter 4 title one of the fish go to Georgia annotated relating the general provisions regarding holidays state planning and community affairs hospital 985 by reps and Williams the 168th and Stevens 164th bill be taught an act to amend the act creating the board of commissioners of Liberty County the intergovernmental coordination hospital 986 by reps of columns and 68th next to the 69th Smith and 70th Smith and 18th bill be taught an act to amend the act relating the board of education of school with superintendent of Carroll County School district intergovernmental coordination hospital 987 by reps and a buckner the 137th checkers on 32nd bill be taught an act to amend the act reconstituting the Maryweather County Board of Education intergovernmental coordination hospital 988 by reps and a buckner the 19th mom to honor the 17th gravity the 67th Alexander the 66 Kelly the 16th and others bill be taught on act to provide a homestead exemption from Paulton County ad valorem taxes intergovernmental coordination hospital 989 by reps of Smith the 18th and Kelly the 16th bill be taught an act to amend the act provide for the election of members of the board of education of Harrison County intergovernmental coordination hospital 990 by reps and a Williams the 145th bill be taught an act to amend the act creating the board of commissioners of Baldwin County intergovernmental coordination hospital 991 by reps and a buckner the 61st cows to the 50th base more the 63rd Thomas the 65th Evans the 57th and others bill be taught an act to amend the act provided for the number of members and for the election members of the board of education of Fulton County intergovernmental coordination hospital 992 by reps and a Williams the 145th itch and so the 161st gamble of the 15th hollow of 32nd gunt through the 8th bill be taught on act to amend Article 2 chapter 7 and title 48 in fish school in Georgia annotated relating the impositionary computation exceptions and credits for ace stated ways in Maine hospital 993 by reps of Williams the 145th pitching zone to 61st Park 1147 followed 32nd gunt or the 8th bill be taught an act to amend code section 16 10 32 of the fish go to Georgia annotated relating the attempted murder judiciary non-civil hospital 994 by reps and a Wilson of the 80th canon of the 58th 40th tax in the 64th Doug was the 78th bill be taught an act to amend part 6 particle 1 of chapter 2 a total 8 of the fish go to Georgia annotated relating elevators dumb waiters and escalators regulated industries hospital 995 by reps and boating the 62nd Lewis War of the 100th Nelson 125th Holly the 111th Bernal the 77th and others a bill of be taught an act to amend title 34 the fish go to Georgia annotated relating the labor and industrial relay industry and labor hospital 996 by reps of carpenter the 4th scogins the 14th hill of the 3rd Smith the 18th jasper to the 11th will be taught an act to amend title 43 the fish go to Georgia annotated relating the professions and businesses regulated industries hospital 997 by reps and a Watson 170 second England 116th Burns 359th Buckner and 137th hatchet of the 150th and others bill be taught an act to amend part one of our two chapter 5 a total 48th fish go to Georgia annotated relating property tax exemptions ways and mains hospital 998 by reps of carpenter the 4th bombed out of the 17th fry the 118th columns the 68th and gulla to the 19th will be taught an act to amend article 3 a chapter 4b a total 43 the fish go to Georgia annotated relating the ticket brokers regulated industries hospital 999 by reps of control of the 22nd plant in the 75th more than 90th clerk 1147th Bentley the 139th and others bill be taught an act to amend title 20 the fish go to Georgia annotated relating to education education hospital 1000 by reps and gunner the eighth rich the 97th scogins the 14th Thomas the 21st Williams the 145th bill be taught an act to amend chapter 19 in title 31 of the fish go to Georgia annotated relating the control of rabies agriculture and consumer affairs hospital 111 by the represent Smith of the 18th gungner of the eighth scogins the 14th building totem act to amend code section 33 35 to the fish go to Georgia annotated relating to definitions for prepaid legal services jinger sherry hospital 1000 to by reps and Smith of the 18th gambler of 15th Williams the 168th scogins the 14th McDonald the 26th and others bill be taught an act to amend article 3 a chapter 3 a total 50 the fish go to Georgia annotated relating state symbols state planning and community affairs hospital 1000 three by reps and a violin of the 40th and Wilson of the 80th bill be taught an act to amend part 6 mark 17 in chapter 2 a total 20 the fish go to Georgia annotated relating health insurance plans insurance house bill 1000 four by reps and the main of the 56 columns the 68 Smith the 133rd and Duke the 104th 51th bill be taught an act to amend title 20 the fish go to Georgia annotated relating education higher education house bill 1000 five by reps and a mainer the 56th density the 13th camp alone 31st limb of the 99th Mitchell the 106th bill be taught an act to amend part 3 of article 16 to chapter 2 the total 20 the fish go to Georgia annotated relating student health and elementary and secondary education education house bill 1000 six by reps and a dickie the 140th bill be taught an act to amend and act creating to the board of education Crawford County the entry governmental coordination as well 1000 seven by reps and a dickie the 140th bill be taught an act to amend and act creating the board of commissioners Crawford County the entry governmental coordination house bill 1000 eight by reps and a Hawkins the 27th Newton the 123rd density the 13th hatched the 150th lot of the 120 second and others bill be taught an act to amend article 11 chapter 3 a total 20 in chapter 9 a total 30 the fish go to Georgia annotated relating to higher education savings plans budget and fiscal affairs oversight house bill 1000 nine by reps and Jones the 25th bill be taught an act to amend title 40 the fish go to Georgia annotated relating motor vehicles and traffic motor vehicles house bill 1010 by reps and gains the 117th weed hour the 119th prior the 118th bill be taught an act to amend title 45 with the fish go to Georgia annotated relating to public officers and employees state properties house resolution 620 by reps and a house into the 170th resolution honoring the life of mr. Charlie D. Rogers and dedicated intersection in his memory transportation house resolution 621 by resident of house into this 170th resolution honoring the life of lieutenant Hugh L. Moore and dedicating a bridge in his memory transportation house resolution 622 by rest of Corv. 174th hatched in the 150th Stevens the 164th St. John's in the 180th and Ridley the 6th resolution recognized in February 2022 as 6th Lexi a day at the state cap special rules that completes first readers second rating of bails and resolutions the clerk will read house bill 856 by reps and a scoffield of the 60th Scott of the 76 Davis of the 87th for now the 77th Park of the 101st and others bill relating to general provisions regarding the general assembly house bill 858 by reps and a scoffed of 176 by rozavom Challenger Act housesmount 859 leg than anywhere other than his Obviously 58 to you do not're moving of the 113th Bill relating to medical assistance, House Bill 938 by Representative Jones of the 53rd Bill relating to holidays and observances. House Bill 939 by Representative Maynard of the 56th Cantrell of the 22nd Paris of the 142nd Jackson of the 128th Hagen of the 156th and others of Bill relating to general provisions relative to the rights and privileges of patients. House Bill 8940 by Representative Scott of the 76th Davis of the 87th Scofield of the 60th and per now of the 77th Bill relating to Will's House Bill 941 by Representative McLeod of the 105th Beverly to the 143rd Scott of the 76th McLeod of the 100th. Based more of the 63rd and others, the Bill to comprehensively revise elections of voting by repealing act number 9, House Bill 942 by Representative Wade of the 9th and Ralston of the 7th Bill to amend and act creating Board of Commissioners of Dawson County. House Bill 943 by Representative Wade of the 9th and Ralston of the 7th Bill to amend and act providing a board of education of Dawson County. House Bill 944 by Representative Holmes of the 129th Bill to amend and act creating Board of Commissioners of Jasper County, Ask Bill 945 by Representative Holmes of the 129th Bill to amend and act creating Board of Commissioners of Danish County. House Bill 946 by Representative Holmes of the 1129th Bill to amend and act providing for the election of the members of the Board of Education of both County, Hospital 947 by Representative Holmes of the 129th Bill to amend and act palace to the Board of Education of Jasper County, House Bill 948 by Representative Rhodes of 120thº and Rev. of the 133rd Bill to amend and act of Wilkes County. House Bill 949 by Roads of the 120th to build to amend an act creating board of commissioners of Oklahoma Thorpe County. House Bill 950 by Roads of the 120th to amend an act providing for the election of members of the Board of Education of Oklahoma Thorpe County. House Bill 951 by Roads of the 33rd to build to amend an act providing board of commissioners of Elbert County. House Bill 952 by Roads of the 33rd to build to amend an act reconstituting and creating the Board of Education of Elbert County. House Bill 953 by Roads of the 33rd to amend an act creating the Board of Commissioners of Lincoln County. House Bill 954 by Roads of the 33rd to amend an act providing for the election of members of the Board of Education of Lincoln County. House Bill 955 by Roads of the 148th to amend an act creating board of commissioners of Christmas County. House Bill 956 by Roads of Williams of the 148th to Logan of the 179th Mathes of the 144th to the 162nd to build to reconstitute the Board of Education of Christ the County. House Bill 957 by Roads of the 188th to amend an act to reconstitute the Board of Education of Candler County. House Bill 958 by Roads of the 188th to build to amend an act creating board of commissioners of Candler County.\n\nBill 959 by reps of Smith with 133 Smith the 134th Buck from the 137th Bill to a midnight relating relating to the board of commissioners Harris County House Bill 960 by reps of the 33rd bar the 130 third dollar for the 82nd Wilson and 80th Abel with lady to the governor House Bill 961 by reps of frustration 104th all of the 82nd Williams and the 115th Smith of the 18th Hatchet of the 150th and others Bill relating to reduction in proportion of award or bar of recovery House Bill 962 by reps of Scott in the 76th Beverly of the 143rd Davis of the 87th Carter of the 92nd Bill relating to general provisions bill to two dangers instrumentalities and practices House Bill 963 by reps of cash of the 150th Stevens of the 164th per shed of the 176th Bill related to control substances House Bill 964 by reps of the Maynard of the 56th control of the 22nd Lim of the 99th Wilkerson of the of the 38th Sharper of the 177th Bill fighting to local government budgets and audits House Bill 965 by reps of Maynard of the 56th Jackson of 128th Thomas of the 65th Jones of the 53rd Mallow the 163rd to build relating to fair business practices Act House Bill 966 by reps of Thomas of the 65th Drenner of the 85th Evans of the 83rd Jones of the 53rd and Buckner of the 137th Abel with lady to electoral service House Bill 967 by reps of Scott of the 76th Jackson of the 64th Davis of the 87th Abel with lady to fixing its sentence House Bill 968 by reps of Scott of the 76th Davis of the 87th Scofield of the 60th Sharper of the 177th the cloud of the 105th the Bill related to fire fighter standards and training House Bill 969 by reps of Smith of the 18th Williams of the 148th Urban of the 28th Gaines of the 117th Gamble of the 15th Bill related to insurance holding company systems House Bill 970 by reps of Scott of the 76th Davis of the 87th Scofield of the 60th Williams of the 168th Bill related to veterans benefits House Bill 971 by reps of Scott of the 76th by the 114th Scofield of the 60th Davis of the 87th cloud of the 105th Abel with lady to the duties and administrative office of the courts House Bill 972 by reps of the built in a 112th Gamble of the 15th Powell of the 32nd Collins of the 60th Jackson of the 128th and others Abel with lady to licensing provisions House Bill 973 by reps of the Collins of the 68th Hitchens of the 160th Powell of the 32nd and Lums of the 12th Abel with lady to governor's office of highway safety House Bill 974 by reps of Galut of the 19th Gamble of the 8th Skoggins of the 14th Jones of the 25th Holtum of the 81st and others Abel related to recreation and registration of deeds and other instruments House Bill 975 by reps of Skoggins of the 14th Workhies of the 157th Chukets of the 138th Roads of the 120th Green of the 150th First and others Abel related to elections and primaries House Bill 976 by reps of Scofield of the 60th Jackson of the 120th Scott of the 76th Buckner of the 137th Bentley of the 139th and others Abel related to agriculture House Bill 977 by reps of Scofield of the 60th Kirby of the 114th Hugh believe the 136th Carter of the 92nd Scott of the 76th and others Abel related to prohibition of aged discrimination in employment House Bill 978 by reps of Smith of the 70th Stevens of the 164th England of the 160th Green of the 150th and Gen.C of the 13th Abel with lady to county boards of tax assessors House Bill 979 by reps of Mallow the 163rd Matt Holtum of the 81st Divins of the 160th Evans of the 57th Lim of the 99th Abel with lady to imposition rate cuptation exemptions from income taxes House Resolution 594 by reps of Smith of the 70th Stevens of the 164th England of the 116th Green of the 150th First Density of the 13th a resolution for brezzling amendments to the Constitution of the Seder Georgia says to provide the county municipal governing authorities shall be authorized to grant temporary tax relief House Resolution 595 by reps of Evans of the 83rd Washburn of the 111st Buckner of the 137th Thomas of the 21st Thomas of the 65th and others Resolution are to be Georgia Building Authority to plan for sustainable material management and safe drinking water on the capital campus properties Senate Bill 335 by senator Gute to the 51st Bill to amend and act creating the Board of Commissioners of Lumpkin County Senate Bill 336 by reps and a block out of the 20th Abel to amend and act revising and restating the law relating to the Blackly County Board of Education 3 second readers Reports of standing committees the clerk will read I should have done Parsons to the 44th District Chairman on Committee on Energy Utilities and Telecommunications submitted the following report To speak to your committee on energy utilities and telecommunications So that would consideration following bills of the House And an instructed mean to report the same back-to-the-thousand filing recommendations House Bill 159 do pass by substitute respectfully submitted representative Don Parsons of the 44th District Chairman Representative Sharon Cooper the 43rd District Chairman on Committee on Health and Human Services submitted the following report Misspeak your committee on Health and Human Services As that under consideration to following bills of the House Instructed me to report the same back-to-the-thousand filing recommendation House Bill 752 do pass by committee substitute respectfully submitted reps of Sharon Cooper the 43rd District Chairman Reps. Jan Taker's the 160th District Chairman of Committee on an Intergovernmental Coordination Local submitted the following report And to speak to your committee on intergovernmental coordination locals that under consideration to following bills of the House And it's instructed me to report the same back-to-the-thousand filing recommendations House Bill 89 do pass by substitute House Bill 909 do pass House Bill 920s and one do pass House Bill 922 do pass House Bill 935 do pass House Bill 936 do pass respectfully submitted Jan Taker's the 160th District Chairman Representative frustration in the 104th District Chairman on Committee on Judiciary submitted the following report Misspeak your committee on Judiciary's Entitlement consideration Following bills of the House is instructing me to report the same back-to-the-thousand filing recommendations House Bill 56 do pass by committee substitute House Bill 624 do pass by committee substitute House Bill 961 do pass respectfully submitted reps and an frustration 104th District Chairman That completes the reading of the report to standing committees House All right, we're going home now to the local calendar Going on to the local calendar third reading and passage of uncontested local bills If there is no objection Oh We have a procedure here that says return your lie down Do you see do you have a button What what is your objection? I object to the calendar the local calendar the The way of the structure You Yet representative I need for you to clarify I'm not sure I understand your objection Are you objecting to the local bill for hall county or troop county or Douglas county or Katusa county But speaker I'm a object into the all the bill all the local bills the way they obstruct you know that they're constructed The way they're structured Yes, miss speaker The the only objection that you would Be recognized for as if you wish To pull off a local bill and have it voted on separately There is no objection to the structure of a bill Thank you miss speaker. I didn't realize that I just thought that maybe since when that bill is pulled off and no one had anything to say about Local legislation. I didn't know it was any structure that you had to have So Yeah, yeah, that bill was not even on the calendar representative It was in committee Yes Thank you. Thank you. So do you still have a motion or you want to withdraw that motion at this time Miss Miss bigger. I'm I'm contemplating that I Do withdraw my you know me to call too much time on you here No, it is just you know just contemplating it But I do withdraw my objection All right Jumman has withdrawn his objection if now if there's no objection We will vote on the local calendar as a whole with a recorded vote Hearing none it is so ordered the clerk will read the local calendar House bill 89 by substitute by represent Hawkins of the 27th all county House 1 909 by rubs and a mix of the 69th Troop county House 1 9 21 by rubs and a valix and her the 66 Douglas County House 1 9 22 by rubs and a valix and her the 66 Douglas County House 1 9 35 by rubs and a pillow the third Coutusa County House 1 9 36 by rubs and a pillow the third Coutusa County you Is there any objection to the previous question being ordered on the local calendar. The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills. The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. ∂ ∂ have all members voted? Have all members voted? If so, the clerk will lock the machine on the bills on the local calendar. The eyes are 156. The nasal zero. These bills having received the requisite constitutional and the legal calendar are therefore passed for what purpose does Chairman Tancersley rise? Mr. Speaker, I rise to make a motion. State your motion. I make a motion that we immediately transmit the local calendar to the Senate. The chairman of the Intergovernmental Coordination Committee has moved that the bills on the local calendar that were passed today be immediately transmitted to the Senate. And it is their objection. There is objection. Does the lady move? Does the lady move? The lady moves. All those in favor? Listen, listen up now. If you're in favor of the motion to immediately transmit, you will vote aye. If you're opposed, you will vote no, and the clerk will unlock the machines. The clerk will lock the machine on the bill. Here is the vote. The clerk will make a motion. The clerk will unlock the machines. The clerk will lock the machines. The clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the ladies' motion. The eyes are 112. The nays are 44 and the local bills have been immediately transmitted to the Senate. The clerk will lock the machine on the ladies' motion. What purpose is representative park rise? Mr. Speaker, I rise to make a motion. State your motion. I make a motion to move House Bill 872 and House Bill 873 from governmental affairs to intergovernmental coordination. The author of the bill and all the signers agree that chairpersons for both committees do not agree. The chairpersons for neither committee agree to it. Is that correct? That is correct, Mr. Speaker. All right. The gentleman's motion is that notwithstanding the objection of both of the chairman that House Bill 872 and 873 would be moved from governmental affairs to intergovernmental coordination. All those in favor of the motion will vote aye. Those opposed to his motion will vote no. And the clerk will unlock the machines. What purpose does chairman Darlene Taylor rise? I object to the motion. I think he stated that you did. We'll give representative parks some credits there, okay? Have all members voted? If all members voted, if so, the clerk will lock the machines on the gentleman's motion. The eyes are 65, the nays are 90, and the gentleman's motion has failed. Okay, that's going to be all we do in the local calendar today. We're moving on to morning orders. Morning orders. If you have a morning order, please come to the front. Morning orders will be limited to one minute per member. The chair recognizes representative, chairman Ken Trell from morning order. Thank you, Madam Speaker. Wow, loud. Hey, colleagues, it's way past time for Georgia to take a fresh look at how we educate our children. Even when public schools do an excellent job, there's always going to be a small percentage of students who do not perform well in a traditional classroom setting. This means we must focus on funding students, not systems, because one size does not fit all, especially when it comes to education. Should a family, should a low-income family be stuck in a chronically underperforming school? Should a student who's being bullied be forced to stay in a school where they can't learn? The answer is no. Yesterday, I introduced House Bill 999. This is school choice for all. School choice for all. Georgians want school choice. All the polling shows it. In fact, 77% of parents who send their kids to public school favor school choice. This is a bipartisan bill. It's sponsored by three Republicans and three Democrats so far. So I urge you to support school choice in Georgia this year. Thank you. The director recognizes Representative Setsler and the co-delegation for a morning order. Ladies and gentlemen, the House, I'd like to ask you to rise if you would please. We lost a friend of Cobb County yesterday. Colonel Michael H. Boyce, U.S. Marine Corps retired. The four-year chairman of Cobb County Board Commissioners passed away yesterday. He had served as the chair of Cobb County from 2000, being elected in 2016, served for four years and left office in early 2021. Chairman Boyce was born in California, 1949, graduated the University of Notre Dame in 1971, where on the tail end of the Vietnam War, he was commissioned as the second lieutenant in the United States Marine Corps. He served our country for 30 years, left active duty in 2001, and again, as a citizen, ran for office and was elected county chair in 2016. His wife, Judy, three kids, five grandkids, carry on Mike's heart in his tradition. He passed away yesterday after having suffered a first of many strokes about a week ago, was actually up in South Bend, Indiana, had been in a residential fellowship at the University of the University of the Leadership Mentor, in a graduate program there with his wife. It had a year there. It was really half of the time of his life mentoring young people. One of the ones to say about Chairman Boyce briefly is just the joyful spirit that he represented. As many of our military members are, they are able to be joyful even in hard times. I think those that know him recognize that in the face of the harshest criticism, he was always just such a friendly gentleman. Mike was a person in representing Cobb County that served people, looked after and cared people, cared for people, even they would never vote for him that didn't share his political philosophy, but just that kind of gentleman. That servant's heart just came through. Last thing I know Madam Chair, we were running it at a time. I will tell you though, just to give you a picture of the man, when he was running for office in 2016, he had had a mission trip scheduled to Romania. He was going to go for two weeks. He got through the primary, was in a primary runoff and that's six, eight week period between his primary and his primary runoff. We had a two week mission trip scheduled. He did the mission trip. He did cancel the mission trip because he had a political contest ahead of him. He focused on what was important in life. And I just want to celebrate him today and as we think about this young man that served, he was 72 years young, left us too soon, but we're proud of the time we had with him. We'd like to thank him and his family for the life he lived and I'd like to recognize us all recognizing the moment of silence. Thank you. Chair recognizes Representative Chocas for Morning Order. Thank you Madam Speaker. Good morning everyone. On your desk we've placed a book by Barry McCarthy. This is the book. It's titled Small Business Revolution. How Honors and Entrepreneurs can succeed. Mr McCarthy is the CEO of Deluxe Corporation. You know the Deluxe Corporation because it actually prints the checks that they use in our checking accounts. Most of you don't know that approximately 70% of their business deals with payment processing that Georgia accounts for over 80% of the payment processing business in the United States. Deluxe recently opened a facility in Georgia and created over 700 jobs. Mr McCarthy's book is listed as the number two best seller on the Wall Street Journal list of books. His company supports over four million small businesses annually. Mr McCarthy was a presenter at yesterday's Small Business Development Committee meeting. And thank you. Chair recognizes Representative Scofield for Morning Order. Good morning Madam Chair and colleagues. Today is Mental Health Day at the Capitol. Most of 40,000 children and over 30,000 adults are impacted by or living with some form of mental health disorder. They are our family members, constituents, colleagues and some of us in this chamber are battling mental health issues. When one suffers we all suffer. Mental health affects every aspect of our lives. If you need help, dial 988. Although mental health has always been a pressing issue in certain communities, I am very glad to know that this body has decided to make mental health a priority, getting people in organizations the health that they need. To the mental health advocates, thank you for being here today. Chair recognizes Representative Kennerd for Morning Order. As mentioned, it is mental health day at the Capitol and it takes on more meaning this year because we are having such momentum towards a meaningful legislation this year. I want to thank the speaker and Chairman Oliver and Chairman Jones for working across the aisle to do something for Georgia in this regard. Because of mental health day, it's also criminal justice reform day because the largest mental health service provider in our state is our Georgia state prisons and county jails. We have effectively criminalized mental health but when we supported on the front end, we decriminalized it on the back end. Because of mental health day, it's also substance abuse disorder day. These two things are almost connected always addiction and substance abuse and mental health. The overwhelming reason why people abuse drugs and alcohol is because there's an underlying mental health diagnosis that's going untreated. So there's all kinds of wins going on today because it's mental health day and I just thank you for being a part of that. Thank you, Madam Chair. My name is Linda. My name is Linda Suasai. Number of my people. That's awesome. Chair recognizes Representative Nex for Morning Order. Thank you, Madam Chair. Freshman legislators, please listen up. We're going to have a mandatory ethics training meeting this afternoon at, I mean, tomorrow afternoon, tomorrow afternoon at 1 o'clock, room 216 in the Capitol. If you were elected in 2020 or sometime later, you need to come to this meeting. We will have members of the Georgia government, transparency and campaign finance commission there to both give you a briefing and answer questions. We'll have members of legislative council there to brief you and answer questions. So it's very important if you're a freshman legislator that you attend again. It's tomorrow, January the 27th at 1 o'clock in room 216 in the Capitol. Thank you, Madam Chair. Chair recognizes Representative Smith for Morning Order. Thank you, Madam Speaker. What all members of the third congressional district please stand, third congressional district? You've suffered a great loss. I want to tell you, life is fragile right now. February of last year, Russ Carriker was sworn in as DOT board member for District 3. He passed yesterday. The day he was sworn in, the very next day, he was diagnosed with stomach cancer. Everybody smart made a comment one time and I would really like it. He says either elite or you're not. Russ was a lead. He played it all over football, linebacker played there at the same time as Bo Jackson did. But if you knew Russ, you knew that his whole life was revolving around his faith in God, his family, this country and everything that he could do to make this community better. He was one of these young men that he was only 57. He was one of these young men that some of us older ones were helping to give the mantle too to take care of the leadership in Columbus. He was one that could probably be elected mayor or just about anything he wanted to do. So his wife, Patty and his daughter, Avery, please keep them in your prayers and just skip a moment of silence for Russ. Thank you. Thank you. Chair recognizes Chairman Cooper for a morning order. Thank you Madam Speaker. On your desk you have a flyer and I would like to make you aware of the Georgia radio reading service. I hope that not only will you become aware of this service but you will put it out for your constituent. We know of over 200,000 Georgians who have trouble seeing if they can see it all. We are an aging state and as you age more and more people lose their ability to see. And these services help keep a sightless person in contact with their community by having their local paper read to them or being able to have magazines or books also read. Please take it and make this service available to your constituents. Thank you very much. Thank you Madam Speaker. That concludes morning orders. The clerk will read the caption to a group of privileged resolutions. Honoring the life and memory of Jeffrey Allen Parker. Honoring the life and memory of Robert E. Bob Trivel.\n\nhonoring the life and memory of Dennis Howard Strickland. Recognizing commending Dr. Thomas Evarard at Calk upon the grand occasion of his retirement, recognizing commending Hans Lee Cruz Lyons, recognizing commending, the city of Dunwoody for earning the City of Freedom Seal from the Safehouse project, recognizing January 19, 2022 as a holistic world Christian fellowship leadership summit 2022 day. Recognizing the and commending the City of Dorville on the occasion of its 150th anniversary, recognizing commending the Reach Georgia Scholarship program upon the occasion of its 10th anniversary, recognizing commending family and consumer sciences, recognizing May 2022 as bone health and osteoporosis awareness month in the state of Georgia, recognizing and commending clotted forms. Recognizing February 18, 2022 as a National Care Giver Day, recognizing commending Melvin Bagley on the Outstanding Public Service as the first election supervisor for Bartow County, recognizing commending Chief Dan Flynn and for other purposes, that completes the reading with privileged resolutions. Is there any objection to adopting the privileged resolutions? The chair here's none and the resolutions are adopted. There are some announcements. If you have an announcement, please come to the front and I'll call on you. The chair recognizes Representative Carter for a morning for announcement. The chair will come back if you'll come on down to the front. The chair recognizes Representative Allen for an announcement. Thank you. The Cobb County delegation will meet in room 515 upon a German lunch will be served, 515, exe lobe. Chair recognizes Representative Carter for an announcement. Thank you, Madam Speaker Broteon. Good morning everyone. Every year I come and ask you to join me in advocating for women in heart disease. So on Thursday, February 3rd, we're asking everyone to wear red to and our unity to bring awareness. And Friday, the first Friday in February is always the annual Go Red for women and we'll host it in a district. And one of the things is we've continued to stress is that heart disease is the number one cause in death with women. And we want to do everything that we can to help women live. And for those of you that haven't seen me in a while and maybe like who is that, I'm 50 pounds down. So yes, my heart is feeling good. Thank you, Madam. Chair recognizes Representative Tankersleaf for an announcement. Thank you. Thank you. Please listen up. We're all concerned about local legislation. I've been notified that many, many local redistricting maps have been forwarded to legislative council. I urge each of you to check your folders and legislative council to see if you've got things in there that are ready for you to move on. So some of you, some of those maps that have been forwarded over here already have the bill drafted. That's a good thing. Others, the maps are there, but the local legislation has not been drafted. So you want to be sure to check your folders and legislative council. Thank you. Chair recognizes Representative Green for an announcement. Thank you, Madam Speaker. The State Properties Committee will meet today and room 4.3 at 3.30. Again, State Properties, room 4.3 at 3.30. Thank you. Chair recognizes Representative Watson for an announcement. Thank you, Madam Speaker. Two quick announcements. Rule Caucus will kick off today at 12 o'clock in the Department of Agriculture 201. So we'll be back over there this year. So I look forward to seeing everybody there for Rule Caucus. And then also the Appropriations Subcommittee of General Government will meet at 1 o'clock today in 4.15 and there will not be a Zoom option for that. So I hope to see everybody there in person. Thank you. Chair recognizes Representative Gullock for an announcement. Thank you. Just a quick announcement for Governor LeFaire's Standing Committee will meet today at 2 o'clock, room 406 in the CLOB. Thank you. Chair recognizes Representative McLeod for an announcement. Thank you, Madam Protemp. I just want to let everybody know there's a new number for the Suicidal Prevention Hotline. It's 988. The Suicidal Prevention Hotline is 988. Thank you. Chair recognizes Representative Evans for an announcement. Thank you, Madam Chair. The Decad delegation will meet today at noon via Zoom. You can pick up your lunch in room 216 right after adjournment. Thank you. Yeah. House Majority Leader is recognized for a motion. Thank you, Madam Speaker. I move that this house stand adjourned until 10 a.m. 10 a.m. Thursday, January 27th, 2022. On the motion of the Majority Leader, that the House stands adjourned until 10 a.m. Thursday, January 27th. All those in favor will say aye. All those opposed will say no. The aye is clearly have it and the house stands adjourned.",
  "updated_at": "2026-02-13T07:20:39.739378+00:00"
}