{
  "video_id": "LSQO8OtEXqc",
  "url": "https://youtu.be/LSQO8OtEXqc",
  "title": "Georgia House - Day 2 (2026-01-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-01-14",
  "duration_minutes": 84,
  "summary": "# Georgia House - Day 2 (2026-01-14)\n\n## Overview\nThis legislative session featured a speech from guest chaplain James West, a former NFL and CFL football player. The session focused on the importance of faith, purpose, and perspective for the legislators.\n\n## Key Actions\nNo substantive legislation was passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Guest chaplain James West delivered an inspirational speech emphasizing the role of faith, purpose, and perspective for the representatives.\n- West discussed his own journey of overcoming challenges and finding his calling as a spokesperson for the Fellowship of Christian Athletes.\n- He encouraged the legislators to see themselves as \"relational, encouraging, purpose driven, relatable, even minded, sympathetic, eager, neighborly, tangible, amazing, talented, ingenious, valuable, encouraging, [and] service[able].\"\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum was present, with members reporting to the floor for the morning roll call.\n\n## Adjournment\nThe session was adjourned. The next session is scheduled for 2026-01-15.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe hour of convening having arrived, all members will please report to the floor and\ntake their seats, all members will report to the floor of the house, the clerk will ring\nthe bell.\nAll members will please report to the floor of the house. We're about to have the morning roll call.\nWe're going to have the morning roll call. Now, all members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the machines.\nkeepers will please close the doors and keep them closed. Well good morning. A lot of energy\nin that. I like that on a rainy day. We're going to begin our day with Scripture reading\nand prayer by the chaplain after which we will pledge allegiance to the flag of our country.\nyou're in for a real treat this morning with our chaplain. Let me say a couple of\nthings that he's not. He's not a minister. He's a lay minister or is he and I\nrefer to him? He's ministered light. But he is a he's a he's a great human being\nand he and I became friends. I met James West last summer in Blue Ridge and you know we don't\nget very many professional football players that visit up there and I was having dinner one night\nand somebody said that guy over there was a pro football player. I said what's his name? I don't\nrecognizing. They said his name is James West. I said never heard of him. He had never heard\nof me either. So we visited and then we did what people do in the 21st century. We went\noff and googled each other and read everything there was to read and then we still became\nfriends. But he has been, he has become a friend that I feel like I've known for life because\nhe is one of the most positive people. He's a person of encouragement and strength. And\nI can't tell you how much I have appreciated knowing him and being his friend. He was\nborn in Fort Worth, Texas, but was raised in Houston. He attended Texas Southern University,\nvery played on the TSU football team, but that wasn't exactly a smooth road. I'll let\nhim tell you about that. But after he finished his studies at Texas Southern, he went on\nto play in the NFL for the Oakland Raiders and for the St. Louis Cardinals, but he also\nplayed for a number of years in the Canadian football league with the Calgary Stampeaters\nbut most prominently with the Winnipeg Blue Bombers.\nWho could not like a team called the Blue Bombers?\nHe is a led them to the Grey Cup, which is like the Lombardi Trophy for the NFL, and was\ninducted in 2016 to the Canadian Football League Hall of Fame.\nWhen he finished playing, he coached, it stops around the country, including Oregon State\nUniversity and Clark Atlanta here.\nAnd today he has found his real calling in life.\nHe is a spokesperson, servant, and minister-lite for the Fellowship of Christian Athletes.\nAnd I can tell you that the work he's doing with young men and women around Metropolitan\nAtlanta is truly amazing.\nHe's joined today by his lovely wife, Gina.\nGina, please stand and let him say hello to you.\nThey have one daughter and four grandchildren,\nand they live in Buford.\nPlease make welcome, Mr. James West.\nThank you, sir.\nThank you, sir.\nOoh, man, I'm so excited about being here, man.\nY'all gotta slow me down.\nWow, I'm 64 years old,\nbut I still got this enthusiasm.\nI'm excited to be here just to express\nwhat I actually feel today.\nI actually realized that during the course of the time\nthat I actually been invited here,\nit's actually been like a struggle ever since\nbecause it looked like the forces of the enemy\nwanted me not to come here and not to spread the message\nthat I know I need to talk about today.\nAs recently as last night, I had a message\nand I had it all ready to go,\nbut today I come to you knowing that it wasn't me\nfor to speak that message today,\nwas something that's pretty much just actually from God.\nAnd so, I realized the day that, you know,\nalong the way, I've had some people\nand some characters just like this gentleman.\nAnd just like that gentleman there,\nthat's Mark Ratchet.\nPeople like the Speaker of the House, David Rauston.\nI love fellowships.\nAnd I love personalizing.\nI love being around people.\nThe good people in your life are those\nwe actually love or be around.\nOne of those members also is my wife,\nthat's Regina, and she's been introduced.\nSo today, as I changed this subject,\nlet you know who you are as representatives, as a recommendation. What I\ndecide was to tell who you are in an area of a acronym. Is that all right with\nyou? Okay. Now you told me five minutes, so I'm trying to make it through this\nfast. So let me know if I'm going too fast. So as an acronym, as a representative\nwho you are, you are relational, encouraging, purpose driven, relatable, even\nminded, sympathetic, eager, neighborly, tangible, amazing, talented, ingenious,\nvaluable, encouraging, service. That's who you are. That's what a representative is.\nI thank God for my place. All the stuff that he talks about early sounds very\nimpressive, but the most impactful thing was about how much damage it was getting\nthere. Laws of dad, when I was 13, continuing to lose family members over and over again,\nI realized that when you jump in your car in the morning, you have a destination and you\nwant to take in. What happens alone the way is it's bad drivers and difficult is to get\nthe place you want to get their own time and then you want to jump in front of somebody\nthen you start having anger or the disconnect that actually takes us to the place that we\ndon't realize it. We need to go. It's all about timing. All things\nwork together for the good of those who love God and according\nand call to His purpose. You in this house are called to a\npurpose. If you're here, it's your purpose of be here. This is\nnot by accident that you are here. You're here for a reason. But\nit takes timing. And as much as I wanted to be on time, it looks\nlike I was not going to make it. And I realized that I needed to\nhave the kingdom to come down to me to remind me that he's here\nwith me. And as that clock kept winding down for me to get\nclose, it looked like more and more and more that I was going to\nbe late, late, late. And as a matter of fact, the last time\nthey looked at it on my GPS, which is God's position in\nsystem, which takes us to places that we otherwise wouldn't\nrather go. Took me to a place that where it seems like\neverything was dark at that moment. We want to get in a smooth\nplace. And we wind up getting that GPS star going down and down\ndown and down and down and I'll say look at him changes this message must be\nyou know relevant to what we need to do and it's close to we got here we got\nhere at nine twenty five nine twenty five my attention was be here at nine o'clock\nbut we got here at nine twenty five that wasn't the end of the journey we\nactually couldn't get it to the driveway in the parking's parking place but\nlisten this is what God did he prepared a place for us he prepared a place for\nBut it was one pocket spot in the hall and this is all this pocket spots over there.\nOne pocket spot left.\nIt was one.\nAnd as a matter of fact, I jumped around the curb.\nI wasn't garlic right then.\nI turned that curb, be on my wife's wishes, and I turned the corner, and it was soon as\nI turned the corner, it was a pocket spot right there.\nRight there.\nIt was right there.\nThat's the text.\nIt was right there.\nnothing but God. So in the midst of all the stuff I realize is I need to have a\nkingdom perspective on my life believing that anything happens we got to\nrealize that kingdom needs to come down to us and what happens with that the\nthing that changes that for us all is it's being a being mindful of that we\nhave got to put God first. Seek you first a king of God and all this\nrighteousness and all these things would be added to you.\nMatthew 6 and 33, Seaky first, first in everything that you do.\nThe reason why you hear is because the conversation about us being connected is\nbasically because you're somewhere in your life.\nIf you're not a believer the day in this house,\nor somebody in your family has been, somebody has.\nThe reason why you hear it is somebody else connected you to the Almighty living\nGod and that's the reason why you hear.\nWe hear the change lives.\nWe hear the restore families.\nWe here to reconcile cultures,\nwe here to connect community and to impact the world.\nThat's what we do.\nWe're here for change.\nLike that brother right there is,\nI finished this conversation.\nThat brother right there is Mark Ratcher.\nMark Ratcher went down to Texas Southern University\nwhere he hung out with a brother that didn't look like him.\nWe called it the Chitlin' Circuit.\nAnd that brother, and I gotta finish this conversation\nreal quickly because I don't wanna make up your take up\nyour time? When I came onto that university not, you know, getting, you know,\nmissing out on every opportunity before I got to take a Southern,\ntake the Southern as well, started my really my football avenue because every\ntime I tried out for a team, I got cut. Every sport I tried, I got cut. It was\nmore than three times. I got cut multiple times. I got cut at least eight\ntimes before I made a team. As a matter of fact, my last opportunity to go to and\nhave an opportunity to play any sport was going to take a Southern, try to\nfor the football team. I went out for the team and you know what happened. I could. So I went out\nthere one more time and I actually got saved as something I never thought I would be doing in this\nministry. And so the thing that saved me, FCA fellowship of Christian athletes, impacting the\nwords of Jesus through the influence of coaches and athletes, it's something that I'm doing. It's\na calling. You guys are here in the calling, but y'all have an amazing calling. Y'all can impact\nthe whole entire world with your combinations of people who don't look like you.\nWill you come and you embrace them with the love that they actually have that\nbrother right there? If me and him don't make a connection, it's over thousands\nupon thousands. When I'm telling you, this is really serious. Thousands of people\nat lives have been impacted because me and that man right there are friends\nof this day and I love him. I love that brother. I really do. You can do it too.\nAs a matter of fact, you have more time being more authority to do it. So as I\nclose this, I want to thank you guys for realizing that if you realize that you\nwant to be connected to the kingdom, you got to ask the kingdom to come down here, because\nwe ain't ready for it. We're ready to go up there. We got to ask the kingdom to come down\nand be able to attack this thing in terms of the enemy when it takes us away to a bad location\nor it's in like we're in a spot that we're going to be late or somewhere where we got\nto get around and make things happen. You got to do that, but we still got to circle\nour way back around and map to 63. Seeky first, the kingdom of God and all this righteousness\nand all these things would be added to you.\nThank y'all for your time.\nI appreciate you.\nLet me pray for, is it okay if I pray for us this morning?\nI actually try to steal some prayer this morning,\nbut I want to be sure God said this.\nAs a matter of fact, I asked him,\nI said, Lord, when I come here today,\nI want you to be in the talk.\nSo I hope the visible appearance of me,\nthe visible appearance of me would be invisible\nin terms of your real life.\nThis is a God's message, it's not mine.\nSo let me pray for you right quick.\nThank you, Lord, as we welcome you here today,\nwe value and honor your presence by the way\nof the Holy Spirit.\nYour ambassadors are here to listen to your place\non the throne, the one of righteousness.\nToday, they submit their harsh minds and gifts\ninto you like that of a child.\nToday, we decree and declare that your name would be glorified.\nAllow us to the waiting of you in this place.\nSo today, we decided to step aside and ask\nthat your wisdom rule and reign in this house,\ntransform all that has the ear to be changed.\nshare here and feel the presence of you here also.\nAfter what's left was only memories of the kingdom\nupon us here to date in this house\nand we thank you for it in Jesus' name.\nNow, we all enjoy me in terms of the pledge and leeches.\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands.\nOne nation under God, the indivisible,\nthe liberty and justice for all, thank you so much.\nI can lose it now now.\nYou\nNoorkeepers will please unlock the doors.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct. Thank you.\nChairman Hogan, the chair of the committee on information and audits, reports that the\njournal the previous legislative day has been read and found to be correct. Is there any\nobjection to the confirmation of the journal? The chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, honor 59.\nMoves the following be established as the order of business in the first part of the period\nunanimous consents, introduction of bills and resolutions, first reading and reference\nof house bills and resolutions, second reading of bills and resolutions, morning orders.\nany objection to the adoption of the resolution establishing the order of\nbusiness for the day. The chair here's none in the resolution is adopted. First\nreading of bills and resolutions the clerk will read House Bill 751 by\nRopes and pulling on the 131st of the 18th Gertler the 8th singleton in the\n71st more the first and others will be taught on act to amend code sections\nJanissary House Bill 752 by\nRussell Peltman 112th Bonner of\nthe 72nd pennant of the 94th\nland of the 75th and Carson the\n46th Bill B. Todd on act to a\nmen article on a chapter 33\nat title 43 if it's going to\nGeorgia annotated relating the\ngeneral provisions regarding\nphysical therapists regulated\nindustries House Bill 753 by\nRussell next to the 69th Bill B\nTodd on act to authorize the\ngoverning authority the city of\nFranklin 11 next size tax.\nIntergovernmental Coordination House bill 754 by resident Bruce the 61st base more than 63rd\nMetz the 55th in Jackson 64th Bill Meantown and act to amend Code section 16\n13 32.6 the Fisher go to Georgia, Antietta relating the manufacturing just distributing dispensing or processing with the intent to distribute\nControl the substances\nJudiciary non-civil House bill 755 by resident built into 112 Jones in the 47th next to the 69th\nwith the control of the 22nd,\nglantin' to the 75th and others.\nBill being tied on act to a men code section 20,\ndashed two days,\n2068.1 of the physical to Georgia annotated\nrelating to charter school funding.\nEducation.\nHouse bill 756 by reps and tremble the 130 second\nClark on the 100th,\nBuckner on the 137th.\nWilliams on the 37th,\nAllen on the 40th and others.\nBill being tied on act to a men part one of Article II,\nchapter eight to title 12 of the physical to Georgia\nannotated relating the general provisions\nrelative to the solid waste management.\nNatural resources and environment.\nHouse Resolution, 880 by Resort.\nPetrie the 166th is the 164th hits.\nIt's the 161st, Gilear to the 162nd Gordon,\nthat's the 163rd.\nResolution honoring the life of Mr. Al St. Lawrence\nin dedicating a bridge in his memory.\nTransportation.\nHouse bill 757 by Representative Fleming\nof the 120th for his burns, 157.\nJones on 47th, Blackwood on 146, Kelly on 16th,\nto be Tyler Nack to amend.\nChapter two, a title 21 of the physical\nto Georgia, annotated relating the primaries\nand elections generally.\nGovernmental affairs, that completes first readers.\nSecond reading of bills and resolutions, a clerk will read.\nHouse Bill 725 by Representative Taylor of the 173rd Hawkins of the 27th Gaines of the\n117th Mathiac of the 73rd Green of the 150 First and Others of Bill related to medical\nassistance.\nHouse Bill 726 by Representative Taylor of the 173rd Hitchens of the 161st Jasper's at\nthe 11th Lumps of the 12th Green of the 150 First and Others of Bill related to general\nprovisions regarding law enforcement officers and agencies House Bill 727 by Representative\nNulo which of the 42nd Stevens of the 164th Beverly of the 143rd Willinsky of the 79th\nPolkham at the 81st others have bill related to barbers and cosmetologists House bill 728 by represent Martin of the 49th\nJones of the 47th and Silcox of the 52nd\nBill to provide a new homestead exemption from the city from a Fulton County school at Valoran taxes\nHouse bill 729 by represent Bayesmore at the 63rd Bruce of the 61st Jackson of the 64th Beverly of the\n143rd and Hugley of the 136th a bill relating to fees and construction of other fee provisions regarding superior courts\nHouse Bill 730 by Representative Stevens of the 164th, the bill relating to exemptions from sales and use taxes.\nHouse Bill 731 by Representative Stevens of the 164th, the bill relating to the excise tax on tobacco products.\nHouse Bill 735 by Representative Blackwin of the 146th, Myra 135th, Clark of the 147th, Williams of the 168th, Belton of the 112th and others.\nThe bill relating to imposition rate, computation of income taxes and exemptions.\nHouse Bill 736 by Representative Belton of the 112th, Clans of the 75th, Taylor of the 173rd.\nGreen of the hundred and fifty-first step of the seventy-fourth, the bill relating to scholarships, loans and grants, or post-secondary education.\nHouse Bill 737 by Representative Gamble of the 15th Scotland's of the 14th, Kelly of the 16th, and Bill to a midnight, providing Board of Education and Part of the County.\nHouse Bill 738 by Representative Martin of the 49th, the bill relating to Malt Beverage's, House Bill 739 by Representative Jasper's of the 11th,\nThe focus of the 138th and Hawkins of the 27th,\nthe bill relating to the Georgia Composite Medical Board,\nHouse Bill 740, by reps of Stevens of the 164th,\nthe bill relating to the Department of Economic Development.\nHouse Bill 741, by represent Belton of the 112th,\nStovall of the 74th, Tanner of the 9th,\nTaylor of the 173rd, green of the 151st,\nthe bill relating to turnaround schools,\nHouse Resolution 843, by reps of Black,\none of the 146th, Clark of the 147th,\nRestoration of the 104th Williams of the 168 tankers leave the 160th and others resolution urging the United States Congress to oppose the Green New Deal House Resolution 844 by Rimsett and all the Wits of the 42nd Williams of the 145th\nBuckner of the 137th Gallup of the 19th Gardner of the 57th Resolution urging the United States Congress to pass the Transit Worker and Pedestrian Protection Act in the Secretary of Transportation to issue rules to address protection of public transportation operators from the risk of assault through 2nd readers\nYou\nYou\nYou\nYou\nnow to morning orders, morning orders.\nWe have a lot of business to attend to this session.\nThis house has adopted for many years rules that govern our procedure here on the floor.\n40.1 sets a maximum total time for morning orders of 20 minutes total during the\nfirst 20 days of the session and 10 minutes during the remaining part of the\nsession. So we're going to allocate that as best we can but keep in mind at the\ninto 20 minutes. It's over and so you can come see the messenger and sign up for\ntomorrow. Chair recognizes for a morning order the majority leader of the house\nleader Burns. Thank you, Mr. Speaker. Colleagues, good morning. You know for the\nThe seventh consecutive year, our state Georgia has been named in the number one state in\nthe country in which to do business.\nLargely because of conservative, common sense, business policies initiated and passed by\nthis house.\nGeorgia has become the ninth largest state economy in this country, doing no small part\nagain to the efforts of the Georgia House of Representatives and of the Georgia Chamber\nof commerce who both advocate for job creation and free enterprise.\nWe now currently rank 7th in the nation for the share of women-owned firms and 3rd in\nthe nation for African-American-owned firms.\nWe are blessed to have Hartfield, Jackson, Aaron National, airport, most efficient and\nbusiest airport in the world.\nThe port of Savannah, the fourth busiest container port in the United States, largely due to\nthe funding appropriated by this house for deepening of the harbor.\nOur population in Georgia has nearly doubled in the past 40 years as we have attracted,\nwelcomed, and cultivated talent here in Georgia.\nThe Georgia Chamber of Commerce has worked with this house hand in hand for over 50 years\nnow. And specifically, over the past decade, the Chamber has worked on over 2,500 bills\nin this house, helping to save Georgia taxpayers money and impact in our economy to the tune\nof billions of dollars. Additionally, the Georgia Chamber recently\nlights a center of rural prosperity that is working consistently with the House Rural Development\nCouncil to ensure that Georgia's growth benefits all all Georgians. Now I think\nall of y'all know this but tomorrow morning at 7.30 a.m. that is in the morning\nCasey the Georgia Chamber will be hosting this annual eggs and issues\ncommunity and business leaders from across this state will be in town for\nthe event and I encourage you all my colleagues to join me to hear the\nremarks of our speaker, the speaker of the House, David\nRolston, as he makes his remarks tomorrow morning and that\nevent, and continue to support the businesses around this\nstate and the great work this House and the Georgia, Georgia\nChamber is doing for the citizens of Georgia. How you the\nwell, Miss Speaker, thank you.\nSo, gentlemen, as yielded the well, we have, I forgot to\nallocate the time so we're going to say three minutes each on the morning\norders till we use our twenty minutes and then we will go on to other\nbusiness chair recognizes the chairman of the House Rules Committee for a\nmorning order chairman Smith joined by the dean of this house dean\nDean Smiley, representative Hugley, and representative Buckner, and representative Vance Smith.\nHouse will be at order.\nThank you, Mr. Speaker.\nOn January 2, 2020, the Armble Tom Book passed away.\nOn January 2, Georgia lost a statement, the likes of which we never see again, and that\nwas a quote from someone who knew him well.\nTom Buck, a Democratic representative,\nfirst elected to the Georgia House in 1966,\nretired in 2004, 19 consecutive two-year terms.\nDuring his 38 years, he served as chairman\nof various committees such as retirement,\nappropriation, ways and means, the university system.\nAnd I guess the best compliment of someone\nabout someone is a quote that someone who knew him well said.\nWhenever you're talking with Tom,\nit's like sitting in a graduate level government class.\nPlease join me in a moment of silence for Tom Buck.\nThank you.\nThank you, Mr. Speaker.\nChair recognizes representative Carpenter\nfor a morning order.\nThank you, Mr. Speaker.\nSo it is the annual Dalton Day down at the freight depot and I'm going to unleash the carpet\nthat you guys so much enjoy to see.\nThis year we're going with the Atlanta Braves.\nWe'd love to see you tonight at four o'clock at the freight depot.\nI have a little fellowship and talk a little flooring industry.\nThank you very much.\nChair recognizes representative Kendrick for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nSo I am giving you your first black fact for this session.\nI think every day is a day for black history.\nSo I was doing some research and some interesting black facts.\nAnd I found the stated belief of the black Panther Party.\nAnd I wanted to share that with you.\nSo here it goes.\nWhen and the course of human events, it becomes necessary for one people to dissolve the political bans,\nwhich have connected them to another, and to assume among the powers of this Earth,\nseparate and equal station by which the laws of man and nature's God entitle them,\na decent respect to the opinion of mankind requires that they should disclose the cause which\nimpale them to the separation. We hold these truths to be self-evident, that all men are created equal,\nthat they have been endowed by their creator\nwith certain unalienable rights\nthat among these a life-liberty and the pursuit of happiness,\nthat whenever any form of government\nbecomes destructive of these ends,\nit is the right other people to alter and abolish it.\nAnd to institute a new government,\nlaying its foundations on such principles\nand organizing its powers in such a form\nas to them shall seem most likely to affect\ntheir safety and happiness.\nYou will notice that it's also the preamble\nto the Declaration of Independence.\nThank you, that's your black bag for today.\nChair recognizes representative Al Williams for a morning order.\nThank you.\nI'm sorry.\nIt took me two minutes to get up here.\nI'm going to use the majority leaders three minutes\nthat he didn't use.\nI just wanted this morning to rise and thank those of you\nthat attended the EC Tillman Prayer Convocation on Sunday\nwhen a grand time, it was a great, great spiritual moment.\nI just wish more of you next year will come\nbecause it is a unique experience.\nAnd this year, we honored Chairman Powell and Chair\nSenator Kurt.\nSo it was a very good day.\nBut especially, and he doesn't know I'm going to say this,\nbut the majority leader does not know.\nWe need to thank him because he always steps up\nwhen we ask for his help.\nThose itchings are very, very expensive.\nAnd we thank you.\nThank you for what you've done.\nAnd thank the speaker for his participation.\nI don't remember the last time he's missed one.\nHe's always there.\nThank you, Mr. Speaker.\nNext year, we look forward to seeing you.\nThank you to never one of you.\nChair recognizes representative Derek Jackson\nfor a morning order.\nThank you, Mr. Speaker.\nI rise to say thank you on behalf of me and my family eight months ago yesterday, a\nremarkable wife, a super mother, and an outstanding\nnaval officer, transitioned from this world.\nGod bless me with 31 years.\nSo I would like for you all to join me in a moment of silence.\nAnd again, thank you on behalf of me and my family.\nFor everyone under this go dome came out\nand support it, me and my family.\nThank you, Mr. Speaker.\nChair recognizes representative Silcox\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning.\nI am here to let you know\nthat the Georgia Department of Transportation\nis going to be here today.\nThey are starting their public information\nopen houses here at the Capitol.\nThey are having a drop-in today between 12 p.m.\nand 4 p.m. in Capitol Room 417.\nAnd they will be discussing the top-end\nperimeter express lanes.\nIf you are in the Decap, Fulton, or Cobb delegations,\nI would highly encourage you to attend.\nThis will affect everyone in Metro Atlanta,\nand I appreciate your attention.\nChair recognizes Representative Drenner\nfor a morning order.\nThank you, Mr. Speaker.\nI rise today to take a moment out of our day\nto pay tribute to and to wish my mom a very happy,\nhappy birthday.\nAs I thought about what I would say, first I would like to take a minute and acknowledge\nthe losses that each member has experienced this past year.\nMother's wives, brothers, daughters, aunts, uncles, losses of a loved one is by far the\nmost difficult experience that anyone left living can endure.\nLast year my friend, my chairman, and fellow West Virginia, chairman Don Parsons, lost\nhis mother.\nHis words resonate with me as I speak today.\nHe said, enjoy them while you can because when they are gone is too late.\nSo today I am celebrating my mother, June Laverne Watson's 80-second birthday.\nShe was born in Boone County, West Virginia.\nShe was number 8 in a family of 11.\nHer dad and three brothers all worked in the coal mines.\nShe spent 57 years of her life working in government at the municipal and state level.\nShe retired at 77 and for the last several terms, I have had the pleasure of working with\nher during the legislative session.\nIt's a rare gift as an adult to get to work with your parent.\nAnd I am very grateful for that opportunity.\nHowever last year she fell, and she's not here today.\nBut you can't keep a good woman down.\nShe still reads my emails.\nShe keeps my calendar, and just like in a high school, she still regularly reminds me about\nbeing on time.\nIn closing, Mom, I want to say thank you for teaching me the values of honesty, of integrity,\nthe belief in the Almighty, and for continually encouraging me to do my best despite the obstacles.\nWhatever God's plan is for our future, Mom, let me say this to you, there is never\na day that I am not thankful for you.\nHappy birthday.\nIf I had a glass of shardonnay right now,\nI would hold it up.\nSo here's to many more.\nI love you.\nAnd Mr. Speaker, I yield the well.\nOkay, here's the situation. We're almost out of time, so we have two more morning orders.\nI'm going to ask that you be mindful that we're about to turn on the red button, chair\nrecognizes representative Stovall for a morning order.\nGood morning. Thank you, Mr. Speaker. We say educators and support staff are\nimportant in Georgia because of our children. But it isn't dependent upon if they\nare a traditional schools or charter schools. In Georgia, if charter schools\nopen and they have less than 50 employees, they are penalized and can't get state health\nbenefit plans on insurance for their employees. They can't participate in the huge discounts\nthat are offered. They can't utilize the freedom they should be able to do. If they decide\nto go get outside insurance temporarily, they won't be eligible to receive the state\nhealth benefit plan ever. There are educators that are uninsured and\nGeorgia right now who were employed at charter schools.\nBut in actualality, they could qualify,\nbut the bureaucracy is prevented.\nThank you, Mr. Speaker, you're the will.\nChair recognizes representative Bernal for a morning order.\nThank you, Mr. Speaker.\nYesterday Delta Sigma Theta sorority incorporated,\ncelebrated its 107th Founders Day.\nOn January 13, 1913, 22 young women studying at Howard University\nfounded Delta Sigma Theta Sorority Incorporated.\nAt the time, they were seeking to create an organization\nthat would not only benefit its members, social status,\nbut would also make a positive impact on the black community.\nSince its founding, Delta Sigma Theta has grown into an organization\nof over 300,000 members, spanning more than 900 chapters\naround the world.\nWe've walked the halls of justice\nusing the power in our voice to advocate\nfor equality, champion health disparities,\nimpacting our global community.\nWork to close educational achievement gaps\nand so much more.\nFor these endeavors among many more,\nI wholeheartedly believe that our 22 beloved founders\nwould be proud.\nThank you, Mr. Speaker, I yield the will.\nThank you.\nYou're welcome.\nThank you.\nThat completes morning orders, Chair is going to ask all members of the House to please\ntake your seats and come to order.\nAll members, please take your seats.\nThat means that the conversations that are going on all around the chamber, if you would\nand suspend those for just a few minutes.\nJust on a time there was a tradition in this house many, many years ago that every session\nthe mayor of Atlanta would come in and greet members and welcome them.\nI don't know where we got off the track with that, but it was way before my time and certainly\nway before this mayor's time.\nBut I'm just very honored and pleased that we have with us today a great leader here,\nonly in the city, but in the state. I have enjoyed coming to know Mayor Bottoms. We have\nhad many, many discussions. I can tell you that we have a great relationship in terms\nof respecting each other's point of view. We don't always agree.\nBut we respectfully disagree sometimes.\nBut I will tell you this, that Mayor Keisha Lance Bottoms is a hard-working, tireless advocate\nfor this city and for the state of Georgia.\nShe is a great mayor for Atlanta and is a great partner working with the state.\nAnd I'm honored that she would come today to bring greetings to the House.\nto make welcome the Mayor of Atlanta, Mayor Keisha Lance Bottoms.\nThank you very much for your very warm and gracious greeting.\nSpeaker Ralston, a speaker, pro-tam, Jan Jones, majority leader, John Burns, minority\nleader Bob Tremel and the Dean of the Georgia House, my dear friend Calvin Smirey, I appreciate\nall of you all here and I am grateful that you have allowed me to bring greetings on\nbehalf of the city of Atlanta. I know that yesterday you took a moment to acknowledge\nRepresentative Jay Powell, who was such a valued member of this body and I joined you\nand being grateful for his servant leadership to our great state.\nI had the great honor and privilege of greeting your colleagues in the Senate on yesterday.\nAnd I share with them that sometimes, Mr. Speaker, I struggle between bedside baptists and\nactually getting out of the house, getting to church, not because my heart is not there,\nbut it's just sometimes a challenge.\nBut on Sunday I fought through it and God led me to a church near my home that I haven't\nattended in some time and when I got there I was late and I continued to push through.\nBut as I walked in the minister was beginning the sermon and it was from the book of Ruth\nwhich was my grandfather's favorite book in the Bible.\nSo I knew that I was in the right place.\nAnd then the minister talked about divine companions.\nAnd I took a lot of notes because I needed to hear that sermon on Sunday.\nAnd if you all are familiar with the book of Ruth, what I shared yesterday is my grandfather's\nfavorite scripture in part says, where you go, I will go.\nAnd your people will be my people.\nAnd the minister spoke about how impactful companionship is and that we aren't created\nto do things in isolation, and not to neglect the people that God has given to you and your\nlife to make you better, and divine companions often lead you to solutions.\nAnd another point that he made is sometimes you only need one divine companion that we\noften lament not having many, but sometimes it's about having the one on our side.\nWell, as I am here today, what I see in each of you all is divine companionship.\nFor me, my roots in Georgia come from the peaks in Crawfordville, Georgia, the shields\nand Madison and Winder and the Robinson's and Athens.\nAnd when I look at each of you all, I know that you have come from near and far, but we\nare here together.\nAnd I can tell you in these divine companionships that I've found in my two years as Mayor Falfrenz\nlike Speaker Ralston, who to my surprise, when I met him, the first thing he said to\nme was, I loved your daddy's music.\nI could not have been more pleasantly surprised, because you see sometimes our divine companions\ndon't come in the neat packages that we have put in our heads as to what they should\nlook like and where they should come from and how they should appear.\nBut what I can say to you is that as mayor of this city, I know that my people are your\npeople.\nAnd I know that although we may not always agree as Speaker Rossin has said, we want the\nbest for the people of this great state of Georgia.\nAnd together we've been able to accomplish so very much.\ntogether, I know that we will continue to do that. And I'll just leave you with a story\nI shared on yesterday that in my first years, I went around meeting different people in\nthe House and Senate, I had a very productive meeting with someone that wasn't you, Speaker\nAustin. And when we finished the meeting, he said, now you better not go out and tweet\nabout it. Because he didn't want anybody to know that we had a great meeting. So what\nBut I'll say to you, if you don't tell, I won't tell.\nI know how to keep a secret.\nYour secrets are safe with me.\nSo let's have some public great meetings.\nAnd we can have some secret great meetings.\nBut at the end of the day, I know\nthat it's for the good for the people of Georgia.\nMay God continue to bless you.\nAnd I wish you a successful session.\nThank you.\nThank you.\nThank you, guys.\nThank you very much.\nI appreciate it.\nThank you.\nThank you.\nYou\nYou\nYou\nYou\nChair recognizes Chairman Lee Hawkins to introduce the Doctor of the Day.\nMr. Speaker. I have the privilege today of introducing a physician that I've\nknown since 1996 when he moved to Gainesville. Andy and his family have been\npatients of mine and I'm a patient of his and his partner John Range. Andy\npresently is president of the Georgia Association on Medical Association of\nGeorgia rather. He practices family medicine and long-street clinic in Oakwood\nGeorgia. He's a member of the Hall County Medical Society, the American Medical Association\nof Georgia Academy of Family Physicians. Andy graduated from Medical School of Miami,\nbut he did his undergraduate degree at the University of Florida. Florida. Hello. Andy lives\nin Gainesville with his wife, Elizabeth, their three children, Charlie, Robert, and Caroline,\nand when they come to the office, they're always wearing University of Florida clothes, and\nI've always said to them, I see that your parents are still shopping at Goodwill.\nSo let me introduce my good friend, Andy Reisman.\nThank you, Mr. Speaker, and thank you, Dr. Hawkins.\nHe does know that I'm his favorite gator.\nThank you all for serving the state of Georgia as the President of the Medical Association\nin Georgia leading the organization that represents 8,000 physician members in the state.\nI just want to express our sincere thanks for your accessibility and for your attention\nto the care of the patients in Georgia, anything that affects the physicians directly also\naffects the patients.\nAnd we appreciate everything you do and thank you for all the hard work you do for our\nstate.\nAll right, we're going to do a little business now, Chair recognizes the chairman of the House\nMs. Ways and Means Committee Chairman Harrell for a motion.\nThank you, Mr. Speaker.\nLadies and gentlemen, the House I would like to move that the House insists on its position\non HB276 and appoint a Committee on Conference.\nClerk will read the caption.\nHouse Bill 276 to be entitled on an act to amend Article 1 of Chapter 8 of Title 48.\nI need to just go to George Antenna relating the sales state sales and use tax it was to modify the definition of a dealer\nYou wish to explain your motion or let them vote\nAll right, is there any objection to the gentleman's motion?\nThat this house insists on its position and a committee of conference be appointed on House Bill 276 is their objection\nThe chair hears none and this house has insisted and the chair appoints as a committee\nof conference on House Bill 276, Chairman Harrell, Chairman Dollar and Representative Williamson.\nfor what purpose does representative Todd Jones rise?\nTo make a motion, state your motion.\nI motion that we move House Bill 538\nfrom the Ways and Means Committee to Judiciary.\nChairman or representative Jones has moved\nthat House Bill 538 be withdrawn\nfrom the Ways and Means Committee\nand committed to the Judiciary Committee.\nClerk will read the caption.\nHouse Bill 538 to be taught on act two men article on chapter two,\nTitle 48 of the fiscal to Georgia annotator relating the state administrative\norganization of revenue and taxation.\nOn the gentleman's motion that House Bill 538 be withdrawn from the Ways and Means\nCommittee and committed to the Judiciary Committee, is there any objection?\nIs there objection?\nChair, here's none and it is so ordered.\nWe're going to see.\nYou\nYou\nYou\nWhat purpose does chairman Clark rise to make a motion state your motion that the house rules be temporarily suspended so a resolution may be read for the first time and assigned to committee.\nChairman Heath Clark has moved that the rules of this House be temporarily\nsuspended to allow a resolution to be read for the first time in a sign to\ncommittee. The clerk will read the caption.\nA number of House resolution by Representative Clark, 140, 7th and others\nrecognizing commanding President Donald J. Trump and the brave men and women of\nthe United States. Armed Forces and intelligent agencies on their successful\nmilitary operation that neutralized, could seem solomani\nand for other purposes.\nOld gentleman's motion that the rules be temporarily suspended is\ntheir objection.\nChair, here's no objection.\nSo it is so ordered, defense and veterans affairs.\nAll right, we have an invite resolution this morning. The chair is going to ask the members\nof the house. Please come to order. Take your seats and be respectful to our special\nguest. Park will read the caption to House Resolution 861. House Resolution is it? I'm sorry, 881. House\nResolution 881 by Representative Glanton of the 75th of Resolution Commending Clayton State\nUniversity upon the grand occasion of its 50th anniversary and recognizing January 14, 2020.\nThat's Clayton State University day at the state capital and for other purposes\nChair recognizes representative Mike Glanton for an invite resolution\nThank you mr. Speaker\nmr. Speaker\nLadies and gentlemen of the House,\ngood morning and happy new year.\nBefore I recognize the university,\nI want to make sure that I acknowledge the members\nof the Clayton County Legislative Delegation\nthat joined with me today.\nI believe we have representatives Baysmore,\nBernal, Scott,\nschool feel, a stove all and Douglas, I miss. So at this time, Mr. Oh, and Henry County,\nmembers of the Henry County delegation as well. Mr. Speaker, before I move forward,\nI'd like to ask you to help us to recognize and to welcome to the people's house,\nthe Clayton State University's students, staff, and faculty\nin the gallery this morning.\nWould you please stand?\nClayton State University, please stand.\nI want to also let you know, members of the House,\nthat you should have a thank you card on your desk this morning\nfrom some of our students at Clayton State University.\nPlease take the time to read those thank you notes\nbecause we are certainly grateful for what this house does.\nAt this time, I would like to ask for Dr. Tim Hines,\nthe president of Clean State University,\nto come forward for remarks.\nMr. Speaker, members of the Georgia State House,\nSpeaking for the faculty, staff, and nearly 7,000 students\nof Clayton State University, I want to say thanks\nfor your support and service on behalf of Georgia\nin support of the university system of Georgia.\nAt your desk, as Representative Glanton indicated,\nyou'll find a personal thank you from one of our students\nexpressing our appreciation and their appreciation\nfor the support this house provides\nfor the students of Georgia.\nClayton State students have an average age of around 28,\nnearly two of three are eligible for federal PEL funding\nand the chances of graduation\nhave increased nearly 12% over the last 10 years.\nGraduating next generations of nurses,\nother health professionals, small business owners\nand other business people,\nfilm and media workers,\nand other talented graduates for Georgia's future.\nAs a first-generation college graduate myself\nand a product of public higher education,\nI am proof of the hard work that it takes\nto transform students for the next generation of Georgians.\nAnd on behalf of those students, faculty, and staff,\nI say thank you for your work,\nand thank you for being Georgians.\nThank you Mr. Speaker.\nThank you very much.\nThank you.\nYou\nI'll read the caption to a group of\nprivilege resolutions.\nRecognizing 911 and public safety\ntelecommunicators as first responders\nin Georgia.\nCommending Clayton State University\nupon the grand occasion of his 50th\n2020 is going to stay university day, recognizing commending\nKaren and Eric Vaughnck, a richen distilling company,\ncommending and graduating, Richard Boone upon the grand occasion\nof his eight-Eath birthday, commending Easter Seals,\nand recognizing January 17, 2020 as Easter Seals,\nGeorgia, and its champions for children\nprogram day at the State Capitol,\ncommending and congratulating Eath Arnold Hamburg,\nrecognizing Korean American day in Georgia\nand the cultural significance of the handbook.\nCommending Morris Moe Clyde, Louis III,\nhonoring the life and memory of John Albert Demons Jr.\nHonoring the life and memory of El Nourna Mackenzie Gay,\nhonoring the life and memory of Beatrice Spivey Roberts,\nand for other purposes,\nthat completes the reading with privilege resolutions.\nIs there any objection to the adoption\nof the privileged resolutions, the chair here's done\nand the resolutions are adopted.\nWell, we have our first birthday of the session today.\nPlease join with me in wishing a very happy birthday\nto Representative Pam Dickerson.\nWe're going on now to announcements, so listen up on to announcements.\nChair recognizes Chairman Powell for an announcement.\nThank you, Mr. Speaker.\nTo the members of the regulated industry committee, we will be meeting today at 2 o'clock to finalize\nthe lottery oversight committee meeting as well as some other just general housekeeping.\nCould you be there?\nsix at two o'clock. Chair recognizes Chairman Benton for an announcement.\nThank you, Mr. Speaker. Members of the House of the time and committee, we will be meeting\ntoday at two o'clock, room 515, CLOB. We have quite a few bills that have had actual\nWe're all studies done that we need to work on.\nThank you.\nChair recognizes Chairman Clark for an announcement.\nThank you, Mr. Speaker.\nThe House Defense and Veterans Affairs Committee\nwill be meeting today at 1 o'clock in CLOB 415.\none o'clock, 415 CLuby.\nThat completes our announcements.\nChair recognizes the majority leader of the House\nfor a motion.\nMs. Speaker, I move to this House, stand adjourned\nuntil 10.30 tomorrow, Wednesday, January the 15th,\n15th, 1030, Mr. Speaker.\nThat ought to give everybody plenty of time to have their breakfast and fight the traffic\nback over here.\nIs that accurate?\nOkay.\nWe sure hope so.\nMajority leader has moved that this has to be adjourned until 1030 AM Wednesday, January\n15th. All those in favor of the motion will please say aye. Those opposed will say no.\nThe eyes clearly have it. This house stands adjourned.\nYou\n",
  "updated_at": "2026-02-12T16:43:14.658056+00:00"
}