{
  "video_id": "lx6H0iFrWMA",
  "url": "https://youtu.be/lx6H0iFrWMA?t=2366",
  "title": "Georgia House - Day 23 (2026-03-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 23,
  "video_date": "2026-03-03",
  "duration_minutes": 148,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session focused on routine procedures, with the House standing at ease for an extended period. The highlight was a prayer given by guest chaplain Dr. Benny Tate, who delivered a sermon on the power of words.\n\n**Key Actions:**\nNo substantive legislation was discussed or voted on.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Dr. Benny Tate, a prominent Georgia pastor, delivered a sermon to the House on the power of words and how they can shape one's world.\n- There was some casual conversation between the Speaker and members about growing up in rural areas.\n\n**Votes:**\nNo recorded votes took place.\n\n**Attendance:**\nA quorum was present, as members were required to vote to signify their presence.\n\n**Adjournment:**\nThe House stood at ease for an extended period, but no specific adjournment time was noted.",
  "transcript": "The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015. The House will stand at ease until 1015.\n\nyou you you you you you you you you you you you you you you you you you you you you you you We'll report to the floor and take your seats, the Clarkor Ring the Bell. All members will report to the floor and take your seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the Clark will unlock the machines. Have all members voted? Have all members voted? If so, the Clark will lock the machines. Doorkeepers will please close the doors and keep them closed. Well good morning. What a beautiful day out there today, huh? Not just a journey early here after we listen to our Chaplin friend and go outside. Never should have brought that up. We're going to begin our day in a moment with the scripts are reading in prayer, but I think like every day the news from Eastern Europe just gets worse. Once upon a time there was a war crime to kill civilians and children. Well somebody needs to remind Vladimir Putin of that. And anybody that's caught that are one of his at Somarali chanting where they're chanting his name, then I think we can we ought to ship them over there to live in his Russia. Well before I steal brother Benny's thunder here, we will begin our day with scripts are reading in prayer by the Chaplin after which we will pledge allegiance to the flag of our country. Our Chaplin this morning will be introduced by the lady from the 73rd House District Representative Karen Mathyac, Chairman Mathyac. Good morning Mr. Speaker and thank you. It's my pleasure today to get to introduce my pastor Benny, Dr. Benny Tate representative Clint Crowe was the one that actually invited him today and his mom's funeral today and pastor Tate will be preaching that funeral this afternoon. So I get to have the pleasure of introducing Dr. Benny Tate has served for over 30 years as a senior pastor at Rock Springs Church in Milner, Georgia. Under his leadership the church has grown in attendance from 80 to more than 8,000 people. Rock Springs Church has multiple thriving campuses across Middle Georgia as well as an online campus. The following ministries are part of Rock Springs. Rock Springs Medical Clinic which is incredible. Rock Springs Christian Academy, the powders house for women in impact street ministry that cares for our homeless. Dr. Tate serves as the president to the congregational Methodist denomination and has served many times as a chaplain in the United States Senate and the United States House of Representatives in Washington. Dr. Tate is the author of Defy the Odds. Everybody in here has received a copy of that. This book encourages all of us to believe that God can overcome the odds of any life. He is passionate about encouraging and supporting others leaders as well as ministries. His heart for developing leaders is a motivation for what he continually provides resources for growing churches. He enjoys teaching and encouraging others through his lead club podcast. Connecting with others in a social media community as well as teaching through Defy the Odds Growth for churches. He and his great wife Barbara have been married for 37 years and their daughter is Savannah Abigail which I'm not going to tell you whole she is because I was embarrassed and they currently reside in Forsyth County. Please welcome Pastor Penny Tate. Thank you. Good morning. Miss Karen after all that I'm looking forward to hearing myself. Amen. Just out of curiosity I've been coming here for 30 years. How many of us say Pastor Penny I've never heard you before. I've never heard you before. I've never heard you before. Anybody? Anybody just a few of you? Well I say to you if you want a list of Taylor said to eighth husband I'm not going to keep you long. Amen. All right. Listen I do hope we can have some fun. I will be brief. I understand your time is very valuable and I appreciate the service and sacrifice that every one of you give to our wonderful state. I realize this is a sacrificial role and I appreciate everything that you do. I just want to take a few moments and I want to talk to you about the power of words. The power of words. The Bible says in Proverbs 18 and 21 that death and life is in the power of the tongue. That death and life is in the power of my tongue. The Bible says in Proverbs 13 and 2 that we eat the fruit of our words. That is what we say is what we become. And then Proverbs 25 and 11 says a word fitley spoken is like apples of gold and pictures of silver. The Bible says in Genesis 1 and 3 and God said let there be lot. Now think about this this world that we live in. This world the rocks the reels the hose the heels the birds the bees the flowers and the trees this world that we get to live in was created by words God spoke it into existence. So if our world is spoken into existence words are so powerful see words created this world and this is what I've learned words will create your world and words will create somebody else's world. The words we say to ourselves are very powerful. Anybody that knows me knows I'm a devout sports sports fan. I love sports. I especially love football back when college football was going on my wife got frustrated because I was watching so many games. And on one occasion she looked at me and she said Benny do you love me more than football. I said college or pro. Amen. But I remember there was a picture his name was Gaylord Perry. Anybody old enough to remember Gaylord other than me. Yes some of you yes speaker here speaker here can Gaylord Perry Gaylord Perry in 1963 said these words. You can talk this is documented he said before I ever had a home run they will put a man on the moon. Before I ever had a home run they will put a man on the moon. This is documented he said that in 1963 in July the 20th 1969 we put a man on the moon. Documented two hours later Gaylord Perry hit the only home run of his career. Here's all I'm going to say the words we say to ourselves ladies and gentlemen are so powerful. Well I want to tell you something else the words we say to others are powerful to speaker and I were discussing he was talking about North Georgia. I was talking about the hills of Tennessee that's where I'm from it's just a unique area just a little area in Tennessee just a country rule area. Actually where I came from a tornado went through there and did $50,000 worth of improvements I mean just a just a little bit more of my life. But we were talking about growing up and growing up in that rule area and we just have a Sticks and stones may break my bones, but words will never harm me. I've got a great word for that. Hugwash. Words do harm. Because words are powerful. And the words we say to ourselves are powerful. And the words we say to other people are very, very powerful. I heard about a lady that was in her 70s and she was driving down the road and she was going rather fast and a deputy sheriff pulled her over. And he said, Ma'am, you were going 70 in a 40. And he said, I need to see your license. She said, I don't have any license. She said, I've had so many DUIs they've taken them. He said, okay, and he said, I need to see registration for the car. And she said, there is no registration. She said, I stole this car. She said, actually, I killed a man and he's in the trunk. He said, wait just a minute. He took his phone. He said, Sheriff, you need to come immediately. You need to come immediately. Please come immediately. And the sheriff gets there and he tells the sheriff what's going on and they open up the trunk of the car. And when they open up the trunk, it's completely empty. And the sheriff looks at the deputy. Then the sheriff says to that lady, can I see your license? She said, certainly, right here they are. And then he said, well, do you have proof of registration for this car? And she said, well, sure I do. It's right here in the glove compartment. Sheriff, I want you to see it. And he looked over to the deputy and he said, there's no dead body. She's got license. She's got vehicle registration. And she spoke up and she said, yeah, and I bet you he told you I was going 70 and a 42. See the words we say are so powerful. Listen, in concluding this morning, in concluding. Little girl stayed on out with my daughter who didn't get to go to church and I said in conclusion and that little girl said, what does it mean when your daddy says that? Savannah Abigail said absolutely nothing. But I promise you in conclusion. God spoke two times from heaven directly to his son. Just two times. It was at his baptism and at the transfiguration. And this is what he said from heaven. He said it where people could hear him. This is my beloved son. And whom I'm well pleased. And I've always thought, well, if God, the one who didn't begin when the beginning began, but the one who began the beginning, the one who didn't start with start, but the one who started start. The one who was before there was a was. The one who's the creator, the ultimate one that one day we're going to stand before. If he said something to his son, I really need to take record of it. He said, this is my beloved son in whom I'm well pleased. He let him know three things. He let him know number one, you belong. I was raised by stepfather who told me I was ignorant, illegitimate, and would never amount to anything. He, every time he introduced me, he would say, this is my stepson. My stepson, God said, this is my son. He was saying, you belong. You know what young people need to hear, they belong. You know what we all need to hear, we belong. This is my beloved son, beloved. People need to hear their beloved. They need to hear, they belong, but they need to hear that they're loved. They need to hear their loved. Now, I'll tell you something else. They need to hear that we're proud of them. Let me just say this, folks. It's wrong for me to be proud of me. Pride in my life is wrong. But it's not wrong for me to be proud of you. And if we'd let one another know that we're proud of each other, perhaps we wouldn't struggle with pride like we do. I didn't mean to say all that, but it felt pretty good. Words are powerful. The words we say to ourselves are powerful. And the words we say to other people are powerful. Somebody said a careless word may kindle strife. A cruel word may wreck a life. A bitter word may hate and steal. A brutal word may smide and kill. But a gracious word may smooth the way. A joyous word may lot in the day. A timely word might just lessen stress. A loving word might heal and bless. Let's just watch our words, because words are powerful. Let us pray. Lord, as I bow my head, it's a real honor today to be with Speaker Ralston. I've been with him now many, many years, and I thank you for his friendship. I thank you for this body. These are wonderful people. They mean much to me. Their service means much to me. That they would sacrifice for people just like me every day. Come up here and give 40 days and a year, and then on top of that so many days, serving in their districts and taking calls and field in responsibilities. Thank you for these people. Not only do I pray for every representative, but I pray for their families. Because it's an equal, maybe even greater sacrifice on their families. And when I think about sacrifice, I pray for the people in the Ukraine. I really do, God, I pray that your protection, the Bible says the angel of the Lord encamps around about them that fear him. Would your angels just encamp around those precious people? And also, I'm conscientious that they're Russian people who they don't want this God. They're in a difficult situation. Many of those people that are just common every day people, I ask you to comfort them and help them. God, thank you for this delegation. I pray that you would bless us and keep us. Make your face to shine upon us, be gracious unto us. Lift your countets, bonus, and may we experience your peace. For I pray this prayer in Christ's name. Amen. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God, indivisible, with liberty and justice for all. God for God. Do our keepers, we'll unlock the doors. Amen. Members may greet the chaplain in the south, Annie Room. The chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, they say, milk is good for your teeth, so is mine in your own business. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? Chair here is not in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on 59th, those following will be established as the order of business.\n\nFirst part of the period unanimous consent. Introduction of bills and resolutions. First reading and reference of bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. Third reading and passage of uncontested local bills and resolutions. First reading and reference of senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is not in the resolution is adopted. First reading of bills and resolutions. The resolution is a clerical read. House Bill 1475. I remember some of the lever to the 33rd bill of the tunnel act to create a board of elections and registration for Albert County. The enter government coordination House Bill 1476 by the represent of the lever to the 33rd of the Bill of the tunnel act to amend the act to amend consolidate the supersede several acts incorporating the city of Colbert. The enter government coordination House Bill 1477 by the represent of the Stevens on 64th Bill of the tunnel act to amend Article 1 of Chapter 16 of Title 45. The official go to Georgia and Tate relating the general provisions relative to court. House Bill 1478 by the represent of the Ridley the 6th part of the 32nd Corv. of the 174th, Perkville of 155th and Tarvin of the 2nd. Bill of the tunnel act to amend Code Section 43, 33, the official go to Georgia and Tate relating the transfer of vehicles, 2 were from a dealer. House Bill 1479 by the represent of Corv. of the 174th Watson and the 172nd, House Bill 175, the 159th Dickey the 140th Bill of the tunnel act to amend Part 2 of Article 1 of Chapter 6 of Title 12. The official go to Georgia and Tate relating the practice of national resources and environment. House Bill 1480 by the represent of Gamble with 15 scogins the 14th bird of the 20th and Kelly the 16th, Bill of the tunnel act to amend Article 7 of Chapter 8 of Title 34, the official go to Georgia and Tate relating the employment security benefits. House Bill 1481 by the represent of Jasper's the 11th of the Bill of the tunnel act to amend Code Section 42, 38, the official go to Georgia and Tate relating the registration and licensing of manufacturers. Motor vehicles. House Bill 1482 by the represent of Irwin of the 28th Corv. of the 174th year and the 150th second, Chocus the 138th Dubnic of the 29th and others, Bill of the tunnel act to amend Code Section 2262, the official go to Georgia and Tate relating the low wealth capital and health like. Education House Bill 1483 by the represent of Barton the 5th hatch of the 150th, Cooper the 43rd Hutchinson the 100th and 7th Dempsey the 13th and others, Bill of the tunnel act to amend Article 1 of Chapter 10A of Title 43, the official go to Georgia and Tate relating the licensing provisions regarding professional counselors. House Bill 1484 by the represent of Hawkins the 27th, Ben of the 94th, Gravelay the 67th, Cooper the 43rd, Green and the 150th and others, Bill of the tunnel act to amend Article 7, Chapter 4, Title 49, the official go to Georgia and Tate relating the medical assistance generally. Health and human services House Bill 1485 by the represent of Smith the 18th to Lodge the 167th, Green and the 150th, Chocus the 32nd, Evans the 57th, Bill of the tunnel act to amend Part 1 of Article 2, Chapter 8 and Title 12, the official go to Georgia and Tate relating the Georgia comprehensive solid waste management act. Natural resources and environments House Bill 1486 by the represent of Lurikia the 169th, Saints the 180th, Ridley the 6th, Hill of the 3rd, Year to the 150th, Bill of the tunnel act to amend Article 8, Bill of the tunnel act to amend Code Section 48, 83, the official go to Georgia and Tate relating the exemptions from sales and use ways it means House Bill 1487 by the president of Fry the 118th, Evans the 8th, or the Drenner the 85th, Scofield the 60th, Lewis Ward of the 100th, and others Bill of the tunnel act to amend Title 46, the official go to Georgia and Tate relating the public utilities, the energy utilities and telecommunication House resolution 878 by the represent of Lurikia the 169th, Perkola, 155th, Perch Head of the 176, Luhur to the 175th, Corbord to the 174th, Resolution Honoring Private First Class Charles E Day and Sargent First Class Jerome Day and Degenerate House Resolution 879 by the represent of Stevens the 164th, Resolution urging the 117th Congress and Georgia congressional delegation to support the United States. Economic development and tourism House resolution 880 by Resolution Scofield the 60th, Smith the 18th, Thomas the 65th, Kirby the 114th, and Scott the 76th Resolution encouraging the support of urban farming by local government, Agriculture and Consumer Affairs House resolution 881 by Resolution Jackson 128th, Belt and 112th, Williams on 68th, Way to the 9th, Irwin to the 28th and others Resolution encouraging each public school in the state to study the civil rights error. Education House resolution 894 by Resolution of Camp 130th, Limit the 99th, Resolution proposing an amendment to the Constitution to provide the General Assembly Shelby and Tiled a specific, appropriate, all-land, unanticipated federal funding. Budget and fiscal affairs oversize House resolution 895 by Resolution Chokus on 38th Resolution creating the House Study Committee on Electric Vehicle Charging Teriffs. Energy, Utilities and Telecommunications Senate Bill 337 by Senator Walker the 20th, Guget to the 51st, Carpatcher to the 32nd, Antitivarty, 31st, Hickman to the 4th, Billing Tidal and Act to amend Chapter 5, Title 45, the Fischkoda, Georgia, Antitio relating to vacation of office. Governmental affairs Senate Bill 436 by Senator Thompson the 14th, Carpatcher to the 32nd, Miller to the 49th, Guget to the 51st, Hatch to the 50th and others, Billing Tidal and Act to amend Title 31 of the Fischkoda, Georgia, Antitio relating to health. Halton Human Services Senate Bill 496 by Senator Burke of the 11th, Watson to the 1st, Tillery of the 19th, Carpatcher to the 32nd, Huffstettler to the 52nd and others, Billing Tidal and Act to Menarch to the 16th, Title 45, the Fischkoda, Georgia, Antitio relating to death, investigates the House Study Committee on the 50th and the 50th, Halton Human Services Senate Bill 500 by Senator Strickland the 17th, Walker the 20th, Canada the 18th, Cows of the 46th, Jones the 22nd and others, Billing Tidal and Act to amend Title 10 of the Fischkoda, Georgia, Antitio relating to commerce. Judiciary Senate Bill 511 by Senator Anderson the 24th, Dugan the 30th, Mellos the 53rd, Miller to the 49th, Walker the 20th and others, Billing Tidal and Act to amend Code Section 485, 311 of the Fischkoda, Georgia, Antitio relating to the creation of the 50th, Decaution of the County Board's Equalization, Senate Bill 514 by Senator Dixon the 45th, Miller to the 49th, Goode to the 51st, Albers the 56, Mellos the 53rd and others, Billing Tidal and Act to amend Chapter 2, Title 20, Fischkoda, Georgia, Antitio relating to the elementary and secondary education. Education, that completes First Readers. Second reading of bills and resolutions, the Clarkoreed. House Bill 1462 by Representative Corporate of the 174th, Preshed of the 176th, Road to the 120th, the Hood of the 175th, Tarvan of the 2nd and others, Bill relating to primaries and elections, House Bill 1464 by Representative Perchett of the 176th, Bill Hood of the 175th, Smith of the 70th, Richard the 97th, the Hood of the 174th and others, Bill of the Layton's General Provisions regarding the Georgia Bureau of Investigation, House Bill 1467 by Representative Sains of the 180th, Smith of the 134th, Bruce of the 61st Taylor, the 173rd, Smirer of the 135th and others, Bill relating to the Department of Administrative Services, House Bill of 1473 by Representative Sains of the 176th, the Hood of the 175th, Corporate of the 174th, Gamble of the 15th, the Bill relating to Operation of Trains at Crossings, House Bill 1474 by Representative Maynard 1556, Richard the 97th, Wilkinson of the 38th, Cantrell of the 22nd, Wade of the 9th, the Bill relating to Competencies and Court Curriculum under the Quality Basic Education Act, House Resolution 867 by Representative Gantra of the 8th, the Resolution honoring the life of Chair of Chair of Jay Vernon Chastain Senior, dedicating an intersection in his memory, House Resolution 868 by Representative Wynn of the 89th, Shannon of the 84th, of the 77th Park of the 101st Roberts of the 52nd and others, Resolution proposing amendment to the Constitution, so this to provide that all elections shall be fair and free, House Resolution 877 by Representative Maynard the 56th, that's the 35th Jones of the 25th Wilkinson of the 38th, Smith of the 41st, Resolution encouraging the Department of Education to dedicate personnel funds and other resources to statewide outreach efforts to promote and improve cybersecurity education training and workforce development. Senate Bill 259 by Senator Mellus of the 53rd, due to the 51st Miller of the 49th Harper of the 7th, the Bill relating to Dangerous Instrumentalities and Practices, Senate Bill 319 by Senator Inard Vartey of the 31st, Payne of the 54th, Thompson of the 14th, Robertson of the 29th, Hickman of the 4th and others, the Bill relating to General Provisions regarding Parks and Historic Areas, Memorials and Recreation, Senate Bill 472 by Senator Kennedy of the 18th, the Bill relating to Organization Members of the Public Service Commission, Senate Bill 479 by Senator Hatchett of the 50th Miller of the 49th Dugging of the 38th, due to the 51st Mellus of the 53rd, and others, a Bill relating to Possession of Firearms by convicted felons and First Avenger Probations, Probationers, 3 Second Readers. Reports of Standing Committees, the clerk will read. This has had a consideration following the Bill's of the House and Senate. It's instructing me to report the same back to the House of the following recommendations. House Bill 1381, due pass, House Bill 1382, due pass, House Bill 1385, due pass by Committee Substitute, House Bill 1405, due pass by Committee Substitute, House Bill 1406, due pass by Committee Substitute, Senate Bill 346, due pass by Committee Substitute, respectively submitted, Darling Taylor, 173rd District Chairman. Representative Sharon Cooper, the 43rd District Chairman of Committee on Health and Human Services, submitted the following report. And speaking to your Committee on Health and Human Services, it's had a consideration following Bill's of the House and the Senate. It's instructing me to report the same back to the House of the following recommendations. House Bill 1013, due pass by Substitute, House Bill 1279, due pass by Substitute, Senate Bill 256, due pass by Substitute, respectively submitted. Representative Sharon Cooper, the 43rd District Chairman. Representative Markner, the 49th District Chairman of Committee on Higher Education, submitted the following report. We'll speak to your Committee on Higher Education, sat in a consideration following Bill's of the House. It's instructing me to report the same back to the House and the following recommendations. House Bill 1043, due pass, House Bill 1013, 19, due pass by Committee Substitute, respectively submitted. Representative Markner, the 49th District Chairman. Representative Bill Work Eyes, the 157th District Chairman of Committee on Industry and Labor, submitted the following report. We'll speak to your Committee on Industry and Labor, and sat under its consideration following Bill's of the House and the Senate. This is instructing me to report the same back to the House and the following recommendations. House Bill 849, due pass by Committee Substitute, House Bill 1331, due pass, House Bill 1409, due pass, Senate Bill 331, due pass, respectively submitted. Representative Bill Work Eyes, the 157th District Chairman. Representative Jan Tancers, the 160th District Chairman of Committee on Intergovernmental and Coordination Locals, submitted the following report. We'll speak to your Committee on Intergovernmental and Coordination Locals, sat under the consideration following Bill's of the House. Instructive media report, the same back to the House and the following recommendations. House Bill 1430, due pass, House Bill 1465, due pass, House Bill 1471, due pass, respectively submitted. Representative Jan Tancers, the 160th District Chairman. Representative James Berchett, of the 176th District Chairman of Committee and Judiciary Non-Civil, submitted the following report. We'll speak to your Committee on Judiciary Non-Civil, sat under its consideration following Bill of the House. Instructive media report, the same back to the House and the following recommendations. House Bill 9060, passed by Committee Substitute, respectively submitted. James Berchett, of the 176th District Chairman. Representative J. Collins, the 68th District Chairman of Committee on Public Safety and Homeland Security submitted the following report. We'll speak to your Committee on Public Safety and Homeland Security, sat under the consideration following Bill's of the House. Instructive media report, the same back to the House and the following recommendations. House Bill 1358, due pass, by Committee Substitute, House Bill 1378, due pass, by Committee Substitute, House Bill 1455, due pass. Instructive media report, the same back to the House and the following recommendations. Senate Bill 472, due pass, respectively submitted. Representative J. Collins, the 68th District Chairman. Representative Houston Gaines, the 117th District Chairman of Committee on Legislative and Regressional Reapportionment submitted the following report. Instructive media report, the same back to the House and the following recommendations. Senate Bill 472, due pass, respectively submitted. Representative Houston Gaines, the 117th District Chairman. Representative Allen Powell, the 32nd District Chairman of Committee on Regulated Industries submitted the following report. Instructive media report, the same back to the House and the following recommendations. House Bill 1193, due pass, by Committee Substitute, House Bill 1400, due pass, House Bill 884, due pass, by Committee Substitute, respectively submitted. Representative Shaw Blackman, the 146th District Chairman of Committee on Ways and Means submitted the following report. And speaking of Committee on Ways and Means is that it hurts consideration. The following bills of the House, the Structle Media report, the same back to the House and the following recommendations. House Bill 1280, due pass, by Committee Substitute, House Bill 1039, due pass, by Committee Substitute, respectively submitted. Representative Shaw Blackman, the 146th District Chairman. Representative Sharon Cooper, the 43rd District Chairman of Committee on Health and Human Services submitted. The following report, I speak to your Committee on Health and Human Services, had a consideration following bills of the House. Instructive media report, the same back to the House and the following recommendations. House Bill 937, due pass, by Committee Substitute, House Bill 1042, due pass, House Bill 1953, due pass, by Committee Substitute, respectively submitted. Representative Sharon Cooper, the 43rd District Chairman. I request the reading of the report to stand in committees. Thank you. All right. We're going on down to the local calendar. Going on to the local calendar. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. The clerk will read the local calendar. House Bill 1430 by resident Williams, the 148th, Crisp County, House Bill 1465 by resident Campbell, the 171st, Mitchell County, House Bill 1471 by resident Burwin, the 28th, Stevens County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote I. All those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of the bills on the local calendar, the eyes are 150, the nays are 9. These bills having received the requisite constitutional majority are therefore passed. What purpose does Chairman Tancersley rise? I rise to make motion. State your motion. I move. We immediately transmit the local calendar to the Senate. Chairman Tancersley has moved that the bills just passed on the local calendar be immediately transmitted to the Senate. Is there objection? Is there objection? Chair, here is none and it is so ordered. We are going on now to morning orders. Going on to morning orders. Chair is going to limit morning orders to one minute each. Chair recognizes Chairman Chokus. I don't know if this is a minute. Some of these morning orders deserve a little respect and attention. I am going to ask you if you would give attention to the members and the well as you would not give attention to you. Chair recognizes Chairman Chokus for a morning order. Thank you, Mr. Speaker. Good morning, ladies and gentlemen. I have placed on your desk yellow and blue ribbons to wear on your lapel. They represent the colors of the Ukrainian flag. As we have seen over the last week, the courageous people of the Ukraine have been defending their democratic country against the unprovoked, brutal and savage attacks of Putin's Russian aggressors. We stand with me as we honor the bravery of the Ukrainian people and the memory of the lives being lost in this war. Thank you. Chair recognizes Representative Hagen for a morning order. Thank you, Mr. Speaker. Representative Mallow and I wanted to bring to your attention that next Wednesday, March 9, is Scout Day at the Capitol. And you should have received an email about this a week or two ago from Senator Strickland's office. If you didn't, please let me or Representative Mallow know we will make sure we have that forwarded to you. But at 815, there will be a meet and greet with the Scouts here and from 8 to 10, they're going to have breakfast for us to pick up. So my Scout will be here and I just encourage you to come by and support these young people and the hard work that they do. And please, there's a link in that email that I referred to. It would help the Scouts out if you would RSVP to let them know that you're going to come by so that they can have enough food for us. Thank you. Chair recognizes Chairman Bershitt and Chairman Carpenter for a morning order. Thank you, Mr. Speaker. Today is a great day in the state of Georgia, a beautiful day outside. It's been a great year. We had the Braves win the World Series, the Dogs win the National Championship. And then for the first time, the House defeated the Senate and the annual kickball tournament yesterday. Thank you. 8 to 5. At one point it was 62. So thank you for all your participation. We look forward to this next year. Thank you, Mr. Speaker. And if you see us limping around, please don't make fun of us. We're just happy you're not in the hospital today. Chair recognizes Representative Holly for a morning order. Thank you, Mr. Speaker. Hello, colleagues. As you know, tomorrow is Georgia STEM Day, commemorating our local schools focused on science, technology, engineering math, and educating young minds of tomorrow. I want to highlight the work of Henry County Schools will soon be groundbreaking a new initiative in the STEM program and Stock Bridge community. And a very special thanks to the Southern Crescent Women in Business hosting a one day seminar for tomorrow, a working cooperation with Metamorphosis Powerhouse Company, as well as Henry County Schools and our beloved Technology Association of Georgia. So thank you, colleagues. So remember, let's do as God would expect us and be able to cherish our children, whether rural, whether urban, the way with very strong funding and positive advocacy. Thank you. I yield the will. Chair recognizes Representative Dukes for a morning order. Thank you, Mr. Speaker and members of this of this body. When you have an opportunity, I would like for you and client to to come by and sign a piece of legislation for Colorful Study Committee. It's for the expansion and national competitive. It's Georgia agriculture. You know, we're number one in P. Ness, a lot of staying. And what I would like for us to do is to see if we can expand that to a greater state. Right now, we're 2% of the agriculture sales in the United States. I think we can do better than we should. All right. We are about to go on to the rules calendar. We do have a motion to take up beforehand. What purpose does Chairman Chair recognizes? Chairman Carson for a motion. Mr. Speaker, I move this House agree to the Senate's substitute for House Bill 517 as amended. Chairman Carson is moved at the House agreed to the Senate's substitute to House Bill 517 as amended. The clerk will read the caption. House Bill 517 to be titled an act to amend. Chapter 2A, a title 20, the fiscal to Georgia and Tadavillian, student scholarship organization says it will provide the inclusion of earned interest in the calculation of minimum revenue obligations for scholarship and tuition grants. Chair recognizes Chairman Carson to explain the Senate's substitute and the amendment. Thank you, Mr. Speaker. I rise to ask for your favourable consideration for House Bill 517. This is a bill that we passed in February, I believe, of last year. We are basically incorporated about 12 new transparency and disclosure requirements as a result of the Department of Auditoring accounts doing a review of the SSO program. So we've incorporated those items. This House passed that measure back in February of last year and we sent it to the Senate. We passed for the allowance of credits to be used against insurance premium tax. So we are doing that in this bill as amended. This is going to increase school choice in Georgia. This increases the tax credit scholarship by 20 million per year starting at 120 million next year. And from that, 5% will be reserved solely for Title 33 or insurance premium taxes. With that, Mr. Speaker, I do hope everyone can support this. This is a very popular program to support school choice in Georgia. This is very popular, not just with majority party voters, but minority party voters as well in a general election. And this program continues to be fully subscribed just about every year the past 10 years except for about a million a half dollars last in 2020 to the COVID. I do hope this body can support school choice and give parents the choices they wish with their with their child's education future. With that, Mr. Speaker, I will yield the wealth. Is there any objection to the adoption of the House amendment? Is there any objection? Chair, here's none in the amendment is adopted. On the gentleman's motion that this House agree to the Senate substitute, the House Bill 517 has amended by the House, all those in favourable vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose is representative McLaren rise? The State are inquiring. Mr. Speaker, is it not true that when I was going door to door, cutting my teeth on politics in 2018, one of the Republican voters I talked to said she was a single issue voter in North Fulton, and the only issue she cared about was investigating abuse and fraud in this program and asking me to promise her that I would look into the way that these funds are misused. Is that not true, Mr. Speaker? If the gentleman's so states, I wasn't helping you go door to door. So, have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 94. The nails are 66. This bill or the motion having received the requisite constitutional majority is therefore passed. What purpose does Chairman Carson rise? To make a motion. State your motion. I move for immediate transmittal of House Bill 517 to the Georgia Senate. Chairman Carson has moved for immediate transmittal of House Bill 517 to the Senate. Is there objection? There is objection. All those in favour of immediate transmittal will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted.\n\nhave all members voted. If so, the clerk will lock the machines on the gentleman's motion for immediate transmittal. The eyes were 94. The nasa 63 and the bill is being immediately transmitted to the Senate. All right, we're going on now to the rules calendar going on to the rules calendar. Clerk will read the caption to House Bill 1058. House Bill 1058 by resident Williams into the 115th and others to be entitled an act to amend Code section 48721 of the relating to income taxation of corporations. Those remove the requirement to affiliate corporations while separate income tax returns. This bill I'm referring to the committee on ways and means that committee recommends a disbilled do pass by committee substitute. Chair recognizes representative Williamson to present the bill. I can miss the speaker members of the House to you House Bill 1058 by committee substitute LC 500350 ERS. This bill simply allows holding companies to file a consolidated stating income tax return by their election. Previously we had they had to get approval the department of revenue. The department of revenue is fine with this bill. There's been no objections. Happy to answer any questions otherwise I'll yield the well and ask for your favorable consideration. Just speaker I yield the well. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to adopting the committee substitute the chair here is none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here is none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. Have all members voted have all members voted if so the clerk will lock the machine on the passage of House Bill 1058 the eyes are 163 the nasors 0 this bill having received the requisite constitutional majority is therefore passed. Clerk agreed to caption the House Bill 1348 House Bill 1348 by words of rich of the 97th to be entitled act to amend chapter 12 of title 16 in fiscal to Georgia and Tederallign offenses against public health and morals so survived the vaping in restricted areas as a misdemeanor punishable by fine this bill ever further the committee on health and human services that committee recommends that this bill do pass. Chair recognizes chairman Bonnie rich to present the bill. Thank you Mr. Speaker colleagues I bring to you today House Bill 1348 this is a bill that was requested by the Georgia Department of Public Health it will update the smoke free air act to bring parity to the law so that we treat vaping and traditional smoking the same this issue was actually brought to my attention and to the attention of the Department of Health by our local director for Gwyneth Newton Ruckdale the current smoke free act was adopted in 2005 before vaping became widely popular 2019 data from the door the Department of Health indicates that only 16.3% of people smoke but more than 21% of high school students either smoke or vape clearly the previously unregulated electronic cigarette industry has surpassed smoking as a more prevalent threat to our community unfortunately the current laws that prohibit smoking in enclosed places like restaurants daycare centers government buildings and schools do not apply to vaping electronic smoking devices called collectively ESDs they don't emit harmless water vapor despite the fact that the industry has given it the mis name or the misnomer vape electronic smoking devices and so-called vapes in fact emit aerosol not harmless water vapor nano particles in these ESD in this ESD aerosol contain nicotine and toxins including formaldehyde and lead these nano particles are much smaller than the particles in tobacco smoke and present in much higher concentrations making this even more dangerous nano particles are more easily and deeply breathed into the lungs of the user and the bystander toxic chemicals attached to nano particles may therefore have even greater adverse health effects than when these toxins are attached to larger tobacco smoke particles ESD particles can exacerbate respiratory conditions like asthma they can constrict arteries this aerosol can increase the risk of cardiovascular disease and causes contain cancer causing chemicals too many sees there that is quite the alliteration that's why the Georgia Center for oncology research and education is also in support of this bill as well as the American College of Physicians Georgia chapter the Academy of Family Physicians healthy mothers healthy babies Georgia the Georgia Society of clinical oncologists voices for Georgia's children and the American Academy of Pediatrics so this measure will bring Georgia in line with 21 other states including our neighbors Florida and Alabama that prohibit e-cigarettes and locations where traditional smoking is prohibited and will greatly protect the health of the public and our young people at this time mr. Speaker I will yield for a question do you yield you do have a question yes I do chair recognizes representative sames do you write for a question just does the general lady yield I do is it not true that vape is one of the leading substances based on the Georgia student health survey and rising from middle and high school students in our state yes it act it is you're exactly right and that and is it not further true that there's growing concern that that leading that increase use will lead to an increase in tobacco use yes there is evidence that that is actually in fact happening thank you for the questions mr. Speaker no further questions and I yield the well thank you lady is yielded the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote I those opposed to vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machine on the passage of house bill 1348 the eyes are 149 the knees are 12 this bill having received the requisite constitutional majority is therefore passed clerk will read the caption the house bill 508 House bill 508 by the wayperners of carpenter the fourth to be entitled an act to amend chapter one entitled ten of the fish go to Georgia antenna relating to selling and other trade practices so it's to provide protection for commercial recordings musical performances and audio visual works this bill have referred to the committee uncreative arts and entertainment that committee recommends this bill do pass chair recognizes chairman carpenter to present the bill thank you thank you speaker members of the house house bill 508 is a simple bill brought to me by the music industry and it basically addresses two issues the first issue is about representing yourself as an artist when you don't have the right to do that and it's just clarifies in Georgia code what you have to do to be able to say your particular groups say the four tops or the Beatles or somebody else either have to be an original member or you have to have that right and then the other piece of the bill deals with online streaming services making sure that they list and advertise how to get in touch with them to make sure that they are collecting and paying royalties to the artist so it's a simple bill that protects Georgia artists and I appreciate your favorable consideration and I'll yield for any questions you got a few questions if you care to yield yes yes sir I'll yield chair recognizes the Dean of the house Dean Smirre to your left for a question Jim and you know what you're doing yes sir tell us again because I this is a good bill and I'm interested in it but the aspect that deals with the royalties and make it rightfully so that people who made songs over the years would still benefit from the creative act over the years that's correct so so a lot of the big guys like Pandora and Spotify they're paying royalties to these artists but there's a lot of new new up and coming services I call them pirate streaming services that are not doing that so this would just require them in the state of Georgia to list contact information so that the BMI's of the world can go after it and make sure they're paying their rightful share to the creative folks I yield for one more speaker to recognize this representative Glanton to your right for a question thank you miss speaker with a gentleman you yes sir is it not true that DJ's are not caught up in this that's correct it strictly it only applies to to someone that represents themselves as the Beatles or as the four tops they can still continue to people can send you to play as a tribute band if you will but it just says if I'm going to advertise in the state of Georgia the four tops is playing over here at the Fox then it has to either be a member of the four tops or they have to have the legal ability to do so under copyright law follow up question yes sir so this wouldn't have anything to do with a DJ just doing mixed tapes that's correct or good thank you sir and on sir mix a lot I yield the well gentleman is yielded well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machine what purpose is representative Erica Thomas rise parliamentary inquiry is it not true that this bill is a simple bill that helps to protect artists and also helps people to be able to get their royalties and that streaming services like Pandora and Spotify are already doing this but we are just protecting artists from Jo Jo's radio dot com type of people I think the lady is accurate what purpose is representative Beth Moore rise parliamentary inquiry is your inquiry isn't it true that for myself as an attorney who represents artists and musicians every day that I am fully in support of this bill the lady so states have all members voted have all members voted if so the clerk will lock the machines on the passage of House bill 508 the eyes are 164 the nasor one this bill having received the requisite constitutional majority is therefore passed clerk will read the caption the House bill 1355 House bill 1355 by room so I'm seeing the 13th and others to be entitled to amend chapter 41 title 31 of the fish go to Georgia and Tato relating to lead poisoning prevention so sub-day provisions to comport with nationally recognized guidelines this bill ever heard of the committee on health and human services that committee recommends a dispel to pass chair recognizes chairman Dempsey to present the bill thank you mr. Speaker and members of the House I want to take first of all how great I'll look the ones that have lost their mask because I'm going to tell you I have mr. smile so it's good to say everybody first of all House bill 1355 I want to draw attention to the two handouts that are on your desk today that are really important especially this map look and see look and see where you are and where perhaps there may be a lead challenge HB 1355 comes to us from the work of a House study committee on childhood led exposure that convened during the summer and fall represent dr. Gammel Maynard chairman Newton and dr. Chris Rustin with the Department of Public Health served on this committee and we found out some really startling things I would say about how pervasive lead is and our hands and in our communities and the main thing I want you all to realize is that the effects in children can be completely impossible to reverse permanent brain damage behavior disorders lifelong challenges that we of course see in other places in their life as they travel so protecting children from lead and that exposure is important to their healthy development the CDC says there is absolutely no safe blood level in children and even small amounts affect the IQ and attention span and academic achievement as well as the developmental disabilities that can come from that the most at risk are children under six years of age and children living at or below the federal poverty level especially those who live in older housing very near to where we are today on the other side of Mercedes Benz while we were meeting it was designated as a lead supersite a federal supersite very important that we look at this and deal with it the main thing that the bill does is to lower but bring us into compliance with the federal standards of how much lead can actually be in a child's blood for it to have this impacted also brings into much more reasonable time frame the reporting and remediation there's a lot more that we can do on this and I hope that we will in the years ahead but right now this a great way to start to protect our children and families from permanent damage due to lead exposure mr. speaker I will yield the well or if there are any questions I will be glad to take them you have no questions thank you ask for your favorable support is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines what purpose does representative Maynard rise parliament here in the park is it not true that the rep the community that I represent is listed as an EPA super fun site so has the most lead exposure in the entire state of Georgia and sometimes nationally if the lady so states have all members voted have all members voted if so the clerk will lock the machine on the passage of house bill 1355 the eyes are 163 the nasa zero this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 1349 house bill 1349 I represent ridley the sixth and others to be titled back to men code section 2713 the fish go to Georgia annotated relating the legislative declarations ownership and custody of wildlife preservation of hunting and fishing opportunities and promotion and right to hunt trap or fish this bill ever for the committee on game fishing parks that committee recommends that this bill do pass chair recognizes representative Ridley to present the bill thank you mr. Speaker ladies gentlemen I know you all have make out an email or two about this bill I think everybody's box is a or full but I think that shows the passion that our hunters have here in Georgia and how important this is to them and for us as a state this is house bill 1349 and I know this bill don't does don't do hardly anything at all except the main thing it does is change the date online 15 to 2022 the reason you're getting all these emails and what this bill really does is in 2005 we took in about 200 to 300 thousand acres that we have protected in the state of Georgia for hunting fishing and for outdoor activity we've not done this bill since then since that time we took in another 200 thousand and what this does is this protects that land keeps us for hunters and fishermen keeps it out of developments in our state and less people come from the outdoors from all over the country and enjoy their state and that's what the bill does mr. Speaker I'll take any questions about having you have no questions make serve I yield well is there any objection to the previous question being ordered chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines what purpose does chairman tarven rise parliament inquiry state your inquiry mr. Speaker is it not true that these lands are used for caving hiking and cycling about our citizens all over the state I believe the gentleman is correct make sure have all members voted have all members voted if so the clerk will lock the machines on the passage of house bill 1349 the eyes are 162 the nasa zero this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 1324 house bill 1324 for resident camp 130 first and all this to be entitled act to amend chapter 11 total 31 and total 33 the fish go to Georgia and to overlay an emergency medical services and insurance respectively so to clarify the prudent layperson standard this bill ever further committee on insurance that committee recommends that this bill do pass by committee substitute chair recognizes representative camp to present the bill thank you mr. speaker and colleagues house bill 1324 is an interesting measure it passed something similar to this past in the Senate last year and we've improved it a little bit by changing the verbiage not just include medical but physical and mental if you go to the hospital or you feel like you might need to go to the hospital being a prudent layperson being an average person with the average medical knowledge which is pretty basic and you feel like you need to go to the emergency room at that point you go and you find out maybe the diagnosis is not a true emergency or you have gallstones not you're not having a heart attack in some instances insurance companies were not paying because the final diagnosis was not deemed an emergency this bill resolves that by by stating clearly if a prudent layperson believes someone's having an emergency the insurance will pay regardless of the final diagnosis mr. speaker I'm open to any questions you have no questions I'm sorry you do have a question do you yes or I do chair recognizes representative park to your left for a question thank thank you mr. speaker does the general lady you I do is not true that senator Michelle owl passed this bill out of the state Senate with bipartisan support yes she did and thank you for bringing that up as I mentioned it was SB 82 it passed the Senate in 2021 and we did make a few changes to the original bill but yes it did pass from the Senate thank you thank you so much representative no further questions thank you mr. speaker I yield the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here is none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines have all members voted if so the clerk will lock the machines on the passage of house bill 1324 the eyes are 165 the nasa zero this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 916 house bill 916 by representative lever of the 33rd and others to be entitled an act to amend title five of the fiscal to George Ante de la Nupil and error so as a provide for a unified procedure for appealing decisions of a lower judiciary to a superior or state court is bill ever referred to committee on judiciary that committee recommends the dis bill do pass by committee substitute chair recognizes representative lever it to present the bill thank you mr. Speaker ladies and general of the house it's my pleasure today to present to you for your consideration house bill 916 which is the superior and state court appellate practice act this is a bill that I've been working on the last month or two but the judicial council has been acidiously working on this bill for about the last five years and I believe it presents you today this vote presents you with an historic opportunity because one you are going to be able in voting yes for this bill to comply with the expectation of the prophet amus who in 515 said hate evil love good and maintain justice in the courts this bill will help do that secondly it will give you an opportunity to simplify the process of appealing from a lower court to a state or superior court and that is particularly unusual I think that I would have a bill appear that's been drafted by lawyers it's going to simplify something so it will comply with that biblical precept of amus and will also help simplify the process of appealing from from lower courts to to a spare and state courts and I believe the the the language of the bill itself states it better than I could in the findings that are made in the very beginning of the bill on lines 33 the general assembly finds that many appeals from a lower judiciary to a superior state court result in dismissal on complex procedural grounds and I\n\ndecision on the merits. It's the intent of General Assembly to establish a single modern and uniform procedure called a petition for review for appealing a decision by a lower court to a spare state court and to increase access to justice through the greater resolution of appeals on the basis of substantive issues rather than complex procedural grounds. Right now appeals from magistrate courts and probate courts and zoning boards and things like that are governed by a sort of patchwork of different statutes, the governed methods of appealing. They apply different procedures apply in different circumstances. It's not always clear which procedure you use and one of those procedures called a petition for surgery dates back to the mid 1800s and it is very complex arcane and unclear and frankly in the modern age nonsensical. So this would make would do a way with that particular process and replace all of that with one process called a petition for review. The code this bill would set out the form of that petition where it's to be filed, how it's to be filed, what it has to say. Admittedly it does go on for a bit of a length but that's to answer all those questions we lawyers like to ask. So this would allow people appealing from those lower bodies to have their cases heard on the merits whereas right now it's very difficult to do so because the process is so complicated a lot of people get tripped up by procedural technicalities. It's much like the scene in patent when he's taken over from general federal at the after the castering pass and beginning of the movie and he walks in and trips on a soldier and he says what are you doing soldier and he says I'm trying to sleep because we'll get back down there and you only see them again and say if it knows what he's doing this will at least make us all more able to know what the heck we're doing when we're appealing from lower courts to spear and state courts. So I would ask you to vote for this bill it allows cases to be heard on the merits which I think furthers the public faith and belief in the integrity of the court system and they're relying on it. So having said that I would ask your favorable consideration for House Bill 916 Mr. Speaker I'll yield for questions. I'm sure I speak for every member of this house when I say representative that was a riveting presentation. I noticed that I had everyone's wrapped attention. I wish it had never ended and I thought for a minute it never would and as a result you have a few questions. I'll yield for questions. Chair recognizes the chairman of the rules committee chairman Smith to your left. Does the gentleman yield? I yield. In relation to what the speaker just said could you repeat that? I can repeat it Mr. Chairman if you really want me to. No I didn't think so. Do you further yield? I'll yield for one more. Let's see here. The majority leader has a question. Chair recognizes leader Burns to your right for a question. Gentlemen yield. Yes or I'll yield. Not nearly as eloquent as all those folks you quoted but I think they said curiosity killed the cat. So my question is were you paid by the word for that presentation you just made or was that just something in public service? No sir it's for example of the injustice that exists in the world. Thank you Mr. Speaker. I'll yield and ask your favourable consideration House Bill 960. Gentlemen is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill. The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favour of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. What purpose does Chairman Dubnik rise? Parliamentary inquiry. I'll try to answer that but question is were you understand the answer? Mr. Speaker is it not stay chained. Mr. Speaker is it not true that if the great legislator Tom McCall was here he would have more than likely reference that the gentleman quoted General Patten reference biblical principles said that he was here to simplify things but isn't it true Mr. Speaker that Chairman McCall's response would be now that you've given us the lawyer long version could you tell us simple folks what this bill is trying to do. Yes but what's the lawyers don't know how to do that or choose not to do it do you let's take one more what purpose does representative Robert's rise Parliamentary inquiry. Isn't it true Mr. Speaker that I am a zoning attorney and I am going to defend Chairman Levert that this bill actually allows citizens to file their appeals and not have to process denied because of these little technical things like getting a cost certificate signed and a bond signed. I'm sure the lady knows about which she speaks and representative Robert Rivers I have to tell you that when you defended when you defended representative Levert he had a large smile on his face of comfort. I'm so glad. All right have all members voted if so the clerk will lock the machine on the passage of House Bill 916 the eyes are 167 the nasor zero this bill having received the requisite constitutional majority is therefore passed for what purpose does Chairman Martin rise. Mr. Speaker I rise to make a motion. State your motion. Isn't it true Mr. Speaker in the interest of time after the gentleman took a minute before I would move at this time to recommit HR 732 to the rules committee. Chairman Martin has moved at House Bill I'm sorry House resolution 732 be recommitted to the rules committee clerk will read the caption. I'm sorry I read the wrong one. What number was it. House resolution 732 by Chairman Martin 49 proposing a amendment to the Constitution so as to change the date by which temporary loans for counties municipalities and other political subdivisions are payable. All in the gentleman's motion that House resolution 732 be recommitted to the rules committee is their objection. Chair here's none and it is so ordered. Chair recognizes representative Mom to hand for a motion. Make to Mr. Speaker I want this House to agree to the Senate amendment to House bill 328 as amended by the House. Representative Mom to hand has moved at the House agree to the Senate amendment to House bill 328 as amended by this House the clerk will read the caption. House bill 328 to be entitled back to amend Article 1 of Chapter 5 of Title 46 in the fiscal to George Anitett relating the telephone service general provisions so as to establish a one time right of way permit fee and reduce annual right of way use fees. Chair recognizes representative Mom to hand to explain the Senate amendment and the House amendment. Thank you Mr. Speaker. The Senate amendment was I compromise with our friends that the GMA and some other groups to make sure that the fee rates are working we agree to that and then the further amendment is to make sure that since we made that amendment the date there has already passed so we need to make sure the date is right and is in the future. Thank you Mr. Speaker. Is there any objection to the adoption of the House amendment? The chair here is none the House amendment is adopted. On the gentleman's motion that the House agree to the Senate amendment to House bill 328 as amended by this House all those in favor will vote I those opposed will vote no and the clerk will unlock the machines. What purpose is representative Holland rise? Mr. Speaker pursuant to rule 133 I ask to be excused from this vote. Lady has that right and it will be so noted in the journal. What purpose is representative Beth Moore rise? Parliamentary inquiry. Is it true that the sponsor of this bill and I engaged in spirited debate on this bill and committee resulting in a subcommittee to study it ultimately resulting in a compromise bill that all parties are agreeable to. If the lady so states have all members voted have all members voted if so the clerk will lock the machine on the passage of House bill or on the gentleman's motion. The eyes are 111 the nasa 54 and this House has agreed to the Senate amendment to House bill 328 as amended by the House. Chair recognizes chairman of station for an announcement. The House judiciary committee meeting has been cancelled for today. Thank you Mr. Speaker. Chair recognizes representative McLean for an announcement. Thank you Mr. Speaker. The working family caucus will meet at 12 o'clock you can stop in room 307 and pick up your lunch and we will start zoom in today is workforce development. Thank you Mr. Speaker. Everybody hang on a minute now. Chair recognizes chairman Smith, chair of the rules committee for an announcement. Rules will meet in 10 minutes, 10 minutes. Rules committee meeting in room 341 in 10 minutes. This House will be in recess until 115. Chair recognizes chairman Smith, chair of the rules committee for an announcement. Chair recognizes chairman Smith, chair of the rules committee for an announcement.",
  "updated_at": "2026-02-13T09:35:23.620913+00:00"
}