{
  "video_id": "m1NcHfpUbXI",
  "url": "https://youtu.be/m1NcHfpUbXI?t=3050",
  "title": "Georgia House - Day 2 (2026-11-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-11-04",
  "duration_minutes": 80,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 2 (2026-11-04) Session Highlights\n\n## Overview\nThe session focused on the importance of leaders taking time for personal reflection and prayer, especially during times of cultural and political divisions. There was no substantive legislative action detected.\n\n## Notable Moments\n- Rep. Can Trail introduced guest chaplain Matt Lawson, who spoke about the need for leaders to \"watch over their own souls\" through prayer and reflection.\n- Lawson discussed the current \"cultural convulsion\" in America, marked by distrust of institutions and a desire for political \"conquest\" over opponents rather than debate of ideas.\n- Lawson emphasized that in times of crisis, the people under a leader's care need them to maintain spiritual grounding through regular prayer and solitude, following the example of Jesus.\n\n## Attendance\nA quorum was present, with members being instructed to vote green to signify their attendance.\n\n## Adjournment\nThe session was recessed until 10:30 AM to allow members time to get COVID-19 tests, after which the day's business would commence.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIf I can have your attention, please, it's a little different than why I normally say\nat this time, isn't it?\nThat's because we're going to stand at ease till 10.30.\nI guess because of the traffic, the testing lines downstairs are very, very long and we\nYou want everybody to get tested.\nIf you're in the chamber now and have not been tested, then leave and go get tested.\nYou're going to have time to do that.\nSo we'll come back in and take the role at 10.30 and start our business.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThey are for convening having arrived. All members will please take their seats. All members of the House will please report to their seats.\nThe clerk will please ring the bell.\nAll members, will please be seated, come to order.\nWe're going to have the morning roll call all\nMembers present will please vote green to signify their presence in the chamber and the clerk will unlock the machines\nhave all numbers voted, have all numbers voted. If so, the clerk will lock the machines.\nkeepers will please close the doors and keep them closed. Well good morning everybody. Hope\neverybody's enjoying this beautiful Georgia weather today. I guess we need the rain. We will\nbegin our day today with scripture reading and prayer by the chapel in after which we will\npledge allegiance to the flag of our country. Our chapel in this morning will be\nintroduced by the gentleman from the 22nd House District Representative\nWest Can Trail Representative Can Trail. Thank you Mr. Speaker. Good morning\ncolleagues. It's my honor today to introduce you to my friend Matt Lawson. I've\nknown Matt for over 15 years. He came to our church a little over 16 years ago as our student\npastor. When all three of my kids were going through high school so he had a great positive\ninfluence on my three children for which I'm forever indebted to him. After nine years\nat our church he moved, took his family and moved to Burbank, California right there in the\nsuburbs of Los Angeles and started a church called Story City Church in Burbank and had\na very successful time. There are six years pastored there, started one church,\nplanted another, and then moved back to the area a little less than a year ago.\nIn January, he'll become the co-executive pastor at First Baptist Woodstock,\nwhere I've had the honor of serving for the last 15 years. He's married to\nLaura. They have three incredible kids, Deacon, Eden, and Roman, and I just ask you\nto peripherally listen to what Matt has to share with us today. Thank you.\nWell, good morning, Mr. Speaker, thank you for the privilege of being here this morning.\nBible says in Romans chapter 13, to honor those in authority, and I'm grateful this morning\nto honor you.\nIt's grateful to be with you this morning.\nYou know, in October of 2020, David Brooks penned an article in the Atlantic magazine.\nThe essence of the article says, every 60 years, America experiences a cultural convulsion.\nWe experienced it in the 60s and 70s.\nWe experienced it in the early 1900s.\nWe did so in the 1820s and 30s.\nWe did so in the late 1700s.\nAnd David Brooks says we're experiencing it again today.\nHe goes on to say that of every iteration\nof those convulsions, America has come out stronger.\nBut he questions whether or not we can do so today.\nThe result of the cultural convulsion, he says,\nhas led to a distrust in institutions and people\nunlike ever before.\nRichard Edelman, CEO of Edelman Worldwide,\nsays, we are seeing an accelerated erosion of trust\nand an epidemic of misinformation, the loss of belief\nthat what our leaders tell us bears any resemblance\nto the truth.\nSo as a result of loss of trust and misinformation\nour culture. The article goes on to say we're moving from a debate of ideas to a desire\nfor conquest. Dr. Eli Finkel, Northwestern University, says the debate going on is increasingly\ndivorced from ideas. It's not about ideas, he says. It's about conquest. It's about\ndefeating the bad people on the other side. And these identities, he says, are becoming\nincreasingly essential to who we are as a people.\nScientific American is quoted as saying,\nwe've moved from being polarized\nto holding basic abhorrence for our opponents.\nSo in summary, the current cultural convulsion\nthat we're walking through today has led us to a place\nwhere we don't trust the media, we don't trust leaders,\nwe don't trust institutions, we don't trust other people.\nWe're no longer debating ideas, we're trying to conquer people.\nwere possibly in the greatest crisis of our adult lifetimes.\nAnd I believe in times of crisis, our cities and our state,\nthat people under our care need something from us as leaders.\nThey need a lot of things from us as leaders.\nI just want to mention one this morning and then I'm going to pray.\nAnd I think of utmost importance.\nPeople under our care today, both your care and my care.\nI have people under my care this morning as well.\ntimes of crisis I believe people under our care above all things need leaders who\nwatch over our own souls. We need leaders who watch over our own souls.\nColossians chapter 4 verse 2 says devote yourselves to prayer. Being watchful and\nthankful. You know when you read the ministry in the life of Jesus in the\ngospels you find that there are moments of stillness that Jesus experienced.\nLuke 5, 16 says, but Jesus often withdrew to the lonely places and He prayed.\nMatthew 14, 23 says, and He went up to the mountain by Himself to pray.\nAnd when it was evening, He was there alone.\nJohn 6, 15 says.\nSo Jesus perceiving that they were intending to come and take Him by force to make Him king\nwithdrew again to the mountain by Himself alone.\nBrother Lawrence, once pinned the words,\nthere is not in the world the kind of life,\nmore sweet and delightful than that\nof a continual conversation with God.\nDo you know what I believe as a leader of people\nand people who are under our care?\nI believe it's important.\nIt's valuable for us to understand\nthat moments of stillness and watching over our own souls\nhas significant value.\nEvery morning, I receive an email.\nI receive an email between 7.30 and 8.30\nevery single morning that tells me\nall the mentions that have happened\nof our organization, both online and offline.\nAnd I read those mentions online and offline.\nAnd I know what's being said,\nbut I also know what's true.\nSomeone once said, all press is bad press.\nI wonder if that person ever read emails\nabout what was being said about them the day before.\nBut you know what happens when I watch over my own soul?\nI'm able to respond to criticism differently.\nWhen I watch over my own soul, I'm able to see problems differently.\nI'm able to provide better solutions.\nI'm able to sit in someone's seat with empathy,\nand I can honor people whom I disagree with.\nThat's what happens when I watch over my own soul.\nI believe when we read the record of Scripture\nsee Jesus having these moments of stillness and quietness and watching over his own soul.\nWhat we typically see in the moments afterwards are momentous occasions. Jesus was alone\nwith the Father. He spent a night in prayer the next moment in Luke 6. He chooses 12 disciples\nwho lead a world movement. Matthew chapter 26, Jesus has hours from going to the cross\nand he spends moments away watching over his own soul and he's able to face that moment\nwith courage as the father would have him face it.\nTwo quotes and I'm done.\nThe famous church leader, the 20th century China watchman needs that our prayers lay the\ntrack down on which God's power can come.\nLike a mighty locomotive, his power is irresistible, but it cannot come without rails.\nrails are, the power of prayer, pastor, one pastor also said,\ntime spent alone with God is not wasted. Now, why don't you\nhear me this morning and I'm done. Time spent alone with God is\nnot wasted. It changes us. It changes our surroundings. And\nevery Christian who would live the life that counts and who\nwould have the power for service must take time to pray. Now\nsay to you this morning, very humbly, with all boldness, and all\ncourage this morning that a city, our city, my city, your city, our state, our\ncountry, in times of crisis needs leaders. Watch over their own soul. Let's pray\ntogether. Father, we thank you this morning for the privilege to serve you.\nRomans chapter 13 reminds us all authority has been given by God and so God\nto honor this morning those who have been given authority. God, I'm grateful for those\nwho are serving our state, our great state of Georgia this morning. God, I pray that they\nwould be men and women who watch over their own souls, who spend time and prayer, stillness\nand solitude. God, knowing that those moments give us the power to respond differently,\nto change, to provide better solutions, to honor people even when we disagree. Lord,\nWe thank you for another day you've given us we don't take it for granted the Bible says your mercies are new and your faithfulness is great\nWe love you in Jesus name. We pray amen and amen\nA pledge allegiance\nThe United States of America and to the Republic on which it stands\nThanks for watching.\nThank you.\nNow the moment we've all been waiting for, this is the end of March.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nThank you. Thank you, Mr. Speaker.\nThank you, Mr. Speaker. A little problem there.\nTheir committee on information and audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, some people find fall like there's a reward in it.\nThat is for sure.\nChairman Hogan, the chair of the Committee on Information and Audits reports that the journal\nof the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on 59th, most following establishes the order of business during the first part\nthe period of unanimous consent, introduction of bills and resolutions, first reading a reference\nof House bills and resolutions, second reading of bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is none, and the resolution is adopted, first reading of bills and resolutions\nAs the clerk will read, House Bill 3, EX by Representative Watson,\n172nd Taylor Hone, 73rd to Bill B. Toddlin Act to provide a new charter for the City of Coolidge.\nIntergovernmental Coordination.\nHouse Bill 4, EX by Rickson, February the 143rd, Mitchel the 88th, Hugo the 136th.\nAlexander the 66th, Inspire the 135th.\nBill B. Toddlin Act to provide for the composition, a number of state house districts.\nYes sir.\nLegislative and Congressional reapportionment.\nHouse Bill 5 EXPROGRAPHES.\nat the Beverly 143rd, mentally 88th,\nHugoly the 136, Alexander the 66th,\nand smiley at 135th,\nBill Bitton and act to provide for the composition\nnumber of congressional districts.\nLegislative, congressional reapportionment.\nThat completes first readers.\nSecond reading of Bills and Resolutions of Clerk or Reed.\nHouse Bill 1EX by Representative Richard the 97th,\nThe bill will provide for composition and number of state house districts, house bill 2EX,\nby represent the rich of the 97th, the bill to provide for the composition and number of congressional districts.\nThree second readers.\nThe report says standing committees, the clerk will read.\nThere are none.\nWe're moving on to morning orders, morning orders.\nThe chair recognizes Speaker Ralston from morning order.\nThank you very much, Madam Speaker and good morning, again to members of the House.\nI come before this body today to mark a painful and untimely passing, a truly great life\ntaken from us much too soon.\nLast week we lost a shining beacon when WSB-TV anchor Jovita Moore passed from an aggressive\nform of brain cancer.\nShe was not a Georgian by birth, but she became a Georgian.\nShe loved this city and this state, and she was loved back.\nShe became a lead evening anchor on WSB TV in 2012.\nAnd for most of us, we only knew her through a television set, but she was in our homes\nas often as members of our own family.\ncould always count on her to brighten up your day, even if but for a few minutes.\nHer work reflected the high standards of professionalism, integrity, dignity, and grace.\nJovita Moore was just a class act.\nAnd Emmy Award-winning journalist, she is survived by her mother, her two children, and\nher stepdaughter.\nHer family is in our prayers as her friends and colleagues at WSB TV and the entire Atlanta\nmedia community is also, and I've heard so many comments from her colleagues in the\nmedia over the past few weeks talking about her and it's amazing the regard in which\nshe was held.\nI'd ask you to join with me in a moment of silence to honor the life and memory of\nJoe V to Moore.\nThank you, Madam Speaker.\nChair recognizes Representative Mitchell\nfrom Morning Order.\nThank you.\nToday I rise to celebrate the monumental shift in our ability to protect our young school\naged children from COVID-19.\nThis week in the USA, we have a vaccine for our five to 11-year-old kids.\nTwo of my children, Valkyria and Faulkner, are six and seven.\nI cannot overstate my relief.\nThis vaccine availability happened in the context\nof having already devastated over 150 families in the US due\nto a loss of one of their five to 11-year-old babies\nfrom COVID here, and over 150,000 children\nhere in the USA facing life without a primary caregiver.\nRight now, in Gwinnett County, our two-week incidence\ninfection in school-aged children reported by our health department as of this\nTuesday was 171 per 100,000 children. Overall in Georgia, incidents in\nschool-aged children is 190 per 100,000 children. Incidents in school-aged\nchildren here in Georgia right now is classified as high. Prevention matters,\nthe ability to protect the physical and mental health of our children by\nBy preventing their illness and illness in their households matters, helping families\nconnect with the resources they need about pediatric vaccines, how to find information,\nhow to book them is one of the best steps we can take at this stage in the pandemic to\nhelp forge a family.\nThank you, Speaker, and I yield the wealth.\nChair recognizes representative Bennett for a morning order.\nThank you, Madam Speaker, and good morning, colleagues.\nLittle when I rose this morning without wear\nthat Mr. Speaker would come and mix such an eloquent speech\nor tribute to a legend, a lady, and a loving and kind spirit\nin that of Mr. Javita Moore.\nAs it has been mentioned and in the award-winning news anchor,\nMs. Moore visited my family room, bedroom,\nwhatever room I was in and the TV was on.\nAnd I always enjoyed her presentation.\nShe was a lady, a true saint.\nSo let me not repeat everything that the speaker has said\nbecause I echo in him.\nBut what I do want us to remember and be reminded of\nis that early detection may save your life.\nAnd in the last year and a half,\nmany of us have avoided or have missed our annual checkups.\nIn October, we celebrated breast cancer awareness month.\nI also celebrate prostate cancer awareness month.\nHaving my grandmother been lived today\nand short after breast examination,\nshe may have lived more than six weeks after diagnosis\nhaving breast cancer. And so once again to my beloved colleagues of this\nesteemed house, get your checkups if you have not already done so. It may not,\nbut it just could save your life. Thank you Madam Speaker.\nThe clerk will read the caption to a group of privilege resolutions, honoring the life\nand memory of Representative Lynn Moore James, honoring the life and memory of Joe Vita\nmore. Congratulating the Atlanta\nBraves, recognizing commanding the\nClayton County Parks and Recreation\nDepartment and for other purposes\nthat completes the reading of the\nProvinces Resolutions. Is there any\nobjection to adopting the privilege\nresolutions that Chair here's none\nin the resolutions are adopted? We're\ngoing on now to announcements.\nThe chair has an announcement, I want you to listen up very carefully if I could have your\nattention.\nImmediately upon adjournment, the ARC Atlanta Regional Commission caucus members will\nbe meeting here in the chamber. What I want non-ARC caucus members to do is\nbefore you leave to clear off personal items from your desk and then exit\nthe chamber so they can begin their meeting. So all personal items take\nthem clear them off the top of your desk and so they can have the use of the\nchamber to have their meeting. Chair recognizes the Transportation Committee Chair Chairman\nJasper's for an announcement. Thank you Mr. Speaker. The committee that brought us all\nhere this morning in the rain will have a meeting today at 1. This committee today is\nis going to be going over some unique issues\nabout road-building construction bridges, truck configurations.\nNon-members, I think you might want to watch this online.\nIt'll give you a good basic understanding\nof road construction.\nIt'll be online, and I hope you take the time to be there\nand be at our meeting today.\nThank you, Mr. Speaker.\nYou\nYou\nThere will be a majority caucus lunch lunch only in room 403 immediately upon adjournment.\nYou can stay in 4.03 and eat your lunch or you can pick it up and go.\nIt will be a box lunch, but there will be just a lunch, not a meeting.\nThank you.\nThat completes our announcements.\nThat completes the announcements.\nChair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nmove to this house, stand adjourned until 9.30 a.m. Friday, November the 5th, 2021, 9.30.\nSo that will let people that want to have long distances to drive, get home and people\ncan go to the parade if they want to. Is that right?\nOn the motion, the majority leader has moved that this house stand adjourned until 9.30\na.m. tomorrow, Friday, November 5th.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it and this house will be adjourned until Friday morning at 9.30 a.m.\n",
  "updated_at": "2026-02-12T12:55:39.647717+00:00"
}