{
  "video_id": "m8fvtHIQ4rg",
  "url": "https://www.youtube.com/watch?v=m8fvtHIQ4rg",
  "title": "Lawmakers Day 27 03/04/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe Georgia legislature session on Day 27 (3/4/25) featured debates on the Georgia Religious Freedom Restoration Act, as well as the passage of several other bills including those related to missing adults with autism, the death penalty for those with intellectual disabilities, and tax credits for safe gun storage.\n\n**Key Actions**\n- **HB 465**: Bill to allow law enforcement to send \"Maddie's Call\" alerts for missing adults with autism\n- **HB 123**: Bill to bar the state from seeking or imposing the death penalty on individuals found to have an intellectual disability\n- **HB 79**: Bill to create a $300 tax credit for safe gun storage devices and safety courses\n\n**Bills Introduced (First Reading)**\n- SB 155 and SB 156: Bills aimed at reducing insurance premiums\n\n**Notable Moments**\n- Debate over the Georgia Religious Freedom Restoration Act (SB 36), with Democrats arguing it could enable discrimination\n- Speeches in support of HB 123, noting the need to protect the most vulnerable from the death penalty\n\n**Votes**\n- SB 36 (Georgia Religious Freedom Restoration Act) passed 32-23 along party lines\n- HB 465, HB 123, and HB 79 all passed unanimously\n\n**Attendance**\nNo specific quorum notes provided.\n\n**Adjournment**\nThe legislature will return on Thursday for Crossover Day, the last day a bill can be passed in one chamber and moved to the other this session.",
  "transcript": "Riffer puts their first amendment right of free exercise on the same level of protection\nas the first amendment rights of speech, assembly, and press by simply creating a judicial\nbalancing test to weigh out the facts and cases, to make sure that a person's right to\npraxeter faith versus government powers is matched and balanced and brought together in the fairest way possible.\nLawmakers debated religious freedom versus freedom to discriminate for a second time at the Capitol after the Senate took up the Georgia\nReligious Freedom Restoration Act today. A similar bill was passed a decade ago, only to be vetoed by then governor Nathan Deal.\nGood evening and welcome to Lawmakers on Day 27 of the Georgia Legislative\nSession. I'm Donna Lowry in Atlanta. It may come as a surprise to some, but\nkindergarten is not mandatory in Georgia. One Senator is trying to change that.\nAlso, the debate over tort reform has included arguments for insurance\nreform in the state. Tonight, two lawmakers offer different views on that issue.\nAnd we learn about a bill that passes in the Senate to protect vulnerable\nhomeowners who fall victim to scam artists after a natural disaster hits.\nLet's start with the flurry of bills on the floor of both the chambers today\nwith Sarah Callis from today's Capitol Report. Hi, Donna, with Cross Over Day\nlooming, each chamber works late into the day passing a plethora of bills. The\nissue of, and need for, religious freedom protections was debated in the\nSenate today. SB 36, the Georgia Religious Freedom Restoration Act, is supposed to keep\nthe balance between state and local laws and and individuals' religious rights, mirroring\na federal law already on the books. After the federal referral law was passed, almost unanimously\nin 1993, the U.S. Supreme Court ruled in 1997 that the federal refer only protected people\nfrom unfair federal government intrusion and would not protect people from unfair state\nand local government intrusion on their basic rights.\nSince then, 39 of 50 states have adopted their own state rifer laws or seen their courts\nadopt rifer level protections about judicial ruling to protect people from faith, people\nwho have faith from overreach by state and local governments.\nFor puts their First Amendment right to free exercise on the same level of protection\nis the First Amendment rights of speech, assembly, and press by simply creating a judicial\nbalancing test to weigh out the facts and cases, to make sure that a person's right to\npractice their faith versus government powers is matched and balanced and brought together\nin the fairest way possible.\nBut Democrats pushed back on the bill, first on a personal level.\nAfter this bill, someone could deny me, my husband, my son, and my beautiful daughter service\nat a business, and use their religion as a reason to do that.\nSo this isn't about politics for me.\nIt's about the ability for my family to live freely in this state.\nAs well as disputing the legal fairness of the bill.\nRifra at the federal level has changed dramatically since then.\nIt does not provide the same protections, and in fact, it is being used across the country\nto discriminate against people.\nIt is also a fact that there are over 30 states that have referral laws in the books, but\nthe vast majority of those states have a civil rights statute in place to protect against\ndiscrimination.\nGeorgia is one of the hands full of states that does not have a state level civil rights\nlaw. But in the end, Democrats failed to sway any Republicans in the bill past 32 to 23\nalong party lines. Meanwhile, in the House, a bill that aims to help missing adults\nwith autism, HB 465 would allow law enforcement to send an emergency Maddie's call alert when\nan adult with autism goes missing. Maddie's call alerts are currently used for adults\nwith dementia or other cognitive disabilities.\nThis bill is George's bill and saving lives because we can help others find their loved\nones and help law enforcement with the tools to find them quicker.\nThere are other states and cities such as Los Angeles, California, Chicago, Illinois,\nNew York, Houston, Texas, and Phoenix that have established this law.\nHB465 passed unanimously. The House also voted on a bipartisan bill that would prevent people with\nintellectual disabilities from being sentenced to death. HB123 would bar the state from seeking or\nimposing the death penalty on individuals found to have an intellectual disability by the court\nduring the pretrial process. Beyond the legal principles, legal laws of this, this bill reflects our\nstate's shared values and our belief in our state model of wisdom, justice, and moderation.\nWe must recognize that intellectual disability affects and individuals' ability to understand\nthose complex legal proceedings, not to mention their actions and the results thereof.\nTo put them to death is to punish them for a cognitive limitation that they did not choose.\nand in essence, a part of their fundamental human identity.\nWe are not defined by how we treat the strongest among us,\nbut how we protect the most vulnerable.\nThe bill passed unanimously.\nAlso, the house approved HB79,\nwhich would create a voluntary $300 tax credit\nfor safe gun storage devices like lock boxes,\nfirearm safes, or trigger locks.\nThe credit could also be used for gun safety courses.\nEspecially when you have children, or maybe neighborhood children come to visit that\nweren't trained like maybe you train your own children, grandparents that may not think\nabout this.\nAnd then, of course, we've got troubled teens that's almost redundant to say that, because\nall of us were somewhat troubled when we were teenagers.\nBut it's a challenge, and it is, and occasionally gets to the level of a tragedy.\nThe bill was supported by representatives on both sides of the aisle.\nbut some Democrats say it does not do enough.\nWhat if we passed a bill offering families vouchers for buying car seats?\nBut we did not also have a law requiring car seat use for babies and children.\nWhat if we passed a bill instructing car insurance companies to offer lower premiums\nfor drivers with clean records, but we didn't also have speed limits or DUI laws?\nBut if we pass the bill offering tax credits for swimming lessons and water safety courses,\nbut did not also require safety fences around public and private swimming pools.\nIn those cases, I think we can recognize how, despite all the good intentions, incentives\nalone do not work nearly as well as incentives coupled with regulation.\nIt passed 165-8.\nLawmakers return on Thursday for crossover day.\nThe last day, a bill can be passed in one chamber and moved to the other this session.\nThat's my Capitol report.\nDonna?\nThanks, Sarah.\nWe're going to spend time looking at legislation to improve the insurance industry, protect\nhomeowners from scam artists, and make kindergarten mandatory in Georgia.\nLet's start with insurance.\nI spoke earlier today with Democratic Senator Derek Mallow about his bills, SB 155 and\n156, the deal with reducing insurance premiums.\nAnd then I talked to the Senate's Chair of Insurance and Labor, Republican Senator Larry\nWalker III, to get his take on the legislation.\nFirst, Senator Mallow says residents in his district came to him complaining about how tough\nit is to find affordable insurance.\nWhen I talked to my constituents and they were trying to figure out where they could shop\nfor insurance, how they could find it, I had to think about it and other than Google\ninsurance companies and you can pay for search engine optimization, they really couldn't\nfind some of the better cares of companies because they didn't have any knowledge about\nthat.\nAnd if you go to an independent agent, they have this knowledge, but they're not investing\na whole bunch of money in marketing because they are an independent agent.\nThey're a broker representative of many different insurance companies.\nSo you may not know to go to them or call them that they exist.\nYou may just see progressive online and let me go to progressive and get a quote.\nYou see flow.\nI know that we've talked a lot about tort reform,\nit's something the governor wants this session,\nbut a lot of people have been asking about insurance reform.\nDo you see this as part of that?\nAbsolutely, because people, what people agree with\nand why they're supportive of tort reform is for one single issue.\nAnd that is because their premiums continue to increase.\nAnd so, even with tort reform,\nthe American Tort Association says there are no guarantees\nthat this will lower premiums, right?\nAnd so other states like Florida have enacted similar measures\nmeasures, they lowered the insurance premium tax, they've, you know, changed the\nco-insurance model, they've worked to bring more carries in by changing some of\nthe regulatory environment around non-emitted carers. Those things matter if we\nwant to lower rates and we didn't do that in a comprehensive approach. I still\nhave people who are saying, hey, I caught my insurance company and I got full\ncoverage at the dealership but they're telling me I got liability only and I was\njust in a car wreck and now they won't honor what I had at the dealership.\nThat's a problem. A piece of legislation that would ask for any rate\nincreased over 10% for the insurance commissioner to have to hold a public hearing so that the\ngeneral public, John Cue Public, can hear why the insurance company is proposing the\nrate increase over 10% in premiums.\nMost people don't know what the discussions are between the insurance commissioner and\ninsurance companies that happens in his office and while he said he doesn't approve all\nof the rate increases that they asked for, we still don't know their justification for\nwhy they're increasing rates and it can't be based on everything.\nWe're probably in casualty going up,\nrenters going up, home owners going up,\ngeneral liability, every version of insurance\nis going just about up.\nSo if you want to charge more than 10% in premiums,\nI think you have to disclose that at a public hearing\nso there could be some public accountability\nand scrutiny for those companies.\nYeah, one other thing I saw about it,\nyou want some kind of database for consumers\nto compare rates, talk about that.\nRight now, you have a lot of insurance companies\nthat own these websites and you think you're shopping\nit out amongst their competitors,\nbut those websites are proprietary\nand owned by the actual insurance company.\nAnd so they're going to show their rate favorable\nto who they may show as competitors,\nbut they're not competitors.\nThey may be subsidiary companies\nthat they actually have an interest or ownership in.\nSo with this website, we do just simply list\nthe average rate across each line of business.\nSo consumers will know who's an admitted carrier,\nwho's a non-amidic carrier,\nwho's allowed to operate in the state\nso that they have a good understanding\nbecause auto insurance may be the best company\nfor one consumer.\nbut if people have never heard of them\nbecause they don't spend a lot of money on marketing,\nthen people may think it's only the big four\nthat they see on TV.\nAs the chair of insurance in the Senate,\ntalk a little bit about what you feel\nabout Senator Mallow's bill.\nI think they're interesting.\nI think he raised some valid concerns\nand I look forward to having a hearing on his ideas\nand vetting it out and let the committee hear that\nand maybe we'll hear from some industry folks\nin the commissioner's office on that.\nSo I look forward to it.\nI asked him about this, the fact that we're talking about\ntoward reform and other people, some people have said,\ninsurance reform should take place.\nWhat are your feelings about that?\nWell, I think if we can stabilize our civil justice system\nand make it more balanced and fair,\nit will bring more competition back into the market\nbetween insurance companies and stabilize rates\nand hopefully we'll see him in some lowering of rates.\nIt's not gonna happen overnight,\nBut the crazy lawsuit, sort of the crazy verdicts\nwe've seen have driven some of the insurance carriers\nto leave our market for certain segments of business.\nAnd when you have less competition and less choice\nfor the consumer, it's not a good thing\nand we're seeing prices go up.\nI do want to make a point.\nWhat other aspect of your life have you not seen\ninflation in?\nThe Biden inflation has hit every aspect of our life,\nwhether it be automobiles or homes,\nthe cost of construction, cost of medical care,\nall of that has gone up astronomically\nin the last few years,\nand all of that factors into the cost of insurance.\nSo when you have to replace a vehicle\nor you have to a hospital stay after an accident,\nthose costs have gone up,\nand so that's reflected in the increased premium.\nBut certainly, the Phryllis lawsuits\nhas played a part in that, too.\nLet's talk about your bill.\nTell us about SB 35 that deals with property insurance\npolicies.\nWell, we've seen, again, a pretty tough insurance market,\na hard insurance market, with carriers getting a lot\nstricter on their underwriting guidelines\nand trying to pair down their exposure in Georgia.\nAnd we're seeing a lot more non-renewals\nof people's homeowners insurance.\ncurrent statute only requires a 30-day written notice\nfor non-renoules and thus by mail, U.S. mail.\nSome people aren't getting that maybe a week\nbefore the non-renoule.\nI feel like we need to extend that.\nNotice time frame to 60 days to give the consumer\nmore time to respond and react and find other coverage.\nIt also will help their agents be able to navigate\nthe market for them and help them find other coverage\nmay be possible to get the non-renewal rescinded by the carrier.\nNow, Chairman Walker's bill, SB 35, passed in the Senate and representative Matthew\nGamble is carrying it in the house.\nAs for Senator Malo's bills, Walker says he expects his committee to hold a hearing\non them in the coming weeks.\nChairman Walker also talked to me about help for Georgians hit hard by Hurricane Helene.\nHe has SB 201, which would protect homeowners who sign contracts with unscrupulous contractors.\nWalker also pushed for budget allocations to provide hurricane relief.\nIt's got a lot more money in it for both the forestry industry, the ag industry to help\nthem recover, but also we put money in for nonprofits to be able to get grants to go\nrepair folks, roofs and stuff like that.\nI'm excited about that.\nWe put a lot more money in for the debris removal\nto help our cities and counties\nwith getting the debris removed.\nThe federal government, it's a 75-25 match\non the debris removal.\nThe state has committed, the governor has committed,\nthe state will step in and fill that 25% match\nthat and take that burden off the local communities.\nSo I'm excited that we were able\nto put additional funding there.\nI've got a bill Senate Bill 201.\nIt's on the floor today.\nI hope it'll pass.\nIt's going to give protection to consumers\nafter a storm and a historic storm like Helene.\nWe often see contractors swoop in that are unscrupulous\nand people are under a lot of pressure\nAnd it really, they're at the worst point in their life,\nwondering where they're going to live\nand don't have a roof under their head.\nAnd so they're pressured to sign contracts\nwith contractors that might not be legitimate.\nAnd this bill I have today will give some protection\nto allow the consumers to get out of those contracts\neasier if it's after a natural disaster.\nSo these scam artists is who you want to go after.\nAnd make sure people have some kind of recourse.\nright. So it has two components. One is if they can cancel the consumer, the homeowner\ncan cancel the contract with a contractor within five days of being notified by their\ninsurance company. If the claim is not covered or only partially covered, they can get\nout of the contract within five days.\nHis bill SB 201 passed by a vote of 53-1 in the Senate this afternoon and out goes to\nHouse. I also talked to Senator Mallow about his bipartisan bill, SB 65, to require mandatory\nkindergarten. I asked him what led him to draft the legislation.\nI was sitting at a human elementary school with principal Wallace Lewis one day and she\nhad a family coming in and they were coming in and rolled for first grade. Is that the\nstart of school? And I thought and rolled in the first grade. I should have been here\nin kindergarten, right? And then she, you know, a family said they were going to have to\nto test in and said, well, principal,\nwhile the students, why do you have to test in?\nAnd she said, because first grade\nis the compulsory age for attendance in public schools\nin the state of Georgia, the home school,\npublic school, private school.\nYou have to go at first grade.\nI said, so they have to test and she said, yeah,\nbecause if there's any deficiencies or remediations,\nwe need to know that now so that we can get the interventions\nfor that student and get them on an IEP,\nget them on any of the other resources that we need.\nI said, well, why not kindergarten?\nSo kindergarten's not required.\nI said, you get new.\nWe fund kindergarten, but it's not required.\nto say no, the compulsory age for attendance is by age seven.\nAnd so we had a bill to make kindergarten\ninstead of Georgia, we know that our children can't read\nand read on grade level of third grade.\nThe earlier child is educated, the better off they'll be.\nFor parents who are doing a good job,\nthis wouldn't affect them.\nFor the parents who would enroll their kids\nand let them stay in school for 20 days\nand take them back out of school,\nthis bill would prohibit you from doing that.\nBecause if you're homeless, I love you.\nGuess what, that kid would get two meals a day,\nbreakfast and lunch, and they would do that\nby enrolling in kindergarten and someone compelling them\nto make sure their child is educated.\nAnd one part of the bill is for the to require\nschool districts to actually provide it.\nAnd that means money for these districts.\nSo what do you say to them about that?\nWe fund kindergarten and the QBE formula.\nSo kindergarten and the QBE formula is the highest weight\nof money that the state allocates in the quality\nof basic education formula.\nYou get more money for kindergarten\nthan you do any other grade, which is why I pose\nschool voucher bill because the $6500 is even more than we allocate to the\nkindergarteners and rolling in school at a kindergarten level. And so with that\nbeing our strongest way where we spend the most money, then it should be\nrequired if we're going to put the most investment there.\nThat bill passed out of the Senate's Education and Youth Committee and is now\nwith the Rules Committee. It could possibly come to the floor before\ncrossover day. I want to thank both Senator Mallow and Senator Walker for our\nconversations.\nComing up, we're going to talk about some unique bills this session that might get your\nmouth watering, plus an update on the busy week at the Capitol with Correspondent Sarah Callis.\nYou're watching Lawmakers on GPB.\nGeorgia Farm Bureau, a grassroots organization dedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers at the State Capitol during the session and\nyear-round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nIt's good to have everyone back together.\nGood news indeed.\nPut your feet up a minute.\nIt's beautiful.\nWhat does that sound to you, man?\nIt's what I love doing.\nGuppity.\nIt's like it's more a double-wise kid.\nAriel?\nFreshly baked biscuits, always.\nWell, this is all proving rather cosy, isn't it?\nUnderstanding the past gives a sense of the future.\nThis is the first time that anyone has seen this in two thousand years.\nThis is amazing.\nNo, I'm excited now.\nPompeii is a battle against time.\nYou think I'm joking, but look at this, it really happened.\nDon't let anybody tell you who you are.\nHistory teaches us to honor the past.\nWhen you look back, they're like, wow, that was pretty special.\nThis is something that's actually altering the course of history.\nYou're charged with keeping these stories alive.\nWe're going to talk now about a couple of what we're calling quirky bills.\nThese are bills that are not as serious as a lot of what they deal with at the Capitol.\nThe first one is making cornbread the official bread of Georgia.\nI spoke to the bill's sponsor, Representative Casey Carpenter of Dalton.\nLet's talk about this, Representative Casey Carpenter.\nYou want to make cornbread, the state bread of Georgia.\nThat's right, we're on a reunion tour this year.\nThis thing passed out of the house,\npretty convincingly last year.\nAnd so we're looking forward to trying to get it out again.\nWhat is so Georgia about cornbread?\nMan, all the meat and threes up and down,\nthe I-75 corridor, and you head on to Southwest Georgia, man.\nPeople love cornbread in the state of Georgia.\nAnd it really goes back to the Cherokee, for me,\nthe Cherokee Indians, depending on where you live,\nit's different Indian groups,\nbut that was a Native American food,\nand they taught the settlers how to make it.\nAnd then, of course, obviously,\nthere's meals all across the state that have\nmilled corn for years for cornbread\nand has a man that loves southern food,\ncornbreads where it's at.\nSo it's grown here, and then they also have the mills,\nand then they go ahead and sell it here.\nThat's correct, that's correct.\nSo it makes it so Georgia.\nYeah, I mean, this is Georgia as anything else.\nWhat's your favorite part of it?\nI mean, when you have cornbread, what do you want it with?\nI'm a big fan of peas.\nSo I like pjuice and cornbread, some greens,\nhard to beat greens with it.\nMy granddad used to eat buttermilk and cornbread\ncrumbled up for dinner.\nSo yeah, there's a lot of ways.\nEverybody's got their thing.\nMy grandmother used to put in buttermilk.\nMm-hmm.\nButtermilk and cornbread.\nLet's talk a little bit about.\nLast year, you had some competition.\nThe biscuit.\nYeah, big biscuits came out.\nAnd we've actually had a few students there\nabout biscuit and, you know, obviously Chick-fil-A\nbeing in Hardee's from Atlanta.\nThey're big biscuit sellers, but I just think that,\nyou know, there's biscuits everywhere.\nCornbread really sets us apart.\nIt makes it different.\nIt's totally Georgia.\nYeah, that's right.\nIt goes back to the indigenous people.\nThat's right.\nSo how are you feeling?\nIt came out of the house last year.\nYou know, I mean, I feel just like anything.\nI feel pretty good about it.\nIt got mixed up with some additional language in the Senate,\nso it kind of died in Senate roles.\nBut I think senators like Cornbread,\nWe just didn't give him an opportunity to vote on it.\nBut I look forward to my friend,\nBert Jones, bringing this up if we ever give it over there.\nI see you with a tray of cornbread\nwalking through the Senate serving it.\nOh yeah, I mean, you know,\nyou gotta do what you gotta do to get your bills posted.\nHot, the butter, the little bit.\nButter meltin' off the top of that thing.\nMan, it'll break your heart.\nSo you're feeling really good about it?\nI am, I mean, we'll see.\nIt's early.\nAll right, let's hit your pitch.\nIt's here, your pitch.\nI don't mean it's not much of a pitch.\nIf you don't like cornbread,\nI don't know what to tell you.\nI mean, it's fantastic with a lot of different things.\nAnd this is Georgia.\nNot as the peach, Robert Dickey of Kimmy,\nbut it's pretty close to the peach.\nI love it.\nAll right, thank you so much.\nThank you for having me.\nAnother appetizing bill is about making Brunswick\nstew the official stew of Georgia.\nHere's my conversation with Representative Rick Townsend\nof Where Else, Brunswick.\nThank you so much, Representative Townsend,\nwe're talking with us right now.\nSo let's talk about, you would like to make\nBrunswick stew, the official stew of Georgia.\nOf course.\nWhat's that all about?\nIt's really all about, it makes sense historically,\nand it makes sense economically as well.\nBesides, it tastes great, you can't beat it.\nTell people who don't know what Brunswick stew is,\nwhat it is.\nBunchery, this is kind of a thick, type stew, stew based.\nIt has usually pork in it,\nwhere we put it down in Brunswick,\nand it has certain veggies in there.\nAnd you kick it and simmer it for a long time,\nand the stew masters do their thing and comes out great.\nIt comes out really tasty and delicious.\nSo it's tomato-y a little bit.\nA little tomato-y, yeah.\nAnd then it does have the corn.\nNow, talk about the corn and its historical reference in Georgia.\nWell, of course, you think about the historical reference\nabout corn bread and not to mention\nCasey Carpenter's bill, of course,\non making that official, I guess, bread of Georgia.\nBut thinking about Brunswick stew,\nit can go with anything,\nwhether it's biscuits or cornbread.\nMost people eat cornbread with it.\nBut it's just, it's been around for a couple hundred years.\nAnd so, of course, American Indians had the corn.\nAnd now, as people like to put sweet corn in there at times,\nit's really up to the chef and how they want to cook it.\nAnd you always have different variations.\nAnd we have blind taste judges down there\nwho are blind taste testing when we have a stewed bully.\nIt's called, and what they've been-\nA stewed bully.\nOh, yeah, she got to come.\nWe have thousands that come.\nIt's a one-day festival.\nRaised money for local youth groups and organizations.\nPart of Klanis, if you know the civic organization Klanis.\nAnd it's one of our fundraisers\nand just have a lot of,\nwe're usually 20 to 30 teams out there\nand just have a good time at festival\nand raise a lot of money.\nSo it's called Brunswick Stew.\nBut it really didn't originate in Brunswick.\nWell, originated in Brunswick, Georgia.\nRight.\nAdditionally, there's one of our counties in Virginia has tried to proclaim they're the\nofficial birthplace of Brunswick Street, and we know that's not to be the case.\nSo I mean, we've got a plaque back in Brunswick, Georgia telling you that.\nWithout a doubt, it had to be Brunswick, Georgia.\nDid he just try to steal it from you?\nThey tried to take the name.\nThey did.\nOkay.\nAnd St. Simon's, there's a connection.\nYeah, St. Simon is just across the causeway.\nThat's where I live at.\nand Brunswick's our sister city,\nand we all get along together and have a good time,\nand it's just part of Glen County.\nSo tell me how you're doing with this bill.\nIt passed out of committee the other day.\nWent through special rules.\nI was excited.\nWe had the mayor of Brunswick wrote a proclamation\nand letter of support.\nCity council did as well.\nWe had a local homeboy, a person who grew up in Brunswick\ncome testify about the significance of it.\nAnd we'll see, it goes off to rules.\nI'll be presenting either rules either,\nprobably Friday or Monday.\nHopefully we can get it through rules and through the house.\nAnd then my counterpart, Mike Hodges in the Senate,\nwould be carrying the bill in the Senate.\nHe also lives on St. Simon's and fellow Kwanian.\nAnd so he's going to carry the bill for me\nonce I get it through the house.\nI want to know where the samples are.\nDid you serve any even at the hearings?\nI did not, but I did make a promise.\nOnce it gets to the Senate,\nand they approve it, then I'm bringing in samples.\nYou have to have friends with me today.\nI'm gonna bring in one of my chefs, Ron Adams,\nthe local Stu Master.\nIf not, I'll bring up Stu from Southern Solo,\none of our great places down there.\nOkay.\nWe're ready for it.\nMake sure you let all of us on the crew know about it.\nI was gonna say, I'm sure you wanna be invited, right?\nThat's it.\nWe'll do that, Donna.\nAlrighty, thank you.\nboth the cornbread bill and the Brunswick stew bill\npassed in the house onto the Senate.\nAnd with me, Sarah Callis, we have one more day,\ncrossover day, so tell us what to expect\non our special show on Thursday.\nOkay, so we have some great gas lined up\nto tell us all about what's going on in Cross Over Day.\nWe have Lieutenant Governor Brune Jones.\nWe'll have House Minority Whip Sam Hark\nand we'll have Senator Greg Dolezal,\nwho's a Senate Republican.\nAnd so, they'll be there to talk to us\nabout all things crossover and some of the bills\nthat we're expecting to come up.\nThere's a lot still left to do isn't there.\nThere is, I know we often call sports betting\nthe issue that never dies,\nbut we may see a bill that could legalize that\ncome up in the house tomorrow.\nOkay, then.\nWell, we're gonna keep up with you\nand we hope you'll all tune in.\nIt's in the middle of the basketball playoffs\nfor high school, but we'll be here.\nThanks for coming in.\nThat does it for lawmakers today.\nWe're off tomorrow as lawmakers have a committee day,\nbut of course, as we said, we're back Friday.\nI'm sorry, Thursday for our special crossover day show\nwith interviews from the Capitol.\nHave a good night.\n",
  "updated_at": "2026-02-12T12:18:06.945083+00:00"
}