{
  "video_id": "m8r7PXS0A7I",
  "url": "https://youtu.be/m8r7PXS0A7I",
  "title": "Georgia House - Day 35 (2026-06-20)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-06-20",
  "duration_minutes": 124,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session featured the introduction of several bills, including HB316, HB516, HR 1551, and SR 1010. There were also notable speeches, procedural moments, and recorded votes.\n\n**Key Actions:**\n- **HB316:** No description provided\n- **HB516:** No description provided \n- **HR 1551:** No description provided\n- **SR 1010:** No description provided\n\n**Bills Introduced (First Reading):**\n- HB316\n- HB516 \n- HR 1551\n- SR 1010\n\n**Notable Moments:**\n- Opening prayer and scripture reading by Reverend Dr. Simon Mainwaring, focused on the importance of empathy and serving the needs of all people.\n- Procedural details around roll call and members reporting to the chamber.\n\n**Votes:**\n- Several votes were mentioned, including some that were \"opposed\" and some that \"passed\". However, the specific bills associated with these votes were not provided.\n\n**Attendance:**\n- A full roll call was taken to establish quorum.\n\n**Adjournment:**\nThe transcript did not specify when the session adjourned or the date of the next scheduled session.",
  "transcript": "There are convening having arrived all members of this house will please report to their seats and take up their positions. All members will report to the floor of the house, the gallery or room 341. Mr. Clark will please ring the bell. All right, we're going to have the morning roll call. We are going to have morning roll call. All members present will please say aye or yes when the clerk calls your name to signify your presence in the body. The clerk will unlock the machines and call the roll. Alexander Haneloets, Barr, Barton, Belton, Venet, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnik, Hepstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Gravelie, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasperce, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, Macau, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Coush, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robyshow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas A, M, Turner, Wollensky, Wilterson, Williams M, F, Williams N, Wilson, Beasley T, B, C, T, Bonner, here, Buckner, here, here, here, Campbell, here, Cantrell, here, Dickerson, Dukes, Dudes, Campbell, here, Gillard, Gordon, Gordon, Green, here, Gullet, here, Jones J, B, here, Kirby, Lott, here, Mathis, here, Metz, Momp-to-Hon, here, Mark, here, Prueit, Rogers, here, Singleton, Stowe-Wall, here, Williams R, here, Beasley T, B, C, C, Cook, Dreyer, Gaines, Gillier, Hill, Hutchinson, Jones V, Metz, More B, More C, When, Powell, Sharper, Smith M, Thomas A, Thomas E, Williams M, F. We'll begin our day with Scripture reading and prayer by the Chaplain, after which we will pledge allegiance to the flag of our country. Our Chaplain this morning will be introduced by the gentleman from the 80th House District Representative Matthew Wilson, Representative Wilson. Thank you, Mr. Speaker. Colleagues, it is my distinct pleasure this morning to introduce you to the Reverend Dr. Simon Main Warning. Simon is a director of all saints at Piscobal Church here in Atlanta. All saints is my church home and it's also home to several members of the General Assembly, of course the distinguished Mayor Margaret Oliver, Senator Elena Parent, former Representative Ed Lindsey, and a few others who have served in this body. As you're about to hear Simon is originally from England and he was educated at Oxford, Cambridge, Harvard, and Birmingham where he earned a PhD in biblical theology. Mr. Speaker, I'm told that's not the Birmingham next door but the one across the pond. Simon has ministered for the past 23 years in schools, hospitals, and parish churches. He's also a scholar, has authored two books and a number of journal articles. As director, at all saints, Simon has the privilege of leading our staff and lay leaders and engage the parish in the life of the city of Atlanta. He's done that for the last three years as the leader of our church and one of the most important things that he has done is re-engaged the leadership that already existed within the congregation of all saints into the social justice movement of the city of Atlanta. Simon serves on the board of the Absalom Jones Center for Racial Healing here in Atlanta and collaborates with church leaders throughout Midtown and downtown to offer the voice of the needs of our neighbors and further the mission of the church. Although he told me he is an avid Atlanta United fan, he enjoys cheering his beloved soccer team Tottenham Hotspur, which will get you nowhere in the ways it means committee by the way. He does enjoy time with his family, he's Mary Tamanika, who is also an Episcopal priest and rector of St. Martin in the fields Episcopal Church located in my district in Burkhaven and they have three children. Please welcome the Reverend Dr. Simon Mainwaring. Mr. Speaker, distinguished representatives, it is a privilege to be with you here today to begin your work with a moment of reflection and prayer. Thank you, Representative Wilson for your generous welcome and thank you to each of you who have responded to the call to serve the common good in this place. My devotion for you this morning begins with a friend of mine and a pressurer of my church named Carl. Some time ago Carl and I had dinner along with a small number of other church members. We were a mix of ages, of races, of genders, of views of the world and memories of life. We're invited to share stories of significance from our lives. Carl told the story of his career in the Social Security Administration and how he had been sent by the Administration to law school in Baltimore. During class he got to know a young woman. She was white, he was black. She broached the topic of having lunch together several times hoping that Carl might actually invite her but Carl felt sorely aware that there were only two places to eat in the hall of town where a black man could take a white woman to lunch. The railway station and Woolworth's department store he felt embarrassed by his lack of options and made excuses two or three times until finally he swallowed his pride and that long awaited lunch paved the way for a lifelong friendship. Later that night as we sat together talking the sheer everyday quality of Carl's story struck me. Young love looking for a place to eat and every day reality of segregation. The everyday matters because it is there that we will either hold on to hope or lose it. Jesus of Nazareth was profoundly interested in the everyday. His vision of human community, what the Bible calls the Kingdom of God, is not one of abstract principles or high falluten language. Jesus' vision is of bread on the table of children dying to young of prisoners languishing without justice or families who mourn loved ones of the life of the poor in a world too much in love with riches. As a follower of Jesus I'll take the liberty of pointing out that Jesus concerns seem very much like your own in this place. Here is where people's needs, the life of children and the longings for justice of the people of this state have their reckoning. Jesus taught that the measure of a people is how truly it honors and remembers the least, the poor, the oppressed and the forgotten. That is how you will be measured also. And so I pray for you this day. I pray that you may be granted the gift of a deep and abiding empathy for the people of this state, especially those who are different to you and those who see the world differently to you. I pray that you might be struck by the everyday nature of people's challenges and that you might discover ever richer ways to see the world as they see it so that you will know how it is you are called to build the kind of society Jesus proclaimed where every child of God, no matter their color or creed, is valued by each of us on the earth as deeply as God values them in the heavens. And so in the name of that God, I offer this blessing. Would you please stand. Oh God, creator and sustainer of all life, stir the hearts of your people, strengthen their wills, enliven their minds and inspire their spirits to see your grace alive in the lives of all people. Amen the Lord your God bless you and keep you now and evermore. Amen. Would you join me in the pledge. I pray that you are the nation under God, the indivisible, the liberty and justice for all. It's very, very good. Thank you so. Good job Matthew. Thank you. Doorkeepers will unlock the doors. Before I recognize Chairman Hogan, on Monday morning I outlined a policy that this house adopted through the work of a bipartisan committee that mandated on the floor and in the seating areas of the house, the wearing of mask. And we've we slipped a little bit during the week. So I'm going to ask you to put your mask on while you're on the floor in the gallery or in room 341. Chair recognizes Chairman Hogan, the chair of the committee on information and audits. Thank you. Thank you Mr. Speaker. The journal was so thick today I had to call in somebody else to help me read the journal. Vice Chairman Emory Donahue came in and assisted me with that. You can't believe how thick it was with a budget. But your committee on information and audits read the proceedings of the previous legislative day and found them to be correct. Never would we have believed that anything made in China would last this long representative, Penny Houston. Wisdom for the day. Well you know you mentioned the budget making your journal so thick. Chairman England told me it was kind of thin the budget. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns on a 59. It was following me establishes the order of business. They're in first part of the period unanimous consent. Introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Report of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions. The clerk will read. House bill 1235 by Representative Shannon. The 84th Thomas 39th one of the 89th. Scott of the 76 Davis. The 87th and others. A bill be titled act to amend chapter 4, title 1. The official go to Georgia and it's had a relating holidays and observance. Governmental affairs. House bill 1236 by Representative Hucley of the 136 Jackson on 28th. Bennett of the 94th Buckner and 137th. Bentley of the 139th and others. The bill be titled act to amend code section 50. 14. One of the official go to Georgia and it's had a relating meetings open to the public. Governmental affairs. House bill 1237 by Representative Hill of the third. Bill be titled act to amend code section 22 142.1. The official go to Georgia and it's had a relating coursework in the founding philosophy and principles of the United States of America. Education. House bill 1238 by Representative Smith of the 41st. A bill be titled act to amend chapter 2 and title 21. The official go to Georgia and it's had a relating elections and primaries generally. Governmental affairs. House bill 1239 by Representative Beverly. The 143rd Bentley the 139th. Paris the 142nd. Nelson 125th. Sharper the 177th and others. Bill be titled act to amend article 108. Chapter 18 and title 15. The official go to Georgia and it's had a relating the general provisions for prosecuting attorneys. Judiciary non-civil. House bill 1241 by Representative Dempsey the 13th. Stephen's the 1664th. Degers in the 113th Cooper the 43rd and Hutchinson the 107th. Bill be titled act to amend title 43. The official go to Georgia and it's had a relating to professions and businesses. Regulated industries. House a resolution 1600 by Representative Gertler the 8th. A resolution honoring the life of memory of Sheriff Jay Vernon Chastain Sr. and dedicating an intersection in his honor. Transportation. Senate bill 511 by Senator Lucas the 26th. Bill be titled act to amend the act. Creating a board of commissioners at Twigs County. Intergovernmental coordination. That completes first readers. Second reading of bills and resolutions the clerk will read. House bill 1228 by Representative Buckner of the 137th. Stephen's the 164th Oliver the 82nd. Tramble the 132nd. Rebure show the 48th and others. A bill relating to medical assistance. House bill 1229 by Representative Buckner of the 137th. Stephen's the 134th. Tramble the 132nd. Couch of the 50th and a Nolo its of the 42nd. A bill relating to revenue and taxation. House bill 1230 by Representative Kendrick of the 93rd. Body of the 62nd. Wilson of the 80th. Basemore the 63rd. Kendrick of the 102nd. Others. A bill relating to state torque claims. House bill 1231 by Representative Green of the 151st. Year's out of the 102nd. Hopson of the 153rd. An act to amend and act to create the G. Hough Park Authority. House bill 1232 by Representative Davis of the 87th. A bill relating to grand juries. House bill 1233. A bill to amend and act to provide a home study exemption from city of Lovonia. Advalor in Texas. House bill 1234 by Representative Erwin of the 28th and Gartler of the 8th. A bill to amend and act to advise. To amend and revise. Consolidate and supersede the several acts incorporating the town of Toulula Falls. House bill 1240 by Representative Welch of the 110th. Douglas of the 78th. Hully of the 111th. Scott of the 76th. Night of the 130th and others. A bill to authorize Henry County, Georgia to exercise all-rate development. Other powers under the redevelopment powers law. House resolution 1590 by Representative Scofield of the 60th. Clock of the 108th. Smiring of the 135th. Bended of the 94th. Hopson of the 133rd. A resolution creating the House study committee on creating a respectful and open world for natural hair. House resolution 1597. My represent Taylor of the 173rd and Perk of the 155th. A resolution honoring the life of major Henry Talmadge Elrod and dedicating a bridge in his memory. House resolution 1598. My represent Taylor of the 173rd. A resolution recognized the United States military veterans. Dedicating a bridge in their honor. House resolution 1599 by Representative Hatchett of the 150th. Jackson of the 128th. Hitchens of the 161st. Lums of the 12th. Emperors of the 159th. The resolution urging all law enforcement agencies in the state of Georgia to implement psychological testing and improve current training practices for peace officers. Senate Bill 509 by Senator Ligon Jr. of the 3rd. A bill to abolish the Glenn County Police Department Senate Bill 512 by Senator Jones of the 25th. A bill to amend and act to create the Central State Hospital Local Redevelopment Authority. Through second readers. Reports of standing committees. The clerk will read. Representative Shaw Blackman of the 146th District Chairman of the Committee on Governmental Affairs submitted the following report. And to speak to your committee on governmental affairs. Is it on consideration the following bill of the Senate? Is it struck to meet the report the same back to the House with the following recommendation Senate Bill 509 due pass. The strictly submitted representative Shaw Blackman of the 146th District Chairman. That completes the report of standing committees. speaker. Okay, we're going to go a little bit out of order here. We're going to hold morning orders for just a little bit and I'll give you plenty of notice when we get to that point. So we're going on to the rules calendar. We are going on to the rules calendar. The clerk will read the caption to Senate Bill 395. Senate Bill 395 by Senator Watson. The first checks in the second, the 11th, helps to the 50 second black and white and others. The Natal and Act 2, 4, 7, and 30, one of the official to Georgia and it's in the county municipal hospital authorities. So it provides a standard of indigency relating to portioning the proceeds from the sale or release of a hospital by hospital authority. This bill has been referred to the committee on special access to quality healthcare. That committee recommends that this bill do pass. Chair recognizes the distinguished chair of the Health and Human Services Committee, Chairman Cooper, to present the bill. Thank you, Mr. Speaker.\n\nin the house I bring you Senate Bill 395. So often we hear about hospital closings and this is a bill that comes out of a hospital success. Down in Savannah we had a hospital that was failing, had been in the red for several years, it was purchased, and in a third, three year period it is now in the black, it is paid all its bond and debtiness and its indebtedness off, and it has a near revocable trust nearing $100 million for indigent care. The bill changes, there is a stipulation in the law that says that can only go up to people that are 125% of poverty level, this would change it to 138. It would also allow for them not to just do it for hospital care, but for clinic care and preventing type care. It also has new rules about how the money can be invested. The funds are not to be used for anything except indigent care and that it provides for a better way to invest like we do with our teacher retirement, conservative, so that it can make more money to be used for indigent care. If there are no questions, Mr. Speaker, I will yell well and ask for a favorable vote. This would apply to any hospital that had this kind of trust and had met these requirements across our state. You do have a question if you care to yield. I will yield for one question. Chair recognizes representative Oliver to your left for a question. I can answer it. Does the lady leave you? Yes, ma'am. This is an excellent first step in moving our standard to 138% of poverty for eligibility for health care. Would you agree or disagree with me that it would be appropriate to move the standard of poverty to 138% for the purpose of all Medicaid eligibility expansion? Representative, that kind of a decision is a little bit above my pay grade. I will say that it's my understanding that once you reach 101% of the poverty level, that you are eligible for programs under the Bama Care better known as the Affordable Care Act, and that those insurance type programs can be purchased and with money given to the person of where they are practically free. And I think that any time a person can have insurance, that is the best way for them to go since the outcomes on Medicaid are not always the best. Thank you. I'll yield the well, Mr. Speaker. Lady has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 395 will vote yes, those opposed will vote no, and the clerk will unlock the machines and call the roll. Alexander Nullowicz, bar, Barton, Belton. Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnik, Abstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hughley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, LaRickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petri, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workiser, Weedower, Williams A, Williamson, Yurda, Allen, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, when, Paris, Prince, Pullin, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas A, Turner, Wollensky, Wilkerson, Williams Mf, Williams N, Wilson, Beasley Teague, Yes, Bonner, Yes, Buckner, Yes, Virtue, Yes, Calwell, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Dickerson, Duke's, Duke's, Campbell, Cantrell, Yes, Gillier, Gillier, Gordon, Gordon, Green, Yes, Gullet, Yes, Jones J.B., Jones J.B., Yes, Kirby, Yes, Kirby, Lot, Lot, Yes, Mathis, Yes, Meets, Yes, Meets, Mopthahan, Mopthahan, Yes, Park, Yes, Prude, Yes, Kirby, Rogers, Yes, Singleton, Yes, Stovall, Yes, Williams R, Williams R, Yes, Bar, Cannon, Carter, Clark D, Clark J, Corbett, Dempsey, Gileard, Henson, Hill, Holcomb, Jones S, Jones V, Mathiac, Meets, Paris, Perkle, Powell, Smith M, Stevens R, Thomas AM, Welch, Weedower, Members will take a moment and review the board and to make sure it is accurate. Clark may lock the machines, own the passage of Senate Bill 395, the eyes are 138th and the nasors 0, this bill having received the requisite constitutional majority is therefore passed. Clark will read the caption to Senate Bill 310. Senate Bill 310 by Senator Harper, the 7th Gucci, 51st Martin, 9th Hofstadler, the 52nd to be in Toddlondack, 2nd to Abund, 243, the physical to George Anitator, relating to professions and businesses, so as to provide for the regulation of certain professions. This bill I've referred to the Committee on Regulated Industries, that Committee recommends that this bill do pass. Chair recognizes Representative Vance Smith to present the bill. Thank you, Ms. Speaker. Ladies and gentlemen, this bill has the deal with structural engineers giving them a designation in the Secretary of State's Office, just like professional engineers. We passed a bill similar to this that was HB516, the vote was 164 to 4. That bill had also included an area that dealt with kickboxing, because the Secretary of State's Office felt like they needed to have some regulation. All that was taken out, this 310 strictly deals with structural engineers. And giving them that designation, so when they bid projects, they'll have the same advantage as 24 other states where their structural engineers have that SC designation. So I'd ask for your favorable consideration on Senate Bill 310. Thank you, Ms. Speaker. So they want to regulate kickboxing? Or not in this bill. Okay. That was last year, and they pulled all that out. Okay. I don't think you have any questions, except the one I had. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 310? Will a vote aye of those opposed to vote no? And the clerk will unlock the machines and call the roll. Alexander Oneloets, Barr Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickey, Dollar, Drenner, Erwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harrell, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Newton, Nick's, Oliver, Rutz, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tancersley, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Williams V, Couch, Kennerd, Lopez Romero, Marin, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Thomas, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven Sun, Thomas A.M, Turner, Wolensky, Wilkerson, Beasley Teague, B-Z-T, Yes, Bonner, Bonner, Yes, Fuckner, Yes, Parchette, Yes, Calwell, Campbell, Yes, Cantrell, No, Dickerson, Dickerson, Duke's, Duke's, Campbell, Kenner, Yes, Gileard, Gordon, Gorgher, Green, Green, Yes, Gollett, Yes, Jones J.B., Kirby, Yes, Kirby, Lot, Lot, Yes, Mathis, Yes, Metz, Mopthon, Yes, Park, Yes, Park, Yes, Bridge, Rogers, Rogers, Singleton, Yes, Stovall, Yes, Stovall, Williams, Yes, Williams Arm, Yes, Alexander, Benton, Blackman, Bonner, Clark, J, Dumpsey, Drenner, Dubnic, Gileard, Hitchens, Jones J, Jones T, Jones V, Metz, Perkel, Powell, Rich, Rogers, Smith M, Stevens R, Turner, Wilkerson, Williams MF, Williams MF, All right, members, I need to look at the board and make sure that it is accurate. Representative Dunahoo, did you all get that one? Yes, Representative Dunahoo, did you all get that one? Anybody else? The clerk may lock the machine on the passage of Senate Bill 310. The eyes are 127, the nays are 10. This bill, having received the requisite constitutional majority, is therefore passed. I'm not going to totally count the chicks till they hatch, but I understand that the Senate has taken to rules and is now about to vote on the floor and adjournment resolution, which will have us going home tomorrow, which will save at least one morning order that was going to be given today. So when that gets over here, we're going to do it quickly before they change their minds. Clerk will read the caption to Senate Bill 306. Senate Bill 306 by Senator Sayah, 34th, Mullis of 53rd, Berk of the 11th, Oracle of the 36th, Butler of the 55th, and others to be entitled to act to amend in chapter 44, Title 43, the fiscal to Joe Janitettia, relating the speech, language, pathologists, and audiologists. So it was revised licensing provisions. This bill ever referred to the committee on amendment services that committee recommends that this bill do pass. The chair recognizes Chairman Belt and to present the bill. Thank you, Mr. Speaker. This is another, it's audiology compact bill that would join Georgia with other states for audiologists and speech pathologists. It's a bipartisan bill. It's going to help telemedicine. It's going to help all audiologists and speech pathologists. But it especially helps the military. The Pentagon has requested that we pass this for its help with the military spouses. It does not give up sovereignty for Georgia, and it doesn't cost any money and ask for your favorable opinion. Did you finish and yield for questions? I yield for questions, sir. All right, let's see if you have any questions. I don't see any questions. I yield the well. Gentlemen, as yielded the well, before we start voting, let me caution you that we are, it's taking a little longer today to vote than it has earlier in the week. And I think it's because we're having to go back and catch a lot of people that didn't vote the first time through. So it'll go quicker for us if you pay attention and vote promptly when the clerk calls your name. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, who is favorable to the passage of the bill, the chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 306 will vote yes. Those opposed will vote no, and the clerk will unlock the machines and call the roll. Who? Alexander Aneloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Demptsy, Dickey, Dollar, Drenner, Dubnik, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulkham, Holmes, Hauston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Peter, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Wee Dauer, Williams A, Williamson, Yurda, Allen, Beesmore, Bernal, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Ayerhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClain, McLaren, McCloud, Meeks, Mitchell, Morbby, Morris C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, Robachoe, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas A.M., Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, B, C, T, Yes, Bonner, Fockner, Urchette, Yes, Calwell, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Duke's, Duce, Campbell, Yes, Gillard, Gordon, Grain, Green, Yes, Gullard, Yes, Jones J.B.,\n\nJoe J. D. Yes. Kirby. Yes. Kirby. Lot. Law. Yes. Mathis. Mathis. Yes. Mathis. Mathis. Yes. Mabdhah. Mabdhah. Yes. Park. Yes. Prut. Yes. Prut. Rogers. Rogers. Yes. Singleton. Yes. Singleton. Yes. Stovall. Yes. Stovall. Yes. Williams R. Williams R. Yes. Blackman. Yes. Black. Davis. Gileard. Smith M. Williams M. F. Members will look at the board and make sure that it is accurate. The clerk will lock the machines on the passage of Senate Bill 306. The eyes are 138. The nays are zero. This bill, having received the requisite constitutional majority, is therefore a past. Clerk will read the caption to Senate Bill 408. Senate Bill 408 by Senator Strickland on 17, to the 30th, Miller of the 49th, Letterman of the 45th and others being taught on act to amend. Code section 34 110. The official go to Georgia annotated relating to use of sick leave for care of immediate family members. This bill will refer to the committee on industry and labor. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Bill Warkaiser to present the bill. Thank you, Mr. Speaker. Section 1, as the title says, in 2017 this body passed and the Governor signed and became law the Georgia Family Care Act, which allowed sick leave for family members. That bill was going to sunset this year. So this section 1 merely extends the sunset for three years. Section 2 authorizes Commissioner to change to the deductive earnings. Section 3 gives the Commissioner the Department of Labor certain powers. But only if two things are triggered and they both got to happen if we are in a state of emergency and the legislature is not in session, this will give the Department the Commissioner certain powers. Section 4 changes the maximum benefit weeks on a sliding scale, depending on what the unemployment rate is. And then Section 5 allows the Commissioner to establish a work sharing program that is provided in the Federal Unemployment Act and that is the bill. We'll stand for any questions if there are any. You have a question, Mr. Chairman, do you yield? Yes, sir. I think it's coming from 341. Chair recognizes representative Park in room 341 for a question. Thank you, Mr. Speaker. Does the Chairman yield? Yes, sir. Thank you, Chairman. Worker, I will refer your bill. Is it not true that Senate Bill 408 passed by partisan support out of the Industry and Rules Committee? That is true. Light must for our bills. We work very hard to make them as bipartisan as we can. Does the gentleman yield for one of the questions? Yes, sir. Is it not true that this bill would preserve an important family leave flexibility policy and do many other good things for working families and employers in the state of Georgia during the midst of this pandemic? Yes, and thank you for the question and our committee worked very hard to make sure that both Georgia employees and employers were protected by this. Thank you for your leadership and good work on this bill. I do not see any other questions. Thank you, Mr. Speaker, and I ask for your federal consideration on Senate Bill 408. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The Chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee own rules? The Chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 408? Will vote yes, those opposed will vote no, and the clerk will unlock the machines. Alexander Ameloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackmond, Bodey, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nick's, Oliver, Parish, Parsons, Peatree, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silkocks, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, William Sun, Yurda, Alan, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, Morris C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robucho, Sanks, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven Sun, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley Teague, B, C, T, Bonner, No, Buckner, Ur, Verchette, Yes, Calwell, No, Campbell, Can, Yes, Cantrell, No, Dickerson, Duke's, Duke's, Gamble, Yes, Gilear, Yes, Gordon, Gordon, Green, Green, Good, Yes, Jones J, B, Jones J, D, Kirby, Lot, Yes, Yes, Meets, Yes, Mophtahan, Yes, Park, Prood, Yes, Rogers, Singleton, No, Stowe, Yes, Williams R, Yes, Beverly, Carpenter, Gilear, Holland, J, P, Jones, J, P, Jones, B, Jones, Perkel, Scofield, Setsler, Sharper, Smith M, T, T, T, T, Welch, Chairman Setsler to your left is trying to vote. Okay, have all members had an opportunity to look at the board and be sure it's accurate. The clerk may lock the machines on the passage of Senate Bill 408, the eyes are 129, the nays are 12. This bill having received the requisite constitutional majority is therefore passed, Chair recognizes, Chairman England, the Chair of the House Appropriations Committee for a motion. Miss Speaker, I move that the House insists on its position on House Bill 793 and that a Committee of Conference be appointed. Chairman England has moved that this House insists on its position in disagreeing to the Senate substitute to House Bill 793, the Appropriations Act for Fiscal Year 21 and that a Committee of Conference be appointed. The clerk will read the caption. House Bill 793, Barbara, and the roll on the 7th, Jones, the 47th Burns, the 159th and England, the 116th Bill, the Title of Act to make and provide appropriations for the State Fiscal Year beginning July 1st, 2020 and ending June 30th, 2021. On the gentleman's motion that this House insists on its position in disagreeing to the Senate substitute to House Bill 793 is their objection. Is their objection? The Chair here is none and this House has insisted. The Chair appoints as a Committee of Conference, Chairman England of the 116th, leader Burns of the 159th and Speaker Proteam Jones of the 47th. I think you're the special advisor to the Conference Committee. Chair recognizes the majority leader of the House for a resolution. Thank you, Mr. Speaker. Colleagues, thank you for being here today. I appreciate your dedication and your willingness to come here and complete the people's work as we work towards end of the session. Mr. Clerk, we have a Senate resolution before us. Could you read that or post it on the board? Senate resolution 1010, relative to meetings and adjournments of the General Assembly and for other purposes. Thank you, Mr. Clerk. As I know you all have looked at the resolution that has come back to us from the Senate resolution that has changes in it from what we had sent over to them. So this is a new resolution. As you see SR 1010 has us. Of course we're in today. We will be out tomorrow, Father's Day, that is so important to so many people in this state. As we celebrate it as we celebrate Mother's Day earlier and then Father's Day tomorrow, a very important time for our people and for us, the members of this body. We will be in Monday, June the 22nd, Tuesday, 23rd, Wednesday, 24th, Thursday, the 25th, for Day, May the day 39, Friday, June 26th, will be what we've been looking for. A day we will complete our work for this 2020 session and we will be, we will declare a signing die and complete the people's work. Mr. Speaker, I would take a question but I think it's very suffix planetary and I know everyone's been looking for this and I hope it meets needs. And again, thank you for your presence here today and your dedication to the work for the people of this state. Mr. Speaker, I would yield the well and ask for your name. This gets us to home for Father's Day. Is that accurate? Yes, sir. You know, let's you live four hours away and I may be a little bit late but I'll be there for Father's Day. And maintains the sanctity of the Sabbath, all of which was important to the house. It's certainly important to me, Mr. Speaker, because I need all the forgiveness I can get under that. But yes, sir, we certainly is very, very important to personally to us and to... Chairman England, Mr. Speaker, says one day is not going to help me but one day of forgiveness but I'll start on that one day. But I digress. Thank you, Chairman England. Let's speak. I would agree with you. We need to honor what's important to the heritage and traditions of this body into our state. And I'm very happy and proud that we will be able to honor Father's Day and the Sabbath and the Alps. Yes, sir. You have a question back there, Representative Bruce. Do you yield for a question, Mr. Leader? I would yield, yes, sir. To my friend, I think we're pretty close but certainly we all both pay attention to what Speaker says pretty quick. But thank you, Representative Bruce. I appreciate you being here. Chair, you yield for another question. I'm going to yield for one more, Mr. Speaker, because I'm not that we're getting close to it. Chair recognizes Representative Abel Mabel Thomas up in the gallery for a question. Does the gentleman yield? I yield to the gentleman. I would just like to know what time do we come back. Isn't that true? I would like to know what time we come back on Monday. I'm going to be here at seven. Representative Thomas will deal with that before we adjourn. We don't usually put that in a adjournment resolution. Okay. All right. Yes, ma'am. We'll have to say thank you for recognizing Father's Day. Thank you very much. Thank you. Mr. Speaker, I appreciate the favorable consideration of this body and I will yield the will. And thank you, Mr. Speaker, for your leadership on helping to ensure that we respect the members and the Sabbath with this German resolution. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. The question before the body is shall this resolution now be adopted? Is there any objection to the adoption of Senate rule 1010? Is there objection? Last call. Hearing none, the resolution is adopted and we will be out tomorrow and come back on Monday. Clerk will read the caption to Senate Bill 430. Senate Bill 430 by Senator Ligon in the third miller of the 49th upstatt with the 52nd robbers of the 29th Harbour and the 16th and others. The title of an act to amend Part 14 of Article 6 of Chapter 2 and Title 20, the official go to Georgia annotated relating the other educational programs under the Quality Basic Education Act. This bill ever referred to the Committee on Education. That committee recommends that this bill do pass. Chair recognizes Representative Chokus to present the bill. Thank you, Mr. Speaker. Good morning, ladies and gentlemen. I present to you today Senate Bill 430. This legislation simply allows local school systems to enroll home study students and private school students in local college and career academies as long as space is available. As we all know, college and career academies are collaboration between local schools, technical colleges, business and industry designed to give young people experience and exposure to the workplace. This is a valuable tool to get young people either to continue their education and training or to join the workforce. That's all that Senate Bill 430 does. And if there are no questions, I'll yield a well and ask for your favorable consideration. Thank you. You have a question. Yes, sir. I will yield. Chair recognizes Representative Huggley to your left for a question. Yes, ma'am. Does the gentleman yield? Yes, ma'am. When this is done, how will these students be disciplined if there is a disciplinary issue administratively? How will that work? Discipline is in the bill. Under current code, the way all the other college and career academy students are disciplined is the same way that it will be in this. So there's no change. Does the gentleman further yield? Yes, ma'am. For some infractions, public school students are sent home. So for a home school student, what do infractions, what happens to them? If that's what the, I don't know the specific punishments, but it would follow the same. It would be the same. I do not see any other questions. Thank you, Mr. Speaker. I yield a well and ask for your favorable consideration. Gentlemen, as you'll do the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of Senate Bill 430 will vote aye. Those opposed will vote no and the clerk will unlock the machines and call the vote. Senator Hanolewitz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnik, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lohood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Nick's, Newton, Oliver, Parish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yurda, Allen, Baysmore, Bernal, Cannon, Clark, D, Clark J, Carter, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Hollen, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Bonner, Buckner, Verchette,\n\nCaldwell, Campbell, Cantrell, Dickerson, Duke's, Gamble, Gillier, Gordon, Green, Gullet, Jones, JB, Kirby, Lot, Mathis, Metz, Momtehan, Park, Prueut, Rogers, Singleton, Stovall, Williams R, Bode, Gillier, Hitchens, Kennerd, McCall, McLaren, Morris M., Oliver, Smith M., Stevens R., Workhizer. Okay, members will look at the board and be sure it's accurate. The clerk will lock the machines on the passage of Senate Bill 430, the eyes are 140, the nasal zero, this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 443. Senate Bill 443 by Senator Stone, the 23rd Annters and the 24th and most the 53rd Annters will be titled back to men chapter 4, title 18, the official to Georgia annotated relating the Garnersman proceedings so as their vice procedures for Garnersman proceedings this bill have referred to committee on judiciary. Now committee recommends that this bill do pass. Chair recognizes Chairman Welch to present the bill. There we go. Thank you. Thank you, Mr. Leader. I present to you Senate Bill 443. This is a Garnishment Update Bill. Last term we had passed a comprehensive rewrite of the Garnishment laws in state of Georgia and oftentimes we have to go back and clean that up. And so what we've done in this bill, and you'll notice that most of the text in the back is all forms that are being updated in our code section. I do want to point out some substantive changes that need to be you need to be aware of in the podium on this bill. Number one is that we are we are now authorizing the voluntary modification of the amounts of the Garnishment if the defendant and the plaintiff agree. This is at lines 98 through 100. This is an adjustment that actually makes it easier for Garnish for the Garnishee if you're the employer of the person's whose wages are being garnished. That you can actually work out an arrangement that works out better for the person the Garnish, the defendant. So as the Garnishee you can work with the defendant as always the plaintiff agrees as well. So this is an improvement I think especially given our certain current times this is an improvement in the legislation. Number two is on lines 50 on page two. We are continuing Garnishments instead of having to file a refile Garnishments every six months we're moving to three years. Why? The simple answer is it saves everybody money. Cost of refiling for the Garnishment are typically passed on to the defendant, passed on to the plaintiff initially, then to the defendant. And so this would actually eliminate those costs and actually make it better for the defendant, the person's whose wages are being garnered. Student loans, private student loans were not covered before. Public student loans you can only garner to 15%. This legislation at lines 68 through 70 actually now allow for that to be written down. Private student loans for 25% to 15%. So that puts them in line with public student loans which is better. And then also there are procedural changes that are made into the bill that actually make notifications and distributions of the money's easier and confirmation of those distributions better as well. Those are the main substantive changes in the legislation the rest of them are cleanup measures in the legislation. I'll be happy to take any questions if you have them. I'll be pleased to ask you a question. Is Senator Stone's legislation and I would ask for your favorable consideration of this. I see one question. Do you do you yield? Yes, I do. Mr. Speaker. I recognize as representative Bentley to your left for a question. Yes. Mr. Speaker. Mr. gentlemen, yield. I do. Yes, ma'am. Representative, can you explain to me exactly when we mentioned public schools. I thought of Fort Valley State University. Can you explain to me exactly how this legislation will affect someone that just recently graduated from Fort Valley State University with student loans and don't have the means to pay back those loans at this time. Another question. Does not alter the current law that deals with student loans. So if a student that graduate from Fort Valley State finds himself in a job that has a problem and is unable to pay back their student loans, then those loans could be garnished under current law. But only 15% of their wages could be garnished as opposed to 25% which is the typical standard amount. But this bill actually would change that for private student loans, it's now 15% under this legislation. And furthermore, it actually gives the flexibility so that the garnishee, the defendant who owes the money and the creditor can all actually adjust the amounts that are paid in order to account for payments of changes in lifestyle, someone's lost a job and the family income. You may have a child that needs extra care medical attention. We all know these things happen and there needs to be some flexibility in this law would allow that. Very good. Thank you for your work on this bill. Thank you, ma'am. Do you yield for a further question? I do, yes. Chair recognizes representative Jasmine Clark, the gallery to your right. Thank you, Mr. Speaker. Does it gentlemen, you? I do, yes ma'am. So can you clarify for me online 50? It says that a continuing garnish shall include the next one thousand ninety five days of three years. Does that mean that a person who is being garnished will absolutely be under garnishment for three years? No, it's only until it's paid but it is a continuing garnishment whereby the debt is owed and it lingers longer than three years. Then what would happen now, under current law, every six months you'd have to file another continuing garnishment and those expenses for filing get passed on typically from the plaintiff and then rolled into what the defendant would pay. So moving it to three years, if it's that long, it may be longer, maybe six years, it may be nine years, but that would allow it to extend out. So we just pertain to continuing garnishments and for the amounts that have not been fully repaid. Thank you. Yes ma'am. Thank you. With that, Mr. Speaker, I will yield the well and I ask for your favorable consideration of Senate bill 443. Thank you. Gentlemen, as you'll did the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate bill 443? Yes, those opposed will vote no and the clerk will unlock the machines and call the roll. Alexander, Noleowitz, Bar, Barton, Belton, Bennett, Bentley, Benson, Beverly, Blackman, Vody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Dubnic, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper, Jones, Jay, Killing, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, MacKall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stephens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Hartler, Hanson, Hill, Hogan, Holland, Holly, Copson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, Cloud, Meeks, Mitchell, Moore B, Moore C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Steven's M, Steven Sin, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, Wilson, Beesley T, Bonner, Beesley T, Bonner, Buckner, Richett, Calwell, Campbell, Cantrell, Dickerson, Duke's, Campbell, Gilear, Gordon, Green, Goet, Jones J, B, Kirby, Lot, Mathis, Metz, Mopthahan, Park, Prewitt, Rogers, Singleton, Stovall, Williams R, Gillard, Scofield, Shannon, Thomas A, M, Williams M, Cannon, Okay, members will look at the board and make sure it's accurate. And the clerk will lock the machine on the passage of Senate Bill 443. The eyes are 142, the knees are zero. This bill having received the requisite constitutional majority is therefore passed. The chair has been advised that the Senate has tabled an important bipartisan bill on maternal mortality. Knowing that, I don't think we need any strobe blights. So if you signed up for a morning order, make your way to the front of the chamber. We're going to do morning orders. We've got some motions to do, and we're going home. Chair recognizes Chairman Eftration for a morning order. Chair recognizes Representative Vernon Jones for a morning order. Chair recognizes Representative Turner for a morning order. A total of 10 minutes for all the morning orders. Thank you, Mr. Speaker. American history is not a history of perfection, but rather the betterment of people who call our country home. And betterment means change for the positive, which is why I've joined with our colleagues here in a bipartisan effort to draft HR 1551. Now is the time for change in the United States capital and for Georgia to honor a man who worked for the betterment of all humankind. Dr. Martin Luther King Jr. peacefully, but forcefully, called for an end to the hate and prejudice and deserves his place as an honor. As a representative of Georgia in the United States capital, Statuary Hall, collection by replacing Alexander Hamilton Stevens. Both men were powerful orders. Both men commanded the attention of their audience, but their messages could not be more contrasting from one another. Whereas Dr. King spoke of equality, liberty, freedom and justice for all people. Stevens literally sought to justify slavery as a natural institution due to the inferiority of blacks. Not only is this wrong, it's evil, and it's a belief that stands in direct violation of our moral compass as Americans. Statuary Hall is intended to serve as a remembrance of honor great Americans that individually represent our 50 state. The Hall honors men and women like Helen Keller of Alabama, Sakakowia from North Dakota religious leaders like Father Damien from Hawaii and Mother Joseph, the Sacred Heart from Washington. But sadly, only two black patriots are featured as full statues in the United States capital, Rosa Parks and Frederick Douglass. Neither are part of the Statuary Hall collection, which is intended to represent the diversity of our states. I see no person more fitting to represent that better minute of the collection than Dr. Martin Luther King Jr. of Georgia. This does not mean that we destroy history. I believe it's important that we return the Statue of Mr. Stevens to Georgia so his legacy can be studied and remembered in context, including remembering the darker chapters of our shared history. However, we should reserve that place of honor for one who has truly committed their life, has committed their life for the betterment of all of us. I know this piece of legislation was dropped after Cross Over Day, and traditionally this would mean it wouldn't pass this year, but 2020 is not a normal year. This issue has been overlooked for too long. So if there's any way we can do this this year, I think it's a time. It's only one step, one of many steps that we need to be taking to show unity and our march towards healing in this time. Thank you, Mr. Speaker. Chair recognizes Representative McCloud for a morning order. Thank you, Mr. Speaker. Big up to my colleagues. I'm here today to sound the alarm for this disastrous administered primary election we just witnessed. The bright spot belongs to the people that showed up and voted, especially the millennials. Our country is a republic, and to achieve represented democracy, the vote has to be the nucleus. We either believe in our constitution or we don't. The first three words we the people are the only ones that can make this republic success. Voter participation that is not 100% is a failure. Encouraging people to vote is patriotic. A few weeks before the primary election, I start again calls from constituents that they had not received their absentee ballot. As the days got closer, I had to instruct them to go ahead and vote in person in a pandemic that put their lives at risk. When I contacted the county's election supervisor, she said things were going well. The day before our primary election, the Georgia legislated black caucus, met with the Secretary of State, and we expressed our concerns about the election. The response was everything was going well. On June 9th, election day, I got a call at 7 a.m. from a voter saying that she had her polling location and there was no machines. At first, I thought she was at an early voting site, but she said no. I'm at the church, I'm supposed to vote at. She went early because she had day surgery. She never got the opportunity to vote. I called my county's election supervisor and found out that 28 locations opened without machines. On June 17th, I was told the ballots were fully count, and about 20 minutes later, I got a call from a candidate saying that several ballots were missing, and then several candidates said that their votes went missing. In 2019, elected Democrats objected to the passage of HB316 because we were concerned about the electronic machines. The experts recommended hand written paper ballots. I'm calling on the Secretary of State to fix these problems in November. The country and the world is watching Georgia. Knowledge is the most powerful gift we give to ourselves, but the vote is the most powerful thing we give to each other. Thank you, Mr. Speaker. I yield well. Chair recognizes representative Lopez Romero for a morning order. Thank you, Mr. Speaker. I wanted to make sure that we recognize the Supreme Court decision that will maintain DACA as it stands currently, and to understand that its rationale was based on this administration not being able to provide the most basic rationale that was not capricious or arbitrary. But beyond that, I want to highlight why it matters to each of us sitting here, because this is not just a national decision taken by our Supreme Court, but rather I want to highlight one of my first legislative aids that I had. Marisol was raised in Savannah, attended Armstrong University, because she had to pay out of state tuition despite growing up in Savannah and graduating from her local public school, she still was not able to pay in state tuition. So she worked multiple jobs, including babysitting, translating, and on campus, in addition to that, she spent her legislative, my first legislative session here with me. She is an exceptionally hard working, phenomenally smart young lady that I have the very happy to say that she is now going to start law school at Syracuse University this fall. These are the young individuals that are culturally American by every standard, and culturally American expression of their love by being able to provide their talent, their skills. And so I want to highlight and honor individuals like her that are working every single day to make our state better, to provide a face of greater opportunity for our state and reminding us what work we should be doing. That being said in this body as we move forward, I will continue to ask you for us to provide in state equity for in state tuition for DACA and undocumented students. And as I had previously reminded you, this is also personal as it affects us, because I myself was undocumented for 12 years of my life, had not been for the legislation that President Ronald Reagan signed. I would not have been able to eventually apply for my green card and then to become a U.S. citizen and sit here in this chamber with you as colleagues. So thank you so much, and we have lots of work to do, definitely at the federal level for a comprehensive immigration reform, but a lot of work that needs to be done in this chamber to ensure that we are a welcoming state. Thank you. Thank you, Mr. Speaker, who you are well. I would like to recognize this representative Vernon Jones for the final one minute of morning orders. Thank you, Mr. Speaker. I'll keep it to 59 seconds, hopefully. Members of this distinguished body, I do want to say that Representative Scott Turner has brought about a piece of legislation as well overdue, and that is supporting one of the two statues to be replaced with the Statue of Dott the King and the United States halls, Capitol Halls. So I would like to thank all the law enforcement agencies and officers at this particular Capitol who looked out for us each and every day. That is important. We appreciate you and we value you. And finally, I just want to say that in the midst of all this hate that's been passed around, the only force that can conquer hate is love. So I ask each and every one of you to keep that in mind and love our neighbors, I say thank you, Mr. Speaker. That completes morning orders. House Bill 1148 will be postponed to the next legislative day. House Bill 1195 will be postponed to the next legislative day. Senate Bill 249 will be postponed to the next legislative day. Senate Bill 318 will be postponed to the next legislative day. Senate Bill 337 will be postponed to the next legislative day. Senate Bill 394 will be postponed until the next legislative day. Senate Bill 442 will be postponed until the next legislative day. Senate Bill 482 will be postponed until the next legislative day. And Senate Bill 489 will be postponed to the next legislative day and maybe longer. Senate resolution 19. I'm sorry. I got a head of myself. Chair recognizes the majority leader of the House for a motion. Mr. Speaker, I would move that Senate resolution 19 be recommitted to rules. The majority leader has moved the Senate resolution 19 be recommitted to the rules. Committee the clerk will read the caption. Senate resolution 19 by Senator Beachy, 21st, Gucci, 51st, Watson, 1st, Miller, 49th and others. Resolution creating the Georgia Commission on freight and logistics. On the gentleman's motion, the Senate resolution 19 be recommitted to the rules committee. Is there objection? Is there objection? The chair hears none and the bill has been sent back to rules. Senate Bill 294 also will be postponed until the next legislative day. I don't know if he's here, but help me wish representative Mike Glanton a happy birthday tomorrow on Father's Day. Chair recognizes chairman Hitchens for emotion. I'm sorry for an announcement. The public safety and Homeland Security Committee meeting two o'clock today is cancelled. It'll be rescheduled for Monday. Chair recognizes chairman McCall for emotion for an announcement. I'm going to speak of there be a ag meeting at eight o'clock Monday morning and I need seven more beside me, please. Chair recognizes chairman Wilts for an announcement. I'm going to speak with members of the subcommittee on public safety appropriations. Try to give it to me in the corner over here in just a few minutes. The clerk will read the caption to a group of privileged resolutions. Recognizing commanding Lewis G. Graziano. Recognizing commanding Brenda paid on a outstanding service. Recognizing commanding. Anderson. Recognizing commanding Brianna Lipscomb. Recognizing commanding Saphira Zias. Recognizing commanding McDuffie County upon the grand occasion of its 150th anniversary and for all the purpose.\n\nis that completes the reading of the Privilege Resolutions. Is there any objection to the adoption of the Privilege Resolutions? The chair here's none and the resolutions are adopted. The chair recognizes now the majority leader of this house for a motion. Thank you, Mr. Baker. This has been a good week. Thank you for your leadership and the patience of this body as we work through some issues with the Senate and we're hopefully we're going to write back the move forward. But thank you to everyone. Mr. Baker, I'd move to this house stand adjourned until 11 11 a.m. Monday June the 20th 20 20 legislative date 36. The speaker made a motion and I would ask you if I could draw that motion for just a few minutes to allow the is there any objection to the majority leader withdrawing the motion hearing none the motion is withdrawn. What purpose does representative trainer rise? To ask if the rules of the house be suspended so that a bill can be read for the first time and assigned to committee. The lady has moved that the rules of this house be temporarily suspended to allow a bill to be read for the first time and assigned to committee. Clerk will read the caption. Unnumbered house bill by rep. Drenner of the 85th and others. To be entitled and act to provide a homestead exemption from city educator independent school district out of the warm taxes for educational purposes. Unnumbered house bill by representative Davis the 87th and others. To be entitled and act to amend the act revising super seating and consolidating the laws relating to the governing authority to cab county and creating a chairman and board of commissioners said county. On the ladies motion that the rules of this house be temporarily suspended to allow the bill to be read for the first time and assigned to committee. Is there objection? Is there objection? The chair here is none and it is so ordered. Intergovernmental coordination. Any other business now to come before the body. Speak now or hold your piece until Monday. Chair recognizes the majority leader for emotion. Miss Speaker I would just like to say a personal thank you for allowing us to operate this house as you've always conducted our business here in a bipartisan way to recognize and remember the minority party to bring local legislation for this body so big appreciate your patience and your guidance on that. Miss Speaker I move again that this house stand adjourned until 11 a.m. Monday January the 22nd 2020 which will be legislative day 36. The majority leader has moved that this house be adjourned until Monday June 22nd at 11 o'clock a.m. 11 a.m. Is there all those in favor of the motion will say aye. Those opposed will say no. The eyes have it in this house will be adjourned until Monday at 11 a.m.",
  "updated_at": "2026-02-13T23:35:37.260147+00:00"
}