{
  "video_id": "Mb4t0_Q-qVs",
  "url": "https://youtu.be/Mb4t0_Q-qVs?t=1399",
  "title": "Georgia House - Day 33 (2026-03-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 33,
  "video_date": "2026-03-14",
  "duration_minutes": 144,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThis session featured a memorial tribute to the late Speaker David Ralston, who passed away. The House took time to honor Ralston's legacy and impact as a dedicated public servant and legislator who cared deeply about all Georgians.\n\n## Key Actions\n**HB 231**: Passed\n**HB 479**: Referred\n**SB 116**: Passed\n**SB 231**: Passed \n**SB 3**: Passed\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Mac Jackson delivered a moving devotion and eulogy honoring Speaker Ralston as a compassionate leader who cared for all Georgians as his \"neighbor.\"\n- Members shared stories and tributes celebrating Ralston's character, legislative accomplishments, and positive impact on the state.\n- A video was played highlighting Ralston's election as Speaker.\n\n## Votes\nThe House unanimously voted to pass HB 231, SB 116, SB 231, and SB 3. HB 479 was referred to committee.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe House adjourned for the day. The next session will convene on a future date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Well since this is the 33rd day, we thought we'd be on a speaker's time. Most of you know what I mean. The hour for meeting having arrived, all members will please take their seats. Mr. Clerk will you please ring the bell. We're going to have the morning row call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted. Have all members now voted. If so, the clerk will lock the machines. Doorkeepers will you please close the doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning needs no introduction. He's the gentleman, pastor from the 128 House District down in Tenel, Georgia. We're representing Mac Jackson, a dear friend to all in this body, but a special friend, speaker David Rolston. So much so the speaker he'll tell the story but I won't tell it again first in this introduction. It unbeknownst to Reverend Jackson on that day, there were several state patrol vehicles out in front of his church. He said, what's going on? And who do you think there was there to attend services that day? Let's speak our David Rolston. That just built on the relationship that represented Jackson and the representative speaker Rolston built with one another. Two special men that represented the very best in what our state is about and what our people about. I want to ask Representative Mac Jackson to come bring our devotion for the day. Reverend James Jackson. Thank you, the speaker. Good morning to everyone. You know, when I think about that day when speaker Rolston surprised me, nobody told me that he was coming and all of a sudden there he was on a Sunday morning. He cared enough to come down to Washington County to see me. And when I asked him why, he said, because you are my friend, speaker Rolston had a way of letting you know that he cared about you. And today as we honor him, I counted an honor and a privilege to be able to speak on behalf of a man who loved the state of Georgia. As I was searching the scripture on last night, I saw in the book of Luke in Luke chapter 10 in verse 25, and it said that a lawyer stood up and he asked Jesus, what must I do to inherit eternal life? Jesus asked some of the question. He said, what is written? And he said, you shall love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind and your neighbor as yourself. And Jesus said to him, you have answered right, do this and you shall live. But he willing to justify himself said unto Jesus and who is my neighbor? And Jesus answered and said a certain man went down from Jerusalem to Jericho and fell among thieves who stripped him of his clothing and wounded him and departed leaving him half dead. And by chance that came down a certain priest that way. And when he saw him, he passed by on the other side.\n\nAnd likewise, a Levite, when he was at the place, came and looked on him and passed by on the other side. But a certain Samaritan, as he during it came where he was, and when he saw him, he had compassion on him. And went to him and bound up his wounds, pouring in oil and wine and set him on his own beast, and brought him to an end and took care of him. And the next day when he departed, he took out two pints and gave them to the host and said to him, and whatsoever you spend more, when I come again, I will repay you. Which now of these three do you think was a neighbor to him that fell among the thieves? And he said he that showed mercy on him, then Jesus said to him, go and do likewise. And I believe that Speaker Rauston had read Luke chapter 10, because he was a neighbor to so many Georgians, his life parallel, the good Samaritan that Jesus talked about in this passage. In 2020, he led the fight to pass House Bill 426, the hate bill crime, the hate crime bill. But he saw a young man who was killed while jogging, and he considered him as his neighbor. In 2021, he led the fight on HB 479 to repeal the citizens of rest law, because a mob Aubrey's family was his neighbor. In 2022, Speaker David Rauston backed House Bill 1013 to expand access to affordable mental health treatment and behavior health services across the state of Georgia. Again, he saw all Georgians as his neighbor. In 2017, Speaker Rauston formed the Rule Development Council. And when we draw up the LJ for our first meeting, and he charged us as a committee to look for ways to bring academic development to our rural communities too. Ladies and gentlemen, this good man cared about Georgians. He cared about Georgians in Blue Ridge. He cared about Georgians down on the coast. He cared about Georgians in Albany. He cared about Georgians in Millageville. He cared about Georgians in Atlanta in Thomasville in Tipton. We traveled all over the state and listened to what citizens needs were because he saw every Georgian as his neighbor. When I was in grade school, we learned a poem by Henry W. Longfellow. And the poem was titled A Song of Life. And in verse 1 it says, Tell me not in mournful numbers. Life is but an empty dream. For the soul is dead as slumbers and things are not what they seem. But I think verse 7 speaks of Speak of David Rostin. And verse 7 says, Lives of great men all remind us. We can make our lives sublime and departing, Leave behind us, footprints on the sands of time. Ladies and gentlemen, Speak of Rostin left footprints on the sands of time. Let us pray. God of our weary years, God of our silent tears. It was you who brought us safe this for. And as we remember this great man, who you allowed us to know for just a short time, teach us to number our days that we may apply our hearts to wisdom. Holy Spirit, teach us to love one another as Christ loves the church. Teach us to use our words and our actions to bring glory to you and your kingdom. Heavenly Father, not just empty words, but a sincere desire to honor you. Change our hearts and help us to be more like you. And as we honor this great man today, let us understand and let us remember that our lives speak for themselves. This we pray in Jesus' name, Amen. Join me as we pledge allegiance to the flag. A pledge allegiance to the flag of the United States of America and to the Republic of which it stands. One nation under our indivisible liberty and justice for all. The Colleagues, friends, today we will honor and celebrate the awesome legacy for our dear departed colleague, friend and brother, our 73rd speaker of the house, David Rolston. A proud son of North Georgia, the great mountains of North Georgia might be very specific, a breed attorney, an altruistic, dedicated public servant, today would have been his 69th birthday. There's no doubt he loved this state. He loved this house and he loved every member who served in this body. He lived by the biblical lesson. Come now and let us reason together. You can look back over the years his tenure in this house and you see monumental achievements. But you'll also see the mark of a man who cared deeply for those whom he served. Whether it was adoption reform, paid parental leave, hate crimes or mental health, he worked every day as our speaker to see the state's future become writer for all Georgians. It is fitting that we pause for a few moments, daughter of his life, his legacy and the incredible impact he had on our state. We want to share a video with you this time. So if you view the screens. President Rolston, you have received the majority of the votes cast. It's here by the Claire and elected speaker of the Georgia House representatives for the ensuing term. You have honored me beyond measure by entrusting to me this position. And I will never forget that. I am here today to do what I can for you and for this state that we all love. One of my favorite times in the mountains where we live is in the early morning after a stormy night. You know a night that's, you've had rain, and it claps of thunder, flashes of lightning, maybe wind, storms all night. Then it gets quiet before dawn. And then when the day begins to break, I enjoy looking to the east over the mountains in that direction to watch the sun come. And I like to enjoy watching it because often it burns through the fog, broughtening up the day with the promise and hope of a new day. And as we are here today, I see that sun rising over this house and burning through the fog and lifting this house of representatives up. And I see it rising over the entire state of Georgia. And that's my vision. And it may I close by saying, thank you once again. Thank you from the bottom of my heart. May God bless each one of you, your family, and may God continue to richly bless the great state of Georgia. Thank you very much. Mr. Clark Ring the Bell. We always knew that dad enjoyed public service. Public service was a passion and a calling for him. Knowing that that was his love, his passion, made it a whole lot easier to share him with everybody in the state. He was larger than life, many ways. But his service to our state and the impact he made on the policies that impact the people's everyday lives in the state, for me, is what him bodies, what David Roxton was about. I speak Roxton was a heavy lifter and he liked to take home things that were transformational. How this is of that nature, you must form coalitions and you must coalesce. And that's one of the arts of negotiating that he had, that he was willing to do that. Today it was you who gave hope to many, many George's. God bless you. He was the solid force, level headed, the run up in the room at times. I think solid is a good word for him. I just thought so highly of him. He could say more than five minutes than any other person I've ever seen in politics. He was a big man with a big strong voice and he could swing that gavel and demand attention. And he could lead that chamber and run that chamber. The house of representatives with iron fists. But he also could do it with a big old soft heart. My sister and I joked as we were growing up that this is the same man who would bring them around straight dogs that he would find on the side of the road because he noticed a straight dog on the side of the road. The man that I grew up with for 33 years was just one of the nicest and warm hardest people that I've ever met. I knew him as a person who deeply loved his family. He always remembered where he came from and but he also realized that people were counting on him and us all over Georgia to make it better. Today, home to one. Oh, he loved Georgia. He loved the state. He loved everything about Georgia. There wasn't much about this state that he didn't find just amazing. I think he would want to be remembered and I think he was the average person. He came up from humble beginnings and I think that that's what drove his thought process. You know, when he made decisions or when he ran the houses that he always tried to look at things from the average person's perspective. He was a big thinker. He was a person that always was willing to listen and to share his ideas and to accept other's ideas. The thing I admired the most about him is he would not jump to conclusions. He would not rush to judgment to make a quick decision. He wanted to hear all sides of an argument. He wanted to hear from people for a situation or against an issue. He wanted to hear from Democrats Republicans. He wanted to hear from the business community. The speaker was available. He always had time for me and he had time for others. But more importantly, he enjoyed the engagement that he had. David Dawson was passionate about our state's economy and about giving all people economic opportunity. He was very proud of the fact that we're the number one state in the country for business. And he was very passionate about making sure that we had a good business environment in this state. And he would work in a bipartisan way to make sure that that happens. And I think that'll certainly be one of his legacies. So in R and the D disappear. And the Georgia take its place. We are in a period of complexity. And we have to push hard, work hard, put in the hard work, find ways to do things together collectively. He was unequivocal about that. I think by doing that, by finding common ground, by finding solutions is a tremendous, tremendous way to honor the service and the life of Speaker Ralston. I enjoyed being in the trenches with him. He strove with his leadership to bring a level of civility and inclusiveness in the chamber. Because David Ralston realized that we are all elected geographically from different areas of the state and that every area matters. I think people are going to look back at the time that David Ralston was here. Now that we've seen some of the things that have been put into motion because of his leadership, we know now that he made the right decisions, whether it be broadband or rural development, health care, mental health, transportation. But we had hate crime. He stepped to the plate and helped get that through the finish line. And when you start talking about the things of that nature, which are transformational, which are qualitative life issue, I think it paints a pretty good picture of who David Ralston was. We are a better state because of the work that we all did together and I accept all of us to really take the things that he did, the lessons that he taught us and the legacy that he has left and built on that. He would let you know that he did the best job he could and he left the house and the state in good hands, and that he believes in the leaders that are currently in place and that he would want them to carry on and keep doing the state's business. One of the things that I think he'd be proud of that we will continue, that we will make sure that all the views in this house are honored and they're considered as we move forward with policy. You know, I miss him but I still feel like he's here, things that we made better for George, who will live on because he was about public service, not politics. I just care about his neighbor, care about my neighbor. I'm very proud to have served with him and for him to have been my friend. We're as cannot express my friendship or relationship with David Ralston and I was truly truly missed him. As I said, when you passed a giant pine tree has fallen in the state of George. And the chair hereby declares the 20-22 session of the Georgia House of GERND, SIDEDA! The President of Ralston has received the majority of the votes cast is hereby declare an elected speaker of the Georgia House of Representatives for the insur- What a great tribute. Thank you Betsy, to your new routine. I would now ask Mr. Clerk if you would read a resolution. House Resolution 7 by Representative Burns, the 159th challenge with the 47th hatchet of the 155th, the 134th and the 143rd. A resolution honoring and remembering the life of the honorable David Ralston, 73rd speaker of the House of Representatives of this great state and for other purposes. Whereas the honorable David Ralston was born March 14, 1954 in L.J. Georgia, a distinguished native son of North Georgia. And whereas he attended Young Harris College and later earned a bachelor's degree from North Georgia College and State University and earned his law degree from the University of Georgia School of Law. And whereas he ran a successful law practice providing sound legal advice and counsel and Blue Ridge, Fannie County, Georgia for over four decades. And whereas he began a long distinguished career in public service in 1992 upon being elected to the Georgia Senate, where he served three consecutive terms. And whereas in 2002 he was elected to the Georgia House of Representatives, where was the elected speaker in 2010, which positioned he held until his untimely death. Whereas as speaker he shepherded many pieces of legislation beneficial to the citizens of the great state of Georgia through the legislature, including tax relief, criminal justice reform, transportation, infrastructure, funding, modernization, and adoption reform. And whereas he had a particular passion for improving the healthcare provided to Georgia citizens struggling with mental health issues. And whereas on November 16, 2022 he died peacefully at Piedmont Hospital, Atlanta, surrounded by his beloved wife Sheree, his children Matt and Elizabeth, and his family. And whereas the State of Georgia mourns the loss of this monumental statesman, distinguished Georgia, a native son of Gilmer County. Now therefore be it resolved by the House of Representatives that the members of this body joined together to express their deepest regret at the passing of the 73rd speaker of the House of Representatives, the honorable David Ralston, and extend their most sincere condolences to his family. Thank you, Mr. Clerk. You remain standing just for a minute. I know that I'm very honored and privileged to stand here on this roster. I know that any of you, that are members here, when I look around this room, former members, former colleagues, staff members who work so closely, speaker David Ralston, could be honored to come here just as I am and stand here on this day. It is a special day for this House. The man who left his imprint on this House. We will never forget him. You may be seated. Now I'm going to invite the Ralston family to the Ralston and ask his widow, our dear friend Sheree Ralston to accept this resolution and speak to the House. Sheree, Matt, John, Family, Sarah, they all come up. What an honor and a privilege to be with all of you today and to be in this room that my husband loves so very much. I'd like to start out by saying that our family, thanks you for this honor. My husband loved this state and he wanted to leave it a better place. He loved our community and he worked tirelessly to leave it a better place. If you are a staff member of David Ralston, he loved you and wanted you to be better and he always tried to facilitate that. We thank you. We love you, David Ralston loved you. He considered you family. Thank you for having us here today. Thank you Sheree. I'll be seated. John Ralston, I know what it is to lose a brother. It's a hard one. Matt, much stay with me. The much beloved Matt, certainly misalysed with the day. We thank you all for being here on this very special day. I know we all feel the same way but especially, speak to Ralston felt this way. Family is everything in life. From his immediate family to this House family. He loved and cared for us all collectively and individually in a very special way. I want to remind y'all of something to everyone who can hear my voice today. A story seldom told is soon forgotten. Let's tell this story. Let's continue to honor our friend by telling the story. What he did for all Georgians, what he will do for Georgians, for generations to come by the policies he implemented. He worked so diligently for with us here in this House. So let's continue to honor him. Speaker David Ralston, my remembering and carrying on his good work. We must never, ever forget a true champion for the people of Georgia. Speaker David Ralston, thank y'all. Now as Speaker Ralston would have asked us to do, carry on with the goodness of this day. Doorkeepers, will you unlock the doors? Now we love our chaplain. You can have a photo with him anytime. So if you're as I one now, you can go in that South Anya room and get one. But we have family and former members here. So I know many of you here would like to have a photo to remember today by with the families of Speaker Ralston. And former staff members and former colleagues. So we certainly will have that opportunity out in the South Anya room. So we all hope you'll avail yourself of that opportunity. Chair and air recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits. Chairman Tarvan. Thank you, Mr. Speaker. Mr. Speaker, your Committee on Information and Audits has read the journals from the previous legislative day and found it to be correct. And something else for us to think about. I'm going to read this because I scratched it out here. In nine years, I will dare say there's no one sitting there seat. And glazed up at the lectern there more than I have. More hours. I said in my seat and I've watched Speaker Ralston as I now watch you. And as Mac representative Jackson gave the invocation, I wrote this down and I'm going to read it. I haven't read one before, but I'm going to read this one. This is what I thought of as he spoke that I thought was in David Ralston's heart. Treat everyone with respect. Respect your colleagues, no matter how they may differ in their beliefs. Respect all with the same respect you expect. Thank you, Mr. Speaker. Chairman Tarvan, you know of what you speak. Chairman Tarvan, the Chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there an objection to dispense with the reading of the journal? The Chair here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair here's none and the journal is confirmed. I'm going to allow our guests to exit in just a minute. We want to go a little further. Mr. Clerk, who was a dear friend of Speaker David Ralston. They both loved and admired each other tremendously. Mr. Clerk, will you read the resolution establishing the order of Venice for the day? Representative Strachan of the 104th Moose Follomey establishes the order of business that are first part of the period unanimous consents, introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, report of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair here's none and the resolution is adopted. Now our guests on the floor, if you so desire, if you need to move on to something else, we'll allow you to be excused this time before we go on the first reading. So we'll pause just for a second and allow you all to do just that if that's your desire. Thank you for being here. Thank you for honoring our dear friend, Speaker David Ralston. you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you your house com the order Remember Thank you for your attention this morning very special morning for this house and I know I was the first reading the bills and resolutions that clerk will read House Bill 713 by represent Kelly the 16th Bill being tied in act to men and act creating a board of elections the registration for Polk County the intergovernmental coordination House Bill 714 by represent Cameron of the first to Bill being tied in act to men and act create a new charter for the city of Rossville 715 by represent Apollo the 33rd Bill be tied in act to men and act relative to the board of education Franklin County the intergovernmental coordination House Bill 716 by represent a lump sum of the 12th Dempsey the 13th part of the 5th Bill be tied in act to men and act to reincorporate the city of Caves Spring the intergovernmental coordination House Bill 718 by represent Jackson the 165th Stevens the 164th Westbrook the 163rd Gilly or the 162nd P. Tree the 166th and others Bill be tied in act to authorize the governing authority the city of Savannah to love you next size tax Antric governmental coordination House Bill 719 by represent of Neil the 79th Gilly or the 162nd Stoner of the 40th Bill be tied in act to men article 1 in chapter 7 of title 44 of the official code of Georgia annotated regarding landlord and tenant in general Judiciary House Bill 720 by represent of green and the 154th Bill be tied in act to authorize the assessment and collection of a technology fee by the mandatory court of Randolph County Antric governmental coordination House Bill 721 by represent of an allow is the 42nd Stoner of the 40th C ball the 34th Campbell the 35th Williams the 37th and others Bill be tied in act to amend and act creating the state court of Cobb County Antric governmental coordination House Bill 722 by represent of Campbell the 35th airheart of the 36th C ball the 34th Bill be tied in act to amend the act to reincorporate and provide a new charter for the city of aqua earth Antric governmental coordination House Bill 723 by represent of the lote the 167th Bill be tied in act to men the act to provide a method compensating the chairperson and members of the Board of Education of Macintosh County Antric governmental coordination House Bill 724 by resident of Fleming of the 125th and Jackson the 128th of Bill be tied in act to amend the act creating a new charter for the city of Thompson Enter governmental coordination House Bill 725 by represent of Williams into the 112th and Martinez is the 111th Bill be tied in act to amend the act creating a Board of Commissioners of Walton County Enter governmental coordination House Bill 726 by represent of Williams into the 112th and Martinez is the 111th Bill be tied in act to amend the act providing for a charge A change in the compensation to certain Walton County officers Enter governmental coordination House Bill 727 by represent of the lote the 167th Bill be tied in act to amend the act providing a new charter for the city of Darian Enter governmental coordination House resolution 473 of our represent of Anderson to the 10th Apollo 33rd Corp. 174th and Chocus the 151st Resolution creating House study committee on safety and consumer protection in the tree care industry Agriculture and consumer affairs House resolution 474 by represent a way to the 9th Cox the 28th Harvard the 2nd Apollo 33rd Martinez is the 111th and others Resolution urging the major league baseball Hall of Fame committee to induct a former Atlanta Braves player Dale Murphy to the national baseball Hall of Fame Special rules House resolution 475 by represent of Lewis Ward of 115 Douglas the 78th Holly the 116th and Scott of the 76th resolution honoring the life of pastors Spencer T. O'Neill and dedicating a bridge in his memory Transportation House resolution 476 by represent of Huddleston of the 72nd Campbell of 35th Bonner of the 73rd Anderson of the 10th Martinez is Martinez of the 111th and others of resolution urging Congress to enact legislation Defense and veterans affairs House resolution 487 by represent a Bruce the 61st and Thomas the 65th Resolution creating the House study committee on minority business enterprises Small business development Centipil 277 by senator Burns the 23rd of bill be taught and act to create a board of elections and registration Scroven County Intergovernmental coordination Senate bill 285 by senator Anderson the 24th burns the 23rd of bill be taught and act to create a Columbia County public facilities authority Intergovernmental coordination Senate bill 291 by senator Ken in the 18th bill be taught and act to amend the act to provide a new charter for the city of foresight Intergovernmental coordination that completes first readers Second reading of bills and resolutions the clerk will read House bill 709 by represent washburn in 144th to give the 145th night of the 134th A bill to amend and act to provide a new charter for the city of foresight House bill 710 by represent chokeus for the 151st A bill to create a board of elections and registration for slay county House bill 711 by represent Reeves of the 99th Restoration of the 104th clerk of the 108th McLean of the 109th mogul of the 105th and others A bill to amend and act to provide a homestead exemption $4,000 for all county school district ad warlam taxes for residents of Gwyneth County House bill 712 by represent Davis of the 87th Beverly of the 143rd Mitchell of the 88th Scofield of the 63rd Scott of the 76th and others a bill relating to program weights and funding requirements under quality basic education House bill 717 by represent bearer of the 24th McDonald of the 26th Jones of the 25th Jasper's the 11th cocks of the 28th and others a bill to provide for a homestead exemption from foresight county school district ad warlam taxes House resolution 449 by represent Cooper of the 45th I know lower to the 42nd Sebald the 34th washburn 144th Evans of the 89th resolution designating hypertrapic cardio my apathy awareness day Senate bill 287 by senator parent of the 42nd a bill to amend and act relating to the board of education of the city of Decatur Senate bill 288 by senator parent of the 42nd a bill to provide a homestead exemption from city of Decatur independent school district ad warlam taxes through second readers Reports of standing committees the clerk will read There's a robber dick in the 145th district chairman the committee on agriculture consumer affairs submitted the following report Misspeak your committee on agriculture and consumer affairs as that under its consideration following bills the senate to instruct a meeting reports The same back allows We're filing recommendations Senate bill 149 due passed by committee substitute respectfully submitted representatives Robert dick of the 145th district chairman Representative Williams the 148th district chairman of committee on bags and banking submitted the final report For speaker committee on bags and banking as added or its consideration following bills of the senate is destructive meter report to same back to the house following recommendations Senate bill 84 due passed Senate bill 90 due passed by committee substitute respectfully submitted Reps. Williamson 148th district chairman represent of Hawkins the 27th district chairman of committee on health submitted the following report To speak your committee on health has had a consideration following bills in the senate as a struck to meet a report to save back the Senate with the following recommendations Senate bill 164 due passed by committee substitute Senate bill 223 due passed Senate bill 197 due passed by committee substitute respectively submitted represent of Hawkins the 27th district chairman Perhaps a beth camp of the 135th district chairman of committee on intergovernmental coordination local submitted the following report But speaker committee on intergovernmental coordination local as I don't know its consideration Following bills of the house and senate as struck to meet a report same back to the house the following recommendations Hospital 675- döpasBeifall six 76- döpas Hospital 680- döpas Bonnie Chiefton Tempo House Fifth asgrass Grandmas House would be good for National and tennis Bill 231, new pass by committee substitute, respectfully submitted, represent Beth Campy, the 135th district chairman. Representative Tyler Paul Smith, the 18th district chairman of committee on Judiciary Non-Civil submitted the following report. Mr. Speaker, your committee on Judiciary Non-Civil said under its consideration, following bills of the Senate as destructive media reports say back to the House of following recommendations, Senate Bill 42, new pass, Senate Bill 44, new pass by committee substitute, Senate Bill 181, new pass, respectfully submitted, representate Tyler Paul Smith, the 18th district chairman. Representative Mandy Balinger, the 23rd district chairman of committee and juvenile justice submitted the following report. Mr. Speaker, your committee on juvenile justice as that under its consideration, following bills of the Senate as destructive media reports say back to the House with the following recommendations, Senate Bill 134, new pass, Senate Bill 135, new pass, respectfully submitted, representate a Mandy Balinger, the 23rd district chairman. Representative John Corbin, the 174th district chairman of committee and motor vehicles submitted the following report. Mr. Speaker, your committee on motor vehicles, as that under its consideration, following bills of the Senate as destructive media reports say back to the House of following recommendations, Senate Bill 35, new pass by committee substitute, respectfully submitted, representate John Corbin, the 174th district chairman. Representative Sharon Cooper, the 45th district chairman of committee and public health submitted the following report. Mr. Speaker, your committee on public health, as that under its consideration, following bill of the Senate as destructive media reports say back to the House the following recommendations, Senate Bill 1, new pass, respectfully submitted, representate Sharon Cooper, the 45th district chairman. Representative Mike Chokus, the 151st district chairman of committee on small business development as submitted the following report. Mr. Speaker, your committee on small business development, as that under its consideration, following bill of the Senate as destructive media report back the House with the following recommendation, Senate Bill 55, new pass by committee substitute, respectfully submitted, representate Mike Chokus, of 151st district chairman. Now, I can please the reading of the report's standing committees. The House will come to order. We're going to take up the local calendar. House will come to order. Members will take your seats. Both any rooms are empty. If you don't want to vote, you can go to any rooms, file with me. Members will take their seats and cease conversation. Third reading and passage of uncontested legislation. The House will come to order. Members will take your seats. Both any rooms are empty. If you don't want to vote, you can go to any rooms, file with me. Members will take their seats and cease conversation. Third reading and passage of uncontested local bills. For what purpose is representative Newton rise? To make a motion. State your motion. I move that Senate Bill 231 be removed from the local calendar and be voted on separately. Representative Newton moves at SB 231 be removed from the local calendar and voted on separately. Client, will you read the caption? Senate Bill 231 by Senator Burns and of the 231st, Richmond County of Bill to revise the voting rights, the mayor of Richmond Augusta County. On the general's motion, SB 231 be removed from the local calendar and be voted on separately. Is there objection? Hearing none, it is so ordered.\n\nIf there is no objection, we will vote on the local calendar as a whole with a recorded vote without SB 231. Hearing none is so ordered. The clerk will read the local calendar. Is there any objection to the previous question being ordered on the local calendar without SB 231? Chair has none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? Chair has none. The report of the committee is agreed to. Shall these bills now pass, all those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no. And of course, voting no, this is without SB 231 and the clerk will unlock the machines. Have all members voted, if so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 166, the nays are zero. These bills haven't received a requisite constitutional majority or therefore passed. The clerk now will read the caption to SB 231. SB 231 by Senator Burns, the 23rd Richmond County, a bill to revise the voting rights, the mayor of Richmond Augusta County. Is there any objection to the previous question being ordered on SB 231? Chair has none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair has none. The report of the committee is agreed to. Shall this bill now pass, all those in favor of the passage of the bill on the local calendar will vote yes. All those opposed will vote no. And the clerk will unlock the machines. For what purpose is represented, Frazier rise? Parliamentary inquiry. State you inquiry? Mr. Speaker, is it not true that the Augusta Richmond County Consolidated Government is a comprised of eight districts and two super districts voting commission and that this legislation was prepared by the mayor of the city of Augusta on his letter here in sit without the full body voting on this legislation. I'm sure the lady who lives in that area of this state knows of what she speaks. Father inquiry, Mr. Speaker. State you inquiry? Is this not true also that we are in violation of House Rule 8.1 here in this chamber that we adopted at the beginning of session because there are required signatures are not on the legislation from the local delegation. I'm sure the lady believes that it passed out of committee so I trust our process that they looked at the rule and assured us that it is in the proposition. Yes, inquiring, Mr. Speaker. State you inquiry? Is it true? Is it not true that I will not be supporting this legislation because one half of the Richmond County commissioners had no idea that this resolution was even being sent up here to the legislative council to be determined by one senator and one representative from Augusta Richmond County. I'm sure the lady knows of what she speaks. Thank you, Mr. Speaker. For what purpose does the representative Gladney rise? Thank you, Mr. Speaker. This is Speaker Yiel, sir. Paul Serian Quarry. State you inquiry? Sir, is it not true that according to the delegation rules it requires the legislative request from Augusta Richmond County be presented to the delegation and they were not and I will not be supporting this legislation. I will be voting no on HB 231, sir. I'm sure the lady knows of what she speaks and she has that right. Thank you, sir. For what purpose is representative Howard rise? Parliamentary inquiry. State you inquiry? Thank you, Mr. Speaker. Isn't it true that I have gotten calls from some of the five commissioners and constituents who were not asked to sign the resolution that initiated SB 231? I'm sure the gentleman knows of what he speaks. Further inquiry. State you inquiry? Isn't it true that the majority of the members of the local delegation opposes this bill on procedural grounds? If the gentleman says states we're going to find that out in just a minute. Finally, one more. State you inquiry? Isn't it true that I heard yesterday that it is a time on a tradition to respect the wheel of the local delegation when it comes to local legislation? I'm sure the gentleman understands what he speaks of and believes in what he speaks. For what purpose does chairman Newton rise? Parliamentary inquiry. State you inquiry. Mr. Speaker, isn't it true that of the 11 members of our local community leadership, the mayor and 10 commissioners that Senator Burns and I received a request from six of those 11 to put forward this movement? I'm sure the gentleman lives in that part of the Georgia and he understands. So I respect what the gentleman says. For what purpose does the bill rise? Thank you, Mr. Speaker. Parliamentary inquiry. State you inquiry. Isn't it true that I also heard yesterday that we would give the same difference that we were given yesterday by the opposing party? Well, I don't know what all of y'all heard yesterday, but I'm sure the gentleman is conferred exactly what he thought he heard yesterday. We have one last inquiry as representing Thomas from the 21st. For what purpose does representing Thomas rise? Parliamentary inquiry, Mr. Speaker. State you inquiry. Is it not true that yesterday the people that are complaining about voting on local bills voted against my local bill yesterday? And I'm not a big fan of hypocrisy. Is that not true? Well, I'm not sure I'd go that far, but I'm sure that the gentleman knows what he speaks on the vote count from yesterday. I'm going to take one more and that's from, for what purpose does representing Wilkerson rise? Parliamentary inquiry. State you inquiry. It would be helpful. Is it not true that it would be helpful if someone could explain to me that if a local delegation has rules under rule 18, that therefore those rules should be followed, and the only time you would go to the end of the government coordination under my understanding is if they do not have rules. And in this case, my understanding is the government has rules. Therefore, they should have followed the normal process, and I would be very appreciative if someone could explain that to me at some point later. Well, I like you inquiry because you can explain to you later. And you can, when you get to answer, I hope you'll share that with me as well. So I'm sure the gentleman understands what he said and believes that. Have all members voted? Have all members voted if so. The clerk will unlock the machines on the passage of the bill on the local calendar of the eyes or 99, the NACE 70, this bill haven't received it requisite. Costitutional majority is therefore passed. We're going to recognize our doctor of the day today, representing Doug Stoner. Representative Stoner will introduce our doctor of the day. Hello. Thank you, Mr. Speaker. I'm very enthusiastic to introduce the doctor of the day today because he's actually my doctor. My actual endo, actually, my wife too, who's here with me, he's our endo, is I mentioned both my wife and I, my wife's type one and I'm type two. And so we're happy to have him here, and particularly because today is type one diabetes awareness day here, both in the house and senate. So we're definitely happy to have him here on that issue too. So just real quickly, Dr. Jonathan O.B. is a Tennessee native and graduated from Magna Camlata from Lee University. He graduated medical school from the University of Tennessee and completed his internal medicine residency at the University of Alabama Birmingham. And he moved to Atlanta and completed his inter-crenonology fellowship at Inri University. And he practices general inter-crenonology and focuses on insulin pump management for patients with type one diabetes, pituitary tumors, thyroid diseases, and a general diseases. He also performs ultrasound, guided thyroid biopsies in the office. So he's also doing research. His research findings have been published in well-known medical journals and works as an investigator and a sub-investigator and multiple clinical trials currently active within the practice. He has presented before annual meetings with the American Association of Clinical and Endocrinologist, and travels to educate other doctors regarding new and emerging endocrin- nod. I'm having fun with this one today. Endocrinotherapies. And in 2014, he was honored by the juvenile diabetes research foundation. One group initiative and recognition of his confidence in community educational and networking activities. And Distinctswin also recognizes efforts in creating awareness of cutting-edge research supported by JDRF and hopes to find a cure for type one diabetes. One of the quick things for the doctor, say a few comments. On your desk today, there's an example, a visual example for you to look at about managing diabetes and how that works. And this is something I think, because the leading cause of blindness in the United States is diabetes and everything. To this time, Dr. As an endocrinologist and a diabetes specialist, it's an honor to serve as Dr. The Day for you today, especially today since today's type one diabetes day here at the Capitol. Please be sure to read all the information that we've provided to you at your desk. And if you run into any of the pages since they are children, be sure to ask them. They'll be more than happy to show you their insulin pump and their monitor if they're wearing it. Just show you how it is to live with a chronic disease, especially as a kid. If you have any questions with the handouts that you have at your desk, feel free to come see me at clinic. Thank you. We're especially proud to have you with us on this day. And thanks for those explanations. We appreciate whether our medical staff that comes from all over this state comes in and provides for us. Thank you. Dr. We appreciate you being here. We'll move on to morning orders. Representative Wade is recognized for a morning order. Representative Will Wade. I want you to be on your own time limit this morning. We won't limit you too much, but don't abuse it. Representative Wade's recognized. Thank you very much, Speaker, and I do appreciate that. I will keep my comments short, but I want to honor two very important people and thank a friend that is here today. First I want to tell you that I put this book on your desks as a gift, because I want you to hear this as members of this house family. I love each of you. Each of you inspire someone each day. Many of you have taken a day out of your time and inspired me since being in this house. But this gift is to honor two very important men in my life. You see, two years ago today we had the going home party for my late father. He inspired me to serve. He was an example for my brother and myself and my community. His name was Charles Royl Wade III, born in Leslie, Georgia, Sumter County in 1947. He should have died at eight years old when he was run over by a car. But he didn't. He was inspired by a doctor to keep fighting. He grew up in one of the poorest parts of this state back in those days, and he was told he wouldn't ever accomplish anything. He had the equivalent of three masters degree, one in mathematics. So it was perfectly fitting that he would have passed on Pi Day and go on home. But to honor him, I wanted to give you this gift, but also for a person who was also important in my life. That is our former speaker, David Ralston. He was kind of the father of this house for a period of time. And he was an inspiration for many people as well, especially back in the mountains where I'm from. To honor both of those men, a friend of mine doesn't know that this book spoke to me immediately when I saw the title. But he's here today, Kevin Paul Scott, the author of this book. He's been a friend of mine and was with me when I found out my died was suffering from Alzheimer's and he's been a rock for me and my family. So this gift, I hope you will accept to honor both my father, Royl Wade, and also late speaker, David Ralston. And I hope that you will take time each day to be inspired and to be an inspiration. God bless you and thank you, speaker. Thank you, Representative. We appreciate that. Very meaningful. Representing Martinez is recognized for a more than order. Thank you, Mr. Speaker. Mr. Speaker, today is, we got some beautiful women here from Loganville. The Loganville Women's Club is here representing our great city. Let me tell you something about these great women. This club was created in 1939. Their club motto is wisdom, justice, and moderation. They give so much to our community, including special Olympics, Loganville High School, and also the Girl Scouts. Mr. Speaker, I'd like to recognize them. Also I got a good friend, Mr. Doug Blemmons. His wife Samantha Doug Blemmons is a pillar in our community. He is a top producing insurance agent in Loganville. He's an achiever of the year. And he's also a former president of the Rotary Club. His agency gives so much to our community. And this past week he was recognized by being the best Walton insurance, the best insurance in Walton County. So Mr. Speaker and my fellow and my legislators, please let's recognize our great people from Loganville. Thank you. We're representing Mathis, recognized for a morning order. Thank you, Mr. Speaker, members of the house. I'm here today on a good and happy note. We have the Blackly County High School Girls Cross Country team for winning the 180 Division 1, 2022 Cross Country State Champions. Like for you all to stand up today, we would especially want to recognize our coach, Shelly Cranford, our principal Brad Knox for Blackly County. If y'all stand up. So we have the individual State Champion in Cross Country Ella Gibbs here. And I want to throw a shout out for the individual boy State Champion from Blackly County Luke Churchill that was not able to be here with us with all these nice, pretty young ladies. So can I get members of the House to give them a big hand. Thank you very much. I'm going to be a little bit more patient. Representative Holland is recognized for a morning order and representing Becky Evans is up there with her too. Thank you, Mr. Speaker. And any other Presbyterians in the House are welcome to come join us in the well. Colleagues, I am what's known as a cradle Presbyterian. I was born into the Presbyterian Church and I can do you one better. I was born to the associate pastor of Old First Presbyterian Church, which makes it my supreme honor to welcome Presbyterians for a better Georgia who are here with us today. This is a group that is called by their faith to share their thoughts on policy issues and the work that we're doing here as legislators based on their Christian beliefs. They are here today. Some of you may be being called to the ropes or visited in your offices. I would encourage you to meet with these fine folks who are here to speak with you, including the aforementioned associate, former associate pastor, my dad. If you get called by my dad to the ropes and you can't find the time to go say hello, you and I might need to have words later. Presbyterians, the old joke is that we are the lords frozen chosen, but I promise you the people here today have warm hearts and warm spirits. I'd like them to rise in the gallery so we can say hello. Thank you for being here. And thank you, Mr. Speaker. Thank you, Representative Holland, and welcome to the People's House. Good to have you all. Representative Jason Ridley is recognized for a morning order. Mr. Speaker, thank you. I don't know about a critical Presbyterian, but I know what a back-roll Baptist looks like, and I'm here. Ladies and gentlemen, today is a special day. You probably seen some guys up earlier who are hats on. They're from America, a hat company out of Bowie, Texas, or Bowie, Texas, what they pronounce it there. They're going to be able to build an all day today to four o'clock in room 201. As my buddy always says, it ain't cheap to look cool, but you can be cheaper today. Because I think a special price for all of us legislators are going to put the seal inside of the hat for you. So go over and make sure you go over and see him. Keith Mundy, the President of the American Hat Company, is also flew in, so he'll be over there measuring everybody. So if you want to look out at me, go get your hat. Thank you. Let's see now. We have a whole delegation warning to come up, Chair Lady Matthew Eck, Chairman Knight, and Representative Daniel. Y'all come on down. There comes Representative Daniel. Nice to have you. Nice to have you. And we're going to recognize this delegation for a morning order. Thank you, Mr. Speaker. Today we get to honor the Griffin High School Lady Bears. They recently won the 4A State Basketball Championship. If you'll please stand and honor their head coach Johnson, their assistant coach Puckett, and our Lady Bears from Griffin, Georgia. Thank you so much, Mr. Speaker. We are so proud of you ladies and thanks for coming today. Congratulations, a great achievement. Thanks for being here. Representative Hagen is recognized for a morning order. Thank you, Mr. Speaker. We have here in the gallery today some guests from Vadeya, the Vadeya Onion Committee is here. If y'all go ahead and stand up up there, they are here today to receive a proclamation from the governor declaring April 20 through 23rd Vadeya Onion Festival days for this year. Members of the Committee Mayor Doug Roper, the chairman of the Committee Jake Clegg Horne, Greg Hagen's Alexa Britten, Valerie McClendon, Brad Owen's, Tonya Parker, Andy Woodruff, and Dustin Booth. Thank you all so much for being here and we hope that many of you will kind of Vadeya in April for the festival this year. Thank you. How is that sweet onion crop looking? Looking good. All right. Love them. Chairman Todd Jones and the four-site delegation. Oh boy. Let's see. There's Chairman Jones. Representative Barrett, Representative Jasper, Representative Clark. Good morning, ladies and gentlemen. It's India Day at the Capitol today and we were honored to have a great turnout earlier this morning with Dr. Swade Kulkarni, the council general for India here in Atlanta and about 100 great friends. We are so proud to have them at the Capitol today and we have presented this great resolution to recognize the great contributions that they have made to our wonderful state and to our community in North Atlanta. So we're just delighted that they're here. They're sadly they're gone already but anyway we'd like to stand up and recognize them for their great contributions to our state. I hope we got a picture of all you guys together. What do you mean it'll make cameras that big? We'll move on to the rules, calendar. Mr. Clerk, will you read the caption to SB 3? SB 3 by Senator Albers of the 56 and others to be entitled to amend chapter 4 title 50 the fiscal day Georgia and tentative related to organization of executive branch generally so it's required state departments agencies, boards, bureaus, offices, commissions, public corporations and authorities to assess educational, experimental and training requirements for positions of employment. This bill I refer to the committee on governmental affairs that committee recommends that this bill do pass. Thank you Mr. Clerk, Representative Scott Hilton has recognized to present the bill. Thank you Mr. Speaker and colleagues, it's my honor to present to you Senate bill 3, the reducing barriers to state employment act of 2023. This is an effort to reduce the review of positions in state government to ensure that the education, skills and experience match up with a position we are currently hiring for. As you know both the private and public sector right now are in a war for talent and we don't want to place any artificial barriers in their way. As an employer we want to make sure that we are not requiring a four year degree, advanced degree or certification that does not apply to the job we are currently hiring for and lose out on the opportunity to have our best and brightest apply for that job. There are many technology jobs in our state that bill gates wouldn't even qualify for because he lacks a necessary college degree. We also have jobs that might require a five or ten years of experience in a technology or process that's only one or two years old. I want to give a special shout out to DOAS who will leave this effort and do a fantastic job of evaluating job descriptions and hiring needs in our state. Again we don't want to miss the opportunity to give people their chance to work for our state government and flourish in their career. This does not take away from the need for certain education and certifications at all. This is simply an opportunity for us to assess each one and make sure they accurately reflect the state's hiring needs. With that Mr. Speaker I will yield for questions. You have no questions. Thank you Mr. Speaker, are you the one? The gentleman is yielded well, we do have a speaker. Representative Jasmine Clark is recognized to speak to the bill. Thank you Mr. Speaker. Good morning colleagues. Today I rise not to necessarily oppose this bill, but just to express some concerns I have about SB 3. I believe that the intentions of SB 3 are good. We have a work for shortage in our state agencies and we need a recruitment tool in our tool belt in order to fill those positions. Everything standards for those positions does have the effect of increasing the potential pool of candidates that are eligible for these jobs. From a logical standpoint this will then increase the number of eligible applicants. However I do think this bill ignores an important root cause of our work for shortage. While this is a great recruitment tool it is not going to help with retention. What good is it to people or to get people in the front door if they just walk right back out of the back door for a job with more competitive pay. People are trying to live their lives. They are trying to raise their family. They are trying to keep...\n\nroof over their head, they're trying to keep food on the table. In the state of Georgia, even if they get one of these state jobs that we might loosen the restrictions for, they still need that job to pay them enough money to survive. I've listened to enough appropriations presentations by different departments in our state to know that without actually paying more competitive wages, they can't keep people in these positions. Wages for state positions are just not competitive with private industry. And as private industry is actually doing the very thing that we are doing here today, and also re-evaluating educational requirements for certain positions, the net effect will ultimately be the same. They won't need the degree to get into private industry, and they can make sometimes double and triple what the state is willing to pay them to do these jobs. So as we vote today, let's ask ourselves what we really need in our state to address our work for shortage and to fill these empty positions right now that we want people in those positions. I think this is a step in a direction, but right now, I don't think it's necessarily the step in the right direction that we need to do to fill these positions. And with that, Mr. Speaker, I will yield the well. The lady has yielded the well. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. For what purpose is represented Becky Evans-Rise? Thank you, Mr. Speaker, Parliamentary inquiry. State inquiry? Yes. Isn't it true that with the review of these state jobs that it could be some jobs don't require four-year degrees, and thus people may not encourage much debt, and thus we may be able to accept that the pay scale may be appropriate for these jobs if they just need a two-year degree. Get the lady so states? Yes, and isn't it also true that perhaps after this study we can look at the career fields and perhaps look at our hope grants, and maybe some additional areas might be worthy of the hope grant to your accreditation? The lady so states sounds like a little common sense to me. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 168, the nays 0. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 2727? Senate Bill 27, I Senator Brass, the 28th and others to be entitled to enact to amend Code Section 3364, the fiscal to Georgia annotated, relating the enumeration of unfair methods of competition and unfair to septivacs or practices in penalty. So it's a prohibitive health care insurer from requiring an ophthalmologist or optometrist to extend any discounts on services that are not covered. High care services, this bill I refer to the committee on insurance, that committee recommends that this bill do pass. Representative Matthew Gamble will present the bill. Thank you, Mr. Speaker. I rise today to present to you Senate Bill 27. This legislation follows up on a bill that we passed two years ago in 2021, Senate Bill 43. The intent of that bill was to prohibit insurance companies from requiring optometrist or optometologists from being forced to provide discounts on non-covered services. An example of a non-covered service would be requiring a discount on a second pair of glasses that is not covered by insurance. We're pleased that most of the insurance companies have complied with this law. The optometrist and ophthalmologist both support this legislation. And what we're fixing in Senate Bill 27 that you have before you today is a loophole that we're seeking to further update the law to make it clear that requiring optometrists or optometologists to provide discounts on non-covered eye care services for increased rates, reimbursements, preferential treatment or any other benefit would be illegal. So with that, Mr. Speaker, that's what Senate Bill 27 does. I'm happy to answer any questions. You have no questions. Thank you. Ask your favourable consideration of Senate Bill 27. I yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to report the committee which was favourable to the passage of the passage of the bill? Chair, here's none. The report the committee has agreed to. Shall this bill now pass all in favour of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose of the leader Beverly rise? The gentleman has that right and the gentleman will so reflect for what purpose is just Chairman Collins rise? Parliamentary inquiry. State inquiry. Is it not true that anyone can see that this is a good bill? Well, I haven't locked the machine yet this till time. Have all members voted if so, the clerk will lock the machine. On the passage of the bill, the aides were 167, the nays 0. The bill haven't received the requisite constitutional majority is there for a pass. Now I agree with you, Mr. Chairman, it's a good bill. Mr. Clerk, will you read the caption to SB 116, 116? Senate Bill 116, by Senator Watson, the first and others to be titled an act to amend Code Section 36376. The official code of Georgia and it's under relating to disposition of municipal property generally so it's revised provisions relating to the maximum term of certain leases or contracts for use operation or management of real or personal property. This bill I've referred to the Committee on Governmental Affairs, that committee recommends a disbuell due pass. The gentleman from down in Bell Dostoway, Chairman LeHood will present the bill. Thank you, Mr. Speaker and members. This bill, what it does, it lengthens the amount of time a municipality can lease a recreational facility from two five-year terms to 120-year term. And the reason this is necessary is because we have some tenants in these recreational facilities who want to engage in a significant cat-bex projects, you know, $10 million and more. And they just can't do that if they can't be insured of a longer lease. So that's what the bill does, Mr. Speaker. And if there's any questions, I'll yield for any. You have no questions. Very good. Ask for your favorable consideration. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the Report of the Committee which was favorable to the passage of the bill? Chair, here's none. The Report of the Committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. Have all members voted if so, the clerk will. Lock the machine. On the passage of the bill, all the yeas were 170, the nay zero. The bill haven't received the requisite constitutional majority is therefore passed. We're ready to move on to afternoon orders. Representative Carter is recognized for an afternoon order. Representative Doreen Carter. Thank you, Mr. Speaker. I go morning, thank you. I want you all to join me on this very special day. We celebrated our Speaker Rosson today as his birthday. But in 2020, just before we shut down, we had an opportunity to bring my cousin, we call her cousin, Lila, but her name is Mary Morgan, to celebrate her birthday. We were going to have a birthday party and we were going to have a birthday party. We were going to have a party party around out. They shared the same birthday, and the picture on the left is from her party Saturday. They brought her in and a carriage. So she is the queen, Mary Margaret, if which you join me in wishing her a 95th birthday. Happy birthday. Happy birthday. Happy birthday. Happy birthday. Happy birthday. Happy birthday. I love you. And I yield the well. 95th is strong. That's very strong. Representative Claim is recognized for an afternoon order. Thank you, Mr. Speaker. I just want you all to know that the Facebook training that was scheduled last week will be Wednesday, March 15th from 12 to 1 in Room 307 in the CLOB. This is the Facebook training that the working family caucus had a week ago that we had to postpone. It will be in Room 307 in the Cup of the Ill Legislative Office Building from 12 to 1 tomorrow. Thank you, Mr. Speaker. Thank you, Representative. Representative Anola Witts is recognized for an afternoon order. Thank you. And I'm glad to be joined by my colleague in the Georgia, it's the unofficial Georgia Taiwan caucus. We are honored in this General Assembly that Elliott Wang, the Director General of the Taipei Economic and Cultural Office in Atlanta, will be here at the Capitol to welcome us to lunch and a discussion of US Taiwan relations. This is going to take place upon a journey in this building in Room 230 and you will have more information on your desk tomorrow. I hope you can join us. Thank you. Thank you, Representative Gamble and Representative Inulo Witts, the Taiwan caucus. Representative Bentley is recognized for an afternoon order. Here she is. And the funeral home caucus, I'm instructed. Thank you, Mr. Speaker and members of the House. We all know today is a very special day because it is today of our late speaker, David Rolliston. And I'm often reminded of a quote that says the measure of a man is not how to he die, but how did he live? Not what did he get, but what did he give? And we know that Speaker David Rolliston gave a lot to this General Assembly, to this state of Georgia, and to his beloved University of Georgia. So at this time, ladies and gentlemen, I ask that you please stand as members of the funeral home caucus, make this presentation and honor of our beloved speaker, David Rolliston. I'll be happy with the funeral home caucus. We present this keepsake blanket and honor of our speaker, David Rolliston. And we'll make sure that his wife and family receives it. Thank you, funeral home caucus. That's special. A great tribute. We appreciate y'all doing that. Members, I want to recognize a former member from a member of former representative Morgan, who's now representative of her name, now is Alicia Cerise. Is that right? Cerise. It's good to see you back. We appreciate just all welcome former representative. Mr. Clark, will you read the caption to a group of privileged resolutions? Honoring and remembering the life of the honorable David Rolliston 73rd speaker, the House of Representatives of this great state. Congratulations, the George Walden Academy Lady Bulldogs are winning the 2023 Georgia Independent Athletic Association State Championship. Commending Joseph Parker Woodland High School's 2023 STAR student. Commending the National College Resources Foundation upon his 19th annual Atlanta Black College Expo. Recognizing association of Georgia General Aviation Airports as an industry association for general aviation airports. Commending the students of Parkside Elementary School for their exemplary performance in sportsmanship during the school's 2023 Penny Wars. Recognizing commending Father Thomas, Alice Cendroni. Recognizing commending the East Georgia Council Coalition. Recognizing commending J. Michael Levin Good. Commending Kimmerley Human Woodland High School's 2023 STAR teacher. Commending Tom Bowen Carterville High School 2023 STAR student. Commending Omar Nuez. Carterville's Carter'sville High School 2023 STAR teacher. Congratulations, the Black and the County High School Girls Cross Country Team on winning the 180 Division 1 2022 Cross Country State Championship. Commending Susan Payne in any Christian schools 2023 STAR teacher. Commending Luke Whitehead in any Christian schools 2023 STAR student. And for other purposes that completes the reading of the privilege resolutions. Is there an objection to adopting the privilege resolutions that Chair here has done and the resolutions are adopted? We do have some announcements. But the Chair will ask for your attention. I'm going to bring you up to speed on with an announcement on a couple of our members. You know, as we go through the remainder of this day, committee meetings and tomorrow, the next couple of days, as we go through session and get in a very important fast-paced time for us, let's always be mindful of our own health and the health of other members. So today I want you to remember and say a prayer for the safe return and health return of representing Debbie Buckner. Representing Dar Shionkindrick. Representing Sheila Jones. And representing Pedro Marin. Nothing I'm giving you a law or a moan other than say, let's say a prayer, they return back to us and in the very near future, hopefully by tomorrow. And so members, you also will receive an email from leader Beverly and myself. If you do not, if you've not seen the services, then the schedule of services for representing the geese, we will send you those this afternoon so you can make appropriate plans with the family for her going home in the next few days. And you that send you out later today. Announcements. Chairman Lumpston is recognized for an announcement. There will be an insurance committee meeting in the morning, full insurance committee, 8 a.m., CLOB, 606. Need my members there. Thank you. Representative Alexandra is recognized for an announcement. Thank you, Mr. Speaker. Women's legislative caucus will meet room 216 and immediately upon the German. Thank you. Chairman Parsons. Recognize for an announcement. Thank you, Speaker Burns. Just a reminder that energy utilities and telecommunications will be meeting this afternoon at 3 p.m. and room 403. We have a couple of measures that we're going to take action on and your time is getting on late in the session. Thank you. Speak right. You'll do well. Leader of stress is recognized for an announcement. Thank you, Mr. Speaker. There will be a chairman's lunch room 403 upon a German. Thank you. Chairman DeLouch is recognized for an announcement. Thank you, Mr. Speaker. All freshmen members, mandatory ethics training, 8 a.m. to tomorrow morning, it will not be rescheduled. It will be held. Thank you. That was clear enough, Mr. Chairman. 8 a.m. tomorrow morning, it will not be rescheduled. I get it. Chairman DeCouper is recognized for an announcement. Thank you, Mr. Speaker. Members, we will have a public health meeting today at 1 o'clock, room 606. Public health today, 1 o'clock, room 606 in the C.L.O.B. Thank you. Representative Vince Smith has recognized for an announcement. Thank you, Mr. Speaker. This afternoon at 2 o'clock, the Natural Resources Subcommittee on Resource Management will be meeting in room 506 of the C.L.O.B. That's 506 at 2 p.m. Thank you, Mr. Speaker. That completes our announcements. We don't have any birthdays today other than remembering David Ralston. Wait a minute, we may have one. For what purpose does Representative Sharper rise? Thank you, Speaker. As you know, for all of the years that we were here in session, I've always sung the Happy Birthday song for Speaker Ralston every year that we were here in session. So I think it's very appropriate for me to have the opportunity to sing that for Speaker Ralston because that is something that he would look forward to and something that he will want for his birthday. Representative, I think what do y'all think? Yes, I think we would agree with you. Let's hear it, Representative Sharper. Happy Birthday to you. Happy Birthday to you. Happy Birthday, Speaker Ralston. Because we really miss you. Thanks, look, thank you. We do have pages today. If you have pages, I think a lot of you already lined up, so we'll have some page for those. The majority leader of this house is recognized for a motion. They can, Mr. Speaker, I move that this house stand adjourned until 10 a.m. on Wednesday, March 15, 2023. All those in favor will say aye. All those posts say no. Yeah, I said it. We're adjourned. You",
  "updated_at": "2026-02-13T06:05:52.700339+00:00"
}