{
  "video_id": "mf-t6V44RRk",
  "url": "https://www.youtube.com/watch?v=mf-t6V44RRk",
  "title": "Rules Meeting for Day 37 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 37,
  "video_date": null,
  "duration_minutes": 12,
  "summary": "Here is a summary of the Georgia Rules Meeting for Day 37 of the 2025 Session:\n\n**Overview**\nThe meeting covered a variety of bills and resolutions, with a focus on issues related to addiction, visitation rights, insurance market reform, and the legislative branch's investigative powers.\n\n**Key Actions**\n- **HR 557**: Creates a study committee on Georgia's two investment funds.\n- **HR 512**: Creates the House Study Committee on Addiction, Epidemic, and Solutions for Recovery.\n- **SB 30**: Relates to puberty blockers, with careful restrictions around their use.\n- **SB 173**: Creates a simple procedure to expedite uncontested motions in state superior courts.\n\n**Bills Introduced (First Reading)**\n- HR 659: Creates a study committee on insurance market reform.\n- HR 72: Creates a study on increasing access to cancer care and screenings for minority populations.\n- HR 611: Creates a Health Study Committee on Abandoned Child Placement Following Hospital Discharge.\n- SB 131: Discussed, but details not provided.\n- SB 255: Deals with the investigative powers of the legislative branch, including the power to issue subpoenas and compel attendance of witnesses.\n\n**Notable Moments**\n- Debate on SB 30 (puberty blockers) and its potential impact on children's mental health and suicide risk.\n- Recognition of Chairman Jasper's leadership in bringing together first responders and veterans.\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nThe transcript mentions a \"hard stop at 9:30\" to go into the chamber, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not explicitly state when the meeting was adjourned or the date of the next session.",
  "transcript": "Morning, everybody.\nMorning, everybody.\nIf you will, please come on in and\ntake your seats and we'll get started.\nHappy Friday.\nYou all had as much trouble getting here this morning\nI did all the lights right down on this end of town and yeah, I don't know what's going on\nThank y'all\nuh\nWe'll open up mask chip and listen to opens with order prayer please\nGood bow with me\nAlmighty most holy god. We thank you for all of your many blessings and we thank you for the\nopportunity that you have given to each of us to be here. We ask lowered for your wisdom as\nyour guidance, as we go through these final days, as we start getting to the end of our work,\nwe just ask that you would give us your wisdom, your guidance, and the direction and all that we\ndid for prayer and Jesus name and for His sake. Amen. Thank you sir very much. Appreciate\njust want to remind everybody we got a hard stop at 9.30. We got to go into the chamber. So\nwe're going to move right along quickly. So we'll be willing to hear anybody wants to ask for\nfor something. Just come round it up and let us hear from you, please.\nGood morning, Mr. Chair and members of the committee. I have HR 557,\nwhich is the first sheet in middle ways through the page. And this wouldn't create a\nstudy committee on Georgia's two investment funds to figure out what to do and not to do.\nAnd the first step is obviously having a study committee. So that's HR 557.\nThank you, no questions. Thank you, ma'am. Thank you.\nChair Lee Haguey.\nThank you, Mr. Chairman and committee. I have House Resolution 512. It is halfway down the first page of the blue sheet.\nThis would create the House Study Committee on Addiction, Epidemic, and Solutions for Recovery.\nAnd we would look at all forms of addiction and there would be 13 members appointed by the speaker eight would be house members and the other five would be people who are impacted by addiction issues or who are working in the addiction treatment or in recovery community as well.\nThank you ma'am. Don't see any questions. Thank you.\nGood morning, Mr. Chairman and committee, I'm here with SB 30 page 2, third from the bottom.\nThis has to do with Peary Blockers.\nIt was adjusted in the committee and I would ask you to move it and move it on out.\nThank you.\nOkay.\nHave a question for you with part.\nThank you Mr. Chairman.\nSenator Watson, is it not true that there's overwhelming consensus from every major medical association that gender-affirming care, including puberty blockers from minors reduces suicide risk and improves long-term mental health such that your bill if it passes would likely result in a lot of pain, suffering, and possibly even death of Georgia's children?\nWould you read that back to me again one more time?\nIs it not? No, I got it. I'm sorry.\nWe thoroughly debated this and there's a disagreement opinion and I'll disagree with your premise and it's about it. Thank you.\nThank you, your lady Cooper.\nSenator, is it not true that this was a different version than the first one that he might be thinking about and that this allows for the blockers to exist, but puts very careful restrictions around their use, which is what is recommended by the pediatric National Board and so forth?\nIt is a different bill than what was in the Senate, it came out of committee, and I would suggest that we move it and let the process work. Thank you.\nThank you, Senator. Don't see any other questions. Thank you, sir.\nThank you, Mr. Chairman.\nSenator Havius.\nThank you, Mr. Chairman. I have.\nIn a bill, 245, it's at the bottom of page four.\nIt's basically it's grandparents visitation bill\nand what it does simply, it says that grandparents\nwho have previously been granted visitation rights\nto a grandchild may modify those rights\nor may ask the court to modify those rights\nin the event of the death, the incapacity\nthe incarceration of a parent.\nOkay.\nThank you, Senator Noxini.\nQuestions?\nThank you.\nGood job.\nThank you.\nThank you, Mr. Chairman.\nOn page one at the very bottom-center resolution,\nresolution 231, offer.\nRemembering our Fallen Officer in Roswell Interchange,\nI know Chairman Jasper has done an excellent job\nputting all the first responders and veterans together.\nThank you for his leadership.\nOn the next page page two half way down Senate bill 23 is an increase of the amount of alternative investments that can be used for both the ERS as well as a firefighter pension fund\nAnd then Senate bill 27, which I mentioned yesterday is\nDoxing which is basically online stocking. I want to thank Chairman Tyler Paul Smith for helping perfect this in the house\nOkay, thank you sir. Don't see any questions. Thank you\nChairman Dickie\nThank you, Mr. Chairman, bring you H.R. 590.\nSome 35 years ago, this legislature established a commission fee to help our visually and hearing\nimpaired citizens and technology has really outpaced what we're trying to do there and we\nwant to look at the possibility of reducing those fees or doing away with those fees and\nthose type things.\nSo that's what this bill does.\nOkay, don't see any questions. Thank you, sir. Senator Terry\nThank you, Mr. Chairman. Senate bill 21 it waves the local government immunity if the local governments are not following Georgia immigration law\nOkay, have a question boy whip part has a question senator tillery\nHelp me understand the majority parties\nPriorities here with respect to allowing people to sue cities\nbut not but trying to limit lawsuits against big corporations.\nAll right, now you can't see the city at all, right?\nSo we're opening it up in some shape for our fashion\nif they're not following the laws that have already been passed by this body.\nSo you're making it easier to see cities\nbut harder to see corporations in this legislative session?\nNo, I don't think that's necessarily true.\nIf you're looking on the entire gamut of what we allow to be sued\nthen you're actually trying to open up and move cities\ncloser to where corporations already are.\nso making it easier to see cities.\nMaking it easier to see cities\nwhen they're not following the laws\nthat will pass by this chamber.\nOkay, don't see any other questions.\nThank you.\nSenator Blierne.\nGood morning, Mr. Chairman and committee.\nBring you SB173 that's on the very bottom of page three.\nThis is a judiciary bill.\nIt creates a simple procedure to expedite uncontested motions that are basically not controversial\nin states, period courts, a lot of gratitude to the House Judiciary Committee for making\nthis bill a lot better and to Chairman Gunter for carrying it.\nOkay, don't see any questions.\nThank you, sir.\nThank you, Mr. Chairman.\nOkay.\nAny members of the committee having any requests?\nOh, Christmas tree, Chairman Lenson.\nPage one, third from the bottom, House Resolution 659 creates a study committee on insurance\nmarket reform.\nOkay.\nLet's see.\nSenator Hawkins, I mean, Representative Hawkins, Chairman Hawkins, there you go.\nThank you, Mr. Chairman.\nHouse Resolution 72, second from the top on page one, it's a study for real Georgians\nminority populations of increased access to cancer care and also cancer\nscreenings. Okay.\nTwo minute of the askers.\nI'm going to recommit it.\nWe'll get to that in just a minute.\nOkay.\nWho's that?\nSurely you're damp.\nIs that you?\nUm, fourth from the bottom on page one, HR 611.\nthe Health Study Committee on Abandoned Child Placement Following Hospital Discharge.\nOkay.\nDegree.\nThank you, Mr. Chairman.\nOn page three, number ten, Senate Bill 131.\nWe've had a lot of calls and interest in this particular bill.\nBill 131.\nYes, sir.\nThanks, sir.\nOkay.\nCity County.\nThank you, Mr. Chairman.\nI had two bills in there at the very bottom of page four in the top of page five.\nSenate Bill 255 deals with the investigative powers of the legislative branch, including the\npowered issues, subpoenas, and compel attendance of witnesses before committees were approved\nby either statute or by the rules of our bodies or the enabling resolution.\nOkay.\nNo, see any questions?\nYou have no them too?\nYes, the Senate Bill 256 is just a small cleanup bill on transparency.\nNotices required by electric membership corporations that have pledged more than 15% of their assets\nto acquire gas, marketing, subsidiary.\nOkay.\nWe'll see the way to involving them,\nso you can see the parties involved.\nOkay.\nThanks, sir.\nThank you very much.\nDid we get all the members of the committee requests?\nEverybody?\nOkay.\nWe got a little housekeeping we wanted to do here.\nWe want to recognize Chairman Jasper's motion.\nYes sir, thank you, Mr. Chairman.\nI'd like to ask the microphone to recommit\nSenate resolution 231 back to transportation.\nOkay, we had a motion, we have second, any opposition?\nOkay, so it's back in transportation.\nOkay, let's set a calendar for today.\nVermont's modified structured Senate bill 44.\nSecond.\nHave a move in a second.\nIs there any opposition?\nit's on Senate bill 147 moved and\nseconded is any opposition it's\non Senate bill 180 moved and\nseconded any opposition it's on\nSenate bill 245 moved and seconded\nany opposition it's on okay that'll\nto give us something to work on today.\nY'all all have a good day.\nThank you.\nWe're adjourned.\nYou\n",
  "updated_at": "2026-02-12T17:34:06.245583+00:00"
}