{
  "video_id": "mGbZBIvsN6I",
  "url": "https://www.youtube.com/watch?v=mGbZBIvsN6I",
  "title": "Cell Phone Bans, School Funding, and What’s Next for Georgia Classrooms",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Overview:\n- The Georgia legislature discussed bills related to cell phone bans in schools and changes to the education funding formula.\n\nKey Actions:\n- **SB 381**: Directs education funding through the Quality Basic Education (QBE) formula to provide additional support for students living in poverty, in foster care, or in unstable housing.\n\nBills Introduced (First Reading):\n- HB 109: Extends the cell phone ban from grades K-8 to grades 9-12, with some exceptions for off-campus activities.\n\nNotable Moments:\n- Discussions between Republican Representative Scott Hilton and Democratic Senator Rashon Kemp on the positive impacts of the K-8 cell phone ban and the need to expand it to high schools.\n- Mentions of potential pushback from some parents on school safety concerns, which were addressed by consulting the safety community.\n- Debate on allowing school-issued devices for educational purposes versus banning personal cell phones.\n\nVotes:\n- No recorded votes mentioned in the transcript.\n\nAttendance:\n- No specific quorum notes provided.\n\nAdjournment:\n- The transcript does not indicate when the session adjourned or when the next session will be.",
  "transcript": "We're going to talk about education issues. Today's teenagers don't remember life without cell phones,\nonce they get to high school, most have them, and in some cases, they've had teachers even\nencouraging them for assignments. On July 1st, last year, a Georgia law took effect to ban\nthem for children in eighth grade or younger. The author of that bill joins us. Republican\nrepresentative Scott Hilton of Peachtree Corners. He chairs the House Committee on information\nand audits, he serves as Secretary of the House Education Committee.\nAlso here is Democratic Senator Rashon Kemp of Atlanta, who works in education.\nHe is on the Senate Education and Youth Committee, along with government oversight and urban\naffairs.\nWelcome to you both.\nI appreciate this.\nLet's start with some numbers.\nIt's been six months, as I said, since state law went into effect to ban students in kindergarten\nthrough eighth grade from using cell phones.\nA recent survey conducted by the Professional Association of Georgia Educators or Page\nwith Georgia Southern University found that nearly 72% of educators believe the distraction-free\neducation act will improve student learning. About 71% of teachers indicate a similar ban on\npersonal electronic devices are needed in 9 through 12th grades and that number climbs to 83%\namong high school teachers.\nSo apparently they really want this German Hilton.\nYou sponsored Bell to Bell for the younger students.\nWhat has led you to keep this going?\nWhat kind of response have you received so far?\nWell, you highlighted the data,\nbut the response from parents, teachers, administrators\nhas just been overwhelming.\nAnd frankly, life changing for a lot of students\nwho are now realizing, man, I can learn in a cell phone\nfree environment, we are seeing grades improve,\nfights in the class go down and students socializing and you know really a lot of improvements to mental health\nSo just all around a tremendous impact K through 8 and it's just the next logical step is to expand that to high school\n33 states plus the district of Columbia have done a cell phone free\nlegislation bipartisan\nCollection of states George is the only one that did K through 8. I'm proud of us for doing that\nI think we put our toe in the water and help get folks and parents used to it\nand now I think the next logical step is to include high school.\nSo a phase in worked, you think?\nI think so. Your thoughts?\nWell, look, I'm a former high school teacher and principal\nand I can tell you, my teacher is what pole that same amount.\nYou know, I think it is critically important\nthat we extend this up to high school.\nHaving been in a high school environment,\nwe know a lot of what Scott referred to,\nyou know, the fights and the bullying\nand just the distractions are, you know,\nthey don't stop at eighth grade\nand so it's important for us to bring that up\nto the high school level.\nOkay, so it's HB-109-109.\n109, tell us exactly, would it be exactly the same?\nIt's similar to the K-8 with a few exceptions.\nWe wanted to carve out, high school is different.\nWe recognize that.\nAnd so there's a lot of different off-campus activities\nthat students participate in, dual enrollment, jobs.\nWe want to make sure kids have the flexibility,\nparents have access to them for those type of activities.\nbut the science tells us that a bell to bell works best.\nThe reason being is we want teachers\nto get out of being the cell phone police,\nallow them to teach and students to learn.\nSo it'll look similar to K-8 with a few exceptions,\nand we want the community, we want teachers, parents,\nplease reach out to us through this legislative process\nso we can perfect this and get it right the first time.\nWhere are you in the hearing process?\nYeah, we expect to get a hearing in the next couple weeks.\nAgain, would encourage folks to reach out to their lawmaker,\nLet us hear your feedback.\nWe'd love to know that.\nWe want you to be a part of this process with us.\nOkay.\nYou have another education bill, SB 381.\nAnd that would direct education funding through the QBE,\nthe quality basic education formula,\nto help students living in poverty,\nstudents in foster care,\nstudents who are in unstable housing.\nSo tell us a little bit about that.\nYeah, you know, Georgia's one of only six states\nthat does not account for poverty\nwhen we're funding students in our funding formula.\nSo it's time that we update.\nIt hasn't been updated since I was five years old.\nIt's time that we update our QBE formula\nand account for the things that are impacting students\nin education now.\nAnd I truly believe that when we better invest\nin students in our poverty from Atlanta,\nall the way down to Valdosta,\nwe're going to see improvements in educational outcomes.\nWe are in the state in which 30% of our kids\nare reading on grade level or not reading on grade level,\nmeaning 70% or not.\nSo we have to do more to invest in public education\nand I think addressing poverty is the way to go.\nSo how would this work?\nSo what this would do was give additional 25%\nof what we currently do with QBE to school districts\nthat have high students and amount of students in poverty.\nAnd it also directs them how to spend the money\nto make sure we're investing it properly.\nWe can't just pour money\nwithout some oversight and expectation\nthat we're investing properly in educating our students.\nOkay, and so any where where's that bill right now same with representative Hilton's bill\nWe need a hearing so people reach out to your folks in the Senate and tell them to hear send a bill 381\nYeah, you're you're feeling really good about things with this\nYou did get pushback last year though didn't you we did some parents were concerned about school safety as a dad of three kids\nI share that same concern. We talked to the safety community who all said this was the best decision\nIn case an emergency, you want kids focused on getting to the right place.\nBut yeah, we feel good. I appreciate the speaker lending his support.\nAnd just all the things we're doing around education to promote\nliteracy and really help our kids advance in Georgia.\nIt's a great day. We're moving the right direction.\nAnd each school district has done this differently.\nTalk about the different ways they have\nstopped having the kids, you know, some are putting them in packages\npackages or you know yeah we believe every school district knows best and so\nthey ought to be able to design a program that works best for them what's\nneat about the K through 8 bill is a lot of high school said proactively let's\ngo ahead and do a cell phone three classrooms on our own and so a good\nmajority of systems have already implemented this without even needing a\nlot because they see the benefits first hand I'm curious I mentioned the fact\nthat I remember doing stories about how teachers were using the cell phones to help kids\nlearn.\nSo that takes that all out altogether, right?\nIt does.\nYeah, what we found is, you know, when you do that, you know, the kids immediately.\nYou know what's going to happen.\nThey do the school activity and then they're back on social media and so we definitely want\nto allow for school devices, think Chromebooks and tablets and things like that.\nBut for your personal device, I know from it, it's just so tempting to, you know, start\nsurfing the internet and things and we, that's a distraction from learning.\nOkay, and the teachers still have them too.\nThey're still allowed to have them.\nI want to get to another bill that you're looking at.\nYou plan to drop a voucher accountability bill.\nWhat is that?\nYeah, you know, all public schools,\nthey are expected to have students perform at grade level\nor they face repercussions the same with charter schools.\nAnd you know, I believe that if we're going to give\npublic dollars to private schools,\nthe same expectation should be placed up on them.\nAnd so this bill would require them to show some academic\nsuccess with their students or face a lose in the ability to have students come in with\na promise scholarship.\nSo accountability in what way?\nSo just tracking the data or?\nAcademics.\nSo, you know, all of the schools that take advantage of this program, they have to give\na norm reference test.\nAnd so now we're saying let's take that a step further and say that students should\nbe performing at grade level on those tests.\nIf they're not, then you, given some opportunities over four years to improve, if not, then you\nyou could face losing opportunity to bring students in\non the promise scholarship.\nOh, interesting.\nOK, I wondered, I know you're on education in the house.\nTalk about anything else that we may see come up.\nYou know, I've got a really important bill\nthat I'm working on, especially for our community,\nin regards to what's called this red shirting.\nYou know, a lot of families, especially those\nwith summer birthdays, want to hold their child back,\njust to give them more time to develop, mature,\nand enter school at the right age.\nAnd so state law is kind of silent on this issue right now.\nSo I introduce legislation that says to empower parents\nin that decision making process to say you can decide\nwhen you first enroll your child into school.\nAnd so that helps parents give them the certainty\nand be able to plan that process for their child.\nSo it's not using the age, it's not saying six\nor what is it, six right now, right?\nYeah, right now Georgia has to offer public education at age six.\nsome parents, especially of boys in the summer\nare enrolling their child at six in kindergarten,\nwhich some of the science tells us\nthat that's best for that child.\nSo I believe that the parent knows best\nwhat path that child ought to take.\nAnd so, again, this legislation will empower them\nin that decision-making process.\nAnd I would think you like that too.\nYeah.\nI'd love to learn more about it.\nAll right, Ben, I love that.\nWell, thank you both for coming on the show\nand it's always good to have people\ntalking about education.\nWhere does the biggest portion of our budget?\nEducation, so thanks so much for coming on.\n",
  "updated_at": "2026-02-12T10:53:56.257233+00:00"
}