{
  "video_id": "mGJfPi-p6vs",
  "url": "https://www.youtube.com/watch?v=mGJfPi-p6vs",
  "title": "Rules Meeting for Day 34 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 34,
  "video_date": null,
  "duration_minutes": 32,
  "summary": "Here is a summary of the Georgia Rules Meeting for Day 34 of the 2025 Session:\n\n**Overview**: The meeting covered a variety of bills, including legislation on deregulation, veterinary education, and academic integrity. Notable discussion centered around the impact and implementation of the proposed deregulation efforts.\n\n**Key Actions**:\n- **SB 208**: Lieutenant Governor's \"red tape rollback\" bill - Referred back to Ways and Means committee for changes\n- **SB 140**: Allows optometrists to dispense certain medications\n\n**Bills Introduced (First Reading)**:\n- SB 20: Provides loan program for veterinary students\n- SB 213: Bans commercial cheating services\n\n**Notable Moments**:\n- Discussion on balancing deregulation with necessary oversight, particularly for agencies like the Department of Banking and Finance\n- Concerns raised about agencies' capacity to handle increased review requirements under the deregulation bill\n\n**Votes**: No recorded votes\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Meeting adjourned, next session scheduled for the following week.",
  "transcript": "Good morning. Good morning. Good morning everybody. Come on in and take seat and we'll call\nour meeting to order. Chairman Martin, will you open us with the order prayer please?\nThank you for the stay you've given us today, and thank you for the peace that we feel\nwhen we wake up in the morning.\nThank you for just allowing us to breathe and be thankful for that.\nAnd so many people around the world are having problems and tribulations.\nI feel like our days are filled with these days.\nthat we seek to be unhappy for it really should just grasp on to you and be happy\nand we work up in the matter and we appreciate it and have the opportunity to keep this going.\nFor our state, our country, our watch over us and keep our minds for your life.\nThank you, Ms. Chairman.\nOkay, happy Friday, everybody.\nLet's go ahead and get started.\nSo come on up.\nI've been up there we go trying to get you there we go now.\nTurned on good morning, Mr. Chairman.\nWe've got two bills on the blue sheet here.\nFirst one is Senate bill 28, kind of top third of the second page.\nThis is Lieutenant Governor's red tape rollback bill.\nI actually just got off the phone with Chairman Blackman.\nHe's going to move this bill back to ways and means\nand make a change for Department of Revenue.\nSo I'll be back hopefully next week.\nand I can talk more about this at that time.\nSecond bill I have is Senate bill 140.\nAnd right in the middle of the third sheet,\nthis allows doctors of automatry\nto stock, dispense, and sell medicines\nthat they can prescribe that affect the eye\nor the area around the eye.\nOkay, see your question.\nWho at part?\nYes, sir.\nThank you, Mr. Chairman.\nSenator, with respect to SB 208,\nHow does this not increase bureaucracy\nand put more burden on government agencies\nto engage in this rule-making process\non a regular basis?\nThank you, Whit, for that question.\nWe're ultimately incentivizing the deregulation\nin government, so over time,\nthere will hopefully be less rules to enforce within the agencies.\nAnd we just implement a spring cleaning process\nwith the agencies every four years\nand look at the rules and make sure\nthat they're best serving George.\nAnd so ultimately, the end of this process,\nWhat we think will happen is it will not only be less rules for agencies to enforce,\nbut those rules will be looked at with an eye towards ultimately deregulating the forces\nfrom government on Georgia business.\nSo you said this legislation is incentivizing that endeavor is there appropriations to support state employees\nwith this process in particular given how high the turnover rate of state employees currently are?\nAnd now we don't have any appropriation in this bill.\nOkay.\nThank you.\nThank you.\nOkay.\nOkay.\nWe have some.\nThank you, Mr. Chairman.\nSenator, when we talk about deregulating, I just can't help but think about the Department of\nBanking and Finance, which is, that's all there.\nThe entire role is to regulate our financial industries.\nHow do we deregulate the important job they're doing in that regard?\nAnd that would go on.\nI'll worry about it.\nThank you, Chair, for that question.\nDid you get to the end of it?\nYes, that's really my concern.\nI apologize.\nI've really not followed this legislation intently, but there's some things we don't need\nto deregulate.\nThere's five parts of the five core elements of the bill.\nThe first of which, create something called a small business impact analysis, which I would\nsay is a cousin to a fiscal note.\nallows members of the General Assembly to ask the state auditor to review bills as it relates\nto small businesses. Small businesses in the bill get changed from companies with 100 employees\nor less to 300 employees or less. And there's insensives, there's really a declaration in current\nGeorgia law for agencies to try to make those regulations as least burdensome as possible\nfor small businesses. The second thing that we do is we have an economic impact analysis\nIt looks at the larger rules that agencies may place,\nand we define those in the bill\nafter an adjustment in committee at bills\nthat would cost $3 million or more to adhere to,\nand we require those to be ratified by the General Assembly.\nBut specifically, I think to your question,\nwe have a four-year review period\nwhere the governor will ask agencies every four years\nto look through the rules that they have promulgated\nand ask a couple of key questions.\nOne, are they serving the purpose\nthat they were originally intended to serve?\nTwo, are they still necessary to serve that purpose?\nand three, are they the least burdensome way possible\nthat the intent of purpose can be complied with?\nSo ultimately, we're asking these agencies\nto do something that all of us do in our businesses\non a pretty regular basis.\nAnd that's some look at what we do\nand make sure that it's as efficient as possible.\nOkay.\nCrypto Evans, did you have a question?\nYes, Mr. Chairman.\nThank you, Mr. Chairman.\nSo the author, is there a fiscal note with this bill?\nThere's not a fiscal note representative.\nThis is not a bill that has a financial impact.\nIt's not levying in new tax, it's not changing in new tax.\nIt has agency directives in it that we think\ncan be accomplished with existing agency staffing.\nBut to really do an analysis on this,\nnot only would you need to look at potential costs,\nyou need to look at potential savings.\nAnd I'm profiting committee that I don't know how you would\nlook at the downstream savings both within the agencies\nand within the Georgia economy for ensuring\nthat we have the least regulations possible in the state.\nHave you looked at whether the agencies have enough staffing\nto do the analysis?\nThis is a pretty robust amount of analysis\nthat we're asking them to do.\nWas there any concerns raised\nor any discussion of potential concerns\nabout the ability of the agencies to handle this\nwithout additional either oversight\nor employees or contractors?\nThis is the second biennial represented\nthat we have brought this bill.\nSo there's been numerous conversations\nwith Lieutenant Governor's Office,\nnumerous conversations with myself in multiple agencies.\nAnd we have not had any agency raise or red flag\nand say we think this is impossible to comply with.\nAnd so we'll obviously go through the process.\nAnd if the process needs to be tweaked,\nwe'll be open to doing that.\nBut really all that we're asking is once every four years\nthat the agencies look through the rules.\nFrankly, I would be hopeful that agencies\nwill be looking through the rules more often than once\nevery four years.\nBut that once every four year cadence essentially\njust puts a spring cleaning process in place\nwhere we ask them to look at their causative rules,\nif you will, keep the ones that they need\nand get rid of the ones that they don't need.\nThank you.\nOkay, you don't see any more questions.\nThank you, Senator.\nYes, ma'am, Senator.\nThank you, Mr. Chair.\nI've got a few things to talk to y'all about today.\nI've already talked to you about Senate Bill five\non the front page regarding prior authorization\nand also Senate Bill eight,\nwhich is a department bill about the juvenile court judges.\nBut the new things I have to talk to you about\nare Senate Bill 20,\nwhich provides for a loan program for shelter vets\nto go up underneath the existing veterinary education board\nin the Department of Agriculture.\nAnd then the next one that I have is on the last page,\npage four, that's Senate Bill 213.\nAnd that is an anti-cheating bill as one of my committee chairman who has the bill for me mentioned.\nThis is about commercial cheating services that offer for money to take your licensing\nexam for you, take your online course for you, do your homework, write your essay, et cetera.\nThis would make that unlawful and it would be a civil penalty through the attorney general's office.\nAnd then there's one that's not on your sheet but came out of committee this morning if you want me to talk about that.\nMr. Chair.\nYes, ma'am.\nGo ahead, ma'am.\nSenate Bill 160.\nIt is about reckless stunt driving and it adds the opportunity for an intelligent speed\nlimiting device to be placed on the vehicle after the second conviction.\nThe committee amended it and added a section about DUI, the school fees and I'm not as familiar\nwith the amendment so I'd be happy to come and talk about that later.\nThank you.\nOkay.\nDon't see any questions.\nThank you, ma'am.\nYes, sir.\nThank you Mr. Chairman. I have Senate Bill 119. It is the exact same language that Chairman\nLeveritt had in the House Bill 377. Both bills passed out of both chambers unanimously.\nIt is just streamlining the process for someone to be able to convert a manufactured home\ninto real property.\nOkay. Thank you, sir. I don't see any questions. Thank you.\nSir, come on in.\nMorning, Mr. Chairman and ladies and gentlemen of the committee. The I'll ask for only a\nbottom of your first sheet. It's SB 12. It's one of those things that you don't think\nmuch, but a lot of people won't want to know what's going on in their government.\nAnd for that we have an open records request. One of the things that happened this\nLike summer early fall, the Supreme Court made a ruling on a contractor that was working\nfor Georgia Tech that said, okay, he has to comply with an open records request.\nI'll never tell you that the Supreme Court didn't do anything but follow what the law\nsays.\nIt was a little unclear.\nIt's always been assumed that open records request went to the government agency, which\nthe public funds were being expended in, not to contractors.\nSo in this case, what we're doing is clarifying in the law\nthat an open records request goes back to the,\nwhether it be local government or state agency\nor whatever the case may be, where the funds are spent.\nWe're not changing what can be requested.\nWe're not changing any of the timetables or anything,\njust basically making sure that when an open records request\nis made, it goes to the state agency or local government\nthat's expending public funds for that reason.\nAnd with that, you know, it's been kind of interesting\nprocess when it got to the Senate.\nThe First Amendment Foundation, I had the Georgia Press\nAssociation.\nThey had some tweaks there, really requested.\nWe made those tweaks.\nThey're neutral in the bill.\nI've got great response and great support\nfrom the Georgia Chamber of Commerce, the Metro Atlanta Chamber,\nACCG and GMA.\nI've been very helpful and very supportive in the process.\nIt's one of those things that I know\nwhen I originally started with the bill,\nGovernor Kim, and I spoke, and I said,\nhey, when I chaired economic development a long time ago,\nsaid, we became the number one state\nin the nation to do business.\nI want to continue that.\nMy experience and local government kind of\nwas what brought me in to bringing this bill to y'all today.\nAnd I'll ask for your favorable consideration.\nOkay, as soon as you can.\nThank you, I don't see any questions.\nYes, sir.\nGood morning, Mr. Chairman, and the Minimums of the Committee.\nIf you will, on page three, fifth one down, SB 121,\nhas to do with requiring increased limits for someone\nwho has had a DUI.\nCurrently, there's no increasing limits if you've had a DUI.\nOur minimum limits in Georgia are 25, 25,\nand that has not been increased in 14 years.\nwhat this bill does is on first offense,\nthey have to increase their limits to 50, 150.\nA second offense is 300, 300, 100.\nFlorida in 2007 increased theirs on first offense\nto 100, 350.\nI think when we look at what's going on today,\nwe've got to ask ourselves this 25,000\nreplace any car that any of us drives.\nAnd for someone who has been convicted of a DUI,\nI think there's a requirement\nthat they need to increase their limits\non that standpoint, so that's what that bill is about.\nThanks, Senator Harvard.\nNo seeing questions.\nOK.\nThanks, sir.\nSecond bill is on page two.\nMidway is SB 46.\nAnd that is government serves the people.\nThis bill is a service bill.\nAnd I don't know about y'all, but all of us\nget calls from constituents on service issues.\nThis bill sets up GTA as the quarterback\nto look at all government agencies on a service issue\nand to create what I call a best practices issue.\nI'll give you, for instance, I had a call\nthey pulled yesterday where they call the agency three times\nbefore they got a live person.\nWhen they did get a live person,\nthe call was transferred to a number that was not connected.\nWhat this would do is allow GTA to set the parameters for us\nand just like you deal with Delta Airlines,\nthey, at the end of the call,\nyou have a rating capability.\nThe other thing we think it should be done\nis how long you have to wait on hold,\nis there other things that GTA can do?\nMany of your larger agencies are good at what they do.\nThey do a excellent job,\nbut some of the smaller agencies don't have the resources\nthat they do, and what we see is GTA could take this\nand feed this down to where we deserve the people.\nThat's what this is really about.\nIt's their money and their services.\nThere is a physical note on it you'll find attached to it.\nI think establishing best practices for every agency\nof what they expect.\nIn a business, you have a bottom line, you have profit.\nIn a government, you don't have really what is,\nwhat is the bottom line, but it is where we can deal\nwith good service.\nAnd I think that's what this is really about\nis serving the people.\nOkay, you have a question for you, Chair and Martin.\nBriefly Senator, and I'm on board with what you're\ntrying to do here in my question.\nIf I recall GTA's mission when it was originally founded,\nI don't know that it's changed,\nwas to facilitate purchases in the technology area.\nThat their mission and their edict, if you will,\nwasn't to do this.\nDoes this bill change their operating authority?\nIt gives them authority over the other issues\nthat are on the other agencies that are there\nto really monitor service, and this is a service issue.\nThey can help them with technology.\nThat's still within their purview.\nBut this is to try to deal with the issue of service\ndown line and to share resources.\nThat's the other part.\nThat was my question.\nOriginally GTAs, it was to help purchase technology.\nThen they got in the business of delivering technology\neven though that never changed the statute.\nDoes this change their mission?\nDoes not change that.\nSo we're driving them further out of their original schedule.\nThat's my point.\nI like what you're trying to do.\nI just worry about driving them further out of their original meeting.\nWhat we've looked at is this, in the ways they would have a person who would be the lead\nfor this, NGTA.\nWe do not want to add any more expense, but then we want to look at what we can do from\nan automation standpoint.\nWhat can we track?\nWhat can we do?\nAnd also within this, they are required annually to submit a report across the board for\nall the agencies that were monitoring to the legislature and to the governor.\nAnd that's the part that's missing today, is we need to see what our service looked\nlike, whether it's Delta Airlines, Home Depot, or Chick-fil-A.\nThey're looking for service that helps them be more profitable.\nAnd I think for government, since we have no bottom line to really hear what's going\non, a service metrics for creative best practices is really what we need to do to serve the people\nof Georgia.\nOkay, we've got a couple more questions, but you're going to get me in trouble with the\nspeaker. If we don't get out of here at 9.30, so if you would, let's be as concise with\nour questions and our answers as we can. Chair, Leader Heagley, you had a question.\nThank you, Mr. Chairman, to the author of the bill. Can you elaborate on why you all didn't\nsee fit to allow the GTA, the additional time that they were asking for for implementation?\nYou're talking about it in the committee meeting correct. Let me say this to you\nI've met with them multiple times and the first thing I heard was the day that you heard it in committee\nAnd I'll be honest with you I have a meeting with them this afternoon and that really bothered me is that if you've got\nSomething with me come to me and we have been working with their people laying this out\nAnd that was the first time we heard it was the day that you heard that in committee and that's a question\nI'm going to have with them this afternoon so that I said if you've got a problem let\nme know we're providing finance for the person that would be there we're trying to make\nthis as least expensive as possible but no one's looking really at the service issues and\nI'm sure you like me have had constituents calling being able to get licenses being\nable to get to someone alive we have 80,000 state employees we don't even know how many\nworking from home or working here we have no idea and that's one of the things\nthat I would like to see GTA start I think this is a foundation start is what\nit is and it needs to be improved futuristically but it's a start. I appreciate\nthat answer but the concern is if we're concerned about efficiency I think we\nshould, and hopefully after your conversation with them today, if it is determined that\nthey need more time to implement this effectively, I hope you'll be coming back to us with\nthat.\nI would, where it right now goes to 2026, 2027's fine, but I think we need to get something\nimplemented, and it's like this, my wife, and raising kids always said this, what gets\ninspector gets done and that right now I think we need a little bit of inspection to be done.\nJim Powell has a question. I thank the offer. I think that this is something that's needed.\nIt may be a little bit broad as you got into explaining a lot of things but we've got some state\nagencies that as a representative we do a lot of constituent requests and we've got a certain state\nagency that it's just absolutely miserable with the amount of calls that we get\nbecause they go, the doors are locked to their offices and they're told to call\na number. They call that number and it may or may not get through. Once they\nget through the first thing is we're gonna play CHONHO. Well they sit there for a\nperiod of time and then the phone goes dead. Is this the intent to get into the\nweeds on this? Yes, we want to see who is not serving the people. One of\nthose things I had with GTA I said we need to do after hours because people are at work\ndon't need to quit their jobs or stop out of their jobs. We could go to seven o'clock\nor whatever it is but we need to serve the people that are intent and that's the small\ngo thank you for this. Okay thank you sir. Okay thank you sir no other questions.\nThank you. Appreciate it. Thank you very much.\nMr. Chairman, committee of four bills, Senate Bill 17, Ricky and\nAlyssa's Law School Security Bill, we presented last couple days, Senate Bill 56.\nGeorgia's state identification fund, this bill basically is funding public safety and\nlaw enforcement officers that passed away during COVID-19.\nThis bill has been funded through the FY25 budget that's already passed.\nSenate Bill 105 is a veterinarian bill that protects Georgia veterinarians related to telehealth and\nother pieces related to their patient, client, relationship, and Senate Bill 110 is a free\nrange bill.\nOkay.\nGood job.\nNo questions.\nThanks, sir.\nSenator, come over up.\nThank you, Mr. Chairman.\nCommittee members.\nBottom of page one, second up is Senate Bill nine.\nThat's great work by Chairman Brad Thomas here in the House, helping to assist with artificial\nintelligence deepfakes.\nYou've passed that before.\nAnd then on the second page toward the middle is Senate Bill 58 that's transporting a wife saving organs to help save lives in time of meat\nOkay, don't see any questions. Thanks senator\nThank mr. Chairman members of the committee page two\nSix one down Senate bill 44 presented to yesterday help school systems lower taxes\nLast page, four, third one down, Senate Bill 199 is a new request.\nThis is the ethics bill brought to me by the Commission.\nIt helps consolidate our campaign, committee disclosure reports and\nour financial disclosure reports and does a few other things just around ethics.\nI think that's any question.\nNo, see any questions.\nThank you, Mr. Chairman.\nI remember the committee.\nSenator, come on out.\nThank you, Mr. Chairman. I've got Senate Bill 130. It's on page three, the seventh bill down.\nIt's an agency\nlegislation for the Georgia Board of Healthcare Workforce, the purposes to increase the number of\nhealthcare providers in our state. And it does it two ways. Number one,\nit makes more institutions eligible for residency and fellowship programs.\nand number two, it makes final year residents\nand bella's eligible for the board's service\ncancelable loan program.\nThere's no fiscal note because this does not anticipate\nany additional money.\nIt's just widened the scope of the programs.\nThank you, Senator Howard.\nDon't see any questions for you.\nThank you, sir.\nThank you, Mr. Chairman.\nThank you, colleagues.\nSit down, Senator.\nThank you, Mr. Chairman.\nSenate Bill 162, I've already talked about that's the licensing and credentialing bill\nwith the composite medical board that will get our physicians, PAs and nurse practitioner\nprotocol agreements months earlier getting out, getting people working.\nSenate Bill 195 on the back page, second from the top.\nThis has been worked out with the composite medical board, the Department of Public Health,\nMagical Association, Georgia and the pharmacists.\nWe have the third highest new infection rate of HIV in the Atlanta metro area.\nThis will allow our pharmacists to dispense pre-exposure and post-exposure medicine.\nThe, besides the quality of life issue, the economics are that one of these generic doses\nthat would be taken every other month is about $23.\nThe cost of treating HIV once they get it, this prevents them from getting it is about\n$60,000 annually.\nThank you, sir.\nI'm going to see you questions.\nYes, sir, Senator.\nThank you, Mr. Chairman, my fellow legislators, colleagues, friends, and y'all.\nI'm Senator Rat.\nEverybody calls me Doc, and I'm here this morning to wish y'all a good morning and ask you\nto look at page three, Senate Bill 147.\nBasically, all it does is its legislation that will allow the Georgia Department of\ncorrection to give inmates being released,\ndocuments relevant to finding work after release.\nAnd since it's getting close to 9.30,\nI'm going to get out of here unless there's any questions.\nThank you, sir.\nI don't see any questions for you.\nThank you.\nMr. Chairman, come on up there and tell us\nwhat you got on with your mind.\nThank you, Mr. Chairman.\nPage two, about three quarters of what,\nway down the page, SB 72.\nI hope for Georgia Patients Act.\njust provides opportunity for doctors and hospitals to provide non-FDA-approved treatments\nand medicines, SB193 on page four, I covered yesterday. It's just a high school diploma\nfor ages 21 to 40, then SB 233 is expanding the behavioral health, perform an innovation\ncommission, giving the governor of the speaker and the lieutenant governor to extra appointees\nfor that commission, and then SB 259 is a second chance law when a child is suspected of\nchild abuse. It gives the family the right to a second opinion. That was probably the most\nimportant bill I've done in years. Thank you Senator. No questions. Thank you sir.\nMr. Robertson. Morning Mr. Chairman. Thank you so much. Bottom of page two, SB 99.\nIt's a bill that clearly defines the definition of law enforcement officer in Georgia to attempt to\nhelp our partners with the federal government when they are part of a\nmultidirectional task force or if they have to react or respond to a\nforceful felony in their presence and then SB 100 is the equal rights for adopt\nthese bill. Mr. Chairman, thank you. Okay, don't, don't see any questions. Thank you, sir.\nYes, sir, Senator. More Mr. Chairman, I've got two bills on your sheet today.\npage three, the third one down SB 112 has to do, it's good consumer protection bill, has\nto do with HVAC manufacturer warranties. Currently you have to register that device or that\nsystem once you purchase it to activate that warranty. This would take that step out. So\nwhen the license professional installs it, that's your property that warranty would take\nplace then. No need for the activation portion of it because the manufacturer already has\ninformation because you purchase that directly from them. So it takes that out and it also makes the\nmanufacturer the warranty transferable so the house is sold one time or ten times it follows\nthe property. Thank you, Mr. Chairman. Okay, I don't see any questions. Okay, and then the second one's\non page three, second from the bottom, HB 180. That has to do with high demand apprenticeship programs.\nAnd simply there's one change to it currently. And these are for high demand fields under TSAG.\nAnd currently what you have to do is you have to get a company sponsor for that\nTo be eligible to get in the program companies can only have ten at a time apprentices\nThis would allow the the program school to be a sponsor as well\nAnd they've got a list of companies that are looking for apprentices. So just it expanded that program. We have to answer any questions\nThank you, sir. Don't see any questions. Thank you\nThank you.\nSenator Hatchie.\nThank you, Mr. Chairman.\nThe first bill is on page two.\nThis is the first lady's human trafficking bill,\nwhich updates our code to make sure that people who are guilty\nof sex trafficking minors are held to the fullest extent\nof the law.\nThe second bill is on page number.\nWhat number is that one?\nI'm sorry, Mr. Chairman.\nIt's a Senate bill 42, yes, sir.\nThe second bill is Senate bill 154 presented this yesterday.\nThis is the bill that deals with the closure of the U.S. Department of Education, and yesterday\nPresident Trump did sign an executive order, so I think this would be timely.\nAnd the last is Senate Bill 141, that's on page four.\nThis is a department bill for the Department of Revenue that just updates our code to make\nour state more friendly for the taxpayer.\nOkay.\nThank you Senator.\nYou don't see any questions for me.\nThank you very much, Mr. Chair.\nSenator Strictly.\nMr. Chairman, members of the committee, I have on the last page, about halfway down Senate\nbill 207. This is our bill. This is our 30-year work on this together. This creates\nsustainability process for how our occupational license boards deal with criminal records.\nAnd this is our chance to help lift folks out of the criminal justice system by helping\nthem get a job. Happy to answer any questions.\nOkay, I don't see any questions. Thank you, sir.\nThank you, Mr. Chair and members of the committee bring before you to the Senate Bill 51, middle of the second page.\nThis relates to the qualification-based selection of architects and engineers.\nIt takes the same process that we use the state, university and federal level, and applies to the city and county governments.\nOkay, don't see any questions.\nThank you, sir.\nOkay, do any members of the committee have requests for anything?\nNo request, okay.\nBefore we set a counter, I'm going to recognize Vice Chairman Lebritt for an announcement and recognition.\nLadies and gentlemen, it's pending the processing of the chairman's PTSD application after the hearings we've had in the criminal lawsuit form, but we do plan to have another meeting next week on Tuesday afternoon, once we know when we're going to be going into session on Tuesday,\nI was trying to set the time and get a notice out but we also have Senate Bill 69 to deal\nwith on that subcommittee so we will be holding here in on Tuesday to deal with that or\nto begin looking at and hopefully take action on that bill.\nSo I just wanted to kind of get that word out to everybody again.\nWe'll have to notice with the exact time wait or day and also just want to utilize a quick\npoint of personal privilege.\nIf you would help me welcome some dear friends of mine, Mo'Kallahan and John Champaign are\nin the back if they will stand briefly.\nThey're dear friends of ours,\nand we'll all start.\nWelcome, everyone.\nApplause.\nJust welcome them to the house,\nand I'm so proud to have them with me here today.\nThank you, Mr. Chairman.\nThank you, and thank you to our visitors,\nalso for a 10 years day.\nOkay, let's set a calendar for today.\nFriday, this is day 34.\nSenate Bill 13.\nMan.\nmove in second is there any opposition it's on senate bill 58 moved and\nseconded any opposition it's on senate bill 84 moved and seconded any\nopposition it's on Senate bill 96 moved and seconded any opposition it's on\nSenate bill 98 moved and seconded any opposition it's on Senate bill 154 moved\nand seconded any opposition it's on okay that's our calendar for today Friday now\nlet's go ahead and set a calendar for our next legislative day which will be\nTuesday and I suspect starting next week we're probably gonna be in longer than\nWe have been but we're going to go ahead and set a calendar today and then we can add to that as we need to and move along\nOkay for Tuesday house resolution 273\nHave move and second any opposition? It's on\nSenate bill 42\nMove and seconded any opposition? It's on\nSenate Bill 110 moved in seconded, any opposition?\nGet some.\n",
  "updated_at": "2026-02-12T17:47:37.046724+00:00"
}