{
  "video_id": "Mh2K3lWIyOU",
  "url": "https://www.youtube.com/watch?v=Mh2K3lWIyOU",
  "title": "Governor Kemp Press Conference | 1/13/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 17,
  "summary": "Here is a structured summary of the Georgia Governor Kemp Press Conference from January 13, 2025:\n\n**Overview**:\nThe press conference focused on Governor Kemp's education and school safety initiatives, highlighting significant investments and legislative actions taken to support public schools, teachers, and student security in Georgia.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**: \nNone detected.\n\n**Notable Moments**:\n- Governor Kemp touted major investments in public education since 2019, including nearly $10,000 raises for teachers, restoring the HOPE Scholarship, and fully funding schools for 5 consecutive years.\n- Kemp announced an additional $10.3 million for local school districts to support pupil transportation.\n- Since taking office, Kemp stated that over $185 million in one-time school security grants (roughly $80,000 per school) have been provided.\n- Kemp proposed an additional $50 million in one-time school security grants for the current fiscal year, bringing the total to over $86,000 per school.\n- Lieutenant Governor Jones and Speaker Burns expressed strong bipartisan support for the school safety initiatives and a commitment to continue building on these efforts.\n\n**Votes**:\nNo votes mentioned.\n\n**Attendance**:\nThe press conference featured Governor Kemp, First Lady Marty Kemp, Lieutenant Governor Bert Jones, Speaker of the House John Burns, and various legislative leaders.\n\n**Adjournment**:\nThe press conference concluded, but no details provided on the next session date.",
  "transcript": "all right well what good afternoon everybody welcome back thank goodness it'll\nbe day 40 before we know it just want to wish everybody a happy new year want to\nthank Georgia DOT GM State Patrol our line crews first responders and\neverybody else they responded to the storm we appreciate them and certainly\nI appreciate the members of the General Assembly for supporting what they do every day out\nthere in this dangerous world.\nAlso honored to have the greatest First Lady in the country, Marty Kemp, with us and\nShaperoning and supervising her today is the First Lady of the House, Dale Burns.\nWe appreciate y'all being with us, appreciate Lieutenant Governor Burke Jones, Speaker of\nthe House, John Burns, and especially want to thank Budget Chairman Blake Tillery, Senator\nBlake Tillery, and Representative Matt Hatchett for being with us today.\nAnd certainly all these legislative leaders that are behind us.\nWe appreciate you all's partner so much.\nWe have together made incredible progress in our classrooms.\nSince 2019, we have raised public school teacher pay by nearly $10,000.\nWe have restored the promise of the hope scholarship.\nWe have provided $230 million to our higher education system to eliminate the special institution\nfee to help keep the college affordable for our scholars.\nWe've invested roughly $20 million to help our paraprofessionals take that next step in\nin their career to become a teacher,\nwe have increased the number of counselors in our schools.\nAnd with this year's budget,\nwe have fully funded our schools\nnow for five years in a row.\nAll told, we have committed an additional $3.7 billion\nin ongoing funding,\njust since I took office in K through 12 education.\nThat's more than any other governor\nin any other General Assembly in state history.\nAnd it ensures our students and teachers have the resources for a quality education.\nToday with the support of the people you see here, stand in shoulder to shoulder.\nI'm proud to say that this year we will build on those investments by fully funding our\nour classrooms and adding an additional $10.3 million\nfor local schools for pupil transportation.\nAs many school districts have experienced growth\nover the last several years,\nthis new funding will ensure they can transport students\nto school without having to cut into other parts\nof their budgets.\nI'm grateful to the leaders up here with me\nthat they have agreed to this infusion\nthat will directly affect our local communities.\nBut we also know that a quality education\nrequires a safe learning environment.\nThat's why we work together to strengthen campus security\nfor every school in the state.\nJust since I took office,\nwe have provided more than $185 million\nin one-time school security grants,\nwhich equal to roughly $80,000 per school.\nAnd after the conversations with school superintendents\nand leaders across the state,\nThis past session, we took a strong step\nto make these school security grants a permanent part\nof the budget.\nEvery year, each school will receive over $47,000\nto spend on security related infrastructure or staffing.\nAs all of us remember, the horrific tragedy last year\nput these investments to test.\nAnd had those supports for school security not been made,\nThat fateful day in October could have been even more tragic.\nWith that in mind, I'm proposing an additional $50 million\nin one-time school security grants,\nwhich will bring the total grant amount\nfor the current fiscal year to over $86,000 per school\nfor a total of $158 million statewide this year\nthat we will spend on school security.\nWe will also be looking into how we can best improve the student to school psychologist\nratio and provide funding for crisis counseling training further building on the progress\nwe've made in prior budgets on this issue.\nAll of these investments were planned with the goal of making our schools even safer,\nmental health support for our students, teachers, and faculty, and developing the best and brightest\nminds right here in Georgia. Again, I want to thank the men and women you see here with us for\ntheir support across multiple years now for these measures. As we have said before, I know we\ncan and will deliver on these measures for our students and hard work in Georgia families.\nWith that, I'll turn it over to one of our key partners, our Lieutenant Governor, Bert\nJohns.\nGood afternoon, thank you, Governor Camp, thank you so much, thank you, First Lady Kim\nfor being here today.\nIt's great to be here with the speaker of the House, speaker of John Burns.\nYou can't say much more than what the Governor just said.\nThe two years ago, we started talking about our school\nsystems being a very vulnerable place for our kids\nbeing educated and where we needed to beef up\nand security and things of that and invest more\nin our school systems.\nWe did that then and had it not been for the investments\nthat we had made, as the governor said.\nThe tragedy that did hit Appalachia a year ago\ncould have been much, much worse.\nAnd we're gonna continue, this is gonna be an ongoing effort.\nWe're all three chambers, the executive branch,\nas long as the House and the Senate\nare always gonna continue to work on building on\nwhat the governor has put forth here in the last year\nand what we're going to, you know,\ncertify in both the House and the Senate this upcoming year.\nI wanna talk about another measure\nthat we're gonna be pushing in the Senate.\nWe did it last year with a list of laws that is a mandate\non school door securities measures\nthat we passed out of the Senate last year.\nThat it came up short last year in the House,\nbut I do feel like that after having a year of educating\nour friends over in the House as well as the speaker\non that measure that it will be successful\nthis upcoming year.\nSo I don't want to take any more of the speakers time here,\nbut I will just say that I want to thank Governor Kim\nand his leadership as well as Speaker Burns\nand the working coalition that we've had as a group\nand trying to make sure that our kids are safe\nand our kids have a very secure place to go to school\nand live and learn every day.\nSo thank you, Governor Kim, again.\nThank you, members of the House and Senate\nand Speaker Burns.\nThank you.\nThank you.\nThank you.\nThank you.\nGovernor Jones, you're right.\nI do need some time because our chaplain of the day this morning, the house said he had\nabout a two-hour message, but he thought he could get it done in 45 minutes and he stayed\non that plan.\nSo it is, I don't have quite that much, but you'll know what I know.\nIt's always a great day to be a Georgian and the day is as well.\nYou know, it's also great to be back here\nunder this bright and shiny golden governor.\nThanks for sharing that goal with us\nand making sure it's beautiful again.\nThis 2025 legislative session is with Governor Camp,\nLieutenant Governor Jones,\nand all of our members in the House and Senate,\nwe're ready to go.\nWe're ready to get to the people's work.\nThat's where we are and we've been,\nwe've talked a lot about it\nand now we're ready to get to work.\nWe talk a lot about in the House about education,\nwhere this increasing pre-K funding, early literacy,\ninitiatives, teacher pay raises, or school safety.\nAnd we're proud of the work we've done\nto create incredible educational opportunities\nfor Georgia students.\nWe're certainly going to continue building\non our successes, as the governor said.\nBut this year, following those devastating tragedies,\nwe witnessed at Appalachia High School,\nI made it clear to the House that we would leave\nno stone unturned when it comes\nensuring that our students can learn in a safe and secure environment.\nFirst, I am proud to fully support Governor Camp working with Lieutenant\nGovernor to provide an additional $50 million in the amended fiscal year 2025\nbudget for one-time school safety grants. This funding combined with our\nprior investments in school safety will make a significant improvement and\nand significant investment in every public school in our state\nfor school safety upgrades, improvements, infrastructure,\nand personnel.\nWhere the school needs additional security cameras,\nbuildings, safety infrastructure, or alert systems,\nor resource offices, these grants will provide the flexibility\nand discretion needed to fit the unique needs of every school\nand every corner of our state.\nNext, the House is going to continue discussion\naround school safety cameras.\nAnd put forth measures to require any revenue generated\nfrom school zone cameras and fractions\nto be designated for school safety.\nThe intended purpose of these cameras\nis to keep our students safe as they travel to and from school\neach day.\nAnd it just makes good common sense\nthat the revenue generated from their uses\nto just that, keep our children, teachers, and schools safe.\nNext, we'll take steps to address our students\naccess to mental health care.\nWe know that mental health care continues\nto be a growing concern among our young people.\nThat's why I'm proud to join with Governor Kim\nin increasing funding to improve our student-to-school\npsychologist's ratio.\nThere's no question, y'all,\nthat the pressures of adolescents are becoming increasingly difficult for our children.\nAnd ensuring that they have access to mental health resources and care is critical to their\nsafety and well-being.\nFinally, we know there was a significant breakdown in communication between school districts,\nlaw enforcement, agencies, and other agencies leading up to the tragedy at Appalachia High School.\nThe House will take action to require our schools,\nparticipation in a statewide information sharing\nand gathering network assessment model.\nThis model will aim to provide school officials\nand law enforcement agencies with the information\nthey need to keep our schools, our students safe\nwhile maintaining the highest possible\nof privacy standards for students and families.\nOur children are our future.\nThey are the future of our state, and our educational system is the foundation of their success.\nThe House looks forward to working alongside my friend Lieutenant Governor Jones, our colleagues\nin the Senate, and Governor Kemp to ensure the success of K-12 education here in the\ngreat state of Georgia.\nThank you, Governor Kemp.\nWell, thank you, Speaker Burns, Lieutenant Governor Jones.\nWith that, we'll open it up for questions, and I know both of these guys moved way off\nto the side, but they're willing to answer your questions as am I.\nWell, I will just commend the members of the General Assembly when we did this first.\nI mean, I campaigned on this issue in 2018 with complete local control.\nWe did grants.\nI believe it was in my first big budget.\nAnd the General Assembly went along with that when we did the second round.\nWe changed up who was, you know, kind of how the money would be distributed.\nknow, it was still going to the local school systems. They had complete local control because\nlook, they know their schools and their campuses better than we do. I, you know, for myself,\nI don't want to speak for the legislators here, but you know, I think the local school boards,\nthe superintendents working with their local law enforcement, they know what their individual\ncampuses need. What I have heard is that we still have a few systems out there that\nmaybe haven't been able to put a certain kind of security system that would help their\ncampus others had been using the money for personnel so in talking with the\nlegislative leadership we kind of felt like let's do one more round of one\ntime funding so there will be no excuse for any system in the state to have you\nknow what they need and then you still got the continuation funding that\nthese legislators and and or the folks that were here last year put in the\ncontinuation budget of the funding formula so that's gonna keep going next\nyear in the year after that. But this will help people that haven't been able to do something\nwith one-time money, hopefully be able to finish that out. And we'll see what they want to do.\nI mean, you're going to have some systems that, you know, want to put additional hardware.\nAs somebody mentioned earlier, you'll have some of them that want to go with, you know,\na campus-wide security, maybe more cameras, you know, communications and every classroom,\nwhatever it is. I mean, we're, we just want the money to go and support those kind of things.\nand then certainly the legislature will be digging into that as we go through the budget process\nto and working with the local systems. I will say that the system we have in place everybody\nearly on had to have a security plan for their district before they could get the money to make\nsure we knew what they were going to spend that money on. We weren't dictating what they should\nspend it on. We just want to know they had a detailed plan to do that so they're getting a good\nmind for for the buck and the tax payer can rest assured that this is going to\nkeep our kids and our teachers and our school system staff safe well I would\nI'll just say this from the Apex program,\nyou know, also campaigned on that,\nfunded that, my first budget, that money still in there.\nThe problem is finding these professionals is very, very hard.\nThat's something our state's been working on\njust to continue to find more of these counselors\nand other people in our classrooms.\nSo I'm open to all of the above.\nI mean, look, if you think about what we've done\non mental health in this state,\nthe General Assembly last year\nand the budgets we propose, we're spending more money now\non mental health than we ever have in the history,\nin the history of our state,\nand we'll continue to do that.\nI would rest assured with the budgets\nthat I'll be proposing anyway,\nand I'm sure the legislature is very supportive of that as well.\nWell, listen, we'll work with the general assembly on any issues that they have. I mean,\nnobody's come to me precession and talked about those kind of issues, but we're starting\nready to work with people, but our main issue right here is making sure that we're helping\nour schools with this additional funding of $50 million added to what we have in the\nbase budget last year can keep their schools safe.\nAnd I think we saw how well the system that Appalachia had worked, even though that was\na tragic day.\nIt could have been more tragic if we had not had that funding for that school system.\nthere to think what would have happened.\nAll right, thank you all for being here.\nLooking forward to a great session.\nThank you very much.\n",
  "updated_at": "2026-02-12T19:10:11.918093+00:00"
}