{
  "video_id": "MhT1TDLRzA4",
  "url": "https://youtu.be/MhT1TDLRzA4?t=1205",
  "title": "Georgia House - Day 6 (2026-01-24)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-01-24",
  "duration_minutes": 67,
  "summary": "# Georgia House - Day 6 (2026-01-24)\n\n## Overview\nThis session focused primarily on a single bill, HB37, which was debated and voted on. There was also a notable moment with a prayer and introduction of a guest chaplain.\n\n## Key Actions\n**HB37**: Legislation related to election procedures\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Prayer and introduction of guest chaplain Rev. Emma Nyshloss by Rep. Betsy Holland\n- Remarks by Rev. Nyshloss on the importance of not being indifferent to the needs of others\n\n## Votes\n- **HB37**: Voted on, outcome not specified in transcript\n\n## Attendance\nQuorum was present, with all members voting.\n\n## Adjournment\nThe session adjourned, but the transcript does not provide the specific time or date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning.\nThe hour of convening having arrived, all members will please take their seats.\nThe clerk will please ring the bell.\nWe're going to have the morning row call, all members present will please vote\ngreen to signify their presence in the chamber and Mr. Clark please unlock the\nmachines will someone please vote representing Holland's machine got it thank\nThank you, Representative C. Ball.\nHave all members voted?\nHave all members voted.\nIf so, the clerk will lock the machines.\nDo you have someone who didn't vote, Ms. Clerk?\nThe doorkeepers will please close the doors and keep them closed.\nAs our custom, we will begin our day with Scripture reading and a prayer by the chaplain, after which\nwhich we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 54th House District\nRepresentative Betsy Holland.\nRepresentative.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI could not be more excited to introduce my pastor today and to recognize some of our\nchurch family who are here in the gallery to see us.\nThe Reverend Emma Nyshloss serves us at Morningside Presbyterian Church as our associate\npastor.\nShe oversees adult education, our community outreach, and our mission work, and perhaps\nmost importantly, as the parent of a teenager, she is our youth pastor.\nPastor Emma, because that's easier to say than the Reverend Emma Nyshloss, a pastor Emma\nis celebrating her fifth year at Morningside, just had her anniversary.\nThat's easy for me to remember, because I had the honor of chairing the search committee\nthat brought her to Atlanta.\nShe's a graduate of Princeton Theological Seminary\nand came to us from Pittsburgh.\nSo while she's not a native Georgian,\ny'all I got her here as fast as I possibly could.\nEmma is gifted from the pulpit\nand obviously a great congregational leader.\nThere were two things that when\nchairing the search committee\nreleased it out to me that made her a top choice.\nOne was sentimental.\nShe went to the same seminary as my dad.\nThe second was when we both discovered\nwe were rabid fans of the television show The West Wing\nand loved presidential and political trivia.\nSo when you meet her in the anti-broom,\nyou can try to stump her with some presidential knowledge.\nI am so grateful to the speaker for allowing us\nto have her here today and to hear her message.\nSo please welcome Pastor M. Nysloss.\nThank you, Mr. Speaker,\nand thank you, Representative Holland.\nIt is a great honor and a joy to be with all of you\nthis morning. As Representative Holland said, I came to the great state of Georgia just\nover five years ago, and I will be honest, I never imagined myself living in Georgia,\nand that's nothing against the state of Georgia. It's just very far from my beloved home\nin Pittsburgh, Pennsylvania, and you all don't have a professional hockey team, which is\ntough for me. But I feel called to ministry, and so when I felt a call to the congregation\nand I serve, I came.\nI imagine that you all know a little bit\nof what that feels like,\nperhaps not in the leaving of home\nor the longing for NHL hockey,\nbut in the decision to say yes\nto something that demands big things from us.\nThe choice to enter into public service\nwas not a small or an easy one, I imagine.\nYour lives are different because you answered a call,\nwhether from your constituents, your creator,\nfrom the state of Georgia.\nAnd even though our jobs are very different,\nwe are all here today answering our respective calls.\nSo in the few short minutes I have with you this morning,\nI thought that I might offer a way to respond to our calls\nusing what I am willing to claim\nis the most important verse in the Old Testament.\nAnd I know that that is a bold claim,\nbut the most important verse in the Old Testament\nis found in Deuteronomy 22.\nNow, Deuteronomy is chock full of laws for living.\nIt contains everything from how you treat foreigners\nto how to worship God, to how to plant and sow your vineyards.\nIt's important to be sure, but it's often very granular.\nAnd Deuteronomy 22 is no exception.\nIt opens with instructions for how\nto treat your neighbor's livestock.\nIf your neighbor's ox wanders off, you care for it.\nYou take it home.\nIf you don't know where the ox belongs,\nyou take it into your home and treat it as your own\nuntil his owner comes to find him.\nThis may seem like common sense.\nIt may seem wholly unimportant,\nbut right there in the midst of these verses\nis this important phrase,\nyou shall not withhold your help.\nThough perhaps a closer translation is,\nyou shall not remain indifferent.\nIf you see a lost ox or a lost donkey,\nyou shall not, will not refuse to help.\nWith this declaration, we are given less of a law to follow\nand more of an approach to life.\nWe must be oriented toward being engaged,\nbeing not only aware of needs of injustices,\nbut having a desire and a motivation\nto do something about it.\nThis simple phrase tells us what our call is,\nwhat our jobs are.\nAnd we see the places that help is needed, and then we do something about it.\nIt leaves us no room for not my pig, not my farm kind of attitude.\nWe cannot turn away from need.\nI imagine that each of you over the course of your tenure has been and will continue to\nbe confronted with needs and injustices and wrongdoings, both big and small.\nI also imagine that there will be times\nwhen it feels difficult to act.\nThe problem feels too overwhelming.\nYou just don't have the time.\nThe issue doesn't garner much media attention.\nThe solution costs too much money or worse.\nThe solution was suggested by a member of the other party.\nAnd yet, we cannot remain indifferent.\nI know that we are all humans incapable\nof writing every wrong, healing every hurt,\nmending every broken place and yet that should never dissuade us from trying because we have\nsaid yes to a call because there are problems and hurts in our communities because we refuse\nto turn away.\nThere is yet another translation of Deuteronomy 22-3, you shall not hide from yourself.\nhelp to someone, to everyone, is part of what it means to be human. It is a fundamental\npart of who we are created to be and who we are called to be. It is my hope that as you\ndo the important work of this legislative season that you will not hide from yourselves.\nAs you strive to serve Georgia, as each of us seeks to live into our call, may we never\nbe indifferent. Let us pray. God who goes by many names today, we will call you love. May love\ndrive out fear and pave the way for peace and give birth to new things. Inspire us and\nempower us to push back against apathy, indifference, and selfish gain that we may answer the call\nyou have placed on our lives. Work in and through us that we may, with all of our ability, love and\nserve our neighbors as we love ourselves. Open our eyes to the needs around us. Give us minds that\nstrive for new solutions. May our hearts be set on fire. Remind us what it means to be human.\nGod of love, give us grace to risk something big for something good. And grace to remember that\nthat the world is now too dangerous for anything but the truth and too small for anything but love. Amen.\nYou\nDoorkypers will unlock the doors and as our custom members may greet the\nchaplain in the south anti-room. Chair now recognizes Chairman Tarvan, the\nchair of the committee on information and audits. Chairman Tarvan. Mr. Speaker your\ncommittee on information and audits has read the legislative journal from a\nprevious legislative day and found it to be correct and on another note we\nWe cannot change the direction of the wind, but we can adjust our sails to reach our destination.\nTerrible words were never spoken, Chairman Tarvan.\nChairman Tarvan, the chair of the Committee on Information and Audits,\nreports that the journal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the readings of the journal?\nChair, here's none, the reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nChair, here's none, and the journal is confirmed.\nThe clerk will read the resolution, establishing the order of business for the day.\nThe administration of the 104th moves following to be established as the order of business\nand her first part of the period, unanimous consent,\nintroduction of bills and resolutions,\nfirst reading and reference of house bills and resolutions,\nsecond reading of bills and resolutions,\nmorning orders.\nWe're right here.\nIs there any objection to the adoption\nof the resolution establishing the order\nof Venice for the day?\nChair, here's none and the resolution is adopted.\nYou may want to listen to this.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 39 by the sort of Lumen 98th camp and the 135th Hagan on the 156th Carpenter\nof the 4th and Maynard of the 56th Ability Title Act to amend.\nChapter 3, a total 20, the physical to Georgia, annotated relating to post-secondary education.\nHigher education.\nHouse Bill 40 by rooms that have been limited the 98th even so 64th Friday and 120 second.\nMartin the 49th, Holcomb and the 81st and others will be titled back to men are three chapter 13 of title 48 and fish go to Georgia and Taylor relay next size tax on her own.\nWays and means.\nHouse Bill 41 by resident of lemon the 98th Gunner the 8th Oliver the 82nd and the 127 out of the 50th and others will be titled back to men title 37.\nSeven of the fish go to Georgia and Tater relating to mental health.\nPublic and community help House Bill 42.\nMy wife said a limit of the 98th lumps into the 12th, where he was the 99th and\nMaynard the 56th, Bill B. Todd will act to amend chapter 5, a ton of 48.\nThe fish go to Georgia and Tater relating to add Polarim taxation.\nWays and means House Bill 43 by Robson of limit of the 98th, Taylor the 173rd.\nEighth the act of 74th, McLean of the 109th,\nMaynard of the 56th,\nBill B. Todd of Acto,\nand then Article 7 of Chapter 12 of Title 44,\nand the official go to George annotated,\nrelated to the protection of American Indian human remains,\nand burial objects.\nState planning and community affairs.\nHouse of 44 Bimers,\nand Ohio of the 50th, Beverly of the 143rd,\nmentioned the 88th Park of the 107th,\nRoberts, the 52nd, and others.\nHe'll be titled act to amend part five article 4, chapter 11 to title 16, the physical\nto Georgia and Taylor relating to Brady Walnut regulations.\nPublic safety and hum land security.\nThat's what 45 I wrote in the mouth of the 50th part of the hundred seventh, 1198.\nLike all of the 105th, Roman 97th and others, he'll be titled act to amend part five,\nbefore chapter 11 at title 16.\nThe fish go to Georgia annotated relating the Brady\nLaw regulations.\nPublic safety and homeland security.\nThat's what 46 are going to buy with the 50th new\nknown 27th cap.\nLone 35th Cooper the 45th and a lot of the 31st will be\ntaught and active in Article 2.\nChapter 5 at title 16.\nThe fish go to Georgia annotated relating assault\nand battery and related offenses.\nJudiciary non-civil House bill 47 by ropes of p3 the 166 Collins 71st Jones the 25th\nDonald the 26th Cameron refers to others will be touted active in code section 46 393 and 52\n7 12.2 the fiscal Georgia annotated relating to homicide by vehicle and homicide by vessel\nto win.\nDid you this year in non civil?\nHouse bill 48 by version of P3 of the 166 gull out of the 19th\ngunner of the 8th.\nSteven's on 64th and Collins is 71st.\nBill B. Todd will act to amend chapter 2.\nTitle 21 of the official go to Georgia and Tate relating to\nprimaries and elections generally.\nGovernmental affairs.\nHouse bill 49 by version of green in the 154th.\nBill B. Todd will act to amend the net creating board of\nSeminole County, Intergovernmental Coordination, House Bill 50, by the way, we're\nrising the 157th of the Bill B. Todd and Act to amend and act to provide a new\nchart with the city of Hague. Intergovernmental Coordination, House Bill 51 by\nversion, purple the 169th and corporate the 174th of the Bill B. Todd and Act to\namend chapter 2, a Todd of 20, the fiscal to Georgia and state of\nearly in the elementary and secondary education, education, hospital 52 by\nresident Thomas the 21st Task Force, the 11th part of the 5th wheat hour, 121st\nSeaball the 34th and others will be titled after a men title 32 of the\nfiscal Georgia and tentative related highways, bridges and ferries, transportation,\nHouse Bill 53 by rooms of quarterly 174th weeks and 178th\npurple 169th taking the 145th and Williams 148th\nwill be titled an act to amend Part 2 of Article 1 of Chapter 6 and Title 12\nneed fiscal and Georgia annotated relating to practice\na professional forestry. Natural resources and\nenvironment. House Bill 54 by rooms of Carson the 46\nHilton the 48th reason the 99th airheart of 369 and 134th\nfourth and others will be taught in active men are two chapter seven top\nof 48 at fiscal Georgia and Santa really need positionary computation\nexemptions and credits from state income taxes.\nWays and means possible 55% of Williamson will 112 Williamson are 48 taking\nthat are 45th way to the ninth. Ridley the sixth and others will be\ntaught in active men are titled seven at the fiscal Georgia and\nI annotated really the banking and finance.\nBanks and banking.\nHouse bill 56 by groups of P3, the 166,\nHitchin's son of 61st, Collins, 71st, Cameron in the first,\nlump's into the 12th and others.\nHe'll be titled an act to amend sub part seven,\nand part three of Article seven and chapter three,\na title 20, and you fish go to Georgia.\nI annotated really the grants to children\nof law enforcement officers.\nHigher education.\nHouse resolution, 18 by groups of mile,\n50th, currently in 143rd Park, on 7th,\nmentally 88th, Robert's 52nd, and others,\na resolution proposing a amendment\nto the Constitution and the State of Georgia,\nso it's required that the General Assembly\nmay be provided by General Law\nfor the redistricting of state,\ncongressional and state house and senate districts.\nJudiciary.\nThat completes first reels.\nSecond reading of bills and resolution.\nThe clerk will read House Bill 3, by Representative Scott with 76,\nmemberly of the 143rd Davis of the 87th Scofield of the 63rd Barnes of the 86 and others.\nA bill relating to program weights and funding requirements under the Quality Basic Education Act.\nHouse Bill 24, by Representative Thomas of the 65th, member of the 98th Jackson of the 128th.\nA bill relating to state flags, seal, and other symbols.\nHouse Bill 25, by Representative Thomas of the 65th.\nGovernor of the 137th, Governor of the 85th.\nA bill relating to imposition rate computation exemptions\nfrom income taxes.\nHouse bill 26 by Representative Thomas of the 65th.\nLimit the 98th.\nGovernor of the 85th and Buckner of the 137th.\nA bill relating to amendment and revision of codes.\nHouse bill 27 by Representative Thomas of the 65th.\nLimit the 98th and Jackson of the 128th.\nA bill relating to general provisions\nof the Georgia Building Authority.\nHouse bill 28 by Representative Anderson of the 10th\nand Irwin of the 32nd.\nA bill to amend and act to re-incorporate,\nprovided a new charter for the town of Alto, House Bill 29 by\nRep. Anderson of the 10th and Erwin of the 30th and Bill to\nauthorize the city of Cornelia to exercise all redevelopment\nother powers under the redevelopment powers law House Bill 30\nby Rep. Carson of the 46th, abstraction of the 104th,\nPantature of the 51st, Evans of the 57th, Bayesmore of the 69th\nand others, a bill relating to general provisions relative to\nstate government, House Bill 31 by Rep. Buckner of the 137th,\n5th, 120 second, lever of the 123rd, Smith of the 138th, Smith of\nthe 70th and others to build relating to hazardous site response.\nHouse Bill 32 by Representative Douglas of the 78th, Martin of the 49th,\nMcLean of the 109th Roads of the 124th hatchet of the 150th and others,\nthe bill relating to the other educational programs on the Quality Basic Education Act.\nHouse Bill 33 by Representative Camp of the 135th Mathiac of the 74th Lame of the 98th,\nout of the 50th Cameron of the 1st,\nthe bill relating to veterinarians and veterinarian technicians.\nHouse Bill 34 by Representative Williamson of the 112th Waves of 148th,\nDickey of the 145th Waves of the 9th Ridley of the 6th and others,\na bill relating to imposition rate computation, exemptions,\nand credits relative to state income tax.\nHouse Bill 35 by Representative Hitchens of the 161st,\nSiemens of the 164th Lums of the 12th Jackson of the 165th and Williams\nof the 168th, a bill relating to the Georgia Ports Authority.\nHouse Bill 36 by Representative Martin of the 49th,\na bill relating to Advalor and Taxation of Property.\nHouse Bill 37 by Rep. Beverly 143rd, Mitchell,\nthe 88th Park of the hundred and seventh,\nScott of the 76th minute, the 94th and others,\na bill relating to medical assistance generally,\nprovided as public assistance.\nHouse Bill 38 by Rep. Beverly 143rd, Mitchell,\nthe 88th Park of the hundred and seventh,\nScott of the 76th minute of the 94th and others,\na bill relating to medical assistance generally.\nHouse Resolution 10 by Thomas of the 65th,\nDrenner of the 85th, Lim of the 98th,\na resolution creating the House Study Committee\non public water systems serving disadvantaged communities.\nHouse Resolution 11 by representatives\nGofield of the 63rd Scott of the 76th\nCarter of the 93rd Davis of the 87th Canon of the 58th\nResolution Energy of the United States Congress\nto take swift action to ensure that women\nwith autoimmune immune disease and conditions\ndo not lose access to medically necessary treatment.\nHouse Resolution 12 by representatives\nThomas of the 65th,\nLema of the 98th Jackson of the 128th\nResolution Energy Leadership in all George's counties\nwho have reported citizens living in a tent box,\nSleep me back and rather impromptu shelter as a permanent home solution to diligently work\nwith certain non-profit or ward recipients to combat housing insecurity and homelessness.\nThrough your second readers.\nMembers will come to order. Members will come to order. Please take your seats.\noffice real important you can go to either any room. Take your choice. I want to\nintroduce a former member but first I want to let you know I just learned just a\nmoment ago thanks our great messenger that representative Glaze\nfailed this morning on the steps coming in here and she's been taken to the\nhospital. Mr. Leader, is there any further report on her at this time? We will\nupdate y'all as soon as we get any further information on how she is and we'll\nbe glad that we'll let all the membership know. But if you will this morning,\ncertainly as you pause and you go through your day, remember her and say a\nprayer that she's not hurt badly and that she'll be back with us here\nhere tomorrow. Thank you. Let us know if you don't mind, sir. We also have a\nformer member who's with us today, Representative Dusty Hightower, who served\nhere's Deputy Whip to the majority of Calcus, and who is now a Superior Court\nJudge in Caluida County, in the Caluida Circuit. Representative Hightower, we're\nglad to have you with us, man.\nWe're awfully proud of his service to our state and certainly now on the judiciary we appreciate his service as well.\nRepresentative Jones, if you'll make your way down, we'll have morning orders now and we'll allow you to introduce our doctor of the day.\nRepresentative Sheila Jones.\nThank you, Mr. Speaker, fellow colleagues, I'm introduced to you\nWithout Doctor of the Day, Dr. Mims is Vice President and Chief Medical Officer for\nAlliant Health Solutions, the Quality Innovation Network.\nShe held that role for 10 years.\nThe Network contract currently serves Georgia, North Carolina, Florida, Alabama, Tennessee,\nKentucky, and Louisiana.\nDr. Mims is board certified in family medicine and geriatrics with fellowship status in both\nspecialties.\nShe has more than 30 years of clinical practice experience, including caring for Medicare\nbeneficiaries in the hospital, office nursing home, hospice, and home care.\nWe are impressed by her unique insight to the needs of the patient and family members,\nnot to mention the clinical care team.\nDr. Mims also sits on the boards of the Georgia Academy of Family Physicians and Georgia\nAlzheimer's Association.\nDr. Mims was appointed by the Governor of Georgia to the Georgia Oda Adults Cabinet\nand the Georgia Council on Aging.\nDr. Meums completed her undergraduate training\nat George Washington University,\nMedical School at Stanford University.\nLet us welcome and recognize Dr. Meums.\nThank you, Representative Jones, and we appreciate Dr. Mims serving us today.\nThank you, Dr. Mims.\nThank you, Representative Jones.\nChair now recognizes Representative Mata Hand for a morning order.\nWell, thank you, Mr. Speaker, and good morning, members.\nPlease help me welcome the over 70 members of the George Association of Voter Registration\nand election officials, known as Gavrejo.\nGavrejo is a bipartisan group that was established in 2018\nwhen the Georgia Election Officials Association\nand the Voter Registrarter Association of Georgia\nmerged together.\nIt is made up of five elected executive board members\nand committees from all over the great state of Georgia.\nMs. Deezer Holden and Charlotte Soesby\nfrom Athens-Cart County served as the first co-presidents.\nGavreo works with counties and the Secretary of State and the State Election Division\nto provide certification for all election officials, as well as working with the general\nto shape policy that will benefit all voters of Georgia.\nWe thank each and every Gavreo member for their hard work in this past election, marking\nthe most successful election in Georgia history, and working hard on the behalf of all voting\nGeorgians, thank you so much.\nyou and welcome to the People's House. Thank you, Representative. If you have an afternoon\norder, if you will start making your way down front, we'll recognize you in just a moment.\nMr. Clerk, would you mind reading the caption to a group of privileged resolutions?\nHonoring the life and memory of Deborah, Debbie Lee Mason.\nRecognizing commending Shirley Poll on our outstanding public service, congratulating\nthe four city juniors and the four city gun club for winning the 2022 Scholastic Clay\nTarget Program National Championship, congratulating the Benedictine Military School cadets football\nteam for winning the 2022 Georgia High School Association Class 4A State\nChampionship, commending Hemophilia of Georgia, recognizing commending 13th\nCollaried Distilleries, commending the Georgia Youth Science and Technology\nCenters as well as the 2023 Don Cargill STEM Scholars for their innovative\nIntegrated Teaching of Science, Technology, Engineering and Mathematics,\nCommending and congratulating Lane Isaac Menopenter, recognizing the Lunar New Year celebration,\nrecognizing commending Michael Harris, the second, recognizing commending the Lakes 5B\nchapter Jack and Jill of America Inc. and for other purposes that completes the reading\nwith privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nChair, here's none and the resolutions are adopted.\nI want to pause right there and thank you members for paying attention.\nPrivileged resolutions are always important to us as members and those we seek to honor\nand to serve.\nSo thank you for your attention and I do appreciate that.\nWe'll now have afternoon orders.\nWe have several, so we want to try to hold them to about two minutes.\nI know some of them are very important, so the first afternoon order will be representative\nWe will wait, representative Wade.\nThank you, Speaker, ladies and gentlemen.\nI rise today to celebrate the life of a constituent of mine, probably the most precious constituent\nout of my mother.\nToday is her 76th birthday, and she, like many Georgians, have gone through a lot, but she\nShe is a true spirit of what makes America great.\nShe was an Air Force Brat, her term, and she landed in the mid-60s at Warner Robbins Air\nForce Base, graduated Simma Cum Laude from TIFF College.\nShe has the best handwriting of any person I've ever met, and she's the best grandmother\nto my two children, and I hope you will join me in reflecting on such an amazing woman.\nThank you, Speaker.\nI know you're almost proud of you, boy.\nMr. Representative, good stuff.\nThank you for doing it, Will, and happy birthday to your mother.\nRepresentative Kendrick's recognized for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI know everybody loves technology I know I do.\nThere is a letter that is on your desk for my fourth tech for all policy conference.\nWe're having a VIP reception at ATDC with some special guests, including our new chair\nof tech and infrastructure.\nSo please join us as we talk about tech and workforce development.\nAnd then February the 16th, we'll have a group of tech enthusiasts down here to talk about\nbills that are important to them.\nPlease stop by room 307 for to hear from them and then I'll acknowledge them while they are in the gallery as well\nAnd then join us at City Hall for a lunch a delicious lunch as we honor people who have\nMade a difference in workforce development in the technology industry so hopefully you're joining me February the 15th or\nFebruary the 16th and if I can answer any questions let me know. Thank you\nThank you representative chair now recognizes representative Alexander and\nbasemore for a morning order on the women's caucus thank you Mr. Speaker\ngood morning everybody I expect to see all the women today at the women\nlegislative caucus meeting in room 230 at 11.30 and lunch will be served. Thank you.\nYes ma'am. Thank you for your announcement. Now if you're now recognized as a\nrepresentative, Kenner for our announcement, excuse me for morning order.\nThank you, Mr. Speaker. If you'll indulge me just for a moment with all the\ngrandfathers in the house please stand all if you're a grandfather would you mind standing yeah all right\nToday I would like to announce the establishment of the grandfather caucus\nUh of which as of two-thirds these ago. I am the newest member\nOn the screen you'll see our new grandson\nThat's Nathaniel William Clark.\nAfter we swore in on September, or I'm sorry, on January 9th,\nPam and I immediately drove to Maryland\nto witness the birth of our first grandchild.\nIt was very exciting.\nHe was born in Annapolis, Maryland.\nMy son-in-law, Chris, and my daughter, Alex,\nthey're there for two years.\nHe has taken the assignment to teach navigation\nat the Naval Academy.\nSo we were very pleased about all that.\nThey did so good with the baby.\nMy wife, her term of endearment for our grandchildren,\nis going to be Graham.\nI kind of test drove a few.\nStarted out with grandfather, pop-hop.\nG-ditty was a consideration.\nBut we've landed on Big Poppy.\nBig Poppy.\nSo I've got a few titles now.\npastor, nonprofit executive, I'm a success coach, I'm also a state representative, but\nbig poppy.\nI'm going to really enjoy that role.\nThank you for indulging me this morning, big poppy out.\nThank you for that morning order of their representative, big poppy, and so I was having\na little trouble with your name, but I've got big poppy, I can handle that.\nLauren McDaniel, Governor's floor leader, is recognized for the morning order.\nThank you Mr. Speaker, ladies and gentlemen of the House.\nThis is something near and dear to all of us that happened this last week that Georgia State\nPatrol just wanted to, how to make a statement, the ones that protect us here at the Capitol\nand protect us around the state.\nAnd I just want to read a little statement from them.\nOn Wednesday, January 18, 2023, the Georgia State Patrol\nspecial weapons and tactics SWAT team was requested\nto assist the Georgia Bureau of Investigation\nin Atlanta Police Department and the Cab Police Department\nwith an operation to identify people\nwho were trespassing and committing other crimes\non the side of a future city of Atlanta Police Safety\nTraining Center.\nOn such date at 9 AM, state troopers of the SWAT team\nwere moving through the property\nwith other law enforcement officers and located a man\ninside of a tent in the woods.\nThe state troopers gave the man commands to leave the tent\nand identify himself under the threat of being arrested\nfor criminal trespass.\nThe man refused to comply with the troopers commands\nand even after being told he was under arrest\nand needed to exit the tent immediately.\nThe man fired a nine millimeter handgun\nin the direction of the troopers,\nstriking one in the abdomen area.\nThe other state troopers immediately returned fire striking the man.\nLaw enforcement officers worked quickly to evacuate the injured trooper to a safe area\nwhere he was transported to a local hospital.\nThe trooper was rushed in emergency surgery and currently in stable condition resting at\na local hospital.\nThe man who fired upon the law enforcement officers pronounced deceased at the scene.\nIt was later discovered the farm used was illegally purchased in September 2020 by the\nshooter identified as manual Esteban Paz Tehran. The handgun used was identified as a Smith\nand Wesson M&P shield 9 millimeter. This is a statement by the Georgia State Patrol.\nAnd just please keep all that we're involved in this in our prayers. Thank you.\nThank you, Representative. Representative Nullowicz is recognized for a afternoon\norder. Hi, everyone. This is your annual reminder that January is cervical cancer\nawareness month in Georgia and in the United States. More than 15,000 women\nannually in the United States are diagnosed with cervical cancer. Around 500 of\nthese are in Georgia. Around 4,200 women die every year of cervical cancer.\nIt's a 140 women in Georgia who we lose every year to cervical cancer, and the thing\nabout cervical cancer, it is incredibly treatable.\nOne in five women in Georgia, though, don't get the screening that can detect and prevent\ncervical cancer, so they can be treated early.\nWhat's astonishing about cervical cancer is that 95% of cervical cancers are caused by\nthe HPV virus, that's the human papillomavirus, and the great thing, the miracle of this, is\nthat there is a vaccine for HPV.\nIt is available to every teenager and young adult in Georgia.\nMy two teenagers are fully vaccinated against HPV,\nwhich means that they are probably never going to face\none of these cervical cancers and also a lot of head\nand neck cancers that are related to the HPV virus.\nI encourage everyone to learn more about the HPV virus\nand the vaccine and the reality of cervical cancer\nin Georgia and in the United States.\nThis is cervical cancer awareness month.\nWe had an organization that was down here\nat the Capitol last week.\nWe have a resolution in their honor.\nI'm going to be circulating.\nAnd I hope that you will take the moment\nto read some of the facts that were put on your desk\nyesterday.\nThank you so much.\nThank you, Representative, for that information.\nChairman Mitchell is recognized for an even order.\nThank you, Mr. Speaker.\nI first of all want to thank my friend and colleague,\nRepresentative Katie Dempsey,\nfor pointing out the imminent unwinding\nof the Medicaid throughout the COVID-19,\nthe pandemic and public health emergency states\nhave been required to suspend termination\nof coverage of individuals who are already enrolled\nbecause of in Medicaid, this continuous coverage\nwill in, and I want to thank her because this is an issue that our caucus has been working\non as well. And in bipartisan support of her efforts, I would encourage you all to join\nour efforts, and particularly the leader has sponsored HB37. The unwinding official name\nis the family's first coronavirus response act, 41% of percentage increase in Georgia\nMedicaid enrollment since the start of COVID-19 has happened. It is estimated that almost\nover a half a million Georgians who will lose Medicaid coverage after the unwinding and\nit will take 14 months. Georgia has to complete all re-determinations. So what I would encourage\nyou to, in a bipartisan support, of course, to support this effort.\nAnd of course, we have another bill sponsored by the leader to expand Medicaid in its entirety.\nWith that, Mr. Speaker, I want to thank you.\nThank you, Representative.\nThe chair now recognizes Representative Becky Evans for an afternoon order.\nRepresentative?\nThank you, Mr. Speaker.\nColleagues, I want to call your attention to the invitation on your desk today to attend\nthe environmental and clean energy open house tomorrow afternoon, Wednesday the 25th.\nWe have lunch and networking with environmental advocates from Pro 45 to 130 and the program\nwill be from 130 to 230.\nIt's in CLOB 605 and also it's available via Zoom if you're going from one thing to\nthe next, and you need to work from your office. So we'll have advocates from the Georgia\nWater Coalition, Georgia Solar Electrification from Oki-Phonoki, from several different\nenvironmental and activist groups. So I invite you to join us tomorrow afternoon, 12.45\nper lunch, 130 for the program. Thank you.\nThank you, Representative. Chair now recognizes Chair Lady Katie Dempsey for an afternoon\nThank you, Mr. Speaker, and thank you, Rebsim Mitchell, for drawing attention to this.\nThat's all I want to do is make sure that you realize this is on your desk.\nIt's a wonderful resource.\nIt's really not about expanding Medicaid.\nIt's not about denying Medicaid.\nIt's the factual information that deals with the actual unwinding that we are required to\ndo by the federal government.\nAll states have been under the COVID public health emergency.\nAnd for the next 12 month period, we must unwind and go back and check.\nPeople who were on Medicaid were not checked as they would have been.\nPeople who might need to be on it were also not brought in.\nI know it's a very complicated subject.\nIt's heartfelt for many people, but our challenge each and every one of us is to make sure that\nthose who should have this resource do have it.\nAnd as you hear from constituents that might have questions,\nI hope that this will help you realize the planning\nand actions that are related to the Medicaid unwinding\nthat occurred during the calendar year of 2000 and 22\nand the primary risks and potential strategies\nthat are being taken on by those who work in this\nin our state.\nThank you so much.\nThank you chair leader Dempsey and we appreciate your passion and hard work in this subject matter that completes our\nafternoon\norders\nWe'll move on now to our announcements chair recognizes chairman Corbett for an announcement\nThank you mr. Speaker good morning colleagues\nUpon a journey the rule caucus will be meeting in the agriculture building across the street lunch will be provided\nYou know, it's the second largest caucus in the chamber and I would like to make that the largest caucus\nSo y'all come come join us for us of DOS barbecue. Thank you\nThank you, miss chairman\nChair recognizes represent beclaim for our announcement\nThank you, miss chairman. I just want to remind the Gwyneth House delegation that will be meeting in room\n6.05 at 12 o'clock and a lunch will be provided but please do come and have the lunch is being provided for you and not going to dollars\nSo the Greenette house delegation will meet in room 6.05\nUp at noon at 12 noon. Thank you miss speaker\nThank you representing the clean chair recognizes chairman Robert Dickey for an announcement\nMr. Speaker, those of you who are on Agriculture and Consumer Affairs Committee, we have\na first meeting in the morning, 8 o'clock. I don't think it's hit your emails yet. My\nAA is not quite got that out, but please look, we'll have an orientation and first meeting\nin the morning 8 o'clock. Agriculture and Consumer Affairs, thank you, Mr. Speaker.\nMr. Chairman, you mean you're the first one out of the box with a meeting?\nIs that what you're telling me?\nWe've got some important business to do this year, I think, so I'll find out.\nAs you always do, I think these members are ready to go to work.\nI know they are.\nThank you, Mr. Chairman.\nThat completes our announcements.\nNow we have a young lady who has a birthday today.\nRepresentative Ann Allen Westbrook, down on the coast.\nSenator Westbrook, happy birthday.\nChair, now recognize the majority leader for a motion.\nThank you, Mr. Speaker.\nI move that this house stand adjourned until 10 a.m.\non Wednesday, January 25, 2023.\non the motion of the majority leader\nthat this House stand adjourned\nuntil 10 a.m. Wednesday, January the 25th, 2023.\nThat's all remembered that tomorrow\nis the state of the state address by the governor\nright here in this chamber.\nSo we'll be in at 10 o'clock\nand we'll move through our business of the day\nand we be ready to welcome the members of the Senate\nand the governor to the chamber to hear\nfrom his state-of-the-state address.\nThat's to plan for tomorrow.\nSo thank you, Mr. Majority Leader.\nAll those in favor of the motion will say aye.\nThat was weak.\nAll those opposed will say no.\nWe could stay here longer, but I think the eyes have it.\nIt's clear we're adjourned.\n",
  "updated_at": "2026-02-12T16:25:40.547665+00:00"
}