{
  "video_id": "mLhYLWDpcTg",
  "url": "https://youtu.be/mLhYLWDpcTg",
  "title": "Georgia House - Day 34 (2026-06-19)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 34,
  "video_date": "2026-06-19",
  "duration_minutes": 5,
  "summary": "Overview:\nThe Georgia House session on June 19, 2026 focused on logistical and procedural matters, as the Senate had not agreed to the House's proposed adjournment resolution. This resulted in the House needing to remain in session the following day, which was Father's Day.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The House Speaker announced that the Senate had not agreed to the House's adjournment resolution, meaning the House would need to remain in session the following day, which happened to be Father's Day.\n- The Speaker encouraged committees to meet over the next hour, as the Clerk's office would need time to prepare for a supplemental rules calendar at 4:30 PM.\n- A rules committee meeting was scheduled for 3:45 PM in room 341.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nThe House went into recess until 4:30 PM, when they would take up a supplemental rules calendar. The next session date was not provided.",
  "transcript": "Mr. Clark, will you ring the bell, please?\nHouse will come back to order.\nwill come to order here for momentarily. I understand we have the sound issues fixed\nwith room 341. Of course, if a tree falls in a room with no one in it, maybe you guess\nyou can't hear it. Okay. I have a couple of announcements for you. A couple of\nannouncements. First of all, the Senate has not agreed to our adjournment resolution.\nThey are, they have set a rules calendar for-\nJust so y'all will know, there will be a rules meeting at 345.\nThat was the other one. Obviously we don't have the sound problem fixed for 341.\nSo as of right this minute, we will be in session tomorrow, subject to a motion by the majority\nleader as to time, and I'm well aware that it's Sunday's Father's Day, and you know,\nthat was one of the reasons that somebody in the Senate said three or four weeks ago\nSo we couldn't come in at a time we recommended because we had to enjoy Father's Day.\nSo I guess whether we enjoyed or not now has it been determined.\nSo right now plan to be here tomorrow and help us get the word out.\nSecondly there will be a rules committee meeting in room 341 at 345 and then the clerk's\noffice, we'll need some time to assemble the work that whatever they prepare.\nOkay, I'm advised that there were committees that had scheduled meetings this afternoon.\nClerk's office is going to need about 30 minutes at least to get things ready.\nSo I'm going to encourage any committees that want to meet, need to meet, to meet now\nover the next hour and use this time wisely and then we will be at ease, it will be in\nrecess till 4.30 and then we'll take up a supplemental rules calendar. So rules committee\nmeet at 3.45 and we will be in recess till 4.30 and committee chairs are\nencouraged to meet over the next hour.\nYou\n",
  "updated_at": "2026-02-12T13:02:22.737078+00:00"
}