{
  "video_id": "mrNbMOV2hX4",
  "url": "https://www.youtube.com/watch?v=mrNbMOV2hX4",
  "title": "House PM Meeting 4 for Day 28 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 67,
  "summary": "Here is a structured summary of the Georgia House PM Meeting 4 for Day 28 of the 2025 Session:\n\n**Overview**:\nThis session featured the consideration and passage of several notable bills, including legislation to create a certification program for community health workers and require insurance coverage for necessary orthotic and prosthetic devices.\n\n**Key Actions**:\n- **HB 291**: Establishes a certification program for community health workers to serve underserved and rural areas\n- **HB 87**: Requires health insurance plans to cover medically necessary orthotic and prosthetic devices\n\n**Bills Introduced (First Reading)**:\n- HB 567\n- HB 677\n\n**Notable Moments**:\n- Debate on HB 87, which would expand insurance coverage for prosthetic and orthotic devices, highlighting personal stories of Georgians impacted\n- Presentation of HB 384 to standardize oaths taken by law enforcement officers statewide\n\n**Votes**:\n- HB 291 (Community Health Worker Certification Act) - Passed 169-4\n- HB 87 (Orthotic and Prosthetic Device Coverage) - Passed 171-2\n\n**Attendance**:\nThe session maintained a quorum, with all members present and voting.\n\n**Adjournment**:\nThe House adjourned after considering the bills, with the next session scheduled for the following day.",
  "transcript": "House will come to order, members, please take your seats.\nMr. Clerk, will you read a caption of the House bill 291-291?\nHouse will 291 by Representative Taylor, the 173rd to be entitled back to a man title 31 of the official go to Georgia,\nI'm saying to relate to health so it's a provide for the certification of community health workers.\nThis bill haven't been assigned the committee on public and community health.\nThat committee recommends a dis bill do pass by committee substitute.\nThank you, Mr. Speaker, members of the House.\nI bring you House Bill 291, the Community Health Care Worker Certification Act.\nThis is a very vital bill for us.\nIt's going to help our underserved and rural areas.\nThis is basically to create a pathway to certification for community health workers.\nIt's going to be overseen by the Department of Public Health.\nThese will be workers coming from your own local communities.\nThey'll be following the orders that doctors have.\nThe clinics and doctors can have follow-up with their patients.\nIt's going to be very beneficial for maternal care and even our mental health.\nI think childcare and the elder will also see a great benefit from these.\nI've had many, many people that want this.\nRight now, there's a very loose organization\nof how they're being trained.\nWe have various hospitals that are doing the training\nin-house, and we need to have a consistent needing\nto know exactly how everybody's trained the same way,\nand that's what this bill will do.\nAre there any questions?\nLady has no questions.\nThank you.\nI appreciate your favorable consideration.\nLadies yielded the well.\nIs there any objection to the previous question being ordered?\nHere in none the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in none the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in none the report of the committee has agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWill vote yes, all those opposed?\nWill vote no, and Mr. Clerk, will you unlock the machine?\nI have all members voted, all members voted, all members voted, all members voted,\nAll members is voted, if so, Mr. Clerk, will you lock the machine?\nOn the passes of House Bill 291, the yeas are 169, the nays are four, this bill hasn't received their requisite constitutional majority.\nTherefore, passed.\nMr. Clerk, would you read the caption to House Bill 87, 87?\nHouse Bill 87, my representative Clark,\nthe 100th and others to be entitled,\nand act to amend, title 33,\nthe fish code of Georgia and annotated,\nrelating the insurance, those to require health benefit,\npolicy coverage for medically necessary,\northotic devices and prosthetic devices\nand their materials and components.\nThis will happen for the committee on health,\ncommittee recommends that this bill do pass by committee substitute.\nRepresentative Clark has recognized to present House Bill 87.\nThe gentleman's recognized.\nThank you, Mr. Speaker.\nFirst, I stand before you today to ask for your support of House Bill 87, a bill that\nwould change lives for Georgians with limb loss or limb difference.\nThis bill isn't about growing government, it's about helping people.\nIt makes sure folks get the medical devices they need to live full, independent lives.\nRight now state regulated insurance plans deny coverage for basic needs and that's just not right.\nShowering, using the bathroom, playing, exercising, these aren't extras.\nevery day things we all do.\nBut for many, insurance rules make them out of reach.\nThink back to January 28th when we met some amazing people.\nElliott, my six-year-old buddy, lost his legs a baby.\nHis parents don't want special treatment.\nThey just want him to have a normal childhood.\nTo play with his twin brother Hudson,\nhis older brother Sebastian, to one day live on his own.\nJared Wallace and Athens Paralympian, go dogs.\nHe has shown us that physical challenges don't have to hold you back.\nBut still, his insurance won't cover a shower leg.\nSomething so basic.\nBrad O'Malley, a small business owner from Tucker,\nhe needs special orthotics to keep working,\nto provide for his family, but insurance won't help.\nThis bill fixes that because the right medical equipment isn't a luxury, it's a need.\nWe all know staying active keeps you healthy.\nWhen a doctor says someone needs a second prosthetic\nor orthotic, it's not extra is preventing\nbigger problems down the road.\nEven the Georgia Association of Health Plans\nagrees these devices are needed not optional.\nAt the heart of this bill, it's people.\nIt's about helping families, letting kids be kids,\nand making sure folks take care of themselves.\nLet's be real, this could happen to any of us.\nNone of us are safe from an accident\nan illness or a condition that might require these devices.\nIf that day comes, would you want your spouse, your child,\nor your loved ones to be told they can't have\nwhat they need to just shower or walk?\nThat's what we're deciding today.\nWill we let insurance companies keep saying no\nto basic needs or will we do what's right for everyone?\nI urge you to vote yes on our house bill 87\nbecause today we can make a real difference,\nnot just for Elliot, Jared, and Brad,\nbut for every Georgia who deserves to live a full life.\nWith that, I'll take any questions, and we'd love you\nto support of House Bill 87.\nRepresentative Scofield, to your right out front,\nis recommend for a question.\nThank you, Mr. Speaker.\nDoes gentleman yields?\nYes, ma'am, do.\nIs it not true that we both are excited at the work\nthat we've done with advocates such as so everybody can move\nand how it's changed our lives?\nYes, ma'am, it's changed both our lives,\nand it's left a huge impact on me.\nI can't wait to vote yes on this bill.\nThank you.\nChairman has no further questions.\nThank you, Mr. Speaker.\nI just asked for your favorable consideration for House Bill 87.\nThank you.\nYou'll have that chance to vote for it right now.\nIs there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopt into committee substitute?\nHearing none, the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nout this bill now pass all in favor of the passage of the bill will vote yes\nall those opposed will vote no and mr. Clerk will you unlock the machine\nhave all members voted all members voted if so miss clerk will you lock the machine\nown the passage of house bill 87 the yeas are 171 the nays or two this bill\nhave received the requisite Constitutional Majority is therefore passed.\nYou\nYou\nMr. Clerk, where you read the caption to H.M. 384-384-384 by Representative Seabull of 34th to be entitled\nI'd like to amend Article 1 of Chapter 10 of Title 16, and Article 1 of Chapter 3 of Title 45.\nThe official go to Georgia, they have been tated related to abusive governmental office and\nofficial oaths respectively, so as to provide for uniform oaths, be sworn by all police officers.\nThis bill ever heard the committee on Judiciary, non-civilic committee recommends this bill do pass by committee substitute.\nand if CBI has recognized to present the bill, HB 384.\nThank you, Mr. Speaker.\nColleagues, I rise to ask for your support on House Bill 384.\nLegislation that will standardize the oath of office taking by our peace officers across Georgia.\nCurrently, the legal obligations of our law enforcement officers vary depending on oaths administered by different agencies throughout the state.\nThis bill establishes a uniform standardized oath for all peace officers in Georgia, ensuring clarity and consistency statewide.\nIt also prevents the misuse of additional non-binding language and legal proceedings.\nThis often contained in the aspirational language.\nThat is the bill, Mr. Speaker, and I'm happy to take any questions.\nThe gentleman has no questions.\nThank you, I yield the well.\nThe gentleman's yielded the well.\nIs there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShall this bill now pass on in favor of the pass to bill?\nWe'll vote, yes, all those votes will vote no, Mr. Clerk, will you unlock the machine?\nAll members voted, have all members voted.\nAll members voted this so, Mr. Clerk, where you lock the machine.\nOn the passage of House Bill of 384 of the yeas are 171, nays are zero.\nThis bill, having seen the constitutional required, constitutional majority, is a past.\nMr. Clerk, will you read the caption of the House bill 649-649?\nHouse bill 649, my relative, been in the 94th and others being titled an act to amend chapter 1 of Title 33, the official go to Georgia annotated relating to general provisions, relative to insurance, so it was to provide for coverage, for comprehensive maternal mental health screening, and care, this bill I refer to the committee on insurance, that committee recommends a disbilled do pass by committee substitute.\nOkay members, give the member and the will your attention.\nYou\nYou\nYou\nOkay, Mr. Clerk.\nMr. Clerk, were you read a caption to House Bill 646?\n646.\nHouse Bill 646, to amend by Representative Stinson to amend chapter 16 to Title 45, if you\nshould go to Georgia Annotated Related in the corner, so as to provide venom salaries\nof corners to revise compensation provisions for deputy corners and to provide for benefits\nfor certain corners and to remove certain death investigation fees, as Bill ever referred\nof the committee on public safety and homeland security.\nThat committee recommends that this bill do pass\nby committee substitute.\nThe lady from Fort Valley,\nrepresenting Patty Stenson,\nis recognized to present the bill.\nLadies and gentlemen, members of the House,\ngive the lady your attention, please.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House,\nI bring to you House Bill 646,\nrelating to corners, we all have a corner in our district.\nThere are one in every county, all 159 counties.\nHouse Bill 646 provides minimum salaries of corners\nto revise compensation provisions for deputy corners.\nAnd we all know that the corner's primary duty\nis to determine the cause of death\nand to complete death certificate.\nSo this is a very simple bill, Mr. Speaker,\nmembers of the house.\nAnd I just want everyone to know\nthat the funeral home caucus does support this legislation,\nand we're asking for your support as well.\nAnd with that, Mr. Speaker, I will yield for any questions.\nWell, the lady did an outstanding job.\nShe has no questions.\nWell, with that, thank you, Mr. Speaker,\nand I yield the well.\nThank you so much for your support to House Bill 646.\nThank you, Representative Stenson.\nThanks for staying with us.\nLadies, yielded the well.\nIs there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs any objection to adopting the committee substitute?\nHearing none, the committee substitute is adopted.\nIs any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShout this bill now pass all in favor of the passage of the bill.\nWill vote yes, all those opposed?\nWill vote no?\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted, all members voted, so Mr. Clerk will you lock\nmachine. On the passage of House Bill 646, the yeas are 1-7, the nays are 4, this bill\nhaven't received a record, the constitutional majority is there for the past.\nMr. Clerk, well you read the caption of House Bill 430, 430.\nHouse of 430 by Representative Saints of the 180th being titled an act to amend Article 2\nChapter one in Title 42 with the fiscal to Georgia annotated relating to sexual offender risk review board\nSo to provide for a venue for certain petitions regarding the state's sexual offender registry\nThis bill happens verb to the committee on judiciary noncivil that committee recommends this bill do pass by committee substitute\nReptile scenes is recognized to present the bill chairman signs\nMr. Speaker, House Bill 430 is a simple bill that just ensures that if you're registered\nas a sex offender in a different state and move to Georgia, you're automatically on the\nsex offender registry. It's a valuable tool requested by the sheriffs who maintain\nour sex offender registry by county. Section 2 also ensures that if a judge in a different\ncounty, waves the restriction in residency in another county, the sheriff of where that\nindividual is going has the right to petition their superior court judge for a hearing on\nthat matter. Mr. Speaker, if there's no questions I'll yield the well.\nGentlemen, has no questions. Thank you.\nGentlemen's yielded the will. Is there any objection to the previous question being\nIn order, hearing none of the previous question is ordered.\nIs there any objection to adopting the Committee's substitute?\nHearing none of the Committee's substitutes is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nHearing none of the report of the committee is agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes, all those opposed.\nWe'll vote no and the clerk will unlock the machine.\nAll members voted, all members voted, if so, Mr. Clarent, were you locked the machine on the passage of House Bill 430?\nThe yeas are 168 the nasa zero this bill have received the requisite Constitutional majority is there for past\nMr. Clerk, do you read the caption of House bill five thirty one five three one house will five three one by reps under Reeves the\nNinety-ninth and others to be entitled back to amend code section five six thirty-four the Fisher go to George annotated relating the judgments and rulings directly\nthe appealable procedure for review of judgements orders or decisions not subject to direct appeal.\nThis bill I'm referring to the committee on judiciary.\nThat committee recommends a disbilled do pass by committee substitute.\nThe representative Matt Reeves is recognized to present the bill.\nSpeaker Burns, House members, this is the municipal sovereign immunity bill.\nHouse bill 531, this is a product of two months of work.\nThis was the Georgia Municipal Association's number one issue this session.\nMy granddad, who's World War II veteran and Babas Deacon for decades, he said being\nchurch on Sunday unless the ox is in the ditch and so when chairman lever it and other legislators\nand I found ourselves meeting with the cities on a Sunday morning I knew this issue was\nof grave importance.\nSo we engaged with members of the trial bar, House Judiciary Committee spent a long time\non this.\nThis bill is the product of a lot of study, it honors the civil justice system, the right\nto try out by jury, but it allows cities to budget for liability, to purchase insurance,\nto self-insure, and it solves a threatening problem to cities by setting a sovereign immunity\namount just like the state of Georgia has in Title 50 and the cities code in Title 36.\nSo what I ask for your approval is number one priority for our cities, 537 cities strong\nin Georgia.\nIf there are no questions, Mr. Speaker, I yield the well.\nThe gentleman has no questions.\nThank you.\nThe gentleman's yielded the well.\nIs there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShall this bill now pass?\nI'll in favor of the passage of the bill.\nWe'll vote yes.\nAll those opposed?\nNo, Mr. Clerk, will you unlock the machine?\nhave all members voted all members voted if so Mr. Clerk will you lock the machine\nOn the passage of House Bill 531, the yeas are 161, the nays 13, this bill haven't\nreceived the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 127, HB 127, 127.\nHouse Bill 127 by the represent of Cox, the 28th, and others to be entitled to amend\nin part four of our 17 of chapter two,\na total 20 of the official go to Georgia,\nannotated relating to sick, personal,\nand maternity leave for teachers and other school personnel.\nThis bill I refer to the committee on education,\nthat committee recommends a dis bill, do pass.\nRepresentative Rick Cox has recognized to present\nthe bill, Representative Cox.\nThank you, Mr. Speaker.\nTeachers in school personnel,\nIf you want to show them some love, please support this bill.\nThis is House Bill 127.\nCurrently, teachers earn 1.25 days per month for sick days.\nWhere three of those days can be used for personal.\nWe're simply changing the three to five to give them some more flexibility to utilize those sick days.\nMr. Speaker, if there's no questions, I'll yield the well.\nGentlemen, have no questions.\nThank you.\nThanks for your bill.\nGentlemen's yield of the well.\nIs there any objection to the previous question being ordered?\nHere in none the previous question is ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in none the report of the committee has agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes.\nAll those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted fifth so, Mr. Clerk, were you locked the machine?\nOn the passage of House Bill 127, the yeas are 172, the nays are 3, this bill haven't received a requisite constitutional majority, is therefore passed.\nMr. Clerk, will you read a caption to House Bill 483, 483?\nHouse Bill 483, vice president, the Prince of the 132nd to be entitled back to a man, Arick 2, chapter 5, with title 16.\nIf it's go to George Antony relating salt and battery source to revive for protections for inspectors of code enforcement, this bill I may refer to the committee on judiciary non-simile that committee recommends this bill do pass by committee substitute.\nChairman prince is recognized to present the bill.\nThank you, Mr. Speaker.\nHouse bill 483 provides protection for the code enforcement offices while performing their duties.\nvery similar to what we passed last year in House Bill 1033 for utility workers.\nWe thought we need to add code enforcement officers as well.\nExcept to your questions, Mr. Speaker, I'll yield the well.\nGentlemen, has a question from Representative Huffner from the Augusta area.\nI think both of y'all from Augusta, Richmond County.\nLet's see if you don't get the girls on this question.\nLadies, recognize.\nDoes the gentleman yield?\nI yield.\nSir, is it not true that Mr. Charles Chip was killed\nin Augusta Richmond County, performing his duties\nas a colon enforcement officer?\nThe lady is correct.\nAnd you're supporting this bill partially in support of that,\nbut in support of all the officers,\ncolon enforcement officers across this state.\nI agree.\nThis is gentlemen for the year.\nI for the year.\nWe also in local Augusta not implement measures\nto provide additional safety for those officers,\nincluding them wearing a safety vest,\nhaving radios and access to Richmond County Marshals\nto assist.\nI'm sure the lady knows what she speaks.\nThank you very much, Mr. Chairman, for bringing this bill.\nGentlemen, has no further questions.\nI hear the well.\nGentlemen's yield to the well is there an objection\nto the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report of the committee's agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine\nhave all members voted, all members voted, if so, Mr. Clerk.\nWill you lock the machine?\nOn the passage of House Bill 483, the yeas are 168.\nThe nays are five this bill haven't received it.\nThe rec was a Constitutional majority as there are four passed.\nMr. Clerk, will you read the caption to House Bill 323, 323.\nCouncil 323 by resident of May the act of the 82nd and others to be entitled act to amend chapter 43\nTitle 33 of the fish go to Georgia and tentative related and Medicare supplemental insurance\nSo it's a survivor Medicare supplemental policies to be issued and renewed for individuals under 65 years of age who are\neligible by reason of disability this bill I'm referring to the committee\nOf health that committee recommends that that this bill do pass\nWe're representing Matheac is recognized to present the bill, and chair, ladies recognized.\nGood evening, Speaker, and thank you.\nTonight, it is my pleasure to bring before House Bill 323, and this legislation affords\nMetagap coverage for people under the age of 65 with ALS or end-stage renal disease.\nMetagap plans cover the annual 20% of autopilot packet costs that Medicare doesn't cover.\nWhen you need a kidney transplant, you have to have that 20%, which could be very costly\nup to $20,000.\nSo this affords our citizens to be able to get that kidney transplant.\nFederal law requires insurance, Medicare and\nRolle's for 65 and older, but it does not cover 65 and under, and that's my bill.\nAnd I'll stand for questions.\nLady has no questions.\nPardon me?\nLady has no questions.\nI yield the well.\nThank you, sir.\nDid a good job.\nLadies, you are the well is any objection to the previous question being ordered here among the previous questions ordered\nIs there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill\nHearing none the report the committee is agreed to shall this bill now, shall this bill now pass all in favor of the passage of the bill\nWe'll vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine\nMr. Clerk, will you lock the machine on the passage of House Bill 323, the yeas are\n174, the nays are two.\nThis bill haven't received a requisite constitutional majority, is therefore passed.\nMr. Clerk, will you read the caption of House Bill 351-351?\nHouse Bill 351, my represent of Corbett of the 174th, being titled, NACTO Men Part 1 of Article 2, Chapter 8 of Title 12.\nThe official code of charge annotated, relating the general provisions regarding solid waste management.\nSo it's to modify the powers and duties of the Board of Natural Resources.\nBill Levenman referred to the Committee on Natural Resources and Environment.\nThat committee recommends that this bill do pass by committee substitute.\nChairman Corbyt is recognized to present House Bill 351, representative John Corbyt.\nThank you, Mr. Speaker, members of the House.\nI'll bring before you House Bill 351.\nThe Solid Waste Handling Facility Permitting has long been a source of litigation which has increased recently.\nHouse Bill 351 is intended to revise the Solid Waste Act to remove provisions, courts have determined to be unconstitutional or uninforcible, resolve inconsistencies between different provisions of the act, clarify for local governments their roles and responsibilities and permitting and clarify for the public, their opportunities to participate in these local government processes to public meetings, specify EPDs, responsibilities for reviewing local government approvals for verifications and provide for greater finality\nand the finality in the permitting process.\nThat's what the bill does.\nMembers, I would appreciate your favourable support.\nAnd I'll stand for any questions, Mr. Speaker.\nGentlemen, has a couple of questions.\nRepresentative Doreen Carter,\nto your left, is recognized for a question.\nRepresentative Carter.\nThank you, Mr. Speaker.\nThat's a gentleman you.\nI do.\nSo we have a situation in the city of Stonecrest\nwhere a solo waste company was given a permit\nby the city who did not have the jurisdiction,\nthe county did because it was a new city.\nSo what I need to understand,\nwill this bill prevent a situation like that\nor are we given more power to EPD?\nBecause EPD at the time knew that the city did not have\nthe jurisdiction but authorized to permit anyway.\nYes, this is a clarifies that.\nThank you for the question.\nAnd that question came up two times in committee\nand subcommittee and full committee.\nAnd the answer is this clarifies that situation\nwhere it does not happen again.\nWell, thank you.\nI believe the folk in the city of Stonecrest\nwill be happy to know that.\nThank you for the question.\nGentlemen, have a question to you right.\nRepresentative Jason Ridley, I recognize for a question.\nThank you.\nDoes Jim and Yield probably shouldn't, but I will.\nWell, this is actually a serious one.\nIs it not true that I had a call from Numerous Counties\nthat was in support of this bill because they did clarification on what the\ncan and can't do and this bill is going to do that.\nThank you.\nThank you.\nMr. Speaker, I yield well and I ask for your favour consideration.\nGentlemen, yield the well, is any objection to the previous question being\nordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favourable\nto the passage of the bill.\nHearing none report, the committee is agreed to.\nShall this bill now pass all in favor of the passage\nof the bill?\nYes, all those opposed?\nWe'll vote note.\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted if so, Mr. Clerk, will you lock the machine on the\nThe passage of House Bill 351, 351, the Yays 175, the Nays are zero.\nThe Bill, Henry C, the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 677, 677?\nHouse Bill 677 by Representative Dempsey, the 13th and others to be entitled.\nNow to amend chapter one of Title 31 of the physical to Georgia and\nSenator Lee, and General Prussens for health, so to provide for certain placement procedures for children upon discharge from a hospital or psychiatric or residential treatment facility in certain circumstances.\nThis bill I refer to the committee on health, that committee recommends that this bill do pass by committee substitute.\nThe lady from Rome representative, Dempsey is recognized to present the bill, representing Katie Dempsey.\nLadies recognized.\nThank you, Mr. Speaker.\nHB 677 seeks to create a process to address the growing problem\nin Georgia and around the country\nwhere children with mental health issues\nlanguish in hospitals.\nSometimes for months, and at times even over a year,\nafter they have been medically discharged.\nAcute or long-term mental health hospitals at that point,\ntoo often parents and guardians and custodians\nare abandoning these children for a plethora of reasons.\nThese are some of our hardest children.\nWhen we talk about hotel, when we talk about children\nthat are hard to find placements,\nthis is who we're talking about parents\nat the end of their rope.\nAnd they just don't know what to do.\nSo they are in the hospital.\nThey've had their three to five days of crisis care\nand there's nowhere to send them.\nSo this bill will pull together a quick strike team\nof decision makers to help these children\nfind appropriate placement and services.\nThe team will consist of the treating psychiatrist,\nthe hospital's medical director,\nappropriate state agencies, a care coordinator,\nand any insurer responsible managing the care of the patient.\nBut also one of the most important things it will do\nis collect data on the number of kids that languish\nin our mental health facilities\nand the number of days until they are appropriately placed.\nThis will help us and it will be provided\non an annual basis to the House and Senate budget chairs.\nMr. Speaker, that is the bill.\nIf there are any questions, I'll be glad to take them.\nLady has no questions.\nThank you.\nI yield the well and ask for your favorable support\nto help our children.\nLady, as yielded the well, is there any objection\nto the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to withdrawing the committee's substitute?\nHere in none, the committee's substitute is withdrawn.\nIs there any objection to adopting the substitute offered by the committee on rules?\nPeary Nunn, the rules committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nPeary Nunn, the report of the committee has agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWill vote yes, all those opposed?\nWill vote no, and Mr. Clerk, will you unlock the machine?\nAll members voted.\nAll members voted.\nAll members voted.\nAll members voted if so Mr. Clerk will you lock the machine on the passage of\nHouse Bill 677 the yeas are 173 the nay is one the Bill Henry C the\nrequisite Constitutional majority is therefore passed Mr. Clerk will you read\nthe caption of House Bill 652 House on 652 my representative Jones is 25th to\nbe entitled back to amend Article 1 of Chapter 9 and Title 48 of the official go to Georgia\nannotating related and motor fuel tax so to provide for an exception for collection of\nmotor fuel taxes relative to electricity delivered by certain electric vehicle charging stations.\nThis bill I refer to the Committee on Technology and Infrastructure Innovation.\nThat committee recommends a dis bill do pass by Committee Substitute.\nand Todd Jones is recognized to present the bill for representative Jones.\nThank you, Mr. Speaker.\nMembers, first and foremost, I'd like to thank Chairman Jasper's for\nhis leadership on EV charging and how we are transitioning as a state.\nAnd I'd also like to thank Representative Holcomb for his assistance on this bill that has been invaluable.\nWhat this bill does, it amends Georgia's motor fuel tax code to clarify taxation of electricity\nuse as a motor fuel through EV charging stations, the bill introduces a fuel\ntask exemption for the EV charging stations that are first owned by nonprofit\nto use exclusively donor funds, three are located on a federal right away,\nfour are no cost to the user, and five were operational by January 1 of 2025.\nMr. Speaker, that is the bill and I yield for questions.\nGentlemen, I have no questions.\nThank you, sir.\nI yield the well.\nExcellent job, gentlemen, yielded the well.\nIs there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWill vote yes?\nAll those opposed?\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\nThe\n6-52, the A's are 167, the A's are 4, this bill haven't received a requisite constitutional\nmajority, is therefore passed.\nMr. Clerk, will you read the caption to House Bill 635?\n635.\nHouse Bill 635, by Representative Wiedauer, to be entitled to amend chapter 41 and\nTitle 43.\nThe official go to Georgia and to relay the residential, commercial, general contractors\nSo it's revised provisions relating to the State Licensing Board for residential and commercial general contractors.\nThis bill I've heard the committee on regulated industries that committee recommends this bill do pass.\nThis chairman is a little bit about contracting, so we don't let him speak to House Bill 635.\nChairman Weed, how are you recognized?\nThank you, Mr. Speaker.\nThis is one of a handful of bills we're doing this year to streamline licensure and get people to work in Georgia quicker\nwith less cumbersome regulations.\nThis is sort of the residential,\nthe licensing board for residential\nand commercial general contractors.\nFairly straight and simple.\nI ask for your favorable consideration.\nThe gentleman has no questions.\nThank you.\nThe gentleman's yielded the well.\nIs any objection to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to a green to the report\nof the committee, which was favorable\nTo the passage of the bill hearing none the report the committee has agreed to show this bill now pass all in favor the passage of the bill\nWe'll vote yes all those opposed. We'll vote no and mr. Clerk. Will you unlock the machine?\nHave all members voted\nall members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 635, the Yays are 171 to Nays or 2.\nThis bill having to see the rec was a constitutional majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 567-567?\n5, 6, 7 by Representative Dempsey, the 13th being titled an act to amend Article 2, Chapter 11 and Title 43.\nThe official go to Georgia and it's ended relating licenses for the practice of dentistry, so it's to authorize and regulate tele dentistry by licensed dentists in this state.\nThis bill I'm referring to the Committee on Health, that committee recommends a disbilled do pass by Committee Substitute.\nRepresentative Katie Dempsey is recognized to present House Bill 567.\nThank you, Mr. Speaker and members.\nHB 567 will authorize and regulate the practice of teledinistry in Georgia by Georgia licensed\noral health care team members through the Georgia Board of Dentistry to ensure that patient\nsafety remains the priority while maintaining a continuous standard of care and sustaining\nthe Georgia licensed dentist as the leader of the health care team.\nIt allows patients without a dental home to establish care with a provider.\nIt addresses the huge concern we have of a lack of dentists in certain parts of our state.\nIt also authorizes hygienists to perform specific functions under general supervision\nFor a real-time diagnosis, now there is no doubt that dentistry is a tactile practice.\nSo this does not allow for someone to go through teledentistry and do a lot in your mouth,\nbut it does begin the practice, the oversight, and the view to help decisions be made about\nsomeone's oral care that might prevent an ambulance ride if they are in a nursing home,\nif they are in assisted living, that can be very hard too.\nSo this is a good way to help increase the number of healthy mouths in our state.\nIf there are any questions, Mr. Speaker, I'll be glad to take them.\nIf not, I will yield the well.\nThe lady did an excellent job.\nShe has no questions.\nThank you.\nI ask for your favorable support.\nThe lady yields the well.\nIs there any objection to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nthe committee's substitute is adopted, is there any objection to agreeing to the report\nof the committee, which was favorable to the passage of the bill?\nHearing none, the report of the committee has agreed to, shall this bill now pass all\nin favor of the passage of the bill?\nWe'll vote yes, all those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nWe have all members voted, all members voted, if so, Mr. Clerk, will you lock the machine?\nOn the passage of House Bill 567, the A's are 174, the NA's are two.\nThis bill, Henry C, the requisite, constitutional majority is therefore passed.\nMr. Clerk, will you read the caption of House Bill 582?\n582.\nHouse Bill 582 by Representative Gunner, the A to be entitled to amend title 1617 and\n24 of the fiscal to Georgia and tentative relating to crimes and offenses, criminal procedure and evidence respectively.\nSo it's to provide for defendants to support a justification defense by offering evidence of family violence,\ndating violence for child abuse committed by the alleged victim.\nThis bill haven't further the committee on Judiciary, non-civil that committee recommends this bill do pass by committee substitute.\nRepresentative Stan Gunther has recognized to present the bill, Mr. Chairman, you're recognized.\nThank you, Mr. Speaker.\nHouse Bill 582 helps victims of domestic violence who have committed a crime present evidence of their abuse as a justification for the crime which is before trial, in mitigation, which is after trial before sentencing.\nthose who are serving as senators who have a history of being a victim of domestic violence.\nFor justification, the defendant shall offer relevant evidence that the abuser subjected\nthe defendant to the acts of family violence, dating violence, or child abuse, which is\nlike a self-defense that can result in the dismissal of the case.\nFor mitigation, the defendant may present evidence that he or she were subjected to acts of\nfor family violence, dating violence or child abuse,\nand that such acts were a significant contributing factor\nto the offense for which the defendant is being sentenced.\nThe bill sets out the evidence that is admissible,\nand defendants that are serving a crime,\nserving a sentence, may petition the court\nrequesting to be rescinded as set out for mitigation.\nThere is a presumption in favor of granting a hearing\nunless the court determines otherwise.\nThe hearing must be scheduled not more than 90 days\nfrom the date of the filing of the petition\nand the state shall be given notice\nand an opportunity to respond.\nThere's a portion of this that\ncrime survivors regularly report\nneeding a diverse set of tools to address and repair harm.\nEnabling victim-centered programs\nwill respond to this need while helping survivors heal.\nAnd evidentiary privilege will allow acknowledgment of wrongdoing from the defendant, open dialogue\nand accountability, all of which are core to victim-centered programs.\nNow I think some of you have been receiving contacts from your district attorney objecting\nto this.\nAt the committee there was a district attorney that did object to a portion of this bill,\nthe committee voted the bill out unanimously with no change.\nSo the way I look at this, and it's the third section of the bill where they're serving\ntime for a crime they've committed.\nThis bill will not give them a free card to get out of jail.\nThis is just a way to get it reduced.\ntheir objection is the preparation and stuff they have to do for that. I understand that and I've\noffered and I don't know if they know it but I've offered to make any changes to it when it gets to\nthe Senate. I understand the politics of this but I really do not like the last minute objection.\nI can understand it on a sunny day but on crossover I don't. If you have any questions I'm happy to\nanswer. Gentleman has a question representing Santos to your right about halfway back.\nSo gentlemen yield. As a survivor I would like to thank you for bringing this bill. I wanted to ask you is\nit not true that this bill ensures that the legal system better acknowledges and experiences\nthat domestic violence survivors and provides them with more avenues for justice and healing.\nThank you. Well said\nGentlemen has no further questions. I yield the well. Thank you the gentleman has yielded the well\nIs there any objection to the previous question being ordered hearing none the previous questions ordered?\nIs there any objection to adopting the committee's substitute hearing none the committee's substitute is adopted?\nIs there any objection to agreeing to the report of the committee which was favorable to the passage of the bill?\nhearing none the board of the committee is agreed to shall this bill now pass\nall in favor of the passage of the bill we'll vote yes all those opposed we'll\nvote no and this clerk will you unlock the machine\nAll members voted, all members voted, if so, Mr. Clerk, will you lock the machine on the\npassage of House Bill 582, the A's or a 166, the A's or two, this bill can receive\nThe records of constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 577-577?\nHouse Bill 577 by Representative Gaines of the 120th and others to be entitled to an act to amend Title 48, the Fisher go to Georgia and it's\nadded relating to revenue and taxation, so it's to enact the Georgia, nicotine, vapor, product, directory act.\nThis bill I'm referring to the committee on ways and means that committee recommends that this bill do pass by committee substitute\nRepresent the Houston gains is recognized to present the bill House bill 57\nThank you, mr. Speaker\nHouse bill 57 that follows up a similar legislation that we passed last year in the house didn't quite get over the finish line in the Senate\nTo try to get some enforcement on vaping in our in our state\nright now we have seen the vape market being flooded by illegal Chinese\ndisposable vape products that are really all over the shelves in our state\nand across the country. The reality is the FDA is trying to put in some\nrestrictions but it's failed to do its part in terms of enforcement.\nYou know last couple years the number top couple selling vape products in\nAmerica including Elf bar which is one example. I think it was the number one\nselling product last year. It's actually an illegal Chinese manufactured vape\nand yet it's on shelves across the state.\nWe really have no idea what's in these products,\nnobody's monitoring them, and actually,\nin some of the testing that I've seen,\nthey're mislabeled in terms of how much nicotine's in them,\nwhat all is in the product,\nand retailers don't even know currently\nunder the current landscape,\nwhether what they're selling is legal or not,\nand so instead what's happening is products\ncoming straight from China and onto shelves.\nThis bill will help address that issue\nby creating a state level registry of what products are legal\nto be sold in the United States, including the products\nthat the FDA has given full authorization to as well as products\nthat were submitted in a timely fashion that are pending.\nBut again, this will make sure that those products\nthat the FDA has denied authorization\nor that were not submitted in a timely fashion\nwould not be illegal, would not be eligible to be sold.\nThey're currently not legal.\nAnyway, this bill doesn't change what is legal\nand what is not legal, what it does do though,\nis provide an enforcement mechanism.\nOther states have done similar,\nand my hope is this bill will help us get a handle\non this issue and stop these Chinese illicit products\nfrom targeting our children,\nwhich is what they're designed to do.\nIn fact, I had someone drop off a vape just a moment ago\nthat had a video game on the outside of the vape,\nand it's clearly targeted towards kids.\nI think kids, I think it was called some berry flavor.\nBut these are products are clearly aimed towards our children and they're not legal and so my hope is this bill helps us get\nOlder that miss speaker. I'm happy to answer a question if there is one gentleman has a question to your right in the back\nRepresentative Carpenter just recognize for a question. Does the gentleman you I do so could you talk me through the enforcement piece because I I mean\nI'm with you. This is a this is an epidemic for our youth. I see it around you know\nI employ a lot of youth employees\nand every one of them vape and they're vaping this stuff and who knows what's going to happen to them.\nSo talk through the enforcement for me please.\nSure. So this would be through the Department of Revenue, the Department of Revenue,\nwhich already visits these facilities regularly for enforcement, but there would be a state level registry\nthat manufacturers would opt into and be $1,000 to put a product on the registry and then the Department of Revenue\nwhen they're visiting coming in stores or baked shops,\nagain, that list would now be public whereas right now\nthere's literally not a list of what is a legal product\nand what is not.\nAnd so the Department of Revenue will be able to enforce that.\nThere are pretty strict penalties\nfor having these illegal products on your shelves.\nThank you so much.\nAnd I look forward to following this legislation.\nI would hope that we could get our local law enforcement\ninvolved in this too, because I can't thank\nof an issue this more important for the families of Georgia.\nThank you.\nThank you, and I will tell you law enforcement has said repeatedly in this conversation how much of a challenge this is and certainly in our schools\nThis is a major issue for our kids miss speaker\nRepresenting hugely the minority leader has a question right in front of you all take her question. I appreciate it\nLadies recognize. Thank you, mr\nSpeaker doesn't gentlemen. Yeah, I do just wanted to\nSay isn't it true that we went all across the state and the number\nfor principals telling us what this is doing to our children at schools was astounding.\nAnd it is further true that we don't know what's in these products and we need to get\na handle on them for the protection of our children.\nThat's right.\nI want to thank the leader and Representative Allen Powell, Gary Richardson.\nI know Dale Washburn served on that study committee where we did go across the state and\nhear the importance of this issue and thank you.\nyou'll be well and ask for vice-favorable consideration.\nGentlemen, you'll be well.\nThank you for bringing this bill.\nIs there any objection to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nHere in none, the report of the committee is agreed to.\nthis bill now passed. All in favor of the passage of the bill. We'll vote yes.\nAll those opposed, we'll vote no. And the clerk, Mr. Clerk, will you unlock the machine?\nAll members voted.\nAll members voted.\nIf so the clerk will log the machine on the passage of House Bill 577 the yeas of 159\nand nays or 12 this bill having to be the requisite constitution majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 586-586?\nHouse Bill 586 by Representative Williamson of the 112th, to be entitled an act to amend Article 3, Chapter 6, in Title 48.\nThe official go to Georgia Annotated, relating intangible recording taxos to revise the note for which such taxes impose.\nThis bill I am sure the Committee on Ways and Means, that Committee recommends that this bill do pass.\nThe gentleman from Monroe is recognized to present the bill representing Bruce Williamson.\nThank you, Mr. Speaker.\nGood evening, colleagues.\nI bring for you tonight House Bill 586, which simply extends the current exemption on intangibles recording taxes from three years to seven years.\nCurrently in order to avoid these taxes, borrows are simply getting 35 month loans at the banker suggestions and then renewing after the end of three years.\nThis is the standard workaround to avoid the tax.\nThis bill would allow borrowers to fix their rate\nfor a longer term,\nthereby having interest rates certainty\nand lower monthly payments.\nIt has zero state fiscal impact\nand very limited local tax impact.\nComes without objection from any interested party\nand specifically I've met with both ACCG and GMA\nand they're all neutral on the bill.\nHappy to answer any questions asked\nif you're favourable consideration or yield the well.\nThe gentleman has no questions.\nGentlemen, is yielded the well?\nIs there any objection to the previous question being ordered?\nChair, here's none of the previous questions ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere he none.\nThe report of the committee has agreed to,\nshall this bill now pass?\nAll in favor of the passage of the bill?\nWill vote yes?\nAll those opposed?\nWill vote no?\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted, if so, the clerk will lock the machine on the\nthe passage of House Bill 586, the yeas are 170, and nay is one.\nThis bill, enter see the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption of House Bill 630?\n630.\nHouse Bill 630, by the way, now we have 120 first and others to be entitled to amend chapter 47 and title 43.\nIf it's go to George Anitetti relating to use motor vehicle and use motor vehicle park dealers\nSo as remove the use car division and the use\nParts division in the state board of registration of used motor vehicle dealers and used motor vehicle park dealers\nThis bill have referred to the committee on regulated industries that committee recommends that this bill do pass by committee substitute\nRepresenting Marcus wheat hour is recognized to present the bill chairman wheat hour\nThank you, Mr. Speaker.\nAnother licensure regulatory cutback here for this time for the State Board of Registration\nuse motor vehicle dealers and use motor vehicle park dealers.\nI will ask for your favorable consideration.\nDo you have a question to feel you, young Chairman Parsons, to your left?\nThank you.\nThanks, gentlemen.\nI recognize your question.\nJim and you.\nI do.\nI'm reading through the bill.\nIt's a 19-page bill and once you get into the list of mistaken and once you get in\nhard of it, there's a lot of language has been deleted, a lot of language has\nbeen added, and it appears from just what I've seen is basically setting up a\nnew rearranging the way that used car lots can be licensed. Is that correct or\nare they licensed new? That's correct. This is really kind of taking it from a\nlicensure to registration and just streamlining the process.\nWell, I mean, one question from me, does it change, is my understanding or memory, according\nto my member anyway, is not true that an individual can only sell so many cars from their own\nyard or their own themselves, a month or a year, whatever, is that not true under\nlaw?\nI would believe that the gentleman knows which he speaks, but what the question is, does\nJust change that it does not and if I may one more and that is does this with these changes does it decrease the amount of\nState employees at all does it change that at all as far as the number of people employed by the state? No sir does not okay. Thank you\nThank you. There's speaker. I yield the well\nGentlemen is yield the well is any objection to the previous question being ordered\nHearing none of the previous questions ordered, is there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee which was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes.\nAll those opposed will vote no.\nMr. Clerk, will you unlock the machine?\nAll members voted if so, Mr. Clerk, will you lock the machine on the passage of House\nbill 630, 630, the A's, 165, the Nays are 3, this bill haven't received a requisite constitutional\nmajority is therefore passed.\nThe rules chairman of this house insists to he be recognized one more time, and I was\nthinking to chairman parishes recognize foreign announcement.\nMiss Bigger, thank you so much for that warm introduction there, I appreciate that.\nI would ask the members of the roofs committee to meet me in 341 right now for just a few\nminutes.\nmeet the chairman in 341, this house will stand at ease, this will be a short meeting, this house will stand at ease until 915 and we will finish up our day, 915.\n",
  "updated_at": "2026-02-12T18:12:29.981029+00:00"
}