{
  "video_id": "mT0rRooWiRE",
  "url": "https://www.youtube.com/watch?v=mT0rRooWiRE",
  "title": "3/22/23 - Committee on Finance",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 20,
  "summary": "Here is a structured markdown summary of the Georgia 3/22/23 - Committee on Finance session:\n\n**Overview:**\nThis session focused on revisiting and passing House Bill 454, which contained several technical changes and adjustments to the state's tax code, including updates to the IRC, standard deduction amounts, and taxpayer options to itemize or take the standard deduction.\n\n**Key Actions:**\nNone detected.\n\n**Bills Introduced (First Reading):**\nNone detected.\n\n**Notable Moments:**\n- The committee revisited and reconsidered House Bill 86, which had previously not left the committee.\n- Chairman Black presented House Bill 454, providing an overview of the various sections and changes, including updates to the IRC, standard deductions, and taxpayer options for itemizing or taking the standard deduction.\n- Black explained the $300 per taxpayer credit included to ensure taxpayers were not worse off with the changes.\n\n**Votes:**\n- The committee voted to pass House Bill 454 with one dissenting vote.\n\n**Attendance:**\nNo specific quorum notes provided.\n\n**Adjournment:**\nNo adjournment information provided.",
  "transcript": "of finance to order. This is certainly our plan to be the last meeting of the year,\nand I'll go and do the invocation today myself. Our dear Heavenly Father, we thank you for\nall that you've blessed us with, all you've given us.\nYou've been so good to us in so many ways.\nAnd we thank you for giving us opportunities we have\nin the place we live in and the things that have been provided.\nWe ask that this committee and all of us here\nwould have wisdom to do the thing that you would provide us\nwith the ability to do those things\nand that we would listen to you in all matters.\nWe ask this all in your name and for your sake, I'm in.\nSo we're gonna look back at House Bill 86,\nthe bill that had the Aquarium and Zoo\nand something else in it.\nIt actually never left out of the committee\nand got reported out.\nSo it's still in our committee.\nAnd to revisit, I will need a motion to reconsider this.\nto reconsider this got a motion second to reconsider it any discussion I'll\nin favor say aye any opposed so you have in your folder LC 45 28 48 S which has\nsomething much sure we've got everything in there I'm not sure that the the\nThe sunset get back in, that may be the one thing that wasn't in the original.\nI believe it is, if you're looking at 24, 28, 48 us, the sunset is on the line.\nI see it now in line 60, just want to make sure they slip by me a couple of times in past\nyears.\nI make a motion to pass the Burberry Times, Jim.\nAll right.\nWe've got a motion that I accept to do pass this is there a second, second by Senator\nof it all in favor say aye.\nAye.\nAny opposed?\nThere's none and I believe that Senator Ambers, you were the, I'm sorry, Senator.\nOkay.\nAll right.\nWe've got one no vote from the committee and the motion passes with one name.\nChairman Black, when you want to come up to the committee here and there's a lot in\nthat bill for you to explain to the committee here.\nWe had a hearing last week and I think our fiscal note is in here, isn't it?\nThis is my fourth meeting in a row from higher ed to rules to health, and I left health\nearly, so I haven't had much time to go over the packet, but I've got good people working\nthat hopefully I have everything ready for it.\nSo you'll see a fiscal note in there on this bill, and we'll go with that in a little\nbit, but if you want to present first to the committee.\nSure, Mr. Chairman, thank you very much.\nBring before you house bill 454.\nLC4-3276-9S, I believe.\nIs that what you have, Mr. Chairman?\nNo, and did he get a copy of the new one?\nI apologize for that.\nI meant to do that right when I came in.\nOkay.\nSure.\nDid you find those glasses here in this room?\nI did, I had so many people tell me\nThey make me look like I have a little bit of sense.\nSo I was walking around looking, you know, dumbfounded and ignorant, I probably still do,\nbut maybe this helps just a little bit there.\nI left them here, I was, you know, practicing it.\nSo section seven, there's a couple of sections in the New Language Brother and that it should\nbe exactly what you had with the exception of the force,\nwas your definition has been modified slightly.\nWe've been continuing to work it on that one to see what will work.\nSo if you want to start on the bill.\nYes, sir.\nI will do my best here.\nsection one is as it relates to the IRC update and essentially perpetuates the ability\nfor manufacturers to expense certain things in a full year versus over a five year period\nas was adjusted at the federal level in the original IRC update.\nSo that's why that looks as it does.\nTwo through five are some technical changes and some adjustments based on some feedback\nthat we received from economists and accountants and other members regarding 1437 last year.\nThere were some realized I think revenue adjustments to the state allowed us to get the standard\ndeduction in place for married,\nfiling joint families a little earlier,\nso save them a considerable amount of money\nstarting in year one.\nI do have some, you know,\nI can dive a little bit further into this\nif you'd like me to answer as many questions as you like\nand as far into the weeds as you'd like, Mr. Chairman,\nbut ultimately it takes a $300 per taxpayer credit,\nso that's 600 for married in order to make sure\nthat we keep everybody whole and saving money\nin a very difficult environment that we have.\nI would also say, I see the final part,\nI think with regard to the forced measure,\nwas updated so that national disaster\nwould also capture what we have seen in the last three years,\nwhich is a pandemic.\nAnd is that where the adjustment\nthat you're referring to, Mr. Chairman is?\nAnd that was, that was work with the Ledge Council on and the Department of\nRevenue to make sure we felt like we had language that that did what was the\nintent of it today was best we could though we can't go retrospective and we\ncan't be gratuitous it seemed to be the best language we could do I see us you\nyou know, section seven.\nYes.\nSeven and eight is the addition that you don't have to give any explanation on.\nBut let's go over, let me summarize a little bit for the committee because I know we've\nhad a little bit of talk on this, but we already had a bill last year that would have some\nrate reductions of a tenth of a percent, eventually down to 4.99, only if certain triggers\nwere met. We didn't want to put something in that handy-campus state if the revenue\nwasn't there. So in your bill, there's a look back on what we look at to see if the\ntriggers are there, and really the administration sets the revenue so that they've got a lot\ncontrol on this but you're changing the five-year look back to a three-year look\nback in this correct. Yes, Mr. Chairman and I'll kind of if you'll allow me\nmaybe explain a little bit of how that that worked. There was some I guess\npart in part of the clarification with regards to that reduction as you can see\non page five where we struck the original language that there was some question as to whether\nor not you might skip rate reduction and it go directly to a two-tenths or a three-tenths\nor a four-tenths.\nSo as part of an offset that, you know, the look back instead of a five-year look back\nwould be a three-year look back.\nAnd you know, that was a Senate provision that we had in there, good one, I'm sure.\nAnd I thought that if there was some concern or needed to be some adjustments that that\ncould be made on the all side of the house, sir, of the building, I should say.\nAnd then you have changed, which changed to back to where I actually wanted to be last\nyear, but we're going from personal exemption amounts to new standard deduction amounts.\nthe standard deductions had been on a phase in to try to eliminate the marriage penalty\nand the way you've got it, they will be at 12 and 24 single and family and this will\neliminate the marriage penalty, certainly in the tax case.\nYes sir.\nHelps our lower middle income families I think the most in it, it does it quicker.\nAll right.\nAnd then the other substantial change is that tax payers will have the option to itemize\nor filed with a standard deduction from the federal code.\nYou want to explain that a little bit.\nIf you itemize at the federal level, then you can choose whether you want to drag your\nitemization down or if you want to take the standard deduction as an itemizer.\nAnd that was again suggested by the Society of Accountants who has written an endorsement\nletter for this portion, or all portions of the bill except for the newest that you presented\ntoday.\nOkay.\nAnd let me look, you want to talk about the $300 and why you're doing that, that tax credit.\nYeah.\nWhen you move it from the personal exemption and you bounce it off against what we have\nunder current law in 2023 and prior, what you see is that itemizers get a\nportion of the personal exemption at, you know, individual level and they get\nit married and in order to offset that personal exemption, we wanted to make\nsure that, you know, everybody's taxes were lower or, you know, reduced or zero\nand this is the number that we reach that would would accomplish that\nobjective so it would be 300 per taxpayer which means 600 for those that are\nburied following joint. Alright so it's a slight change on what we had done. Why\ndon't we go to the fiscal note on it now? Yes sir. So I do want to do a little\nof explain on that because if you go to the note, of course, this is on LC 4327693,\nwhich doesn't have the other two sections in it, but this is the financial part of it.\nIf you look at it and go across the five years, there is a line of rate reductions.\nSo if you get 20, 27, is everybody got that chart?\nOkay, if you get 20, 27, the 133.7 and my opinion was going to happen anyway because the\nrate reduction was already in process and the same on the 476.3.\nSo the new part of the bill would be everything below those lines which would be or really\njust the next line which is the 63.8156.4103.922.2 and actually a positive of 62.9 if you don't count\nthe 476 reduction or in there. Does that make sense to everybody? Y'all following me okay just\nwant to be sure we understood the fiscal note on that. All right any questions on Chairman\nblack months part of this time.\nSure.\nLet me just ask one quick.\nI always, from accounting terms, normally brackets mean one thing to us and sometimes\nit means different things.\nThe brackets on this, does that mean that's a savings to the taxpayer or does that\nmean I say savings to the government?\nThat's less government.\nLess government to the government.\nSo we save money for the taxpayer.\nSo that period of time is $415 million.\nBut again, that was already in there.\nThe 476 was already going to happen anyway\nfrom last year's tax bill.\nAnd the 133.7 was already going to happen\nfrom last year's tax bill.\nSo even though those are in there to me,\nthat's sort of not germane, but that's the way it's written.\nI agree.\nSo the standard deductions being greater at the bottom,\nobviously will help people at the bottom more like he said,\nbecause it's going to their part of it.\nGreater percentage of their income.\nRight, right.\nGood but put center albers.\nThank you, Mr. Chairman.\nChairman Blackman, I just want to say thank you\nfor your hard work on this.\ncleaning up the standard deductions and raising those,\nmaking it that you don't have to go from federal or state\nis a really big deal that most people probably won't realize\nuntil they get to that point that they have to make\nthose changes and eliminate marriage penalties.\nSo thank you.\nI know you've spent a lot of time and effort on this.\nWe really appreciate your hard work on it.\nThank you, Chairman.\nThank you very much.\nSenator Tilbury.\nThank you, Mr. Chairman.\nChairman Blamin, I want to say the same thing.\nVery rarely does a bill come before this committee\nthat I am actually in favor of.\nBut this does, what I think we're setting out to do, we want to reduce the tax burden\non everyday Georgians, regardless of their business owners or folks who are working\nat those businesses.\nAnd that's why I sometimes were very, very tough on the credits that come before this\ncommittee, because every time as you see in this fiscal note here, to reduce at a tenth\nof a percent is quite a large dollar amount and every time we're giving it away a million\ndollars or $500 million at a time we don't get to reduce the top end rate and I want to\ntell you and the members of the House thank you for sending us this or working with us\non this so that we can reduce the top end rate for everybody which will also benefit those\nGeorgia businesses.\nThank you Mr. Chairman.\nAnd Chairman Tillery's point, we do have the governor's rebate that you did, but if you\ntake that out, the one that we just passed out that our Chairman Tillery voted against\nis more than all the others that this committee has passed out added up together this year\nof new.\nThere have been some existing ones that continue of new.\n75% of the needs so it's been it's been a year really we want to really look at\nall these things closely in the off-session\nno we have it so we've got another section there I know there's several people\nBut if study this you want anybody want to go over this section\nYou want to discuss it or anybody else\nSenator Hillary. I mean I can read it for you\nI don't know that I had any pre-knowledge of it coming before now\nbut section seven\nAminza sales tax exemption and paragraph seven of code section 28 it basically says the debt added language\nIt looks like it's a sells and tangible personal tax exemption for nonprofit hospitals and the added\nlanguage in 232 through 235 just says, you know, you've got to be a non-profit hospital.\nYou've got to do inpatient hospice, so there's different things you can do.\nAnd it says further that you also cannot have been the entity or directly control an affiliate\nentity that terminated the operation of a hospital containing a level one trauma center\nand at least 200 inpatient beds after January 1st, 2021 and still be eligible for this assumption.\nI think it's a good thing. I'm for it. And this obviously deals with a with a couple of closures done in really poor areas, and I know I've heard some people on on the other on the minority caucus that have been concerned about the same issue.\nThank you, Mr. Chairman, and thank you, Chairman Tillery, for that summary.\nDoes anyone know whether those hospitals are able to roll over the exemption into future\nyears?\nBecause if they can, I'm not sure that that does enough.\nI don't know the answer that but sometimes you can roll over losses and I would I\nwould think they wouldn't be recognized but Senator Chilery will let an attorney\nanswer that. Well I'm not tax lawyer so be careful about this but I hear what\nyou're saying Senator Estavez you'd want to go further potentially go further\nI think this is a good first step also noted I think it sells and use tax so I\ndon't know that there's a roll over all sells and use tax but I would defer to\nto our esteemed legislative council in the back who might be able to say that that's true or not?\nAll right, we had a motion, I think, by Senator Albertson's going to make it to do pass this bill.\nWe've got a second by Senator Ambert Orte, any other discussion?\nall those in favor of this raise your hands any opposed one opposed we've\nhad one opposed on both of my guests now so all right motion carries and those\nare the two items for this committee we're adjourned remind the committee\nmembers that we do have our committee dinner tonight and we'll be joining ways\nIt means it's decided they would go with us and for the dinner tonight, thank you.\nYou\n",
  "updated_at": "2026-02-12T03:12:21.00194+00:00"
}