{
  "video_id": "mueHu0E4XQo",
  "url": "https://www.youtube.com/watch?v=mueHu0E4XQo",
  "title": "Appropriations Meeting for Day 27 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a structured markdown summary of the Georgia Appropriations Meeting for Day 27 of the 2025 Session:\n\n## Overview\nThis session focused on considering resolutions to compensate individuals who were wrongfully incarcerated. Several cases involving issues like self-defense, manufactured evidence, and juror misconduct were discussed.\n\n## Key Actions\n**HR 119**: Resolution to compensate Mario Stinchcomb for 18 years of wrongful incarceration after he was exonerated by the Fulton Conviction Integrity Unit.  \n**HR 118**: Resolution to compensate Michael Woolfolk for wrongful incarceration after he was exonerated.  \n**HR 129**: Resolution to compensate Daryl Lee Clark for 25 years of wrongful incarceration due to issues like manufactured evidence and witness coercion.  \n**HR 128**: Resolution to compensate Joseph \"Joey\" Samuel Watkins for wrongful incarceration due to juror misconduct and buried exculpatory evidence.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Discussions of the tragic circumstances and injustices faced by the individuals who were wrongfully incarcerated.\n- Appreciation expressed for the previous support these resolutions received in the House.\n- Descriptions of the various issues that led to the wrongful convictions, including self-defense evidence, coerced testimony, and Brady violations.\n\n## Votes\n- HR 119 (Stinchcomb compensation): Passed\n- HR 118 (Woolfolk compensation): Passed  \n- HR 129 (Clark compensation): Passed\n- HR 128 (Watkins compensation): Not voted on\n\n## Attendance\nA quorum was present to conduct business.\n\n## Adjournment\nThe session adjourned, with the next session date not specified.",
  "transcript": "Good morning, it is a little a little past eight and we do have a quorum, so I would like to get started after I ask Chairman Meeks to open us up with prayer.\nLet's pray.\nDear Heavenly Father, we thank you for this day.\nWe thank you for the opportunity to once again do the people's work of our state.\nWe pray that you will be amidst the decisions that we make, help us guide us, guide us\nand direct us and continue to be with former chairman, Terry England, our friend as he\nrecovers from the injuries to your Heavenly Father.\nWe speak with our family.\nThat's at home.\nKeep them safe.\nUntil we return.\nThese are all our blessings.\nWe ask in your name, amen.\nday is a special day. Not only is it my oldest daughter's 29th birthday, Emily, it's also\nRepson of Debbie Butner's birthday. So happy birthday to everybody. And so y'all know\nshe is taking selfies. As many selfies as she is old and I did not ask her how many selfies\nshe was going to take so all right well thank y'all glad you're here this morning\nfirst up we'll have representative Stacy Evans HR 118 and I just do want to\nmind everybody we do have to be out of here in an hour hope it doesn't take that\nlong but we do have a one hour deadline I should be able to contribute to that\nMr. Chairman good morning Mr. Chairman members of the committee I have two\nresolutions and if it's okay with the chairman I'd like to start with HR 119\nsort of 118 just for fun this morning. So we're on HR 119 first. Yes thank you\nMr. Chairman. HR 119 is a resolution that we've heard before in this\ncommittee and passed out both in this committee and on the House floor but\nbriefly this resolution would compensate Mario's gents come. He was the first\nexoneration by the Fulton Conviction Integrity Unit. He shot in self-defense\nHe maintained from the beginning of the charge that it was self-defense physical evidence has always supported the testimony that the shooting was in self-defense\nThere was a key witness to the murder that was believed to be dead and therefore the jury did not hear his crucial testimony\n14 years after Mr. Stinch comes in carceration\nIt was discovered that the key witness was not deceased\nAs previously believed and then when he was brought in he corroborated that the shooting was indeed in response to\nthe victim shooting first and that's supporting the self-defense defense which\nagain was also supported always by physical evidence. So Mr. Stinchcom spent\n18 years in prison for a crime that he did not commit. Of course, Miss Time\nwith Family, Prime Erning Years during employment and all the pleasures of\nlife that we enjoy. He's done his best to put his life back together since this\nand I humbly ask for compensation under this resolution for Mr. Stinchcom and\nhappy to take any questions Mr. Chairman. Are there any questions? I don't see any\nquestions. We have a motion to do pass is there a second? We have a second. All those in\nfavor of passage of LC-60-053-HR, say aye.\nAny opposed?\nMotion carries.\nThank you, Mr. Chairman and members of the committee.\nNext up is HR-118.\nThis is a resolution to compensate Michael Wolfhoek for wrongful after his exoneration.\nMr. Wolfhoek was involved in the same incident with Mr. Stinchcom. They were co-defendants and\nMr. Stinchcom went through the Fulton\nConviction Integrity Unit first and then Mr. Wolfhoek went second, but same issue self-defense physical evidence always supported\nSelf-defense and he was also exonerated by the Fulton conviction integrity unit and asked for your favorable consideration. Happy to answer any questions\nI do have a question about the these resolutions we heard last year, correct?\nYes, that's the gentleman. We're here during the testimony, right?\nYes, both gentlemen were actually here during the subcommittee where they passed.\nAnd both of these resolutions passed last year, both in this committee and on the House floor.\nBoth Mr. Stinchcomb and Mr. Woolfolk drive trucks for a living.\nAnd so they do their best to be here when they can, but sometimes they can.\nAre there any questions?\nWhat's the pleasure?\nI have a motion, do pass, and a second on the LC60, 0, 0, 5, 4, House Resolution 118.\nAll those in favor say aye.\nAny opposed?\nMotion carries.\nThank you.\nThank you.\nThank you.\nNext up is House Resolution 129.\nMr. Chairman and members of the committee do appreciate this opportunity it is an honor\nactually to stand here and try to write this wrong that happened in my community so long\nago.\nSo 129 involves the case for Mr. Daryl Lee Clark at the time of the crime he was 17 years\nold.\nThe case involves Russian Roulette.\nHe was not present when this happened.\nIt involves tragedy, I would say, that happened.\nAnd the process of his trial where there was a sexual relationship\nwith the lead detective having an ongoing relationship\nwith the victims and there was manufactured evidence,\nwhich included fault statements.\nIt involved a defendant who was, excuse me, a witness who was deaf, mute, and severely\nlearning impaired, who had no use of regular sign language.\nSpecial interpreters were not involved in the case to help understand what happened.\nThere was witness intimidation and coercion.\nThe detective threatened and coerced another witness in the giving false and perjured testimony.\nThere was false testimony when the detective testified falsely at trial as did the coerce\nwitness.\nThere were Brady violations.\nThis was a very, very sad case, I think, as I look back on it.\nMr. Clark lost 25 years of his life.\nWhen the state makes a mistake, I do feel strongly that it is ours to try to go back and compensate.\nYou cannot correct anyone's lost life, lost years of learning, lost years of working,\nlost years of time to have a family and relationships.\nThe dollar amount will never compensate the years that were lost for Mr. Clark.\nI do ask, this was hard last year, I appreciate the sport that was there, they passed out\nof the house with this resolution passed out of the house with 162 yeses and two\nnoses. They were present here for the previous hearing. They were up in the\ngallery last year and it was a privilege to be among you as we all stood at our\nspeakers support to raise to stand up and applaud the findings and the vote for\nthem. So I ask for your humble support for this compensation resolution for Mr. Cluck.\nAre there any questions? I don't see any votes to pleasure in the committee. We have a motion\nAnd a second, for due pass of LC-60-005\nto House Resolution 1-29, all those in favor say aye.\nAny opposed?\nMotion carried.\nNext up is House Resolution 1-28, Chairman Dempsey.\nThis is also for another case that\nhappened in this similar time frame with many of the same people\ninvolved through the courts and legal system, an investigative system.\nFor Mr. Joseph Joey, Samuel Watkins, Mr. Watkins was accused of a crime where he was not\neven present.\nThe record show, when uncovered in a truthful way, that he could not have physically been\nin a car in the same space where the victim was shot in another car.\nHe was 18 years old at the time, yeah, the case involved, juror misconduct during deliberations\nof juror conducted an erroneous drive test involving cell evidence prompting her to convict\nthe other jurors and to let them know of the test when you are a juror, you are not supposed\nto do that.\nBuried evidence, the state failed to disclose that the police request the GBI extracted a\nbullet from a dog found near the victim's grave, compared it to the nine-millimeter bullet\nrecovered from Mr. Dawkins' determining it did not match, yet the state agrargued.\nMr. Watkins committed both crimes as a signature or a calling card to place this dog on the\ngrave of the victim.\nfault statement of testimony at trial by a GBI investigation's analyst gave\nobjectively false testimony relating to forensic tests conducted on the\ngrave dog. The state also asserted that no bullet was extracted from the dog and\nthus its caliber wasn't known despite the fact that the GBI analyst had\nbrought the bullet to court. There are a lot of things going on at this time\nin both of these cases involved.\nSome pretty sad situations.\nOne of the, I would say, one of the most pivotal people\ninvolved is not a lot today.\nHe's deceased, but before that happened,\nhe lost his post-certification for other incidents\nthat he had been involved in.\nA humbly ask that you once again, as you did before,\nsupport Mr. Watkins last year on the floor,\nthis was passed by a vote of 162 yeses\ntwo notes. Are there any questions? No question? All right. What is the pleasure of the committee?\nEmotion of the second to do pass LC 60 0 0 5 1 H R 128 all those in favor say aye.\nWhy?\nAny opposed?\nMotion carries.\nMotion carries.\nThank you.\nI think that's it.\nThat's all.\nWe're adjourned.\nHave a great day.\nThank you.\n",
  "updated_at": "2026-02-12T18:30:22.122776+00:00"
}