{
  "video_id": "MwHn68pVw-Q",
  "url": "https://www.youtube.com/watch?v=MwHn68pVw-Q",
  "title": "Senate Day 38 of the 2025 Legislative Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 83,
  "summary": "Here is a structured markdown summary of the Georgia Senate Day 38 session:\n\n# Overview\nThis session featured the introduction of several bills and resolutions, as well as procedural discussions and votes. The notable aspects include the introduction of HB 150 and a discussion around excusing certain senators from the session.\n\n# Key Actions\n**HB 150**: Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Bills Introduced (First Reading)\n- SR 431 by Sen. Harold - Study committee on social media/AI impact on children\n- SR 476 by Sen. Halperin - Study committee on local school system flexibility options  \n- SR 49 by Sen. Dixon - Study committee on inclusive educational settings for students with disabilities\n- HB 651 by Rep. Powell - Motor vehicles - use of automated traffic enforcement safety devices in school zones\n\n# Notable Moments\n- Prayer and Pledge of Allegiance led by Sen. Jones, who introduced his son Elim Jones as the guest pastor for the day.\n- Discussions around excusing absences of several senators.\n\n# Votes\nNo recorded votes mentioned in the transcript.\n\n# Attendance\nQuorum was present, with requests made to excuse several senators from the session.\n\n# Adjournment\nThe transcript does not explicitly state when the session adjourned or the date of the next session.",
  "transcript": "sino and consideration last legislation, as your recommendation the same\nbed to center with a final recommendationmu\nTo center resolution for 31 due past by substitute center resolution for 67 as\nresolution for a deny the past house or 14 do pass bridges but\none on 5 do pass bus bus 17 two pass by subjectsGood\nOnce the ketchup\nLogizca\nThe\nnumber 45 due pass by substitute.\nHousehold 454 due pass, Household 483 due pass by substitute.\nHousehold 651 due pass by substitute.\nHousehold 652 due pass by substitute.\nWe respectfully submit it, Senator Brass,\nthe sixth district chairman.\nThe members of the secretary,\nthe Senate roll two, the shone point six,\nI hear by give notice I will introduce\na minority part to be along with the majority of the Household\nof 43, which is passed by the Committee on Rules\non March 31st, 2025, since they are the Senate Jones.\nMr. President, the Senate Committee\nand the State and the Whole Government of Operations\nhas had our own consideration on the legislation\nStewart astronomy board the same with the FOAM recommendation.\nWe set a bill 358 in 2 pass Senate bill 358-9J pass, House excess-749-9J pass, House\nbull 750, 2 pass side hips to House bull 774J pass House bill estimate.\nWe want to pass House bull 785-2 pass House bull 788-2 pass House bull 789-2 pass House\nbull 790-2 pass House bull 794-2 pass House bull 797-2 pass House bull 798-2 pass Senate\nbill 356-2 pass House bull 772J pass House bull 780-2 pass House bull 787-2 pass House\nthe VAS Hospital 791, VAS Hospital 793, Dupasters,\nwe have submitted Senator Dixon to the 45th district,\nchairman, that can be seen, the order, Mr. President.\nSecretary Rebuilds and resolutions for the second time.\nSenator resolution 431 by Senator Harold,\nthe 40th and others, send an impact to social media\nand artificial intelligence on children\nand platform privacy protection study committee,\ncreate Senator resolution 476 by Senator Halperin\nof 39th and others, send a study committee\non local school system flexibility options,\ncreate Senator resolution 49 by Senator Dixon,\nthe 45th and others, send a study committee\non inclusive educational settings for students\nwith disabilities create a hospital 225\nrepresent a watch for one 44th and others.\nMotor vehicles enforcement is speeding violations\nand school zones through automated traffic\nenforcement safety devices or appeal all laws.\nHouse bill six 51 by representative Powell\nof the 33rd and others motor vehicles\nuse of automated traffic enforcement safety devices\nand school zones rise provisions.\nMr. President, that completes the order.\nIt is now time for the morning roll call.\nany motion to excuse we're going to\nask Senator from the 45th. Thank you\nMr. President I ask for unanimous\nconsent to excuse the senator from\nthe 46th for business outside the\nCapitol. I'm Jackson from the 46th of\nthe excuse. We're going to ask\nsenator from the 6th. Thank you\nMr. President I ask for unanimous\nconsent to excuse the senator from\nthe 27th and the senator from the\n46th. Oh he's already been excused.\nThat adjacent center from the 27th of the excuse recognize center from the 33rd\nGood morning, mr. President y'all somebody gave me a note here to say to excuse the senator from the 33rd\nThat would be you senator\nAll right\nIt is now time for the one-of-roll call and the secretary will call the roll senators\nsignify your presence by voting the A switch secretary will unlock the machines.\nYou\nIt is now time for our morning devotion, if the door keeper is skewered, the chamber\nat this time and all on, I'll ask it all an unauthorized personnel exit, the chamber\nas well. We have a very special guest with us today. I know he's very special to the\nsenator that will be introducing him. So, and I recognize the senator from the 10th\nto introduce, to lead us in our pleasure legents and introduce our pastor of the day.\nThank you, Mr. President. I'll stand and pledge allegiance to the flag.\nI pledge allegiance to the flag of the United States of America and to the Republic of\nAnd now to Georgia Flag, I pledge allegiance to Georgia Flag in front of all of you who\nstand.\nPlease give justice for our worship.\nGood morning and it is one of those moments when you have an opportunity to do something\nthat you know just kind of resonates in your spirit and in your soul. Today, I have an opportunity\nto introduce my son who is our pastor of the day. Elim Jones who is a young 30 years old\ngot ordained when he was 21 years old in the Baptist faith by my pastor in MacDonald Georgia.\nHe's since gone on to do great things with his life and just to share a few of those things.\nAnd I would try not to get choked up because he is an exceptional young man.\nAnd not only is Elim an exceptional young man, but he is an exceptional pastor as well.\nWell, Elam currently attends Harvard University.\nHe's studying for his, he's gotten his master's\nindependent from Harvard.\nHe got his, he's currently studying for his\ndoctorate independent from Harvard.\nAnd he's also in the law school of Harvard University\nup in Boston.\nWhen I'd say it's exceptional, he really is an\nexceptional young man.\n21 years that I've served in his body, my kids have\nliterally grown up with me in this chamber.\nAnd I can say to all of you that when your time comes\nand you look back on those moments,\nI just pray that you'd never ever forget\nthe experience, not just that you had in this body,\nbut also the experience that your family had as well.\nElam is joined by members of my family\nand I'm taking the liberty, Mr. President.\nI do apologize, but my daughter who is the doctor today,\nShe's in Portland, Oregon at the National University\nof Natural Medicine.\nI'm also joined by my son's wife, Miss Asia Jones,\nwho is studying her PhD at Berkeley, California,\nand I understand Cal Berkeley she has one more year\nto complete her PhD in psychology and sociology.\nAnd I'm honored that my matriarch of our family,\nmy aunt, Janelle, who was gracious enough\nto come up here and join my two kids\nas they are featured here today.\nAnd this moment would not have been possible\nwithout my sister who stands right next to my aunt.\nAnd one of the things that we all have shared growing up\nis a closeness in our family.\nI always say to people that we didn't have much,\nbut we always had each other, and that's all we need.\nPlease join me in welcoming my son, Helum Jones,\nour pastor today.\nTo Lieutenant Governor Jones and to the Honorable Emanuel Jones, who graciously invited me to speak\nin this chamber once more, and to the members of the Georgia State Senate and all who have\ngathered today. It is both a privilege and an honor to address you this morning. I'd like\nto take up a word from the Lord found in the book of Micah, the sixth chapter, verse 8, and\nthe story that unfolds in the pages directly preceding it. This places us within a narrative\nset long after the division of the land of ancient Israelites into the Northern Kingdom\nof Israel and Judah to the South, following a long period of relative peace, both kingdoms\nalong with surrounding nations found themselves facing increasing pressure from powerful and\nrapidly expanding neighboring empires.\nThe book further locates us in a small town in the South, where the prophet Micah, serving\nas a messenger of God delivers a powerful and piercing message to the kingdom's leaders.\nAccusing them of a massing wealth through theft and intimidation, he condemns the deep\ninjustices that have taken root in their society, where bribery governs the land.\nThis is twisted to favor the wealthy and the poor are robbed of their property, their\nsecurity, and their hope.\nAs Micah declares, these are the kinds of profound systemic wrongs that have left unchallenged\nin any nation where the thousands of years ago or today were surely destroyed both the\nland and its people.\nHe goes on to reveal that the severity of this corruption is made even worse by Israel's\nown prophets, who have fallen prey to greed and dishonesty.\nThese social commentators and political pundits of the day, no longer speaking truth and\nlove, have turned their sacred role into a business.\nThey promise divine protection for anyone who can afford it.\nMicah makes it unmistakably clear, God has withdrawn his protection, the divine favor that\none shielded the nation has been lifted, and the consequences of their corruption are\nnow unavoidable.\nHowever all is not lost.\nThrough a beautiful series of poetic promises about the future, Micah speaks of the hope\nthey can still be found that the people choose to reform their ways.\nAnd his now famous words, Michael declares in verse 8,\nhe has shown you, O mortal, what is good and what does the Lord require of you to act\njustly, and to love mercy, and to walk humbly with your God, justice, mercy, and humility.\nVisionary social activists and co-founder of the Catholic social worker movement, Dorothy\nday dedicated her life to serving the poor, advocating for peace, and fighting for social\njustice through direct action. Her tireless commitment to living out the teachings of\nher faith in the most challenging circumstances earned her a unanimous recommendation for\ncanonization as a saint in 2012. The highest honor in the Catholic Church but had Dorothy\nbeen alive, she likely would have refused it. In fact, Dorothy was often quoted for saying,\ndon't call me a saint. I don't want to be dismissed so easily. As she saw it, the everyday exercise\nof justice, mercy, and humility, in her case recycling food from a dumpster, sleeping on a stinky\nprison floor and going to mass every afternoon\nshould not be reserved for the exceptional among us.\nIn her words, we are all called to be saints\nin the priesthood of the lady.\nLikewise, I stand here today to remind all of you\nin this room that you are all called to be change makers\nand the legislature of Georgia.\nThis responsibility is not reserved only\nfor the boldest among you, or for the most idealistic,\nbut for each and every one of you.\nIn a time that features many of the injustices\nexperienced by Micah many centuries ago,\nit is all of you who we rely upon to set an example\nand to ensure that we are on the proper course.\nAs the late President Jimmy Carter once said,\nThe way to enhance freedom and prosperity in other lands,\nbe it abroad or just north in our nation's capital,\nis to demonstrate here that our democratic system\nis worthy of emulation.\nSo just as Micah asked of the ancient Israelites long ago,\nI conclude by asking you to do justice,\nand to love mercy, and to walk humbly\nwith the God of your understanding.\nLet us pray.\nDear Lord, thank you for the members of this assembly.\nI ask that you always be present with them,\ntheir families, and those they represent.\nGuiding them to make good, wise, and ethical decisions\non behalf of all who live in Georgia\nand reminding each one of their calls to be change-makers\nin the spirit of justice, mercy, and humility.\nI pray this in your name.\nAmen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nto recognize the senator from the 38th to introduce our doctor of the day senator.\nAll right good morning colleagues. I am very excited to once again welcome back Dr. John Gleason to the Senate.\nHe is racking up his points here in the Senate as he is a frequent doctor of the day here.\nSo very excited to have him.\nHe's an orthopedic surgeon at Resurgence Orthopedics, resident of Atlanta and graduate of McNeese State\nUniversity in Louisiana and got his medical degree from Louisiana State University.\nI am going to be short on this because we're going to have him back here this week and so\nI'm very pleased to welcome Dr. John Gleason\nas our doctor of the day.\nThank you all.\nThank you for your hard work,\nand I know y'all got a busy week,\nand Friday will be a glorious day,\nand as Senator Kemp stated,\nif I make it down here one more time,\nI get to be his concierge doctor.\nThank you.\nYou\nJones from the 10th he brought all his a lot of it not all of them, but a lot of his distinguished children down here and and one\nyoung lady behind me is\nDoctor soon be Dr. Jones and\nI just wanted to recognize her because she will be being the\nDoctor of the day very very soon. We weren't able to get her today, but we're going to recognize her anyway\nHi, good morning everyone. My name is Yvmani Sutton. I am a graduate of Vanderbilt University\nand currently I'm a third year medical student at the National University of Natural Medicine\nin Portland, Oregon. So, Natural Pathetic Medicine, it's not well known here but it's a holistic\napproach to medical care. That emphasizes natural therapies, prevention and supporting the\nbody's ability to heal itself.\nSo currently I'm learning conventional medicine\nand combination with more natural modalities.\nSo that includes herbal medicine, homeopathy,\nand physical medicine.\nCurrently there are 26 jurisdictions,\nincluding DC and Puerto Rico, that\nhave licensure for naturopathic physicians.\nAnd currently there are 17 states that\nthey're pushing for legislation for licensure.\nAnd Georgia is on neither of those lists yet.\nSo today I'm hoping to spread some awareness\nof naturopathic medicine if you have any questions.\nI would encourage you to reference naturopathic.org.\nThat's in ATUR-OPATHIC.org, where you can talk to me after this.\nThank you very much.\nThank you very much.\nAre there any unanimous consents?\nDoes any senator withdraw on a point of personal privilege?\nWe're going to have a senator from the 8th.\nWell, thank you, Mr. Chairman.\nToday is a special day in our family because my son, J.R.,\nwho's in the chamber with us, turns 21 today.\ntoday. And let me tell you, you all know about 10 years ago, he was electrocuted in the\nswimming pool when a friend of mine says if what he's seen the movies is true, that J.R.\nshould have superpowers. But he's certainly one of my heroes. I have a\ncommendation here from the governor for J.R. Says John Reston Goodman is a proud\nGeorgia citizen who celebrates his 21st birthday on March 31st, 2025 and\nwhere has an eighth-generation South Georgia farmer,\nJohn has received multiple state and national FFA awards\nfor diversified agricultural proficiency,\nand whereas he is a lifelong UGA superfan,\nand is currently a junior at the University\nstudying agricultural economics.\nHe's a member and passed Vice-Nobal Rule\nof Alumni Relations of Alpha Gamma Row Agricultural\nFerturnity, and whereas he is the son of a state-centered\nwith an interest in public service himself,\nhe has further offered his talents to the state of Georgia\nthrough an internship at the State Capitol,\nthe Georgia Agor Business Council during the spring 2025\nlegislative session.\nAnd whereas John is truly a great American\nand a damn good dog, and it is an honor to recognize him\non his 21st birthday and to wish him well\nand all his future endeavors now, therefore,\nI, Brian P. Kemp, Governor of the State of Georgia,\ndo by here by command, Mr. John Rustin Goodman.\nJR, we love you, buddy.\nProud of you.\nAnd thank you, Mr. President, for allowing me the opportunity.\nI yield the whale.\nThank you, Mr. President.\nA good friend of mine is sitting up in the gallery.\nA father, a leader, and a great man.\nI want to honor John Cohen upon his induction\nin the Roswell High School Hall of Fame\nand the Georgia Dugout baseball Hall of Fame.\nFor over six decades, 60 years,\nJohn has embodied the heart of leadership, humble,\nimpactful, and always putting others before himself.\nThrough his dedication, he has shaped the lives\nof countless young men, not only as an exceptional coach\ncoach but also as a mentor and a strong male role model. In a world where humble\nleadership is needed more than ever. John's example stands as a testament to the\ntrue power of servant leadership. Congratulations John and thank you for your\nremarkable leadership we're all better for it. I yield the one.\nThank you, Mr. President. Mr. President, I am very pleased today to have here visiting representatives from the City of Brunswick.\nThey have a very nice bill on our consent calendar for a new home set exemption for the homeowners in Brunswick, Georgia\nBut if I might I'd like to recognize my believe there up here to my left in the gallery. I have Mayor Cosby Johnson\nMost of you know Cosby from his work with the state chamber. I have Mayor Pro Tem, Felicia Harris\nI have two commissioners, Commissioner Gwen Atkinson-Williams, and Commissioner Kendra-Roll.\nThey have some family members with them, and they're representative Tyler Lewis, so welcome folks from Brunswick.\nWe appreciate you.\nGive them a hand.\nThank you, Mr. President, and you're all the well.\nI'm very excited today to recognize someone that everybody in this room knows, a dear friend\nof mine for over 24 years, Lynn Riley.\nit is bittersweet to commemorate your extraordinary service as you retire after all your selfless\nsacrifice. I remember when I first met Lynn all those years ago she was kind enough to sit\non the board of one of my companies and then I remember when she told me she was going to run for\nthe Fulton County Commission and we started putting signs up my first time putting signs in the ground\nfollowed by her great service there we were both elected at the state time to the General Assembly\nwhere she served in the State House of Representatives and was one of Governor Deal's four leaders.\nShe was then tapped by Governor Deal to move on to several important positions.\nIn fact, she was the first female to serve as a Georgia State Treasurer and the Georgia State\nRevenue Commissioner. In her current role, though, she awarded $4.3 billion to her 459,000 students\nthrough the Holt Scholarship Program and has worked very closely with Governor Kemp and played\na vital role in creating the Georgia Match Program where the largest one run direct missions,\nprograms, and most successful in the entire country. Lin's accomplishments are extraordinary\nin her 21 years of service, but I know her well and sitting next to her, her husband Mike,\nher children and boy she is one wonderful doding grandmother who is put her\nvalues right in the proper place so ladies and gentlemen I ask everyone in\nthe Senate to please rise and give a rounding applause to Lynn Riley.\nThank you.\nWe have a special group with us here today, my good friend Jim Cole and his athletic director\ndown at Mercer University and his daughter Caroline is with us today who's in law school\nthere she but she worked several years here in the Senate both for my office and\nalso Senator Brass or Senator from the the rules chairman's office and did a\ngood job but we have today with us the football coach and a couple of players\nwhere I can tell you right now these these boys at Mercer the Mercer Bears they\nthey're not afraid to play anybody they'll go to Tuscaloosa they'll go to\nAuburn Alabama they they even want to go to Athens Georgia but Athens won't\nSo we're going to have to get him, we're going to get on coach smart about that, but we just want to recognize them and what a fine job that Jim Cole and his, his group were doing down at Mercer and just, you know, just talk about brag on them a little bit on what they're doing and everything, the young student athletes that they're putting out down at that school in Macon, Georgia and to talk more about it, I'll recognize the, the protein from, from Macon.\nSenator from the 18th.\nThank you, Mr. President.\nGood morning, colleagues.\nYou know, I rise today to, with some great pride to recognize the team as the President\njust spoke of.\nIt's got grit, discipline, and heart, and it captured not only our attention, but also\na Southern Conference title.\nI'm talking about none other than the Mercer Bears football team, who delivered an outstanding\n2024 season this past year, finishing with an impressive 11-3 overall record and securing\na Southern Conference Championship with a seven-to-one conference record.\nLed by the first-year head coach, Mike Jacobs, who's with us up here, led the bears and\nshowed what determination and leadership looks like, not only on, but also off the field.\nThey advanced to the NCAA division, won FCS playoffs, and competed all the way to the\nquarterfinals, proving that Macon's not just about good music and history, but also some\nchampionship football.\nNow, let's talk about some dominance.\nThe team went on to be undefeated at home with a 7-0 record at 5-star stadium, and the\nBears gave their fans a real season to remember.\nOn the floor, so many of y'all recognized Jim Cole behind us at the president recognized\nyou.\nRemember, some of you that have been here a while at Jim Cole's service over in the house\nfor many years.\nMike Jacobs, the first-year head coach that we're proud to have at Mercer, Isaac Dowling,\nthe team captain, and then Riley Adcock, coach Jacobs, you have built something special\nin your very first year at Mercer and this Senate is very proud to recognize you.\nY'all give a warm welcome for the Mercer Bears football team and I'll ask the coach if he wants to say something.\nThank you very much.\nThank you very much.\nGood morning. We appreciate everybody having us here.\nThis is a tremendous honor to not only represent Mercer, but the city of Macon\nand really fortunate for the strong leadership at our university, President Bill Underwood\nand certainly our athletic director, Jim Cole,\nwho many of you know.\nBut really, all the thanks go to our players\nand we have some tremendous ones behind us,\nsome bears that are getting ready\nto graduate and move on in the world,\nbut they've accomplished quite a bit in their time with us.\nRiley was a 50 game starter for us.\nHe's the top engineering student\nin the Civil Engineering program at Mercy University.\nIsaac also started over 40 games for Mercer football\nand we're trying to get him one more year right now.\nSo we really appreciate this.\nThis is quite an honor for us to be standing before you today\nand on behalf of all of Mercer and Macon,\nwe appreciate you all.\nThank you.\nThank you very much.\nYou\nI see one of our former members, Senator Mitch C. Balls here today.\nLet's give Mitch a big round of applause.\nGood to have you Mitch.\nAnd see if you can do something with the senator from the six over there.\nI know you've been a mentor to him.\nThank you, Mr. President, colleagues, I'm going to share with you a short history lesson\nand a trivia question.\nIn honor of the Center from the 21st,\nI wanna make you aware of how Washington, DC\nbecame Washington, DC.\nMy name is Burns.\nWe trace our family back to Scotland,\nto the Burness clan, which means by a stream or a brook,\na burn, it's changed the name of the spelling several times,\nyou are NES, was the spelling at the time that Washington DC was created.\nMy great-great-great-great-grandfather was David Burns.\nHe inherited what is now Washington DC from his grandfather, a first-generation immigrant\nScotsman.\nBurns served as a second lieutenant in the first Maryland Brigades of the Continental Army\nin the Revolutionary War.\nAfter the war, Burns and his family lived in a cottage in what is now the National Mall.\nIn the late 18th century, Burns and 14 other landowners negotiated with George Washington\nto sell their land to the government for the creation of what is now the city of Washington\nDC.\nPresident Washington commonly referred to Burns as the obstinate Mr. Burns.\nFor a shrewd and bold negotiating style, Burns and Washington and other landowners came\nto turn in terms in 1791, completing the sale.\nThe former Burns Land, it was 600 acres on the Potomac River on Potunt River, includes\nall our part of what is now the White House, the Treasury Building, the Eclipse, the Washington\nMonument, and most of the Washington Mall.\nIn subsequent years, the Burns family changed their spelling to B-U-R-N-S.\nSome of them moved to Georgia and I was one of those.\nSo, here's the history lesson.\nThis is the oldest cottage in Washington, D.C. the Burns cottage.\nAnd the trivia question is, when someone says, where did Washington receive the land\nto create Washington, D.C. it was the Burns farm.\nThank you, Mr. President, I yield a well.\nwould credit roll mail to\nthe\ntwenty works it has been\na\nYou have before you consent calendar a privilege resolutions does any senator were to remove a\nresolution from the consent calendar\nIs there objection to the adoption of the resolution on the consent calendar?\nChair here's none the resolution on consent calendar is a double\nAre there any motions to withdraw and commit?\nYou have before you consent calendar of local bills, Mr. Secretary, have any any objections?\nMr. President and the objections have been filed.\nIs there objection to agree to the report of the committee on the state and local government\noperations, which is available to the passes of the bill on the local consent calendar?\nChair, here's none.\nThe report of the committee has agreed to.\nQuestions on the passes of the bill on the local consent calendar, all those in favor of\nWe'll vote yea, I'll oppose nay, Secretary will not the machine.\nYou\nOn the passes of the bills, the A's are 49, the A's are 0.\nThis bill on the bills on the local consent calendar have received requisite constitutions\nand majority therefore pass.\nWe're going to ask the senator, the majority leader for motion.\nMr. President, I ask for unanimous consent that the following bills be engrossed at this\ntime House Bill 144, House Bill 153, and House Bill 511.\nSecretary, read the caption.\nHouse Bill 144, we're representing the 127th and others, bill is being counted 9 to\nmen, chapter 7, title 40, and the official color of Georgia, annotate about your income\ntaxes.\nSo that's where rising tax credit for certain medical receptive rotations, that dentistry\nto increase the value of the tax credit to rise definitions, right for an annual cap,\nto extend the sunset provision of tax credit to rise for related matters, right for\nof adequate date and applicability to work out the working laws and for other purposes.\nHustle 153, representative camp with 135th and others, built to be Title 9 to Menco Section 48-8-3.2,\nthe fish footage which annotated what you sales and use tax exemptions for manufacturing\nequipment and industrial materials, packing supplies and energy, so as to extend the sunset date\nfor an exemption for maintenance and replacement parts, for machinery or equipment used to mix\nor transport concrete to provide for later matters for working laws and for other purposes.\nHouse will 511% of looms in the 12th and others will terminate to men chapter 32,\ntitle 33, you have code section 48-7-27, the official code of George annotated,\nonly two property insurance and computation of taxable net income respectively,\nso as to arrive for deductions of from taxable income for contributions,\nwhite tax fares, to catastrophe savings, accounts, and interest earned on such accounts\nto establish limits for contributions to such amounts,\nsurvivor definitions, survivor label matters, survivor defective date and\napplicability to be able to look in laws and for other purposes,\nMr. President, that completes the order.\nHere's the objection.\nHere's the objection.\nYou wish to speak to it, Senator.\nNo speaking, OK.\nMajority Leader, would you like to speak to your motion?\nOkay.\nAll right.\nThe motion is two in gross.\nWe do have objection.\nAll those in favor of grossing will vote yay.\nI'll oppose nay, sectarian, and launch machine.\nYou\nOn the motion to engross the A's are 30 and the A's are 20 and this motion has prevailed.\nAll in to the rules calendar, Secretary, please read House bill 360.\nI'm sorry. House bill 114.\nHouse bill 114.\nWe're about to send a mic down to the 26 and others.\nThe bill is being timed back to men.\nCode section 4-1-8.\nWe'll do safe operation of motor carriers, commercial motor vehicles, and drivers and safe\ntravelers.\nTransportation of hazardous materials.\nSo let's update the reference date to federal regulations regarding the safe operation of motor carriers and commercial motor vehicles.\nIt provides the definitions for later matters to look at the laws and further purposes.\nMr. President, the Senate Committee on Transportation recommends that this bill do pass.\nSo I believe it's in our dollars all chairman that can be seen.\nOrder, Mr. President.\nReagan has Senator from the 29th.\nFriends, as we move into the last week of the legislative session, we tend to run into\na lot of these types of legislation that are more regulatory than anything we've run\ninto so far.\nThis is exactly what that is.\nThis deals with the present regulations on moving hazardous materials around Georgia,\nto ask in that identifies the regulations under 49 CFR to keep them in force so we're changing\nthe date from January 1st, 2024 to January 1st, 2025. Thank you, Mr. President. With that, I will yield the\nWell.\nIs any other senator which speak for against the measure?\nChair, here's none.\nIs there objections, previous question being ordered?\nChair, here's none, and previous question is ordered.\nIs there objections or readings to the board of committee\nwhich is favorable to the passes of the bill?\nChair, here's none, the board of committee is agreed to.\nIs there objections to the main question being ordered?\nChair, here's none, and the main question is ordered.\nquestions on the passes of the bill. All those who favor the bill vote yeah you\npose name secretary well-in-lawed the machine.\nAll in the past of the bill, the A's, our feet to two, the A's, our zero, this bill\nhaven't received requests that constitute for majorities there for a pass.\nSecretary, please read House Bill 116.\nClassable 116 team, representative McDonald,\nthe 26th and others, built between 10 and 9 to men,\nArticle 5, chapter 2, title 35, and title 40\nof the fiscal adjoice and table to motor care compliance\ndivision of the Department of Public Safety\nand motor vehicles and traffic respectively.\nSo, I have to change the name of the motor carrier\ncompliance division of the Department of Public Safety\nto commercial vehicle enforcement,\nJoe Karelo and enforcement officers within such division\nto be trained, sworn and certified,\nto drive for conforming changes, to drive for later matters\nto be able to look in laws and for other purposes.\nMr. President, the Senate Committee on Transportation\nrecommends that this bill do pass,\njust hopefully some minutes.\nThey're in Dulles Old Chairman.\nThey complete the order.\nMr. President.\nWe're going to sit in front of the 29th.\nThank you, Mr. President.\nGood morning, everybody.\nIt's been a while.\nHouse Bill 116 does two things.\nThe primary thing is it changes the name\nof the Motor Care Compliance Enforcement Section\ngovernment of public safety to commercial vehicle enforcement.\nThese are the men and women that you see in the dark SUVs moving up and down the interstate\non our highways that make sure that all the 18 wheelers and commercial trucks that you\nsee out there are compliant with Georgia law.\nWhat it also does is it ensures that the members of the commercial vehicle enforcement group\nwill be trained, sworn, and certified.\nFor anyone who may not know the individuals\nthat do the inspections and the other things\nrelated to commercial vehicles have to have a very unique\nskill related to these vehicles specifically\nthat some law enforcement officers do not,\nwhich is why we have concerns from time to time\nwith agencies pulling over these vehicles.\nSimple traffic violations, title 40 violations are easy enough,\nbut some of the things related to inspections\nand other things related to the commercial vehicles\nthemselves can be somewhat complicated.\nAnd with that, Mr. President, I will yield for any questions.\nYou do have one question, Senator.\nI recognize Senator from the 53rd.\nI thought I did.\nThank you, Mr. President, with the Senator Yeal.\nI do Yeal.\nIt's true that if your bill passes CVD officers,\nthey get dispatched to the same riots\nand everything else in a blue shirt,\nwould you dispatch to right? That's right these I think my good friend from the\n53rd thinks a lot like I do that if you if you have the training and if you\nhave the skill set the dedication and you work like other law enforcement agencies\ndo you should be treated exactly the same and these officers do respond to\nthose same types of situations therefore parity should be throughout the\nDepartment of Public Safety and I think this helps get us closer to that goal\nSenator would that agreeance of parity would you be in favor of signing on to the\nlegislation from the senator from the second nod to bring in medical\nretirement for the black shirt and the blue shirts together. Senator I would\nI would consider that absolutely doing that the only thing that makes me\nnervous about that is that it is you from the 53rd and the senator from the\nsecond and I'm afraid I might be walking into a fly trap but after reading and I\nI would take that into consideration.\nSenator, isn't it true that the Senator from the 53rd\nis the most pro-law enforcement Senator in this chamber?\nNo, sir, that is not true.\nWith that, Mr. President, I yield the well.\nSenator's yielded.\nDoes any other Senator wish to speak for against the measure?\nHearing none.\nOkay.\nIs there objection for previous questions being ordered?\nChair here is not in the previous question with this order.\nIs there objection to agreeing to the board of committee which is favorable to the passes\nof the bill?\nChair here is an un let in the board of committee agreed to.\nIs there objection to the main question being ordered?\nChair here is not in the main question.\nOr the question is all in the passes of the bill.\nSenator from the 53rd you which speak okay all those in favor of the bill will vote yay all opposed nay secretary will unlock the machine\nYou\nAll in the past of the bill, the A's are feet to one, the A's are zero, this bill\nGo ahead and proceed direct to the Constitution.\nMajority is there for pass.\nSecretary Reed, House Bill 137.\nHouse Bill 137, over some Anderson,\nthe 10th and others,\nthe Bill to be in town and act to amend chapter 10 and title 13.\nThe official division annotated with two contracts\nfor public work.\nSo as to increase the dollar value,\nserve in public work contracts.\nExam form revisions, way to retention of contractual payments\nto amend Article 10 of chapter 2, title 20,\nthose CJA with two contracts and purchases\nby public schools to amend chapter Article 11,\nChapter 2 of Title 20 of those CJA will add to public school property and facilities to amend Chapter 4 of Title 32 of those CJA will add to state county municipal road systems to amend Chapter 91 to title 36 of those CJA would you public works bidding to amend part 1 of Article 3 of Chapter 5 of Title 50 of those CJA will add to general authorities duties and procedure for state purchasing to our relating matters for building local laws and for other purposes, Mr. President and Senate Committee of State and will government all operations general recommends that this bill do pass or strictly submitted to our Dixon chairman that completes the order of Mr. President.\nis\nThank you, Mr. President, members and colleagues. I bring you House Bill 137. This bill simply\nraises the threshold in which public works has to put out a competitive bid, taking it\nfrom 100,000 to 250,000.\nIt, uh, we haven't changed this in over two decades.\nOver 20 years since that number has changed.\nAnd the bill now includes both local and state agencies.\nThat, I will yield for questions.\nLittle order will be good too.\nI urge your favorable consideration for House Bill 137.\nThank you senator. Does any other senator which speak for against the measure?\nChair here is on. Is there objections to the previous question being ordered?\nChair here is none. The previous question is ordered.\nIs there objection to agreeing to the poor committee which is favorable to the passes of the bill?\nChair here is none. The poor committee has agreed to. Is there objection to the main question being ordered?\nchair has done the main questions order questions on the passes of the bill\nsenator from the 24th you wish to what purpose you rise mr. President I\nlike to excuse the senator from the 13th doing business without objects\nthe center from the 13th is excused all those in favor of the bill vote yay\nopposed to any secretary will unlock the machine\nYou\nBill the A's are 45, the A's are 5, this bill haven't received the Constitution of Majority\nis there for a path.\nSecretary, please read House Bill 150.\nHouse Bill 150, we are representing the 114th and others, the bill to meet out and act\nto amend Part 2, Article 2, Chapter 3, Title 20 of the Fisher go to George annotated\naway to the University of Systems, that's the required quarterly reports regarding certain\nfunding received from individuals and entities related to China to write for definitions\nto provide for related matters to provide for short titles for people looking at the laws and for other purposes.\nMr. President, the Senate Committee on Higher Education recommends that this bill do pass by substitutes\nthe submitted Senator Hickman-Cherman.\nMr. President, the Senate Committee on Higher Education offers to long substitute the House Bill 150,\nBill's being titled an act to amend part two of Article 2, Chapter 3, Title 20,\nthose that you able to the university system, so it's to require semi-annual reports regarding certain\nfunding received from foreign countries, entities, or individuals of concern,\nby pedestrian denisions, the right for related matters,\nright for short tile, through repeal,\ncomplicating laws, and for other purposes.\nMr. President, Senator Beaton of the 30th,\nand others are for the following amendment number one\nto amend the Senate Committee's substitute of House\nwith 150 by striking $50,000 online,\n$28,000 and inserting $1,000.\nMr. President, that completes the order.\nWe're going to have a center from the 45th.\nThank you, Mr. President.\nColleagues, I rise today to present HB150 to you.\nbill ensures that the legislature understands what our university system is doing in regards to\ncountries with foreign concerns and institutions\nfunding that might present corruption influence of our university system.\nAt the same time it ensures that individuals from foreign nations who want to study here\ncan do so in peace. The two key opponents to the bill are focusing on funding from foreign\ncountries of concern and those working on their behalf. It applies to foreign entities\nof concern who are governments, companies, and people without U.S. residency or citizenship\nwho live in these countries. This foreign countries of concern are identified in lines 16-18.\nThese governments are designated by the United States Secretary of Commerce. The second\npart it promotes transparency in foreign funding you do have one question I'm sorry\nSenator I'm glad somebody else can't either because I couldn't either so I think\nAnd I need to turn up the mic a little bit.\nAnd that's what the bill does.\nIf you would please vote, then I'll yield well.\nI'm just kidding.\nAll right, now I'll go ahead and start over.\nThank you for letting me know that.\nSo colleagues, I rise today to bring HB-150 before you today.\nThis bill ensures that the legislature understands what our university system is doing\nin regards to countries that are affluent concern and institutional funding that might\npresent corruption or influence on our university system.\nThe bill does two things, it's focused on funding from foreign countries of concern\nand those working on their behalf.\nIt applies to those countries\nand basically where that foreign countries of concern,\nwhere that comes from, is from the United States.\nSecretary of Commerce, and that's where that list is derived from.\nWhat this bill does is it promotes transparency.\nIt requires a university system to report twice a year\nto the governor and to this body of any funding\nthat has been received by any university,\n50,000 and above from foreign countries of concern.\nIt does not contemplate or include tuition.\nIt has nothing to do with that.\nWe want individuals from all over the world\nto be exposed to the benefits of our US higher education system\nand the freedoms of our society.\nWhat we don't want is to see hostile foreign adversaries\nuse money to undermine or corrupt our university system.\nresearch or to steal intelligence and things of that nature.\nWill that Mr. President be happy to answer any questions?\nAnd there is a friendly amendment that would actually drop\nthat amount from $50,000 to $1,000.\nYeah.\nYou do have a couple of questions.\nAnd if I get everybody's attention,\nthe skin is getting pretty loud back there in the back.\nAnd it is having a hard time.\nWe're all having a hard time here in the gentleman\nin the well.\nSo if y'all could break it down a little bit.\nIf you've got house members you're talking to, maybe take them outside and talk to them there.\nSo, Senator from the 44th.\nThank you, Mr. President, to the author, will you, or the sponsor, will you, you'll, great\nto appreciate you starting again.\nOh, absolutely.\nSo this, the foreign countries of concern, I'm looking at lines 16 to 18, would this list\nupdate automatically, pursuant to any changes to 15 CFR, section 791.4, or will it be static\nbased on the list on February 4th, 2025?\nSenator, the way I read it would be the list that was established or current on February\n4th, 2025.\nSo meaning, your interpretation is that it remains static.\nYes, ma'am.\nDo you have any concerns that then it could kind of quickly get out of date and be over\ninclusive to the, maybe it wouldn't be quickly, but say, and you know, however many years,\nover inclusive to the point that we may inadvertently block talented individuals from being a part\nof our university system whose research we actually might very much want to take advantage\nof as Americans?\nWhat are your thoughts on that?\nYeah, and I completely see your point, Senator.\nAnd I could also see the list, you know, at some point need to be updated.\nYou might need to take somebody off or add somebody, but a country may take a country\noff.\nWe may add a country down the road.\nThe intent of the bill is not students, you know, coming from abroad to learn at our\nuniversity system.\nIt's, you know, countries that are of concern contributing, you know, large amounts of money\nto these universities and potentially having influence over them.\nThank you. Do you, if you'll further yield, do you know why the decision was made to keep\nthat static instead of updating along with the federal code?\nI do not have the answer to that.\nLastly, I don't think this is a part of this current bill, but I know that we have had\na number of bills over the last three years or so regarding ownership of land near certain\nareas, certain sensitive American, I don't know, can't recall if there were like utilities\nor other other things of that nature, is this the same sort of approach that those bills\nhave taken?\nYeah, I would say similar, I think, you know, what you're looking here is it, you know,\nas you, you know, the numbers debated, you know, is $1,000 or $50,000, you know, it's the\nlarge donations that would potentially give them access, you know, to the university\nthrough, you know, you know, having access to coming to meetings or, you know, being\ninvolved in a university wouldn't be an individual student coming over and paying to\ntuition to access one of our university system.\nThank you.\nYou have one more question, Senator.\nWe're going to send it from the 41st.\nThank you, Mr. President.\nThis is Senator Yield.\nI do, yes, ma'am.\nThank you.\nYou continue to talk about this not excluding, say,\nforeign exchange students.\nBut if you look at line 23, it defines\na foreign individual of concern as anyone who's\nfrom one of those countries that is not a citizen\nor permanent resident of the United States.\nSo can you help me understand how that would preclude\nor carve out, say, an international student?\nYeah, I would imagine, I mean,\nit wouldn't be any student coming from, say, China's\na hot button country, coming from China.\nThis would be the individual that obviously is,\nyou know, of concern that has done something to put them on that list.\nDo you further you know?\nSure.\nSo you're suggesting that the person has to have done something\nand cannot just be domiciled from that foreign country,\nbut they have to actually have done something to get on the list\nindividual concern you are correct yeah it would be if they're\ndomicile that's correct so do you further you know sure you've also suggested\nthat paying tuition would not be a part of this however on lines 26 and 27 it\ntalks about funding means payment and exchange for services or other\nmonetary exchange. So it's a very broad, very, very broad category here. So I'm not\nunderstanding how it is that tuition would not be included in this\nexclusion.\nI do agree it is a broad definition, but it doesn't have tuition, you know,\nhave lifted in there, but I agree it is broad.\nSo just isn't it true that if we were to pass this bill\na student from China who is not a permanent resident\nin the United States and is not a citizen\nwould be considered a foreign individual of concern\nand therefore could not pay any money\nto our university system because that\nwould be a monetary exchange.\nAnd therefore we are essentially banning\nall international students from China from being able to receive an education or continue\nto further our research here in our university systems. Isn't that true?\nNo, I don't believe that's the intent of the bill at all, not to ban all foreign students.\nfor the year.\nNo, Mr. President, I'll yield the well on that.\nThank you.\nAll right.\nSenator Hesilden.\nSenator from the A's, would you like to speak?\nSenator from the 30th, would you like to speak to your amendment?\nThank you, Mr. President, and thank you to my friend from District 45 for seeing this\nas a friendly amendment.\nAny time we're talking about foreign countries, entities, or individuals that are designated\nfor an adversary to the United States, I really don't think we should be accepting any\nmoney from these individuals, but we are reducing that amount from $50,000 to $1,000, that\nway we know exactly what's coming into our universities, and with that, Mr. Speaker,\nI ask that you vote in favor of the amendment and the bill, and I will yield the well.\nSenator Hesildan.\nDoes any other senator which speak for against measure?\nChair, here's none.\nIs there objections previous question being ordered?\nChair, here's none.\nPrevious question is ordered.\nOn the adoption of amendment number one.\nWe have objection.\nOn adoption of amendment number one,\nfrom the center, from the 30th,\nwe have objection to that amendment.\nSenator, would like to speak to your objection\nor just let it ride.\nJust let it ride, all right.\nAll those in favor of amendment number one\nwill vote yay, all opposed,\nnay, secretary, and lamp machine.\nOn the adoption of amendment number one, the A's are 32, the A's are 21, and the amendment\nis adopted.\nQuestions on the adoption?\nQuestions on the adoption of the committee's substitute, as amended, is there objection\nto the adoption of the committee's substitute as amended?\nHere none of the committee's substitute as amended is adopted.\nIs there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill?\nChair here is an unimportant committee as agreed to.\nIs there objections to the main question being ordered?\nChair here is none of the main questions ordered.\nQuestion is on the passes of the bill by substitute.\nAll those in favor of the bill will vote ye.\nAll opposed nay.\nSecretary one, not the machine.\nOn the pass of the bill, the A's are 32 and the A's are 19, this bill haven't received\nthe requisite constitutional majority, it's therefore passed by substitute.\nSecretary House bill 199.\nHouse bill 199, representative Kelly, the 16th and others, the bill is being said to\nto manage, I provide a title 15 of the official code of Georgia annotated,\nled to administration of courts and record generally.\nSo it's the modified provisions related to protection of personal identifiable information\nof judges and their spouses to abolish the requirement for the administrative office\nof the courts to maintain a database of protected persons and information,\nso by a protected statewide form, to be used by protected persons seeking to have information\nremoved or a doctor from public records to require state and law governments to remove personally\nidentifiable information from public records were requested by protected persons,\nfor procedures for such requests,\nto rise definitions, to regulate matters,\nto be able to look at laws and for other purposes.\nMr. President, the thank-and-menegetary\nrecommends that this bill do pass\nby substitute respectfully submitted\nto Senator Strickland-Chairman.\nMr. President, the thank-and-menegetary\noffers the long substitute to House Bill 199\nto build some means out of mind to manage\nI provide a title for the dean of those\nto GA, related to administration of courts\nand record generally says some modified provisions\nrelated to protection of personal identifiable\ninformation of judges and their spouses\nand for other purposes.\nMr. President, that completes the order.\nThank you, Mr. President, members of the Senate, Senate Bill 199 moves to restrict the phone\nnumber and address of judges and former judges from public disclosure.\nIt also protects the property and tax records so that people who are doing bad things that\nmay be upset with their decisions cannot find them as easily.\nAny questions?\nI'll yield to them now or yield the will.\nThank you, Ms. President, I yield the will.\nThank you, Senator.\nDoes any other Senator wish to speak for against a measure?\nChair, here's none.\nIs there objection to the previous question being ordered?\nHere's none of the previous questions ordered.\nQuestions on the adoption of the committee substitute?\nIs there objection to the adoption of the committee substitute?\nHere none of the committee substitute is adopted.\nIs there objection to agreeing to the board committee\nwhich is failed to the past of the bill?\nChair here's none.\nBoard of committee is agreed to.\nIs there objection to the main question being ordered?\nChair here's none of the main questions ordered.\nQuestions on the past of the bill by substitute.\nAll those in favor vote, yay.\nAll opposed, nay.\nSecretary-of-the-art, machine.\nYou\nYou\nAll in the past of the bill, the A's are 54, and the A's are zero.\nThis bill hemmed to see the rest of the constitutional majority is therefore passed\nby substitute.\nWe're going to have Senator Secretary has a message for the Senate.\nMr. President, the following message was received from the House and Mr. Riley.\nThe clerk thereof, Mr. President, the House is disagreed to the Senate's substance due\nto the following bill of the House.\nHouse Bill 68 will represent a burns of $1.59 and others.\nIt's billed to be titled next to make and provide appropriations for the state fiscal year.\nBeginning July 1st, 2025, and ending June 30th, 2026, to make and provide such appropriations\nfor the operation of State Governance Departments and for other purposes, Mr. President, that completes\nthe order.\nSenator from the 19th.\nMr. President, I move the Senate insists on its substitute to House Bill 68.\nThe Senator has moved that the Senate insists is the objection to the appropriations chair\nI wanted to insist on the Senate's position, hearing none, we insist.\nOkay, so at this moment, we're going to break for lunch.\nAnother protein has lunch set up in the annual room here.\nWe're going to break for lunch and we'll reconvene probably about 1.15.\nSo Senate will standard E so about 115.\n",
  "updated_at": "2026-02-12T17:26:15.115845+00:00"
}