{
  "video_id": "MXiQt1KUddU",
  "url": "https://youtu.be/MXiQt1KUddU?t=1887",
  "title": "Georgia House - Day 37 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 37,
  "video_date": "2026-03-29",
  "duration_minutes": 142,
  "summary": "Overview:\nThe Georgia House floor session on 2026-03-29 was a routine day with limited substantive legislative activity. The primary focus was on delaying the start time of the session.\n\nKey Actions:\nNo major bills were passed or referred.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\nThe transcript contains an extended personal story by a representative about their difficult upbringing and criminal history, before finding faith in prison and turning their life around. This appears to be an unscheduled speech or personal privilege moment.\n\nVotes:\nNo recorded votes are mentioned.\n\nAttendance:\nThe transcript does not provide any information about quorum or attendance.\n\nAdjournment:\nThe session was adjourned, but the transcript does not specify the time or the date of the next scheduled session.",
  "transcript": "The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015. The House will stand the dees until 1015.\n\nyou you you . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . And whenever I would ask my mother, who's they were, she would dodge the question. But finally one day she told me there your dads who I had never met but seen only on a tiny prison photo mug shot. I met him 18 years later and I'll kind of let you people know you guys and you ladies know how that came about. He was sent to prison when I was six months of age and they gave him a sentence of conceal life. Conceal life is like life without parole back in the 70s. They called it a conceal life sentence. But you know I'm reminding and I, one of the things that encouraged me as I approached life and I began to find out where my identity was which is in Christ Jesus. I'm reminded of Psalm 68 verse 5 and it says he's a father to the fatherless. So I held on to that as I began to fall more in love with Jesus Christ. He became my father. You know I never had a father really to model that for me. I had a stepfather but that was very momentarily. And so my mom she had met my stepdad who was stationed at the Navy base in Athens, Georgia in the early 70s before the University of Georgia bought him out and they got married and shortly they moved us to Yokohama, Japan. Now that was a culture shock for me ladies and gentlemen. I'm coming out to hood. I'm from inner city and we're going to Yokohama, Japan. When my grandma said you know you're going to Japan one of the things they hit me I was like I wonder what she's going to cook me day. We're going to Japan. I'm thinking she's going to put something literally in the pan right and we move over to our man. And once we get over there you know I knew a couple of slang words I had and learned from my Ken folks in the part of the neighborhood so I'm speaking slang. They speaking yag. I'm looking at them like they're looking at me like that. And we had a great time. We had a great time. So during my years of ten and a half to eighteen we moved from Japan over to New Jersey for a couple of years. That's where my parents divorced and then we moved back to Athens momentarily and then migrated to Atlanta. That's where I first caught my first charge. I was incarcerated. I remember off capital avenue they used to have a juvenile that was over by the old stadium of what I was in. Can still remember those days when I first got incarcerated. After I turned fifteen I was incarcerated for a stolen car. So I was I was my first charge was was burglary my second charge was a stolen car. Around the same time I began to get my first pistol. As I began to experience with cove cane committing all types of crimes going deeper into the streets. At seventeen years of age I was faced with two life sentences for some horrible offenses. I was accused of murder and arm robbery. I will never forget when I called home collect from out of the hole and sailed to my mom and she picks up the phone and she says okay all right well yeah and I told them on Jefferson street that's before it became right street. Fulton County jail and she says okay you made it to the big house. What have you done? I said well mom of these people are saying this and they saying that or whatever else she said well let me tell you something. I don't have any money for an attorney. I don't have money to get you a lawyer or anything like that. So what you want to do is get on your knees and pray. You know that was easier said than done to just get on my knees and pray. One day a narrowly guy came down the hallway passing out Bible tracks and ministered salvation by introducing me to this guy by the name of Jesus. I gave my life to Christ which was a strange experience since I since my first couple of times ever going to church were to my relatives. Females my uncle who got murdered over that neighborhood of Paul. Oh that I witnessed at the age of five in my auntie who got poisoned at a bootleg of house because you know story is I don't know how true it is that she was messing with the guy the woman's husband at the bootlegger's house. But you know what even though I wasn't raised in church there was no death no height no lift that where Jesus didn't come and reach me even behind bars. Ain't that the good news isn't that the good news of Jesus Christ. We hear a lot about fake news and this and that there this channel that channel what of else but I think we need to start here in a little bit more about the good news and that's my sign of while I'm here today ladies and gentlemen to tell you about the good news of Jesus Christ who is changing lives as he did over 2000 years ago and still changing lives to date during this time. And Luke 4 verse 18 it says Jesus has been anointed to preach the gospel the good news to the poor and to preach deliverance to the captives that was definitely me. I was a captive just you know indefinitely sin and darkness of what I've ever but Jesus meant me right there. I was 18 when the Lord sent me free from those offenses but I didn't find a local church nor my nor keep my promises or or vows and diverted back to my old ways. This calls me to be in and out of jails facility's prisons which led to 54 arrests and four times in close security high max prisons during my time in darkness I remember fighting deputies catching simple battery charges and aggravated assault charges at the Clark County jail which is located in Athens, Georgia. I even set the jail on fire which in the early 90s calls me to be shackled to a bunk in a toilet in my cell. Shortly afterwards is when I first met this guy who was a deputy by at that time by the name of Ira Edwards then who later on became sheriff of Clark County jail who is also a mentor to me today. A close friend of mine's now I know him and his family and his life and his wife and children. He preached the gospel the good news to me again. I will never forget when I was in the cell when I was in the cell call age five that didn't have a bunk sink nor toilet in it. I remember that I would be looking through the flat midway down the door that stayed locked until food trays came through it or you would have to literally stick your hands through it with your back to the door to be handcuffed to be transported to go take a shower to go to the medical department or to even be transported to court. I couldn't wait until I wrote with shift came on so I could peep through the flap on the door even though it was locked it had a little small space and sometimes I would sit there for 30 minutes on up to two and three hours till his shift came on. This one particular time I went to the class I went to the classification office he had this big book sitting on the desk along with the Bible and I asked him I said what's that book? He said Jamie Scott you don't know nothing about that you don't want to know what that is you don't know nothing about it and I asked him that again and he began to tell me he said well this is a concordance it references scriptures from the Bible and it kind of lets you see the footnose and things. The book had given him the opportunity to manage to the good news to me in spite of my present situation that impacted that I was impacted by this man of God that day who would always be a part of my testimony. God always has a plan if we allow him to leave. If there's nothing else that I can leave you all within this room today is let God lead you. And how did you do in this challenging work? You know heaviest the crown that carries that places on the head and I know your work get challenging at time. I know that you're advocating and sometimes you're like man what am I doing here? Am I making an impact? It feels like you're getting pushed by these different things but I guarantee you if you allow to Lord Jesus Christ to come in and cast all your cares upon him with whatever you're dealing with it will get a little bit lighter. I love how Ezekiel 1119 in Ezekiel 11 verse 19 God says he will give us an undivided heart with the new spirit and the change of hearts from a stone of flesh. Now some of the people who helped me along the way are some good old boys. You know I've had different people to help me along the way but I haven't had some good old boys where camouflage shirts and hunting gear and I'd have had some people who along the way who have helped me who may have had some dreads or what avails. You know it kind of really makes me look at life through not just one set of lenses but a broad set of lenses when I think about me being this guy from the hood and then having some of my best friend who drive 1500s carry guns loves the Lord life and liberty as well as this great state of Georgia. Y'all are my type of folks. Y'all are my type of folks and I can't say it enough Georgia. Thank you. Thank you. I was saying this for the rest of the state of Georgia and for everyone that you fight for and for everyone that you're doing this work for I believe that we can all find coming ground somewhere to say thank you for the work that you do. Today I'm a personal long-term recovery who has worked for the Department of Behavior Health Development and Disabilities and the Georgia Council of Substance and Abuse. I'm a co-founder of PLR which is called People Living and Recovery Incorporated. I teach a curriculum at the county jail called Self-Control as unpaid facilitator and it's the same jail I set on fire. Don't go out half a sense of humor. You mean to tell me that here take a guy like me and clean him up and still say okay we want you to go back into the same jail that you set on fire. We're going to get him to pay you and pay you real good and we're going to just give you just a one way to go in or one way or back says I'm going to give you dual access. You're going to go in as a paid facilitator and also a religious volunteer to preach hope to the next person that was bound up like you. So when you're sitting up in these places and you're doing different things with legoslator bills or what else and know that it makes a difference. It makes a difference in some type of way. In closing the verse that I like to close with is revelations 12 and verse 11. When it says they overcame him which is the enemy by the blood of the lamb and the word of their testimony by the blood of the lamb and the word of their testimony. The best message that I can ever preach wherever they may call me to. I've been in the DC. I haven't been in the White House or whatever else. But I always share the goodness of God and I always let people know because everybody in here have someone that's an addiction in your family or no friend that is struggling with this or if it's mental health challenges. But God is able. I'm proofing to put in. Let us buy our heads and pray. Father God, I thank you for giving me this great opportunity to stand before great women, men and women in this house today. It is only you that can open up doors that no man can shut and shut doors, no man can open. Father, I pray for wisdom, for our state leaders. I pray for discernment and to let their leadership to be under the guidance of the Holy Spirit as you lead them and you guide them and you protect them and you comfort them and you direct their paths to live towards peaceful lives in the name of Jesus Christ. Amen. Let's turn toward the legions through the flag of the United States of America. We will move in public to which it stands, one nation and one of God, an invisible museum for prayer. Doorkeepers will unlock the doors. Members may greet the chaplain in the south, Annie Room and the chair recognizes Chairman Hogan, the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. Father, more, Mr. Speaker, I hope to arrive to my death late in love and a little drunk, Atticus Steven Sains. Mr. Chairman, let me ask you though, is that really a respectful way to be talking about it? Man, it could be your son-in-law. Mr. Speaker, let me assure you that that will never happen. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Barnes, on 159, this file will be established as the order of business. They are in the first part of the period unanimous consensus, introduction of bills and resolutions, first reading of reference of house bills and resolutions. Second reading of bills and resolutions, reports of standing committees. Third reading and passage of uncontested local bills and resolutions. First reading of reference of senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. Rule 1603, by the rest of the year, to the 150 second to build a betel-deak to amend a net to create the city of Silvestre. The intergovernmental coordination. House of resolution 1127 by the rest of the ball over the 82nd. The resolution creating house study committee on developmental affairs. House resolution 1128 by the rest of the wills. In the 80th, Oliver, 82nd, Shannon, 84th, Canon, 58th, and Evans, 57th. Resolution recognizing and commending, Stacey Fodd. House resolution 1147 by the rest of the dung-ahoo, 30th, Kelly, 16th, parts of the 44th, Benton, 31st, Washburn, 141st. Resolution urging the president of the United States to consider the current geopolitical tensions. Energy, utility, and telecommunications. House resolution 1148 by the rest of the Thomas, 21st, Carson, 46th, and Cantrell, 22nd, and 23rd. Resolution urging Cherokee County and the cities of Woodstock, Canton, Holly Springs, Ball Round and Woleska. Intergovernmental coordination. That can please first readers. Second reading of bills and resolutions, the clerk will read. House bill 1599 by Representative Powell of the 32nd. The bill will lead in two licensing provisions regarding professional counselors, social counselors, marriage, and licensed therapists. House bill 1604 by Representative House of the 170th. The bill will amend and act to consolidate all the laws of chartering the city of Adele in the C-O-Cook. House bill 1605 by Representative Workhieser, 157th. The bill will amend and act to grant any charter for the city of Claxxin. House bill 1606 by Representative Clark of the 147th. Blackburn to the 146th. Dickey of the 140th Williams of the 148th. Mathis of the 144th. The bill will authorize the assessment and collection of a technology fee by the perfect Court of House and County House bill 1607 by Representative Bentley of the 139th. The bill will provide a home study exemption from Taylor County School District, Adlaurem Taxes, House Resolution 1083 by Representative Powell of the 23rd. McDonald, the 26th. Jasper's of the 11th. The resolution honoring the life of Mr. Lloyd James Grogon. Dedicating an intersection in his memory. House resolution 1084 by Representative Cannon of the 58th. Thomas of the 39th Mitchell, the 88th. Smiried of the 135th. I believe the 143rd. A resolution honoring the life of Mr. Jabita Moore. Dedicating a road in her memory. House resolution 1102 by Representative Levin of the 33rd. Boston of the 7th. Dickey of the 140th. The Ricky of the 169th. Jasper's of the 11th. Resolution recognizing Representative Thomas Allen McCall. Dedicating a road in his honor. House resolution 1103. By Representative Newton of the 123rd. Jones of the 47th. Law of the 122nd. Burns of the 159th. Cooper of the 43rd. And others. Resolution urging the Biden administration to remove its veto and re-approve George's Medicaid expansion waiver. House resolution 1104 by Representative Cannon of the 58th. Thomas of the 139th. Smiried of the 135th. Beverly of the 143rd. Parents of the 142nd. Resolution recognizing the black music. An entertainment walk of fame. Dedicating a road in his honor. House resolution 1105 by Representative Bonner of the 72nd. Matthew of the 73rd. Resolution honoring the life of Mr. Huey Lauren Spray. Dedicating a road in his memory. House resolution 1124 by Representative Shed of the 176. And Cooper of the 174th. Resolution honoring the life of Mr. Kenneth. Ken Jason Bennett. Dedicating an intersection in his memory. House resolution 1125 by Representative Shed of the 176. And Cooper of the 174th. Resolution honoring the life of Colonel Frank Norton. Dedicating an intersection in his memory. House resolution 1126 by Representative Evans of the 57th. Holland of the 54th. Field of the 60th. Jones of the 25th. Resolution creating the House Study Committee on Motor Vehicle Equipment. And Public Safety. Senate Bill 632 by Senator Anderson of the 43rd. Bill to amend and act to provide a home study exemption from certain people. Senate exemptions from certain Rockdale County School District, Edelorn, Texas. Senate Bill 633 by Senator Mollis of the 53rd. Bill to amend and act to provide a new charter for the City of Bringle. Senate Bill 635 by Senator Strickland of the 17th. Jones of the 10th. Bill to amend and act to place in the Sheriff's Probe, Judge Clark of the Superior Court. And tax commission or a Henry County on an annual salary. Senate Bill 637 by Senator Brass of the 28th. Bill to create the City of Sonoyan Building and Facilities Authority. Senate Bill 638 by Senator Anderson of the 43rd and Strickland of the 17th. Bill to create the Rockdale County Public Facilities Authority. Through second readers. Reports of standing committees, the clerk will read. First out of Stevens.\n\nThe 264th District Chairman and Committee on Economic Development and Tourism submitted the following report. We speak to your committee on Economic Development and Tourism. It's had a consideration of following bills and resolutions to the House and Senate. Since the Director of Media report, same back last following recommendations. Senate resolution 135, due passed by Committee Substitute House Resolution 1026, due passed Senate bill 142, due passed by Committee Substitute. Respectfully submitted, Representative Stevens of the 164th District Chairman. President Markman, the 49th District Chairman and Committee on Higher Education submitted the following report. We speak to your committee on higher education and consideration. Following bill of the Senate and Stuck to Media report, same back last following recommendations. Senate bill 379, due passed respectfully submitted. Representative Markman, the 49th District Chairman. Representative Jan Tanger, the 160th District Chairman and Committee on Economic Development and Tourism. The following report was speaking to your committee on Economic Development and Tourism and Local Assembly. Following bills to the House and Senate and Stuck to Media report, same back to the House and following recommendations. House bill 616, due passed House bill 1601, due passed House bill 1602, due passed Senate bill 560, due passed by Substitute House bill 797, due passed by Substitute. Respectfully submitted, Representative Jan Tanger, the 160th District Chairman. Representative Strachan, the 104th District Chairman and Committee on Judiciary submitted the following report. We speak to your committee on Judiciary and Senate and consideration. Following bills to the House and Senate and Stuck to Media report, same back last following recommendations. Senate bill 276, due passed by Substitute Senate bill 359, due passed by Substitute. Senate bill 364, due passed by Substitute Senate bill 374, due passed by Committee Substitute. Respectfully submitted, Representative Strachan, the 104th District Chairman. That police are reading the report to stand in committee. We're going on now to the local calendar. This House will come to order. Going on to the local calendar, third reading and passage of uncontested local bills. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds roll call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. House Bill 1600 by Representative Williams, 168th City, ETH, House Bill 1601 by Representative Corp. 174th, ECHL's County. House Bill 1602 by Representative Jasper, the 11th Murray County. Senate bill 560 by House Substitute by Senator Jones, the 10th to CAB County. House Bill 797 by Substitute by Representative Gaines, 117th Athens Clark County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none the report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative fry arise? Parliamentary inquiry. State your inquiry. Mr. Speaker, isn't it true that this is a substantive way that we can provide relief to the homeowners and Athens Clark County for the rising cost of housing? If the gentleman so states I know that he cares very much and is very knowledgeable about that issue. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 153. The nails are five. These bills having received the requisite constitutional majority are therefore passed. What purpose does chairman tankerously rise? Mr. Speaker, I rise to make motion. State your motion. I move. We immediately transmit the local calendar to the Senate. The chairman tankerously has moved that this house immediately transmit the bills on the local calendar which were just passed to the Senate. Is there objection? Is there objection? The chair here is none and it is so ordered. All right, now we're going on to morning orders. Chair will remind members that by rule we have a total collectively of 10 minutes. We're not going to assign a particular time to any member but at the end of 10 minutes the microphone will be cut off. Chair recognizes representative Al Williams for a morning order. Thank you, Mr. Speaker. This morning I have the commanding general of Fort Stewart and the command sergeant major. As we speak, 3,800 troops from Fort Stewart are in West Germany in case a line between us, NATO and Russia is crossed. We are prepared. Please, folks, we're ready to go into danger. They are heroes and we appreciate their sacrifice and their willingness to stand up for democracy here in America. I'm going to ask those that would like. I'm going to bring the general out. I'd love for you to take a picture with him if you would. Thank you so very much and let's remember Ukraine. Thank you, Mr. Speaker. Representative, I think the general will be in the anti-room to greet people and for photographs. Chair recognizes leader Burns, Chairman Hitchens, and Chairman Parrish for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Today, I want to make sure that you, if you need to visit the doctor of the day down in the medical aid station, but more importantly, I hope you'll go by and say hello to Dr. John Odom. He is a physician from Savannah, Georgia. John was born and raised in South Georgia. He's a country boy. He attended the medical school in New York City of all places and he completed his general surgery and residency there before he joined the army and then came back to Savannah. Dr. Odom is a renowned general surgeon in Southeast Georgia. He's also a great friend of public safety officers all across his state as he was to then chairman Hitchens when he was in that business. He's a managing partner at Metro Surgical Associates in Savannah. He's a former chief of staff and board member of Candler St. Joseph's Hospital in Savannah. Really was imported this body. Dr. Odom has dedicated his life to making sure that folks have medical care around this state and with that in mind, he's partnered with us to create he's the director of the Rural Surgical Fellowship Program that is supported by this body. He has surgeons at Wayne Memorial Hospital in Jessup. If an M. Hilt system in Springfield, Scrivening County Optum Medical Center in Sylvania, and Coffee Regional Medical Center in Douglas. He's quite a surgeon. He takes the Hippocratic Oath very seriously. If you need help, you need someone to visit with. I'll just go down to meet Dr. Odom. He's quite an individual and I think you'll be blessed by meeting and talking to him. Thanks to my colleagues for welcoming Dr. Odom. Thank y'all and I yield the well in the speaker. Chair recognizes representative Carter for a morning order. Good morning. Thank you, Speaker Rosson. Good morning, our colleagues. I know that we are closing out women's history day and I wanted to acknowledge this phenomenal young lady she was here with us yesterday. Her name is Samantha Ward. She is an entrepreneur and she recently opened spa in Union City. And so I just want to share a little bit about her. I she graduated from the International School of Skin and Nail in Roswell. She created this exotic nail concept and she looks at nails and she considers it a masterpiece. I had to hide my hands from her. But along her journey here are the people that she's had an opportunity to take care of their nails and some of these people you may actually know their names. Ruben Stutter, R&B singer, Andrea Kelly, Kelly Price's daughter, Johnny, Johnia Roe, Quaves mother, Etna, the Brad, Erica Badu, Primadana, Sierra Glamshaw, the City Girls and more. This young lady was inspired by her mother after going into a security business and her mother told her to do something that makes her excited and then she quit her security job and went into this business and she calls it Sunn NB where she makes every person that sits in her chair important and receives a star-studded world-class experience. For those of you who are on social media, go and look up Sunn Ivey and when you see these nails they're absolutely a masterpiece or something that I'm not quite ready for but I'm going to grow up to it. And so would you all join me in congratulating this young lady, Samantha, Sunn NB, Kimberly Ward, who has killed the game in the nail industry as a young person as an entrepreneur. I'm just really so proud of her. And since the yellow light isn't on yet, she is awesome. Oh wait, I just want to show you what we have lunched what we call spolitics and we want to take politics to the spa. I yield the well. To recognize this representative Frazier, representative Hugo Lee and representative Al Williams for a morning order. Good morning. Thank you speaker. I stand here today with my healthcare colleagues as we recognize March 2022 as Rare Kidney Disease Awareness Month with a House Resolution 1051. March is recognized as National Kidney Month and it is an important opportunity to raise public awareness understanding of Rare Kidney disease such as APOL1, a Paul L. Amediated Kidney Disease. APOL1 is a genetic variant accounts for much of the excess risk of chronic and in-stage kidney disease for persons of African descent. APOL1 explains the proportionate rate of kidney disease, people of African ancestry. Although African Americans make up 13% of the United States population, 32% of all those with kidney failure and 35% of those with in-stage kidney disease. APOL1 is a mediated kidney disease is driven by genetic factors and is severely undiagnosed. So today we stand here increasing public awareness and understanding of the genetic causes of Rare Kidney disease which leads to early diagnosis and care for some of our most vulnerable populations. We recognize March as Rare Kidney Disease Awareness Month in the state of Georgia. Thank you. Chair recognizes representative McLeod for a morning order. Representative McLeod. You signed up for a morning order. We're not recognizing farewell speeches for those who are running for other offices. You waive? Okay. Okay. That completes morning orders. All members of the House will please take your seats. All members will please take your seats. All members are welcome. Thank you, Mr. Speaker. It is my honor to stand up here in front of my colleagues and give my farewell speech. It has been eight years that I've been a state representative and I first ran for office at the age of 24 years old and was elected at the age of 25. I want to tell a little story as I begin. I remember a senator convincing me to come to the Capitol. You've got to come. You've got to come. You have a good time. This is for you. You've got to do this. You have to do it. And I was like, I'm not coming to the Capitol. I'm not not. It's intimidating. I'm not coming all the way up to the Capitol. So I remember about 10 years ago, I came to the Capitol for the very first time and it was signing die. The bells ringing. People were arguing. I think I might have sought somebody to get into a fight. It was a madhouse here. And I looked around and I said, oh, this is me. I can do this. This is for me. And ever since that day was the first day that I started with as an intern with Senator Lester Jackson. And it was amazing because he taught me so many different things. And we traveled so many places. And I just appreciate him for seeing a young woman and seeing the potential of what I didn't even see in myself. So I thank you so much, Senator Lester Jackson, for everything. I want to thank the speaker. And even though I'm of the opposite party, I want to say that one thing about the speaker is that people may think that he's intimidating, but he keeps it real. And I've had questions or I want to talk about my bill or I want to talk about something. People say, oh, come to me or come to me. I have went right to the speaker. And he's never said no. Now, he might have said no to the stuff that I want to get done, but he never said no to talk into them. So I appreciate you so much for that, Mr. Speaker. Even though I've been the vice chair for the last five years, and the speaker has never recognized me as vice chair, he always say state representative Erica Thomas, but I still love you. I am just very happy and excited about the next venture. I was crazy because I remember when I got my committees the last couple of years ago. And as at 30 years old, the speaker put me on the retirement committee, I didn't know why he would do that. I also want to thank Betsy and Camille for their hard work and for what they do for our press releases and our communication. And they make us sound really, really good on paper, for sure. So thank you so much, Betsy and Camille. I want to thank my husband. He's standing up in the back. And for everything, yes. For everything that he has done, it's so hard to have someone, your significant other that loves politics and loves it just as much as you do. He's written my speeches before. He stayed up all night helping me to do my research before I come in about bills, gives me opinions. And I just thank you for always being there every single day. And even taking care of our children, I call him Daddy Daycare. I want to recognize my two daughters Dakota Ademi and Adanique Ademi. These little women are troopers. I am so proud of Dakota. She started her when during the pandemic. She started her own online school teaching kids black history all across the world. She's been on TV all across the world Dakota School dot com. That's a plug. And she has really been doing some amazing, amazing work. And I really love you for everything. And I know that one day you will be a state representative. Okay. I also want to thank some of my colleagues. I want to thank the leader James Beverly. We have really come a long way from the beginning before I was a state representative and I was just to intern. And I've confided in you. You've confided in me. We've argued, we've fought. But in the end, you know that you are my brother. And even when I make it big in the world, I'm definitely not going to change my number. I promise. Okay. I also want to thank the dean of the house for his knowledge and his wisdom. And it's ever flowing. You know, anybody that comes to you, you'll give them that wisdom. You'll give them that knowledge. You don't hide it back from any freshmen. I mean, anybody that's been here for a long time. And we really, really appreciate all of the knowledge and the wisdom that you have is bestowed upon me and so many people before me. Thank you so much, Dean. Now I'm going to wrap it up. It's been eight years, but I'm not going to be a politician for long. So I'm not going to talk too long. I'm very excited about my new career in the TV production. I've always had a series of goals. One of those was to be a state representative. And another one was to be Oprah. I don't know if I'm going to do that, but I want to make sure that in my next venture that I shine a light on so many stories that are left untoweled. And getting a TV deal with a major network was amazing. But what's amazing is that I'm going to be able to tell people's stories, stories about women and people that have done so many amazing things throughout the world that have been left untoweled. And so I'm very, very excited about that. And just know, even though I am leaving guys, I will be up here and it might be with the camera shining on you guys. So as I wrap this up, I have two more people that I want to say something about. Representative Park Cannon and Representative Mary and Paris. They are like my two best friends. We talk for hours on the phone almost every single day. We read bills together. We talk about legislation. They have really been there for me and I'm not going to tear up. They have really been there for me through everything. And a lot of people say in the house and politics you have no friends and you have no enemies. And I believe that for a very, very, very long time. But with these two women, they have always been there to lift me up every step of the way. And I'm going to miss you all. And I hope that you all are going to miss me too. I thank everyone in this house because this house is like like none other. We sit beside Democrats. We sit beside Republicans. I sat beside Secretary of State Rappensberger for a couple of years. And we went back and forth about different bills. Or I'd argue with them, don't vote for this or he argue me, don't vote for that. But at the end of the day, we were still friends. And so that is what's so important about this house. I want you all to make sure that if you don't remember anything that I said in the speech today is to remember that no matter what happens on this house floor, no matter how much we argue, no matter how much we fight, I do believe that most of us love each other. Thank you so much. you while we're kind of settling back in, someone just made me aware and I wanted to mention to the members that today is National Vietnam War Veterans Day. Let's give our Vietnam Veterans a big hand. All right. We're going on now to the rules calendar. Going on to the rules calendar. The clerk will read the caption to Senate Bill 586. Senate Bill 586 by Senator Gooch, the 51st, June 30th, Watson, the 1st, and of the Barthay of the 31st and others to be entitled to amend Part 2 of Article 3, Chapter 4, Title 32. The official go to Georgia, Antietta, relaying the exercise by counties of power to contract for road projects generally as bill have heard the committee on transportation. That committee recommends the disbill do pass. Chair recognizes Chairman Jasperds to present the bill. Thank you, Mr. Speaker. For those of us on the Transportation Committee, we have a nickname Senate Bill 586, the Kevin Tanner Bill. When the chairman, Kevin Tanner was a transportation chairman, he saw this process and its effectiveness in Georgia DOT projects and wanted to use this tool also at the county level. What this bill does is allow county governments to utilize the same process as G DOT does when it comes to design bill projects. G DOT and counties, if they get to do this, puts out a bid through the RFP or request for project proposal process. The bidders are pre-qualified to build certain projects. The contractor is responsible for the project from the design to turning over the project to the county. The county under this mythic can select a builder that will both design and build the transportation facility, bridge, structure, or road. Counties must adopt by a resolution, the procedures that are to be followed concerning pre-qualification, advertisements, criteria for this award. I think you'll see a lot of detail in the bill on how this will work fairly for contractors and citizens in their very competitive bidding environment. The Georgia Highway Contractors Association works with this process across Georgia right now as in favor of this bill. In the end, it's about counties obtaining significant savings in project delivery and dollars and times. That's my bill, I'd be glad to answer any questions with our rating. You have no questions. Thank you. Asked your favourable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill will vote that those opposed will vote no and the clerk will unlock the machines. I have all members voted. If so, the clerk will lock the machine on the passage of Senate Bill 586. The eyes are 160. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 496. Senate Bill 496 by Senator Berkley-Levinth Watson, the first Hillary, the 19th and others to be entitled back to amend Article 2 of Chapter 16 in Title 45. The official go to George Antony.\n\nYou're relating to death investigations, so it's to require medical examiner's inquiry when a pregnant female dies and an inquest. Ms. Bill, I refer to the Committee on Health and Human Services that committee recommends this bill do pass by committee substitute. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring you Senate bill 14496. This is a tool as we continue our march to reducing the number of maternal mortalities in our state. There in our law already are a list of issues that must be reported to a metallics examiner or a coroner when somebody dies. This adds another one and explains one. It adds one to do with women that are pregnant but do not die from a car wreck or some other injury like that. That that must be reported to the coroner or the medical examiner. And also it explains what we mean by an unintended person that has died. And that is one that hasn't been seen by a physician in the last 180 days. If somebody, if a pregnant woman dies or from either one of those unattended or the fact that she's pregnant, it requires that you tell the medical examiner or the coroner in the area and they must report that to the regional perinatal center for further inquiry. And those are perinatal centers are as defined and identified by our Department of Public Health. Here again, trying to identify why a mother died during delivery or during delivery or immediately after or in the 365 days post delivery. That's what the bill does. If there are questions in Mr. Speaker, I'll be glad to answer them or I'll go ahead and yield the well and ask for your favorable consent. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will unlock the machines. On the passage of Senate Bill 496, the IZR 156, the NAZR 5, this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 534. Senate Bill 534, my senator Kennedy, 18th Miller 49, doodan 30th, gooch to the 51st and others to be entitled back to a men title 50. The official go to Georgia and Teta relating state government, system provide certain procedural requirements and considerations for the adoption of rules by state agencies. This bill I have referred to the committee on governmental affairs that committee recommends this bill do pass by committee substitute. Chair recognizes chairman Gaines to present the bill. Thank you, Mr. Speaker. I'm proud to present House Bill 5 Senate Bill, excuse me, 534 this morning. And what this measure does is it continues to provide a good environment in Georgia for our charitable organizations. We are fortunate in Georgia to have over 5,700 charities in our state and we've provided a great environment for these charities to operate and this measure will continue to make sure that Georgia is a great place. We have so many charities to do such great work and so this measure ensures that if there are additional regulations placed on those charitable organizations. And the general assembly would also have input into that as well. And so it's a simple measure that will continue to make Georgia a great place for charities. Mr. Speaker, I'd be happy to answer any questions if there are any. You have no questions. Thank you, Mr. Speaker. I yield the well and ask for the body's favourable consideration. Is there any objection to the previous question being ordered to chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute to chair here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here's none. The report of the committee has agreed to shall this bill now pass all those in favour of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 534. The eyes are 165, the nasors zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 345. Senate Bill 345, Senator Mulles, 53rd, hatched the 50th Anderson, 24th, and in the Varte, 31st and others. To be entitled to amend chapter 1 on Title 50, the Fisher go to Georgia, and to be relating to general provisions regarding state governments, prohibit state and local governments from matinating vaccine passports. This bill I'm referring to committee on health and human services. That committee recommends that this bill do pass by rules committee substitute. Chair will remind members that the rules committee imposed a one hour limit on debate on all the measures on the calendar today. And that will be allocated 30 minutes to each side not to include the initial presentation. Chair recognizes Chairman Bonnie Rich to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. I want to reiterate that today is National Vietnam Veterans Day. My second father, my children's papa, served in special forces in Vietnam. Thank you, papa, Papa John for your sacrifices and fighting for the ideals of a free society and for your service to our country. I bring to you this morning Senate Bill 345 vaccination for COVID-19 like all health care is a personal, deliberate decision to be made by an individual. If he or she chooses after consultation with his or her doctor, that's what I did. And it's what my husband and children did as well. We all for opted to vaccinate and to receive the boosters. We did so after weighing all of the factors recognizing we weren't completely confident that there would not be negative consequences. But we still are not confident that there won't be negative consequences down the road. But we ultimately determined we were more concerned personally with contracting COVID than we were with the possible side effects. My point is that that was our decision to make. We have friends, very intelligent, responsible friends who have made different decisions in their families. This is a decision that every Georgian should be able to make on his own. To that end, Senate Bill 345 will prohibit any governmental agency in the state from requiring the COVID-19 vaccine. There are exceptions in the bill for our health care workers and some state university employees who could be required under federal law to receive the vaccine. Without the protection that this bill affords, Georgians could be excluded from exercising their rights and privileges to participate in governmental functions, such as appearing here at the Capitol to speak on pending legislation, participating in our court system as plaintiffs or defendants, appealing property tax decisions, renewing their driver's licenses, attending school and accessing any other government service. This bill will have no effect on private businesses. This is in keeping with Georgian longstanding respect for the rights of individuals and private businesses to decide for themselves. And is also consistent with the United States Supreme Court's decision in January of this year that found that Biden's administration sweeping requirement on many of our nation's businesses went too far. People who claim a variety of political ideologies consider mandates to be an unacceptable infringement of personal freedom and choice despite having a personal belief in the safety and necessity of the vaccine. This is about being American, not Republican or Democrat. Compulsory vaccination is an interference with the human right of bodily integrity, which is part of the right to private life enshrined in our American principles. As recognized by Northwest University Health expert Dr. Tina Tan, I'm going to quote here, mandating that a vaccine be received is hard to enforce and may backfire as people feel that the mandate is heavy handed. Mandating a vaccine also may make certain persons less likely to receive a vaccine and more skeptical about the safety and effectiveness of it. It is important to maintain public trust and not force a vaccine upon a person until the person has a chance to make their own decision as to whether they will get the vaccine. Similarly, Johns Hopkins Professor Nancy Cass stated, quote, public health rarely starts with a mandate as plan A. In general, public health will do exactly what is happening with COVID vaccines, which is to try to help the public understand why a vaccine is effective, how a vaccine is safe. If it turns out that doing all of those things leads to sufficient coverage, mandates aren't needed. You're able to maximize this ethical goal of respecting people's autonomy and freedoms and maximize the benefits that we need from a public health perspective. If that doesn't happen, that's when mandates come into play. I'm continuing to quote here. Mandates in general depend on there being a really large and consequential public health threat and that less intrusive measures have not been sufficiently effective. All of these things are essentially justifying why it's okay to overrule the wishes of someone who doesn't want to get vaccinated. Ladies and gentlemen, we are here today. Our economy is thriving. Businesses in Georgia have survived. They're providing for their families, they're providing goods and services for us. We're taking advantage of it. Our children are in school. That is proof that our less intrusive measures have been sufficiently effective and that mandates are nothing more than a political overreach. I urge you to vote yes for this bill. Mr. Speaker, I will stand for two questions. You have some questions. Do you yield? I do. Chair recognizes Chairman Parsons. Do you're left for a question? Thank you, Speaker. Lady Yield. I will. Isn't true that in the beginning, your address you spoke of your stepfather, I believe, is our debate now? Yes, I did. Wasn't it true, and I want to add some extra to understand this relating to military, isn't it true that the US military are required to take vaccine as long as it's approved by the FDA? Is that not true? That I believe would be a federal mandate and that's not what we're discussing here. So my question then is related to our national guard, I assume that they would still have to take, they would still be required because they can be activated in the national service. It would still be required to take the vaccine if that's the requirement for the US military, is that correct? I would have to consult with council to give a definitive answer on that because I do believe that there are some state employees who are required to have the vaccine under federal law. So my educated guess would be that you are correct, but I couldn't say with certainty. I would appreciate your answer to the question. Thank you. Mr. Speaker, I know I have others who have signed up to speak for the bill. If I will answer one more question, and then I will yield the bill. Chair recognizes representative Anola Witts to your left for a question. Thank you. Does the lady yield? Yes, I do. Have there been any bills proposed this session that would mandate the COVID-19 vaccine? I'm not aware of any, but I am aware that there are local governments in our state that are mandating the vaccine and that's what this bill is going to address. Mandating the vaccine for citizens? Yes, and for employees. Mask one more question. Sure. Would this, right now in his executive powers, the governor actually has the ability to mandate vaccines in a public health emergency. Would this change that power? No, it would not at all. His executive power and emergency power would continue. So the governor would still have the power to mandate back this issue. Yes, he would. Thank you. Thank you. Mr. Speaker, I will yield the well. The lady is yielded the well. We have others who have signed up to speak on the bill. The chair recognizes representative Rebecca Mitchell to speak to the bill. Thank you, Mr. Speaker. I want to start this conversation with an acknowledgement that this particular space is hard. And I want you to know, I don't feel like I have all the answers. And if you are very certain, it's worth at what asking what makes you that certain? Because public health measures like vaccination are hard. They are. We need to balance the combination of the protection we get from the vaccines ourselves in addition to our responsibility to our community on one hand, with our feelings that we are independent agents and the space that is uncomfortable because medicine and public health has not earned trust from all Georgians. And well, that is a historical truth. It is also a lived truth for many folks in this chamber and outside of it. And our lived experiences do matter. We cannot step into the shoes of other members and we can't assume we know how folks got to where they are currently. I actually expected this conversation we're having today was going to happen well before our session started. And I reached out to two groups of folks to increase my understanding in this space. The most important group I reached out to is the folks are going to be most impacted by our precedent setting decisions. And at the same time, whose trust in government and public health has not yet been earned. I asked in every space I could, as many times as I could, if you know me and you've been in a meeting with me where there was an opening, you've heard me bring up the value of vaccines to our communities. And I asked folks several open-ended questions. I said bills that are going to make our communities less safe by starting down a pathway of codifying anti-vaccine rhetoric are going to come up. What made you decide to value the individual and community safety of vaccinations in the first place? What is the common space between folks like me who've studied infectious disease dynamics and the impact of vaccines on health and populations? And those who get vaccinated but who have real hesitancy? And the answer that was reflected back to me over and over again is simple. Community care. We want our kids to live in safe spaces. We want our parents to be as safe as they age. We want folks who are immunocompromised to be able to live the same lives as everyone else. But what we're going to do here today is not with that value in mind. And I'm sure the amount of disinformation you will hear today is profound. I can repeat many of the claims. The specifics of those claims don't really matter. And the value of debunking a single claim is not important. Because as one point of disinformation is debunked another will rise. And the most powerful element of emergent of doubt is simply pointing out that there are things that remain unknown because that is always true. I don't know that the sun will rise tomorrow but I'm pretty confident. I don't know how tall my children will be but I can take a guess. I don't know if I will get an accident today on my drive home so I'll wear my seatbelt. Uncertainty is always present. And in science we quantify it. In disinformation it's weaponized. I had a lobbyist unrelated to health walk into my office one day and share in conversation that he'd been one of the first generation to receive polio vaccines in the US. I want to share a point that we of my generation did not forget because we've never lived in a system that forced us to confront it. Several thousand children in the US died every year of polio prior to vaccination. Forty-eight thousand people were hospitalized. And if you look at the statistics the way I imagine you'll hear them presented today about COVID that's around 0.05% of children who are infected with polio. The total number of children whose families did not bring them home from the hospital after a measles infection was 400 to 500 in the US in the years immediately proceeding vaccine introduction. Do not let anyone in this body tell you that children are supposed to die because they can make those lives turn into percentages with many zeros. Children are not supposed to die. While this bill preemptively targets a single vaccine the speeches you're hearing today and the rhetoric destabilize the security of all vaccines for all Georgia communities. And that impact will be inequitable. So I rise today in opposition to putting us on a pathway that we cannot course correct. On a path that erodes the community building efforts of those who are working so hard to develop a more equitable public health and community landscape. Both from a community leader or activist perspective and from those within the realm of science. All of us have to come together and we right now with this bill are making that space harder. Some actions once taken provide precedent that we will find impossible to undo. I ask you to join me in voting no. Thank you Mr. Speaker and I yield the well. Chair recognizes representative Jenner to speak to the bill. Thank you Mr. Speaker. I'd like to first make some general observational comments about what I've heard from the well. First the degree of polarization is directly related to the amount of time that is not allowed for debate on a bill. When people from the well acknowledge that no one is listening and no minds can be changed. Think about how hard that is to establish credibility in a body that does not value discussion or dissent. All of us here should pause. Especially women legislators who take the time to establish their subject matter expertise, emphasizing their academic credentials. With that said, I'm aware that my comments regarding the contents of Senate Bill 345 are lost in a vacuum of partisanship. But it seems important not to pass up the opportunity to learn from what the COVID crisis reveals about governance. Given the uphill battle that any policy faces when it targets community needs rather than policy or individual beneficiaries, there seems little chance that this pandemic has created a sea change in our public health system. It's clear that the political dilemma of public health is not fixable simply by replacing one chief executive or a party with another. The public health system itself focuses largely on community-wide disease prevention and control rather than the treatment of individuals. Many of the nation's greatest advances in lowering death and disease rates resulted more than a century ago from immunization, sanitation, and other community efforts to slow or stop the spread of infections. For example, yellow fever, tuberculosis, or measles. The very effectiveness of these community-wide campaigns have made it possible for individuals to forget how deadly these diseases are for the policy shifts that have occurred. In other words, as the memory of epidemics faded, individual rights became much more important than collective responsibility. This great forgetting continues. Nobody wakes up in the morning and says, thank God I don't have smallpox or thank God my water is potable or I had COVID and it wasn't that bad until the need to prepare for and if possible, prevent the spread of a communicable disease means that we pass Senate Bill 345. Our strategy is neglect, panic, and repeat. I understand that the nature of our political ideology resists putting scientific expertise into the driver's seat. Do what I say because I'm the expert. It's uneasily within a system that claims to operate democratically, especially one in which individualism predominates. The resistance to mask wearing and vaccination are examples of how claims to scientific truth can be taken as a threat to individual liberty. Since Alex Detokville visited America in the early 19th century, many have noted that governance practices particularly at the local level could temper individualism, but his hopeful forecast is illustrated in this measure has not panned out. In my mind, what is required is living in the truth. In the current era with the blizzard of lies, deception, fakery issuing from social media, living in the truth has a quaint era about it. Nevertheless, it is a stance that anyone, especially legislators, should take up. What I'm asking each of you to do today is live and speak within the truth. I don't think it means using my voice. I'm not saying silent. I am lifting the curtain on what could be considered a last mile problem and voting to support local public health efforts. As I yield the well today, I ask that you vote no. Okay, Chair recognizes representative Sains to speak to the bill. Thank you, Mr. Speaker. I want to spend a lot of time speaking about the technicalities of the bill because Chairwoman Rich did a great job discussing its need, but I think it's worth noting the underlying premise of this bill. President Ronald Reagan said it best when he said where a government has gone too far is deciding it can protect us from ourselves. And this is what this bill is about. It's not about being pro-COVID-19 vaccine or anti-COVID-19. I, like many of you, have decided to make that choice. Not one member in this chamber was required or mandated to receive a COVID-19 vaccine. We were trusted that we had the wisdom to know what was right for us, what was right for our family. And this bill simply submits that same right, that same courtesy to citizens of this state. I would say this would be an aptly named bill if we called it the Constituent Confidence Act because it relies on the wisdom of those who voted us in to have the wisdom to make the right choice. And some of us seem to be lacking in that confidence. I appreciate those who have spoken to this bill, but I wrote down a quote because it seems a pretty scary notion, do what I say because I'm the expert. That is not something that comforts me coming from the government. I appreciate your time and I yield the well.\n\nChair recognizes representative camp to speak to the bill. Thank you, Mr. Speaker. And good morning, colleagues. It's 10 minutes, she'll 12. So I know everyone's probably stomach is growling at this point. But to me, this is a very important issue. And my household, my mother and father-in-law lived during COVID. And my father-in-law at age 97 made a choice not to get the COVID-19 vaccine. He did so because he had cancer. And he knew that he was going downhill. And I don't know if he did it because he wanted that shot to go to someone else. Or if he knew his time on this or it was Earth was very short. But he made that decision himself, by himself, with his wife. Now my mother-in-law, on the other hand, she wanted to get the COVID-19 vaccine. And again, that was a personal choice for her. I think that, you know, we kind of look at this sometimes as a collectivism, as representative trainer said, or an individualism issue. And I mean, it is. It's your body. COVID-19 vaccine passports create a system that would penalize people with religious or philosophical objections, as well as those who simply choose not to take the vaccine for whatever reason. I did take the COVID-19 vaccine. But as an individual, I would be very offended if I decided to go to my building and zoning office to get a building permit. And they asked to see my card before I walked in the door. Why? Because as an individual, I should be able to make choices for myself regarding my health care. And while the argument for public health is a true one, and we do have vaccines, and I'm thankful for the vaccines we have. I'm thankful for the fact that Polio is not rampant nor smallpox. But the reality is, no one was asking any of those individuals to walk around with a card to say they got a smallpox vaccine to go inside, cougar, or anywhere else. To me, this is an individual issue. I feel that those have the, we all should have the ability to make our own choices. And that's why I'm in favor of this bill. If you look online 27, even though Chairman Rich did a fabulous job, it says no agency shall require proof of the COVID-19 vaccine for any person as a condition of providing any service or access to a facility, issuing any license permit or other type of authorization or performing any duty as such agency. This bill does have a sunset. There is a way to back out of this. If we find that there is another issue, then simply we let the sunset happen and it goes away. But our numbers have been declining. People have gotten the vaccine. The truth of the matter is, in the future there could be something else. We need to give individuals the right to make choices and they will trust public help more. Thank you, Mr. Speaker. Chair recognizes, represented, or Chairman Matthew Eck to speak to the bill. Thank you, Mr. Speaker. And I too rise today in support of Senate Bill 345. This is an important issue and it's important to my constituents in the counties that I represent. I've been contacted by many of them and it's very important to the Georgians all across our state. 19 states have mandated vaccines for state workers. It includes Washington State, Oregon, California, Nevada, Colorado, New Mexico, Minnesota, Wisconsin, Illinois, North Carolina, Virginia, Maryland, New York, and Massachusetts. Large cities like New York, Washington, D.C., San Francisco, New York City, Boston, Philadelphia, Chicago, some of the cities that have mandated vaccine passports. As a fall of 2021, 21 states have banned the vaccine passport. To some extent, these states are Idaho, Utah, Arizona, Arkansas, Montana, Wyoming, North Dakota, South Dakota, Kansas, Oklahoma, Texas, Iowa, Missouri, Alaska, Mississippi, Indiana, Tennessee, Alabama, Florida, and South Carolina. I submit to you that Georgia's values are much much akin to those of the latter than of the former. I'm proudly voting for this bill and I urge you to do as well. Thank you, Mr. Speaker and I yield the well. Is there any objection to the previous question being ordered? Chair here is not in the previous question as ordered. We have a minority report and then we have the chair's time, 20 minutes each. The chair recognizes representative Mitchell for the minority report. Thank you, Mr. Speaker. First of all, let me just say I'd like to start off with some true isms. The fundamental responsibility of government is to protect its citizens and the two inventions that have sustained and prolonged and certainly protected human life are the purification of water and vaccinations. So it's puzzling in some respects that we find ourselves in this posture today. The debate over the last two and a half years has become polarized primarily because of political utterances, doing at least part to a declining trust in our government leaders. Based with this reality, what would some government leaders do? Some would so even more distrust. I submit to you that distrust itself is infectious. For instance, some perhaps even in this room believe vaccines are part of a vast government conspiracy to exaggerate the dangers of the virus for some nefarious purpose. A statement attributed to Oliver Wendell Holmes, the legal scholar who served as Associate Justice of the U.S. Supreme Court goes, My right to swing my fist ends where your nose begins. You ought not have the right to infect me. You see, if you contract the virus, your family, your friends, coworkers, classmates, indeed all those you interact with are placed in jeopardy. If in fact the virus could only affect those who would choose to go unvaccinated, I would not be before you in opposition today. In fact, I'd be for this legislation. This kind of reminds me of the motor cycle helmet mandate that some sought to end in Georgia and other states about a decade or more ago if you'll remember. But some of the insurance companies got smart. They declared if you chose not to wear a helmet and you injured yourself or worse, and it could be proven that the damages sustained could have been prevented had you worn a helmet than you would be responsible for paying for your own care. Not surprisingly we don't hear too much about that issue today. Likewise, I think that would really be personal responsibility. Good conservative government in this instance. You choose not to get vaccinated. You become infected. You would be responsible for your own care, not the insurance company, certainly not the state. So make no mistake about it. If this proposal becomes law, there will be some Georgians. Just even in your own district that will surely die, they would have otherwise lived if we required vaccinations. That is uncontroverted. History tells us the same argument being made by the proponents of this bill was espoused when the government mandated vaccinations for diphtheria, polio, measles, mumps, rubella, tetanus, and others. You would be hard pressed to find credible mainstream voices who share that belief against mandating vaccinations for those diseases today. I suspect the same will be true of this vaccination effort in the very near future as well. The fundamental responsibility of government is to protect its citizens. SB 345 marks the first time that Georgia would ban any vaccine from being required for public school participation just as the vaccines are being made available for this age group. Now if all of that didn't move you, let me give you the words of others that might. Some of you may be familiar with Marcus Lamb, noted conservative TV and evangelist and prolific anti-vaxxer. As a result of being infected with the virus told his family on his dying bed, please go get vaccinated. I don't want you to go through what I'm going through. Each Scott Apley, Republican official from Texas who regularly made an anti-vaccine and anti-mass comments online shortly after posting his last critique of vaccinations, he passed away after being infected with the virus. His wife would later say her husband regretted his stance on vaccinations in his final days. John Scott Parnie ran the Quincy Diner in Southern Michigan. Not only did he oppose vaccine and mask mandates, he defied the lockdown orders in effect and kept his restaurant open. Parnie who previously served in the Marine Corps became infected and thus began a long battle to overcome the disease. During his battle, when he was able to talk, John shared with his family that he would be getting vaccinated as soon as he was able because that battle was worse than any training he endured in the military. Unfortunately for him, he never recovered. I could go on and on and on with examples, but let me just give you one last one. Or was he who said, so everyone go get your shot? 95 percent, maybe even more than that, it works incredibly well. I would recommend it. I got the shot and the booster. It's a great vaccine. It's a safe vaccine. Those words were for former President Donald Trump. I urge you to join me and help us save lives by opposing this measure. Thank you, Mr. Speaker. Okay. We now have the Chairman's time. Chair recognizes Chairman Cooper for the Chair's time. Thank you, Mr. Speaker. I relinquished part of my time to represent Dr. Mark Newton. Dr. Mark Cooper has yielded a portion of the Chairman's time to Chairman Newton. Chair recognizes Chairman Newton. Thank you, Mr. Speaker. Just a few dates, 53 years, 10 years, 20 years. Those are the amount of time we worked on smallpox before it was first mandated. 10 years for polio. And frankly for polio, it started as an injection. There may be somebody in this body who got the injection, but it was a, but it was latter changed to the oral polio. D.P.T. is a vaccine, diphtheria pertussis, tetanus is one that's given today. But now there's a T-dap. There's a D-tap. There's about four different versions because we keep learning new things. Now just because vaccines had a long period to where they were proven before we mandated them in children, which is something that keeps getting brought up about our five-year-olds, you know, in two months, four months, six months, things like that. Just because we had a lot of study doesn't neglect the fact that this COVID pandemic was a once in a century thing. It was something unusual, just like 1919 in the flu outbreak. It was something that needed a record pace to do incredible work. And I think that's what happened. We did get a vaccine that is incredible. I saw firsthand, like many others in healthcare, did the dramatic difference between the illnesses early in the disease and even the ones we still get now when they're positive and may have to be in the hospital, but nowhere near the respiratory distress that there was earlier in this. What I want to make sure about this bill that we understand is even though this vaccine hasn't had all the amount of decades sometimes that were available for the other ones, it's still a fabulous vaccine. I've had all mine, my wife has many of us have, and I've frankly given hundreds of them. And I think it's an amazing step forward that we've been blessed to have, and it has changed the course of this illness to where now it's much more of a mild illness, let's say, than anything we saw in the previous years. What I want to make sure of is that you can be incredibly pro-vaccine, which I am. I'm pro-COVID-19 vaccine. I've got a new one-year-old grandson who's gotten all his vaccines, all our kids have. You can be very pro-vaccine and still support this bill. This bill is simply more about asking an adult, a requiring an adult, to show papers, to show proof of a vaccine that is granted, it is a new vaccine, less than a couple of, less than a year and a half old, but requiring them before they can access government services. Any needed government service, whether it's a building permit, which is help with unemployment, whatever it is, any government service, but for any level of government to require one of your constituents to show a piece of paper prior to being able to access, pay their taxes, even appeal their taxes, all the government aspects. I think you can be very pro-vaccine, like I am, and I know the chair lady is, you can be very pro-vaccine, including pro-COVID-19 vaccine, and still support this bill for those citizens who need to access their government services at any level of government. I hope you'll vote yes on it, and be pro-vaccine and pro-liberty for people to be able to access the needed government services. I yield well. Chair recognizes Chairman Rich for the balance of the chair's time. Thank you, Mr. Speaker. I want to start by making sure that the record is clear. There has not been any anti-vaccine rhetoric coming from this well. In fact, quite the contrary, I believe that you have heard from every one of us who has spoken in favor of this bill that we have in fact received the COVID-19 vaccine ourselves and that we believe it was the right decision for us. Because that is our decision. What has been happening here from people from opponents to this bill is they are conflating the principle of whether vaccines are good and whether the government should mandate them. Those are two separate issues. Something else that is quite clear from what we are living right now is that we know in Georgia we do not need a vaccine mandate for our life to go on. The helmet and the seatbelt analogy are completely off base. Putting something into one's body is very different than wearing a helmet or a seatbelt. Again, this is an issue of liberty. It is an issue of freedom to choose one's own health care and health issues. For that reason, ladies and gentlemen, I request that you vote in favor of freedom and liberty and vote yes to Senate Bill 345. Thank you. The previous question has been ordered. Is there any objection to adopting the committee substitute or I'm sorry, the substitute offered by the committee on rules? Chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does represented to Sharper rise? Probably an inquiry. Stature inquiry. Is it not true that this would be a great bill if we had this problem going on in the state of Georgia. The thing about it doesn't affect the private businesses but it does affect the public. However because there are state agencies that we actually have the rule over in a sense to governor that we haven't been having this problem but people have been turned away at any of those public places that we're mentioning inside of this bill. So with that said, like I said, it would be great if we needed it. But now we're spending a lot of time, even session time, on this bill that's really not needed because it's not a problem that we're having right now in our state. Thank you. What purpose does representative McLeod rise? Parliamentary inquiry. Isn't it not true that 35,416 Georgians are dead today from COVID and those are loved ones and not numbers? What purpose does chairman set, floor rise? Parliamentary inquiry. To the gentleman's question earlier, isn't it true that this state's not done this generally but other states have and we want to make sure this practice does not happen in this state as it has in others. Isn't that true? Mr. Speaker. If the gentleman's so states, all right, if all members voted, have all members voted. If so, the clerk will lock the machine on the passage of Senate Bill 345. The eyes are 99, the nays are 67. This bill having received the requisite constitutional majority is therefore passed what purpose does chairman Rich rise to make a motion? State your motion. Mr. Speaker, I move that Senate bill 345 be immediately transmitted to the Senate. Chairman Rich has moved that Senate Bill 345 be immediately transmitted to the Senate. Is there objection? There is objection to the lady move. I move. Lady moves. All those in favor of immediate transmittal will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted, have all members voted. If so, the clerk will lock the machines on the lady's motion for immediate transmittal. The eyes are 99, the nays are 67 and this bill is on its way to the state Senate. Chair recognizes representative Alexander for an announcement. Thank you, Mr. Speaker. Today is our last and final day for the women caucus. We will meet in room 216. Lunch will be served and we will get on a Zoom call to listen to our speakers. Thank you. This House will be in recess for lunch until 1.30.",
  "updated_at": "2026-02-13T22:38:15.192297+00:00"
}