{
  "video_id": "MyMYT22k-d4",
  "url": "https://www.youtube.com/watch?v=MyMYT22k-d4",
  "title": "Georgia Senate 2026 - Day 4 AM Session 2",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": null,
  "duration_minutes": 42,
  "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 4 AM Session 2 session:\n\n## Overview\nThis session focused on routine proceedings, with no major legislation introduced or passed. The session featured a morning devotion led by Pastor Anthony Booker, who provided a sermon emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\n- **SB 399**: To amend Article 3 of Chapter 11 of Title 31 of the Official Code of Georgia Annotated.\n- **SB 400**: To amend Part 1A of Article 7 of Chapter 3 of Title 20 of the Official Code of Georgia Annotated relating to non-public, post-secondary educational institutions.\n- **SR 574**: To recognize and commend the Susan Jolly Foundation and the Georgia Cancer Control Consortium.\n\n## Notable Moments\n- Pastor Anthony Booker delivered a sermon during the morning devotion, emphasizing the importance of serving a higher purpose beyond just one's day-to-day work.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe session noted the excusal of several senators, including from the 35th, 10th, and 30th districts.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "Good morning.\nGood morning.\nThe Senate will come.\nTortors.\nAll right, let me try that again.\nTime for Gavine has arrived.\nThe Senate will come to order.\nAt this time, I will ask all unauthorized personnel\nto exit the chamber.\nWe've got new technology up here.\nI'm trying to get used to you.\nRegan, I was staring to six.\nGood morning, Mr. President.\nToday is a great day in the state of Georgia.\nA little bit of a sad day.\nGot the governor giving his last state of the state.\nBut it'll be a proud day to be a Georgian.\nMr. President, there are no pages.\nAgain, colleagues, promote the page program.\nLet's get them in here.\nSo we can do our business.\nthe journal has been read and found to be correct some move we dispensed with\nthe reading of the journal I thought you were in charge of the page program\ntheir senator we do we do have a very few pages compared to last year we had\nan abundance of pages last year so need to find out what's going on there the\nSecretary says they're coming, so is there objection to the spencing of the reading of the journal chair here's nine the reading of the journal?\nIt's spenced with\nCircus?\nHis objective is to to the\nsafety of the general chair\nand general is to spend with\nis there p шon confirmation\nin the journal\nchair of his general is\nconfirm.\nAll centers, we have bills\nand resolutions to introduce.\nPlease bring them Secretary's\ndesk.\nAt this time, first reading\nreferences to senate bills and\nresolutions.\nSenate Bill 399 by\nby Senators Harbin of the 16th and others.\nA bill to be entitled an act to amend Article 3 of Chapter 11 of Title 31 of the Official\nCode of Georgia Annotated.\nOh, I think so too.\nSenate Bill 400 by Senators Burns of the 23rd and others.\nA bill to be entitled an act to amend Part 1A of Article 7 of Chapter 3 of Title 20 of\nthe Official Code of Georgia Annotated relating to non-public, post-secondary educational institutions.\nI am in education.\nSenate Resolution 574 by Senator Red of the 33rd.\nA resident we should recognize in commanding the Susan Jolly Foundation, the Georgia Cancer Control Consortium, a program that joins us.\nMr. President, that completes the order.\nSecretary Reid reports to the Standing Committee.\nMr. President, the Senate Committee on Assignments has had under consideration the following appointments to the Judicial Qualifications Commission.\nThe Honorable Alison T. Burleson appointed by the Supreme Court, Mr. Andrew J. Welch, the third appointed by the President of the Senate.\nThe Honorable Brian and Rick been appointed by the Supreme Court and has instructed me to report the same back to the Senate with the following recommendation that the appointments be confirmed and submitted respectfully submitted Senator Burt, Honorable Burt Jones Chairman Mr. President that completes the order.\nIt is now time for the morning roll call.\nAre there any motion to excuse?\nSecretary will call the roll senators.\nWe're going to have Senator from 41st.\nThank you, Mr. President.\nAs for unanimous consent to excuse the senator from the 35th and the 10th.\nSenator, that objection is from the-\nI'm sorry, excuse me, from the 33rd.\nThat objection is from 33rd and the 10th are excused.\nSenator from the 15th.\nPresident, ask unanimous consent to excuse the Senate from the 30th.\nShe did, Senator, thank you.\nThank you, Senator, any other motions to this use?\nSecretary will call the roll, Senator,\nsignify your presence by voting the A-switch.\nSecretary, unlock the machines.\nYou\nYou\nYou\nIt is now time for our morning devotion, all senators, please take your seats and cease all conversation.\nI would ask that the doorkeepers secure the chamber at this time.\nI'll recognize our leader from the 22nd to lead us in our pledge and introduce our chaplain of the day, Senator.\nplease stand for the pledge of the United States.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands, one nation under God, indivisible, with liberty and justice for all.\nNow to the Georgia flag, I pledge allegiance to the Georgia flag, which it stands,\nwisdom, justice, moderation, and courage.\nThank you, good morning, it is my honor today to introduce Pastor Anthony Booker, a gifted\npreacher and pastor and teacher who has had his call in since childhood, as there are\nstories about him preaching to his childhood neighbors and friends and baptizing them\nin a friend's pool.\nHe finally took that childhood passion to the pulpit, given his first sermon in 1992\nand becoming ordained in 1994.\nHis first church was New Hope Baptist Church in Harlem, Georgia, where he preached from\n1997 to 2020, and 2020 became the pastor of Broadway Baptist Church in Augusta, Georgia.\nPastor Booker has numerous accolades, including the State Coordinator for the State Baptist\nYouth Convention Executive Board.\nHe's also a member, he's also a presiding president of the Augusta Baptist Ministers Conference.\nHis most recent success or greatest success is that he also is a family man, having married\na bond booker in 1998 and he also is the parent of two children.\nIt is my pleasure today to introduce a good friend and a great preacher, Pastor Anthony\nBooker.\nI just want to share with you, late one evening, a young intern stayed behind in his office building, long after everyone else had gone home, the lights were dim, the halls were quiet in the work on his desk filled invisible.\nvisible. He paused and looked around and whispered, does any of this even matter?\nJust then an older gentleman passing, pushing a cart, passed by his son, every\nlight that stays on after hours and his buildings because somebody believes\ntomorrow is worth preparing for, because you're working for someone and\nsomething greater. The intern never forgot that moment.\nwhat he thought was small, someone understood that it was just shaping the future.\nHe came in the next morning different, no new titles, no new pay, but a new sense of purpose.\nHe realized he wasn't just feeling space. He was serving something greater than himself.\nAnd that's the question for each one of us this morning. Not simply what do we do,\nbut who are we really doing it for? The Pazapal, his writing and Colossians chapter three,\nverse 23 and 24 says whatever you do work at with all your heart as working for\nthe Lord not for human masters since you know that you will receive inheritance\nfrom the Lord as your reward is Lord Christ you are serving Paul speaks to\nbelievers living on the pressure and limitations he reminds them that dignity\nis not derived from titles but from purpose how a Thurman once said the work of\nof the spirit is to make life whole.\nThese verses call us to come together\nto bring our faith, our character, our conduct, our ability,\nand our giftings together.\nPaul suggests to us that every role becomes sacred\nwhen Christ is at the center of which you and I serve.\nThis text is Taylor to teach us this morning,\nthree truths, number one,\nthe measure of our work is the heart behind the work.\nPaul says, whatever you do, work at it with all of your heart.\nBeloved God is not impressed with his ability.\nHe has moved by our sincere heritage.\nIn fact, the scripture says, the Lord looks at our heart.\nDivided hearts produce shallow impact.\nBut whole hearts create trustworthy leaders.\nThe second thing that takes shows us\nis the true audience of our work is higher than human approval.\nPaul says it's working for the Lord, not for human masters.\nWhen God becomes our audience,\nwe are freed from the addiction of Paul's\non the proper right of saying warns us\non that the fear of the people becomes a snare.\nIf a proven becomes our aim,\nmoral and spiritual compromise becomes our habit.\nBeloved when God is our audience,\nconscience becomes non-negotiable.\nbecause eternal perspective is guarded by our moral courage.\nThe possible says that you and I must obey God rather than man.\nSo the first thing this takes shows us is the measure of our work is literally how hard\nis fixated on what you and I do.\nThe second thing here, the true audience of our work is under, it's higher than human\nimprovement.\nBut then third and final, we notice in this thing, this takes shows us that the labor of\nof our work is seeded with eternal meaning.\nThe possible say as you will receive\nan inheritance from the Lord as your reward.\nGod honors faithfulness beyond visible results.\nI'm glad to do not, Texas do not work,\nbe rearing where dwell doing,\nbut in due season you will reap what you have shown.\nPaul says it is the Lord Christ\nthat each of us are serving.\nSo you and I serve beyond titles.\nYou and I serve beyond just this season\nthat what you and I do will last a lifetime.\nAnd God will reward us, not just about what we do,\nbut in the heart and the spirit that you and I do it in.\nMay we bow, may we pray.\nI God, our Father, the gift of every good and perfect gift.\nWe come before you with hearts full of gratitude\nfor the opportunity to serve the people of this great state.\nGod, we thank you for these diverse voices,\ngifts, and abilities gathered here today,\nand God for the privilege of leading with integrity\nand wisdom.\nFather Grant, each of each senator,\nclarity of mind, strength of conviction,\nand humility of heart.\nGod, the deliberations, guide them each and every day.\nFather, remind us that true leadership\nis marked by service and made their work honor\nthe trust placed within them by those who selected them.\nLord, in the moments of disagreement,\ngrant patience and understanding\nand moments of challenge, grant courage and perseverance,\nbless their families, protect their health\nand let their peace and let your peace\nand your grace reign within this chamber.\nGod, we ask you, nine Jesus name,\nthat you, your glory, may rest upon this place\nAnd Father, all that they do this day and beyond,\nmay bring your name glory,\nand may the Father, the people of the state of Georgia,\nbless them now in a special way, in Jesus name.\nAmen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nWe've got some very special guests today, we've got some very special four-legged guests\ntoday here.\nWe've got children's healthcare with us and some of their physicians and staff and service\nanimals are with us, and to introduce our doctor of the day, I recognize the good senator\nfrom the 39th to introduce our doctor of the day.\nGood morning. Thank you, Mr. President. I have the pleasure of introducing Dr. Shriek\nKent Iyer today. He is the chief medical and quality officer for Children's Health\nCare of Atlanta and a professor at the Emory University School of Medicine. He's also\nAlso a member of the quality committee of the Board at Choa, as well as a trustee on\nthe Children's Care Network Board.\nPrior to these roles, Dr. Iyer was responsible for leading a portfolio of related to Cincinnati\nchildren's efforts to improve community and population health.\nHe has had so many roles and extensive leadership in the industry.\nHe has led several large successful improvement efforts at varying levels of the system.\nOn a national level, he served as the Improvement Advisor for the National Pediatric Cardiology\nQuality Improvement Collaborative, which was sponsored by the Joint Commission on Congenital\nHeart Disease.\nAdditionally, he's been an Innovation Advisor to the Center for Medicare and Medicaid\nInnovation.\nHe served as a mentor for faculty interested in a path of improvement leadership and has\nbeen a teaching faculty in several improvement courses.\nHopefully none of us in this room will need him today, but welcome Dr. Iyer.\nThank you so much for that introduction.\nI'm Shrikant Iyer, as she said, I'm the chief medical and quality officer from Children's\nHealthcare, Atlanta, and in that role, I'm responsible for the quality and the safety for\nall the children that we serve.\nI am thrilled to be joined by a group of folks from Children's, our facility dogs, and\ntheir handlers.\nSo I hope you get a chance to meet them.\nIf you ever wonder what the therapeutic effect is, just meet them.\nIt's really, really a special thing.\nThis is Reggie up here in Handlers Cara.\nWe have Reggie, Dumplin, and Aston.\nSo I hope you all get a chance to meet them.\nWe are a free standing children's hospital in the state of Georgia, and as such we serve\nchildren from all 159 counties.\nIn fact, we've served children from every House and Senate district.\nLike you, we are committed to making children better today, healthier tomorrow.\nAnd most importantly, I just wanted to say thank you.\nThank you for the hard work that you do.\nThank you for your attention to healthcare issues.\nThank you for recognizing that children are simply not little adults.\nAnd lastly, I'm happy to serve in this capacity at Phil honored.\nMy only wish is that you don't need any of my services today.\nThank you.\nAll right.\nGood job.\nGood job.\nAll right.\nGood job.\nYou\n.\n.\n.\n.\nAre there any unanimous consents?\nDoes, I'm sorry, Senator from the lies for a purpose to you, rise.\nThank you, Mr. President.\nI ask for unanimous consent to excuse the senator from the second for business outside the gap.\nWithout objection, Senator from the second is excused.\nIt is now time for the points of personal privilege any senator will wish to share whatever\nwisdom they have today, bringing out senator from the 30th.\nThank you Mr. President.\nIf I can have y'all attention real quick, I've got some news I just want to share with you.\nSeveral of us in this body may have served with a state representative Bill Humbery back\nin the day when he was in the state house.\nBill has been sick for a little while now and I just got a text a little while ago from\nhis wife Bill passed a little bit earlier this morning and for those of you that didn't\nknow Bill, I'll say a few words about him because I got the chance to know him in Douglas\nWhen he was elected to fish when I was a police officer and we got to become good friends and then when I got elected, I had part of Douglas County and Bill had part of Douglas County.\nSo we got to become even better friends.\nIf you didn't know, there wasn't a better person than Bill Henry.\nHe would do anything in the world for you.\nHe would help you.\nDidn't mayor Ross out of the out, but he was just a genuine white person.\nSo I just want to let everyone know that, and if you would, if you'd join me in a moment of silence, I appreciate it.\nPlease stand and send it as a question of a moment of silence.\nThank you all and they got blesses family and him.\nThank you.\nThank you Senator.\nBill was a good, good man.\nHe will be missed.\nI thought some prayers were with his family.\nBreak it down to Senator from the 39th.\nGood morning again, colleagues.\nI just want to take a quick moment to acknowledge something that's really special happening\nhere at the Capitol today as part of keeping Georgia while day.\nFor the second year, Representative Marvin Lim and I partnered with the Georgia Department\nof Natural Resources to launch the 2026 Georgia State Parks and Historic Sites art contest.\nThis initiative invites high school students from across our state to capture the natural\nbeauty, rich history, and wonder of Georgia State Parks and historic sites through visual\narts, paintings that reflect how young people see and experience the outdoors.\nThis year we received 238 submissions, double last year's total.\nAnd today our top three winners, along with those who placed in the top 10, are here with\ntheir families as we prepare to showcase their work in the South Atrium beginning at\none o'clock.\nThese young artists are incredible.\nIt was very, very difficult to do the judging to determine our winners.\nThey stood out not only for their talent, but for their ability to remind us why Georgia's\nparks and historic sites matter.\nAnd I really encourage you, please, to take a moment this afternoon to walk through the\nSouth atrium.\nYou will want to see these paintings.\nAgain, these works remind us why Georgia's parks and historic sites are worth preserving\nand why investing in young people is always the right choice.\nto all the students who participated.\nThank you for sharing your gifts\nand to the winners, congratulations,\nand to our partners at the Department of Natural Resources.\nThank you for celebrating the powerful intersection\nof art and nature.\nThank you.\nThank you, Senator.\nSo I want to remind everyone that, you know,\nobviously today is the state of the state\nand we'll be lining up at 10.45, gathering up back there\nit back there in the back to go over to the House Chambers, but I would like to remind\nthe senators who were part of the governor's escort, escort into the chamber is you do in\nthe governor's office at 1030, so probably head on down there, you get a chance.\nBut before I go into any more points of personal privilege, I want to thank the senator from\nthe 8th. Senator from the 8th, I want to thank the Balaus Estate University for sending\nus a helmet that was signed by everybody. Very kind of the group right there. Tell those\nyoung men and tell the coach down there, I really do appreciate it. You know, actually\nSenator, actually based on the reception we got last year in the house, you might want\nthis helmet for today. I don't know. But we appreciate that.\nSenator from the 43rd.\nThank you, Mr. President.\nGood morning, colleagues.\nDo you know what today is?\nDo you know what today is?\nWell, it's our founders day, and I rise to acknowledge and joyfully celebrate the 118 years of magnificent service by our beloved Alpha Kappa Alpha Sorority Incorporated.\nWe first graced the world as we were founded on the campus of Howard University, January 15,\n1908.\nThrough the brilliant courage and unwavering vision of our extraordinary founders, establishing\na legacy of service and empowerment to black women, evolving from a social club to an international\norganization intentionally focused on educational,\nempowerment, health, and community betterment.\nTheir legacy of sisterhood, scholarship, and supreme service\nto all mankind illuminates our path as we honor the vision\nand foundation laid on January 15, 1908.\nThe extraordinary impact of our beloved Alpha Capital\nAlpha Sorority Incorporated continues\nto make communities near and far a resounding message\nof a resounding yes that our 118th anniversary\nstands as a soaring summit to our timeless charge\nto be supreme in service to all mankind.\nAgain, happy founders day to the first\nand finest forever phenomenal women\nof Alpha Kappa Alpha sorority incorporated.\nThank you.\nAll right.\nThank you, Senator.\nWe recognize the senator from the 55th.\nReporting personal privilege.\nI speak of none other than Dr. Martin Luther King Jr., and I want to Paul simply\nto say that he has done a service to this nation, to the state, and to this world, because\nI dare say I would not be standing here but for his sacrifice, but for him giving of\nhis life, and we would not have a better nation but for what he has stood and done.\nAnd finally, I want to just share a couple of his quotes that stand on the north side\nof the capital, north, on the north part of the, if you go to Washington, D.C., there's\nseveral of its quotes that stand on the wall. And I guess I won't be saying that today.\nBut I would just say that let freedom ring not only, and it has so much meaning to me.\nBut when you say let freedom ring from Stone Mountain of Georgia, it has so much meaning\nbecause I was told by my great aunt that people that looked like me lived up on the mountain\nwith Indians and that we were displaced from on top of Stone Mountain and we were displaced\nfrom Stone Mountain and told that we should never be caught after dark in Stone Mountain.\nAnd if you're from Georgia as I am, then you know that there was a rumor that if you\ncalled in that place after dark, and if you looked like me, you would disappear.\nAnd they moved my families and some other families to a place called Ellen.\nThey named it after Aunt Ellen, an older black female, and they called it place Ellen Wood.\nAnd I'm so honored that letting Freedom Ring from Stone Mountain Georgia means so much\nbecause as a kid growing up in Griffin, Georgia,\nI was told not to be called in the dark in Stone Mountain.\nI now live in Stone Mountain.\nAnd I represent Stone Mountain\nthat there is no fear of me being in Stone Mountain anymore.\nSo when you hear Dr. King saying,\nlet freedom ring even from Stone Mountain, Georgia,\nit has special meaning because there\nwere people that looked like me that were told never\nto be called in Stone Mountain.\nSo I'm so honored to be serving with you\nand letting you know, let freedom ring all over this nation,\neven from Stone Mountain Georgia.\nI love you, God bless you.\nThank you, Senator Rick and I, Senator from 7.\nThank you, Mr. President.\nI rise today to talk about Georgia's healthcare crisis.\nBy midnight tonight, the last Georgian who can enroll in the marketplace will have made\ntheir choice.\nBut let us tell the truth about what that choice really is.\nFor hundreds of thousands of Georgians, it is not which plan do you like best, it is not\ndo you prefer this deductible or that deductible, it is one brutal question.\nDo you go with, do you go with health insurance or do you go without it?\nAnd the answer is being forced on families by sticker shock.\nEarly numbers from December show enrollment and Georgia access is down more than 190,000\npeople compared to last year.\nWe're hearing premiums in Georgia rising at an average of 200%.\nOne analyst are warning that almost half a million Georgians who are on the exchange won't be able to afford health care.\nThat is a statewide emergency, which is why I, with my colleagues, have co-sponsored Senate Bill 379.\nThe Georgia Health Insurance Affordability and Consumer Protection Act.\nThis bill uses state subsidies to cover the increased costs caused by expiring ACA premium subsidies,\nkeeping premiums affordable for Georgians.\npoliticians will shrug and treat this like a problem that will fix itself, but they\nare insulated from the consequences.\nThey are not the ones staring at a premium they cannot pay, skipping checkups, rashing\nprescriptions, or praying nothing goes wrong this month.\nBut what happens outside this chamber is real.\nThis is not just affect one household budget, it hits our whole system.\nIt means more people delaying care until it becomes an emergency.\nIt means more uncompensated care.\nIt means more pressure on hospitals, clinics, and local health departments.\nIt means rural communities getting squeezed even harder.\nAnd it means the rest of us pay too.\nBecause when the uninsured rate rises, the cost does not disappear.\nIt gets shifted, premiums rise, hospital stretch, scars, resources.\nAnd Georgia is sitting on a massive surplus.\nAnd there are leaders who will pretend we cannot afford to help Georgians.\nKeep their health insurance.\nThat is not fiscal responsibility.\nIt is a dereliction of our duty to look after Georgians.\nAnd tonight, when families are doing the math at their kitchen table, politics is still\ngetting the way of basic common sense.\nAnd here is a part we cannot dodge.\nIf we do nothing, people will get sicker.\nPreventable problems will become emergencies.\nSome families will bury people who should still be here.\nBy midnight tonight, Georgians will be locked out of affordable coverage unless they had\nthe luck to have money sitting around or the luck to have a job that covers it or the\nluck to never get sick.\nBut luck is not health policy and indifference is not leadership.\nWe are not helpless.\nOur hands are not tied behind our backs.\nWe can act.\nWe can lead.\nAnd we can do what is right.\nThank you and I yield a well.\nWe're going to have Senator from 35th.\nSenator from 35th.\nfrom 35th. Some eyes played a joke on our new senator.\nWe're going to have a center from the 19th.\nThank you, Mr. President.\nCenter from 35th, good to have you here with us. Light was on.\nNo one was home. As you know, next week's budget week,\nJust a reminder, we'll start our budget hearings on Tuesday.\nYou're all welcome to attend, even if you're not on the Appropriations Committee.\nWe'll start at 10 a.m.\nAnd of course, you know the governor will be one of the first ones to speak.\nTypically, we've been a little bit shorter on Thursdays.\nI would anticipate that Thursday's meeting will run a little bit longer this year.\nSo for planning purposes, if you're going to hang with us the whole time, you might not want to plan to make lunch plans on Thursday yet.\nIf there's any questions, feel free to grab me later on and thank you again for your participation in what's the only\nconstitutionally obligation, a constitutional obligation that we do have to fulfill.\nThank you, Mr. President, I yield the well.\nZaniel, Senator Wishraaz, on point of personal privilege.\nSecretary, read the resolution.\nSenator Resolution number 573 by Senator Harbin of the 16th and others.\nResolution recognizing and commending flat creek baptist church on the occasion of its 200th anniversary and for other purposes\nHis objection to the resolution\nIs the objection to the option of resolution cheer here's none the option of resolution\nall right so we'll uh,\nstand at ease for a little bit and uh,\nwait on my majority leader here to\ngive us.\nHe didn't recognize senator from the\nfirst for a motion.\nMr. President, I move that the Senate\nstand in recess pursuant to House\nresolution 97 for the purpose of\nfor the purpose of convening a joint session to hear and address from the governor and that\nupon dissolution of the joint session, the Senate stand adjourned until 9 a.m. Friday, January\n16th. Senator has moved. All those in favor of the motion?\n55 I say can I all those pose no I tried to slow this down as much as I\ncan we're still running ahead of schedule so so what we do when the what\nposture we're in right now is we will gather there in the back and obviously\nit's it's 10 45 and it will start making a way over there when it gets closer\nto 11 o'clock but everybody just kind of stay close and and then we'll\nwill walk over there together and walk out there together and hear the state of the state.\nSenator from 19th, what purpose do you rise?\nMake an announcement, Mr. President.\nFeel free.\nSenator, just remember also after the Governor's speech, your budget book will be available at the Senate Budget Office, which is over in L.O.B.\nIf you want to get ahead for next week's study period.\nAll right, everybody stay close and we'll walk over about 11 a.m. to the House Chambers.\nThank you, House, for your cooperation.\nYou\n",
  "updated_at": "2026-02-12T01:27:54.795815+00:00"
}