{
  "video_id": "mz1Vns5XK-I",
  "url": "https://youtu.be/mz1Vns5XK-I?t=554",
  "title": "Georgia House - Day 22 (2026-02-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-02-16",
  "duration_minutes": 90,
  "summary": "Overview:\nThe Georgia House session on February 16, 2026 involved several key legislative actions, including the introduction of new bills and discussion of substantive legislation.\n\nKey Actions:\n- **HB 52**: Bill passed\n- **HB 872**: Bill referred to committee\n- **SB 353**: Bill introduced\n\nBills Introduced (First Reading):\n- SB 353\n\nNotable Moments:\n- Opening prayer and remarks by Pastor Sherrin Jack, highlighting the need for wisdom and humility in governing.\n- Recognition of the \"Doctor of the Day\", Dr. Jeffrey Cooper.\n- Quote from Chairman Tarvan: \"No one has ever become poor by giving.\"\n\nVotes:\n- HB 52 passed\n- Other votes not explicitly mentioned\n\nAttendance:\n- Quorum present, all members voted to signify their presence.\n\nAdjournment:\nThe session adjourned to reconvene at a later date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you good morning members will please come into the chamber and take their seats you hope you have an enjoyable Thursday night we'll take care of our business for the day and get the weekend started miss clerk you ring the bell since the hour of convening having arrived all members will please take their seats miss clerk i apologize you'll ring the bell you you you you you you you you going to have the morning roll call. All members present will vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? Have all members voted? Have all members voted? If so, Mr. Clerk, will you... Oh. You're here officially. Mr. Clerk, will you lock the machines? Doorkeepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with scripture reading in prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 60th House District, representing Sheila Jones, who is in her 20th year in this body. Appreciate her service. Representative Jones. Thank you, Mr. Speaker and members of the House. Our chaplain for the day is Pastor Sherrin Jack, the senior pastor of Barand's 7th day Adventist Church in Atlanta. Pastor Jack is married to the former Patricia Johnson, a little rock Arkansas, and she serves as an educator in Decap County. Together, they have one daughter, Elise, who is currently attending Oakwood University. He is joined today by Anthony and Helen Murphy of Barand Church. Will you both stand as we welcome you to the House of Representatives? Pastor Jack was born in Trinidad at an early age, his family moved to Brooklyn, New York. Pastor Jack has been in ministry for over 30 years. He has ministered in several countries across the globe and has been instrumental in establishing five churches in the United States. He has trained several interns and conducted workshops and seminars for pastors in several countries. Let us welcome and hear from our chaplain of the day, Pastor Sherrin Jack. Thank you, Mr. Speaker and to the members of this body for affording us this opportunity to be here this morning to just share a word of encouragement to each and every one of you as you embark upon, I believe, a most sacred and responsible task in governing our state. Join me in prayer this time, will you? Dear God, make us wise that we will recognize our limitations and acknowledge our inadequacies for the awesome task of leading this great people of our state. Make us wise so that we will walk in humility and seek your wisdom to lead as we are being led. Grant unto us a compassionate heart that we will always seek to do that which will be for your glory and for our mutual good. Grant unto us a compassionate govern that we will one day hear from your voice declaring well done, thou good and faithful servant is our prayer in your holy name. Amen. Thank you. I will not be long this morning. I just have a few words of encouragement for us today. And I've entitled the brief devotion, a prayer for wisdom. The text that I will reference this morning is found in 1 Kings chapter 3 looking at verses 1 through 5. One night God appeared to Solomon in a dream and said, ask for whatever you want me to give you. Solomon responded in a way that to God that reflected both his knowledge and his appreciation of how God had dealt with his father David. And how much he needed God's help now that the weight of responsibility for leading God's people now rested squarely upon him. He understood that leadership carries both the privilege and responsibility. And he knew that it was only with God's help that he would be able to carry out his duties as King. In verse 9 of the same chapter 1 Kings chapter 3, Solomon asked God for wisdom. Wisdom, so God gave, so God gave your servant wisdom and a discerning heart to govern your people and to distinguish between right and wrong. For who is able to govern this great people? God was pleased with Solomon's requests and responded by saying, since you have not asked for long life or wealth, no have you asked for the death of your enemies but for discernment in administering justice? I will do what you ask. I will give you a wise at discerning heart so that you will never be alone, be anyone like you, both in the past and in the future. Moreover, I will give you what you have not asked for, both wealth and honor, so that in your lifetime there will be no equal among kings. And if you walk in obedience to me and keep my decrees and commands, as David your father did, I will give you long life. Just a couple of lessons that I think that will be helpful to us and be a source of encouragement to us as we carry out or duties today. Three lessons from this brief interaction. Number one, humility. Humility is a recognition and affirmation that God is fully aware of what we need in order to carry out His will. Secondly, obedience. Obedience to God's Word will ultimately work for His glory and for our mutual good. Sacrifice. A willingness to give up our plans to fulfill the purposes of God. Often we will be called to stand, even when we don't understand, but by God's grace and might and power, He will enable us to withstand. The Bible tells us that Solomon was a wise man and God blessed him tremendously. He wasn't perfect, but he had a heart that was open to the leading of God's grace and open to receiving the mercy of God. In the very last chapter of the book, I'll be clasiascities. There's a summation of Solomon's collective wisdom and experience expressed in verse 13. And I'll leave that with you this morning. Here's what he says. Let us hear the conclusion of the whole matter. Fear God. Keep His commandments for therein lies the whole duty of man. As God has placed you in a position of leadership to set parameters, laws, and guidelines for us, the citizenry of this great state of Georgia. My prayer this morning is that each and every one of you will spend a moment of silent, personal, preferable reflection so that the same God that led Solomon and the same God that imparted wisdom and insight and knowledge to Solomon will impart wisdom, knowledge, and insight to you. And that as you collectively lead, you will be led by God who is all-knowing and who is all-wise. May God grant you His peace in this most sacred and most awesome responsibility to provide a climate in which all of us as citizens can live out of full potential and be all that God will have us to be. May God's blessing be upon you all. And thank you for the opportunity to share this morning. Thank you. I'm trying to play this place. I'm going to say that America and the Republic will just stand on the nation under the control of the individual and the justice of law. Thank you. Good work. The door keeps as you may unlock the doors, members, you may read the Pastor Jack in the South any room and show your appreciation for His words and being with us today. Thank you. Thank you. Thank you. Members this morning, our Doctor of the Day is brought to us by Representative Raman. Thank you. The Doctor of the Day is Dr. Jeffrey Cooper. So if you get an opportunity, go down and greet the Doctor of the Day, Dr. Cooper and let him know how much we appreciate him being here. Chairman Tarvan, the chair of the Committee on Information and Audits, has recognized Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. And a little something else to think about. No one has ever become poor by giving. That's profound. No one has ever become poor by giving. Thank you, Chairman Tarvan. Chairman Tarvan, the chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct, is there an objection to the spends with the reading of the journal, Chair here's none, the reading of the journal, is the spends with, is there an objection to the confirmation of the journal, Chair here's none, and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Perhaps I have a situation of the 104th moves following me establishes the order of business there in the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there an objection to the adoption of the resolution establishing the order of business for the day? Chair here's none, the resolution is adopted. First reading the bills and resolutions, the clerk will read. House Bill 1279 by Representative Roberts, the 52nd draper of the 90th, clerk of the 108th, Miller of the 62nd and now of the 50th, Bill B. Todd on Act 2, chapter 2, a total 21 of the Efficient Coated Georgia annotated, relating to primaries and elections generally. Governor Melll affairs. House Bill 1280 by Representative Huggley of the 141st Smith and 138th, 138th and 148th and Buckner of the 137th, Bill of the CompuTidal Act to amend the Act creating those Scogi County school district. Intric governmental coordination. House Bill 1281 by Representative Huggley of the 141st Smith of the 138th, 138th and 148th, and Buckner 137th, Bill of the Intitled Act to authorize the assessment collection of a technology issued by the Recorder's Court of Columbus. Intric governmental coordination. House Bill 1282 by Representative Huggley of the 141st Smith and 138th, 138th and 148th and Buckner 137th, Bill of the Intitled Act to authorize the assessment and collection of a technology issued by the Pro Bay Court of the Muscogee County. Intric governmental coordination. House Bill 1283 by Representative Persinger of the 119th Ballinger of the 23rd Higins, on the 61st, loves to know the 12 Smith of the 18th and others. Bill of the Intitled Act to amend Code Section 15-112, the Fisher Go The Georgia Anitator, relaying the definitions regarding the juvenile code. Juvenile justice. House Bill 1284 by Representative Daniel, the 117th Crow of the 118th, Vance of the 133rd, Higins on the 61st Collins, the 71st and others. Bill of the Intitled Act to amend Part 5 Article 22, Chapter 2, a Title 20 in Code Section 46, 163, the Fisher Go The Georgia Anitator, relaying the school buses for elementary and secondary education. Motor vehicles. House Bill 1285 by Representative McCollum, the 30th Higins on the 61st Jones, the 47th, Flaming the 114th, Hiltman the 48th and others. Bill of the Intitled Act to amend Part 4 of Article 1, Chapter 8, the Title 40, the Fisher Go The Georgia Anitator, relaying the horns, exhaust systems, mirrors and windshields. Motor vehicles. House Bill 1286 by Representative Corbett of the 174th, Cannon of the 172nd, Williams of the 148th, LaHood of the 175th, Rhodes of the 124th. Bill of the Intitled Act to amend Chapter 23, a Title 2, the Fisher Go The Georgia Anitator, relaying the Georgia Hemp Farming Act. Agriculture and Consumer Affairs. House Bill 1287 by Representative Bill of the 75th Clark of the 108th, Washburn of the 144th, Daniel of the 117th, Muggle of the 105th and others. Bill of the Tata Act to amend Chapter 3, a Title 44 of the Fisher Go The Georgia Anitator, relaying the regulations, specialized land transactions. Judiciary. House Bill 1288 by Representative Smith of the 18th, Gilear to the 162nd, Reaves of the 99th, Gunner of the 8th, Hawn of the 103rd, and others. Bill of the Tata Act to amend Article 1 of Chapter 32, a Title 36 of the Fisher Go The Georgia Anitator, relaying the general provisions from the Invisible Courts. Judiciary. House Bill 1289 by Representative Gunner of the 8th, Anderson of the 10th, Jasper of the 11th. Bill of the Tata Act to amend Article 3, Chapter 6, a Title 40 of the Fisher Go The Georgia Anitator, relaying the driving on the right side of the roadway. Transportation. House Bill 1290 by Representative Bayes, more of the 69th, Beverly, the 143rd, the Lamb of the 98th, Mitchell of the 88th, Hugely, the 141st. Bill of the Tata Act to amend Part 2 of Article 6 of Chapter 2, Title 20 of the Fisher Go The Georgia Anitator, relaying the complencies of Courts, curriculum under the Quality Basic Education Act. Pub. Yes sir. Public and Community Health. House Bill 1291 by Representative Franklin of the 160th, Fry of the 122nd, Washburn of the 144th, Workaiser of the 157th, Camp of the 135th.\n\nothers will be taught an act of nt 40 80 the fish go to George annotated relating to revenue and taxation Ways and means 1292 by resident or coiee the 102nd burns the 159th abstraction of 104th Beverly the 143rd Reves the 99th and others will be taught an act of nt 2 to the 44th the fish go to George annotated relating the recordation and registration of deeds Judiciary House bill 1293 by reps of a year with a 150 second Smith the 198 Duke Duke Nick of the 29th Curled 118th Hagen and the 156 and others Bill B. Todd on act of men part one of article 4 chapter 12 a title 45 of the fish go to George annotated relating the management of budgetary and fiscal affairs Budget and physical affairs oversight house resolution 1134 by reps and it rovers the 52nd draper the 90th Clark of the 100 nays Miller the 60 second and now the 50th resolution proposing an amendment to the Constitution is to provide that the people the state of Georgia shall have the power to enact Rules house resolution 1135 by resident of Jones the 25th hatched in the 150th jasper to the 11th and all of what's the 42nd Paul the 33rd and others Resolution creating the house study committee on credit card fees on state and excise tax and their impact on Georgia merchants Agriculture I consume affairs Resolution 1136 by representatives in Beverly the 143rd Gillier the 160 second meal with 79th Stevens the 164th and no what so the 42nd and others Resolution purports it proposing an amendment to the Constitution stated Georgia so as to authorize the Georgia General Assembly to provide by general law Rules Senate bill 349 my senator huff statler the 52nd alvers the 56th estimates the 6th Echoes of the 49th handed apart in the 31st and others Bill be titled act to amend up chapter 5 of total 48 of the fish go to Georgia annotated relayed an ad ballorum taxation of property Ways and means Senate bills 430 by senators Donald Zal of the 27th wants in the first Gooch the 51st Robertson to the 29th get into the 47th and others Bill be titled act to amend chapter 16 to title 51 of the fish go to Georgia annotated relayed in the COVID 19 pandemic business safety Judiciary Senate bill for 43 by senator Watson the first strickland of the 17 till every the 19th brass the 28th Roberts of the 29th and others Bill be titled act to amend chapter 2 title 41 of the fish go to Georgia annotated relayed in the basement of nuces is generally Judiciary non civil That completes first readers Second reading of bills and resolutions the clerk will read house bill 1262 by represent mayner the 56th until relating to elementary and secondary education house bill 1263 My Reptors go field with the 63rd dredder of the 85th Davis of the 87th scott of the 76th Evans of the 89th A bill relating to conservation and natural resources house bill 1264 By Rept. Stevens of the 164th Jones of the 47th Jones of the 25th or one of the 30 second Clark of the 100th and others a bill relating to professions and businesses House bill 1265 by Rept. Westbrook of the 163rd Stevens of the 164th Jackson of the 165th willis of the 55th and Carpenter of the 4th A bill relating to tax returns and furnishings of information house bill 1266 by Rept. Washington of the 144th Powell of the 33rd Stevens of the 164th Crow of the 118th camp of the 135th and others a bill relating to conservation and natural resources Highways bridges and fairies and state government house bill 1267 by Rept. Martin of the 49th country of the 8th black When the 146th Buckner of the 137th stoner of the 40th and others they bill relating to state government House bill 1268 by Rept. Hawkins of the 27th Dominic of the 29th Dunno who of the 31st McCallum of the 30th Clark of the 100th and others a bill to provide a new home study exemption from Hall County at Lorm taxes for County purposes House bill 1269 by Rept. Hawkins of the 27th Dunno who the 31st Dominic of the 29th McCallum of the 30th Clark of the 100th and others a bill to provide a new home study exemption from City of Gamesville at Lorm Taxes for municipal purposes House bill 1270 by Rept. Hawkins of the 27th Dunno who of the 31st Dominic of the 29th McCallum of the 30th Clark of the 100th and others a bill to provide a new home study exemption from Hall County school district at Lorm taxes for educational purposes House bill 1271 by Rept. Hawkins of the 27th Dunno who the 31st Dubnic of the 29th McCallum of the 30th Clark of the 100th and others a bill to provide a new home study exemption from City of Gamesville independent school district at Lorm taxes House bill 1272 by Rept. Martin of the 49th Parsons of the 44th Drener of the 85th and the House of the 170th A bill relating to emergency telephone number 911 sister House bill 1273 by Rept. Hawkins of the 150th and others a bill to create a board of elections and registration for Evans County House bill 1274 By Rept. Hawkins of the 72nd Fri of the 22nd Dickey of the 145th Perkle of the 169th Thomas of the 65th and others A bill relating to state veterinary education House bill 1275 by Rept. Jasper's of the 11th Smith of the 18th Tarvan of the 2nd Powell of the 33rd lot of the 111st and others A bill relating to the General Assembly House bill 1276 by Rept. Hawkins of the 28th Roads of the 124th Cali of the 16th Canada the 170th Second Skoggins of the 14th and others a bill relating to education and minors House bill 1277 by Rept. Clark of the 100th Hitchens of the 160th Spawner of the 73rd Bear of the 24th Crow of the 118th and others a bill relating to General provisions relative to Aviation House bill 1278 By Rept. More of the 91st a bill relating to other state symbols House resolution 1109 by Rept. Perkle of the 169th Resolution honoring the life of Mr. Neal Waldo McIntyre Jr. and dedicating a bridge in his memory House resolution 1110 by Rept. Perkle of the 169th the resolution honoring the life of first lieutenant Clyde Vernon more Dedicating a bridge in his memory House resolution 1111 by Rept. McIntyre the 100th Kwa of the 102nd Clark of the 808th McIntyre 105th Park of the 107th and others a resolution honoring the life of Mr. Percy Scott Jr. and Dedicating a road in his memory House resolution 1112 by Rept. McIntyre the 1009th Kwa of the 102nd Clark of the 102nd McIntyre the 110th McIntyre the 105th Park of the 107th and others a resolution honoring the life of Mr. Steven Day Dedicating an interchained in his memory House Resolution 1113 by reps and done in the 31st and green of the 154th. A resolution authorizing the granting of non-exclusive easements. House Resolution 1114 by reps and manner of the 56th. A resolution proposing a amendment to the Constitution so as to bride that the sales tax for educational purposes may be used and expended. For the benefit of public charter schools located within local school systems. House Resolution 1115 by reps and a black one of the 146th, the 123rd, a resolution proposing a amendment to the Constitution so as to provide that the low qualified low income building projects may be classified as a separate class of property for ad law and property tax purposes. House Resolution 1116 by reps and percol of the 169th and green of the 154th. A resolution authorizing the lease of certain state owned property. House Resolution 1117 by reps and a thark of the 100th. A resolution following the 103rd. We call them on the 30th and the 134th. We call them the 105th. A resolution honoring the life we can serve Logan James Wade and dedicating an intersection in his memory. House Resolution 1118 by reps and cocks of the 28th. Jasper of the 11th McDonald of the 26th. Jones of the 25th. Barrett of the 24th and others. A resolution honoring the lives of Christy Jane. Carolyn Carrey, Marie and Tabitha Renee Lothorn. A dedicating an intersection in their memory. House Resolution 1133 by reps and Mitchell of the 88th. Resolution urging the United States Congress to pass the kidney patient access to technology, innovative and essential. Neuphrology Treatments Act of 2023 or the kidney patient act of 2023. Senate Bill. Senate Bill 334 by senator Albers of the 56th. Robertson of the 29th. Carpatrick of the 32nd extent of the 45th and still of the 48th and others. A bill relating to minimum requirements, equipment, clothing and insurance relative to local fire departments. Senate Bill 340 by senator Kirkpatrick of the 32nd Albers of the 56. House vetler of the 52nd. Robertson of the 29th and marty of the 31st and others. A bill relating to exemptions from sales and use taxes. Senate Bill 389 by senator Payne of the 54th. Carpatrick of the 32nd. Hodges of the 3rd Albers of the 56th. Hatchet of the 50th and others. A bill relating to rights privilege and prohibitions. Senate Bill 412 by senator Kennedy of the 18th. Cousin of the 46th. Summers of the 13th. Harborson of the 15th. Brett of the 33rd. A bill relating to professions and businesses. Senate Bill 424 by senator Robertson of the 29th and brass of the 28th. A bill to create a new judicial circuit for the state of Georgia. Senate Bill 426 by senator Tillery of the 19th. That's the 37th. Burns of the 23rd. Walked in the 30th. Albers of the 56th and others. A bill relating to motor vehicles and traffic. Senate Bill 439 by senator Stavez of the 6th. Oracle of the 36th. Halbert of the 39th. Parents of the 42nd. McLaren of the 14th and others. A bill to provide a homes and exemption from city of Atlanta independent school district. A bill to provide the law in Texas for educational purposes. Senate Bill 453 by senator Paine of the 54th and has that there of the 52nd. A bill to transfer probation and intake services of the juvenile court of Gordon County to the Georgia Department of juvenile justice. Through second readers. Reports of standing committees. The clerk will read. There's on a crystal one of the 32nd district chairman of committee of education submitted the following report. We speak to your committee on education. Tatto nerds consideration filing bills of the house. It's a struck to meet a report the same back to the house. The following recommendations. House bill 579. Do pass by substitute House bill 1104. Do pass by substitute House bill 127. Do pass by substitute respectfully submitted. President Chris Erwin in the 32nd district chairman. Professor John LaHood at the 175th district chairman on committee on governmental affairs submitted the following report. This is speaker committee on governmental affairs. This had under its consideration the following bills of the house is struck to meet a report the same back to the house. The following recommendations. House full 1073 do pass House bill 1112 do pass House bill 111990 passed by committee substitute. House will 1207 do pass respectfully submitted. Representative John LaHood at the 175th district chairman. Representative Bill Workhizer the 157th district chairman on committee on industry and labor submitted the following report. We speak to your committee on industry and labor as had under its consideration following bills of the house and senate. And struck to meet a report same back to the house with the following recommendations. House bill 738 do pass by committee substitute House bill 1125 do pass Senate bill 362 do pass respectfully submitted. Representative Bill Workhizer the 157th district chairman. Representative Jones the 25th district chairman of committee on technology and infrastructure innovation submitted the following report. Mr. Speaker committee on technology and infrastructure innovation as had under its consideration the following bill of the house. This is struck to meet a report same back to the house with the following recommendation. House bill 986 do pass by committee substitute respectfully submitted. Representative Jones the 25th district chairman. Representative Shaw Blackman the 146th district chairman on committee on ways and means submitted the following report. We speak to your committee on ways and means as had under its consideration following bills of the house. This is struck to meet a report same back to the house with the following recommendations. House bill 971 do pass by committee substitute House bill 1069 do pass respectfully submitted. Representative Shaw Blackman in the 146th district chairman. That completes the reading of the reports of standing committees. Members will move on to morning orders. We have two morning orders this morning. I'm going to recognize representative Park Cannon first, but also want to recognize. Representative Carolyn Hugley. Representative Hugley you have a imported morning order. Yes, they can make a hand. Where? The district's over at Park awareness to be fine. I think that's why I'm saying they will make a hand. Yes. Representative Park Cannon is recognized for a morning order. Lady will spend just for a minute. Representative Cannon. Thank you, Mr. Speaker. Good morning, members. Today I wanted to bring to you a person who will be here at the Capitol from 12 to 2 today. His name is Dr. Elijah Nicholas. He is the founder of the 100 Black Trans Men organization. He is of course a visionary leader, but he's also a retired senior military officer. He has over 20 years of leadership experience and multiple degrees. One from the Harvard Divinity School. He's done 13 publications. He's actually an ordained pastor at spirit and truth sanctuary. And he's really dedicated to educating leaders on the importance of conscious love. I think it's really important that we're here in this legislative session thinking consciously about the bills and resolutions we pass. As a 25 year US veteran, he combines his health care administration experience and conscious driven leadership style to advocate for health equity. Today he will be here with a packet of information for each of you about how to advocate for health equity. And lastly, he just put out a book. It's called Medoodle. Not sure if we have the graphic for it. Maybe we can show it later. But Medoodle is a story about his life as a black transgender person and really helping people to understand that books don't have to be banned. They can actually be shared and help to create consensus. Thank you, Mr. Speaker. Thank you, Representative Cannon. Thanks for the heads up on the other one. That completes our morning orders. We're going, we will move on to the rules calendar. Mr. Clerk, will you read the caption to House Bill 988? No. House Bill 988 by Representative Thomas the 21st to be entitled back to a men chapter 25 with title 50 of the fish go to George Anitetti ruling the Georgia Technology Authority. So it's a provide for an annual inventory of artificial intelligence usage by state agencies. Ms. Bill, I've referred to the Committee on Technology Innovation. And that committee recommends that this bill do pass by committee substitute. Thank you, Mr. Clerk. Okay, members, we have several important pieces of policy legislation. We need to consider this morning. So if you will, take your conversations to the back of this chamber and probably turn the volume down a notch or two on them as well. So we're ready to go. As soon as they get quiet, we're going to go to the next. I want to talk about George Tech. Members, we'll please take your seats. Representative Brad Thomas is recognized to present the bill. Representative Thomas. Thank you, Mr. Speaker. I'm here to present House Bill 988 LC560086S. This is the first piece of several artificial intelligence-related policy that we're going to set forth in this state. So this is an exciting beginning to send policy on a brand new frontier. This one actually authorizes the Georgia technology authority to do several things. The first is it creates an audit of all state systems to verify what systems are using artificial intelligence. The second piece of this sets requires that the Georgia technology authority set policy for the use and particularly when it comes to govern the procurement implementation and ongoing assessment of such systems by agencies and ensure that no such system results in any unlawful discrimination against any individual or group of individuals, which I think is important. That being said, the only other requirement is the generator report that's provided to the House and the Speaker in the Senate's office. With that, all yield for questions. Gentlemen, has no questions. Did a good job. Thank you, Mr. Speaker. Without a yield, the well asks for your favorable consideration. Is there any objection to the previous question being ordered that Chair Hissnund, the previous question, is ordered, is there any objection to adopting the committee's substitute that Chair Hissnund, the committee's substitute, is adopted? Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Did Chair Hissnund report the committee is agreed to? Shall this bill now pass? All in favor of the passage of the bill, we'll vote. Yes, all those opposed will vote no and the clerk will unlock the machine. All members voted. Have all members voted if so, the clerk will lock the machine. On the passage of House Bill 98, the yeas are 147, the nays are zero. The bill haven't received the requisite. Constitutional majority is therefore passed. Mr. Clerk, will ye read the caption to House Bill 874. 874. House Bill 874, by the way, Senator Hawkins, the 27th to be entitled to the act to amend part 3 of Article 16 of Chapter 2, Title 20 of the Fish Go to George Annotated relating the health source require automated external defibrillators in all school. Ms. Bill, I'm referring to the committee on health. That committee recommends that this bill do pass by committee substitute. Chairman Hawkins is recognized to present the bill. Chairman Hawkins. Thank you, Mr. Speaker. This past summer, I met with the American College of Chordiologists, the Georgia chapter. They brought this bill to my attention. This bill includes K-thru grammar schools into present law that require schools to have an AED. We're finding that we're losing kids at younger ages. Also, having an AED in all our schools protects all teachers and visitors to those schools. This bill does a couple other things that are very important. One, the schools will create an action plan, which they are doing now, the high schools. The grammar schools will also do this. This creates an internal response team, and also it requires two practices a year, as we all know, even physicians and dentists and nurses every two years, we've got to retake CPR because repetition is vitally important in times when people are really for a better word scared. Every second, every minute counts. This is an important bill that will provide this protection for all schools, all school kids in the state of Georgia. That's the bill, Mr. Speaker. And if there are any questions? Yes, does General Yeo for a couple of questions looks like? I will. Representative Prince has a question to your extremely off chairman, Prince. Thank you, Mr. Speaker. Does General Yeo? Yes. Is it not true that this legislation could possibly save a lot of lives, especially at athletic events for the middle school and those elementary school kids? Thank you for the questions. Absolutely right. Right now, we have about a 70% rate of survival using AEDs. That doubles the rate of survival without AEDs, just CPR. Gentlemen, for other year, you have a couple more? Yes, I do. Representative Jasmine Clark, do you left us recognize for a question? Thank you, Mr. Speaker. Does General Yeo? I do. First, I want to say thank you so much for bringing this legislation. I'm just curious, are there any schools right now in our state that do not have these AEDs? That's a good question. There are 57 K through grammar school schools that do not have AEDs. I have talked to the chairman of education appropriation and the good chairman back there has got in his budget to have funds for these schools. So we will provide the AEDs to these schools. That's great. Thank you very much for this legislation. Thank you. Gentlemen Yeo for another question. Yes. Representative Sebaugh has a question. Does the gentleman Yeo? Do you have extreme lessons? I'm sorry. Representative Hawkins, is it not true that sudden cardiac arrest can happen to anyone? Yes. Including students, teachers, or visitors within a school. And that this bill, making AEDs readily available, allows for immediate response and the critical moments following a sudden cardiac arrest. And that will greatly improve the chances of survival. It will. Does the gentleman further yield? Yes. Is it not true that Georgia is good to merit in laws, offer protection from civil liability to rescuers as well as owners or operators who install or provide the AEDs? Yes, it does. Thank you. Thanks. Great. Mr. No further question. No, you have one more, Mr. Chairman. If you don't mind. Okay. Chairman, Dr. Hawkins, a question from Chairman Dr. Newton to your right. Thank you, Mr. Speaker. Does the gentleman yield? He does. I want to thank you for this legislation. Is it not true that we will fill in some gaps in schools, especially primary and middle schools that may not have this? But a crucial part of this bill was that plan that you briefly mentioned, that the effort to make sure they have a plan and that many of our schools may be adding additional AEDs, which fortunately have come down from $4,000 to $1,500 or less. Correct. So that they'll be adding once they do those plans and realize the distance from the basketball court to the football field to the playground may be significant. And that plan is a crucial part of your legislation. That's correct. Yeah, we expect that with practice twice a year that this will, the reaction time will be cut down to just a few minutes and save a lot more lives. So you're right. Absolutely. As you mentioned, the outcome with prom defibrillation with an AED is dramatically difference, including even for football players like at the Buffalo Bills game a couple of years ago. Thank you, sir. That's great. Thank you. Mr. Chairman, you have, I promise. Trust me, you have one final question. Would you take it? Yes, sir. The lady from Junction City, George, or representing a buttoner has a question. Thank you, Mr. Speaker. Does the gentleman yield? He does. This is really telling a story so that this won't be forgotten. Is it not true that there was a lady in Columbus named Joe McDaniel years ago when AEDs first came out because of her family's history with sudden heart attacks. Put them everywhere she could find a place to put them and raise the money and work really hard. And she would be very proud and very supportive of this bill. Very true. And thank you for that comment. Appreciate it. All right, Mr. Speaker. With no further questions, ask for your support in this legislation. Good job, Mr. Chairman. Gentlemen, as you were to the well, good questions as well. Is there an objection to the previous question being ordered? Chair, has none the previous question is ordered? Is an objection to adopting the Committee's substitute? Chair, has none the Committee's substitute is adopted? Is there an objection to agreeing to the report of the Committee which was favorable to the passage of the bill? Chair, has none the report of the Committee is agreed to? Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine. Mr. Chairman, please. Have all members voted for what purpose is Chairman Collins rise? Parliamentary inquiry, Mr. Speaker. State's inquiry is not true. It's always a good idea to remind the members of this body that we have an AED located in the South-Annie Room. Is that a reminder? Thank you, Dears. Appreciate that reminder. For what purpose is Chairman Powell rise? Chairman Allen Powell, you don't have a question. Just wanted to make sure you knew where the AED is. That's all I was making sure. So we're all fine. Have all members voted? Oh, don't go. We don't have to use that thing on you. You just slow down. I don't know. Have all members voted if so, the clerk will lock the machine. On the passage of House Bill 874, the yeas are 151, the nay is one, the bill haven't received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 546-546? House Bill 546, by the way, Senator Jasper, the 11th to be titled an act to amend Code Section 2645. Are the fish go to Georgia and attend every day in the definitions relative to-\n\nThe Georgia Pharmacy Practice Act, so it provides a definition of pharmacy care. This bill I've referred to the Committee on Health, that committee recommends a disbilled do pass by committee substitute. Chairman Jasper is recognized to present the bill. Thank you, Mr. Speaker. The members, I bring to you House Bill 546, the Pharmacy Adaptation Act. This is a common sense bill. I believe you'll agree with me when I get through. I'm very honored to do the occasional pharmacy bill because my dad was a pharmacist back in the old days when they called him Doc Jasper's. And we were very proud of that. So how many of y'all been to an emergency room? The doctor's office or unfortunately maybe an emergency clinic? And they prescribed a drug to help you get through the day or night or a few days. Going to the pharmacy and they don't have the exact thing. They've got the same thing but they don't have the exact thing. And now you have to go somewhere on a little trip to try to find that exact prescription medicine. What this bill will do will help you with that problem. So you go to the clinic and they prescribe a 500 milligram antibiotic, whatever, eight of them, the description of how to use it. You go to your pharmacy but they're out of the 500s. This will allow them with your permission, in the physician's permission, to do a 250 milligram, 16 of them, with the directions and label how you're to appropriately take them. That's easy, common sense. The second thing it will do is that the pharmacist will be allowed to adjust the prescription from maintenance drug. Now many, many people take maintenance medication every day. And you know if you do that, your pharmacy or the prescription benefit plan or whoever, the pharmacy is moving to 90 day prescriptions, save you a trip, save them work also. That's been the trend. This will allow the pharmacist to adapt the prescription to fit that 90 day regime. It's very helpful. I think you'll agree. There's some common sense safeguards this bill. If the physician were to happen to write on it, no substitutions or changes made, there could be nothing done. You have to ask the patient, is it okay? Okay, that's good. And then the pharmacist has to make a record in their medical record that they've done this and documented, so all can see. It's very common sense, very consumer friendly. And I'm glad to bring this pharmacy bill and help you join me in voting favor of this members. Thank you, Mr. Speaker. I'd be glad to answer any questions that there are any. General, is yours for a question representative? Jasmine Clark to your left has a question. Thank you, Mr. Speaker. Does it, General, in you? Yes, ma'am. Just to clarify, a pharmacist will be able to now change the quantity that they're able to give or the amount of days, dosage days they're able to give. They're not able to necessarily change the prescription, though, because I just want to clarify that 40 lines, 40 people are not going to allow that. It's very clear that they can't do that. That's the doctor's job. All right. I just want to make sure, because it said they can adapt. Yes, ma'am. Thank you. Speaking of doctors, you have a question to your right. Chairman Newton recognized for a question. Thank you, thank you, seatmate. Yes, sir. I appreciate this bill, isn't it true that previous, if this bill doesn't pass, that pharmacist's time would be taken away from other patients and other prescriptions. For something as simple as a 500 milligram prescription, that they only have the 250 milligram, and they want to tell them to take two every four times a day instead of one four times a day. And this bill will allow them to that. Absolutely. And I think we all agree, my seatmate, that pharmacists want to help people. They want engaged. They want to spend time, and this will allow them to spend more time. And further inquiry, I mean, further question. Yes, sir. If, in the truth of 90 days that you mentioned, is so crucial to good adherence and compliance with their physician, their advisor's order, and that by following that, by the pharmacist being able to make to assist in the teamwork approach, that it will make a big difference in how people's health stays strong. Absolutely. The gentleman knows what he's speaking. Thank you, sir, for the bill. Thank you. One more of those German hawkins has a little medical background. And he has a question. Does General Neal- Yes, sir, Mr. Chairman. Isn't it true that pharmacists have eight years of post-secondary education, have to pass national boards, state boards, continuation of CE courses, and have a great knowledge of all medications and prescriptions? Absolutely, Mr. Chairman. And also, they do this profession because they care about people. Thank you. Thank you. You have no further questions. Thank you. You're the well. That's you favorably. Thank you. Good job. The chairman has yielded the well. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee substitute that Chair, here's none. Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, the clerk will lock the machine on the passage of House Bill 546. The yeas are 155, the nays are zero. The bill haven't received the requisite Constitution majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 872. House Bill 872 by Rosewood of Hawkins of the 27th being titled, Natto Men, Chapter 34, title 31 of the Fish Dakota, Georgia, and Intedra Relay, and the Medical Professions for Rural Assistance. So, to expand the service, cancel the loan program for physicians and other health care providers. This bill then refer to the committee on public and community health. That committee recommends a disbilled do pass by committee substitute. Mr. Chairman, you may be worn out. I'm glad the weekend is upon us with all your action activity here this morning. So, let's see what you can do with this one. Chairman Hawkins is recognized to present the bill. Thank you, Mr. Speaker. HB 872 is addressing a problem we have in this state. A well-known problem that is getting health care personnel out into the rural areas. It's been a challenge. In this, in some small way, we'll address that challenge. This bill actually is improving on an existing dental loan repayment program. So, it's not adding anything to the budget. But rather, directing a senior student to notify him or her that they have been accepted for the loan repayment program. This is before they go to the rural areas. So, the idea is this will enhance some of these people to go into the rural areas. And also, it notifies them that they'll have four years of loan help with this program. So, these loans are for 25,000 a year. So, it helps them with average debts of 260,000. It helps knock some of that down. And we really think this will help get people out into our rural areas. Mr. Speaker, that's the bill. If there are no questions, I'll yield the well. Is there an objection to the previous question being ordered? Chair has none. The previous question is ordered. Is there an objection to adopting the Committee's substitute? Chair has none. The Committee's substitute is adopted. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? That Chair has none. The report of the committee is agreed to. Chair has none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. If so, the clerk will lock the machine on the passage of House Bill 872. The yeas are 150 and nays are three. The bill haven't received the requisite constitutional majority. The constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 1058? House Bill 1058 by Representative McDonald, the 26th and others to be titled an act to amend Code Section 41-8. The official go to George Anitetti, really, and the same operations of motor carriers, commercial motor vehicles, and drivers, and safe transportation of hazardous materials. Mr. Clerk, this bill I refer to the Committee on Motor Vehicles. That committee recommends a disbilled do pass. Governor's floor, leader, Representative Lauren McDonald is recognized to present the bill. Thank you, Mr. Speaker, colleagues. Today I bring you House Bill 1058. The annual codification of the certification given down from the Federal Government to our motor compliance vehicle division. I was honored to be able to take this bill over Chairman Meeks. It was a tough contest. Sue was going to get to carry it, but I was chosen to do it. The only thing it changes is lines 14 and 15. We changed from January 1st, 2023 to January 1st of 2024. Mr. Speaker, if no questions, I yield a well. Do you have any yield for a question? Yes, sir. Chairman Meeks, to your right, has a question. Like Mr. Speaker's gentleman, you? I do. I must have been unavailable whenever the legislation was delivered, but could you tell us one more time what MCCD stands for? Motor Carrier Division. Compliance Carrier Division. You might want to re-read the bill. Mr. Speaker, I yield a well. Gentlemen, yield a well. Y'all go figure that out. Y'all can arm wrestling the corner for whatever you want to do on that one. Is there any objection? The gentleman's yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair, here's none. The report, the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. All members voted. All members voted if so. The clerk will lock the machine. On the passage of House Bill 1058, the yeas are 152, the nays are zero. This bill receiving the rec was at constitutional majority is therefore passed. Members, I hope you are joined with me. We usually don't have this opportunity to show our appreciation, but Dr. Cooper has come into the chamber. So let's give Dr. Cooper a round of applause for being out for Dr. The Day. Dr. Cooper is a pediatrician in Duluth, so we're glad to have him with us today. Mr. Clerk, will you read the caption to SB 353, Senate Bill 353? Senate Bill 353, the Senate of dollars, all of the 27, and dicks into the 45th to be entitled to amend, titled 32 of the EF to Georgia, annotated, relating to highways, bridges, and ferries to amend, wait, and dimension requirements for modular, unit, transportors. This bill I refer to the committee on transportation. That committee recommends a dispil do pass. Representative Brad Thomas is recognized to present the bill. Thank you, Mr. Speaker. Many of you might recognize this bill. It was previously a bill called House Bill 52. And as my good friend once said, it was a Cinco Davi toad. Thanks to some language that was put in in the Senate. This bill actually corrects that. We have language that the governor's office, the Senate and the House all agree on. So it's a Senate Bill 353, SB 353-FA. Section one, it strikes the use of regular mail and adds email notification methods. Section two allows for continuous conversations during the RFP process, basically allowing to refine proposals. Section three, does the alternative contracting method? It says a UND1 project over a 100 year period. That was the big change from HB 52, HB 52 was just one time. They thought that wasn't clear. So that was one of the major changes. Section four extends trailer links to 84 feet, which is an alignment with other states. And these are for modular trailers. So there, the weight impact is really negligible from that that addition. Section five allows a county medical examiner to delegate their power and limited access roads, just to ensure that we can reduce the disruption and flow traffic. And finally, Section six ensures private driver data doesn't inadvertently get released by CERDA. And with that, Mr. Speaker, I'll take questions. The gentleman has no questions. Thank you, Mr. Speaker. Ask for your favorable consideration. And now you'll the well. The gentleman is yielded the well. Is there an objection to the previous question being ordered? Chair, has none the previous question is ordered? Is there an objection to agreeing to report of the committee, which was favorable to the passage of the bill? Chair, has none the report of the committee is agreed to? Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Chair, please. All members voted. If so, the clerk will unlock the machine. On the passage of Senate bill 353, the yeas are 152, the nays are zero. The bill haven't received a requisite constitutional majority is therefore passed. Okay, members. We will House Bill 424 will be postponed to the next legislative day. For what purpose is representative Stinson rise? To make a motion. I'm state your motion. I move that the rules be temporarily suspended so that a bill may be rare for the first time and assigned to committee. Mr. Clerk, will you read the caption? A number of House bill by Rose and Stinson of the 150th and others to be entitled back to amend Code Section 42, 86 of the EFISCO to Georgia annotated relating to special license plates promoting or supporting certain worthy agency funds or nonprofit corporations. On the ladies motion that the rules of this House be temporarily suspended so a bill can be read for the first time and assigned to committee is their objection. So, assigned to motor vehicles. That concludes the rules calendar. We'll move on to afternoon orders. We have a couple of afternoon orders. We'll recognize represented Mac Jackson and represent the Al Williams. I think they're going to have a audio and a visual afternoon order. So gentlemen, representatives, you are recognized for your afternoon order. Ladies and gentlemen, thank you. Ladies and gentlemen, as you know, in the 2022 session, we passed House Resolution 881 and this resolution encourages public schools to study the civil rights era and to share the dream of Dr. Martin Luther King. Matt Daniels and Chris Bazar along with McGraw-Heel, publishing company, have developed the curriculum for this study. On January 13th, we gave the first scholarships to students here that attended HBCUs. We were able to give out five scholarships of students who had studied the curriculum of shared the dream and we have a video that we want to show you that some MBA players have partnered with McGraw-Heel because of these scholarships and it's the Andrew Young Scholarship and these scholarships are being given all over the United States of America. But at this time, we want to show you a video if you pay attention to the screen. We apologize, the audio didn't come on, but these are some MBA players and some ex MBA players who are endorsing this shared the dream project. Also, we had the curriculum for churches and there's also a curriculum for school system. If you see me, I'll be able to get you the curriculum for the church or for the school, either one that you would like. Thank you. We yield the well. Gentlemen and members, we appreciate that. Order and we apologize. The video did not come on with the audio. If we get it fixed, we'll do it another day. How about that? We can do that. Representative Bickey Evans is recognized for and afternoon order. Thank you, Mr. Speaker. Colleagues, I wanted to bring attention to the flyer on your desk today that's addressed by a pediatric trauma surgeon, Alexis Smith. And for the first time in modern medicine in 2022, firearm injuries surpassed car accidents and childhood cancer as the leading cause of death and children and adolescents. And from 2019 to 2020, firearm related deaths of all types, suicides unintentional among children and adolescents increased 29.5% in two years. An analysis of the data shows that nine in every 100,000 children died from firearm injuries in the state of Georgia every year. And that is 50% more than the national average, which again is six in every 100,000 children. And when you compare that to states with more robust gun laws such as New York or New Jersey, children in Georgia die of firearm injuries at rates 4.5 times that as in New York and New Jersey. And in Europe, no other peer country in Europe has firearm injuries listed among the top five causes of death in children. A child in Georgia dies from firearm injuries at a rate approximately 15 times more than children in Canada and 30 times more than children in France. In recent years, pediatric trauma surgeons in America are seeing a rising number of penetrating injuries from firearms in our pediatric trauma days. This number is rising at alarming rates and is reached levels that are overwhelming our pediatric trauma units. I ask that this body do our part by passing safe gun ownership laws and use our influence in the public to practice and demonstrate safe gun ownership. Thank you. That concludes our afternoon orders. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Alfonso Boone. Proceed. Honoring the life and memory of Alfonso Boone senior. Honoring the life and memory of Henry C Baker senior in Ethel Virginia, Almeda Ogden Baker. Recognizing commending Pam joiner for her work on behalf of the children of Barian County, commending Dr. Fahamu Pecu, commending the builder owners and managers association of Georgia Foundation, and recognizing commending the Empowerment Resource Center, incorporated upon its 13th annual hats off to women symposium. And for other purposes, that completes the reading of the privileged resolutions. Is there any objection to adopting the privileged resolutions? Chair here's none and the resolutions are adopted. Okay members, listen up. We have a couple of announcements. Chairman Corbett is recognized for an announcement. Thank you Mr. Speaker. The Motor Vehicles Committee will meet at 8 a.m. Tuesday morning, room 606 CLOB. Thank you. Representative Davis is recognized for an announcement. Thank you Mr. Speaker. It's environmental justice day at the Capitol. There will be an environmental justice press conference at the South Stealth's 2-day at 12-30. I say again environmental justice press conference today at 12-30. Join us as we celebrate environmental justice day. Thank you Representative Davis. Chairman Collins is recognized for an announcement. Thank you Mr. Speaker. Immediately upon adjournment the House Public Safety and Homeland Security Committee will meet in room 506 CLOB. So we'll be a brief 2-day subcommittee meeting and then we'll roll into full committee. Members of y'all will hang in there with me. We'll be done in about an hour. Okay members, your work is not done. Representative Jason Ridley is recognized for an announcement. Regulated Energy Subcommittee on Occupational and Professional License and 606 Immediately upon adjournment CLOB. Thank you. Thank you. Representative Mack Jackson, co-chair of the Rule Development Council. Is recognized for an announcement. Thank you Mr. Speaker. We want to recognize some senior citizens that are here today from Fulton County. Fulton and Douglas County. From Fulton County. Once you stand so that we can recognize you, I have my sister up there and one of my home people from Sandersville, Georgia, up there with their Fulton County. Thank you for coming from the State Capitol. Thank you Mr. Speaker. We appreciate y'all leaving God's country down in Sandersville and coming to Atlanta. Good to have y'all into people's house. That concludes our announcements. Now we have a couple of birthdays and a thank you. Representative Yolmady Holley has a birthday today. Representative Holley. That's it. Happy birthday young man. On Monday, February the 19th, German Bill Workhizer has a birthday. He looks excited about that, doesn't he? I'm not forgetting you. Don't worry. Now today is also a special day and I want to say thanks to Representative Seila Jones. Wait just a minute. Hold it. She out, not you, you know him. She also bought lunch for us yesterday and that was awesome. And celebrate her. Happy birthday, Representative Jones. We appreciate you. I'm going to drop the phone. Someone may have dropped a phone. Has a beautiful little Yorkshire Terrier puppy on it. I believe that's what that is. We have it. So if anyone's lost a phone in the chamber, we'll keep it up here. We do have pages today. So if you have a page, we'll ask you to make your way down front for the page photos. Well, we have no further business. I hope you all have a safe and enjoyable weekend, long weekend. And we'll be back here as directed by the majority leader. The majority leader of this house is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Tuesday, February 20th, 2024. On the motion of the majority leader, this house stands adjourned until 10 a.m. Tuesday, February 20th, 2024. All those in favor will say aye. Pose, no, the eyes.\n\nthis house is adjourned.",
  "updated_at": "2026-02-13T21:10:25.522572+00:00"
}