{
  "video_id": "N0VzeBPNyeQ",
  "url": "https://www.youtube.com/watch?v=N0VzeBPNyeQ",
  "title": "State of the State Special I 2026 Lawmakers Day 4",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": null,
  "duration_minutes": 57,
  "summary": "Here is a structured markdown summary of the Georgia State of the State Special I 2026 Lawmakers Day 4 session:\n\n**Overview**\nThe session featured Governor Brian Kemp's final State of the State address, where he highlighted accomplishments from his two terms, outlined policy priorities, and reflected on his time in office. The speech was followed by the Democratic response.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Governor Kemp reflected on his time as governor, stating it has been an \"incredible honor\" to serve as Georgia's first family. \n- Kemp announced a new need-based scholarship program, the \"Dream Scholarship,\" garnering cheers from the audience.\n- Kemp touted several tax relief measures implemented during his tenure, including over $3.2 billion in one-time tax relief.\n- Kemp closed his speech by reciting a hymn verse about doing great work even in small places.\n- After the address, Democrats praised some aspects like the new scholarship but criticized a lack of focus on healthcare.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nNo quorum issues were noted.\n\n**Adjournment**\nThe session adjourned, with lawmakers scheduled to return the next day for a ceremony honoring Martin Luther King Jr.",
  "transcript": "As you all know, this is my final time speaking to you in the state of the State of Dress as your governor.\nSome of you may be more happy about that than others.\nBut I hope you know that it has been an incredible honor for Marty, the girls, and me to serve\nas your first family.\nGovernor Brian Kemp delivered his final state of the state address today, a speech that\nmixed policy, personal reflection, and emotion from his family in the gallery.\nGood evening and welcome to this special one-hour edition of lawmakers.\nThank you for joining us.\nI'm Donna Lowry in Atlanta.\nHis remarks, the governor looked back at his two terms, leading the state, highlighting\naccomplishments, and laying out key budget priorities for the year ahead.\nTonight will break down what the governor said and what it means.\nTwo political analysts will join us to put the speech into context.\nWe'll also hear the Democratic response.\nBut first, a look at how the day unfolded under the gold dome.\nOur correspondent, Sarah Callis, has the overview from the Capitol.\nIt was a wild day at the Capitol today, Donna.\nIt wasn't just a frenetic activity that usually surrounds the governor's state of the state\naddress, but also the keep Georgia wild event this morning, which brought its own bit\nof wild to the Gold Dome.\nLawmakers brought in a variety of wildlife and outdoor conservation groups today, including\nthe state's Department of Natural Resources, all sharing with lawmakers and those gathered\nat the Capitol, the importance of enjoying and protecting Georgia's wild spaces.\nI want them to learn about new animals that they've never seen before.\nWe like a lot of people have never seen a broadwing this close before.\nI want them to learn about the native wildlife that's around them.\nAnd I also just want them to be happy.\nI want them to enjoy what's around them.\nAnimal ambassadors were on hand as well.\nA snake, turtle and alligator as well as the broadwing hawk.\nRon display for educational and enjoyment purposes.\nIt was then on to the day's main event,\nthe Senate joined House members together in the House\nto hear Governor Brian Kemp's final state of the state.\nA head of Governor Kemp's swan song, he received a cheerful welcome in the House chamber.\nThe annual speech gives lawmakers a clear view of the governor's priorities for the legislative\nsession. This year, Kemp also looked back on his successes.\nlower taxes, pay raises for state workers and teachers, economic development and\npublic safety were all touched on as accomplishments during his tenure.\nThere is no question the state of our state is stronger, more prosperous, and\nsafer today than it was in January of 2019.\nThank you all.\nBut also I want to be clear, this success, this good news isn't guaranteed.\nIt doesn't happen by default or accident.\nThere's more work to be done and more wood to chop, to make sure Georgia continues to\nbe the best place to live, work and raise a family for generations to come.\nKemp announced a first of its kind need-based scholarship in his speech,\ngarnering cheers from the audience.\nMy amended budget proposal invests $325 million in the university system of\nGeorgia's Dream Scholarship Program. The first need-based scholarship of\nits kind in Georgia history. He also touted another state tax rebate.\nhis fourth during his two terms as governor, which would give back taxpayers\nbetween $250 to $500. He rounded out his speech by centering on his faith,\nwhich he says has guided his decisions well in office by reciting an excerpt from the him\nlittle is much when God is in it. Does the place you're called to labor seems so small and little\nknown? Well, it is great if God is in it and he will not forsake his own.\nthe speech marked the beginning of Kemp's goodbye to the governorship.\nWhile he said he expects his term to be a small part of Georgia history, his colleagues\ndisagreed.\nHe said you may not be remembered in history.\nI think you will.\nAnd we're going to help tell the story.\nAfter the address, Democrats gave their perspective.\nWhile they praised some aspects of the speech, such as the need-based scholarship, they say\nother areas were ignored.\nDid you hear anything about health care?\nWe have been talking about expanding Medicaid year after year.\nAnd we know that the ACA subsidies have expired.\nThere are cuts to Medicaid coming down to us from the federal government.\nThat's a real challenge and I'm surprised that it was not mentioned.\nLater in the afternoon, more wildlife of a sort\nas the winners of the High School Georgia State Parks and Historic Sites\nart contest were announced on the South Steps. Works from the students were on\ndisplay and covered a wide variety of outdoor subjects. Over 230 students\nsubmitted their work for this year's contest. Tomorrow lawmakers will be back\nat the Capitol for day five. They will honor Dr. Martin Luther King at their\nannual MLK Day ceremony. That's my capital report. Back to you, Donna.\nThanks Sarah. Governor Brian Kimms, 2026 State of the State address highlighted everything\nfrom Georgia's strong fiscal position to significant investments in education, workforce\ndevelopment, and public safety. Joining me to listen to portions of his roughly 45-minute\nspeech and to offer analysis are two political consultants.\nBureau Amber is a senior vice president and is part of the Georgia government relations\nteam with McGuire Woods Consulting.\nHe previously served as chief of staff to the late house speaker David Roelston and\nto current speaker John Burns.\nAnd Anne Trel Tyson is a senior policy advisor at Paramount Consulting.\nHe previously served as a regional director with the U.S. Department of Health and Human Services\nunder the Biden administration.\nThank you both for being here.\nAppreciate this.\nSo let's start with each of you giving me a brief idea\nof overall what you thought of the speech.\nSpiro?\nYeah, confident, optimistic, I think a vision\nfor finishing his term and finishing the race strong.\nOkay, what about you?\nYeah, I agree.\nDefinitely it was a strong message.\nI felt like it was definitely a swan song\nwhere you kind of went over some of his accomplishments.\nAnd then it was also a few pieces of it\nwhere you could say that he was established in his legacy.\nYeah, he's focused a lot on his legacy, I think.\nOkay, well, let's listen to one of the topics\nthe governor addressed early in his remarks, taxes.\nSince 2021, working together with this General Assembly,\nwe have provided one time tax relief to the tune\nof over $3.2 billion.\nProperty tax relief, nearly $1 billion.\nOver 2.2 billion in motor fuel tax suspensions\nand a permanent income tax savings of nearly $3.4 billion.\nThat's almost $9.7 billion that have helped hard work\nin Georgia and fight through the record-high inflation,\nforced upon all of us by the previous administration in DC\nand a Congress that couldn't put down the nation's credit card.\nThese are historic investments in families.\nRecent college graduates looking to start a career.\nOur seniors on fixed income and single parents\njust trying to make ends meet.\nBut these investments were possible\nbecause we rejected the idea that just because government\ntakes in more money, it shouldn't turn right around\nand spend it on more government.\nCalifornia may think that way.\nNew York may think that way.\nBut in Georgia, we do things differently.\nWe keep your tax burden low.\nWe budget conservatively and responsibly.\nAnd we ensure that state government is efficient\nwith the dollars that you trust us with.\nAnd at the end of the day, if we have more than we need, we give it back to the people\nwho actually earned it.\nAs Marty, the girls in our travel all across our state, we hear from Georgians in all walks\nof life, hard-working people trying to put food on the table for themselves and their families.\nAnd the reality is that too many of our citizens are still struggling to make ends meet each\nand every day because costs are still too high.\nGroceries, rent, insurance, clothes for the kids, it all adds up to more than it used\nto.\nThat's why my budget proposal will include a fourth, one-time, $1 billion tax rebate\nthis year that will return or save the average file or $250 in a married couple up to 500.\nWith this rebate, my administration and this General Assembly will have returned over\nfor $7.5 billion in surplus revenue\nto the taxpayers of our state over the last four years.\nWe also know that one time relief is a short-term solution\nthat recognizes the state has collected more\nof your tax dollars than it needs\nto fund our priorities and save\nfor whatever the future may bring.\nWe must continue doing everything in our power\nto allow the hard work in men of our state\nto keep more of their hard-earned money\ntheir pocket in the years to come. Because as I've said before, that's your money, not\nthe governments. That's why my administration will also be proposing a further 20 basis\npoint reduction in our state's personal and corporate income tax rate, bringing it down\nto just 4.99%. This will fulfill a promise to the people of the state that I made during\nmy reelection campaign to lower our state income tax rate to under 5%. And with the\nThe General Assembly's passage in my signature, it will come a full three years ahead of schedule.\nThis tax cut doesn't promise to pay for itself years down the road, or create future budget\nholes with today's one-time money.\nOur plan fulfills my promise to the voters of this state in a responsible way, and most\nimportantly, this plan puts all the hardworking people of our state first.\nThe reason that we've been able to do this and through it three years ahead of schedule\nis because of our fiscal discipline.\nIt's also worth noting a few other important accomplishments that the last few years may\nnot have made headlines or please some of those that constantly advocate for bigger government.\nEven with the rebate and tax cuts that my office will propose this legislative session,\nOur state's rainy day fund and strategic reserves will still stand at over $10 billion.\nThese reserves are four time higher than any administration will leave behind in our\nhistory, and enough to run state government for three full months.\nWhen the storms of tomorrow come, it is my hope that we will share in a commitment to\nkeeping the state we all love on that firm foundation.\nOur state reserves are just one area that we have made historic strides in to set Georgia\nup for future success and prosperity.\nFrom the 2024 budget through the proposed amended 26 budget, $4.1 billion in capital projects\nhave been funded through cash instead of debt.\nThis strategic investment will save Georgia taxpayers and future state appropriators $3.3\nbillion in interest payments over the next 20 years.\nThe cash funding of capital projects we began in fiscal year 2024 has allowed us to reduce\noutstanding debt by over 20 percent in just three years.\nAnd the ratio of our state's debt service to revenues is just 3 percent.\nThe lowest since the state began issuing debt bonds in the 1970s.\nThese savings were all made while implementing historic tax cuts, returning billions to\ntax payers and investing over $6 billion in water, sewer and transportation projects across\nthe state. Refusing to grow government, budgeting conservatively and paying off debt aren't\nflashy. They don't get you on the cable news, make you famous on social media or fit on\na bumper sticker. And that might be the reason Washington has been so allergic to them.\nBut I learned a long time ago building houses that it's better to be a workhorse than a\nshow horse. Because workhorse's deliver results ahead of schedule under budget and do right\nby the customer. And that's exactly what we have been doing together for the people of\nour state.\nSo a lot of things there that will make a lot of people happy. Another tax rebate and\n$7.5 billion in rebates over the last four years. What did you think? What do you\nhave to say?\nSo I think it's a good thing that we started to see more of our elected officials talking\nabout the issue of affordability.\nBut I think the difference is how do we get there?\nHow do we provide relief to Georgians?\nAnd it was cleared through the governor's statements\nthat he believes in giving back more money that we earn.\nAnd I don't have a problem with that.\nBut then there's a tradeoff.\nThen are there other things that we could be funding\nto help some of those people who, if you give back their whole\ncheck, it still won't be enough when it comes to affordability?\nSo I think that while it is great,\nWe will not turn away the money that he's gonna offer,\nbut I think we should also consider\nwhat other things could we be paying for,\nlike childcare, health care to also help Georgians.\nOkay, another tax rebate,\nanother tax rate cut that's ahead of schedule,\nwhat he expected to do.\nYeah, these truly are historic times.\nGeorgia's been blessed with a healthy economy\ndue to sound physical policies now\nfor the last decade, really two decades.\nAnd Governor Kemp, you know,\nthank the General Assembly for their help\non his initiatives.\nAnd, you know, by reducing the income tax even more,\nit's gonna continue to make Georgia a competitive.\nThat was an initiative that was started\nin the house many years ago.\nIt's a promise that Governor Kemp made.\nAnd I think as he articulated today,\nthese are promises that he has made\nand that he's delivering on.\nand that's another thing where he's looking back\nat how he did over the years.\nYeah, and the other thing is affordability.\nIt's something both sides of the aisle\nare talking about.\nTalk about that a little bit.\nYeah, I mean, I think anytime you can cut taxes,\nas Governor Kim said,\nand not increase the size of government,\nI think that helps everyone.\nIt makes, you know, it keeps allows folks\nto keep more money in their pockets\nto spend in the economy,\nwhich stimulates the economy.\nand I think there have been investments\nthat have been made, whether it be transportation,\ninfrastructure, mental health care.\nThere have been investments that the state has made\nwhile at the same time cutting taxes.\nOkay, affordability, everybody has their own idea\nit seems of what that means.\nYeah, and I think, you know, the good thing about it\nis that we have 37 more days to figure it out.\nI think Republicans have their proposal,\nand I know Democrats will become to the table\nwith their proposals, and we hope\nthat at the end of this 40-day session,\nthat there's some agreement that could be made\nto help the citizens in Georgia out.\nYeah, it's an election year,\nit seems to be interesting that.\nOkay, now let's hear what the governor had to say\nabout workforce issues.\nDuring my administration,\nwe have reduced our state employee turnover rate\nby over 25%.\nAll while keeping the size of our full-time state workforce\nat 2019 levels.\nWe've invested in a vital workforce,\nsaved taxpayer dollars in training\nand equipping new employees,\nand utilized innovative and innovation and technology\nto better deliver state services.\nOur state employees have done an incredible job\nand unprecedented times,\nand are one of the driving forces behind Georgia's success.\nThat is why today I'm proposing a one-time\n$2,000 pace supplement for all state employees,\nincluding our educators and state public safety officers.\nThis is just another reminder on top of the pay raises and supplements we have provided\nin years past that their hard work does not go unnoticed and that we are truly thankful.\nOver the last seven years, Georgia has seen over 219,219,700 new jobs in more than $118\nbillion in investment from projects worked by the state economic development team.\n64% of those jobs, in 75% of those investment dollars,\nare going to communities outside the Metro Atlanta region.\nSince 2019, we've welcomed the three largest\neconomic development projects in state history,\nand continued Georgia's streak as an unborn state for business\nfor an unprecedented 12 years in a row.\nBut here in the best state for business,\nWe don't just welcome big companies.\nWe also champion small businesses\nthat have a big impact on local communities.\nA great example of that is La Regina,\nan Italian food production company\nwith a facility in Alma, Georgia\nthat employs 110 hardworking men and women.\nThis facility also happens to be a former bakery\nthat went out of business years ago.\nTo that community of less than 4,000 people,\nthe loss of an employer like that can be devastating.\nBut because we prioritize economic development\nin rural Georgia, Laursy and it came in\nand revitalized that facility\nand created 110 jobs that are making a real\nand lasting difference with more on the way.\nThe impact of this small business extends far beyond\nAlma's borders.\nIn addition to moving plenty of goods\nthrough the ports of Savannah.\nLa Rosina also purchases local produce\nfrom over 100 Georgia farmers,\nincluding more than 40,000 pounds of onions per week.\nWith touch points throughout that region of our state,\nthat one small employer produced a record\n25 million jars of pasta sauce last year alone.\nWhen Marty and I went to Southern Italy in 2024, we visited the headquarters of this\nfamily-owned and operated business.\nWe talked to the men and women who had preserved their family's recipes for over 100 years.\nAnd we saw how similar their values were to the very family-owned farms and businesses\nhere in Georgia that La Rosina supports.\nThat company, a full ocean away from our state, has the same values that we do.\nFamily, community, and a strong belief in a hard day's work.\nToday we're joined by two La Rosina company leaders who represent how small town Georgia\nand international markets truly connect, all to the benefit of our workers.\nAnd the gallery is a mediae Renaldi, chief operating officer of Law Resina who has moved\nhis entire family to our great state.\nHe is joined by Jerry Lady, the plant manager, an employee one for Law Resina at Georgia's\nfacility.\nYou'll be glad to know that Jerry was the former bakery manager for the company that closed\ndown.\nWell, both of you please stand and let us thank you for your investment in our state.\nSo a lot of talk about economic development, certainly in his term, he has done a lot in\nthat area.\nSo let's talk about that a little bit.\nBut first, this $2,000 supplement to all state employees one time, supplement.\nYeah, that's big.\nI think that shows, you know, that Governor Kemp is prioritizing our state employees.\nHe made promises to raise teacher pay, which he's done every year.\nAnd in addition to that, all state employees, we've had a problem with retention in some\nareas in state governments.\nSo I think this is an effort to make sure that those state government workers are recognized\nfor the hard work that they do and incentivize them\nto stay on the job.\nYeah, corrections is a big area\nwhere there is a need for this money, yeah.\nI'm not sure how much they may need\na little bit more in that area,\nbut we'll see.\nWe'll get all these a little more.\nNext week, next week is budget week,\nso we'll see if they talk about that.\nYour thoughts on some of what he talked about,\nlet's starting with this pace up a little bit.\nYeah, I agree.\nState employees, they definitely deserve it.\nHowever, I do agree with you as well\nthe day probably need a little more. As a former government official, I can understand the\nsacrifices that you make when you decide to become a civil servant and work for the government.\nAnd so, yeah, they should definitely be paid for their sacrifice. And I think that, you\nknow, while $2,000 is good, I think they're probably, we circular back and ask for a little\nmore.\nOne of the things he's done, and he talked about it, 65% of the jobs that have come in have\nbeen outside of Georgia, and really needed another parts of Georgia.\nYeah, I mean, I think what he's talking about.\nMetro Atlanta, I'm sorry.\nI said.\nSure.\nPeople want to be safe.\nThey want to have a good job.\nIt's debatable.\nWhich order those are in.\nThey want to have good schools.\nAnd it shouldn't matter what zip code you live in.\nAnd I think the investments that he's talking about show that he's committed to not\njust the Metro regions of the state, but also the rural areas.\nHave you been down there around the Hyundai Meta Plan?\nI have.\nIt's incredible.\nIt's enormous.\nYeah.\nAbsolutely. And I think that's one thing that both sides of the aisle can and can agree on that Georgia has been a great place for businesses to come and bring their\nOpportunities to Georgia. I just you know want to also hope I just hope that the there's a plan to make sure that we're training up Georgians to be able to fill those jobs when those\nCompanies come and not allow those companies to continue to ship in their workforce as well. Yeah, you wonder after the speech how many people are going to look for a\nfor a loragina sauce around the state.\nAnd those probably by daily unknowns that are in there.\nOkay.\nAs the governor had talked about the past five, eight years,\nhe put a focus, a strong focus on the largest part\nof the state budget, and that is the education budget.\nHere's what he had to say about that today.\nAnd one of the biggest reasons these job creators\nof all sizes, cheese Georgia, is our highly skilled\nand reliable workforce.\nOver the last seven years,\nWe put more money toward education and workforce training programs than ever before in the history of our state.\nIn fact, as of this current fiscal year, we have not only fully funded QBE seven times,\nbut added $368 million to programs and initiatives that directly prepare workers for good jobs.\nWe also set new precedents when it comes to school safety.\nStarting with the first year of my administration, we began with three campus\nsecurity grants totaling $184.5 million, and then added $109 million into the\nbase budget. So every school system can plan for how to best keep our classrooms\nand all of the children in them safe. We will again fulfill that commitment in\nthis year's budget, bringing the total amount that we have allocated to school\nsafety during my time in office to over five hundred and eleven million dollars.\nThank y'all.\nI also want to take a moment to also congratulate and thank the members of this\nbody, both past and present, who joined my administration in achieving something that\nnot many people thought was possible when I was sworn in as governor seven years ago.\nIn fact, when I pledged in 2018 to raise a teacher pay by $5,000, I remember a former\nopponent of mine claiming I was making false promises to our educators across the state.\nWell, in a way, the media and the doubters were right.\nWe didn't raise the teacher paid by $5,000.\nWe raised it by $9,500.\nThis historic investment in our educators increased the starting salary for a\nGeorgia teacher by almost 28%. And you don't have to get an A in math to know\nthat that's an impressive jump. In addition to K through 12, we've also made\nhistoric investments in our post-secondary education institutions and\nprograms while reducing costs for students and families. Over the last several\nyears, we have worked together to return the hope scholarship to 100% of its promise.\nAll while the border regents has held tuition, cost, and check across the system, so greater\nopportunity in Georgia can remain affordable.\nContrast that with other states that have again and again raised cost of higher education.\nAll while in place and reached 40-year highs under the prior administration.\nThe University of California, for instance, raised tuition by roughly 19% between 2019 and\nthe current academic year.\nBut here in Georgia, tuition is increased by just 5% in that same period.\nAnd your partnership in eliminating the special institution fee helped us lessen the impact\non those increases on hardworking families and students.\nIn fact, data from the National Center for Educational Statistics shows that Georgia is\none of the top states in the country for four-year public university affordability.\nAll while we've kept the cost of higher education and check, and college within the reach of\nGeorgia families, we've also invested more in post-secondary\neducation than ever before. We're now putting 2 billion additional dollars toward higher education\nin Georgia than when I first took office. That includes 40.7 million dollars in this year's budget\nproposal, a loan for healthcare education facilities and medical workforce training programs.\nAnd since I first took office, we spent over 26 million dollars for medical residency slots in\nour state, adding 897 positions for a grand total of 2,523 residency slots as of this fiscal\nyear. This year my budget proposal adds another $2.1 million to further this upward trend\nin such a critical workforce need. Along with these unprecedented investments, Georgia\nis truly the national leader in merit-based aid for higher education between the Hope Scholarship\nand grant programs. But in this era of high prices and new challenges for those graduating\nfrom high school, we also recognize the advantage that need-based financial assistance can give\nto those who would not otherwise be able to access higher education. Like there appears\nwho have the means to attend college. These students have great dreams for rewarding\ncareers in impactful lives, but they don't always have hope that those dreams can become\na reality. Dreams without the benefit of hope remain dreams deferred perhaps for entire\ngenerations. How much richer would the lives of those and their families be if they could\nto obtain the type of education that leads to a high paying job with great benefits.\nAnd how much would communities across our state benefit from these young people getting\na degree that opens their door or starts a rewarding career?\nI believe we owe it to every child to ensure they start out on a level playing field,\nno matter their zip code.\nTherefore my amended budget proposal invests $325 million in the University System of\nGeorgia's Dream Scholarship Program.\nThe first need-based scholarship of this kind, in Georgia history.\nIn future years, this one-time endowment will create opportunities for generational\neconomic advancement for thousands of students. And down the road it will allow them to complete\ncollege and begin meaningful careers without the burden of crippling death. The dream scholarship\nwill build on the incredible unmatched legacy of the Hope Scholarship and leave no stone unturned\nwhen it comes to student achievement in our state. From now on throughout the country,\nAmericans will know that hopes and dreams are alive right here in the great state of Georgia.\nThis unprecedented initiative, sorry, this unprecedented initiative will also complement\nthe Georgia Match program we launched in 2023.\nIn just the first two years of match,\nwe've seen a 5.9% rise in USG enrollment,\nand a 7.1% increase in TCSG enrollment.\nMeanwhile, other states around the country\nhave seen decreases in public university enrollment,\nand 17 states are still well below pre-pandemic levels.\nLots about education there.\nLet's start where he left off and that was higher education.\nNow we have the hope and dream scholarship for students\nwho have needs-based, they need to go to college,\nbut they cannot afford it.\nAbsolutely.\nI think this was actually the strongest part of his speech.\nI think he got several bipartisan applaud\nabout the investment that he's making in higher education\nand in the education system generally.\nBut yeah, I think for years, Democrats have been asking\nfor a needs-based scholarship program.\nAnd it's great to see that the governor has decided\nthat this is something that is worth investing in.\nAnd so I know that there are a lot of talent here in Georgia\nthat can stay in Georgia if they're given an opportunity\nto pay for college based on a demonstrated need.\nYeah, they definitely have the skills,\nthe knowledge that they should be in college,\nbut they just can't get there.\nYeah, it's nice to see the governor taking the lead on this.\nCommend him forward.\nIt certainly is a bipartisan issue and it shouldn't matter, you know, what party affiliation,\nwhat ethnic background you are, what have you, everyone should have that opportunity\nto get that, you know, higher education, whether it be technical colleges and a skilled\ntrade or, you know, a traditional four-year degree.\nYeah.\nAnd then when it comes to K-12, he talked about all the money that has really gone into\nteacher pay, it's really helped that amp safety in the schools.\nAbsolutely.\nAnd as a child of an educator, I always applaud any pay raises that goes to teachers.\nAnd as a matter of fact, I think teachers should be some of the highest paid professionals\nthat they are because our futures are literally in their hands.\nSo definitely applaud the governor for making that investment as well.\nAnd safety is absolutely important when we're talking about keeping our kids safe.\nAnd that's really a big part of his legacy,\nwhat he's done in education, higher end, and K-12.\nAbsolutely, and as a parent of a student who's\nin the university system, I'm particularly appreciative\nof, you know, the investments, I mean,\nthe hope scholarship, and certainly the school's safety issue\nin recent years has been at the forefront\nin these investments, I think, or critical\nin this time period.\nOK, well, we're going to keep going,\nbut coming up, we'll have the democratic response\nto the state of the state message.\nStay with us.\nGeorgia Farm Bureau, a grassroots organization dedicated\nto preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capital during the session and year round.\nGeorgia Farm Bureau, the voice of Georgia farmers.\nExplore the stories that move you.\nWelcome to the incredible world of GPB Passport.\nFrom inspiring science to endearing dramas,\nPassport is your access to an incredible catalog\nof PBS programming and new titles are being added all the time.\nTake a look at what's new.\nWho the cat wanna get?\nWe're going to have company.\nWell, that has been on season of the Gold.\nComfortable, bad, home-cooked meals.\nOh, sounds perfect.\nShall we just stay here?\nOh, it's open, you'd say that.\nYou are very much in the right place.\nIntriguing.\nIntriguing and potentially rewarding.\nHa, ha, ha.\nSomething for everyone if you catch my drift.\nWe can't wait to see where GPB Passport takes you.\nYour support as a monthly sustainer\nconnects you to the high quality news, information,\nand entertainment that you've come to rely on from PBS.\nAnd for GPB, your sustaining support\nis the most reliable source of funding for the programs\nand essential services that you rely on right here at home.\nMake an impact with your sustaining gift today\nand start streaming.\nVisit gpp.org and click Passport now.\nAnd thanks.\nIt's not a mountain thing or a coastal thing.\nIt's a Georgia people, places, and stories thing.\nWe're going to catch them on Georgia Public Broadcast.\nIt keeps Georgians everywhere, dialed into home.\nTune in to GPB.\nIt's a Georgia thing.\nWe are continuing with our special one-hour edition of lawmakers focused on the state-of-the-state\naddress. Joining me again for analysis are Spiro Amburn, a senior vice president with McGuire\nWoods consulting, Georgia government relations team, and Andrew Tyson, a senior policy adviser\nat Paramount Consulting. So we're rolling along, but now we're going to switch gears a\nlittle bit. And as always, Georgia Public Library casting live streamed both the governor's\naddress and the democratic response. Here now is the Democratic take from House Majority\nleader, I'm sorry, House Minority Leader Caroline Hugley of Columbus.\nGood afternoon Georgia. Today we heard Governor Kim's vision for our state. We heard about\ntax cuts and infrastructure. We heard about Georgia's business climate and economic growth.\nWe heard the language of success. But here's what we didn't hear. How much of it is making\nyour life more affordable.\nBecause while the governor celebrates his record,\nGeorgia families will sit at their kitchen tables tonight,\ndoing math that doesn't add up,\nworking more hours, but failing, falling further behind.\nChoosing between prescriptions and groceries.\nWondering if they'll ever be able to afford a home\nin the communities where they grew up.\nAfter more than two decades of Republican control\nin the state.\nIt's time for an honest accounting.\nNot of what they've done for their donors\nand the well-connected, but of what they fail to do for you.\nLet me be direct.\nGeorgia families are in an affordability crisis.\nAnd Republican leadership refuses to even name it.\nThe Alice Essentials Index, which\ntracks the real cost of survival, not luxuries,\nshows that in Georgia, the cost of basic necessities\nhas grown at 7.3% annually.\nThat's faster than the national inflation rate,\nand it's far faster than wages for working Georgians.\nHousing costs are crushing young families and seniors alike.\nHealthcare premiums keep rising.\nChildcare calls more than college tuition.\ngroceries that used to cost $100 now cost $250.\nAnd prescription drugs force impossible choices\nevery single month.\nGovernor Kim will tell you the economy is strong.\nAnd for some Georgians, it is.\nBut strength is not measured by how well the top is doing.\nIt's measured by whether the middle can hold\nand whether the bottom has a ladder up.\nBy that measure, after 20 years of Republican rule,\nGeorgia is failing working families.\nNow, Republicans want you to believe\nthey have the answer, more tax cuts.\nThe governor will tout his income tax cuts\nas a whim for everyday Georgians.\nBut let's follow the money.\nThe wealthiest Georgians got the biggest benefits.\nMeanwhile, working families got a few dollars a month.\nnot enough to cover the rising cost of rent,\nnot enough to pay for child care,\nnot enough to matter when everything else is more expensive.\nAnd here's what they don't tell you.\nEvery dollar they could in taxes is a dollar they can't invest\nin public schools, in health care, in child protection,\nor in keeping your community safe.\nThey're trading Georgia's future\nfor political talking points today.\nWhen the next recession comes, and it will come, we will have fewer resources to respond,\nfewer tools to protect families, fewer options to keep Georgia strong.\nThat's not fiscal responsibility, that's fiscal malpractice.\nBut it gets worse.\nAfter years of income tax cuts that primarily benefited the wealthy, Republicans are now\nfloating property tax cuts that shift the burden on to local communities. Let me be clear\nabout what this means. While they cut taxes for the top, they're increasing the pressure on\nhomeowners, renters, and local governments to make up the difference. This is not tax relief.\nThis is cost shifting and working Georgians always end up holding the bag. They claim these\nThese solutions, but solutions don't leave families worth off.\nSolutions don't protect the wealthy while squeezing the middle class.\nSolutions don't promise relief while raising your costs somewhere else.\nAfter 20 years in power, if their tax policies were working, Georgia's families wouldn't\nbe struggling to afford the basics.\nthey are, because Republican priorities are not your priorities.\nNo where is this disconnect more evident than in health care.\nRight now hundreds of thousands of working Georgians are trapped in the coverage gap, earning\ntoo much from Medicaid but too little to afford private insurance.\nThese are caregivers, service workers, rule Georgians doing everything right and still\nleft behind. Governor Kemp's alternative, Georgia Pathways, has been an unmitigated disaster.\nAfter 18 months, only 6,500 people enrolled. 75 percent below projections and three quarters\nof the spending went to consultants, not here. Meanwhile, 18 rural hospitals have closed\nsince 2013. Mothers are traveling hours to deliver babies. Emergency rooms are shutting\ndown and Georgia ranks near the bottom nationally in maternal mortality, with women dying from\npreventable causes.\nThis didn't happen by accident.\nThis is the result of policy choices.\nChoices Republicans made.\nChoices they defend.\nThe federal ACA subsidies that help hundreds of thousands of Georgia's afford insurance\nare expired.\nThis administration has offered no plan, none.\nIf you lose your coverage, if your premium's double,\nif your local hospital closes, that's not an act of God.\nThat's the consequence of leadership\nthat prioritizes ideology over people.\nLet's talk about Georgia's children,\nbecause if we cannot protect and invest in them,\nWe have no claim to leadership.\nOur foster care system is in crisis.\nThe Department of Human Services faces an $85 million deficit.\nThe Kemp administration has stopped providing services to foster children.\nChildren who are ready to reunite with their families are being forced to stay separated.\nMedical appointments are being delayed, canceled or left unpaid.\nand why cost overruns.\nInstead of coming to legislative partners,\ninstead of making the tough budgeting choices,\nleadership requires, he tried to hide the problem.\nHe swept it under the rug and hope, no one would notice.\nBut children notice.\nChildren notice when they can't go home,\nwhen they can't see a doctor,\nwhen their adults who are supposed to protect them fail.\nBecause of this incompetence,\nchildren will languish in care longer than necessary.\nThey will suffer emotional harm that could have been prevented.\nCase plans will stall.\nFamilies working to regain stability will lose momentum.\nLong standing providers who serve these vulnerable children\nwill go under and defects workers already overwhelmed\nwill buckle under impossible caseloads.\nThis problem should have been solved months ago,\nbut it wasn't, so now we have to clean up their mess\nand Georgia's children are paying the price.\nThe challenges don't end there.\nIn the past seven years,\nchildcare costs have skyrocketed.\nParents most often mothers are being forced\nto lead the workforce entirely,\njust to care for their children.\nThat means loss income today and lower wages for life.\nGeorgia families need clean, safe, certified child care\nwith well-played staff.\nThey can actually afford and depend on.\nAt the same time, too many Georgia children\nare not reading on grade level by third grade,\na known predictor of poverty, incarceration,\nand loss potential.\nAnd instead of strengthening the public schools\nthat educate 90% of Georgia's children,\nThis administration is diverting public dollars\nto private school vouchers.\nThis is not school choice.\nThis is abandonment.\nRule schools lose funding.\nUrban schools face overcrowding.\nSpecial education services are strained,\nand the students left behind,\noverwhelmingly low income, black and brown,\nare told to make do with less.\nYou cannot claim to care about Georgia's children\nwhile undermining the very systems\nmeant to protect and educate them.\nAnd we must talk about democracy itself.\nSince Republicans took control,\nthey have systematically made it harder to vote.\nLonger lines, fewer drop boxes, more barriers,\nmore intimidation.\nA government that fears its own voters\nis a government that has lost its way.\nThey say it's about security,\nbut we all know what it's about, control.\nWhen you can't win on ideas, you change the rules.\nWhen you can't persuade, you suppress.\nGeorgia's strength has always been in its people,\nbut if you solace the people, you hollow out the state.\nHere's what the 20-plus years of Republican control and seven years of Governor Brian Kemp\nhas given us.\nWorking families falling further behind while the wealthy get tax cuts, hundreds of thousands\nof Georgia's trapped without health care, 18 rural hospitals closed with more at risk,\na foster care system in collapse, public schools stripped of funding while private schools\nget subsidies, maternal mortality rates that shame a state this wealthy, voting rights under\nconstant attack, immigrant communities targeted even as they fuel our economy.\nGun violence, rising while solutions are dismissed. This is not a record to run on. This is a record\nto run from.\nGeorgians have had enough.\nAnd now, as Carl Spiral and Family Struggle,\ntheir answer is the same as it's always been.\nMore tax cuts for the top, more burden on the middle,\nand more excuses for why government can't help.\nDemocrats have a different vision.\nOne rooted in the reality Georgia families live every day.\nWe believe affordability must be the standard\nby which we measure every policy.\nIf it doesn't make life more affordable\nfor working families, we don't support it.\nThat means lowering the cost of healthcare\nby fully expanding Medicaid,\ncapping prescription drug costs,\nand investing in state funded programs\nto reduce insurance costs.\nIt means keeping rural hospitals open\nand addressing maternal mortality\nas the crisis that it is.\nMaking housing affordable by increasing supply,\nprotecting renters from exploitation\nand ensuring that home ownership is within reach\nfor young families and working Georgians,\nnot just investors and out-of-state buyers.\nInvesting in public education,\nbecause strong schools make parents\ndon't have to pay for private alternatives,\nbecause educated workers earn higher wages\nand because no child should be left behind\nbased on their zip code.\nMaking child care affordable and accessible,\nso parents can work without spending half their paycheck\non care, and so every child gets a strong start.\nEnsuring working Georgians keep more of what they earn\nthrough a tax system that is fair,\nnot one that cuts rates for the wealthy\nwhile shifting burdens onto home wars and ridders.\nprotecting democracy.\nSo every Georgia's voice is heard,\nevery vote is counted,\nand government remains accountable\nto the people, not special interests.\nThis is not radical.\nThis is responsible.\nThis is what leadership looks like\nwhen it serves the people, not the powerful.\nThe question is not whether Georgia has potential.\nWe all know it does.\nThe question is whether we will finally realize\nthat potential for all Georgians\nor continue down a path that leaves working families behind.\nGovernor Kemp and Republican legislators\nwill tell you they've done enough that Georgia is strong,\nthat Georgia is the number one place to do business,\nbut I ask you this, if Georgia is so strong,\nwhy are you struggling?\nIf the economy is booming, why can't you afford red?\nIf their policies are working, why does everything\ncost more?\nThe truth is simple.\nTheir policies work for some Georgians, just not most Georgians.\nAfter 20 years of the same priorities,\nthe same tax cut promises, the same refusal\nto invest in health care, education, and in our children,\nthe results speak for themselves.\nGeorgia's families are doing their part.\nThey're working harder than ever.\nThey deserve a government that works just as hard for them.\nHouse Democrats stand ready to lead on affordability, to make the investments Republicans refuse\nto make, to protect the services they're trying to cut, to fight for the Georgia that works\nfor everyone, not just the well-connected.\nWe are fighting for affordable healthcare options.\nWe are fighting to fund public schools.\nWe are fighting to make housing and childcare affordable.\nWe are fighting to protect democracy and voting rights.\nWe are fighting to keep your calls down, not shift them around.\nBecause Georgia families and your children deserve nothing less.\nThis is not about partisan politics.\nThis is about priorities.\nIt's about who government serves, it's about whether we will finally meet this moment\nwith the courage and the honesty it demands.\n20 years is long enough to judge a record.\nAnd the record is clear.\nIt's time for new direction.\nIt's time to actually put Georgians first.\nIt's time for a government to work for you.\nThank you.\nMinority Leader, Hugo Lee, focused not just on the governor's two terms, but on more\nthan two decades of Republican control of the state government.\nTalk about that a little bit, and not just on these last seven years.\nYeah, and I think it's clear, you know, this is an election year.\nShe's making the case for leadership change, you know, if Democrats are in power, these\nare the things that we will focus on, the how, you know, she did focus on affordability,\nlike we mentioned at the top of the show, but then she's making the case as to what\nBut what would be the issues Democrats focus on come November if elected and given the\nseat of power?\nOkay.\nYour take?\nYeah.\nYou're exactly right.\nMust be an election year.\nI took some notes on that one.\nYou know, yeah.\nThe minority leader and the Democrats are trying to find some traction on education, health\ncare.\nShe talked a little bit about the foster care system.\nBut as Governor Kim articulated in his speech, talking about not just his term and the minority\nleader reference, you know, the last 20 years, I mean, we've had record unemployment.\nHigher education enrollment is up.\nUnfortunately, we're going to have to leave it there.\nUnfortunately, we're going to have to leave it there.\nYeah, maybe you guys can come back.\nThanks so much for coming on this show, because that does it for lawmakers today.\nWe don't have a show on Fridays, but the General Assembly will be in session tomorrow and\nAnd look for alumnaker's capital report from Sarah Callis at the end of the PBS News\nHour about 6.55 p.m.\nHave a good evening.\n",
  "updated_at": "2026-02-12T01:27:02.616073+00:00"
}