{
  "video_id": "n3agF8jqffs",
  "url": "https://youtu.be/n3agF8jqffs?t=1804",
  "title": "Georgia House - Day 39 (2026-03-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-03-27",
  "duration_minutes": 243,
  "summary": "Overview: The Georgia House session on March 27, 2026 included the reauthorization of the Rural Development Council, consideration of a bill related to county tax commissioners' retirement plans, and the introduction of several other bills.\n\nKey Actions:\n- **HR 488**: Reauthorized the House Rural Development Council for the current biennium.\n- **SB 56**: Amended the tax code to allow certain county tax commissioners to participate in a state-administered deferred compensation plan.\n\nBills Introduced (First Reading):\n- HB 52, HB 77, HB 8518, HB 193, SB 11, SB 121, SB 129, SB 160, SB 2, SB 60, SB 202, SB 222\n\nNotable Moments:\n- The session included discussion and presentation of HR 488 to reauthorize the Rural Development Council, highlighting its past accomplishments in supporting rural Georgia.\n- SB 56 was presented, which would expand retirement options for certain county tax commissioners.\n\nVotes:\n- HR 488 was adopted by a vote of 166-0.\n- SB 56 was referred to the Committee on Retirement.\n\nAttendance:\n- A quorum was present, and members participated in recorded votes.\n\nAdjournment:\n- The session adjourned. The next session date was not specified in the transcript provided.",
  "transcript": "\n\nAll right, I'm running late. I'm running late. I don't want to run later. All right, members will please take your seats. Mr. Clerk, will you ring that bell? Members on your desk, you have a supplemental local calendar, supplemental local calendar. They're already reading the passage of uncontested local bills. These are not two-thirds. Third reading the passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole, with a recorded vote, hearing none is so ordered. Mr. Clerk, will you read the local calendar? Senate Bill 285 by Senator Anderson, the 24th Columbia County Senate Bill 287 by Senator Parent of the 42nd City of Decatur. And Senate Bill 297 by Senator Hodges of the 3rd, Macintosh County. Is there any objection to the previous question being ordered on the local calendar? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? Chair, here's none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar? We will vote yes. All those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of the bills, on the local calendar. The yeas are 157, the nays are zero. The bills haven't received a requisite constitutional majority, or therefore passed. We're going to take a couple of bills up that are on the supplemental number two, supplemental number two calendar. The second supplemental calendar. Mr. Clerk, would you read a caption to House Resolution 488488? The House Resolution 488, by Ripson of Meeks, the 178th and others. A resolution reauthorized in the House Rural Development Council. This resolution has been assigned to the Committee on Economic Development and Tourism. That committee recommends that this resolution be adopted. The gentleman from the 178th House District, Chairman Meeks, is recognized to present the resolution. Thank you, Mr. Speaker. Ladies and gentlemen, I bring to you House Resolution 488, which will reauthorize the Rural Development Council for the current biennium. Originally in 2017, the House Resolution 389 created the Rural Development Council, and it has been reauthorized. Everybody, I'm since them. For you, the new members, you may or may not know, the late speaker, David Rostin, when in this, the Council was created in 2017, instructed the Council to study the conditions, needs, and the problems related to Rural Georgia and recommend that any action or legislation that the Rural Development Council deemed necessary and or appropriate. The Council has had lots of accomplishments since the inception, and that was chaired by former Chairman of Appropriations, Terry England, as well as the late Jay Powell, and more current Chairman's being Chairman Rick Jasper's and Senator Sam Watson, who is over in the Senate now. But the Rural Development Council and its members have sponsor legislation for Rural Georgia Census inception. The Governor has signed 27 legislative acts that's created, the expansion of Rural Brawban, signed legislation that created the Center for Rural Prosperity and Innovation, signed legislation in HBO 769, which created the Rural Center for Health Care Innovation and Sustainability. And as many of you know, who were here shortly after Hurricane Michael Pass in 2017, the Rural Development Council hit a landmark for the highest level of new funding and Rural initiatives with nearly 114 million included in that as 20 million for emergency disaster relief for Georgia farmers impacted by Hurricane Michael, and another 2 million to address level Brawban mapping, which some of you know, the state undertook that initiative on its own. So ladies and gentlemen, House Resolution 488 reauthorizes the Rural Development Council for the current biennium. Mr. Speaker of the non-any questions, I will yield the well. You have no questions. Thank you ladies and gentlemen, I would appreciate a favourable consideration of House Resolution 488. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here has done the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the adoption of the resolution? The chair here has done the report of the committee is agreed to. Shall this resolution now be adopted? All in favour of the adoption of the resolution? We will vote yes. All those opposed will vote no, and the clerk will unlock the machines. Have all members voted. All members voted if so. The clerk will unlock the machine. On the adoption of the resolution, the yeas are 166. The nays 0. The resolution having received the requisite Constitution majority is therefore adopted. Mr. Clerk, will you read the caption to Senate Bill 5656? Senate Bill 56 by Senator Huffsteadler, the 52nd and others to be entitled to amend chapter 5 of Title 48 of the official quoted Georgia annotated relating to add Valorum taxation. So it requires the state revenue commissioner to contract with the board of employees, retirement system of Georgia to offer certain county tax commissioners the option to participate in a state administered deferred compensation plan. This bill I would refer to the committee on retirement that committee recommends that this bill do pass by rules committee substitute. Chairman Shaw Blackman has recognized to present the bill. Thank you, Mr. Speaker. Fellow members bring to you Senate Bill 56. So while most tax commissioners can participate in their local retirement plans, there are many that have no retirement at all. So this would give the underlying bill would give ERS eligibility for tax commissioners not eligible to participate in any other retirement plan. There are three other parts that received overwhelming favorable consideration by this body. Part two is as pass the House version of HP 454 fully endorsed by the Georgia site of CPAs and includes a section of depreciation for certain expenses in year. One for manufacturing folks part two clarifies and cleans up some of the existing provisions and the tax code with language to better align the federal code and aid families by fully facing in the standard deduction. The third part updates the definition of force measure adding pandemic as part of the definition for natural disaster part to be is what is known as the preceptor credit and it extends the sunset simply for the program that gives our medical assistance and nurse practitioners more hands on experience in part three is a house bill 170 as pass the house. So this is a state holder approved parity for our brick and mortar stores on digital goods. Once again, I'm happy to try to answer any questions. Mr. Speaker dig into the weeds as much as liked that is the bill. Gentlemen yields you have a question right in front of you. I will yield. We'll park has a question. Thank you, Mr. Speaker. Chairman, do you yield for a few questions? I yield to you, sir. Yes, they'll be friendly at the best of my bill. Is it not true that a fiscal note for House Bill 454, which is now section two of this rule substitute estimates that shortening the lookback period from five years to three years with result in the decline in state revenue by 133.7 million in fiscal year 27. And by a decline of 476.3 million in fiscal year 2028. Well, it's perspective and that would be fine. That would be great actually. Wouldn't it? But it overlaps because there are some offsetting language and that's based on what the author had to say regarding those provisions from last year coming out of the Senate. The gentleman further yield I do. Is it not true that this bill would be an excellent vehicle for a non-refundable EITC that would help lift hundreds of thousands of families out of poverty in Georgia. Actually, I look forward to that discussion, but the provision here regarding the standard deduction outperforms the ITC on many fronts and actually would save a family of four starting next year. Well, over $300 and say that same family of three at a $29,000 over $250 per year in tax. So we're looking to save money for low and middle income families. Yes, sir. Thank you. Chairman, do you have for one final question? Yes, sir. Is it not true that while I have concerns with section two of this bill, I will be voting yes because overall, especially with the inclusion of the standard deduction, the benefits of this bill, at least in my assessment outweigh the potential costs. I'm sure you know what you speak, Mr. Wepp. Thank you. Thank you, Mr. Chairman. Thank you. Gentlemen has no further questions. The speaker asked the body's favorable consideration yield the well. Gentlemen, as yielded the well, is there any objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to withdrawing the committee's substitute? Chair, here's none. The committee's substitute is withdrawn. Is there any objection to adopting the committee? The substitute offered by the committee on rules. Chair, here's none. The rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage? Or the bill will vote yes. All opposed. We'll vote no and the clerk will unlock the machine. For what purposes represent your race, rise. He weighs for what purposes represent gladden the rise. Thank you, Mr. Speaker. Pursuant to House Rule 133. I request to be excused from this vote, Mr. Speaker. The gentleman has that right and the journal will so reflect. Have all members voted. If so, the clerk will lock the machine on the passage of the bill. The A's were 168. The NA's won. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, would you read a caption to Senate bill 240240? Senate bill 240 by Senator Walker, the 20th and others to be titled act to amend. Title 47 of the official go to Georgia, annotated, relating to retirement and pensions. So it's revised the minimum and maximum allowable benefit multiplier for current and future retirees. This bill I have referred to the Committee on Retirement. That committee recommends that this bill do pass by Committee substitute. Chairman Carson's recognized to present the bill. Thank you, Mr. Speaker. Present to you Senate bill 240. The court portion of Senate bill 240 when it came over requires the employer retirement system to identify school systems that are providing retirement benefits to employees. Who are not also eligible for Social Security benefits under Title II. Basically what Senator Larry Walker is looking to do is identify those systems that have a retirement benefit that's not that great. And as a result, even after 20, 25 years of service that some public school employees other than teachers might not be also qualifying for Social Security benefits under Title II. That's for federal old age survivors, disability insurance benefits. So it's not a cost we're asking ERS to do a review, a study of those systems. The second part lines 21 through 32. This is correcting a discrepancy in state law. I'm holding up a letter from the IRS in 2010. And in a attorney general opinion concluded that Georgia state law was not clear whether a commission charter school teachers needed to be in a state plan, state retirement plan. However, in 2015 an audit of one school's retirement plan the IRS noted that the school was out of compliance with this letter dated May 15, 2015 from the IRS. Very simply this bill clarifies that these employees hired on or after June 1 of 2023 are not part of the state plan. Only if the nonprofit governing board elects to provide an alternative plan. So if a nonprofit governing board offers an alternative retirement plan and clarifies that these employees are not part of the state plan. The last part of the bill is what House Bill 285 authored by my friend from Statesboro. This allows the IRS to invest up to 10% in alternative investments. It didn't make it all the way through the Senate. We're going to try to get it done this way. So with that Mr. Speaker, I'll yield for a question, but given the hour, I prefer to yield the well. That's your choice. You have one question. Yes, sir. Representative Jasmine Clark to your left has a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. All right. So you mentioned when you were going through the bill. First, we have two copies of this. You tell us what LC number you are. Yes, ma'am. I'm working on LC 432861S. Okay. Thank you. Does gentlemen further yield? Yes, ma'am. All right. So you mentioned that the this bill requires a report for those employees that are not going to are not eligible for Social Security. I understand that. What is the purpose of this report? Like what are they? What is the intention after this report is? Sure. I think the Senator Walker across the hall and it's specifically it's a report of the systems, not the employee level data. But we're going to try to find out the systems that offer retirement plans that are not enabling these hardworking public school employees to also, if there's a case of disability, what have you to also qualify for Title II or Social Security? That's what we're looking to do to make sure that all of these public school employees are covered as best they can. So, gentlemen, you're for a final question. Yes, ma'am. So is there legislation in the works to fix that because this sounds like it's just more of like I'm going to tell you this is happening, but I don't see where it's actually going to. Well, I think we need the information first and that's what this review is all about. Thank you. Thank you. With that much to speak or given the hour, I would ask for this body's favorable consideration. Gentlemen, has yielded the well? Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to withdrawing the committee's substitute? The chair, here's none. The committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? Chair, here's none. The rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted if so, the clerk will lock the machine. On the passage of the bill, the yeas are 165, the nays 1. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption to Senate Resolution 175, 175. Senate Resolution 175 by Senator Brass, the 28th and others, a resolution creating the Joint Study Committee on dual enrollment for highly skilled talent at younger ages. This resolution haven't been assigned to the committee on education. That committee recommends that this resolution be adopted by committee substitute. Thank you, Mr. Clerk. The gentleman from the coast, Representative Townsend's recognized to present the bill. Thank you, Mr. Speaker. There's two parts of this. Section 1, one senate five, the original one, 75. It relates to Senate Bill 86, where it's a study committee to track the kids who are entering using the hope, credit, dual enrollment credit as a sophomore instead of a senior, so they can jumpstart the career such as health care and health care, robotics, manufacturing in those areas. Second part is a service delivery strategy section, creates a joint study committee. As you know, during the law's negotiation, sometimes the county government, the city government, I guess, gets an odds at each other and this will help with the impasse. Mr. Speaker, that is the, yep, and there's any questions we go ahead and answer if not all you the well. You have no questions. Thank you, Mr. Speaker. The gentleman's yielded the well. Is there any objection to the previous question being ordered? The chair here is done. The previous question is ordered. Is there any objection to agreeing to report the committee, which was favorable to the adoption of the resolution? The chair here is done. The report of the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution, we'll vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purposes, Ripsons, Adeyinia rise. He weighs. Good choice. Have all members voted. If so, the clerk will lock the machine. All in the adoption of the resolution. The yeas were 167, the nay zero. The resolution having received the requisite constitutional majority is therefore adopted. Mr. Clerk, were you ready to caption the Senate bill 1313? Senate bill 13 by Senator Albers, the 56 and others to be entitled to amend Code Section 913161-4414-162 and 4841 of the EFJ go to Georgia annotator relating to where and when sales under execution held and change a place of public sales by court order. Mr. Clerk, this bill never referred to the committee on judiciary. That committee recommends that this bill do pass by rules committee substitute. Chairman Chuck Martin is recognized to present the bill. Thank you Mr. Speaker, ladies and gentlemen, with respect to the clerk, that's not what this bill does anymore. This bill has been replaced. Senate bill 13 has been replaced with House Bill 36. House Bill 36, this body passed 170 to zero on the 23rd of February. It passed Senate committee on the 14th of March and didn't make it onto the floor for Senate rules. So, Senator Albers has been gracious enough to give us this bill number so that we could send this over and make another pass at that to remind the House what this does is this allows people taxpayers to appeal directly to a hearing officer with real property. I'm sorry, personal property of over $200,000. We're trying to unclog if members remember, we're trying to unclog the spirit court system because right now if you appeal, you go to the Board of Equalization, which is surely to get you to appeal to the Superior Court. Spirit court is clogged already and is not an appellate court. So this is trying to allow them to go to a hearing officer. Again, Mr. Speaker, this is a bill that has the exact same language that we passed 170 to zero on the 23rd of February. If there are no questions, I would ask us to send it over to Senate again to give them one more shot to do the right thing by the taxpayers in Georgia. Gentlemen, has no questions. I yield the well and ask for the House's favorable consideration. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to withdrawing the Committee's substitute? The chair here's none. The Committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the Committee on Rules? The chair here's none. The Rules Committee's substitute is adopted. Is there any objection to agreeing to the Report of the Committee, which was favorable to the passage of the bill? The chair here's none. The Report of the Committee is agreed to. Shall this bill now pass all in favor of passage of the bill? We'll vote yes. All those opposed. We'll vote no and the clerk will unlock the machine. Have all members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas were 170. The nay is the bill. The nay is zero. The bill haven't received the requisite Constitution majority. Is therefore passed. The clerk will read the caption to Senate bill 1111. Senate bill 11 by Senator Albers, the 56 to amend Article 1 of Chapter 3, Title 35 of the EFISH COTA Georgia annotated relating to general provisions concerning the Georgia Bureau of Investigation, so to provide for concurrent jurisdiction by the Georgia Bureau of Investigation in cases involving identification, investigation arrests, and prosecution of individuals or group of individuals, for violation of state laws. I spill that in order for the Committee on Public Safety and Homeland Security. That committee recommends the disbill due pass. I'm going to recognize the lady from the 131st House District. Is today a special day? It is a special day. Happy Birthday, Representative Jody Lot. Happy Birthday. Representative Lot is recognized to present the bill. Good evening, colleagues. If you heard the clerk's reading of the caption that is almost the entire bill. SB 11 is the Georgia Fights Terrorism Act. It is six lines that simply clarifies the role that the Georgia Bureau of Investigation holds as it relates to investigating and handling concerns of domestic cyber, biological, chemical, and nuclear terrorism. I ask for your favorable consideration of the bill. And Mr. Speaker, if there are no questions, I will yield the well. The lady has no questions. You did a great job. Thank you. The lady has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And the clerk will unlock the machine. Have all members voted. All members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas were 165. The nays 0. The bill haven't received the requisite constitutional majority is therefore passed.\n\nMr. Clerk will you read the caption to Senate Bill 195195? Senate Bill 195 by Senator Walker, the 20th being titled an act to amend title 43, the 50th district court of Georgia, and it's related to professions of businesses. So it's the repealed code section 43134 relating the licenses for transitioning members of the armed forces. This bill having further the committee on regulated industries that committee recommends that this bill do pass by rules committee sub. There she is. Representative Ballard is recognized to present the bill. Thank you, Mr. Speaker. So we have a rule substitute. So what's being served in is House Bill 377, which is a bill that was voted unanimously out of this chamber last year and got caught up in the Senate and didn't quite make it over before Sinney died last year. It changes the language. Military spouses will receive their expedited licenses within 30 days instead of 90 days. And that's what it does. Any questions? Lady has no questions. Okay. Thank you. I yield the well. Lady Agio to the well. Is there any objection to the previous question being ordered? The chair here is done. The previous question is ordered. Is any objection to adopting the substitute offered by the committee on rules that chair here is done? The rules committee substitute is adopted. Is any objection to agreeing to the report of the committee, which was favorable to the pastor of the bill? The chair here is done. The report of the committee is agreed to. Shall this bill now pass all in favor of the pastor of the bill? We will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose is representative gladdeny rise? Parliamentary inquiry, Mr. Speaker. State your inquiry. Is it not true that this is a military bill and it supports those who serve this country in this state? I know that Lady knows very well of what she speaks because she's done that. Thank you, sir. I appreciate this bill. Thank you for that question and that statement. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. All the yeas were 169, the nays are zero. The bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, you read the caption to Senate bill 127. 127. Senate bill 127 by Senator Hickman of the fourth to be entitled to amend Article 3H, Chapter 13. Of Title 4080, the fiscal to Georgia, and Tateau relayed an excise tax on rooms, lodgings, and accommodations. So it's to provide procedures for certain local governments to change the designated private sector, non-profit organization, engage to promote tourism, conventions, and trade shows. This bill I refer to the committee on ways and means that committee recommends a dis bill do pass. Let's see. All right. The dean of the Chattam County delegation, the city of Savannah, and all of Chattam County and parts unknown. Representative Chattam and Rod Stevens will present the bill. That's quite an introduction. Thank you, Mr. Speaker. Ladies, Jim in the House, Senate bill 127 is an oversight agreement between cities and the lodging taxes, if you will. It's to build and enhances the jurisdiction of the Department of Community Affairs, which includes oversight over the agreements between the local government and the destination marketing organizations. Some of you might call those CVBs. The bill passed the Senate 50 to 2. And over here it got out of the ways and means committee unanimous, but ran out of time. Only the hotel, motel, performance review board is active already in the DCA. So this will just oversight, and that's all the bill does. General, you have a question? Yes, sir. We'll park right to your left. Thank you, Mr. Speaker. Mr. Chairman, sorry. Could you go over the LC number? I think I may be confused with the rule substitute. I hope that I have got the right one. LC 4721 63. Thank you. Thank you, Mr. Speaker. I'll ask for your favourables. You have one more question. Certainly. Representative Donna, to your left, has a question. To your left. Does my friend Neil? Absolutely. Let me ask you, does this renew the $5 tax that we have to charge every time my cabins? We rent them. It's a $5 charge. No, sir. Thank you. Yes, sir. Mr. Speaker, I'll yield the well. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is done. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? Chair here is done. The report of the committee is agreed to. Shall this bill now pass all in favour of the passage of the bill? We'll vote yes. All those opposed? We'll vote no and the clerk. We'll unlock the machine. All members voted. If so, the clerk will lock the machines. All the passage of the bill, the yeas were 161. The nays 4. The bill, having received the requisite constitutional majority, is therefore passed. Mr. Clerk, were you read the caption to SB 160? 160. Senate Bill 160 by senator still the 48th and others to be entitled, not to amend title 34, the official code of Georgia annotated, relating a labor and industrial relations. So, it's to change certain provisions relating to employment security. The bill referred to the committee on industry and labor, that committee recommends that this bill do pass. Representative Cameron is recognized to present the bill. Thank you, Mr. Speaker. Several weeks ago, I presented HB 8518 as a labor bill that reestablished an administrative assessment that had been allowed to lapse for the Department of Labor. It also established a new .06 assessment for new employers. Senate Bill 160 is almost exactly the same except it changed the dates that the administrative assessments laps. My bill, the assessment, the .06 lapsed on 1231 of 2033. On the Senate Bill 160, both assessments, they sunset it, 1231 of 2026. And that's the bill. I'll yield for questions, Mr. Speaker. You do a good job, you don't have any questions. Thank you, I ask for your favor of consideration. General M. Zio did the well. We do have a couple of speakers on the bill. Representative Lisa Campbell is recognized to speak to the bill. Thank you, Mr. Speaker. Good evening, colleagues. It's been a long day and we've talked about a number of issues impacting our constituents and the people of Georgia. Here today we talked a lot about ending poverty. And I want everyone to understand what we're about to vote on while it might seem like it's clerical in nature that we've done it before. This particular bill does not move us forward in terms of ending poverty and homelessness. This bill, Senate Bill 160, reestablishes a previously implemented administrative assessment fee, but it could also potentially risk the solvency of Georgia's unemployment insurance trust fund. And this is why I rise today to speak against Senate Bill 160. As a long time business owner in Georgia and a long time professional worker in Georgia, I have firsthand experience about the benefits as a business owner of contributing to our unemployment insurance. It's an important part of protecting and empowering a stable economic environment for people and for companies to thrive throughout the state. We all know that the federal state unemployment insurance system helps many people who have lost their jobs by temporarily replacing part of their wages while they look for work. Some may not know that this was created in 1935 as a form of insurance, like health, home, car insurance, to help citizens manage financial risk when a job loss happens in which modest taxes collected from employers are paid into the system on behalf of their working employees to provide them with income support if they're laid off by those same employers. The system also helps sustain consumer demand during economic downturns by providing a continuing stream of dollars for families to spend in our economy. Unemployment insurance benefits are designed first to relieve distress for jobless workers and their families. In recessions and early stages of recoveries, they also have a dual purpose because they also provide an additional benefit. They stimulate economic activity and job creation. It's the whole reason Congress created the basic unemployment insurance program to boost our economy. A little note here, we often talk about unemployment in benefits and we dropped that insurance often when we're speaking. I think that hurts our understanding of the impact that it has. It helps working Georgians. Working Georgians. To qualify, a person must have one lost a job through no fault of his or her own. This does not protect people who quit. This does not apply to people who are not working. Number two, they have to be able to work, available to work, and actively seeking work, all things that we support. Number three, they have at least earned a certain amount of money during a base period prior to becoming unemployed. They haven't just worked a day or two. And more than 70 years after its inception, unemployment insurance continues to provide a valuable cushion against income losses from temporary unemployment for all of our families. We talked about this earlier, right? Why do we have such a homeless problem? If I lose my job, how am I going to pay for my mortgage if I own a home? How am I going to pay for my rent? How am I going to care for my family providing food and all the things that we support our family with? It also serves as an effective automatic stabilizer for the overall economy because it shores up workers purchasing power. The basic compact that the unemployment insurance system has embodied since the creation, since 1935, is that people who have amassed a sufficient record of work and on whose behalf unemployment insurance taxes have faithfully been paid should receive these benefits if they're laid off and they're searching for a new job. So if we agree on the success of this program, then shouldn't it follow that we agree that the program should be solvent and we should not be taking steps that jeopardize our future ability to maximize the long-term economic benefits. So now to the crux of this bill. Federal law defines unemployment compensation as, quote, cash benefits payable to individuals with respect to their unemployment and it lays out a few basic requirements, principally the following two. Number one, quote, all money withdrawn from the unemployment insurance fund of the state shall be used solely in the payment of unemployment compensation. Park that for a minute. And number two, states cannot impose excessively burdensome methods of administration that block access for otherwise eligible individuals. These requirements ensure that states maintain programs. However, Senate Bill 160 has reintroduced an administrative fee that will be paid by employers and then used by the department for staffing. But in an effort to keep the total dollars paid by employers at the same rate, the proposed tax rate for new businesses has been lowered so that businesses will not see an increase. Sounds good for business in the short term, in the short term, but it really hurts our ability to keep our trust funds solve it and it helps and it hurts businesses in the long term as well. Short term benefits for our businesses today, losses for our economy and our working families tomorrow. This is especially problematic at this time because financial planners and economists recommend that states have at least a year's worth of funds in their unemployment insurance trust fund. And the state of Georgia currently only has four months of funding in our unemployment insurance trust fund, which is dangerously low for a state the size of Georgia that takes pride in our vibrant economy. Think about some of the other trust funds we've been talking about here. The lottery, we have a significantly higher percentage of funds. If we really care about our workers, if we are serious about ending homelessness and poverty, we can stop this by changing the language in this bill and thinking about the rates differently. Most of this bill are creating an either or narrative potentially, suggesting that we can only adequately fund the administration assessment fees, which funds the Department of Labor's operations, and we can't adequately fund our trust fund at the same time. I think this is limiting an a failure of our legislative leadership if we buy into it. We can and to maintain the vibrancy of our well-being and economic stability, we must work to do both. When we look at the detail, lines 32 through 36, Senate Bill 160 would suppress the employer unemployment tax rate given to new employers, extending the suppression of attacks that directly funds our trust fund from its original rate of 2.7% to 2.64%. Swapping out with that, administrative fee. On lines 37 through 46, the bill goes a step further by setting up to potentially permanently reduced new employer-generated revenue that funds, Georgia's unemployment insurance trust fund. From a business perspective, these provisions don't serve desires for more stable economy and a larger pool of quality workers. That's where we're going here for here, right? And reducing unemployment trust fund dollars often leads to worse further restricting jobless workers access to benefits to compensate the smaller trust fund. One other note here, this reduction is for new employers, but it's interesting to bear in mind that less than half of new businesses survive for more than five years. So when these workers lose jobs from businesses that will routinely fail, some of their employers who've been paying this reduce rate will seek in benefits that Georgia must pay for. When it's hard for workers to access unemployment during jobless spells, fewer of them have wage protections to pay for basic necessities. This could likely force Georgia workers into unstable jobs that eventually cycle them back to unemployment because they're just desperate to make ends meet, or it could force them to suffer longer jobless spells as they struggle to continue their job certs and stay afloat without ample resources. Or ultimately, it could push them out of the workforce completely because of the weight of spiraling hardship. We talk a lot about helping people. If we look at this bill and do it differently, we could actually help out upstream proactively, helping Georgia workers so they don't drown when they are laid off for no fault of their own. For legislators committing to equitably balancing the needs of our shared economy, working families and employers, for a body that wants to address homelessness, poverty, and improve healthcare outcomes, this bill may be one of the most important ways we could stop the spiral of potential financial ruin when people lose their job through no fault of their own. Let's stop pushing people into the river of downward prospects. Saying no to this bill and going back to the drawing board would be addressing one of the root causes of homelessness. Join with me and let's send this bill back to committee to reinstate the admin fee and support minimal tax rates that fully fund the solvency of our unemployment trust fund. In doing so, this bill should receive your no vote. Thank you and I yield the well. Lady has yielded the well. Wilt Park is recognized to speak to the bill. Thank you, Mr. Speaker. I rise in opposition to SB 60 because it may under fund the unemployment insurance fund or UI trust fund by an estimated 60 to $75 million over the next three years, which as my colleagues so eloquently and comprehensively argued would unnecessarily risk the solvency of the UI trust fund. Colleagues, I know the hour is late. Given the excellent remarks that my colleague provided, I will not read all of my remarks, believe it or not. This is an important issue that can be difficult to follow. I would like to provide as much information about an issue that is critically important, especially to Georgia workers and a moment of economic, thank you, Mr. Speaker, in a moment of economic uncertainty. Georgia's unemployment insurance trust fund is a critical part of our state's social safety net, providing temporary financial assistance to eligible individuals who have lost their jobs again through no fault of their own. The solvency of this trust fund is wholly dependent on our actions and the actions of Georgia employers. Now, let's dive into the meat of this bill. In SB 160, in Section 1, lines 16 to 36, the contribution rates of employers in the state of Georgia are listed that require them to pace various amounts per different periods. As you can see online 18, the standard contribution rate is 2.7%. Unfortunately, again, as my colleague stated, this bill suppresses new employers' UITrust fund contribution rate from 2.7% to 2.64% of the employer's payroll until 2026, on lines 32 to 33. Now in Section 2 of this bill, on lines 41 to 44, tenured employers' contribution rates are also suppressed at the lower rate schedule until 2026. That difference between the standard 2.7% and the suppressed 2.64% is that 0.06%. Now at first, I thought that this might be a tax cut for employers, however upon further examination and speaking with other colleagues, it is not. That 0.06% is taken from the employer contribution rate that would otherwise go into the UITrust fund and is being used as an administrative assessment for the Department of Labor as you'll see throughout Section 3 from lines 52 to 73. Conversely, I think it is also important to note that that 0.06% administrative assessment is not a new tax on an employer. Employers still have to pay a 2.7% contribution rate to the Department of Labor. That 2.7% is just bifurcated under this bill with 2.64% going toward the UITrust fund and 0.06% going toward state operations. Now line 74 to 83 may clear that the 0.06% administrative assessment, while it will still be deposited in the unemployment compensation fund, shall expressly not be considered to be part of the unemployment compensation fund. The bill further states on line 79 to 83 that for the next three years, or until December 2026, our new labor commissioner will be authorized to transfer this administrative assessment to the state treasury payable upon requisition to the commissioner of labor. Please note, as legislators, we allow this administrative assessment and the suppression of employer contributions to the UITrust fund which began in 2017 to expire in 2022. Following the industry and labor committee where this bill was heard at least two times, because there's a House companion bill as well. The labor commissioner came and testified in support of this bill, saying that that 0.06% administrative assessment could raise an estimated 20 to 25 million dollars a year. Analysis of the state accounting office found that this administrative assessment generated a yearly average of 21 million from 2016 to 2022. Over a three year period of time, we are looking at 60 million to 75 million dollars that should have gone to the UITrust fund, but may now be used at the Department of Labor for operations upon their request. For some context, per the most recent fiscal year 2024 budget that I reviewed, that I know is still in conference committee as we speak, total funds for the Georgia Department of Labor is 51 million dollars for fiscal year 2024. The budget under Section 32.1 regarding the Department of Mental Administration is 20 million dollars, whereas a budget for unemployment insurance is 30 million dollars. So in effect, this administrative fee of 0.06%, 0.06% annually is doubling the entire administrative budget of the Department of Labor for the next three years. Again, during committee, the labor commissioner mentioned these funds would be used to get through a backlog of 50,000 to 60,000 of these delayed or unemployment cases that have not yet been addressed as a result of the pandemic, along with using these funds to address other challenges and issues that he had inherited. I do not question the sincerity or the intent to improve the Georgia Department of Labor, which I'm sure there's bipartisan support to ensure. However, I am concerned about the impact this bill will have on the UI Trust Fund and oppose the false choice this bill creates between ensuring the solvency of our UI Trust Fund amidst economic uncertainty and ensuring that the Labor Department has all the resources it needs to carry out its mission. According to the U.S. Department of Labor's 2023 State UI Trust Fund Solvency Report, as of January 2023, Georgia's UI Trust Fund balance was $1.38 billion. According to analysis of our trust fund, based on the size of Georgia's economy and the average amount of unemployment insurance benefits payouts during its worst recessions, the United States Department of Labor estimates that Georgia's trust fund balance has enough to supply unemployment insurance protections for nearly five months of the average high level recession. However, the U.S. Department of Labor recommends that the State Trust Fund balances cover at least one year of protections as determined by the U.S. Department of Labor. Again, according to analysis of this issue, Georgia's UI Trust Fund is the core of its broader unemployment insurance system. Trust Fund reserves support UI benefits, which the Georgia Department of Labor administers has served the three primary functions of its unemployment insurance system, preventing high levels of hardship by protecting the lost wages of unemployed workers, contributing contributing to workforce development pipelines by supporting dislocated workers as they train and prepare to fill new job vacancies. And lastly, sustaining consumer spending levels during downturns to spur economic recovery. The three year suppression of employer contributions to the UI Trust Fund would layer upon existing irresponsible UI financing practices. Georgia's UI system relies on various factors to make up its average employer contribution rate, which ranks below 34 other states. This is partially attributed to disproportionate UI Trust Fund contribution burdens placed on low wage paying employers. Georgia collects employer contributions from the first $9,500 a payroll placing it below every other state except for Tennessee and Florida. By favoring employers you can afford to pay higher wages, this also places unfair trust fund contribution burdens on small businesses. Furthermore, employers carry heavier burdens given that only 12 percent of the UI benefits charge out of the out of Georgia's UI Trust Fund are considered when calculating tenured employers trust fund contributions. Many Georgia's existing practices fail to adequately replenish trust fund payouts for UI benefits. In 2022, Georgia average employer contributions to Georgia's UI Trust Fund were 62 percent below what U.S. Department of Labor estimates to be enough to match annual UI benefit payment levels.\n\nTrust Fund levels also lack sufficient reserves to protect unemployed workers during an average recession. This inadequate trust fund investment has taken place despite overall 2022 state revenue from employer profits nearly doubling that of 2019. Whilst spared from debt and insolvency thanks to 1.6 billion federal pandemic relief funds, Georgia's current trust fund remains weak as demonstrated by the U.S. Department of Labor's solvency data. Its current lack of resiliency is also a product of poor post-grade recession financing practices. For eight out of ten years, between 2010 to 2019, our trust fund reserves averaged 14% below healthy levels needed to withstand the average pre-pandemic recession. This lack of trust fund investment occurred despite overall state revenue growth of 86% over that same period of time. Instead of pursuing U.I. financing policies that would increase average employer contribution rates to the trust fund in 2012, state lawmakers began reducing U.I. benefit access for Georgia workers which allowed inadequate contribution levels to catch up with reduced U.I. benefit payouts over time. This has resulted in a state U.I. system with a positive trust balance but one that is too weak to handle the average recession again. Combined with other restrictions, Georgia's U.I. trust fund leaves many Georgia workers particularly black workers and eligible for lost wage protections when they need them. This includes restrictions that have disproportionately barred unemployed black workers because of wage and employment eligibility restrictions. Black workers, I'm sorry, Georgia's maximum U.I. benefit duration of 14 weeks when the overall unemployment rate is 4.5% or less, systemically it excludes black workers who currently experience unemployment at 5.6%. And combined with the U.I. system that has yet to be modernized to respond to dislocated workers' needs, many Georgia's feel discouraged from even applying for U.I. protections from an agency that too often cannot respond timely to public needs. I'm going to skip ahead just because again I know I've probably been going on for a bit. Even though I know you all enjoy me talking about the unemployment insurance trust fund at 9 p.m. on a Monday. Simply put, this bill presents a false choice and is a reminder to all of us that elections matter. This is a bill that will risk the insolvency of our U.I. trust fund over the next three years by 60 to 75 million dollars as a mechanism to simply do what we should be doing to begin with, which is investing in our Department of Labor to help workforce development and to help unemployed workers get back on their feet. Lastly, I'll say, I agree with the understanding that workers and employers bear the fruit of a more stable economy when the solvency of the U.I. trust fund remains a priority. bolstering Georgia's trust fund during good economic times better prepares our state to persevere and more quickly recover from downturns, especially in this moment in time when we're facing so much economic uncertainty. As policymakers, we cannot use Georgia's strong economy to make changes that would suppress an underfun, this critical safety net when we do not see the immediate impact. This is a very important thing to do. As we have billions in our rainy day fund in preparation for declining revenues, so too should we invest in our unemployment insurance trust fund to support Georgia workers during a downturn. In doing so, not only can Georgia be the best state in which to do business, but hopefully the best state for workers. For all of these reasons, I respectfully urge members of this House to vote no to SB 60 and I yield the will. Thank you, Mr. Speaker. Gentlemen, as you yielded the well, the chair recognizes Chairman Warkeiser to speak for the bill. Thank you, Madam Chair. I know you are loving this riveting debate. So, this bill is something we do every other year. We do the sunset on the reassessment. We've basically been paying the same rate since 1987 and the borrow from our good friend, Spencer Fry, the sky is not falling. It baffles me the answer to this because one party wants you to believe that the rate is not high enough so vote against the bill. Okay, let that sink in. The rate is not high enough. We're not going to collect enough money at this rate so vote no against the bill. Let's say they're successful at that. Then we'll collect zero. So, I don't think that's a very good solution. If, you know, I wasn't really prepared to talk about this, I didn't know it's going to be such a battle, but just wanted to discuss some of these things. I've been a business owner for close to 40 years and fortunately don't have W2 employees anymore so all that. So, I do know for years and years I would get notices from the Department of Labor saying, congratulations, you have a three month, six month, eight month stay on pain because we're doing so well in collecting monies. I've never in my nearly 40 years gotten a notice from the Department of Labor that said, oops, we're not collecting enough. We need to collect more. But I have many times over the years got notices that said, hey, we're good. We got enough money. We don't need to collect. It's been brought up that depending on what you talk to, we've got a four month, four or five month in solvency rate, stereonatus. Well guess what? We just had a pandemic. We went through a lot of money. We've got over a billion dollars in that fund right now and to sum of that may seem like a lot of money and it's not if we were about to enter another pandemic, it would not be enough money. And one of the solutions was said, let's send this back to committee. Let's get a higher rate. Well, I got news for you. We're not meeting tomorrow. So why don't we do this? Why don't we pass it at this rate, the rate that we've been paying within 0.002 for the last since 1987, some of y'all weren't even born then. This is basically the rate that this state has survived on since 1987. So why don't we do this since we just came through a pandemic. Let's vote this, see how we're doing 12 months from now and if we missed a mark, let's raise it. But the only reason we're even having this discussion is the Senate and their infinite wisdom did not take this up last year when usually agency bills don't get overlooked. But I'm not going to belabor this at a lot of the other points. I'm just saying, let's pass this out. The sky's not falling. If we need to look at a different rate, let's do that next year. Thank you. The gentleman has yielded the well. Is there an objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine. On the past of the bill, the a's were 97, the a's were 68. The bill having received the requisite constitutional majority is therefore passed. Clerk read the caption to Senate bill 68. Senate bill 68. Senate bill 68 by Senator Williams, the 25th and others to be in total. Now to amend code section 16, 14, 3. The official code of Georgia and attendee were laying definitions regarding racketeer, influenced and corrupt organizations. This bill I would prefer the committee on judiciary, non-civilic committee recommends that this bill do pass. Chair recognizes representative Vance to present the bill. Thank you, Madam Chairman. Senate bill applies the racketeering statute to those who use animal cruelty for entertainment and profit. Currently gangs are using dog fighting to raise money for their criminal organizations. For example, in the last 12 months, a dog fighting arrest and Cherokee County resulted in the seizure for safekeeping of over 100 dogs. Similar case in Pollard County resulted in the seizure of 25 dogs. Fellow representatives, I implore you to favorably vote for this bill to give law enforcement and prosecutors. Another tool to prosecute this most abhorrent activity. I'll be glad to take any questions. If not, Madam Chairman, I'll yield the well and thank you. Chairman has one question. The chair recognizes representative Wilkerson for a question. Thank you, Madam Speaker. To your left. Does the gentleman yield? Yes, sir. I guess in plain English, what would this exactly do? How would it lock up? Because I remember a couple of years ago we had an athlete that was dog fighting, I guess. And he went to jail for a long time, so I'm trying to think what this is going to do. Okay, sir, the racketeering statute has to do with you, if you are caught doing this activity, much like drug dealers. If you're caught doing this activity at least two times, you can be charged under the racketeering statute. And those profits derived thereof or therefrom can be seized. Chair recognizes representative Williams for a question. To your far left. Thank you, Madam Speaker. So my question is which LC number are we working off of? Because the one I've got refers to motor vehicle parts. The one we are working off of, ma'am, is LC 393721S. Perit the C's SCS. Well, it. So it starts out by talking about dog fighting, but then it says adding a new division to read as follows, possession of motor vehicle parts. From which identification has been removed. And then it talks about, okay, is are the offenses enumerated in code section 161237, the dog fighting ones? Correct. Okay, thank you. Madam Chairman, I yield the will. Chairman has yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote. Yes, all those opposed will vote no and the clerk will unlock the machine. Have all members voted? All members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas were 163 of the nays were four. The bill having received the requisite constitutional majority is therefore passed. The clerk read the caption to Senate Bill 20. Senate Bill 20. Senate Bill 20 by Senator Karpatric of the 30 second and others to be entitled to amend chapter 20 e. In title 33, the official go to Georgia annotated the surprise bill and consumer protection act says to ensure consumer access to quality health care by setting adequate. Added with the standards for network plans offered by an insurer. This bill I refer to the committee on insurance that committee recommends that this bill do pass. Chair recognizes representative Hawkins to present the bill. Thank you Madam Speaker. You'll notice that this bill is titled the surprise billing consumer protection act. It's really not that, but it is that sort of. Years ago, we dealt with a number of issues on protecting the patients of Georgia. One of those issues was adequate networks. In other words, enough docs in that network to actually treat patients. So patients had access to care. So that's how this title came about. This was really brought to us by the insurance commission's office at that time. And so this bill addresses that. It gives the insurance commissioner much more of a hand in ensuring that these network works are adequately filled with physicians. It's a good bill. It's going to provide access to care for Georgia. There's no questions. I will yield the well. There are no questions. The gentleman has yielded the well. Is there an objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. The clerk will be given the right to vote no. The clerk will be given the right to vote no. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The a's were 166. The a's were two. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 155. Senate Bill 155. Senate Bill 155 by Senator Kropatric of the 32nd to be entitled an active men part one of Article 4, Chapter 11 of Title 16. The fiscal to Georgia annotated relaying the general provisions relative to dangerous instrumentalities and practices. So as revised provisions relating to harming a law enforcement animal. This bill ever referred to the Committee on Public Safety and Homeland Security. That committee recommends this bill do pass by Committee substitute. Chair recognizes representative Washburn to present the bill. Thank you, Madam Speaker, ladies and gentlemen, the House. I'm surprised to present Senate Bill 155, the author of that bill, the Senator Kropatric. Georgia has a long history of protecting public safety animals dating back to 1983. This section of law was amended in 2015 with the passage of Tonya's law, arising out of the death of a K9 Tonya in Walker County who was shot and killed in the line of duty. This bill Senate Bill 155 is called Fiko's Law in honor of a Georgia State Patrol dog shot and killed last fall in San Disprings while pursuing a homicide suspect. Since 2015, K9 frontends have been used more and more in the area of protecting us and in law enforcement. The intent of the previous law was good, but by creating four different levels of harm, there's been a lot of confusion between two of the sections of the bill, my judges and jury. So this bill does three things. It simplifies the definition of a public safety animal and a search and rescue animal. It simplifies the offenses to eliminate the ambiguity in the current law. In a fearing with a public safety or search and rescue animal is a misdemeanor. Harming a public safety or search and rescue animal is a high and aggravated misdemeanor. And aggravating a harming a public safety or search and rescue animal so that the animal is killed is a felony punishable by two to ten years of imprisonment, which can be changed with an agreement between the prosecution and the defense. It also requires restitution, including vet bills, retraining or replacement of these injured animals. And it should be noted that it costs $20,000 to train one of these animals. The prosecuting attorney's counsel is in support of the bill. It makes the law protecting these important team members simpler and easier to minister in the court system. I would like to answer any questions about this bill. Of course, all animals, these animals should be protected anyway. But the fact that they do what they do to protect us is important. And this is a good bill. I will answer any questions. There are no questions. Thank you, a matter of speaker. I ask your favorable consideration of this bill. The gentleman is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. Have all members voted. If so, the clerk will lock the machine. On the passage of the bill, the a's were 168, the a's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 217. Senate Bill 217. The bill 217 by Senator Albers of the 56 to be entitled to amend chapter 2, the total 40, the fiscal code of Georgia, and Tate relaying the registration licensing of motor vehicles. So it's required for the offensive operation of a motor vehicle with a fraudulent license plate. This bill I'm referring to the committee on motor vehicles. That committee recommends that this bill do pass by rules committee substitute. Chair recognizes representative Collins to present the bill. Thank you, Madam Speaker. I bring to you today Senate bill 217. Senate bill 217 is a combination bill of Senate bill 348 or should house bill 348 and house bill 301 that this body passed earlier in the session. House bill 348 and 301 made it over to the Senate. They rolled them into one bill. And for some reason, that bill didn't get put on the rules consideration calendar on Thursday. So we took Senate bill 217 and put some language in here. This deals with the school speeding cameras and the issues that we have ongoing issues that we've had dealing with this problem. The genesis of the reason why I was trying to do some legislation when someone was issued a civil monetary penalty for speeding in a school zone by a camera and the fine was not paid. The new owner of the vehicle at the vehicle was traded. The new owner was having to clean up the title and get the release done on the title before they could take possession of that vehicle. So there was a real flaw in the legislation. What this bill does is it releases that upon the trading end of a vehicle. Also, we wanted to make sure and limit the time ladies and gentlemen, when these schools, traffic cameras could be used. We made the Senate made a few changes and we've changed that back to 30 minutes before school and 30 minutes after the Tarty Bell 30 minutes before school dismisses and 30 minutes after. We also took some language from represented Ridley's bill that also lumped this into the 35% rule that the municipality local government, whether that be county or city, cannot have more than 35% of their revenue coming from these. Traffic cams also in the bill, we put in some language that the department of public safety will investigate if there's any wrongdoing or malfeasance of using these cameras. We kept the fees and fines associated with this is $75 for the first violation $125 for the second one and we kept the $25 process and fee. So one of these companies cannot charge an exorbitant amount of money when those penalties are issued. Madam Speaker, that is the bill. I'll stand for any questions that you may have other than that I'll yield a will. Well, there are a few. Chair recognizes representative Fleming to your in front of you for a question. Thank you, Madam Speaker. Just Jim and the will. I apologize for the conversation I tried to have with you before you got down there, got interrupted because they called the bill. The section that I was trying to talk to you about is on page five of the bill starting online 97 where it reads upon the conclusion of investigation conducted to present the subsection of any code section, the governing body of a county municipality found to have violated any provision of this chapter relating to automated traffic enforcement safety devices. And then you skip on down to line one on one shall be subject to the withholding of state funding. Yes, shall shall be subject. Yes, sir. Now what you and I were discussing is I can't maybe put this fully in the context with the rest of the bill. But on line 98 where it says violates any provision. That means the investigation that was had found that as I mentioned to you, maybe you did 99 things right, but you did one wrong. You send the ticket to the wrong person. You technically have violated any provision of this code section and isn't the penalty for that. So on line 101 shall be subject to the holding of state funding. And doesn't that mean any kind of state funding, whether it be L. M. Egg road paving, water sewer, DC a grants. That's what I was trying to discern. And councilor, I appreciate your your perspective on that. This investigation would be conducted by the commissioner of the Department of Public Safety. We we put that language in there and it's very easy. You can see before you in the bill, very black and white, what you can and cannot do when you're using these cameras. And it's very clear. It's not it's not ambiguous. The guidelines in place to operate these cameras and use this program is very simple or simple. Councilor in my opinion. And I would I would just submit to you that if a local government doesn't want to be subjected to the withholding of state funds, just obey the law. It's very simple. And and furthermore, I would also submit to you that we put that language in there because we have some rogue cities in this state right now who have put up these cameras. And they're not they're not using them to check the speed and schools on. They're using them for other using these for other purposes. And this is going to send a clear message that we're not going to tolerate that if it's against code and against the law in Georgia and you're in municipality and you break that law. You're going to be punished for that. But again, the investigation would be conducted by the commissioner of the Department of Public Safety and I value his opinion and I understand that not only is he a certified and well respected law professional. He has a lot of walking around since too. Thanks, sir. Chair recognizes representative Williams for a question. Do you think I'm speaker? Isn't not true that section that represent Fleming was referring to does give me some pause. But from the big picture. Isn't that also true that because of advancements and technology, this could be the biggest rip off speeding trap since the 60s is in the city. The 60s in Georgia because it is abusive to and three o'clock in the day tickets are being written. And this is just an iPad speed and trap. It's a rip off. We need to spank it. Give it a pacifier and put it to bed. To my friend from South Georgia where the water tastes like cherry wine, you are exactly correct, my friend. Madam Speaker, the hour is getting late. The bill speaks for itself. Let's do the right thing. Ladies and gentlemen, give a green light to House Senate bill 217 and I yield the will. Chair recognizes representative annulo wets to speak to the bell. Thank you, Madam Speaker.\n\nI'll be brief if my question had been taken, we probably could have spared us all this, but I also rise today to speak against this bill because I think we're all in agreement that we don't think these cameras should be revenue generators. The purpose and intent of these is to save lives, right? It's to save the lives of the children and these speed zones. And I think we all agree that we need guardrails on that so that no rogue cities, no rogue counties are abusing this, but my concern again is with these lines 97 to 102. And I think it should give everyone in this room pause because this isn't just directed at rogue cities. This is directed at anybody who might get one of those hundred things incorrect. And that is very, very deeply concerning. Shall be subject to the withholding of state funding. That's really broad. It's really punitive. And again, I just think that everyone should have some pause about hitting the yes vote button for this bill, which I think we all agree. We want guardrails on these cameras, but I don't think what we want is any city making any kind of a mistake and having all of their state funding withheld from that city or that county. I yield the well. Chair recognizes representative Fleming to speak to the bill. Thank you, Madam Speaker. I attempted to make the point I wanted to make and asking questions, but that was a little hard, so I'll just come down here and point it out to you. The parting question that we're discussing is I mentioned his own page, line 97 of the bill, through line 102. It says there that it refers to a previous investigation. And it doesn't say that if you're found to be woefully inadequate or running a speed trap, it says that if you have violated any provision of this code session, and as I tried to ask him my question, that means is that if you got investigated for doing something you shouldn't do, and they've investigated 10 things, and they found that you got too wrong but eight right, you have technically violated any provision of this code section. And then you go down to line 101 and it says, shall be subject to the withholding of state funds. It doesn't say maybe subject. It says shall be subject. Now what are state funds? Well, state funds is pretty much anything you and I appropriate from this area, or we appropriate to the Department of Community Affairs. That means you're ill, big money. That's your road paving money for your cities and your counties. That is your DCA grants, water, sewer, sidewalks, playgrounds, trails, greenways, solid waste problems, you name it. And it says state funding, and I don't know how this affects city school systems. I don't have one in my district. Is that a part of the municipality? I don't know if so. I would ask questions if I had a city school system if I was you. The point is that it will, and also it probably affects the grants we give to offset the timber conservation that we do in parts of Georgia. That is a state grant. That is state funding. So I understand, surely, just like there have always been speed traps, there are surely some cities and counties in this state which are misusing these cameras. I don't doubt that. My question is, is how many are not misusing them? Or if they are, they make mistakes sometimes, but they're not the problem that we're worried about. If you don't like speed, these cameras vote yes on this because in all practical purposes, I think you're going to dare any city or county to continue to use them because of the penalties are so harsh as I've mentioned. That's a fair vote. Just vote no to eliminate them. But if your cities and counties, like many of mine, have invested millions of dollars in these cameras, then you might want to consider not voting yes on this because I think you're telling them the way this is word is so broadly in this one session, just go ahead and take them down because it's not worth all those other funds that you're jeopardizing. I think it's just a question that we're going to have and we're not going to have them. And that's what it appears to me that this comes down to. And if you're against a minor stand because I guarantee you there, just like the speed traps used to exist and days gone by, there are some places out there that probably misuse them. What I would prefer to or should do is to have a bill that tries to affect those places, not everybody else like I fear that this does. I appreciate the intentions of the gentleman trying to clean some of these things up. My concern is it goes much further by that language than we thought it might. Thank you, Madam Speaker, I y'all the well. Gentlemen, has you yielded the well? The chair recognizes representative Ridley to speak for the bell. Thank you, Madam Speaker. Ladies and gentlemen, we both, we all voted on this bill. It passed out this house. Both bills did with absolutely no votes. Now, what they've done is coming here and put this in and what my friend was just up here talking about is this gotta be somebody that's doing something wrong. This is a two phase, two tier system. When the camera catches this, catches you violating that law running too fast in that zone. There's a police officer that's supposed to be at your city or county police department that's supposed to look over everything, one of those and okay them. So you got two different people to say, and yes, you were speeding. You got another person at your local police department that's saying that you're speeding. So how can you violate the law unless you do it intentionally? And that's what we've had. We've had counties and cities out here doing this intentionally. There's nobody in here I don't think that has not come up to Mayor or Chairman Collins wanted to and told us stories about this. And that's what this does. And I'm not attorney, but my friend's up here saying, well what does these fees or the money that it's gonna take away, it could do this, it could do that. It could do, that's not what it does. And I'm not a counselor, but I think that's a leading witness. But this bill, all that does is say this, if you do it wrong, yes, we're gonna kick you in the butt. If you do it right, you ain't gonna have no problem. And I wanna thank my friend, Al Williams, for telling the truth. The all this is, there's a money racket and everybody knows it. And Madam Chairman, I will yield the well. Thank you all for your all-spavor consideration on this. The gentleman is yielded the well. The chair recognizes what brochettes speak to the bill. Thank you, Madam Pro Tem. So I'm gonna come in here and just not entirely rebut what my colleagues have said, but just give you some clarity from my perspective here as a county attorney. This provision is not unprecedented. Currently, if your county or your city does not turn in their yearly audit, all state funds are withheld. They're withheld until your audit is turned in. And I know that and don't ask me how I know that because it's an uncomfortable position to be in. Secondly, the way I read this language here is shall be subject to withholding of state funding. It doesn't say shall withhold state funding. So it's not automatic, it's permissive. Shall be subject to state withholding of state funding means that we could withhold it or we couldn't withhold it. To me, it doesn't say shall withhold state funding. And that's the only thing I wanted to come in here and clear up. I think it's permissive. I don't think it's required. I do share the sentiment with many of my colleagues and many of you and probably many of your spouses. I just had a colleague today tell me that they were, their spouse received a ticket from these cameras. I think it's important that we put parameters on these cameras. These cameras a lot of times are, there is no discretion. That's a word we use up here a lot. There's no discretion with these cameras. All of a sudden you get a ticket from South Dakota, tickets for 125 bucks and the fee from South Dakota is 125 bucks. And I think that's not fair just. I don't think that was the intent of this legislation, but it's my opinion that this language here is permissive versus required. And that's all I have, I don't speak for you. The gentleman is yielded the well. Is there any objection to the previous question being ordered the chair here is none of the previous question is ordered. Is there any objection to adopting the committee? The substitute offered by the committee on rules, the chair here is none of the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none of the report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. For what purpose does representative Anulowicz rise? Thank you, Parliamentary inquiry. State your inquiry. Is it not true that this is not in any way the same bill that has previously passed the House because no bill that previously passed the House included the lines that are in 97 through 102? Sure the lady so believes that to be true. For what purpose does representative Holly rise? Probably many agree. State your inquiry. Is it not true, Adam? Speaker wrote to him that the fact that like my colleague, who just spoke said, not only is the language new, but that this risks actually overriding the authority of a school superintendent to be able to put speeding cameras in their school zones. Should the gentleman so believes that to be true for what purpose does representative Ridley rise? Parliamentary inquiry. State your inquiry. Is it not true that this does not override the school superintendent's ability to have to sign off on these to be put in? And also, is it not further true? Well, I forgot my other question. The gentleman asked a pretty good first question. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 110. The A's were 59. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate bill 246? Senate bill 246 by Senator Hodges, the third and others to be entitled back to a men chapter 10 of Title 49 of the EFISCO to Georgia and Attended relating the Georgia Board of Healthcare Workforce. So it's required for student loan repayment for certain nursing faculty. This bill I refer to the committee on higher education that committee recommends that this bill do pass by committee substitute. The gentleman from the 15th House District Representative Gamble is recognized to present the bill. Well, thank you, Mr. Speaker. Colleagues, I rise today to present to you Senate bill 246, which is the Governor Kimps Administrative Initiative. This gives the Georgia Board of Healthcare Workforce the authority to establish and administer a student loan repayment program for licensed nurses who choose to teach as a faculty member at a nurse education program. Nurse faculty members of the University System of Georgia and the Technical College System of Georgia institutions would be eligible to participate in the program for up to five years with the goal of incentivizing more nurses to teach and train the nurses of tomorrow. Funding for this program is currently included in the budget and would be subject to annual appropriations moving forward. The Board of Healthcare Workforce will set up rules and regulations to govern the program similar to how they currently administer their five existing loan repayment programs for other licensed healthcare professionals. This chamber is familiar with the ongoing workforce challenges in healthcare and one provider group where these challenges are particularly acute in our states is our state's nursing workforce. One facet of this issue is a lack of adequate nurse educators to train the number of nurses to meet Georgia's needs. Nurses make a better living practicing in the clinical setting when compared to the classroom. This bill aims to make teaching a more attractive option to a greater number of nurses and insures that we're training the nursing workforce today for the challenges tomorrow. I would ask for your support on this legislation. I also want to mention that we added the language from House Bill 185 into Senate Bill 246. You are familiar with that legislation because it is dealing with the inclusive post-secondary education program. Ipsy and it has already passed our chamber 165 to zero on March the 1st. It will allow students with intellectual disabilities the opportunity to attend Georgia colleges. And it also is a program that focuses on transitioning these individuals, these students from the classroom to the workplace. Mr. Speaker, this is the bill Senate Bill 246 and I'm happy to answer any questions. You do have a question, Representative Hagen, do you have a right out front? Has a question, the lady is recognized. Thank you, Mr. Speaker. Did you yield? I yield. Thank you. I just want to clarify, is this only for USG and TCSG schools, not our private colleges? That is correct. Okay, thank you. With that, Mr. Speaker, I would ask for this body's favorable consideration on Senate Bill 246. And I yield well. The gentleman has yielded the well. Is there any objection to the previous question in order, the chair here's done the previous question has ordered, is there any objection to withdrawing the Committee substitute? The Chair here's done the committee substitute, is withdrawn, is there any objection to adopting the substitute offered by the committee on rules? The chair here's done the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill, the Chair here's done the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so, the clerk will lock the machine on the passage of the bill. The yeas were 167. The nays were three. The bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 121-121? Senate Bill 121 by Senator Anderson in the 24th be entitled to amend chapter 68, title 36 of the Efficient Quoted George annotated relating to general provisions of applicable counties and municipal corporations. So, to prohibit local governments from denying the drilling servicing and repairing of newer existing water wells on single-family residential and farm properties. This bill I refer to the Committee on Natural Resources and Environment that Committee recommends a disbilled do pass by Committee substitute. Chair Lady Camp has recognized to present the bill. Thank you, Mr. Speaker. The committee will. Thank you, members. proceed. Thank you, Mr. Speaker. SB 121 is basically exactly what was just read in the caption. It says that counties and municipalities cannot prohibit individuals who have an acre of more from drilling or servicing or repairing a well on their property. Of course, this is for drinking water but it's also for geothermal which many people are using now to heat and cool their homes. So, Mr. Speaker, that's the crux of the bill. I'm open for any questions. Lady has no questions. Thank you, Mr. Speaker, as for favourable consideration. Is there any objection to the previous question being in order that Chair is none? The previous question is ordered. Is there any objection to adopting the Committee's substitute? The Chair has none. The Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favourable to the passage of the bill? The Chair has none. The report of the Committee is agreed to. Shall this bill now pass all in favour of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. The clerk will unlock the machine on the passage of the bill. The yeas were 171, the nay zero. The bill having received the requisite constitutional majority is therefore passed. Chairman Meeks is recognized for a motion. Thank you, Mr. Speaker. If the gentleman will, set back just for a moment. Members, we're going to take up some further actions at this time on bills that are transitioning back and forth here, moving back and forth so pay attention to the folks in the bill. The bill will as they present their motion. Chairman Meeks is recognized for a motion. Thank you, Mr. Speaker. I move to disagree with the Senate's substitute to House Bill 189. Mr. Clerk, will you read the caption? House Bill 189 by Representative Meeks, 178th and others to be entitled to amend Article 2, Chapter 6, in Title 32, with the official code of Georgia and Tadda relating the dimensions and weights of vehicles and loads. Chairman Meeks is recognized to explain the Senate's substitute. Thank you, Mr. Chairman. As we know, we passed House Bill 189 on truck weights out of this body. We're still working on agreement and I look forward to do that in the conference committee. Mr. Speaker, I yield to you all. All the gentleman's motion that the House disagreed to the Senate's substitute is there any objection here and none? The House has disagreed to the Senate's substitute. Disagreed to the Senate's substitute to House Bill 189. Representative Thomas has recognized for a motion. Thank you, Mr. Speaker. I move the House agreed to Senate amendment to House Bill 52 as amended by the House. Mr. Clerk, will you read the caption? House Bill 52 by Representative Thomas, the 21st and others to be entitled to amend Title 32 of the official code of Georgia and Tadda relating the highways, bridges and ferries so as to amend notice provisions relative to meetings for the election of board members. Chair recognizes Representative Thomas to explain the Senate amendment, amendments and the House amendments. Thank you, Mr. Speaker. This amendment includes some improvements to transportation throughout the state of Georgia. Section 1 makes a notification method for G.Dot Board of Elections via email versus regular mail. Section 2, 3, 4 and 5 establishes Georgia freight logistics implement implementation plan. Something that's been worked on for over three years in the Transportation Committee. Section 6 increases the limit on transportation quick response projects from 200,000 to 400,000 to cover the increase in inflation. Section 7 moves public-private partnership language to clarify that public hearings for P3 should occur during the environmental phase when they can still result in changes to the project design. Section 8 is an alternative contracting method also known as a GCCM method that allows for a waiver one project for one fiscal year and amount greater than 5% of the department's capital budget. Section 9 establishes the Georgia freight 2020 plan. It requires G.Dot to conduct and maintain a comprehensive freight and logistics implementation plan with annual reporting back to the General Assembly. It also establishes as a Georgia freight 2050 program as framework for future appropriations to fund the freight logistics plan. Section 10 extends links to modular homes from 80 feet to 84 feet. Section 11 permits county medical examiners to delegate their duties on site to qualified medical personnel. The event of fatality on limited access roads or highways. Section 12 sets the framework stating that freight logistics projects are subject to appropriations. And finally, section 13 protects Georgia's privacy by requiring that no person's identifiable information or vehicle information can be provided via FOIA requests. And that's all the amendment, Mr. Speaker. Gentlemen, would you answer a couple of questions? You have a couple of questions. I do you. The minority leader right to your left representative Beverly has a question. The gentleman's recognized. Thank you Mr. Speaker, the gentleman you. I just have a question. I have a couple of questions for you. Section 4, a specifically line 85 through 87, we're referred to catalytic investments. Just a clarifying question about that. And then also, germane to that question will be line 121, one technology deployments. My question is this, can those catalytic investments be used to sort of build out blockchain or AI infrastructure to help for supporting economic development and improve mobility of goods? And so with that, from a technology standpoint, would you be able to use catalytic, catalytic investments to help prop up sort of a pilot program to blockchain and AI to do help deal with this problem? I would say that the gentleman probably knows what he speaks. Gentlemen, you for another question. I do. To your left representative Jasmine Clark has a question over to your left. Yet, ladies recognized. Thank you, Mr. Speaker, just a gentleman you. I do. What LC number are you reading from? AM-390381. It was on your desk about two hours ago. Does the lady see it? No, I do not. It's not in our folders. And I don't recall this one, right? Big folder. Yes, I have LC-39359's, Euro in my folder. It's not in the folder. It was dropped on your desk right after we came back from dinner. Maybe they skipped my row. I don't have one. Thank you, Representative Fleming. Thank you. Are there some of you who do not have a copy of AM-390381? We need one right in the back in the middle. Representative Draper, do you have one or do you need one? Could we get a copy to Representative Draper? I'm going to recognize, do you have a question, with Park? Yes, with Park has recognized for a question. Thank you, Mr. Speaker. So just to clarify, especially for some of the freshmen members, where we are with this amendment. This amendment that was put on all of our desks, maybe minus a few members, would amend the Senate, I'm sorry, House Bill 52, which the Senate amended and passed by a vote of 53 to 1. Is that correct? That's correct. Does the gentleman further you out for an additional question? I do. For the House amendment to the Senate amendment for Senate for House Bill 52, is this language that we previously passed? Yes, this is in the freight program. The freight logistics piece of this language has been passed on a previous piece of legislation. Thank you. So this is essentially legislation that's been reviewed by this body at least multiple times and which we're just agreeing to include in this bill as we proceed. Is that not true? The whip is correct, yes. Thank you. Thank you, Mr. Wip. You do have one more question and I think you might want to take this one. I can shed a lot of light on this subject. Chairman Jasper's to your right is recognize for a question. It's Jill Maniel. I do. First, I want to thank you for your steadfast work on this amendment. It's taken a lot of time. It's been worked on since last year. And is it not true that we look in line 83 and 85, we're talking about foundational investments and catalytic investments. We're talking foundational is not true, meaning that that's what we're doing today to make sure we maintain our road system. And catalytic in 85 are innovative things like truck only lanes, toll roads throughout our state, their public private partnerships, using private equity or other means of funding. I would agree with the chair. And is it not true by my yield? You'll just continue further yield. You know, and one you see on here is House Bill 617. That is the Freight logistics implementation plan. That was vetted by the House Committee and we didn't get it through on crossover day. So we're adding it here. Thank you. With that, Mr. Speaker, if there's no further questions, I'll yield the well. You have no further questions. But thank you and I yield the well. Is there any objection to the adoption of the House amendment? Chair here's known and the House amendment is adopted.\n\nLet's move on. Chairman Green is recognized for a motion. Thank you, Mr. Speaker. Well, if the gentleman was, I think I forgot something. Maybe most important part. So here's our poster. We're going to vote on the Senate, agreed to the Senate amendment as amended by the House. All those in favor of HB 52 to agree to the Senate amendment as amended by the House will vote green. Correct. Those opposed will vote no and the clerk will unlock the machine. I have all members voted. If so, the clerk will lock the machine on the final passage of HB 52. The yeas are 170, the nays are 1. This bill will have not received the requisite constitutional majority as therefore adopted. This House, Chairman Gerald Green, is recognized for a motion. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I move that the House agreed to the Senate amendment as amended by the House. Clerk will read the caption. House Bill No. 77 by reps and of green to the 154th and others to be entitled to amend code section 1562. The fiscal to Georgia and it's had a related number of judges of the spirit courts. Chairman Green is recognized to explain the amendment and the House amendment. Would you give us the LC number that you're working from so make sure everyone's on the on the proper page. Thank you, Mr. Speaker. We're working from AM 490119 and it's on your desk and has been on your desk for quite some time since this morning. House Bill 77 passed out of the House some time ago as I explained which deals with adding a 4th judge to the Dirty Judicial Circuit. And the reason that the change is set here is because we have some time in issues that have to do with the appropriation bill. And this this works it out for us in the amendment here. And I ask your favorable consideration to agree to the Senate amendment as amended by the House. Mr. Speaker, are you the well? Is there an objection to the adoption of the House amendment that Chair here's done and the House amendment is adopted? On the gentleman's motion that the House agreed to the Senate amendment to HB 77 as amended by the House. All those in favor of vote? Yes, those opposed will vote no and the clerk will unlock the machine. Have all members voted? All members voted. If so, the clerk will lock the machine on the gentleman's motion. The yeas are 170 and the nays are zero. And the House has agreed to the Senate amendment to HB 77 as amended by the House. Representative Anderson is recognized for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate amendment to House Bill 193 as amended by the House. Clerk will read the captions. House Bill 193 by the House. Senator Anderson, the 10th and others being titled an act to amend Article 2, Chapter 91, in Title 36 of the Fish Go to Georgia Annotedra, relating to public works contracting and bidding requirements, so to increase the dollar values of certain public work construction contracts. Representative Anderson is recognized to explain the amendments and the House amendment. Thank you, Mr. Speaker. House Bill 193 raised the public works purchasing threshold. Would the gentleman give us the correct? Yes, I'll see a number of please. The amendment that the House is proposing is AM430246. There was an amendment placed in the folder that we have replaced. We have drawn that and replaced it with the one I just read. The original amendment was AM430239. We are working from AM430246. Thank you. Proceed. Yes, sir. The Senate amended House Bill 193 to include a provision that would allow Marta or Rapid Transit Authorities, which Marta is the one that we recognize and have in the state. Now, to utilize contracts and the amendment up to $250,000 without bidding, the amendment stated that it would be for the state of Georgia, federal government and local counties and municipalities. The intent of the amendment was mainly to be able to utilize municipal contracts. So, to avoid a potential conflict, we have gone in and stricken the words state of Georgia and federal government. That's the amendment. Mr. Speaker, I'll... You do have some questions, gentlemen. Yes, sir. I'll you. To your left, Representative Becky Evans has a question. Excuse me. I haven't found my copy yet. Excuse me. We'll find your copy. I'll wait for the meeting. Thank you. Excuse me. Thank you. Okay. Representative Bruce to your left and the back is recognized for a question. Well, gentlemen, you... Yes, sir. I just want to make sure I heard you clear. You were saying that contracts up to $250,000 would not have to go through any kind of bidding process. Is that what you say? Up to $250,000 then under the amendment, the Senate placed on the bill, then Marduk could participate with municipal contracts that had already been vetted through the municipality. Okay. So, will it... In the further year? Yes, sir. Well, how will those contracts be awarded? Will it be the basis of rewarding those contracts? That would be at the discretion of the Marduk authority and their policies and procedures. And the municipality. And there's a lot of money to be able to just give away. All right. Thank you. Representative Evans, did you get a copy? Representative, you got a copy. Okay. Gentlemen, you yield for a couple more? Yes, sir. A couple more. Just to make sure we've explained it correctly. Representative Chairman Martin, do you write? It has a question. On the Senate amendment. So, as I understand, your original amendment, the cities could go up to $250,000 without a formal bid process. On public works projects. Certainly, yes. I mean, the stats are limited. And under the Senate amendment, they could do the same thing. Would this be like a state contract for like LARP? Is something similar when the state bids out a pretend price on asphalt and they award that bid, then cities can glean onto that. My question here is, should they do this and the aggregate total? Does the aggregate total have to stay under $250,000? Or is it $250,000 for the city and it could be $250,000 for Marga in multiple projects? That's a good question. And each project has to be taken on its own. The project can't be split to come in under that $1 threshold. If it's considered a single project, all components of that have to be aggregated. So, under this contract, under this amendment, then the Marga, who we're talking about here, we're talking about somebody that fits that description. But we were going to refer to him as Marga because that's who it is. They would just be able to do their contract and it would have to be under $250,000 as well. So, they couldn't use the same pricing structure to do a larger contract just because the municipality got that pricing structure at $250. That is correct. Thank you. Since you all sit so close together, I wish you'd explain to that him earlier today. Because I think you sit right away by him, don't you? That's correct. Yeah, I thought so. Mr. Chairman, we're part right in front of you to your left as recognized for a question. Thank you, Mr. Speaker. I think some of the confusion may be that the most recent version of this amendment isn't available on the legislative website. But in looking at Golddon Viewer, and I think I did pull up the amendment, it does state... We're talking about any rapid transit authority and by this House amendment which deletes the state of Georgia and the federal government, any rapid transit authority would still have to have competitive bidding for the federal government or the state of Georgia, but not competitive bidding for any county or city. Is that not true? Up to the $250,000 threshold. Yes, sir. Thank you. Mr. Lee, you have a question. Mr. Speaker, if there's no more questions, I'll yield the well and ask for your favor. You have a question, but as your privilege to yield the well, if you so decide to. I will yield the well, sir. Gentlemen, as yielded the well, is there any objection to the adoption of the House amendment? Chair here's doing and the House amendment is adopted. On the gentleman's motion that the House agreed to the Senate amendment to HB193 as amended by the House, all those in favor will vote yes, those opposed will vote no, and the clerk will unlock the machine. Have all members voted if so, the clerk will lock the machine on the gentleman's motion. The yeas are at $157, the nays are 10, and the House has agreed to the Senate amendment to House Bill 123 as amended by the House. Chairman DeLouc is recognized for a motion. Mr. Speaker, I move that the House agreed to the Senate substitute to House Bill 273 as amended by the House. Mr. Clerk, will you read the captions? House Bill 273, members, I would have the load to the 167 of the B. Todd on act 2, men on Article 1 and Chapter 2, a title 12 of the Fissure Court of Georgia and Attentive relating the general provisions relative to the Department of Natural Resources. So to extend the date by which rules and regulations prescribed by the Board of Natural Resources, must be in effect for the purposes of establishing criminal violations of said rules and regulations. Chairman DeLos is recognized to explain the Senate's substitute and the House amendment. Thank you Mr. Speaker. House Bill 273 was a Department Bill it dealt with membership of the Sapporo Island Heritage Authority. It added one one member to the community of Hogham. Those folks on Hogham requested that language be added to the bill that would require those members from Hogham to not only be residents but also be descendants of the slaveholder Thomas Spalding. We thought that was very good language. The other thing the Senate did in their substitute. Our bill said that the governor would be able to designate a member to serve in his place. The Senate added language that restricted the governor's ability to name anyone he wanted to to serve in his place and we're simply removing that language in this House amendment. That amendment by the way I didn't give you the LC number. It's AM 4 4 0 1 7 8 it was wanted to very first place on your desk this morning. Gentlemen Yeal you have a couple of questions. I'd be happy to explain your amendment. Let's try. Representative Williams to your left has a question I'm sure it's a good one. Thank you Mr. Speaker. Gentlemen Yeal. Yes I will to my long time friend. Is it not true that Hogham is one of the few remaining purely Galagiti communities on the East and Cold Seaboard. It is absolutely and that's one reason we all recognize the importance to maintain that and preserve that culture as long as we possibly can. Is it not further true that this has been a work in progress for some time and also that it was very important to the residents that their language expand from just the word resident to descendant which you were able to accomplish and is it not also true that you have amended this to assure that we're able to get some things done for Hogham and this bill will be able to move on or we'll have a smoother transaction. The gentleman is am I not the correct good man. Mr. Chairman may I add something? Yes sir. It does my heart good to see two gentlemen from the coast working on a very very important group of folks and standing up for them. There's an important to Georgia. Yes. Enter our culture. Thank you for both for doing that. You do have another question. Yes sir. The gentleman's to your left. Representative Adinia is recognized for a question. Not a question but a comment. Mr. Speaker on our table we just don't seem to see these amendments so I haven't received this one either. This one was was may have been the very first put on your desk this morning. Checked every single paper on my desk. So it probably got buried representative it probably got buried in the paperwork. I would be happy to read what the amendment says it's only one last. I think he's getting a copy of it there Mr. Chairman. You have one further questions all I want to take on this one while they get a look at the amendment if you will yield to representative town said. I'll be out in front of you sir. Thank you Mr. Speaker. Mr. Chair do you yield? I do. Just a question for you. I haven't I apologize just for not reading them myself either. Can a do they expand the committee where a another resident who permanent resident in Saplow could also be a member if they're not from that line of descent. No to to to my good friend who's also from the coast. Mr. Speaker the committee has had and will still have five members but one of those members was from a commission and the governor's office it was a commission on human relations and that commission has gone away yet no longer exists and that's where that additional member came from. Okay so I guess my question is if a person lives permanently on Saplow can they still be a member of that committee. Absolutely okay the requirement for the two members of Hoghamuk is that they'd be residents and also descendants of Thomas Spold and slaves. Thank you Mr. Chair. Thank you. Mr. Speaker there's no further questions I'll yield the will. Here's the any objections to the adoption of the House of Mimic the chair here's doing and the House of Mimic is adopted. On the general's motion that the House agree to the Senate substitute to House Bill two said me three as amended by the House all those in favor will vote yes those opposed will vote no and the clerk will unlock the machine. Have all members voted if so the clerk will lock the machine. On the general's motion the yeas are 163 the nay zero and the House has agreed to the Senate substitute to House Bill two seventy three as amended by this House. Chair recognizes represent the Maynard for our motion. Thank you Mr. Speaker I move that we insist in a point to committee for House Bill one four two. Representative Maynard moves that the House insist on his position in disagreeing to the Senate substitute to House Bill one forty two and that a committee of conference be appointed. Clerk will read the caption House Bill one forty two by resident Maynard of the fifty six and others to be entitled back to a men chapter eight to title twenty of the fish go to Georgia and attended relating to campus policemen so survived for the establishment of unified campus police forces through agreements entered into bi colleges and universities. Is there objection the chair here's done the House has insisted the chair appoints representative Maynard from the fifty six represented Collins from the seventy first and representing Lundston from the twelfth as a committee of conference on House Bill one forty two. Okay members we're going to take up one more bill and we'll have a good discussion on it and take us a few minutes but we're going to do it before we go home tonight. Mr. Clerk will you read the caption to Senate Bill two twenty two two two. Senate Bill two twenty two by senator Burns the twenty third to be entitled back to a men chapter two title twenty one of the fish go to Georgia and attended relating to primaries and elections generally so survived for that all costs and expenses relating to election administration are paid for with lawfully appropriated public funds this bill I've referred to the committee on governmental affairs that committee recommends a disbilled do pass by rules committee substitute. We're going to have some respectful discussion on this bill so everyone can be heard. Representative games is recognized to present the bill. Thank you Mr. Speaker I'll be brief I know the hour is late I know there are a number of folks who were signed up to speak to this bill but Senate Bill two two two is a common sense measure you know in twenty twenty we saw record outside funding from partisan interest groups funnel millions of dollars and to local boards of election including forty five million dollars from one partisan interest group ninety five percent of which went to counties of a single party. Yeah before covid this really wasn't even a thought of private funding of our elections but we did see it in twenty twenty again record funding funnel into local boards of elections in response this body and the general assembly and the governor passed Senate Bill two oh two the election integrity act taking immediate steps to ban what we're called Zuckerbucks and all outside influence in our elections well since in certain Georgia counties are to have attempted to subvert our laws by exploiting what they believe is a loophole and a mechanism to receive outside funding that they got in twenty twenty Senate Bill two twenty two simply reaffirms the original intent of Senate Bill two oh two and clarifies that Georgia elections will only be funded by public dollars and and there are elections have integrity in the in in its funding since twenty twenty twenty four states including Georgia had banned outside funding for local election offices this is a basic function of our government we should not be seeing partisan outside interests funneling money into counties of one particular party or another and that's what this bill simply does section three of Senate Bill two to two I'll briefly mention because it is an addition from what the Senate passed it creates the independence of the state election board for for budgetary purposes this morning we confirm judge Duffy as a chairman of our state elections board section three and talking with him and and other discussions is necessary for budgetary purposes Senate Bill two oh two that we pass a election integrity act was designed to guarantee the independence of the state elections board from the political process to ensure a fair accountability for our electoral system this bill simply continues with that vision here tonight mr. speaker this bill simple it makes sense I think it's common sense for us to make sure we are banning outside money in our in our public elections and that we grant the independence of the state elections board I know the night is late so I will yield the well on others many members signed up to speak but ask for this but bodies favorable consideration of Senate Bill two to two I yield the well the gentleman is yielded the well and we do have a number of people signed up to speak represented draper is recognized to speak to the bill representing draper the y'all will you have up to 30 minutes thank you mr. speaker good evening colleagues so I a good night that's right so I agree we have a problem with outside interference in our elections and I agree that it is only affecting some of our counties and I agree that there are partisan motivations behind these actions and it has become a major problem since the 2020 election we as a legislative body we not only have the ability to do something to help I would argue we have the responsibility to do something to stop this from happening so my dear colleagues why are we not talking about the hundreds of thousands of maritalist voter challenges that have plagued our states since 2020 these voter challenges are coordinated by entities outside of Georgia whose intent it is to interfere with our elections that should be what we are talking about today not a bill that would make it harder for our counties to combat the challenges that they are facing in the days before the 2021 Senate runoff true the vote a conspiracy driven organization based out of Texas challenged the eligibility of 364,000 Georgia voters the lists of voter names they produced were so unreliable that the vast majority of Georgia counties dismissed the challenges out of hand but true the vote still achieved success because they diverted limited precious resources away from the administration of a high turnout election during the crucial final days of voting since the 2021 runoff mass voter challenges coordinated by out of state organizations have been more deliberate let me draw your attention to map number one on the screen those are the counties where groups have filed mass voter challenges since 2021 that have proved time and time again to be maritalists so I know it's a small map those counties are Chatham Cobb DeCab Fayette Versailles Fulton Quenette and Spalding all counties with\n\nlarge numbers of Democrats. In 2021, we saw 65,000 of these meritless voter challenges in those counties. In 2022, we saw at least 75,000 of these meritless challenges in these counties. And just to give you a small sampling of the absurdity of the voter challenge hearings that counties are forced to hold, two weeks ago, some of the people challenged in Fulton County included one, a DeCab County resident who doesn't live in Fulton and who has never lived in Fulton. Two, a young woman who lived on a street where the street name had changed, but the new dress wasn't showing up in the county data yet. She took time away from her four young kids to go to the voter challenge hearing because she was afraid if she didn't, she was going to be taken off the rolls. And three, perhaps the most ironic, the Republican appointed Fulton County Board of Election Member and her immediate family, their eligibility to vote was caught up in that mass voter challenge. It's funny. The primary intent of these challenges isn't to identify ineligible voters and remove them. It's to come up the works. It's to use available resources to divert election workers from their duties. It's a process that has been deliberately weaponized against Georgia voters and the Georgia election offices in targeted counties. And it should make you angry, even if it's not happening in a county that you represent. So to put a fine point on the administrative toll that these voter challenges have on counties, Gwyneth County has spent over 10 hours alone in the past month just being at hearings. And of course, that's the tip of the iceberg. It's the pre-work, the research that they have to do on the challenge voters that takes most of the time. So just before the November 2020 election, Gwyneth processed tens of thousands of challenges. And the Gwyneth election supervisor said it took somewhere between five and 10 members of his staff all day, every day, for multiple weeks to get through the voter challenge workload. So look, if you do not understand why I'm up here talking about voter challenges, this is my point. Outside groups have filed voter challenges for the past two and a half years that increase the cost of elections only in the counties where they file those voter challenges. There are significant extra costs borne by these counties. If we are allowing outside groups to increase costs in only certain counties, why won't we allow other outside groups to help offset these costs? We've heard a lot today, and in the course of this bill, about the need for equitable distribution of resources among counties. But as we see, there is not an equitable distribution of costs among counties and our election offices. So I was trying to think of a metaphor that would aptly describe this situation. Imagine that our county election offices are robots trying to get across the lake. And a lot of these boats are leaky. The election offices that are being targeted with the voter challenges, someone drilled a hole in the bottom of those boats. And some of these boats are going to take on a little bit of water, but they're still going to be able to travel across the lake. And then with the other boats, you can hardly grow, because you're in there with your bucket, desperately trying to bail out the water. And what are we doing here in the legislature to help that situation? Well, we're severely limiting their options for fixing those leaks and patching those holes. Why? I still haven't gotten a convincing answer for that. And it seems like to me that we'll tolerate all the boats taking on water just so long as those boats with the biggest leaks and the drilled holes go under. Honor-related note. There's an election pedaling conspiracy group that shows up to most committee meetings dealing with elections. They have been enthusiastic supporters of SB222. They are also responsible for filing tens of thousands of maritalist voter challenges in Gwyneth last year and driving up costs there. How messed up is it that the same people who are drilling holes in the bottom of our boats are then lobbying against the plugs? All right. I'm going to pivot away from voter challenges. I'd like to take a little time and speak about our responsibilities as a body in crafting voting and election legislation. When it comes to voting and election legislation, more so probably than any other area of law that we shape, the opportunity to weaponize the law for part as an advantage exists. It's pretty obvious, right? We are elected officials in here, every one of us with an R or a D by our name. And we are literally writing the rules of the game that we plan. And so, when we are crafting and passing voting and election legislation in particular, we have a heavy responsibility to make sure we are doing what is best for Georgia and not what is best for our own job security and for our party. Confidence and integrity in our elections starts with us. How we manage that responsibility. And it's hard. I want to acknowledge that I suspect that all of us had partisans who helped us get elected. We also have a very big election coming up in 2024 and the margins are going to be very tight. But I also know from spending a lot of time this session speaking with many of you that there is much interest in this idea of taking politics out of election administration, the way it ought to be. I was very happy to vote yes for SB 129 last week sponsored by Senator Rick Williams. SB 129 was a great piece of legislation that passed the House with broad bipartisan support and is supported by voters, election officials, and the Georgia Chamber of Commerce to boot. Likewise, I was happy to support Judge Duffy as the chair of the state election board earlier today. Look, you're never going to please everyone. God, I know that's true. But there are stakeholders who we should be trying to please when we consider changes to our voting and election laws. Who are they? The voters, naturally, our counties, the Secretary of State's office, nonpartisan experts in the space and our county election administrators who are on the front lines of this work and immersed in it every single day. If those stakeholders support legislation, that's a really good sign that we are prioritizing Georgia. And if they aren't, well, that's a sign that we've got more work to do. And do you know what's a really big red flag? A red flag that's going to decrease the public's trust in our work? Is it for ramming through legislation over the opposition of those stakeholders? And if it's legislation that's supported by conspiracy theorists? And y'all, that's what SB222 is. All right, over the past two years, we have had multiple election officials from counties red and blue testify against this bill. Not one election administrator has testified in support of it. All right, the people who do this work. Every day, and who have the least partisan interest are telling us no. The people who are not experts in this work and that have a blatantly partisan interest are saying yes. That in itself should make us all take a step back and hit pause. All right, to matter at hand, SB222. I have serious concerns with SB222. This bill would prohibit counties from soliciting funds for their elections. And bill supporters will tell you it leaves open away for counties to receive outside funds through the state election board. But I'll tell you why that method doesn't work in just a moment. The practical impact of this bill, I want to be very clear, the practical impact of this bill is that counties will be cut off from the funds they need to do their jobs. Local county officials are in the best position to understand what they need and how much that costs. Here's another Democrat talking about local control today. They are going to be the best advocates for themselves and for their voters. SB222 would add an additional level of bureaucracy between local election officials and their ability to fund their operations. This bill would have the SED state election board broker grant applications and fiscal allocations for 159 counties. Now one of the questions that came out of a committee meeting that exemplifies what a bad idea this is, it came from an election administrator in Muscogee County. She brought up the fact that counties often offer each other extra or used election equipment when they were done with it. So for instance, Cobb County recently offered black ballot transport bags to any office in the state that needed it and Muscogee asked for 150 of those bags. Now under SB222, this kind of collaboration between counties that we should want to encourage is illegal unless the donation goes through the state election board which would then have to equitably distribute the donation. So that's silly on its face. Now what does equitably, equitable distribution even mean? Is it based on counties, which counties request funds? Is it based on the number of voters in a county? Is it based on the county budget? Do you know? I don't know. The counties don't know either. And why don't we know that really important question? The answer is that important question. What information is not in SB222? SB202, the omnibus election bill from 2001, that's the bill that tasked the state election board to present a report proposing a method for accepting donations intended to facilitate the administration of elections and a method for equitable distribution of such donations statewide by October 1st, 2021. So that's lines 433-435 in SB202. So basically the way in which the SCB is supposed to distribute these funds per SB222 is found within SB202. And a deadline for that report that was supposed to be given to the General Assembly that made all of this clear, that answered what the question is of what is equitable distribution, that was supposed to be in by October 1st, 2021. So here we are, it's 2023, 17 months after the October 2021 deadline, and the General Assembly has not been presented with an report to approve. Excuse me. So we have no clarity. And most importantly, the counties have no clarity into what the process for fund solicitation and distribution would be under SB222. Isn't that something that we should have in place before we tell counties they can no longer solicit funds? And let's just think this through, start to finish. So what might it look like if the state election board acts as an intermediary? Let's say that Lounge County wants a grant for another scanner. So what do they do? Well, they tell the election state election board who then, well, we're not sure because we haven't seen you approve the report outlining what they would do next. So let's assume when they get around to it, they submit a grant on behalf of Lounge County. Maybe they wait to receive several grant requests so they can bundle them all together when they fill out the grant application. And eventually the funds come in, and the SB is responsible for distributing those funds equitably throughout the state. Again, we don't know what that means. That there's actually no guarantee that the money Lounge County asked for is going to get back to Lounge County, which really disincentivizes Lounge County from going to the SB with the request in the first place. So talk about needless red tape. All because I guess we think a county receiving money to offset costs for necessary and expensive elections equipment is an illegitimate outside influence. Why do we presume the SB knows better what our counties need than our counties? Why do we assume that they will be better at getting needed resources to counties as opposed to allowing the counties to get those resources? That's contrary to the local deference approach we take to most other bills we consider in this chamber. Now, let's talk about another democratic talking point, fiscal responsibility. With SB222, we'd be leaving a ton of money on the table. Honestly, I can't understand why we would choose to limit the amount of resources available to our counties. Here's the thing. Money is fungible. Counties have one big pot of money that they use to pay for all their county services. Whether that money comes from a local tax base, the state, or somewhere else. The county allocates funds from that pot. If you were able to get outside additional money into the pot for any area, let's say elections, then you can take the taxpayer money that you would have spent on elections and apply it to any other area of government. To road improvements, public safety, salary increases, or you could do more in elections. By cutting off access to extra additional capital, we are depriving our counties and citizens of additional services and resources. Look, in other areas of government, not only do we allow, we encourage private donations to government functions. Last year, this body passed the Less Crime Act that both allows local law enforcement to receive private grant funding and provides for a tax credit of up to $5,000 for individuals who donate to local law enforcement. Why wouldn't we take the same approach to our hardworking and under-resourced democracy officials? Do we not trust them to do their jobs with integrity? Are they less worthy of our support than other county employees? All right, let's talk a little bit about the grants from the Center of Tech and Civic Life. Those are the grants that were given to counties in 2020. And I know that one of the justifications provided for this bill, in fact, just from this well a moment ago, was that CTCL grants were directed toward Democrats. And y'all, that is simply not true. In 2020, CTCL invited every single election department in the entire country to apply for grant funding and received about 2,500 applications from across 47 states. The amounts that went to each county, excuse me, were determined by the county themselves. Every county that applied for funding got funding and they got the full amount that they asked for every single time. The money had no strings attached. It was an infusion of funds spent at the discretion of local election officials. In Georgia, 43 counties been admitted from this grant money, blue and red alike. It's map 2 on your screen. 43 counties, red and blue, they're in red on the map. But these are the counties that received CTCL funding in 2020. Those grants resulted in $20 million that were either extra or that the state of Georgia did not have to spend on elections in 2020. Y'all, that's a net positive. I understand how in a hyper partisan environment, it can be easy to subscribe partisan motives. But please, look at the facts. What was it that we heard last week that you can have your own opinions but you can't have your own facts? Look at all the Georgia counties that benefited and all of the county election administrators who are asking for us to keep this opportunity open. The assertion that outside funds are intended to help Democrats falls flat. I know another concern that we are attempting to address in this bill is that we don't want folks outside of Georgia influencing our elections. And y'all, I'm afraid we've missed the bus on that one. There are so many ways that outsiders can and do spend money to influence our elections. We have outside folks with all kinds of political agendas donating to Georgia candidates, tax, parties, lobbying efforts, think tax, think tanks. Look, if Mark Zuckerberg wanted to influence elections, and I don't know, Raven County, one of the 43 counties that received funding in 2020, he could have put his millions of dollars into an organization called, I don't know, Mountain Voters for Biden. And it would have been a lot simpler that way. Or, you know, he could have used that little known mass communication and marketing tool called Facebook. My point is they were many easier ways to influence an election than the CTCL grants. And I would wager that many of us in this chamber have donors from outside of Georgia. We're not passing a bill to prohibit that, are we? Let's not cut off our nose despite our face. Election grants are not the problem. There's simply no evidence of it. The real problem is cutting off lifelines to our chronically underfunded election offices. Honestly, I would look at this issue completely differently if we had adequate funding for our elections already. But we don't. And we keep asking our counties to do more with less. It is undisputed that the work of administering Georgia elections has become more difficult in recent years. Our election offices are working under high levels of scrutiny and pressure. They are getting near constant ORR requests from all over the country. We have new equipment and new laws, which means a lot of additional voter education and staff training. We ask our local election officials to be experts in cybersecurity, management, communications, logistics, federal law, state law, rules and regulations, audits. And with SB222, we are asking them to do all that with one hand tied behind their back. We are being downright disrespectful to these public servants. We're telling them we trust ourselves to receive outside funds and do the right thing. But you, you can't be trusted. It is no wonder that we are seeing a shortage around the state of experienced election workers. Many of our probate judges who also serve as election superintendents, they want out. So it's through that lens that I look at any imposition we consider putting on our election offices. Basically, if we're going to make a hard job even harder, the reasons for doing so ought to be really good. And I'm going to end on the number one reason that I think we should be voting no to SB222. So far, I've talked about this fact, the fact that this bill is over regulatory, that it's financially responsible, that it's not supported by appropriate stakeholders, that the assertions made about the CTCL grants, mainly that they only went to Democrats or false, and that the county election offices are underfunded. And those are all reasons to vote no on this bill. But to me, the biggest reason to vote no against this bill, and any bill, frankly, is when bill proponents mislead legislators and the public about the motivations behind a bill. What am I talking about? We have heard bill proponents say time and time again throughout the discussion of this bill, and again today, this tonight, excuse me, that this bill is necessary because SB202, the omnibus election bill, 202, already cut off outside funding. Proponents stated that counties knew they were not allowed to apply for grants for elections after SB202. Therefore, SB222 simply clarifies what has been policy all along. So we've heard that being said throughout the discussion of SB222. And then tonight, proponents of this bill doubled down on that notion, and they included in this rule substitute a new section one. And I'm sure many of you haven't had a chance to look at this rule substitute, and the new section one, so I'll read it for you now. Section one says, the General Assembly finds that the addition of Code Section 21218 and the revisions to Code Section 21271 and 212212 in this bill should not be interpreted as an admission by the General Assembly that existing law did not already ban outside funding of election administration in Georgia. These clarifications and enhancements were deemed necessary because there seemed to be some confusion among certain Georgia counties at the correct interpretation of existing law. So what does Section 1 saying? It's saying two things by my reading. It's saying that SB202 already banned outside funding of elections, right? And it's also saying that some of our counties were confused about that fact. And that is just not the case, all right? Ask any accounting election office, and they would tell you that is not the case. The fact that something that is so demonstrably false is being offered as a policy justification is a huge red flag to me just as it should be to you. And it should be for the public that calls us on us to be transparent in our decision making. SB222 is not a clarification of existing policy. It is an abrupt change in policy. Why do they deny that? SB202 did make changes to grant the grant process, but it did not ban outside funding of elections. What SB202 did was it actually stopped election offices from directly applying for election funding. And it was understood that under SB202 election offices could still get outside funding if they did so through their boards of commissioners. This carve out was so well known that it was widely reported. Number three on the screen, I know it's small. So I'll tell you what it says, but it was from an AJC article in May of 2021 entitled How Does Georgia's Voting Law Works. And there it is in black and white. It says the law doesn't ban outside donations to county governments, which could then allocate resources to their election boards. The law only affects direct payments of election offices. Let me read that again. In 2021, there was an article that says, SB202, the law doesn't ban outside donations to county governments. All right, let's there be any kind of doubt. The Secretary of State's office was also reassuring counties that they could still get access to election grant funding after the passage of SB202. Number four on your screen is a slide from a presentation by the former General Counsel of the Secretary of State to local election officials. That slide, what it says, it's talking about SB202 and how to interpret it. And it says section nine prohibits election superintendents from taking or accepting grant funding from any source. And other than the governing authority of the county. So as you can see, funding through the county government authority was explicitly permitted. So the question is, why are we saying it wasn't when it clearly was? And why are we using that as the justification for this bill? What's the real justification for this bill? And why won't they say it out loud? And the answer to that, which I think is fairly obvious, is that DeCab County, my county, received a new election grant earlier this year. So let's just look at the timeline. On January 27th of this year, DeCab announced that it had received grant funding from CTCL for the 2024 election. Days later, on February 8th, Cali Leffler and her elections group called for an investigation, even though DeCab had done everything by the book. In her press release, she falsely claims that SB202 had banned outside money from going to counties. And that DeCab was violating SB202. Two weeks later, on February 21st, SB222 dropped into the hopper and bill proponents used the false claim that SB202 banned outside money from going to counties as justification for its necessity. Let's be honest, if it had been Union County that got the grant, would we be here having this discussion today? All right, don't let one move. All right, I'm running out of time here. So let me just present you with an alternative. If you are concerned that DeCab County got a grant. Lady, you have about 10 seconds to wrap up. Yes, ma'am. Yes, sir. Instead of crafting laws to prevent counties from getting the resources we need, why don't we encourage all of our counties to apply for grants? We literally represent 159 counties in this room. What if we went back this weekend and encouraged our county election officials to apply for this and make their elections better? We shouldn't let partisan bills get in the way of good policymaking. And with that, I'll yield the well. Please vote no to SB222. The lady has yielded the well. We have a speaker in favor of SB222. Representative Scott Hilton is recognized to speak to the bill for up to not to exceed 30 minutes. Thank you, Mr. Speaker. I promise I will not take 30 minutes because my show, the bachelor's on right now. And I'm missing the finale. So no spot, no spoilers. Ladies and gentlemen, I rise in support of Senate bill 222. I was sitting here listening to the presentation and I felt compelled to get up and speak because there's been a false narrative that's been peddled in our state over the last couple of years that has resulted in the lost all-star game and economic hardship for numerous hard working Georgians. And I want to get up here to get the record straight about Senate bill 222 and Senate bill 202. First on Senate bill 222, this simply clarifies existing language of what can and cannot be done and keeps counties consistent of what they can do. We do this all the time. We pass bills and then we come down here and we make minor tweaks as needed. This is what Senate bill 222 does. We heard the word conspiracy theorists thrown around. There's a number of significant representatives and senators who are on this bill, including the chairman of ethics on the Senate side and a number of other senators who I believe this body highly respects. So I would encourage us to vote for Senate bill 222, but it was mentioned Senate bill 202. And let me hit on that real quick. Never before in the history of our state have voters had more confidence in our system, we saw in 2022 record turnouts all time records for midterm elections. We saw record breaking midterm early voting. We saw record breaking absentee turnout.\n\nWe saw all time turnout amongst every minority group. By every single metric, Georgia's elections, post Senate Bill 202, were safe, secure, and its success for all Georgians. Again, let me repeat that. Thanks to the leadership of the governor, thanks for the leadership of this house and this body, the General Assembly, we passed a bill Senate Bill 202 that made it easier to vote and harder to cheat. What have our constituents said about that? The AJC poll Georgians, and what do they have to say? Over 70% of respondents said their confidence is never but higher and that our elections are fair and accurate. This body has done a fantastic job. Again, I would be remiss and I think all of us would be if we allowed this narrative to continue to spread in our state, voters have confidence, our system is working, it's going to continue to work, and it's bills like Senate Bill 202 that will continue to give confidence to our voters to go. All of us got elected by the system that was in place, it works obviously. And I would encourage you to vote for Senate Bill 202 and ignore claims out there that have been debunked over and over again. We have organizations and failed leaders who have filed numerous lawsuits challenging the law and they have failed over and over again. Do not let this narrative spread here in Georgia. It has never been easier to vote and harder to cheat, courage you to vote for Senate Bill 202. Thank you very much. Gentlemen, as you did the well, we do have a minority report. Gentlemen, as you did the well, we do have a minority report. Members will respect members and their opinions. We all have one. We will not be tolerated. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. We do have a minority report. Up to 20 minutes. Representative Roberts has recognized to speak to the bill. Thank you, Mr. Speaker. Colleagues, today I rise in opposition to SB222. Members of my committees know that I have raised objection after objection regarding unfunded mandates being placed on our counties and cities, whether it's election bills or bills that require counties to pay the attorney generals unlimited litigation costs when he sues them for prioritizing violent crimes over jailing homeless people, but I digress. Our counties and cities have to be able to plan and budget in order to provide services to their constituents, whether we are talking about elections or other county services. That is why this body in its infinite wisdom adopted the State and Local Government Partnership Act of 1995, which can be found at OCGA 28547 et sec. The stated intent is to strengthen the partnership between the state and local political subdivisions by assisting the General Assembly. That's us. In its consideration of proposed legislation containing fiscal requirements of our local governments, it requires the provision of accurate estimates of the fiscal impact to counties and cities. When the impact of our legislation in aggregate will exceed $5 million, and it requires that fiscal note be provided to the General Assembly before we vote on the proposed legislation. The fiscal note requirement can only be waived by a majority of vote of the committee in which the bill was introduced, or by a majority vote of the chamber or the president or speaker depending on where the bill was introduced. To my knowledge, the sponsor of SB222 did not file a fiscal note, and it has not been waived in the manner prescribed by the partnership act. This body has a history of failing to follow state law and provide these mandatory fiscal notes as it relates to recent election bills. It started in 2019 when this body passed HP316 and purchased the state's new voting machines. Fiscal note was requested in both chambers, but ignored purportedly because the state was covering the cost of the first year. Well, that's not what the partnership act actually requires. The fiscal note for the first year, and the bill is enacted in a minimum of another two years beyond that. So while the state did cover the cost of that first year, you didn't need a crystal ball to see the county's cost would dramatically increase when they were required to take over the maintenance, transport, testing, upgrades, repairs, etc. After that first year, big surprise. We were right. HP316 has cost local governments in aggregate well over $5 million demonstrating that a fiscal note was in fact required. Just looking at Fulton County's municipal elections alone comparing 2017 to 2021, election costs increased more than $4.5 million. Now looking at 2020, we know that 43 counties across the state, both red and blue received at least 20 million in grant funds, to supplement their election budgets. This was desperately needed because the county's increased cost as a result of the new voting machines in the pandemic. Because some folks didn't like the outcome of the 2020 election, this body passed SB202, the next year, which prohibited election superintendents from accepting any funds from any sources other than the governing authority of the county or municipality, the state of Georgia, the federal government. As a result, the increase from the 2020 presidential election to 2022 midterms, Fulton County's election budget increased almost $19 million, guanette almost $10 million, in housed in Cobb and Cherokee County's election budget increased by $1.5 million each. Clearly, we just keep driving up the county's costs, which are ultimately born by our taxpayers and now we are handcuffing them even further with SB222. The sponsor of this bill said in committee that the purpose of this bill is to clarify SB202 because the local governing authority of Decap County specifically, its chief financial officer applied and received a grant from a nonpartisan organization. They lawfully appropriated it and then distributed it through its budget process into its election budget. Let me be clear, despite folks saying this was inappropriate and others implying it was illegal to cab county followed the clear letter of the law even according to the Secretary of State's SB202 training materials for election supervisor. So now y'all are doubling down with the bill. Counties and cities will now be prohibited from receiving funding from anyone other than the state or federal government and if they do, it's a felony. With a punishment of not less than one year in prison and a fine of not less than $10,000, it requires all grants or donations to go through the state election board so that all counties are treated equally. Not all counties are equal. Large counties have very different needs than small ones. Large democratic counties have been plagued by tens of thousands of very expensive voter challenges. There is nothing in the bill that requires the SEB to apply for grants or funding. It doesn't provide a formula for what an equal distribution should any grants or funding be received. Well, Georgia law requires the counties, the counties fund their elections. Not the SEB, not the state, yet we are now going to impede them from seeking grants that could help them fill the budget gap that this very body created with its prior unfunded mandates. And what is also very obvious is that the people of Georgia are taxpayers, they are the ones who will be harmed by this bill. They will be forced to make up the funding gap created by this bill and let's be honest. Y'all know this bill will desperately harm Georgia's large democratic counties. That's the point. Y'all aren't fooling anyone. You claim you want conformity among county elections but y'all know that counties with 500,000 voters require a lot more than counties with 5,000. But the last time I checked this body represents the entire state of Georgia. This bill is not a partnership between the state and our local governments. At a minimum, all counties deserve notice of the fiscal impacts that they will bear when we pass this bill. And it is a legal for this body to vote on this bill before a fiscal notice presented by the bill sponsor. Before it has been waived by the Senate because that is where the bill was introduced. Mr. Speaker, I yield the bill. The lady has yielded the well. Your representative Ramon is recognized to speak to the bill. Thank you, Mr. Speaker. Good evening colleagues. And I rise before you today to speak against SB 2-0-2-2. So, you got my head. SB 2-2-2. And I want to start out by roughly translating an Arabic idiom that goes, he hit me and cried and then he out ran me to complain. And honestly, I feel like that's what's happening here. We defunded a ton of money, we took away a ton of money from these election boards. And now we're mad at them for trying to close that hole that we put in there. And not only are we mad about it, we now want to retroactively punish them realizing that that does and could potentially create some undue influence, but dependent, like based on what information facts. We get these bills every session from the same groups of people and we decide to tinker with the voting process. And then we realize, oh no, this caused this already agreed upon problem or at least on our side agreed upon problem. And then we try to fix it to create by creating a very different problem. And that is a terrible cycle to be in. It's like we're constantly racing to the bottom when it comes to voting. And for the record, this stuff doesn't just impact democratic counties. Back in 2020, when everybody was talking about mail and ballots and mail and slowing down the mail and all that great stuff, I actually did nonpartisan poll monitoring in Forsyth County. Almost a third of people were turned away that day because they were at the wrong precinct because they didn't get the right card for where their address was supposed to be. Thankfully, their voting location was 15 minutes away and they could still make it and at the time you could still do a provisional ballot. But I will never forget that day because there were people who thought they did everything they were supposed to. They had their cards with them, they had their voter registration with them, they had their ID with them. And for the record, they were across the political spectrum. They were not just Democrats, they were not just Republicans, they were not just libertarians, you name it. And so every session we come up with a new bill creates new problems. Then we try to fix those problems by somehow creating more problems. I don't get it. It's like this bizarre cycle that we can't seem to break out of. And it harms everybody. So if you want to fault people for trying to fix the problems that we created, shouldn't we instead just fix those problems? That seems to be like a much easier shortcut than going around and continuing to scare people into exercising their right to vote. Because it is a right to vote. And in order for that right to vote to happen, those elections need to be properly administered. And in order for those elections to be properly administered, we need to be able to pay for that system and that process. This year, for example, was one of the hardest years to recruit poll monitors or poll workers. What do you think helped with that? Increasing the wages that we were paying? How are we supposed to pay for that if we're not getting funding for it? I mean, seriously, I totally understand that we are constantly inundated with information, constantly told what the right solution is all the time by people who we have come to know and trust. But I urge you to look outside of that information ecosystem and understand that what we do here, if we don't think about it from beginning to end, we end up harming those that we think aren't actually going to be harmed at all. And so the next time somebody tells you we're trying to reduce undue influence, we're trying to reduce outside influence. Who put that into reality? Who created that situation? Who defunded that board? Who created those unfunded mandates? Because I can tell you right now in Gwinnett County, we had an incredibly smooth election. But we had to dip into reserves to make that happen. The county paid for it. It wasn't based on funding that we gave based on the mandates that we created. Instead, they had to jump through hurdles, find the resources, and make sure elections went without a hitch. And then everybody potted themselves on the back going, look, the mandates that we created went just fine. No, it required people doing whatever they could to meet those mandates. And instead of saying, you know what, y'all did a great job. Thank you for that kind of an election cycle. Tell us what could have worked better. We're saying we're actually going to punish you for it retroactively. And we're going to implement something else. That does not make sense to me. And I promise you it impacts everybody. Sure, some counties more than others. But I guarantee you, somewhere down the line, we're going to find out just like we heard about the voter challenges in Forsyth County, just like we heard about the voter challenges around the state, it's going to keep happening. And at some point, we need to all stand up and say, enough is enough. This is our line in the sand. And we can't keep messing with this process. Please, for once I urge you, please reconsider your stance on this bill. Work on it a little bit more. And vote no. Thank you, Mr. Speaker. I yield the well. The lady has yielded the well, representative Draper is recognized to speak to the bill. You have about a little over seven minutes. I won't use that, Mr. Speaker. Would you mind if I got the slide back up there that I was using before? Please, thank you very much. So I was coming up here to rebut some of the comments that were made, but there weren't very many comments made in support of this bill. What I did here is that there is a false narrative peddled in our state. And then I heard that SB222 simply clarifies what had been the existing law all along. There is a false narrative here. This bill does not simply clarify what has been the law all along. See exhibit three, see exhibit four, ask any county election official in 159 counties. I'll speak to the legislators that have discussed this bill in earnest for the last two years. This is not a existing policy that we are clarifying. This is a change in policy. The other comment I heard that I would like to rebut is that, well, that I don't want to rebut. The other comment I heard is that we had a functioning election in 2020. So why would we want to change it? Why would we want to take away the resources that the county used in order to have a functioning election in 2020? Because that is what we are doing with this bill. So again, I ask you colleagues, don't let partisanship get in the way of fair policy making. There will be negative and unintended consequences to putting up hurdles between our counties and the money they are telling us they need access to. We should be very skeptical of any election bill that is pushed through over the opposition of our election administrators that isn't transparent about its origins and purpose and that puts partisanship over sound thoughtful policy. We degrade the public trust by playing these games. We insult our public servants by playing these games and ultimately we harm our communities by playing these games. And look, maybe I'm not going to convince any of my colleagues on the other side of the aisle to join us in this vote. But if we do pass SB222 today in the interest of fairness and equity and to promote uniformity in our elections, we have got to. We have got to address the insidious issue of voter challenges in our state. Look at those two maps. We cannot say no to selective funding, but say yes to selective additional costs. So I will be looking for partners in that endeavor and I welcome anyone who believes in sound policy over partisan gamesmanship to vote to join me. Please oppose SB222. Thank you, Mr. Speaker. I yield the well. The lady has yielded the well. We will now have 20 minutes up to 20 minutes for the chair's time. Chairman LeHood, chair of the committee this legislation came through is recognized to government affairs is recognized to speak to the bill. Thank you, Mr. Chairman and colleagues. It was late. Lots of been said and as my friend just said, I don't think anybody's mind is going to change with what I say. But I do want to be clear that it's obvious that there's some disagreement on whether or not this bill was intended to clarify some things in Senate bill 2-0-2. But something that is crystal clear is that this bill aims to ensure that there's no illegal influence on the outcome of our elections. As long as elections put people in places of power to make decisions about how government operates, how it spends taxpayer money, who benefits from that spending, how government exercises its power. There's going to be people out there motivated to illegally influence the outcome. And that's why we've got to make sure. And that's why this bill is ensuring that there's not illegal influence in our elections. The right to vote in a free and fair election is the most basic and fundamental civil right we have. One on which many of our other rights as Americans and Jordan's depend on. And again, like I said, it's not a new idea that there's people out there who want to illegally influence the outcome of our elections. That's been going on since Mooby Dick was a minute. And it's going to continue. So those are in favor of ensuring that our elections remain free and fair and avoid illegal influence from outside sources will vote in favor of this bill. Mr. Speaker, I asked that my colleagues vote with me in favor of Senate bill 2-2-2 and I'll yield the well. Gentlemen, is yielded the well that completes discussion on the bill. Is there any objection to withdrawing the committee's substitute for what purposes RIPs and Roberts rise? To make a motion. State your motion. I'd like to make a motion to lay SB 2-2-2 on the table because pursuant to the state and local government partnership act of 1995, OCGA 25-549, the Senate sponsor of SB 2-2-2 has not obtained the requisite fiscal note and it has not been weighed by the Senate where it was introduced as required by state law. It would violate state law if this chamber proceeds with the vote. Okay. We have a motion that Senate bill 2-2-2-2 be laid on the table. Mr. Clerk, will you read the caption? Senate bill 2-2-2 by Senator Burns, the 23rd to be entitled to amend Chapter 2-2-21 of the official go to Georgia and it had a related to primaries and elections generally so to provide that all costs and expenses relating to election administration are paid for with lawfully appropriated public funds. On the General Ladies' motion, that SB 2-2-2 be laid on the table, is the objection. There is objection. Does the lady move? The General Ladies' motion. Here's what we're going to do. We're going to the side on the ladies' motion. I'm going to let this body decide if they feel like everything has been followed. All those in favor of the motion of table will vote yes. Those opposed to the motion will vote no and the clerk will unlock the machines. Have all members voted. Have all members voted on the motion. If so, the clerk will lock the machines. On the motion of table Senate bill 2-22, the yeas are 67, the nays are 101, the motion has failed. Is any objection to adopting the substitute offered by the Committee on Rules? The Chair has known the Rules Committee's substitute is adopted. Is any objection to agreeing to the report of the Committee which was favourable to the passage of the bill? State your objection. To the passage of it out of the Committee of which it came. So we have an objection to agreeing to the Committee of which it came. So we have an objection to agreeing to the Committee report. There is objection. Does the lady move? The lady moves all those in favour of adopting the Committee's substitute and agreeing to the Committee report of the Committee will vote green. Those opposed will vote red and the clerk will unlock the machine. The lady moves all those in favour of adopting the substitute and agreeing to the Committee report. On the motion, this House clerk will lock the machine. I'm looking at that. The yeas are 100, the nays are 70. This House has agreed to the Committee report. Is any objection to agreeing to the report of the Committee which was favourable to the passage of the bill? The Chair has known the report of the Committee is agreed to. Shall this bill now pass? All in favour of the passage of the bill? Will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. If so, the clerk will lock the machine. On the pasture of the bill, the yeas were 100, the nays 69, the bill haven't received. The requisite constitutional majority is therefore passed. For what purpose is representative Bruce rise? Inquiry? Is this sunny day? State? Nobody could be if you make the motion. All right. We're going to move on to some belated afternoon orders. Belated. Chairman Prince is recognised for an evening order. Thank you, Mr. Speaker. The morning fellowship, Tuesday fellowship will is cancelled for tomorrow. The cancel is 7 o'clock. Representative Bentley is recognised for an afternoon order. Are you going to say late night order? Thank you, Mr. Speaker and good evening colleagues. I want to wake you up. That's what I wanted to do because this is a moment that we all need to come together. I'm going to ask you for the stand and please help help Chairman Chokers and I remember the beloved life of the former mayor of the University of Georgia, Rafti Brown, Jr. Rafti Brown, Jr. served his country in the United States Army for 21 years. He served his community as mayor for the City of Univista Georgia for 20 years also. He was a devoted father, grandfather and community supporter. And we will just ask that this House of Representatives will pause for a moment of silence and give an honour and recognise in the life and legacy of former mayor Rafti.\n\nBrown, Jr., of the University of Georgia. Amen. Thank you, colleagues. Thank you, Mr. Speaker. Representative Chair Lady Lynn Smith and Chair Lady Matthew Act are recognized for an evening order. Thank you, Mr. Speaker, members of the House. So it's a good note to end on our announcement that the Ninon High School Winter Guard, the 2023 Winter Guard International Atlanta Champions and Scholastic Regional A Class with the score of 85.580. These ladies, 1, 1, 1 big. So we're going to leave this evening, bragging about that. But one last brax. I want to do a shout out to my niece, Ellison Knox, because she was a part of that team. Go, Nounin. Yes. Woo-hoo. Applause. We'll now have some announcement. Chairman Williamson is recognized for an announcement. Thank you, Mr. Speaker. The majority caucus will be breaking red tomorrow. I wanted to call us. I have a caucus breakfast, but I was overruled. We will have a caucus lunch tomorrow on Room 403 at noon. Caucus lunch. Thank you, Mr. Speaker. Thank you, sir. Representative Maynard is recognized for an announcement. Thank you, Mr. Speaker. Has anybody seen these blue recycle bins that have started to pop up around the Capitol? So there's one right over here in the corner. And there are also some white boxes throughout the Capitol for recycling for paper. So all this paper that's in here instead of putting it in the trash can behind you, there's a recycle bin. Yay. So let's recycle. Thank you, Mr. Speaker. Thank you, Representative. That's a good announcement. Thank you. Okay. Let's see. Senate Bill 64 will be postponed to the next legislative day. Senator Reminder to you members, don't throw away your agreed disagree folders. You will not get additional copies of what's currently in those folders. So be good stewards of your folder. I think it's that time. The majority leader of this house is recognized for a motion. Thank you, Mr. Speaker. We've proved that this house stand adjourned until 10 a.m. on Wednesday, day 40, March 29, 2023. I can remember all the motion of the majority leader that this house stands adjourned and 10 till 10 a.m. Wednesday, March 29. I think you said day 40. Motion of the majority leader, all those in favor will say aye. They have it. All those opposed will say no. Yes, clearly have it. We're adjourned.",
  "updated_at": "2026-02-13T07:50:35.868207+00:00"
}