{
  "video_id": "n4sTVIgKVps",
  "url": "https://www.youtube.com/watch?v=n4sTVIgKVps",
  "title": "Sen. Kennedy's Response to the President's Joint Address to Congress | 3-4-2025",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "# Summary of Georgia Sen. Kennedy's Response to the President's Joint Address to Congress | 3-4-2025\n\n## Overview\nSen. Kennedy delivered a strong endorsement of President Trump's policies and vision for the country, highlighting the President's commitment to economic prosperity, limited government, and putting American citizens first. He praised the President's \"America First\" agenda and pledged that Georgia Republicans would work to turn the President's vision into action.\n\n## Key Actions\nNo specific bills were mentioned.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Sen. Kennedy praised President Trump's \"bold vision for the future\" and his commitment to the principles that have \"always made this nation great.\"\n- He accused the Democratic Party of clinging to \"tired old ideas of bigger government, open borders, and weakness abroad.\"\n- He promised that Georgia Republicans would \"roll up our sleeves and get to work\" to deliver on President Trump's agenda.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "Good evening. Tonight, President Trump spoke directly to the people of this great nation\nand told them what many Americans are already feeling, that the state of our union is strong\nand optimism is growing by the day. In November, President Trump was giving an overwhelming\nmandate to make America great again. His address laid out the bold vision for the future,\none rooted in the principles that have always made this nation great, strength, freedom,\neconomic prosperity. Georgia Republicans stand united in support of his agenda, and we\nare already hard at work to make the great American comeback a reality. President Trump\nspoke of an America that puts its citizens first, an America where the government serves\nthe people, not the other way around. For too long, Washington has function as a bloated\nbureaucracy, wasting our hard-earned tax dollars on inefficiency and overreach.\nFor many Americans across the country, the President's commitment to a more limited,\ncommon-sense government has restored faith in our institutions, and the idea that government\naccountability is not only possible, but necessary.\nGeorgia Republicans are following suit by passing efficiency measures for our own legislation\nthat slashes red tape, restores accountability in our state government.\nAnd on the economy, the president outlined a plan to keep America thriving.\nYou know, under his leadership, we've already seen a resurgence of optimism, business investing,\njobs returning, and families keeping more of their paychecks.\nLike President Trump, Georgia Republicans have delivered on historic income tax reductions,\nputting over $6 billion of taxpayer money in the hands of hardworking Georgians.\nThat's because Georgia Republicans believe that your tax dollars are best kept in your\npocket because that's your money, not the government's.\nAs a successful businessperson, President Trump understands that economic strength is foundational\nto our success.\nUnder his leadership, we will ensure Georgia's success will not be undermined by foreign\nadversaries or misguided policies drafted by Washington bureaucrats.\nThe vision of former Governor Deal and conservative leadership of current Governor Brian Kemp\nhave made Georgia the number one state in which to do business for 11 consecutive years.\nPresident Trump's return to the White House will bolster our efforts significantly.\nThe economic priorities of the Trump administration will send a signal to all Georgians that the\nThe best is yet to come.\nThe America last policies, the Biden administration, that have crippled the American farmer and\nAmerican worker are no more.\nPresident Trump will deliver on his promise to be tough on unfair and deceptive trade practices.\nGeorgia businesses are begging for a level playing field.\nIn Georgia, in President Trump's trade policies, we'll put hardworking Georgians and America's\nindustry first.\nAgriculture is Georgia's number one industry and our farmers deserve a truly competitive\nmarket to bring their products to feed the American family.\nPresident Trump and Georgia Republicans will fight to ensure that tariffs protect American\nindustry, that deregulation unleashes our entrepreneurs and that our vast energy resources power\nour state and our nation into a new golden age.\nleadership in the White House, and the governor's mansion, and the Georgia Senate, will keep\nour state the best place to live, work, and raise a family for many, many years to come.\nNow let's be clear, the road ahead will not be easy.\nThe Democrats will resist us.\nThey'll cling to their tired old ideas of bigger government, open borders, and weakness\nabroad.\nBut tonight President Trump showed us a better way, a way that listens to the forgot\nnot men and women of this country, not the coastal elites or the Washington insiders.\nRepublicans in Georgia are ready to turn his vision into action.\nWe won't just cheer from the sidelines, we're going to roll up our sleeves and we're going\nto get to work.\nTo the people of Georgia and Americans across this great country, this is your victory.\nYou voted for a change in November and President Trump is delivering on it.\npromises made and promises kept. You demanded a government that respects our values,\nprotects our families and secures our future. Tonight you heard a president who\ngets it, a leader who speaks your language and fights your fights. Georgia\nRepublicans are committed to being your voice, your shield, and yes your\npartners in this historic moment. Four years ago President Trump promised to\nmake America great again. He kept that promise then, and he's keeping it now.\nTogether with his leadership and our resolve, we will build an America that is even stronger,\nprouder, and more united than ever before. May God bless this great state of Georgia,\nand may God bless the United States of America. Thank you.\n",
  "updated_at": "2026-02-12T18:59:15.71512+00:00"
}