{
  "video_id": "N7E6qiANoVU",
  "url": "https://youtu.be/N7E6qiANoVU?t=1393",
  "title": "Georgia House - Day 1 (2026-01-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": "2026-01-10",
  "duration_minutes": 51,
  "summary": "## Georgia House of Representatives - Day 1, 2022 Session (January 10, 2022)\n\n### Overview\nOpening day of the 2022 legislative session, notable for coinciding with the Georgia Bulldogs' national championship football game.\n\n### Key Actions\n- **HR 568**: Notified Senate that House has convened\n- **HR 569**: Called joint session for Governor's address (scheduled for Thursday at 10:45 AM)\n- **HR 570**: Established session schedule - out Tuesday (Jan 11), reconvene Wednesday at 11 AM, Thursday/Friday at 10 AM, then budget hearing recess\n\n### Bills Introduced (First Reading)\n- **HB 843**: Property tax exemptions amendment\n- **HB 846-849**: Traffic/road safety and child abuse reporting\n- **HB 850**: Holiday observances\n- **HB 851-853**: Inmate policies and detention conditions\n- **HB 854**: Incorporation of City of Buckhead\n- **HR 529**: National Park Services concerns\n\n### Notable Moments\n- Rep. West Cantrell (term-limited after 8 years) delivered scripture reading from Romans 12\n- Multiple references to Georgia Bulldogs championship game that evening\n- Birthday recognitions: Rep. Karen Bennett, Rep. Betsy Holland, Rep. Beth Camp, Rep. Wiltson, Rep. Derek Jackson\n\n### Attendance\nFull session, journal confirmed without objection.\n\n### Adjournment\nAdjourned until Wednesday, January 12th at 11 AM to accommodate championship celebrations.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGlory, glory to old Charger.\nHere is a grace to feel before you.\nMen with hearts, bodies and minds in which the entire mold of our nation can be justifiably proud.\nBut tradition of unbridled excellence demonstrated by these individuals and many others\nSpain's more than a full century.\nAnd now a new bringing of Mordor\nof Spain's ready to take the field back\nthrough the silver reins of the Georgia border\nWe continue that tradition, understanding that there is no tradition more worthy of envy,\nno institution worthy of such loyalty as the University of Georgia.\nAs we prepare for another meeting between the Hedges,\nlet all the bulldog faithful rally behind the men who now wear the reddened line,\nget two words, two super words, which express the relevance of the entire bulldog nation.\nWelcome to legislative day one of the 2022 session, but more importantly, well,\nWelcome to the National Championship Day.\nWhen the Georgia Bulldogs tonight, before midnight,\nwill set everything right with the world.\nAnd they are for convening, having arrived.\nAll members will please take their seats,\nand the clerk will ring the bell.\nI'm going to ask for unanimous consent that we dispense of the morning row call today.\nIs there any objection?\nHearing none, it is so ordered.\nkeepers will please close the doors and keep them closed. We will begin our day as we do each day\nwith scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag\nof our country. Our chaplain this morning will be, our chaplain this morning will be the gentleman\nfrom the 22nd House District, a colleague of ours,\nand a friend of all of ours.\nAnd that is Representative West Cantrell.\nRepresentative Cantrell is finishing up eight years\nhere in the house and term-limited himself.\nAnd so I wanted him to speak to us this morning\nduring this his final session.\nWe're going to miss you very much.\nRepresentative Cantrell has been a real advocate for those,\nfor education reform and many other issues that he has fought for.\nAnd he's a worthy advocate too for all of the causes.\nSo please make welcome the gentleman from the 22nd District Representative\nWest Kim Trill.\nGood morning, colleagues. Happy New Year to you.\nYou know, the speaker faced quite a dilemma today in trying to decide who would be our\nchaplain for the day.\nSo after much deliberation and prayer, he decided to just make the choice easy.\nHe decided he'd simply ask the person who he likes the most, but that person said no.\nThen he decided he would simply ask the person who was the best-looking person in this chamber.\nThat person said no.\nThen he said, I'm going to ask the smartest person in this chamber to be our speaker today.\nThat person said no.\ncalled me. And I said, dog, gone at Mr. Speaker, you've called me four times now. Yes, I'll\nbe the chaplain today. I also find it interesting that on the very day that the University of\nGeorgia is playing for the National Championship in football, the speaker would ask a graduate\nof the number one public college or university\nin the country.\nThe Institute of Technology,\nGeorgia Institute of Technology, to be the chaplain.\nBut all joking aside, we are very blessed here in Georgia\nto have two great institutes of higher learning\nin tech and in Georgia.\nSo in light of that, and in display\nof a great of unity today, I wore my red black tie,\nI brought my Kirby smart visor, and I want to wish everybody a happy, hunker-down day.\nAnd for the first time in my life, I want to say, go dogs.\nSo I want to read a passive scripture to us today, make some brief remarks and we'll\nbe done.\nin the twelfth chapter of the book of Romans, the Apostle Paul,\nin a very couple of brief paragraphs, sums up everything we need to know\nin order to live a life of distinction, a life that truly makes a positive\ndifference in the challenging world in which we live. There's a there was a famous book written\nmany many years ago called All I Really Needed to Know I Learned in kindergarten.\nAnd I would say about this passage of scripture, similarly today, that all we need to know\nabout living life successfully can be found in Romans chapter 12, so let me read it to you\nverses 9 through 21. It says, don't just pretend to love others, really love them, hate what is\nwrong, hold tightly to what is good. Love each other with genuine affection and take delight in\nhonoring each other. Never be lazy but work hard and serve the Lord enthusiastically. Rejoice\nand our confident hope, be patient and trouble and keep on praying.\nWhen God's people are in need, be ready to help them.\nAlways be eager to practice hospitality.\nBless those who persecute you. Don't curse them.\nPray that God will bless them. Be happy with those who are happy\nand weep with those who weep.\nLive in harmony with each other. Don't be too proud\nto enjoy the company of ordinary people\nand don't think that you know it all.\nNever pay back evil with more evil.\nDo things in such a way that everyone can see you are honorable.\nDo all that you can to live in peace with everyone.\nDear friends, never take revenge.\nLeave that to the righteous anger of God.\nFor the scripture says, I will take revenge.\nI will pay them back, says the Lord.\nInstead, if your enemies are hungry, feed them.\nIf they're thirsty, give them something to drink.\nAnd doing so, you will heap burning coals of shame on their heads.\nDon't let evil conquer you, but conquer evil by doing good.\nMy own words of summary of this passage of scripture in order for us to live a life of distinction.\nNumber one, love people, disagree on policy, all you want, but always value the worth of the other person.\nHate wrong. Hold on to the good. Don't be lazy. Work hard. Be enthusiastic. Rejoice and hope. Be patient during trouble. Keep on praying. Help people in need. Welcome them into your home.\nBless those who persecute you. Be happy with those who are happy. But be ready to weep with those who are weeping.\nGet along with others. Don't be proud. Don't be a know-it-all.\nLive up to your title as the honorable.\nI remember when I first got elected, my wife wondered who this male,\nwho all this male was coming to, that addressed to some guy called the honorable.\nDo everything in your power to be at peace with everyone.\nDon't take revenge. Go out of your way to be kind to your enemy and do good.\ndo good. These are simple tasks, but they're not easy. The only people I know who are\nable to live like this on a consistent basis are those who have a deep and abiding faith\nin Jesus. It is only as we allow him to lead us to guide us and empower us that we can\nlive a life of distinction as described here in Romans chapter 12. So my challenge for\neach of us this year is that we all lean into our faith. And if you're not a person of faith,\nI would challenge you to seriously take a look at the life of Christ and prayerfully consider\nhis teachings. Would you join me in prayer?\nFather, we're grateful for a new day, for a day of beginnings. And Lord, I pray that you would\nwould give us all great wisdom, courage, and the strength\nto live a life of distinction.\nAnd I pray that we would treat each other\nwith great kindness, be very forgiving,\nquick to forgive, be eager to listen and slow to speak.\nAnd so we give this 2022 session to you,\nask you to use it in whatever way\nwhat honor you the most, and we pray all this\nin Jesus' name, amen.\nWould you join me in the pledge?\nI pledge allegiance to the flag of the United States of America, to the Republic for which\nit stands, one nation under God, the indivisible, with liberty and justice for all.\nThank you.\nI want to commend Representative Cantrell.\nI've been known to walk out on preachers before, and I do it again this morning if you went\ntoo long.\nI did pretty good to be a Baptist preacher, didn't he?\nkeepers will please unlock the doors. Chair recognizes the Distinguished\nChairman of the Committee on Information and Audits Chairman Hogan. Thank you\nthank you Mr. Speaker your Committee on Information and Audits has read the\njournal of the previous legislative day and the found it to be correct and\nAnd furthermore, Mr. Speaker, go dogs, go dogs.\nIs there any objection to the confirmation of the journal?\nThe chair here is none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 15th of his following, he establishes the order of business in their\nfirst part of the period, unanimous consents, introduction of bills and resolutions, first\nreading and reference of house bills and resolutions, second reading of bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day?\nThe chair here is none in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse bill 843, by rep.\nin the 54th of the building,\nTodd will act to amend\nArticle 2, Chapter 5 of the Title 48.\nThe official go to George Annotator\nrelating to property tax exemptions.\nWays and memes.\nHouse Bill 846 by Representative Smith\nof the 41st of the building,\nTodd will act to amend Chapter 6 of the Title 40.\nThe official go to George Annotator\nrelating to uniform rules of the road.\nPublic safety and homeland security.\nHouse Bill 847 by Representative Smith\nof the 41st of the building,\nTodd will act to amend Chapter 1 of the Title 34.\nThe official go to George Annotator\nin the general provisions of labor and industrial relations.\nIndustry and labor.\nHouse Bill 848 by Rose.\nAnd it's Smith the 41st of Building Title Act of Amend.\nI'm act to amend Article 15 in Chapter 6 in Title 40\nto fiscal to Georgia and annotate\na relating serious traffic offenses.\nJudiciary non-civil.\nHouse Bill 849 by Rose.\nSmith the 41st of Building Title Act\nto amend Code Section 1975 to the fiscal to Georgia and annotate\na relating to reporting of child abuse.\nIndustry and Labor House will eat 50 bummers of remainder of the 56 ability to add an act to amend chapter four title one\nThe fish go to Georgia annotated relating holidays and observances special rooms\nHouse will eat 51 by representative sky to the 76 co-field is 60th Wilkins in the 38th\nDavis to the 87th in the cloud of the hundred and fifth\nBuilding a title an act to amend article in the chapter one of title 42 the fish go to Georgia annotated relating relating to inmate\nPolicies public safety and homeland security\nHouse Bill 852, member of the Senate of the 76th,\ngo field of the 60th, Wilkinson of the 38th Davis\nof the 87th and McLeod of the 105th.\nBill Bittott of an act to amend Article 2,\nchapter 4, title 42.\nWill the official go to Georgia, annotated relating\nthat conditions of detention.\nPublic safety and homeland security.\nHouse Bill 853, member of the Senate of the 76th,\ngo field of the 60th, Wilkinson of the 38th Davis\nof the 87th and McLeod of the 105th.\nBill Bittott of an act to amend Article 1 of chapter 10,\nTitle 17, the official go to Georgia annotator,\nrelating the procedure for sentencing\nand imposition of punishment.\nJudiciary non-civil.\nHouse Bill 854 by Rose.\nI'm Jones, the 25th Bill of Utah\nand act to incorporate the city of Buckhead City.\nGovernmental affairs.\nHouse resolution 529 by Rose,\nthe 930 throws the 120th corporate of the 174th.\nDubnic of the 29th and LaRickey of the 169th.\nResolution expressed in concern regarding\nNational Park Services Special Resource Study.\nGame Fish and Parks.\nThat completes First Readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 829 by Representative Chatted 176, Gunter, 8th, 33rd, Kelly, 16th, the Bill,\nrelating to general provisions regarding trial juries.\nHouse Bill 830 by Representative Erwin of the 28th, Goggance of the 14th, Gunter, 8th,\nWashburn of the 141st road to the 120th, bill relating to general provisions regarding the sheriff's house bill A31 by represent Carpenter of the 4th bill relating to alcoholic beverages house bill A32 by represent the 176th country of the 8th lever to the 33rd, Kelly of the 16th bill relating to health records house bill A33 by represent the win of the 89th Scofield of the 60th level of the 99th park with the 101st Marin of the 96th and others the bill relating to motor vehicles and traffic house bill A34 by represent Newton of the 123rd hatchet of the 150th bill\nrelating to reports to the Department of Community Health, House Bill 835 by Representative Mitchell of the 106 more of the 95th\nMcLeod of the 105th Park of the 101st Canard of the 102nd Second Others are bill relating to municipal taxation, House Bill 836\nby representatives of the 61st Basemore, the 63rd Canon of the 58th Wilson of the 80th Body of the 62nd Others\nThe bill to amend and act to provide any charter for the City of Atlanta, House Bill 837 by Representative Limit the 99th Mayor of the 56th\nA bill relating to add the law and taxation of property.\nHouse bill 838 by Representative Fleming of the 121st Bill relating to Georgia Legislative Retirement System.\nHouse bill 839 by Representative Thomas of the 39th Wilkinson of the 38th Allen of the 40th.\nThe Nolo which is the 42nd Bill to provide a charter for the City of Maybelton.\nHouse bill 840 by Representative Carson of the 46th Allen of the 40th.\nThe Bill to incorporate the City of Vining's House bill 841 by Representative Dollar of the 45th Cooper of the 43rd Bill to incorporate the City of East Cobb.\nHouse Bill 842 by Representative Lim of the 99th and Thomas of the 65th of Bill will lead to county governing authorities House Bill 844 by Representative of the 6th of Bill relating to local government House Bill 845 by Representative Kirby of the 114th of Bill relating to Georgia legislative retirement system House resolution 522 by members of Canada 58th, Thomas of the 39th resolution expressing the sense of the Georgia General Assembly that child safety is the first priority of custody and visitation edg vacations Senate Bill 8284 by Senator\nSenator Sims of the 12th, the bill to amend an act to create a board of the elections of registration for Randolph County through second readers.\nWe have no privilege resolutions today.\nWe do have some housekeeping matters we need to take up and the chair would ask the clerk to read House Resolution 568.\nHouse Resolution 568 by Burns the 159th, a resolution to notify the Senate that the House\nof Representatives has convened.\nChair recognizes the majority leader of the House, leader Burns, to speak to the resolution.\nThank you, Mrs. Speaker.\nHappy New Year, colleagues.\ncan trail you prove that fact is stranger than fiction when you are praise\nGeorgia and said go dogs so thank you for that message that was inspiring well\nwe're in for a two-minute drill here so I'll be briefing to the point as we\nalways have to do we we need to make sure that the Senate is able to turn the\nlights on over there and get to work because we're here working and they're\nthinking about coming here so I'd ask for your approval on this resolution\nMr. Speaker, that notifies the Senate that the House is at work and ready to do business.\nAny questions I'll take them if not, I'll ask for your approval.\nThank you, Mr. Speaker.\nYou have no questions.\nIs there any objection to the adoption of House Resolution 568?\nThe chair here is none.\nThe resolution is adopted.\nThe clerk will read House Resolution 569.\nResolution 569 by resident burns 159th, a resolution calling a joint session of House of Representatives in the center for the purposes of hearing a message from the governor.\nChair recognizes the majority leader of this house to speak to the resolution.\nThank you, Mr. Speaker.\nColleagues, as our tradition is, that we will continue that tradition.\nWe will invite the governor to be here on Thursday and speak to a joint session of this house\nand the Senate and this chamber at 10.45 AM.\nWe will extend that invitation to the governor and we know he'll be here.\nSo I'll ask for your approval in this resolution.\nYou have no questions?\nIs there any objection to adopting House Resolution 569?\nThe chair here's none in the resolution is adopted.\nClerk will read the caption to House Resolution 570.\nHouse Resolution 570, Governor of the Board of Governments, number 59, the resolution\nfor elected to meetings and adjournments\nin the general assembly.\nChair recognizes the majority leader\nto explain the resolution.\nThank you, Miss Pickard, the last one,\nand maybe the most important.\nI think all of you have had an opportunity\nto look at this resolution\nand look at this scheduling resolution\nthat gets us started.\nAnd I think it's very safe, explanatory.\nand I appreciate the staff helping releasing this earlier\nand so everyone could have a chance to study it\nand schedule appropriately\nand the conditions that we're all operating\nnow they're extraordinary so we were able to get this out.\nMiss Speaker, I'm not going to explain this resolution\nis obvious and if there's a question I'll take it\nbut if not I'll ask, no questions I'll ask\nthat we approve House Resolution 570.\nI will scheduling resolution\nso we can get it back over to the Senate.\nWell, in essence, we're out tomorrow.\nWe come in at 11 on Wednesday because there\nwould be a lot of people trying to get back from the event\nat the Fox Theater that morning.\nAnd then Thursday and Friday, we come in at 10.\nAnd then we're out next week, as we traditionally\nare for budget hearings, come back in the following Monday,\nTuesday and Wednesday at which time we would expect to take up a new\nadjournment resolution. Thank you miss Pickett. That was a great great\nexplanation. Okay. I mean I think that is a spot on for everything we need\nwe're we're need to accomplish on this resolution. You have a question if you\ncare to yield. I'll take one I'll yield. Chair recognizes representative Wilson to\nyou're right for a question.\nMr. Leader, is it not true that we'll be out tomorrow so we can all appropriately celebrate\nmy birthday?\nWell, Representative Wilson, I think you and I were the only two people that were aware\nof that.\nI kept that a secret so there wouldn't be a problem so we could make sure we had tomorrow.\nHappy birthday.\nDepends on where you're going to be representative Wilson.\nMiss Speaker if I may be allowed one more comment.\nWe want to wish everyone from this state and all the fans Georgia Bulldog fans safe travels\nand to bring home another championship trophy to the state of Georgia as we celebrate\na win tonight, and we know the dogs are going to do great.\nEveryone be safe, and there are travels,\nand certainly we'll be celebrating tonight and tomorrow.\nThank you, Mr. Meeker.\nI ask for the favor of consideration\nof this House Resolution 570.\nWell, the chair's been made aware that there's a lot\nof laptops in Indianapolis open this morning\nas people are watching the live stream of this session.\nSome laptops won't get open until probably late this afternoon after a 9 on the\ntown but in any event is there any objection the House resolution 570 the\nchair here's none in the resolution is adopted we have three birthdays today\nrepresentative Karen Bennett celebrating a birthday. Representative Betsy\nHolland. Representative Beth Camp we're gonna go ahead and we have some birthdays\ntomorrow. In case you didn't know, it's Representative Wiltson's birthday as\nhe's broadcast to us. It's also Representative Derek Jackson's birthday, and\nRepresentative Houston Games is not here I'm not sure the reason for his\nabsence but I'll check that out later today. All right we have no\nannouncements today chair recognizes the majority leader of this house for a\nmotion. Thank you, Mr. Speaker. Mr. Speaker, I move that this\nhouse stand adjourned until 11 a.m. Wednesday, January the 12th, 2022.\nAll those in favor of the motion will say, uh,\nPotion will say aye, those opposed will say no.\nThis house will be adjourned until Wednesday, January 12th,\nat 11 a.m. and Go Dogs.\n.\n.\n.\n.\nYou\nYou\n",
  "updated_at": "2026-02-11T21:09:11.287288+00:00"
}