{
  "video_id": "N7VOI65o50c",
  "url": "https://youtu.be/N7VOI65o50c?t=940",
  "title": "Georgia House - Day 10 (2026-02-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-02-03",
  "duration_minutes": 76,
  "summary": "Here is a summary of the Georgia House session on 2026-02-03 in structured markdown format:\n\n# Georgia House - Day 10 (2026-02-03)\n\n## Overview\nThe session featured a devotional and prayer led by Pastor Lee May, who encouraged the representatives to live out their faith through practical actions and to seek wisdom from those with different perspectives. No substantive legislation was discussed.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Pastor Lee May delivered a devotional message, emphasizing the importance of faith combined with action, and seeking wisdom from diverse sources.\n- Rep. Darshan Kendrax introduced Pastor Lee May, noting his background in local government and ministry.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe speaker called all members to the floor to establish a quorum before proceeding with the day's business.\n\n## Adjournment\nThe session adjourned, with the next meeting date unspecified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n.\n.\n.\n.\nYou\nYou\nYou\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nAll members will, please come to the floor.\nAll members, please come to the floor.\nThat's Clark, will you ring the bell?\nAll members, all members please come to the floor and take your seats.\nWe're about ready to kick Monday morning off.\nThe hour for convening having arrived, all members will please come to the floor and take\ntheir seats.\nMr. Clerk, I think you've already rung the bell.\nSo we're ready, we're going to have the morning roll call, all members present will please\nvote green to signify your presence in the chamber, and Mr. Clerk, will you unlock the machines?\nAll members are voted, I say you take your time.\nAll members voted.\nIf so, Mr. Clerk, where you lock the machine, door keepers, you'll close the doors and keep\nthem closed.\nAs is our custom, we will begin our day with scripture reading in prayer by the chaplain,\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning has been with him many times, brotherly.\nOh a couple anyway many times and always brings a great message of devotion we appreciate\nhim. Our chaplain this morning will be introduced by the lady from the 95th House District\nrepresented Darshan Kendrax. Representative Kendrax.\nThank you Mr. Speaker and good morning colleagues. The last time that Pastor Lee May from Transforming\nfaith church was here, he delivered a great message. In minutes after he got down from the\npodium, I got an email that stated that all $179,000 of my student loans had been forgiven.\nSo no pressure pastor. I don't know what message you're bringing, but you can do it again.\nBut Pastor Lee May graduated from CAU and Emery University obtaining a master's degree in\ntheology and for over ten years his life has been about service.\nHe is the former owner of an eight screen movie theater in DeCabb County and in 2006\nPastor Lee May entered the world of politics by running for DeCabb County Commission in\nGeorgia and in 2013 he was appointed to be the chief executive officer for the\ncab county. In both positions Lee was and still remains the youngest person in\neither role in the history of the county. He's the son of a retired pastor and\nin 2017 pastor Lee answered the call with his lovely wife Robin who swore me\nin this term and transforming faith church was launched and he is the\nconstituent of the best district here in the state of Georgia, House District\n95. So welcome my pastor, Pastor Lee May.\nGood morning, good morning, good morning, and with that introduction there's no\npressure, right? Just about 176,000 I think she said. Yeah, it is always always\nalways good to be here in the Georgia State House of\nRepresentatives. I don't take it lightly or for granted that\nGod has allowed me to stand on platforms like this and to\nspeak a word that prayerfully would be of some encouragement to\nyou in your role as men and women first, maybe as husbands and\nwives, maybe as parents, fathers and mothers, and just great\nleaders here in this state of Georgia. Again, my name is Lee\nI am the pastor of Transforming Faith Church on the east side in the cab county in the city of Stonecress and yes\nI do believe I have the best state representative in the nation. I just love us so much because\nHe's also a member of Transforming Faith Church and a faithful Thai member.\nYes. Yes. Yes. Well, let me get started in the remaining 45 minutes that I have with you.\nI mean, I'm sorry, five minutes that I have with you all today. It is truly an honor and\na privilege to be here to you all. Good morning. You all good morning, Mr. Speaker. John Burns,\nto all of the leadership, to our house delegation and the cab county and to all members here\nof this great body and to all who were gathered here this morning.\nIt truly is an honor and a privilege to stand here before you and just really lean\ninto something that I ministered on yesterday.\nYesterday we had an opportunity to ordain three new deacons at our church, three deacons.\nWe were so excited about that and I communicated to the church that the word deacon in the new\nTestament. I am a Christian pastor so I speak from that context in the New Testament of the Bible.\nThe word deacon in Greek means deaconos. That's the word deaconos. And it simply means servant.\nI believe this morning I'm talking to a house full of deacons because you have signed up to be\nservants of the people of God. You have signed up to serve people that look like you, talk like you.\nYou've signed up to be leaders of people that look nothing like you.\nShare very little in common with you.\nYet we have all, you have all been called to serve God's people.\nI preached yesterday from the book of James,\nthe book of James and the second chapter.\nThe book of James was written by none other than James.\nNow for some of us this morning you may not know this,\nbut James was actually the brother of Jesus.\nCan you imagine that? Your brother. Your blood brother is the son of the most high. He's the Messiah.\nHe's been called to save this world from the penalty of his sins, but he ended up following being a\nfollower of his brother after his death. And James was a leader of the church in Jerusalem. This\nis just a little Bible study for you this morning. James was a leader of the church in Jerusalem,\nand he would write letters of help, of recommendations,\nhow you ought to live your life as well.\nAnd James penned this in James chapter 2, verse 17.\nHe says this, thus also, faith by itself,\nif it does not have works is did.\nHe combined, he married two words.\nHe married faith and works.\nHe said, if you have faith, you can't help but have works in your life.\nThat means what you say you believe, what you say is your belief system,\nyour values, your core values.\nYou can say it, you can believe it all you want to, but if you're not living\nit out in actionable ways, then really your faith might as well be dead.\nYour might as well not even say you're a believer of whatever faith that you say\nthat you entrust in.\nHe says faith without words is dead.\nAnd I know I'm speaking to a house full of people\nthat may share the same belief system.\nYou may have differing faith values as well,\nbut this is what I do.\nI do believe in the goodness of humanity.\nAnd in the goodness of humanity,\nregardless of what your faith perspective is,\nWe are all called as humans to live out our core values\nand to live it out in very actionable ways.\nAnd so this morning, as we are living out our faith\nthrough our actionable works,\nI want to encourage us in this.\nThere's a proverb in Proverbs chapter 11 verse 14.\nIt tells us this, where there is no council,\nthe people fall.\nbut in the multitude of counselors, there is safety.\nLook, wisdom, y'all, is found when leaders seek input.\nWisdom is found when you go and seek wisdom\nfrom people that may share your same perspective,\nbut they may share a different perspective from you.\nAnd this morning, I would just encourage us,\nif you leave here with one thing, you'll say,\nokay, I wanna make sure that every day\nthat as I'm living, as I'm serving, as I'm leading,\nthat I am living out my faith\nin very practical and tangible ways.\nBut the second thing I want to encourage you all to do\nis this, is to seek wisdom from others\nthat may not share the same perspective as you.\nBecause I would say that there is wisdom in all of us.\nWhen we started our church, transforming faith church,\nI took out every pastor that I could,\nbecause I've done a lot of things in my life,\nbut I had never started a church before.\nSo I took pastor after pastor out to lunch\nand said, hey, can you just share with me\nyour wisdom in launching your church.\nNow, when I invited these pastors out,\nI invited big pastors,\na big church's pastors who served smaller churches, pastors,\nwho I absolutely love their ministries, pastors,\nwho I didn't wanna duplicate anything that I saw them do.\nI didn't want to do anything, no, but I did believe\nthat there was still value in the wisdom\nthat they could provide.\nWould you all just think about that as you leave out\nand do your work today?\nLet me go, look across the proverbial political aisle\nand say, hey, Mr. Democrat, Mrs. Republican,\nMr. Republican, Mrs. Democrat,\nlet me, let me, let's go to lunch and let's talk.\nLet's talk about what I believe is our shared and joint goal,\nwhich is to lead on behalf of the people of Georgia.\nAnd can we figure out how we can work together\nto establish, create legislation,\nto strengthen legislation on the behalf\nof all of God's people here on earth?\nI think if we do that,\nyou all will literally live out the call\nof the faith of your life.\nAnd I believe that God would truly, truly be pleased\nwith your work here as servant leaders here in Georgia.\nWell, that's all I got for you today.\nMay God bless you.\nMay God keep you.\nMay God forever smile upon you as well.\nNow would you rise and stand with me as I pray\nand then immediately following this prayer,\nmaybe we can do the pleasure of allegiance together.\nIs that okay with you this morning?\nGod, we thank you.\nWe thank you that you have entrusted\nso many people to serve your people through leadership.\nGod, we don't take it lightly or for granted\nthat even in this capital,\neven in these halls of power God,\nyou've entrusted men and women\nto lead on behalf of your children.\nGod, would you give supernatural wisdom\nin each and every person here today?\nGod, as they would lead,\nthey would lead even beyond their capacity.\nGod, I pray that today that you would soften\nthat as people go about doing their work, God,\nthat they would reach out across the aisle\nand say, how can we work hand in hand\non behalf of the people that you've entrusted us to lead?\nGod, would you bless all of the life circumstances\nof everyone in this building?\nGod, would you bless their finances?\nWould you bless their relationships?\nWould you bless their career paths?\nWould you bless their health?\nGod, bless everything that concerns them.\nAnd God, I believe that your people will give you all the glory, all the honor, and all\nthe praise, because you have been a great, great God.\nGod, I pray this prayer in your Son, Jesus' name, amen, amen, and amen.\nWhen we say the pledge of allegiance together, I pledge allegiance to the flag of the United\nStates of America and to the Republic for which it stands, one nation under God, indivisible\nwith liberty and justice. God bless you all.\nThank you.\nNow brother Lee you can't go the way yet if you had that kind of good fortune for\nRepresentative Kendrick's there's a chair of appropriations right down there\nMatt Hatchet. Chairman Hatchet I want you to circle up here with brother Lee if\nwe work on this budget. He's got that kind of strength and he's going to be\nstrong. Thank you brother Lee. Doorky but you may unlock the doors members you\nYou can join Brother Lee in the south any room.\nShow him your appreciation of being here.\nOur doctor of the day, today is brought to us by Chair Lady Katie Dempsey from up at\nRome of the 13th House District, District Dr. Brad Bushnell.\nWe appreciate him being with us and give him our thanks and he's down to the aid station.\nIf you need him, call on God to Bushnell.\nChairman Hilton, the chair of the Committee on Information and Audits has recognized\nChairman Hilton.\nGood morning, Mr. Speaker.\nHope you had a wonderful weekend.\nYour Committee on Information audits has read the journal of the previous legislative\nday and found it to be correct.\nWe do have a great weekend.\nChairman Hilton.\nChairman Hilton, the Chair of the Committee on Information\nand Autists reports that the Journal of the\nPreviously Study Day has been read and found to be correct.\nIs there any objection to dispense with the reading\nof the journal?\nThe Chair, here's none.\nThe reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nChair, here's none, and the journal is confirmed.\nMr. Clerk, will you read their resolution establishing\nthe order of business for the day, Mr. Clerk?\nRepresentative Restoration of the 104th Moose Phylum\nBe Established, it's the order of business\nto earn their first part of the period unanimous\nconsents in production of bills and resolutions,\nfirst reading in reference of house bills and resolutions,\nsecond reading of bills and resolutions, morning orders.\nHe is there any objection to the adoption of the resolution establishing the order of\nbusiness for the day.\nChair here's none and the resolution is adopted.\nFirst reading the bills and resolutions the clerk will read.\nHouse Bill 192 by represent of Gamble the 15th McDonald's 3rd of the 26th honor of the\nthird, Duke Nick of the 29th, way to the 9th.\nBill B. Toddled back to a men, Toddled 20, the physical to\nGeorgia, and it's ended relating to education.\nEducation House of 193, Barbara, I've said it more than\n91st, to build me, Toddled back to a men, Toddled 31 of the\nphysical to Georgia, and it's ended relating to health.\nJudiciary House of 194, Barbara, the 20th, Cahoyan, the 81st,\nRidley, the 22nd, Horner, the 3rd.\nBill being titled act to amend Article 2 of Chapter 3,\nTitle 16 of the Fisher go to Georgia Annotated,\nrelating to justification and excuse.\nJudiciary non-civil.\nHouse Bill 195, I must admit.\nRidley, the 22nd, Ridley the 6th,\nHorner, the 3rd, Tarvern of the 2nd,\nreads the 99th and others.\nBill being titled act to amend Code Section 52-725\nof the Fisher go to Georgia Annotated,\nrelating the enforcement of rules and regulations.\nJudiciary non-civil.\nClass of 196 by Representative Kelly the 16 Taylor the hundred seventy third hatch to the hundred fifty-fifth\nHeagley the hundred and forty-first\nJasper's the eleventh and others\nBill Meetato act to amend part one of article one of chapter 18 it out of forty-five with the physical to Georgia\nAnnotated relating the state employees health insurance plan\nHilt House Bill 197 by Repson of Hawkins the twenty-seventh Newton in the hundred twenty-seventh Kelly the sixteen silcox the fifty-third\nthe third, Cooper, the 45th and others,\nBill B. Todd and act to amend code section 3346,\nsix of the physical to Georgia annotated,\nrelating the requirements for certification.\nHealth.\nHouse Bill 198, by Wilson Chastain,\nthe seven of the frustration in the 104th,\nor one of the 32nd Chasprice of the 11th,\ngone through the eighth and others,\nBill B. Todd and act to amend chapter two,\na total 20 of the physical to Georgia annotated,\nrelating elementary and secondary education.\nEducation.\nHousehold 199 by reps of Kelly the 16th Reaves, the 99th gull of the 19th Gunther or the 8th\nPark of the 107th and others.\nBill Vittata, an act of men chapter 5, a title 15 in the Fischercoda, Georgia, Anitator\nRelated, Administration of Courts of Record Generally.\nJudiciary.\nHousehold 200 by reps of the base, more of the 69th Baller, the 147th, the Hugley, the\n141st Miller, the 62nd Jones, the 25th and others.\nWill be taught an act to a men chapter two, a total 20 of the fish go to Georgia and\nattendee relating the elementary and secondary education, education, hospital 201 by\nreps and a bell of the 75th Hagan and the 156, Hodelson and the 72nd, stints into the\n150th cocks of the 28th, Will be taught an act to a men, four chapter two, a total 26\nof the fish go to Georgia and attendee relating to advertising and sale of meat generally.\nColtrin consumer fairs possible 202 by reps and a hilton of the 48 Jones of the 47th\nDubnick of the 29 Jones of the 25th rise to the 139th and others.\nBill B. Todd and Acto men article 31 in chapter 2 entitled 20 of the physical to Georgia\nannotated the charter schools act of 1998.\nEducation House Bill 203 by reps and a griffin of the 149th, you believe the 141st miles\nof the 126 jacks and the 128th Williams on 68th and others.\nwill be titled an act to a men part one of our two chapter three,\na title 20 of the fish go to Georgia,\nannotated relating to board of regions.\nHigher education, hospital 204 by resident of Washburn,\nthe 144th, Apollo, the 33rd, Ridley, the sixth Ridley,\nthe 22nd, airheart of the 36th,\nbill be titled an act to amend part two,\npart three, chapter one, and title 40,\nthe fish go to Georgia,\nannotated relating to certification of motor carriers motor vehicles\nBill 205 by ropes and a Clark 100th gains 120th Jones and 25th Crow with 118th green and 154th and others\nBill B. Todd will act to amend chapter one and title six an article two a chapter three a title 3080\nThe kiss go to Georgia annotated relating the general provisions relative to aviation\nPublic safety and homeland security hospital 206 by ropes and a bell is 75th Ridley the 22nd Clark with a hundredth Clark with a hundred nath\nJackson the hundred sixty-fifth and others.\nBill B. Todd of an act to amend title 20.\nThey fish go to Georgia annotated relating to education.\nHigher education House Bill 207 by reps on a Crawford of the 89th\nOliver of the 84th Westbrook of the hundred sixty-third.\nWillis of the fifty-fifth hour of the fiftieth.\nA bill to be titled act to amend part three of Article four chapter 11.\nA title 16 of the fish go to Georgia annotated relating to carrying and\npossession of firearms.\nPublic safety and homeland security House 1208 by resident Smith of the 70th Corp. of the\n174th Stevens on 64th per chat of the 176 roads 124th and others will be taught on\nact to men code section 40 to 86 of the fish go to Georgia annotated related license plates\npromoting a supporting certain agencies motor vehicles House 1209 by resident Roman of the 97\nwith Hawkins the 27th hour of the 50th camp with 135th,\nthere'll be Todd and Acto Mench after 11,\nTitle 31 of the fish go to Georgia,\nAntietta, Rolington, emergency medical services.\nHilt.\nHousehold 210 by reps and a Smith of the 18th\nCarpenter of the 4th, Hagen in the 156, Franklin in 160th\nCannon in the 170 second and others,\nthere'll be Todd and Acto Men, Title 3\nof the fish go to Georgia, Antietta relating\nto alcoholic beverages.\nYou're regulated industries.\nHouse Bill 211 by Rebson of Carpenter in the fourth,\nRidley the sixth,\nTarvern in the second,\nBarton in the fifth,\nCameron in the first.\nBill B. Todd in Acto in Acto in Acto 51\nof the fish go to Joe Janitator relating the torts.\nJudiciary.\nHouse Bill 212 by Rebson of Park in a hundred and seventh,\nMiller in the 60 second,\nTreadon in the 85th,\nRoman in the hundred of the 97th,\nHerring in the hundred and 45th,\nand others.\nBill B. Todd in Acto in an article two,\nfor seven in total 40 80 the fish go to Georgia annotated relating the\nimposition rate computation exemption and credits for income taxes. Ways and\nmeans House Bill 213 members in a park of the hundred and seven Miller the\nsixty second runner the eighty fifth row into the ninety seven herring and\nhundred forty fifth and others. Bill Nito an act of an article two\nseven in total 48 of the official go to Georgia annotated relating the\nimposition rate computation exemptions and credits from income taxes. Ways and\nremains 2-14 by reps and a bill the 75th carper to the 4th. Willis the 55th. Clark the 100\nand 8th. Neil the 79th. Bill B. Todd and act to men code section 24 at 9-9-23. The fish\ngo to Georgia annotated relating the admissibility of photographs.\nJudiciary non-civil. House bill 2-15 by reps and a mob clown of the 17th. Fleming the\n114th. Towns of the 79th. Ballinger the 23rd. Jasper's the 11th and others. Bill B. Todd\nan act to amend chapter two in\ntotal 21 of the fish go to\nGeorgia and attend a relay in\nthe elections in primaries\ngenerally.\nGovernmental affairs, House\nbill 216 by Ripson and Smith\nthe 138th Burns and 159 Jones\nthe 25th rise to the 139th\nHugley the 141st and others\nbill be taught an act to amend\nchapter 7 and total 50 of the\nfish go to Georgia and\nattend a relay in the\nDepartment of Economic\nDevelopment.\nEconomic development and\ntourism.\nHouse resolution 117\nI remember it was go for you to the 63rd but now the 77th Jackson the 68th Davis of the 87th Scott of the 76th\nresolution acknowledging it\nInequality and public health issues and supporting\nBIPOC communities disproportionately affected by systematic barriers\nspecial rules\nHouse resolution 118 by resident Evans the 57th Miller the 62nd Alaliay the 59th\n69th, welcome to the 101st, resolution compensating Mr. Michael Wolfe.\nAppropriations.\nHouse resolution 119 by revs of the Evans, 57th Miller of the 62nd,\nAlaliay the 59th, welcome to the 101st, a resolution compensating Mr. Marrails Ditchco.\nAppropriations.\nHouse resolution 120 by revs of the holly, the 116th, Perry, the 56th, Santos of the 117th,\nMcQueen is 61st, a resolution proposing a amendment to the Constitution to\nstate of Georgia. Special rules house resolution 121 by reps of camp on\n135th made the act of the 82nd Smith of the 70th, Jenkins on 36 and Dickie the\n134th resolution recognizing Mr. John W. Mixon and dedicating a building in his\nhonor. State properties that completes first readers.\nSecond reading the bills and resolutions the clerk will read House bill 164 by\nreps and meeks of 178 hanging on the 156 bucks of the 137th decade of the\nhundred and 34th can and the hundred and 72nd others and bill related to\ndimensions and weight of vehicles and loads House bill 165 by reps and\nfrankly the 160th Friday thus 120 second Williams of the 168 workers of the\n157th, Cameron of the first and others, a bill relating to revenue and taxation, House Bill 166th, by represent Franklinville 160th,\nCorridor the 174th, Hagen of the 156th, Buckner of the 137th, Smith of the 138th and others, Bill relating to holidays and disturbances.\nHouse Bill 167, by represent Hagen of the 156th, frustration of the 104th, Canada of the 172nd, Dubnick of the 29th,\nOsteen of the 169th, and Bill relating to hunting, House Bill 168, by represent Warner of the 3rd, Kelly of the 16th, Canada of the\n172nd would leave the 6th camp of the 135th and others a bill relating to county special purpose local option sales tax\nHouse bill 169 by represent Canada of the 170 second\nDickey of the 134th corporate of the 174th Osteen of the 169th Huttleston of the 72nd others\nIt bill related to general provisions for advalorem taxation or property\nHouse bill 170 by represent mathiac of the 82nd Hawkins of the 27th green of the 154th Jones of the 143rd Taylor of the 173rd\nIt bill relating to authorization and general requirements for transaction of insurance\nHouse Bill 171 by Representative Thomas of the 21st,\nJones of the 25th,\nJones to teach you the 105th,\nHagen of the 156th,\nCarson of the 46th and others,\nAbel with ladies and general provisions,\nrelative to obscenity and related offenses.\nHouse Bill 172 by Representative Hodleston of the 72nd,\nFstration of the 104th,\nthey give the 134th,\nFriday of the 122nd,\n4th of the 170th,\nAbel relating to state veterinary education,\nHouse Bill 173 by Representative Taylor of the 173rd,\nCooper of the 45th,\nNewton of the 127th, Green of the 154th,\nsenior 169th and others to bill relating to student health and elementary and secondary education.\nHouse bill 174 by reps and baller to the 147th Jones of the 143rd to bill to authorize the municipal court of the city of Centerville to charge a technology fee.\nHouse bill 175 by reps and Jones of the 25th, Irwin of the 32nd, Duke of the 29th, Wilkinson of the 38th, Dempsey of the 13th.\nBill relating to early care and learning, House Bill 176 by representative Smith of the 18th,\nGuntran, the 8th Evans of the 57th Miller of the 60s, a bill relating to appeal and error.\nHouse Bill 177 by representative Cooper, the 45th silk ox of the 53rd Carpenter, the 4th reads of the 99th new in the 40th of the bill relating to domestic relations.\nHouse Bill 178 by representative Cooper, the 45th hulkins of the 27th Stevens of the 164th Taylor of the 173rd,\nThe winner of the 85th, the bill relating to medical assistance, House Bill 179, by reps of Smith of the 18th,\nHong of the 103rd, lever to the 123rd, Gunter of the 8th, Evans of the 57th, a bill relating to appellate practice.\nHouse Bill 180, by reps of Smith of the 18th, Scottons of the 14th, Kelly of the 16th, Hong of the 103rd, Gunter of the 8th, and others.\nA bill relating to probate courts, House Bill 181, by reps of airheart of the 36th, camp of the 135th,\nof the 48th on 2G, the 105th,\nstill comes in to 53rd,\na bill relating to vital records.\nHouse Bill 182 by reps of the Blumson of the 12th,\nTaylor of the 173rd,\nCanada of the 172nd, Williams of the 112th,\nPrince of the 130th second,\na bill relating to life insurance,\nHouse Bill 183 by reps of the C-Ball\nof the 34th, Cali of the 16th,\npreves of the 99th,\nAustralia of the 104th,\nProbe of the 118th and others,\na bill relating to rights, duties,\nand liabilities of inkeepers.\nHouse Bill 184 by reps of the 12th,\nProbe of the 118th, Williams of the 112th,\nPrince of the hundred and thirty second hitches of the hundred and sixty first to build relating to motor vehicles and traffic and property House Bill 185\nMy representative airheart of thirty six and Powell thirty third to build relating to professions and businesses House Bill 186\nMy representative Ridley of the twenty second Jones of the forty seventh Ridley of the six four to the hundred and seventy\nIt's Williamson of the hundred and twelve and others to build relating to alternative ad lore and taxation of motor vehicles and title and lore and tax fee\nHouse Bill 187 by represent Washburn of the hundred and forty fourth Powell the thirty third McDonald the twenty six\nCarpenter the fourth McCollum of the 30th and others a bill relating to buildings and housing commerce and trade local government\nProfessions and businesses and public utilities and public transportation\nHouse bill 188 by represent the limit of the 98 98\nHulking the 101st left under the 83rd a bill relating to criminal procedure domestic relations and property\nHouse bill 189 by represent the limit that 98th Carpenter the fourth left under the 83rd a bill relating to notaries public\nHouse bill 190 by represent the 98th Davis of the 87th and left under the 83rd a bill relating to regulation of specialized land transactions\nHouse Bill 191 by reps of more of the 91st coming sub of the 39th\nCrawford of the 89th part of the 107th Wethbrook of the 163rd\nand others, a bill relating to family violence. House resolution 96 by\nreps of more of the 91st and Crawford of the 89th resolution recognizing\nDr. Gregory B. Lava senior and dedicating a road in his honor. House\nresolution 97 by reps of the green of 154th down to who the 31st Smith of\nthe 41st workies of the 157th Hilton of the 48th resolution authorizing\nconveyance of certain state-owned property. House Resolution 98 by\nRep. Green of the 154th, down to the 31st, Smith of the 41st,\nworkheys of the 157th, Hilton of the 48th, the resolution\nauthorized into the granting of non-exclusive easements. House\nResolution 99 by Resunisco Field of the 63rd, Cugley of the\n141st, Davis of the 87th, Canada of the 58th, Scott of the 76th,\nResolution proposed the amendment to the Constitution, so\nas to provide that the General Assembly shall be authorized to\nprovide by law and expend or authorize the expenditure of\npublic funds for baby bond savings programs without the need\nfor benefit in return.\nHouse Resolution 100, by Rep. Scott Field,\nthose 63rd Drenner, the 85th Davis,\nand the 87th Scott 76th, and Tran of the 80th.\nResolution creating the House Study Committee\non the Accumulated Impact of Pollution\non Economic Development and Growth,\nthree-second readers.\nMembers if you will please take your seats we will move on to morning orders\nWe have no reports of standing committees members, please take your seats\nWe have some folks in the gallery we want to recognize\nMembers please take your seats\nYou can see your conversation, you can go to the any room, take a choice.\nRepresentative Devin Sebaugh, the gentleman is recognized for a morning or order representing\nSebaugh.\nThank you, Mr. Speaker, if the Cobb delegation wants to come down.\ndelegation to join Representative Sebaugh to be appreciated. Give him just a\nsecond, sir. Thank you, Mr. Speaker. Members of the General Assembly, I rise\ntoday to recognize and welcome a remarkable group of students, teachers, and\nstaff from Mount Pair and Christian School in the Heart of House District 34 in\nCobb County. Mount Pair known for its commitment to academic excellence, strong values, and developing\nfuture leaders, granted in faith and service. These students represent the best of our community\nand their presence here today as a reminder of why we do this to ensure a bright future for\nthe next generation. Colleagues, please join me in welcoming Dean Jeff Diggle and Allison Weiber\nand these outstanding young men and women to the people's house today. Will you please stand?\nThank you, Mr. Speaker. I yield the well.\nGood to have y'all\nI think this is an excused excused absolute it absence isn't there representing Ceball\nGood to have y'all come back anytime. We're we're pleased to see y'all and congratulations on your achievements\nChairman Hatchett is recognized for in a morning order\nColleagues, it's my honor this morning to introduce a group of Dublin Barnes counties\nFinest high school seniors representing every high school in Lawrence County the\nYouth Advisory Council of Citizens Bank of Lawrence County y'all stand up\nand if y'all will help me welcome them to their capital.\nWe appreciate y'all traveling from middle Georgia to be with us.\nThank you for what y'all are doing to be engaged in your schools and with your fellow students.\nSo welcome to the people's house.\nRepresentative Carter, Representative Doreen Carter, who do you want with you?\nWho would you like to be with you?\nRepresentative Bennett and I love Representative Moore.\nMore Representative Bennett.\nAnd Representative Moore.\nRepresentative Moore, good morning.\nShe's on the way but you can kind of get started now.\nI am really, really excited to be able to come and share with you people from our community,\nyes.\nSo today we have students from Latonya High School.\nIf you, okay, you know, I thought you had some little else, and we have students from\nArabia Mountain High School, right here.\nSo Arabia Mountain Bay performed earlier, so they are here today for Georgia PTA Day\nat the Capitol and it's always exciting to be able to have young people to come and\nsee what we do because growing up in the city of Atlanta I don't remember ever coming\nto the Capitol so again thank you guys if you were rise and celebrate these young people\nand they're working on a special assignment for being here with us today thank you parents\nand administrators for allowing them to be here with us we do the well thank you young people\nfor being here and also thank the parrots and folks,\nchaperones, are here with them.\nSo we hope you enjoy your day at the Capitol.\nWe are very proud to have you.\nRepresenting Bell and representing Scott and maybe others.\nClayton County.\nCome on down.\nRepresenting Bell.\nI'll say some more coming, there are representatives.\nToday we would like to give our special recognition\nto the Clayton County members of the PTSA\ncoming from Martha B. Steeleville,\nMundys Mill Middle School, my middle school,\nand Rex Mill Middle School.\nThey're joined today by also Dr. Elyca Anderson,\nthe first chairwoman of Clayton County,\nour school board member, Ben Straker,\nas well as their advisors, Arvis Walker, and Steven Duke's.\nCan you please rise if we look into the people's house?\nthey're very busy. Hey, they'll be here in a minute. Somebody gave you some bad recon\nthere. What mean? We'll welcome them when they get here though. I guarantee you that\nRepresentative Carl Gilear has recognized for a morning order.\nRepresentative Gilear, give the gentleman in the wheel.\nYou're attention, please.\nThank you, Mr. Speaker.\nThis morning, our past of the day\ngave us a great inspiration of scripture.\nAnd there's a scripture that says in the book of Revelation,\nweeping me and do for a night, but joy.\nBut the book of Revelation talks about they shall hunger no more, neither should they\nthirst anymore, for God shall wipe away every tear from their eye.\nIn 1859, there were 429 slaves that were as young as two weeks old, that were sold in\nSavannah, Georgia.\nIt was the largest slave sale in America.\nI come here today with great expectations\nto thank the speaker of the house,\nthe Chatham County delegation,\nand all the members of this general assembly.\nBecause there's another scripture that says,\nweeping may endure for a night,\nbut joy comes in the morning.\nAnd you all helped us pass House Bill 1425.\nYou helped us bring joy in the morning\nto establish the weeping time heritage authority.\nAnd today they're here.\nIt represents tourism.\nIt represents history.\nBut it represents healing.\nAnd so we want to invite you out to Room 216.\nLet us today break bonds of bread and eat together\nand fellowship together and let us heal together.\n216 lunch with the Weeping Times Heritage Authority.\nMr. Speaker, you're welcome.\nThank you, my friend, I appreciate your leadership on this issue and I encourage everyone\nto go by 216 if you're here and celebrate with our friends from Savannah.\nRepresentative Hong recognized for a morning order.\nThank you, Mr. Speaker.\nI'll be presenting a resolution to recognize today as topical steroid withdrawal symptom\nawareness day.\nTopical steroid withdrawal syndrome is a severe and debilitating condition that can arise\nfrom intentional or unintentional exposure to topical steroids.\nTopical steroids are usually prescribed and available over the counter to treat skin\nconditions, including eczema and psoriasis. Oftentimes and with prolonged use, when you\nstop using these topical steroids, the body goes through a withdrawal and recovery can\ntake several months to several years. Some people are bed ridden for several years,\nthey can't work, they can't go to school, they can't take care of children. I want to\nI think Kelly Barta and her group today for bringing awareness to this important topic\nand hope that we can continue to learn more about it.\nThank you, Mr. Speaker.\nThank you, Riverside Hall.\nThank you all for bringing that awareness, keep working, we're glad to join with you.\nThank you all for being here.\nRepresentative Glaze, and she has some other folks going to join her.\nThey know who that is.\nThis is about PTA Day, right?\nAwesome.\nFolks, going to join Representative Glaze at the well.\nLadies recognized, wait a minute, you got one coming.\nNo, two, three.\nThat's good.\nNow you're ready.\nThank you, Mr. Speaker.\nGood morning, my colleagues.\nWe stand to recognize that today is Georgia PTA.\nA day here at the capital at the people's house.\nThis is an organization that continues to stand\nfor the support and rights of our students\nthroughout this state.\nThey are many together, but they are one in unity\nas we continue to move our students\nto be the best in this nation\nand then to return to our state to be the best in this state.\nSo they've asked today that we will continue\nto look at funding our schools through our FTE and our QBE.\nAnd today, we say to you, our response\nis that we want the best for our students,\nand we will continue to do that.\nSo the president, Dana Shanda Ross,\nis here with us, President Elect,\nand two former presidents of the Georgia PTA.\nSo we can stand and just give them a hand of applause\nfor the work that they do all around Georgia.\nThank you, Representative Glaze.\nA great organization, PTA, been around for a while.\nIt does a great work.\nWe're going to move on to a group of privileged resolutions, Mr. Clerk, will you read a group of privileged resolutions?\nRecognizing commending the YMCA is a Georgia for the important work they do in communities across the state.\nRecognizing February 3, 2025 is topical steroid, with the Royal Syndrome Awareness Day at the State Capitol.\nRecognizing February 7th to 14th, 2025,\nas congenital heart defect awareness week at State Capital,\nrecognizing commending Mr. Tim Williams\nfor his outstanding service to Greystone Power,\nas well as the communities and members it serves,\nrecognizing February 6th, 2025,\nas National Guard Day at State Capital,\nrecognizing February 4th, 2025,\nas Georgia Association of Voter Registration\nand Election Officials Day at State Capital,\nRecognizing Commending, Dr. Jane Morgan,\nrecognizing Commending, Dr. Shannon Walker,\nrecognizing Commending, Dr. Antoinette G. Alvarado,\nrecognizing February 2025 as Career and Technical Education\nMonth in February 5th, 2025 as Georgia Career\nand Technical Student Organization date to State Capital\nand recognizing Commending the Georgia Center\nfor Civic Engagement and recognizing the week\nof February 3 through 7, 2025 as National School\nCounseling Week and for other purposes that completes the reading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions\nhearing none the resolution are adopted? Afternoon orders we're going to begin our afternoon\nIn order to represent Carter, represent Carter has a moment in black history.\nRepresent during, Carter.\nIf you give the lady in the will, your attention please.\nThank you, Mr. Speaker.\nIt is an honor to stand before you today as we celebrate black history and the remarkable\ncontributions of those who paved the way for us.\nAmong these trailblazers is the incomparable,\nDr. Carter G. Woodson, a scholar, historian,\nand visionary who dedicated his life\nto ensuring that black history was recognized,\nrespected, and preserved.\nBorn in 1875 to formerly enslaved parents,\nWoodson understood the power of education.\nHe became only the second African-American to earn a PhD\nfrom Harvard University.\nBut despite his achievements, he saw\nthat the rich history of black people\nwas being ignored in schools and textbooks.\nHe knew that people without knowledge of their past\ncould never fully claim their future.\nIn 1926, he launched Negro History Week,\nwhich later evolved into black history month.\nA time to reflect on our heritage,\nhonor our ancestors and inspire future generations.\nBut Woodson's vision was greater than a single month\nof recognition.\nHe believed black history should be studied\nand celebrated every day.\nToday, we continue his mission, not just remembering\nthe past, but ensuring that the stories of black excellence,\nresilience and achievement are woven\ninto the fabric of American history.\nHis legacy calls to educate and power\nand uplift our communities.\nSo as we honor Cardigee Woodson,\nlet us commit to keeping history alive,\nnot just in February, but all year long,\nbecause black history is not just our past.\nIt is our power.\nThank you, I yield the will.\nThank you, Representative.\nRepresentative Tony Miller.\nRepresentative Miller.\nIf y'all will give the lady to wear your attention, please.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI stand here today to announce in honor\none of my members, Representative Esther Panage.\nShe was awarded yesterday with the highest honor, Hadassa,\nthe women's Zionist Organization of America\nwith 300,000 women members and associates nationwide.\nShe received their highest honor,\nthe Myrtle Reath Award for Advocacy,\nHadassah for those who don't know,\nwas nominated for a Nobel Peace Prize\nfor its medical work through two hospitals in Israel,\nthat employ and treat Jewish people,\nArab people, Christian people,\nand everyone in Jerusalem.\nThis is a national honor,\nand we are very proud of Representative Panage.\nThank you.\nThat's all recognized.\nThat's quite the honor.\nThank you, Representative Miller.\nThank you, Representative Panich.\nAppreciate your compassion and your work.\nThank you.\nMembers, I'm going to ask you to stand as Chairman Wark-Eiser and Chair Hagen come to the\nwill. All members will stand and give the members and the will, your attention.\nThank you, Mr. Speaker.\nUh, at least in our loss, one of our mayors in Titanor County, as if, uh, Hurricane\nHelene, uh, hadn't done enough damage, uh, mayor, uh, Betty Collins, uh, Cobb Town was\ncleaning up and a tree snapped when he was on his tractor. Uh, Betty Collins was a\nVietnam that and came back and in this community start a small business but he's\ncar service and then years later Collins Elementary hired him as their\nmaintenance supervisor. He is survived by his wife Melita, his two daughters,\nCandy and Amy and at least behind six grandchildren and three great-grandchildren.\nI appreciate y'all spending and if you'd help us honor him with the moment of silence.\nIf you remain standing, thank you for that.\nWe're sorry to hear about the mayor.\nIt was a good man.\nI mean, Mr. Buddy, our representative, Al Williams, is recognized, give the gentleman your\nattention, please.\npresent in Williams and some other veterans who come down and join representative Williams\nnow at the time.\nThank you, Speaker.\nAt the end of last week in a very tragic training accident at Fort Stewart, we lost two very good\nsoldiers, the person or staff sergeant, shall be butner, and special if Jacob Mullen.\nIf it's tragic, that's what you do in preparation for defending this country.\nAnd I know that there's at least one of us standing here, besides myself, that served\nit for its duet, and that's representative Holcomb.\nBut everyone here understands the gravity of training and how dangerous it can be.\nThese two great soldiers leave 22,000 members of Third ID plus their families in morning\nthis morning.\nAnd thank you so much for standing.\nWe ask for just a moment of silence to memorize and honor their lives.\nAmen, let's speak a yield well.\nThank you, Representative Williams.\nOur thoughts and prayers go out for that entire family,\nbut we cannot do enough, given of thanks\nwith that third ID is done not only for Georgia,\nbut for this country and freedom around the world.\nThat completes our afternoon orders in the morning.\nWe're gonna move on to the announcements now.\nChairman Corbett, recognize for us now.\nBut give the gentleman your attention, please.\nChairman Corbett.\nThank you, Mr. Speaker.\nYou all going to want to hear this.\nThe rule caucus will be meeting at 12 o'clock\nover in ag building, our sponsors,\nCosta Pines, Risa, transportation lights,\nand the Georgia Hospital Association.\nMenute to foot today, our lunch, fried chicken,\ncube steak and gravy, black eyed peas,\nquip potatoes, yeast roll, sweet and unsweet tea,\nand banana pudding.\nSo you won't want to miss it and the other thing the motor vehicles committee will meet at eight o'clock in the morning\n606. We will be voting on bills. Thank you.\nOkay.\nChairman is getting to work. Thank you, Mr. Chairman.\nRepresentative Henderson is recognized for an announcement.\nRepresentative Henderson, give the lady your attention.\nThank you, Mr. Speaker.\nTomorrow February 4th, World Cancer Prevention Day.\nat the Capitol. As a breast cancer survivor, I'm raising awareness for early detection.\nTherefore, women please wear a pink, notating breast cancer awareness, and men please wear a\nblue in reference to prostate cancer awareness. Thank you very much. Thank you, Mr. Speaker.\nThere you are, recognize for an announcement.\nThank you, Mr. Speaker.\nThe Decavd delegation has a meeting today in room 502 again.\nDecavd delegation, we are meeting with the Decav CEO in room 502.\nLunch will be provided.\nThank you, Mr. Speaker.\nHouse members, I want you to stand with me and recognize a great Georgian who had an\noutstanding career quarterback at the University of Georgia, David Green.\nLet's give David a nice round of applause, y'all.\nGeorge, watching you play.\nChairman Prince, recognize, foreign announcement.\nCheck, check, okay, thank you Mr. Speaker.\nThe Urban Affairs Committee will have a brief\norganizational meeting today at 1 o'clock in room 606.\n1 o'clock, room 606, Urban Affairs.\nThank you.\nThank you, Mr. Chairman.\nRepresentative Bell, I think your Rex Middle School group\nis here.\nYou guys will stand.\nWe'd love to welcome you to the house.\nY'all give the Representative Bell a little room there,\nand we'll let him welcome this group to the house.\nWe're still waiting on Rex Middle,\nbut they came here with today.\nI'm the first African-American and chairwoman of Clayton County, Dr. Elyca Anderson.\nShe's joined with her husband, Dr. Steven Anderson, can you please stay in?\nShe's a proud PTA mom as well.\nAwesome, good to have you all.\nRepresentative Gamble, we recognize for the announcement.\nThank you Mr. Speaker, tomorrow morning at 7 a.m. the fellowship will meet in House Judiciary\nroom 132.\nI invite all members to come and pray and fellowship with us.\nLet's look forward to seeing you in the morning.\nChairman Powell, Chairman Allen Powell, recognize for the announcement.\nChairman Lomston, your own deck. You're already there.\nThank you, Mr. Speaker. Ladies and gentlemen to the members of the House\nregulated industries, we'll be having a meeting at two o'clock today in room 606\nOrganizational meeting and the search to announce subcommittees and immediately after that meeting the\nsubcommittee on lottery will be meeting so if you could make all\nAttempts to be there. What time was that, Mr. Chairman?\nWhat time?\nI'm sorry two o'clock in LOB 606. You probably said that. I just wanted to make sure everyone heard you. Thank you\nMr. Chairman. Chairman Loviston recognized for an announcement.\nThank you, Mr. Speaker. Full insurance committee.\nFull house insurance committee will meet today at 3 o'clock CLOB 506 for an\norganizational meeting and immediately following that.\nThe hit life and health subcommittee will be meeting.\nWe have a few bills to consider CLOB 506 today at 3 o'clock.\nThank you.\nSounds good to me. Get to work.\nget some bills going.\nRepresentative, excuse me,\nChairman Todd Jones,\nrecognized for an announcement.\nThank you, Mr. Speaker.\nThe Technology and Infrastructure Innovation Committee\nwill have an informal meeting at noon\nin Capitol 417.\nLunch will be provided.\nThank you.\nRepresentative Terry Cummins\nis recognized for an announcement.\nGive the lady your attention, please.\nGood afternoon.\nAnd the Cove delegation will meet today at 12 noon and CLAB 510.\nWe will have visitors from the Cumberland CID and lunch will be served.\nThank you.\nWays and means, Chairman, Chairman Blackman, recognize for announcement.\nThank you, Mr. Speaker.\nSubcommittees of Ways and Means will meet today in room 406, starting at 1 p.m.\nThank you, Mr. Speaker.\nChairman Dickie, recognize for an announcement.\nThank you, Mr. Speaker.\nAgriculture and Consumer Affairs will meet in the morning,\n506 CLOB, we will be here in three bills tomorrow.\nThank you.\nLeader, health stress is recognized for an announcement,\nbut not the one you think it about.\nThank you, Mr. Speaker.\nThe Committee Chairman's lunch will be this afternoon,\nnoon in room 403, noon 403, thank you.\nChairman Erwin's recognized for an announcement.\nThank you, Mr. Speaker.\nFull committee for education.\nWe're meeting at 1 o'clock in C-L-O-B 506.\nSo please be there.\nWe've got a lengthy meeting.\nSo we need you there on time.\nWe're going to try to start on time.\nThank you, Mr. Speaker.\n1 o'clock, 506.\nThat completes our announcements.\nWe do have page photos today.\nSo if you have a page, as soon as we adjourn,\nWe're welcome you up to bring with your page, join me with your pages so we can get a page for them.\nThank you, members, for your attention today.\nThe majority of the leaders recognize for a motion.\nThank you, Ms. Speaker.\nI move that this house stand adjourned until 10 a.m. on Tuesday, February 4th, 2025.\nOn the motion of the majority of this house stands adjourned until 10 a.m. Tuesday, February 4th,\n2025 all those are people say aye all opposed no wouldn't even close the\neyes have it we're adjourned\n",
  "updated_at": "2026-02-12T15:40:36.559963+00:00"
}