{
  "video_id": "NI6z21GMw7w",
  "url": "https://www.youtube.com/watch?v=NI6z21GMw7w",
  "title": "Senate PM Meeting pt. 1 for Day 39 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 156,
  "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting pt. 1 for Day 39 of the 2025 Session:\n\n**Overview:**\nThe session focused on passing several key bills, including HB 371 to create the Vince Dooley Battlefield Trust Fund, HB 513 to revise provisions on county service delivery strategy, and amendments to bills on video surveillance at gas stations.\n\n**Key Actions:**\n- **HB 371:** Establishes the Vince Dooley Battlefield Trust Fund to preserve historic battlefields in Georgia.\n- **HB 513:** Revises provisions on the county share of funding for jointly funded countywide services to be borne by unincorporated residents.\n- **Amendment to HB 513:** Authorizes the continuance of existing local ordinances related to video surveillance at gas stations.\n\n**Bills Introduced (First Reading):**\n- None noted in the transcript.\n\n**Notable Moments:**\n- The Vince Dooley Battlefield Trust Fund bill was championed by Senator from the classic city, with support from two former players who played for Coach Dooley.\n- Discussion of the Service Delivery Strategy Act amendments and the need to grandfather in existing video surveillance ordinances.\n\n**Votes:**\n- HB 371 passed with a vote of 47-0.\n- The amendment to HB 513 was adopted.\n\n**Attendance:**\n- Quorum was present, no issues noted.\n\n**Adjournment:**\n- The transcript does not provide information on when the session was adjourned or the date of the next session.",
  "transcript": "you you If you want to樂 s bill 129. House bill 454. House bill 454. Representative Gaines will 120 to another. Bill Tween, Title 9 to men. Title 3, Title 12. The official go to Georgia Ante,ology Park, Disorick, Aries, Memorials, and Recreation. So it's a great event. It's a really battlefield trust fund. It's a really battlefield trust fund program. For short titles, for definitions, for matching grants, for organizations seeking to acquire property interest, and certain battlefields. For the procedures, requirements and limitations of such fund and programs, for our application, or review criteria, for expenditure of funds, for our annual accounting. So part of any acquisition, including perpetual conservation, easement, placing restrictions, on the use of development of the property, or interest therein, to provide for related matters, for the publicing laws, and for other purposes. Mr. President, this thing committee rules recommended that this bill do pass, respect what's submitted, and a brass chairman, and that queasy, what are Mr. President? We're going to have the senator from the classic city, speak to the bill. Thank you, Mr. President. Senators, I'm pleased to present today, the Vince Dooley Battlefield Trust Fund bill. This calls for the simple creation of a trust fund, that can be funded through our general appropriations and private contributions. The purpose will be to preserve battlefields of the American Revolution, the War of 1812, and the Civil War that are located within our state. It will give matching grants to private donors, who will be purchasing either fee-simple properties, or lease agreements on properties that were historic battlefields in our state. This will be handled by the Department of Natural Resources, which will monitor and give the grants, and they will be to only historically recognize battlefields in our state. It's something to honor great coach Vince Dooley, from Athens, who was a tremendous historian, particularly interested in military history, and one of his passions. So I would urge your support for this bill to honor coach Dooley and preserve the history of this state. Mr. President, I'm happy to yield the well or take any questions there may be. You have no questions, Senator. Thank you. I ask your favourable consideration of the bill. Thank you. Mr. President, I would like to ask you a favour. Please have a seat. Does any other Senator wish to speak for against the measure? Chair, here's an answer. Is there objection to the previous question being ordered? Chair, here's an answer to the previous question is ordered. Is there objection to agree to the report committee, which is favourable to the past of the bill? Chair, here's an answer to the committee as agreed to. Is there objection to the main question being ordered? Chair, here's an answer to the main question is ordered. Question is on the passes of the bill. Chair, here's an answer. the bill. On the past of the bill, the yeas are 47 and the nays are zero and this bill haven't received the rest of the constitution. Majority is therefore past. I want to take a moment and thank a couple of gentlemen behind me, not just a dissent of the council, but also representative gains. The instrumental in this is two guys behind me, Chris Weldon and Frank Ross and they played for Coach Dooley. They were on the 1980 National Championship team and they're two great, wonderful guys, but I'll tell you, they play for Coach Dooley and I was there when Coach Dooley was athletic director and Frank and I were talking back earlier today about the lunch or whatever you know, Coach Dooley had a, he not only was a good football coach and also an outstanding athletic director. In fact, he might have been good athletic director as he was a head football coach, but he had a lot of interest in one of his interests. Be him being a former Marine and a historian, he had a master's degree in history. He really took on this battlefield trust project as something that he was something that he did. It was something before he passed, he was working on trying to get this done and I was just so happy that Chris and Frank brought this to our attention and reminded us of what he was trying to accomplish before he passed and I just really appreciate this body for voting for it and the House Voting for it because it is definitely a worthy, worthy gentleman who ought to be recognized for a long time and so we appreciate that. Give these two guys behind me are big round of applause please. Thank you. you Chief for jointly funded countywide services to be borne by unincorporated residents. For every annual board to their oath, for our related matters, for our effective date to repeal the public new laws, and for other purposes, Mr. President, his name and committee and state and the federal government of operations general. Recommended to this bill to pass by sub-suis, beckons submitted to Senator Dixon, Chairman, Mr. President, Senate, Comunisate, local government of operations general. Office of long substitutes, the House bill 513, the bill between Title IX and the Article II, Chapter 70, Title 36 of those to GA, or to service delivery. So, to revise provisions, or any two county share of funding for jointly funded countywide services, be borne by unincorporated residents, survivor annual reports thereof, try for review and revisions to approve strategies to provide related matters for our effective date to repeal the public new laws and for other purposes. Mr. President, Senator Burns, the 23rd and others offered the following amendment number one to men House Bill 513, by inserting after to men on mine one following Chapter 60, Title 36 of the official go to Georgia and Tatoid to General Provisions, the bill to counties and municipal corporations as authorized continuance of existing local for ordinances related to video surveillance at gas stations to men by substituting for effective dates for and effective date on mine five, by inserting the following after to line 8 Chapter 60, Title 36 of the official go to Georgia and Tatoid to General Provisions, the applicable to counties and municipal corporations and further purposes. Mr. President, that can be zero order. I recognize the senator from the 23rd, speak to the bill. Thank you, Mr. President. Colleagues, House Bill 513 deals with the Service Delivery Strategy Act. This is an adjustment to that that would allow some additional revenue sources. People will allow solid waste franchise fees and alcohol licensing fees and zoning fees to be a part of the options for counties to create revenue for services delivered in the counties themselves. As you know, Service Delivery Strategy is a negotiated settlement between cities and counties. It also requires reporting so that on an annual basis you must report the fees collected and then the use of those fees. One thing that's very important to note is this bill does not require either party to go through or review their current strategy that is currently established. So they don't have to renegotiate their service to the service to the service. It adds three options for additional services requires reporting. There is a friendly amendment. I'd like to point out that last session on the last day on Sunny Die, the Senate added an amendment to the bill that was supposed to be prospective. Unfortunately, it was retrospective and it was designed to prohibit local governments from enacting enhances and enacting ordinances requiring video surveillance cameras at gas stations. The challenge was that it did not grandfather existing ordinances. This amendment removes the restriction so that the existing ordinances prior to May the 6th of 2024 would be a lawful. So I'd be happy to stand for questions. I'd be happy to yield a well. I have no questions. I ask your favor consideration. I ask you. Senator, you do have a question. I apologize. The late arriving question. Sorry about that. It's Senator from the 53rd. 53rd. Yes, sir. Thank you, Mr. President. Senator yield. Absolutely. What section of the bill is your amendment in? It's in. It was a handed out. It's still going out now. I haven't seen the amendment, Senator. Thank you. Let's hold one if we can for the amendment. Thank you. It seems like a pretty big one, Senator. Wouldn't you agree? It's section 36. The title 36, 60, 32. Lines 15 through 20. Provided, however, that a county municipal corporation or Consolidate Government which prior to May the 6th of 2024 has adopted one or more ordinances related to the placement of the video surveillance equipment at any business or location where the retail sale of automotive gasoline occurs is authorized to continue regulating the placement of said video surveillance equipment pursuant to any such ordinances. This is a local control issue. It allows the legislation to be prospective and not prior to May the 6th of 2024. So if you had an ordinance in place prior to May the 6th, 2024, that ordinance would still be valid. This has the support of ACCG and GMA. Be happy to. You have a... You have a... Healably well. And no one was pleasant, Senator. Thank you, Mr. President. I just asked for unanimous consent to excuse the Senator from the 19th for business outside the chamber. Without objection, Senator, is it skewed? Is any other senator who is speaking for against the measure? Chair here is none. Is there objection to the previous question being ordered? Chair here is none. Previous question is ordered. All right. We're on the amendment number one, authored by the gentleman from the 23rd who is carrying the bill. Is there objection to amendment number one? Senator... We've got a new 17th. I still get you in the 42nd confused all the time. I'm sorry, President. Thank you. I ask for unanimous consent to excuse the Senator from the 43rd. Without objection, Senator, from the 43rd who is here. Without objection, amendment one is added. Questions only adopted. The Committee's substitute as amended is their objection to the adoption of the Committee's substitute as amended. Here, you're not only the Committee's substitute as amended as adopted. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. Members on the passes of the bill by substitute are those of favourable. Yes, opposed. Secretary, I'm not the machine. Thank you. All the passes of the bill, the A's are 50 and the A's are 2. This bill, having received the requisite constitution, majority is there for pass by substitute. Secretary, House Bill 179. Representative Smith of 18th and others. an article two, chapter 14 on Title IX of OCGA, related to procedure for persons on our sentence of the state court of record. So I provide for digital recording of certain felony trial proceedings to amend Title 15 of the Fischer Jordan Ante, related to court, says to provide for the digital recording of certain Georgia Statewide Business Court proceedings, for either for the utilization, regulation, or digital recording systems, for either for definitions, trial for late amounters, for an effective date to be able to move the laws and for other purposes. Mr. President of the same committee on judiciary recommends that this bill do pass. Respectfully submitted, Senator Strickland, Chairman. Mr. President of the same committee on judiciary offers the long substance to House Bill 179, bill to be entitled to amend Article 2, chapter 6, Title 5 of the Fischer Jordan Ante, related to a public practice, as to why for the digital recording certain trial proceedings to amend Article 2, chapter 14, and for other purposes, Mr. President, that completes the order. We're going to ask Senator from the 42nd. Thank you, Mr. President. House Bill 179 is a court reporter bill that comes from a committee that worked over the last 15 months chaired by Judge Lian from our Court of Appeals. It also included other judges from Superior Court, State Court, and Jeven Hall courts. Looking at the issue, especially in rural Georgia, the lack of court reporters, and so we want to make sure that proceedings can be taken down, but we're having issues of getting access to court reporters and some jurisdictions. What this bill does that goes through each of those courts and confirms that a judge may at their discretion have a proceeding recorded digitally instead of having a court reporter present. And there's still the requirement that if that happens, that that record is taken down by a court reporter later. Also, the parties can object. They can provide their own court reporter. And there's certain types of cases such as felony trials or witnesses or testifying a felony case, as this will not apply to as well. I think it's the right compromise, the right balance, and try to deal with the issue of lack of access. To court reporters, I'll also make sure we're keeping good records of our proceedings. Happy to answer any questions. We're going to ask Senator from the 50th. Thank you, Mr. President. Does the Senator yield? Yes, sir. Is it not true that across the state there have in the past several years, especially after the pandemic, there's been an extreme backlog in the courts? That's true. And allowing this type of recording to be done will this not improve judicial economy and could potentially prevent these backlogs from occurring in the future? Mr. Lear, the judges will love you for supporting the bill. You're correct. This will help move cases more efficiently. And it sounds like because you're speaking for the governor's support, since I guess we'll get signed in the law once it goes back to the House, too. That's great. Thank you. I'm glad you've shown up that support, Senator. Thank you. You yield, too. No more questions. I'll be back. Does any other Senator wish to speak for against measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none of the previous questions ordered. The question is on the adoption of the committee. Substitute is there objection to the adoption of the committee substitute? Hearing none, the committee substitute is adopted. Is there objection to agreeing to the reporting committee, which is favorable to the passes of the bill. Chair, here's none. The board of the committee has agreed to. Is there objection to the main question being ordered? Chair, here's none. The main question is ordered. The question is on the passes of the bill by substitute. All those in favor vote, yay. All opposed, nay. Secretary and Lightning Machine. On the pass of the bill, the a's are 52, the a's are zero. This bill has received a requisite constitutional majority. Is there for pass by substitute? Standard from the a's, what purpose do you rise? Mr. President, I'd like to ask for unanimous consent to excuse the center from the 11th. Without objection, the center from the 11th is excused. Secretary Reed, House Bill 180. House Bill 180, where represent the Smith of the 18th and others, Bill Spoon, tell them like to amend, chapter 9, title 15, the official of Georgia and it here, what's your probate courts, that's the modified certain requirements for probate judges, to write for later matters, for the bill from looking laws and for other purposes. Mr. President, thank you, Mr. Judiciary. Recommend so this bill to pass, respect please submitted, Senator Strickland, Chairman. Thank you, please see what I'm as president. We're going to ask the center from the 50th. Thank you, Mr. President. House Bill 180 is a simple bill that basically there's a loophole in existing law. This closes the loophole for individuals running for judge of an article six court. Requires them to file on affidavit. It's pretty simple. I'm happy to answer any questions. You have no questions, Senator. Thank you, Mr. President. I yield the well. Does any other senator which speak for against the measure? Chair here is none. Is there objection to the previous question being ordered? Chair here is none. The previous question is ordered. Is there objection to agreeing to the 40 committee, which is favorable to the passes of the bill? Chair here is none. The 40 committee is agreed to. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. Questions on the passes of the bill. All those in favor. We vote yay. Opposed nay. Secretary, I'm not the machine. Senator, Senator Attorney, I'm sorry, I say it against anything, have you mic on? The unanimous consent is excused and sent it from the second. Second. All right, without objection, it's sent from the second as it's used. On the passes of the bill, the A's are 48. The A's are two. This bill having received the rest of the constitutional majority is there for pass. Six to your read, House bill of 532. House bill of 532, by the time of the launch, the 167th, the bill between 10 and 9 to men, co-detection 12-6A-12, the fish for Georgia annotated, relative annual grant, when state owns property and calculation, so as to revise revisions, relative to certain counties, claiming such grant will also claim similar grants in chapter 14 to type 48, relative to grants and special revenue disbursements, to the man, co-detection 4-8-14-4, the Vesco for Georgia annotated, relative annual grant, two counties with 20,000 and more acres of unimproved real estate owned by the Department of National Resources, so as to revise revisions, relative to counties, claiming such grant will also claim similar grants in code section 12-6A-12, to write it for later matters, repeal the local laws and further purposes. Mr. President, the Senate committee on finance recommends this bill to pass, so at least a minute, Senator Hustler, chairman, Mr. President, I've been attached and I complete the order. We're going to have Senator from the 50th. Excuse me, the third. Thank you, Mr. President. My colleagues, I bring a House Bill 532. Purpose of this bill is to more properly reimburse counties with large amounts of state-owned land for services performed on those lands and for the conservancy of those lands for the citizens of Georgia. Section 1 deals at men's OCG 12-6A-12, which deals with the Georgia Forestry Commission. In the outdoor stewardship trust fund, this applies to counties with 20,000 or more acres of unimproved land. If that land exceeds 10% of their taxable real property and 10% or more of their tax digest, currently this accounts for nine counties in Georgia. Under this, the DNR will calculate annually the amount of state-owned real estate per county and the value of those public services provided by that county. The amount cannot exceed the amount the county would charge any other landowner. Typically, this is maintenance of unimproved roads, ditches, etc. The DNR will request funds in its annual budget. If its budget appropriation is smaller than it needs to be, then grants will be in the per rated down. Only land acquired without no-urs stewardship trust fund money will be considered in this grant, and no more than 10% of the OSTF allocated money will go to these grants. Section 1 also strikes a previous prescription of receiving grant money under this section and section 48-14-1. Section 2 basically does the same thing, but it applies to Section 48-14-4, which is land held by the DNR and not in the Forestry Commission. It also strikes the prescription of receiving grant money under this section and section 12. I would be more than glad to answer any questions. Thank you, Mr. President. Any of those nine counties in North West Georgia? Those nine counties are McIntosh, Chatham, Glenn, Camden, Weir, Wayne, Long, Dawson, and Walker. Thank you. No more questions, then. Thank you, Mr. President. I yield the will. Does any other senator wish to speak for against the measure? Chair, here's none. Is there objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to agreeing to the report of committee, which is favorable to the passes of the bill? Chair, here's none. The board of committee is agreed to. Is there objection to the main question being ordered? Chair, here's none. The board of committee is agreed to.\n\nQuestions ordered, questions on the passes of the bill, all those of favorite bouquet, all opposed to the secretary and a lot of the machine. On the pass of the bill, the A's are 44 and the A's are 5. This bill haven't received rec<|tr|> recsit constitution majority is therefore passed. Secretary, House Bill 325. House Bill 325 by representative Martinez of the 111th and others to build the Mintona 9th to men article 4, chapter 13 of Title 19 of the OCA will be to the protective order registry. So that's device certain definitions to men, part one of article 5, chapter 2, is how to 30 of the OCA will be to general provisions of the Code of Military Justice, such as the process of the process these for protective orders to be issued by military judges that prohibit contact between the specific members of the state and militia. In the instance that one member of such militia has been accused of talking by another member of such militia to men, part 7 of article 5, chapter 2, Title 38 of those CJA will be to trial procedures for the Code of Military Justice, such as the right for one for contempt to men, part 10 of article 5, chapter 2, Title 38 of those CJA will be to the provisions of the military code of justice, such as the right for courts martial, for definitions, the right for religious matters, for effective dates, for building laws and for other purposes. Mr. President, the same commanding judiciary recommends this bill to pass or separately submitted, and are strictly in charge of it, and that completes the order, Mr. President. We're going to have the same for the 42nd. You're busy today, Senator. Mr. President, I think I'm the floor leader for every House member today. House Bill 325 is a bill that makes a stalking TPO, this Internet Art Military Courts, have the same impact it would have as if it was entered in our superior courts. The thing we have now is under federal law, our military judges can issue TPO's to protect our service members, but as soon as that service member is back in all of active duty, it does not apply anymore. You also have the issue of the person being accused, having their information put in GCSE for a stalking TPO order, yet the order has no true impact when they're not in service, and if they are no longer in service once the initial order is entered, they don't have a chance to defend themselves in the process. So it comes directly from our National Guard requesting that we pass this bill to create this standard, to create this process where our military judges can enter TPO's in the same way that our superior court judges can to make sure we're keeping our guardsmen and women safe and ask for your favorable consideration. We're going to enter from the 50th. Thank you, Mr. President. Is the Senate real? Yes, sir. Just to be clear, so right now, if a military judge issues one of these TPO's, once the member of the military is back in civilian life, it does not apply. That's right, Mr. Leader. These are folks that go and look at lives and align for us and go fight for us while we're at home. And the second they return from home, we need to make sure that they're protected as well. And what this bill does is make certain that those stalking TPO orders have impact when these folks are back home and not just within all the days. Thank you. Senator from the 20th. Thank you, Mr. President. Will the Senate are you? Yes, sir. I just wanted to be sure Senate press got that clip. Yes, sir. I think so. I try to say it slowly so I could get it, but I could also repeat if you think I should. Well, twice is better. Maybe I don't know. I think it's important our military men and women know that when they're abroad fighting for us, protecting us and they're back home, we're going to keep them safe as well. All right. You're doing a good you're doing a good job for the House. I will yield the well. I was just reminded your former House member too, aren't you? Got a bunch of y'all in here. Does any other Senator wishes to speak for against measure? Chair, here's nine. Is is there objection to the previous question be in order? Chair, here's none. Preach question is ordered. Is there objection to agreeing to the port of committee, which is favorable to the passes of the bill? Chair, here's none. The port of committee has agreed to. Is there objection? The main question be in order. Chair, here's none. The main question is ordered. Questions on the passes of the bill. All those in favor vote. Yeah, all those names. I can share your line of the machine. You there. Secretary House Bill 397. House Bill 397, representative Fleming, 114 to another, bill is being done in act 2, man. Chapter 2, title 21 of the official of Georgia Anteade. Related to elections and primaries generally says to allow municipalities to opt in to providing advanced voting on Saturdays for municipal elections. Tribes revisions related to time minutes for calling special elections and the dates on which special elections can be held to provide related matters for people looking laws and for other purposes. Mr. President, the thank you and I, ethics recommends this bill to pass by committee substitute, respectfully submitted, Senator Washington-Cherman. Mr. President, the thank you, man. Ethics offers a long substitute to House Bill 397. Bill is being titled in act 2, man. Chapter 2, title 21 of those CGA, bill of elections and primaries generally says to arrive to the state election board, shall be administratively attached to the state accounting office, to arrive for definitions to limit the effective date of rules and regulations adopted by the state election board prior to the general primary, general election, or run off thereof and for other purposes. Mr. President, the minority portion of House Bill 397 has been attached and I can be see order. Bring it out, Senator, from the 25th. Thank you, Mr. President. I appreciate the opportunity to present this bill. House Bill 397 was vetted over in the House and then it came over to the Senate and we might have better. They helped them streamline this thing and this has the blessings of Gabrielle who actually performs the elections all over the state. It fixes the issues with our third party candidates and it stops counties from doing this pop-up voting sites. This, Mr. President, conforms with proper election procedure and I ask for your favorable consideration. Thank you, I yield the oil. Does he any other Senator wish to speak for against the measure? We're going to have the Senator from the 55th. Ladies and gentlemen, thank you, Mr. President. Arise on this bill. Dilling at the heart of course, democracy again. I'm one of those proponents that just happened to believe that life liberty and the pursuit of happiness is so intricately tied up to this thing they call voting. It's something that so many nations do not have. They are nations that lined up to emulate the old country called the United States of America. That country where we hold these truths, evident, self-evident, that all men are created equal and we give them an equal voice at the table and this bill does not give an equal voice at the table. And we must create a system that does not relegate the marginalized of our society to the point that they do not have a seat at the table. And this bill just does that. It is preposterous that we would have people standing in lines and not give them water. It is preposterous that my home state is on the national news known for suppressing people of color for their right to vote. It is preposterous to the extent that just the other day, right before the election next year, 455,000 people were purged from the roles. What is going on in our great state? Why are we so intent on disenfranchising the citizens of Georgia? Why must we do that? I rise today and I'm thankful for my preceding colleague who gave me a pin of flag and I really I love this country. And somehow God has put on the backs of people that kiss by the sun to be the moral conscious of this nation. Because I dare say that if we were all a homogeneous, if we all had the same hair color, if we all had the same skin color, this bill wouldn't be here. This bill is designed to have people with one aim. That is to suppress the vote. Jair Amandaing, we are shaking the confidence of people in our democracy. People are not trusting it. For the very first time, maybe a my not activity, I thought justice was blind. And now we have partisan judicial people. That's not going to work in America. And if we do this bill, what we'll find is that it does not benefit the least the lost and the left out. And I'm asking you to consider that we do something different than this thing called suppressing the vote. Fifteenth Amendment of the United States of America was passed for a reason. The Voting Rights Act was passed for a reason. And it just may take people back in the streets again. That's not what I want. Maybe that's what some of you want. Because until there was a Selma, until there was a bloody Sunday, until there was blood on March the 9th, 60 years ago, folks that looked like me did not have the right to vote. And here we are again, dealing with this notion of the right to vote. I had the opportunity as I got out of law school to practice all over the state of Georgia. And I had the distinct privilege of doing voting rights litigation. In my lifetime, I had the privilege. But it was a very difficult thing because my mother was worried about me. She said, don't drive that Mercedes down in South Georgia. I've had a lawyer stand on the other side of me and say, boy, you messing in our business, we're going to get you this bar. In front of a federal court judge, I ran out of service, ran out of office. Because there was some all white boards in my lifetime that I had to litigate to get someone of color, to diversify the boards. And we want this DEI to go to sleep. We want segregation now, segregation tomorrow, and segregation forever. It's not a good notion. I'm drawing the line to that because in my lifetime, since I was in I got out of law school, there were numerous school boards, numerous cities that had all white members, nobody of color, even though some of those cities had 30 and 40 percent African American population. It is bothersome and it may get on some of our nerves. But there are people not participating in this democracy right now. They don't believe in the system any longer and they are creating their own version of justice. And when we don't respect the law, when we don't have the rule of law, what do we have? Do we have a dictatorship? Do we have some of those countries? Some of those people are lining up. The reason we have an immigration, one of the reasons is there are people lining up to get what we have and what we take for granted. And if we take it for granted for so long, we may not have it. So I ask that you reconsider. And I say this, John Lewis, who we revere, some of us do. We need a John Lewis voting rights bill. We need the right to vote for everyone. Everyone should be at the table. As you get to meet people that don't look like you, I guarantee you, you'll find that some of these people are okay. We don't need to be afraid. We really don't. Mr. President, I yield the well and simply say that we really need to reconsider all the gerrymandering and all the partisanship and all of the non-sacepunlike activities. Thank you guys for indulging me this time. You have a couple questions, Senator. If you'd like to take them. But you can always yield. I'll go ahead and yield the well, Mr. President. Thank you. All right. Thank you. Reagan has the Senate for the 35th. We have aéfice from the admin group,at the cell. years where they are Frankenstein, Wackemoll, bills, and the mole is our election system. And I want to point out some issues and concerns that I have specific to HB397. The first is, and I figured that some of you were all for big government and expanding government. But the first couple of concerns I have is about the expansion of government and that's specific to the Georgia State Election Board. When you look at section three, it gives the State Election Board some more authority. Specifically, it allows the State Election Board to maintain custody of all election and the investigation documents and communications between the Secretary of State and county election supervisors. Now mind you, that is something that the Secretary of State has already said is not technologically possible. So we would have to spend money in order to do that. It's also something that the State Election Board is not staffed to be able to manage. So we would have to ensure that the State Election Board hires enough people to deal with these kind of communications and then I guess give them enough money for the infrastructure to maintain this information. So that is spending money that I believe is unnecessary because there's no good reason for the State Election Board to have that kind of information. Not only that, but I'm concerned about the sensitive voter information that the SEB would be receiving because of this authority. They're not equipped to handle this sensitive information. And not only that, but there's already been reporting that the State Election Board members use their personal devices for communicating. Are they going to be exchanging this sensitive information amongst themselves using their Gmail accounts? That's a real concern I have especially because these are appointed officials. They're not employees of the State and they're not elected officials. The other thing that this bill does specifically in section 6 is it directs the SEB to submit to the General Assembly a report on procedures to improve voter roll accuracy outside of a multistate list maintenance organization by December of this year. Now I'm all for that specifically except why would we have the State Election Board do that? These are appointees, political appointees. They're not experts. There's one lawyer on the board. There's one election expert on the board. So who's going to do this report? They're going to have to hire consultants in order to provide us this report. Why not rely on the in-house expert experts that we have in the State of Georgia to do this in a cost-efficient manner, which is the Secretary of State's office. The next section that I want to point out that has, that causes significant concern is section 7, which requires the Secretary of State to leave the bipartisan multistate voter list maintenance system otherwise known as Eric. Our committee, we learned that Eric is the only such system that allows states to seamlessly share sensitive voter information. And they do that using high standards that protect our privacy and protects our data. There is no equivalent right now to Eric. States that do not use Eric have to rely on a big in-house department. So Texas, for example, went from having a handful of employees related to maintaining their voter rolls, to having to have more than 35 employees to maintain their voter rolls. So Eric streamlines that. But they also ensure that the information matches up so that we can easily identify voters and then we can remove them as we see that they move to other states. What this bill does is it requires us to leave Eric and then rely on individual bilateral agreements. That would be 50 individual agreements or 49 other agreements with other states. So here's what that means. We would have to see whether our data matches up with Hawaii's data. We would have to see whether our data and the information we provide matches up with Florida. We've already seen that there are issues, for example, with the Florida Sunshine Law, which would not allow us to share our sensitive information with Florida because Florida's law would require them to reveal it. How are we going to maintain clean voter rolls if we can't have a central organization that helps us to maintain voter data? If we are doing this ourselves, we're going to have to spend millions of dollars like Texas has and like other states have to build out a team to build out the infrastructure. And then we're going to have to make sure that we maintain cyber security standards and that we address any privacy concerns. And colleagues, the last section that I want to point out is section 9, which restricts counties from choosing to accept hand-delivered absentee ballots the weekend before an election. Now the ability for a voter to drop off an absentee ballot the weekend before election is a critical one. It's a crucial access point that this bill would take away. And in an era where we have seen that the post office is wholly unreliable, many voters have relied on dropping it off the weekend before an election because life happens. For example, I think about the mother in my district who came with her son's absentee ballot. And that's because he was deploying and he had forgotten to mail it. So while he was going to fight for our country, he did not want to miss the opportunity to vote. This law would stop him and his mother from being able to drop that ballot off that he forgot to drop off before the weekend of the election from doing so. Before I think about the college student who accidentally packed her absentee ballot and returned to school, that student drove five hours to turn her ballot in that weekend before the election so that she could be back in school the following Monday. By restricting counties on when they can receive these absentee ballots, that college student would not be able to drive the weekend before the election, that college student would have to miss class in order to drop off her absentee ballot on the day of the election. That doesn't make sense. We have not received any valid reason in committee or otherwise why that student should be required to either do it long before the election or do it on election day. Because of the postal system and because of the issues that we have, our election boards are incredibly busy. And sometimes they forget, they have a backlog and absentee ballot request that they have to fulfill. We saw this in this past election, including in one of my counties that represent Cobb County. The county had to mail absentee ballots last minute the Friday before the election. This law would restrict Cobb County in that scenario from being able to offer their residence the option to drop off their ballot the weekend before the election. They would only give those residents one option the Tuesday, the election day to drop off the ballot. That makes no sense. Why should we force voters to go to the legal system, to go to the courthouse in order to exercise their right to vote because the county delayed sending absentee ballots? Colleagues, I hope you take these concerns seriously and go back to the drawing board. There are issues that should be addressed in our election system. But these issues that I have pointed out seem to miss the mark. With that, Mr. President, I yield the well. Senator Zio to send her from the second you do in the minority report, right? Okay. Senator from the 27th. Thank you, Mr. President, colleagues. But you just heard from the senator from the 35th was an intellectually honest discussion of policy. He understands what's in this bill. He has read this bill. He has policy differences with the author of this bill. And that is exactly what we should spend our time with in this chamber. Unfortunately, prior to that, his colleague came to this well without the bill in his hand, because I don't think he's ever read the bill. And if he has read the bill, he did not articulate one specific element from this bill that he was opposing. He drug up an argument from the darkest days of this country and tried to transport them into this bill and quite frankly, one of the most intellectually dishonest speeches I've ever heard from this well. If you're going to accuse one of our colleagues of having a singular purpose as he stated that this bill is designed with one aim and that is to suppress the vote. If you're at a dishonor one of my friends in that way, you better have the receipts. Don't come to this well and dishonor this institution without specifics and dishonor your colleagues.\n\nusing them of trying to suppress the vote. I will tell you where an element of this bill came from because I lived through it. The senator from the 56th, myself, and the senator from the 21st, after Fulton County the night before the weekend before, so the Friday before the weekend before the election. And I believe it was two other counties, suddenly announced they were opening their election offices to take ballots in, and refused to allow election observers into the room. We, and a number of our colleagues, went down to Fulton County and demanded to be led in the room. Because they were trying to conduct election activity that up until that point in time had been fully available to election observers in the Democrat Party and Republican Party. They closed their doors to those election observers for the first time in that process. And we linked arms actually with Democrat activists who were down at that time in working with them to get Fulton County to open the back office that they had opened and to move that process of accepting votes out into the lobby. This bill fixes that. The 450,000 people that are being removed are being removed under state law. And if you have a problem with that process and you're a senator, you bring a bill and you write legislation to change that process. This bill deals, this bill in front of us here deals with processes by which we review who has moved out of the state. We review, we go through the tabulation process and when the election board is going to post information to the election board. But bringing it up this debunked notion that was floated first by Stacey Abrams and then floated by Joe Biden and used to weaponize Major League Baseball to leave the state for a state who has a very similar voting laws to we that we have. It was ridiculous then and it's ridiculous today. How do we know? Because since Senate Bill 202 passed across every demographic we have seen increased participation in voting. And I'm sorry if you don't walk, what me walking around with this Greg Dola's all for Senator T. Shirt and handing out water in the lines and the law forces you to give that to the election workers and allow the election workers to hand out that bottle of water. That's not refusing a bottle of water. It's refusing from me campaigning on election day while people are lining up to vote. So we've done a number of things that we may disagree on. The Senator from the 35th and I would disagree on his policy, but I would commend him for coming to this well with an honest argument. Mr. President, I yield the well. Senators yielded. Recognize the Senator from the 7th. Congratulations. Mr. President. Thank you. Mr. President. In 2018, we almost saw the state flip. Before that we didn't have any of these quote unquote election integrity bills and Republican Party. They were scared that they were going to lose power. So what do they do? They passed disingenuous bills in the name of election integrity, which in fact it was voter suppression. We should be passing laws that would make it easier for citizens in Georgia to be able to vote instead of putting up roadblocks, they make it harder. Let's talk about this bill. HB3397 does not secure elections, it sabotages them. By sewing distrust, empowering conspiracy theorists and silencing the voices of everyday Georgians. I will echo the sentiments from the center from the 35th. This bill forces Georgia to withdraw from Eric, a bipartisan proven tool that helps states clean their voter data accurately and fairly. States that have abandoned Eric, like Texas and Alabama, have seen chaos, costly mismanagement, and in some cases the wrongful removal of eligible voters. Georgia is now poised to follow them over the cliff. Why are we breaking something that isn't broken? Why are we tossing out a system that works in replacing it with political theater? HB3397 makes it harder again for folks to vote by mail. It prohibits hand delivery after early voting ends except for two days. So let's say if you're a workin' mom and you're working two jobs and caring for your kids and can't get to a drop box during the new restricted hours, well too bad for you. You know who this hurts the most? Seniors, people with disabilities, working families, the very people we should be making it easier to vote. Elections security is important, but this isn't about security, it's about control. It's about disenfranchisement and it's about keeping power in the hands of the few at the expense of the many. Georgians want elections that are free, fair, and accessible, not the partisan attempt to put more roadblocks between the people and the ballot box. I'll be voting no on HB3397 and I urge you, if you believe in democracy, if you believe in the right to vote, if you believe that government should work for the people, all the people, then you will vote no too. Thank you, Mr. President, are you all the well? Senator Yeilden. Senator from 22nd. Just first, I'll be brief, just to say that, I believe what our senators are talking about here, is also the larger implications of all these particular bills that have taken place. In any center that can come here and talk about the policy implications that take place, even though it's not necessarily lined by a line of particular bill, and the policy implications that all of this has been taken place, since SB202 is the aspect of voter suppression, we've been saying that for the minority party, since that particular bill, and even before that, and the fact of the matter is, as this minority party has become close to close to one elections, we keep finding more of these particular bills. In any center that can come to this particular podium, and talk about the larger policy implications that exist in these voter suppression bills, and that's exactly what happened, and that is just right to do that. Thank you, and I yield a well. Does any other Senator wish to speak for against the measure before we hopefully end debate with the minority report? Hearing none. Regan, I as the Senator from the second. Getting my minority report. Well, thank you, Mr. President, and colleagues. It is no strange occasion that I am going to vote no on a species of legislation that we have before in HB 397. And the reason Mr. President, I'm going to vote no, is as we've heard time and time again about the committee process, I saw this bill when I walked into committee with revisions. Just the day before, there was a provision in the bill that was taken out that was going to have folks all the way to Atlanta to appeal a decision by their local board of registrars, which I adamantly, 200% disagree with, as you all know, about my passion for the role name I-16. And so, Mr. President, I also miss bill, starting off with section three. Section three, line 47 talks about the maintaining custody of all state election investigative reports and communication between the Secretary of State and election superintendent, so that would be a power given to the state election board. And my question to my colleagues is how can you get an unelected board power over a constitutional officer in this state who's charged with elections? And so then I thought about the rest of the bill, when I got to section four, I talked about this emergency rule making that state election board would be empowered to do. And we saw in the last election cycle, the state election board came up with some pretty far-fetched rules that were challenged in court and a judge ruled and said, you can't quite do that. And so when I thought about the legitimacy of the state election board, I drew my attention to the state constitution on page 10, article two, section one, in paragraph one, said the method of voting elections by the people shall be by secret ballot and shall be conducted in accordance with procedures provided by law. When this constitution was written, we said that the rules and the laws that govern elections and voting would be prescribed and provided by law, not by rulemaking, not by an unelected, unaccountable board deciding they were going to do whatever they wanted because there was no real way to hold those individuals accountable for the decisions that they make when they're consequential to an election. If the legitimacy of this board were to be there, they would qualify and run for office and they would be elected to their position. So people would have a say so and electing the people who they wanted to represent them to govern elections, but they're just merely appointed. And I disagree with them having the ability to make their own rules because when I look at the rules that they're making, who's watching the rulemaker? If the rulemaker takes the power of the General Assembly, it was my thought that the General Assembly prescribed all laws. And so as I further walked through the bill, I found another section of the bill that talked about the state election board assembling a report evaluating procedures to improve the accuracy and efficiency of the voter registration systems without participating in a non-government entity with the purpose of sharing voter registration information, thought about how this report would be compiled. And as we sat in committee and debated the substitute that came to us just hours ago, the election supervisors for many other counties came to provide testimony to provide clarification as to what they actually did, what the reports were actually called. And so my question is if we're truly concerned about having the best elections in the world, why don't we have a state election board that's appointed with Registra's and people actually administer elections so that we could find out exactly what's happening. We don't have a state auditor that doesn't know how to count. And so why would we have a state election board with folks who don't know how to run or administer an election with no expertise or experience? They're just going by what the talking heads and the pundits tell them to do because many of us have seen the infamous phone call. We've heard about it. We've seen the other calls in to make sure that the state election board does this or does that. So my question is who's watching the watcher? And so as I further moved through the bill, moving not only from Section 6, then the Section 7 and looking at what was struck, I also looked at it, it's all talked about leaving Eric and the voter, this maintenance system. And instead of trying to legislate leaving one system without a solution for the next, I urge my colleagues why didn't we introduce a study committee so that we could get best practices and patterns around the country of what other folks are doing before we just rush legislation through? Why not do a study committee to study the issue to see what the solution was? And as we heard, as my colleague, the Center from the 35th talked about, well, you can't quite do an agreement with Florida because if you sent the information down your social security numbers, would basically have sunshine on them in Florida. And we kind of don't want to send folks personal information down to Florida. And so when we look at this bill through and through, my question again is if it is of a large impact and of this magnitude, we don't have another election coming up until 2026. Why not take the time and 2025 to study the issue so that we could come out with good rules for engagement that everybody would know? Not some fly by night shot in the dark, made it happen 10 minutes before, kind of trying to figure it out because this wasn't the original bill that the gentleman brought to committee. There were many versions of many substitutes to this bill. And so again, if it's about accuracy, I remember my uncle Boe, Earl Jones, we called him Bo Dilly. He was a carpenter and he taught me how to measure and how to nail, and how to hammer, and how to have two by fours and two by twos and two by sixes. But one of the things he always told me, he said, son, you got to remember that you got to measure twice and cut once. And so if we were going to be serious about how we govern elections, we just form a study committee. We'd measure twice before we cut once. Now, as I further move through the bill, talking about drop boxes and receiving ballots and how the Secretary of State would be governed, I did have issues with not allowing those local boards of elections to receive those ballots the weekend before the election because my brother was a college student at Tuskegee University where the Senator from the 26 happens to be an alumni. Although I hated that he was down at Tuskegee, he also would have to drive back to drop off his afternoon tea ballot. And he'd fly in, he'd drive in late Friday night, and by Sunday morning he'd be gone again because he had to be back in class at Tuskegee on Monday. And so he wasn't the resident of Tuskegee because we were paying out of state tuition. So he couldn't have been a resident of Alabama and Tuskegee Alabama because the tuition bill suggested he was a resident in the state of Georgia. And so there's an issue with how we collect and look at these absentee ballots. And as I also raised this issue in committee, when you talk about it, some folks may not get their mail on time. We act as if we don't know that the postal service is notoriously slow. And so if you mail the ballot out in Savannah, it might take seven to 10 days before I got it because the mail in Savannah goes to Jacksonville before it comes back to Savannah. And so it might just be an issue with timing, just getting it in the mail. So folks that I don't even want to chance it because if it's not received, when the postman drops off the mail, post a woman whoever on election day by the time they make the drop, then guess what my ballot doesn't count. So there's an issue with that. So as we continue to move through the bill in section number 12, there was talk about how these reports would be uploaded and how you would get them and how you would query them. How would you put them on a public website if public website if the folks didn't know how to upload it to the website and they couldn't get it up there. There has to be in a public place accessible to 24 hours of the day. We must be paying for some IT services because I struggled to even figure out how to get on the Wi-Fi. And if it weren't for the Secretary of the Senate, I wouldn't have figured that out until last week. Mr. Secretary, you helped me figure that out. There's no manual for that. And how do you mandate that somebody has to get something online by the next day when most county officers and folks are leaving? When you put all this stuff in a piece of legislation like this, folks would do their best to try to follow the law and try to comply. So now counties that already don't have enough money, that's why we had a couple other bills earlier today that further compensate those counties. They're going to have the IT personnel stand by all night long so that they can finally get this on the website because they don't want to be in error with having anything not uploaded on time, not having it on the website. You got to have 24 hour monitor in 24-7. I mean, good night. This is just so much. I mean, and like I said, colleagues, this bill is about a few pages long. It's about 21 pages long. If you have not had the chance to read it, I encourage you to read it today. Don't worry, I didn't have it too long and committed to read it either. And so again, this bill deals with moving the state election board from the Secretary of State's office to the State Accounting Office. And again, if it walks like a duck and it quacks like a duck, then it must be a duck. But Ms. President, the way we handle these voting legislation, as I said in committee, sometimes I'm wondering if we're playing a game of duck duck and sometimes if I'm the goose because I can't quite follow it, I can't quite figure it out, I can't quite put my finger on it. But I will just raise to you the issues and challenges that we, the minority party, have found in this bill. And again, if it ain't broke, don't fix it. So if it's easy to vote and hard to cheat, why we got to make more bureaucracy? Didn't we pass the bill to set? We were going to roll back the red tape? Well, now we're adding red tape. Now we're adding more bureaucracy. Now we're adding more government. And I thought this chamber said we were going in the direction of small government. But as I always say, Ms. President, rules for thee and not for me. And that's why I'm a known, this piece of legislation. And I would urge my colleagues to vote no on HB 397 until we can debate these bills and committee and have them published in enough time to allow for the amendment process to work, because we couldn't even propose any amendments to this bill. The committee rules say you got to have 24 hours for a substitute or to make an amendment. Well, I can't propose an amendment to a bill that I just got six hours ago. And again, Mr. President, I'm just letting you know that it's just service for the folks in the second, because they sent me up from I-16 to legislate for them and to work for them. And if we can't get these bills out on time, then maybe they ought not pass. So I would just urge my colleagues. And when we deal with election bills, when we deal with these things, let's do it in enough time. Let's do it in a reasonable amount of time. We spend a lot of time from the second Monday and January until now to cram all this stuff in into Russia process that we can absolutely spend a lot more time doing. And I think that HB 397 should go to a file 13, and we should introduce a study committee, study the issue, measure twice, and cut once. And we won't have a jacked up piece of carpentry of framework around him. Mr. President, with that, I yield the will. Senator from the 23rd, your light, so on. Would you like to speak to the bill? Thank you, Mr. President. I'll be brief, but I have to correct a few misconceptions. I am amazed at the rhetoric here today. Totally false. I respect my colleagues in the 55th and the 2nd, but let's make sure we understand the facts. We had record voter turnout in 2024. Record voter turnout. No vote was suppressed. None. Not one. Across every demographic, the confidence in our elections in 2024 were 98%. Let's make sure we understand that this protects the integrity of our elections. Doesn't suppress anything, not a thing. And when you talk about ballots, and when you can turn them in, there's lots of ways to submit a ballot. My good friend, the senator from the 2nd, points out that I 16 is a long way from it later, and he's right. But I'm a long way too. I'm out on I-20. Text me about the same amount of time. Let me explain simply, you carve up and military voters mail their ballots in. That's always an option. You can get your absentee ballot early. You can submit it. Oh, by the way, if you're home on that weekend, senator, if you're home on that weekend, you simply hand your ballot to a relative, a parent. They can deliver that ballot for you. That's fine. That's copacetic. That's good. At the end of the day, we want every eligible voter to cast their ballot. And I want you to know House Bill 397 is a good bill. It supports the integrity process, and I urge you to vote yes. Thank you, Mr. President. I yield. Senators yielded. Does any of the senator wish to speak on behalf of the bill? Chair, is there any objection to previous questions being ordered? Chair, is there any senator from 25th? Would you like a close debate? Thank you, Mr. President and colleagues. Is there any former election official in this body? Is anyone served as an election official? Is anyone ever worked an election? You've worked elections. Great. I served as chief registrar for 16 years. When I first got appointed chief registrar in 1999, my first duty was to appear before the state election board, who Lewis Massey was sitting on that board of secretary of state. I had to come up and try to repair what our former chief registrar had done in Baldwin County. I got that case dismissed for the next 16 years that was not another complaint, not another appearance ordered before the state election board. The state election board has always had the ability to investigate elections. That's what they do. That's what they've always done. Now, I heard someone mention water in line. It wasn't water, ladies and gentlemen. It was pizza, chicken sandwiches, hamburgers, fried chicken, you name it. It was rewarding electors, which in the code is against the law. You cannot reward anyone to register to vote or to vote. ELEC is, and our secretary of state is purging 455,000 voters. Through, I think, about 200,000 was from ELEC, but what about the other 255,000? We've got to find a better way, and this is what this bill is doing. How did we use the register to vote? We had to go to the library? We had to go to the courthouse. We had to go to a bank. Or we had to go to a voter drive that was being held. And in order to hold a voter registration drive, you had to go get trained at the registrar's office to hold this voter registration drive. You just couldn't go and hold a voter registration drive. You know what? You can take this little thing right here, right now, and register to vote. You can take your phone and you can register to vote. Ladies and gentlemen, it has been said. We're going to make it easy to vote hard to cheat. And that's what this legislature has done for years. I've seen cheating. I've seen ballot harvesting. I've been in the registrar's office when we had 25 absentee ballot applications come over our facts plan. And you know how we caught them cheating? They actually fact in an absentee ballot application over people who had died since the last voting cycle. It's out there, ladies and gentlemen, and that's what we're trying to do is to stop that. You know, I heard Cobb County mentioned. Cobb County is the county that set up this pop-up voting sites. After early voting ends on Friday, there's a lot of work that has to be done. People have to be given credit for voting. They have to go through the voting role and compare the people who have voted early voting to make sure that on Tuesday, they don't show up and vote again. So you've got to have some order. You know, everything we do, regardless if it's getting a driver's license, being in this legislature, there are rules. We follow rules. We're born and we follow rules every day of our life. But Cobb County, that county that had the pop-up voting, is also the county that refused to accept the districts that were drawn by the legislature. Yeah. They're going to, they're in the wild west. They're going to do what they want to do. They're not going to follow the rules like 158 other counties. And the courts had to make them go back and follow the districts that the legislature had drawn. I risked my case. I'm not an attorney, but I was an election official and I know what I'm doing. And I thank you, Mr. President, I yield the oil. Does any of the senator wish to speak for against the bill? The question is on the adoption of the committee substitute. Is there a objection to the adoption of the committee substitute? Hearing none of the committee substitute is adopted. Is there a objection to agreeing to the 40 committee, which is favorable to the passes of the bill? Chair here is not an important committee is agreed to. Is there a objection to the main question being ordered? Chair here is not a main question is ordered. The question is on the passes of the bill by substitute. All those are favourable, but yeah, opposed. Now you say to your one-month machine. Thank you. Thank you. All the passes of the bill, the A's are 33 and the NA's are 23. This bill has received rics and constitutional majority. Therefore pass by substitute. Secretary Reed House bill 398. House bill 398. Representative Hagen, 156. House bill 399.\n\nand exemptions, requirements and disclosures, survivor definitions, survivor inspections, survivor civil penalties, survivor conforming changes to men chapter 60, Title 36, the LTSGA, Relative General Provisions, applicable to county and municipal corporations, such a prohibit local regulation of college food items to arrive related matters to field convocating laws and further purposes, Mr. President, Descendant Committee, and I have co-occurring to Mr. Morpheirs. Recommends that this bill do pass or exactly submit it to Senator Goodman, Chairman, that completes the order, Mr. President. Senator from the 11th. So, this is dealing with our cottage food industry in our state. Currently, if you're baking and cooking in your home, you're able to sell cottage foods directly to the consumer. And what this bill does is allow you to now sell your baked goods, your non-potentially hazardous foods directly to a third party or retail grocery store. So, this is just allowing folks to bake goods in their home and then sell them to individuals, but also sell them to retail establishments or through a third party. That's what the bill does, Mr. President. Be glad to take any questions if there are any. You have no questions, Senator. All right, thank you. I appreciate your vote. Yield the will. Does any of the Senator wish to speak for against the measure? Chair, his none. Is there objection to the previous question being ordered? Chair, his none. Previous question is ordered. Is there objection to agreeing to the party committee, which is favorable to the vastest of the bill? Chair, his none. The floor of the committee is agreed to. Is there objection to the main question being ordered? Chair, his none. The main question is ordered. Questions on the passes of the bill? All those in favor of a yay, all opposed nay. Secretary, I'm not in the machine. All opposed nay. All in the pass of the bill, the a's are 54. The a's are 2. This bill, him, received it. The greatest of the bill is their poor pass. Secretary, please read the bill. 371. House bill 371. Representative Porter, 174. Another bill is being turned on to amend. Code 2nd, 222-260. The bill is going to dorshan annotate. All the two capital outlay funds generally under the quality basic education access to provide for an increase of the state's maximum authorization of capital outlay funding from 300 million to 375 million annually to provide for lay to marriage, for repeal of the working laws, and for other purposes. Mr. President, the Senate Committee on Education and Youth recommends this bill to pass. There's exactly some minutes that are hickman, chairman. Mr. President, the Senate Committee on Education and Youth Office following substitute to House bill 31 to build the committee on that to amend part 10, Article 6 of Chapter 2 of Title 20, those CGA, which are capital outlay funds are in the quality basic education access to provide for an increase of the state's maximum authorization of capital outlay funding from 300 million to 375 million annually to require that for each new elementary school can struck an honor after July 1, 2027, which includes a playground such as a playground which will meet certain standards for an effective date to provide for lay to marriage, for bill working laws and for other purposes. Mr. President, I can please the order. Mr. President, good afternoon colleagues. Happy to bring you House Bill 371. It really has two portions, two different issues, but two things that are critical for us moving forward. Section 1 is a bill that simply increases the cap on our capital outlay funding from the current statutory amount of $300 million up to $375 million, of course subject to appropriations. This increases largely due to something that we're all familiar with, which is the increasing rise of construction costs that has been associated with building this, of course, certainly impacts education sector as it does all sectors across the way. And increasing this number from 300 million to 375 million simply keeps us paced so that these grants can be still done in a meaningful way to the schools that need it. Section 2 is a little different. This bill deals with the minimal facility standards for school recreational facilities. Think of the playgrounds that are at our public schools. As a parent, I know the first hand and so do so many of you know the first hand of dropping your child off at a playground and the fun and the laughter and the camaraderie and the childhood experience building that happens there and the pride as you watch your child there. But for too many children, these are moments that are simply beyond what they're able to reach, both physically and unfortunately emotionally. House bill 371 seeks to update the minimum requirements for playgrounds ensuring that newly constructed playgrounds after 2027. So we're giving some time to ramp up and be able to comply with these requirements, meet the accessibility requirements and standards for the inclusive recreational facilities that not just some children but all children deserve including those with disabilities. The truth is our current federal ADA regulations don't sufficiently address this issue and they fall short of getting children with disabilities the full and unfettered access to the playgrounds in our public schools. By updating these mental standards, we'll ensure that all children regardless of their ability or kids that can when the recessed bill rings, they can enjoy time with their fellow students. Just a few point things I want to point out beginning on line 54, HB 371, inputs the provision that every playground constructed as I said in 2027 and after must be accessible by a sidewalk or pathway from the school. Why is that language in there? Really simple. Children in a wheelchair can't transition from a sidewalk area to a playground that doesn't have direct access from the sidewalk to the actual playground area. Another example, line 63, updates that the surface requirements for the playgrounds that would be constructed in 2027 and after for the floor be friendly to children that are in wheelchairs and have the kind of material that they can be on the playgrounds as well. Finally, line 66 include additional accessibility provisions aimed at providing additions that would be more accessible such as adaptive or accessible swings, equipment designed to be used by children in wheelchairs and wheelchair accessible raised structures and slides. Colleagues, I encourage you to support this important measure. This will make sure that every child, regardless of their physical condition or whatever their abilities are, have the opportunity to play and build those childhood memories that we want all children to have. During my work on this bill, I will tell you that I realize that children don't see physical limitations the same way that perhaps you and I do. They just want to feel included and they just want to play. Let's pass this bill and make sure that after 2027, all children, regardless of their physical stature, will in fact be able to enjoy the playgrounds that our public schools have. Mr. President, I'm happy to answer any questions or I'll yield the will. You do have one question, Senator. Yes, sir. I'll send it from 30 second. Thank you, Senator. Would you yield? Certainly, will, from a few to 30 second. You may not know the answer to this, but were you aware that I was chair of a charitable foundation and our mission was to create accessible playgrounds around the metro area? Senator, I did not know that, but knowing your passion for children and your cheering are senate children and families committee, that does not surprise me. Would you further yield? Sure. I think that's one of the most expensive components of these playgrounds was not so much the equipment as it was the surface. So I'm a little concerned about the 80% and I'm questioning whether that's the entire open area on which the playground sits or is that just the area that's immediately under the playground equipment? Senator, looking at the language of the bill. It's starting online, 603. Thank you, Senator. Unitary surfacing shall be used around at least 80% of the playground area. The minestanding that would be for yes, the entire playground area and I think the purpose of that would be so that children in wheelchairs in fact could access a significant portion of the playground area and as the bill is constructed, it would be at least 80% of that. Would you further yield? Sure. One of the things that we found is that there were walkways. There are sometimes walkways in the area and that the area that was most risky for injuries was kids falling off of the equipment. And again, it's special equipment that has ways to try to prevent that. I guess I'm trying to understand if the walkways or any other ways for the kids to get around would be included, would they be counted in that 80%? I don't think the walkways themselves would be included in that 80%. I think the driver behind the walkways is trying to make sure that what we've seen in my understanding the most common problems are where you have elevations that are different from the walkway to the playground area. I've also seen pictures of where the playground area was encircled with a small fence or maybe even a larger fence and those type impediments that some children can get over but some can't. They're not obviously always in a wheelchair but that's the one that we perhaps most commonly think of. So I don't think those walkways would necessarily be included in 80%. But I think what the Bill seeks to do is strike a balance between making sure that a significant portion of the playground has the kind of material under it that a child in a wheelchair can navigate and access as much of the playground as possible. Not all of it but 80%. Thank you for the questions. Thank you Mr. President. I urge your strong support for this bill and I will yield the well. Senator from 27th of the United States of the measure. Senator from 30th, you might speak to it. I know you want to ask a question. Well, he's our yielding. It's a good bill senator from the 26th. I heard you from up here. Recognize the center for the 27th. Actually, I have no idea senator if it's good or bad. But the protein is a good man. So I'm sure he's hearing a good deal. Mr. President, colleagues, thank you. I have had the opportunity to speak with the House author of the original version of this bill. And I believe that he has an incredible spirit of heart towards seeing the accessibility of playgrounds expanded. I commend him with that. I have communicated a concern that I have and I would like to ask him since he's in the room when this comes back over your way if you would consider the following. I'm concerned that what we're doing here is disincentivizing larger playgrounds. Because what we're doing is by saying that 80% of the playground surface has to be either turf or that poor rubber. That if you want to build not a 10,000 square foot playground, but a 40,000 square foot playground that now 32,000 square feet of your playground surface has to be made from material that is very, very expensive. And so I would I'm going to be opposing the bill on my vote not because I oppose the spirit of it, but because I think that while a lot of will go and a good amount of thought has gone into this. I know that the playground that my kids play on is well more than 10,000 square feet at their school. And I think we're disincentivizing and we're making it very expensive for schools to put in open spaces. So I think what the center from the 30 second recommended to my friend from the house, I think it would be a great idea to look at now. Maybe look at doing this this poor rubber surface at and around the playground areas, but maybe not in an open area that happens to also be part of that playground area. So I think that when I think about for Scythe County where we've got some open space, I think that this bill is going to have it's going to do one of two things. It's going to make these playgrounds more expensive than they should be or it's going to cause us to build smaller playgrounds. So as this comes over Mr. Pro Tem and to my friend in the house, if you all would just consider that before this reaches final passage, I'd be grateful. Thank you so much. Is any other soon to which fee for against measure hearing nine center from the 18 don't need to close or anything. Is there objection to the previous question made order chair here's done previous question is ordered questions on the adoption of the committee. Substitute is the objection to the adoption of the committee substitute hearing nine the committee substitute is adopted. Is there objection to agree to the board me which is favorable to the passes of the bill chair here's done for the committee is agreed to is there objection to the main question be in order chair here's none main question is ordered questions on the passes of the bill by substitute all those in favor of the bill vote. Yeah, all opposed. Thank you. You You You You That's You You You You You You that constitutes from majorities in the fourth pass by substitute. Secretary Sinneville, 214. Senate Bill 214. Vice Senator Burns, the 23rd and others, Bill Tumin, the Title IX to amend chapter 2 of Title 21 of the official of Georgia annotated with two elections in primary generalies. Those authorized electors to cast physical absentee on request ballots as an alternative to using other authorized means of casting in person votes. Tribal procedures for formal collection and tabulation such ballots arise reporting provisions for two reference such ballots for later matters to be able to move in laws and for other purposes. Mr. President, the Senate can be around. Ethics recommends this bill to pass by committee substitute, respectfully submitted, Senator Watson, Chairman. Mr. President, the Senate can be around. Ethics offers following substitute. Senate Bill 214. Bill Tumin, the Title IX to amend chapter 2 of Title 21 of the official of Georgia annotated with two elections in primary generalies. Those to provide for new voting equipment by the state using an optical scanning voting system and hand-marked paper ballots to write for ballot on the ban printing to arise and provide for definitions to appeals to proceeding provisions to authorize the uses of an election equipment for accessibility purposes to revise provisions for each of certain offenses to include references to new election equipment systems, arrive for later matters for people who are looking to laws and for other purposes. Mr. President, I complete the order. Senator from 23rd. Good afternoon colleagues. I want you to know I took three volumes of Lord, my blood pressure of about 30 points. And now I want to bring you Senate Bill 214. It is an election bill. You might want to pay attention. Good bill, good bill. Senate Bill 214 provides for hand-marked paper ballots. It removes ballot marking devices. It eliminates QR codes. It increases voter confidence. It ensures that election systems cannot be hacked. And I think this is a bill that can receive bipartisan support. A little bit of history. Four years ago when we were debating SB202, long time ago, I made a suggestion that if anyone wanted to utilize a hand-marked paper ballot, all they had to do was ask for an absentee ballot. And you can. You can ask for an absentee ballot. You have to ask for 11 days in advance in order for us to mail it out and for you to have time to return it in some fashion. But it's seen not unreasonable that you should be able to go to the polls during early voting or even on election day and ask for the same thing. So what this bill does, SB214, is resurrect the original concept of a paper ballot using the absentee ballot as the model. I want to thank the individuals from Gabrielle that's worked with us on crafting this bill. We recognize that there are some issues that we've got to continue to refine. We also recognize that there's some cost associated with moving to a new system. But I'd remind my colleagues that at this time we are in the latter stages of our current election system and it would not make sense to continue to invest in an old approach, but perhaps address a new approach. So let's take a look at what the bill does and I'll quickly walk you through it. First of all, it is a hand-marked paper ballot. The ballot itself is marked by the individual voter. The voter uses a hand-marking device, often called a pen, that marks the ballot that they can read. There's no QR code. They take that hand-marked paper ballot and they submit it to a scanner, a tabulator, that senses the mark on the ballot, an optical scan, records the ballot tabulation, takes an image of the ballot and then secures it for future verification. So, hand-marked paper ballots. It does include machine tabulation, but it's the machine tabulation of the voter after they marked the ballot, physically inserting it into the tabulator and verifying that it was read correctly. If there are stray marks, if it could not be read, if there's a crease or a creak or a problem, it would be rejected. The voter would make the correction. There would not be a need to procure any ballots. It does require that you include a concept called ballot on demand printing. So, as you check in through our current verification system, our current voter verification system, we currently use NOAAX system on poll beds. That would then allow for the ability to print a unique ballot style for that electorate. You would print one ballot for one voter. There would be NO stray ballots. There would be NO pre-printed ballots with the exception of emergency ballots if the system went down. That means that every voting system would be the same. They would all be on hand-marked paper ballots. They would all be machine tabulated. You could do that during absentee voting, advanced early voting, and election day voting. The only challenges we continue to resolve, we have to provide for accommodations for special needs electors. So, quickly, if you look at the bill with me and I'll be brief. Lines 13, if you're 14, just define ballot on demand printing. We have to have ballot on the brand printing to implement this concept. You'll notice on line 27, we define non-electronic ballot markers. You say, what is that? Well, that's the legal term for PIN or pencil. I'll be glad to read you that out of code if I can dig it out of my notes. OCGA, 21-2-2, definitions, subparagraph 2, ballot marking device means A PIN, A pencil or similar writing tool. So, that's where you get the term non-electronic ballot marker. Notice in lines 33 and following the state shall furnish optical scanning voting systems in ballot on demand printing. It's interesting, we already have the optical scanning system, we need the ballot on demand printing. So, we're recommending this legislation that it not be an unfunded mandate, but the state provide the equipment necessary to implement this concept. As we look further in lines 4 or 45, it allows the Secretary of State to conduct pilot programs, which he has the ability to do now, but it just expands it to include optical scanning voting systems. We removed section lines 69 through 83 because we no longer need them. Those were, that was a special opportunity where we involved included in SB 189 last year so that small elections could be using hand-marked paper ballots. This legislation will let all elections do that. This in section 3 line 90 that we would implement this system simultaneously. So, once we begin to move to the system, we would go simultaneously. Section 5 deals with accommodating voters with special needs. So, there has to be some mechanism for supporting special needs voters. Originally, the Dominion system was designed to provide that capability. Georgia adopted it as a standard, although it's not necessary. Section 6, 7, 8 and following basically is clean up language as we move to the new system, the optical scanning voting system, so that all the laws restricting tampering or intruding or changing or manipulating become criminal offenses. I'd like to point out one other thing and then I'll take questions. This is a map of the United States. I don't know you can't see it, but I think you can see colors. This is from verified voting and they point out that 66.7% of America votes with a hand-marked paper ballot. There are only two states that utilize the current electronic voting system that we use, BMDs, ballot marking devices, and that's Georgia and South Carolina. I think it's time for us to reconsider. I'd like to point out that this system mirrors what is currently being used in the state of Virginia and has worked well there in that environment. So thank you for the opportunity to present SB214 and I'm happy to take questions. You do have a couple questions, Senator. I recognize Senator from the 26. 26. My good friend from the making. Thank you, Mr. President. Senator, the year. Absolutely, sir. How much is this new system no cost? It's a great question. Currently, we're working on the cost associated with it, but the only additional equipment that's necessary is the ballot on the man printers. They're about $7,000 a piece, $6,500, $7,000 a piece. That means we need that printer for every precinct in Georgia, especially every early voting precinct, but every precinct in Georgia, unless we allow for preprinted ballots, which I'm opposed to, I want you to know Senator that it is a fraction of the cost that the Secretary of State recommends or has requested for enhancing the current voting system. So his request was for $66 million. $66 million. We believe that a reasonable estimate for this system across Georgia is less than half that. Senator Fair the year. Certainly. When I go home and look, yes, sir, my basically a hand mark ballot. I take a marker. Yes, sir. On the computer, I hit the square to the candidate of the issue. When I get through, I take it to the tabulator. Correct. And they make a copy. So we spent all this money on elections and these machines. And now you're talking about starting all over again with a new kind of system. We're going to a next generation system, Senator. The current system is eight years old. It will be up for renewal, a replacement in 2028. We could do that earlier if you choose to, but at the end of the day, you can't continue with the same system beyond its useful life. And I would suggest that this is a less expensive, more secure and a much more palatable system for the voter. Certainly. Certainly. It's just the only system like it. We're going to put our bids for folks to be. We're not recommending any vendor, Senator. This is a recommendation on a concept. So the concept would be to move to a hand-marked paper ballot, recognizing that we already have that, it's called an absentee ballot, recognizing we already have the ability to tabulate that hand-marked paper ballot. We already tabulate that absentee ballot. So we have the back end of the system. And we have the voter verification system that we commonly refer to as poll pads to check a valid voter end. And so what we do is take that. And the only additional equipment or process would be the ability to print ballots on the man. I want you to know we work with a...\n\nWorking group from Gary O. These are election officials across Georgia who have helped us craft this legislation and they feel that this is a reasonable approach to moving to the next generation of voting systems in Georgia. This senator from the 54th. Thank you, Mr. President. Senator Yew? Yes, sir. Currently the process has been passed when we had paper ballots if there was a human's when Nink Piner going to miss mark. Yes. And make errors on the ballot and when it's miss mark, it can never be scanned properly. That's correct. So my question is, you know, the way it is done right now with absentee ballots, we still do it with absentee ballots. At the end of the night you have one member of the Republican Party, one member of the Democrat Party. And the election judge, all three sets of eyes look at the ballot that's incorrectly marked and they easy to decipher what the intent of the voter was. And then they fill out a new ballot the same way the voter admit and then they staple the old ballot to the new one. That's correct. So we run the new one through the scanner and then staple the old one to it. Is that going to be the same process for these as well? That would be the same process for the absentee ballots for the voter submitted ballot. If for any reason that ballot is rejected by the scanner, it would immediately return to the voter. The voter would make the correction. There'd be no need for an adjudication panel. There'd be no need for third parties to attempt to interpret what the voter intended. The voter would make that decision, correct their own ballot, resummit it and the process is complete. All right, thank you, Mr. There are no further questions. You've got one more question. Oh, one more. Greg and I are starting from the 14th. 14th. Thank you, Mr. President, does the center yield? Absolutely, for my good friend on Fox. What, no, no, what is it? It's Trump news. That's right. That's Trump morning news. Senator, I understand that this bill creates something you're calling a ballot on demand. Indeed. Does this legislation also create something called a bill on demand wherein you can have a legislation going to law the same year that it has passed? I'm sorry, but Senator, repeat the question. I'm curious if this creates a bill on demand procedure, also where it can become law the same year that we pass it out of the Senate. That's an interesting concept center. I'm really not sure I can respond appropriately. I think we'll have to wait to see if there's anything called a bill on demand. We got to wait. Okay, thanks, Senator. Appreciate it. I appreciate it. Thank you, Senator. Thank you, Mr. President. I yield the bill. Senator, the bill is yielded the bill. Thank you, Senator. Thank you, Mr. President. I rise colleagues in opposition to SB214, but not for the reasons that you might suspect. And I want to make this clear, I am for handmarked paper ballots. We'll say that again. I am for handmarked paper ballots. And I want to remind folks that Democrats have been in favor of handmarked paper ballots for years. In fact, in 2019, we advocated for it. And I distinctly remember a well-speech by the senator from the 44th, where she advocated for handmarked paper ballots. But we were told that the system would be too expensive. The $100 million that it would cost to implement handmarked paper ballots would be too expensive. So we went to ballot marking devices. And several hundred million dollars later, here we are, about to make a switch. Let me say that again. Several hundred million dollars not only spent by the state of Georgia, but by our counties, have been spent on a system that we are now looking to go change and go to handmarked paper ballots. We could have saved the taxpayers of the state hundreds of millions of dollars not only at the state level, but at the local level. So laying that on the table, the fact that Democrats very much support handmarked paper ballots, I want to point out some issues that I have with SB214. The first is that I agree with the senator from the 23rd, the vast majority of Americans vote by handmarked paper ballots. However, what we would be doing with this bill would create an unnecessary and potentially expensive experimental voting system by mandating ballots on demand. The first thing that, in my opinion, is high risk because it hasn't been deployed at a statewide scale anywhere in this union. There is no state that does ballot on demand printing statewide. What do they do instead? They preprint, they preprint ballots and they have controls for that. So, there are only 70% of Americans that vote by handmarked paper ballots, nearly all of them vote on pre-printed ballots. So what we would be doing here is creating a new voter system that's handmarked paper ballots by ballot on demand. And I know that the senator from the 23rd pointed out that Virginia uses a system they do, but they do it on a limited basis. Counties have the option to use ballot on demand, something that I think makes sense for the state of Georgia. We should make it optional. If a county wants to use ballot on demand printing, they should absolutely be able to do that so that their residents can vote, their citizens can vote using handmarked paper ballots. But if it's more economical and it is to pre-print those ballots, then we should be allowing our counties to save our taxpayers money by allowing them to pre-print ballots. So the fact that we would be implementing a statewide mandate on ballots on demand would cause a rush to implement an experiment. Colleagues, I want to let you all know that based on the complexities of our local elections and our statewide elections, about 120 counties would be able to pretty easily use pre-printed ballots without any issues. Now, bigger counties like the counties that I represent would have a whole bunch of styles, a whole bunch of different style ballots forms that could be printed. But the vast majority of your counties don't need ballot on the man, they could print the ballot before the election and use it just fine. So we would be causing those 120 counties to spend more money on ballot on demand printing. Again, something that has not been tried statewide, mandated, statewide in any state in this country. Colleagues, we've made two major mistakes in the last two decades with voting systems. Because we've implemented these systems without adequate deliberation and making sure that the experts are being heard and that their input is being adhered to when we pass these laws. Whether it's the legacy DRE system touchscreen that was found unconstitutional by court, or it's the system that we have now, which, whether you're on one side of the aisle or the other side of the aisle, you can find issues with it. Making sudden decisions without listening to our experts to adopt a new system instead of using systems that are already being used across the country will lead to more issues. A far more conservative approach, colleagues, would be to use hand-marked paper ballots with the optical scan voting system that we have today. We would have to buy new optical scanners because we already have those scanners. We could convert to hand-marked paper ballots today at a cost that is much less than this system that's being proposed ballots on demand or likely removing QR codes that the Secretary of State says would have to cost at least $70 million. So colleagues, I'm urging you to think about this and use a much more conservative approach by using the scanners that we have already and just converting to a hand-marked paper ballot system. Now here's my second issue with this bill. Is that this bill doesn't do anything right now. That's because this bill hasn't crossed over. So we would potentially pass this bill and it would sit in the house and the house wouldn't take action on this until next year, which means that we wouldn't convert our election system until after the 2026 election. Why do I have concerns about that? Because, as I said before, there are people on both sides of the aisle that can point to issues with the current system that we have. But not only that, state law requires that we remove a QR code. We're concerned about money, right? The Secretary of State has already said that just removing QR codes would cost $70 million. Do we really want to spend $70 million on a system that we're going to phase out anyway? Why not save that money, move to a hand-marked paper ballot system and save our taxpayers that money? Not only that, the President issued an executive order mandating the removal of QR codes within six months. Colleagues by my math, there's no way that this bill would address that executive order and I'm all about state's rights. But by my count, we have a state law and an executive order mandating the removal of QR codes which would cost our taxpayer $70 million and what we're doing is, we're essentially requiring the Secretary of State and our counties to spend this money so that in two years, we can go to a hand-marked paper ballot system. We need a solution now. We need to make sure that we address this train wreck now. Let's stop wasting taxpayer dollars and do what 70% of the country does by using a system, a hand-marked paper ballot system that is pre-printed, scanned, tried and true. And let's get away from experimenting with our election system and with the money that are harder and by our taxpayers. And Mr. President, I will yield for questions. You do have a couple questions. Recognize the Senate from 28. Thank you, Mr. President. But I really had it on for the other speaker. But with you, you yield? Yes. In the true that paper ballots are in control for as long as we have been in the state of Georgia until just a few years ago, ten years ago, seven years. Then we just said before, in the true that some people thought it was the best way if it was problems. So they started. Many of the counties have a paper ballots in addition to what they have. And when they vote on the electronic way, they get a receipt and they put the receipt is the paper ballot. So we have to sign off on it and put it wherever they put it. Addiction about that. So yes, Senator. And the issue is that Georgia has been, has used paper ballots, hand-marked paper ballots in the past. But the issue that I have is that the last two election systems that we've had have been experimental. We have been trying to be on the front edge of election systems when the rest of the country has continued to use hand-marked paper ballots. And what I'm saying today is that we should stop doing that, stop experimenting with tax payer dollars and just go to what is tried and true and use not only across the United States, but use around the world. Handmarked paper ballots. And we can have those optically scanned using the systems that we currently have saving millions of dollars of tax payer dollars. And a system that we can use for the foreseeable future. My whole problem is that we're supposed to be working toward a papalist society. And now we're going to add paper ballots, which causes a lot of government paper to be used. And Senator, I understand that concern, but I rather not experiment with the taxpayer dollars of the people of this great state. And I rather go to a system that is used by the vast majority of the country that is tried and true and that Georgia has used in the past. So I think that we should stop spending money on a system that we've already seen issues with and do something that's more sensible, more conservative, that would say taxpayer is money. Thank you. We're going to send from the 36. Mr. President, Senator you. Yes. A senator. I heard you say that the own request ballot approach is not used in any other state in the country. Is that, are we hearing that clearly? Could you? I want to clarify to make sure this is clear. The ballot on demand is used around the country, but it is not mandated statewide like this bill would. So what most of the country 70% roughly requires is that their ballots be hand marked. There are provisions in those state laws that allow for counties to use ballot on demand printing. I'm not necessarily trashing ballot on demand printing. What I'm saying is that could be wholly unnecessary because we should be doing what the rest of the country does, which is giving our state's, our county's flexibility to use either ballot on demand printing or to have ballots pre-printed, which would be cheaper and would allow those smaller counties to save a lot more money than relying on printers that can break down and can be very expensive. Some of these printers can go from $7,000 all the way up to $20,000 or even more. They're very expensive. So why go to that when nowhere else in the country is mandating that every county use that ballot on demand printing? Thank you. I understand that. Thank you for that clarity. And so as I hear you, the best thing to do would be to decline these ideas in this bill, in SB214, and work on a more measured approach that is conservative and mindful of taxpayer dollars being spent wisely, not in problematic ways. That's right, Senator. And I think that there are some simple fixes that I'm happy to work with the senator from the 23rd district on. I think we should be removing the references to the requirement for ballot on demand from the bill. There are several places where it requires ballots on demand. If we were to remove that, I think that would be helpful. But aside from that, the issue is that this bill does nothing to address the issues that we have right now, which is QR codes have to be removed by state law. The executive branch of the federal government is also required us to do it. And doing so would cost the state whether at the county level or at the state level $70 million. That's a lot of money that will be wasted because the following year, we already know where we're going, we're going to be going to hand mark paper ballots. So we're essentially asking taxpayers to spend money temporarily on a system that we're going to phase out anyway. Well, thank you for suggesting a common sense approach and a conservative approach to tackled this. Thank you. And with that, Mr. President, I yield the well. Senator has yielded. Does any other senator wish to be out? Senator from the 40th. Thank you, Mr. President. Colleagues of the Senate, I am experiencing some serious deja vu right now because I was here in 2019 when we had this whole debate House Bill 316 about getting a new voting system. Because we were using these old DREs that recorded nothing that could be inspected afterwards. So we had to move forward. But like the senator from the 35th, I stood here and I argued for hand mark paper ballots. I support hand mark paper ballots because you know the voters intention the problem with the BMT. If everybody could settle down a little bit, quiet, the chamber a little bit, so and pay attention to the center in the well, please. Thank you, Mr. President. The problem with the ballot marking devices was that the machine marked the ballot and the voter had to check it to make sure it was all correct. So the vote was correct and there was concerns about whether the voter could do that accurately and votes could get misrecorded. So that was the issue. But the Republican Party in charge decided to go forward with a more expensive system because hand mark paper ballots were actually much cheaper. And so they went on with a more expensive system, bought this whole fancy BMD system. And the senator from the 26th asked the senator from the 23rd about cost. And notice we don't have a physical note, but the senator from the 23rd did give us a few little details about what this machine cost or that machine cost, but he left a big part of the picture out. When we bought those machines in 2019, we bought them on a 20 year bond at 5.77% interest. So folks, if we ditch these machines now, we will still be paying for them until 2040. Now I don't know about you, but I don't think this is visibly responsible. Now these bills came up late in the process. There were issues with them not being vetted. This one hasn't even gone to the house yet. But we are moving way too quickly and not paying enough attention to some really important big details like the fact that these current machines were bought on a 20 year bond. And whether we use them or not, we're going to be paying for them with taxpayer money. This bill is not ready. The other bill is not ready. We need to be more mindful of the taxpayer's dollars. Thank you and I'll yield to questions. You do have a couple questions soon. We're going to send them from the 23rd. Senator you. I do. I'm delighted to know that you support the concept of him or her paper ballots. I do. Okay. So apparently the issue is whether or not we use a preprinted ballot or the ballot neatly printed for the electors. That correct? Well, that is one of the issues that has been debated, but that's not really the issue that I'm speaking to and the well right now. What I'm speaking to is the fact that we are not even done paying for these machines that we have currently. What would the center for you? Currently we are in what year of the dominion contract? Do you know? Well, the money was allocated via a bond in the 2019 budget. We are now getting ready for the 2026 budget. So that 20 year bond goes through 2040. So it's a center for the your concerns with the financing of the electronic BMD system. Is that not true? Yes. And some of the concerns that the senator from the 35th raised about some of the things that are coming from the federal government about what we can and can't do. Over and over again, we are deciding to spend money on certain types of machines that we aren't going to use long enough to justify the expense. And we made that mistake in 2019. We're making that mistake now. And we could be making the same mistake three or four years from now. We need to slow down. What's one more question, Senator? Currently, I believe the senator from the 34th, is that right? Made the point that the request has been for some 60 to 70 million dollars to upgrade on old systems. Is that not true? I am not familiar with those details. Are you talking about the current request from the secretary's day to update the current dominion electronic system? Because of the codes, the QR code. Okay. So again, when I stood in this well in 2019 and when this bill went through committee, House Bill 316, 316, again, I had an amendment that said we needed to not use a QR code because the voter couldn't check the QR code. I was not here in 2019. Well, I was. Well, I know that. But my point is, would you spend more money on a system that needs to be replaced or would you replace it with a better approach? Thank you, Mr. President. Are you? I don't think you gave me the chance to answer that. Okay. I will answer it now. All I'm saying is that we need to be more careful with the taxpayer's money because we're talking about buying new machines. We didn't need. We don't need that. If we had done it right in the first place, we wouldn't have needed that 60, 70 million dollars. And we need to be more conscience of the taxpayer's money. I bet you didn't even know when you answered the gentleman from the 20th, the senator from the 23rd, when you asked the question about cost, I bet you weren't here in 2019. I bet you didn't even know we're still paying on a 20 year bond for those machines. That's the kind of thing that needs to come out through the committee process. I yield the well. Thank you, Mr. President. There's yielded right now at the center from 37. Ladies and gentlemen, the Senate and I rise to speak on support of Senate Bill 214. We've got lots of emails from folks in my district about this question about why would we want to go back to paper and we're in a 21st century. We should be embracing technology and all these kinds of things. And I will tell you one thing that's important about Senate Bill 214. It does embrace technology. In fact, there's this technology that was very innovative. It was invented in China in the 2nd century, it was called pulp paper. And pulp paper is a technology is simple. It's durable. And most importantly, it expresses and retains a voters intent very clearly and maintains it over time. It's not tapable through the internet. It's a very simple thing. And it's been the foundation of voting systems across our country for a lot of years. I raised this because there's some hyperbole on both sides of this question. Mr. President, if you understand our system and you understand that because of requirements to accommodate people with disabilities or Americans with disabilities that requires that there be touch screen systems for people with visible with vision impairments. There's going to be touch screen components of our system no matter what. And because we do absentee voting, there's going to be paper as part of our system no matter what. What Senate Bill 214 does, however, is it recognizes that processes thing one. No technology is a silver bullet that's going to solve all of our problems. But as we have record lack of confidence in our voting system among our population, there's a hot debate in my county about what the best system is. Let me say I'm thankful, Mr. President, that this General Assembly acted in 2019 and eliminated the system we had from 2002 until 2018. From the 2002 general election to the 2018 general election, voters in Georgia voted on touch screen systems that did not produce a paper ballot. Their voters in it was captured only in digits and bytes in a computer system. I think we owe our voters more than that. And what I think Senate Bill 214 does is it recognizes that no matter what we do here, we will always have a subset of voters that will vote with a touch screen because they have to be present for Americans with disability acts compliance and there will always be voters who vote by paper. Shouldn't we as a General Assembly and service to folks having confidence in our system allow their voter intent to be expressed in a technology that is proven over the years. It's called POPAPER and that's Executive Senate Bill 214 does. Let's support voters confidence as we're going from the transition to where we are now, to where we would be. I encourage us to move to a system that's better than anything we've used before. I think Senate Bill 214 is a good step in getting us there. Mr. President, without a yield the well. Senator Gilden does any other senator which speak for against measure. Would you like closed base senator? Senator from the 16th and stay your birthday.\n\nThank you, Mr. President. I'll be brief. I'm delighted that we all agree that it's time to move forward. It's time to recognize that the electronic approaches is not well embraced by a number of our constituents. It's time to go back to that innovative technology of several thousand years ago and put a mark on a paper ballot. It's pretty simple. You got to tabulate it correctly. You got to image it. You've got to make sure it's controlled. You've got to have chain of custody. I think the argument is we don't need to spend money on a new system because we need to spend more money on a bad system. Where is my friend from a second? The gentleman from my sixteen talks about his grandparents and their wisdom and how they shared with him the importance of measuring and cutting. Well, you know what? I do recall the old saying. He says you never throw good money after bad. You never invest in things that aren't working out like you thought they should. Once you have a stock cost, you move forward. That's what this bill does. Now, why should we have print on demand ballots? Well, it's very simple. It ensures the voter, the elector gets the correct ballot. It is a unique ballot for that voter, for that precinct, for the races for which they're eligible to vote. If we pre-print our ballots, we have a major control problem. We have a major chain of custody problem. The cost of printing ballots on demand is a fraction of the cost of changing to an electronic system that would be compatible with the removal of a QR code. So, I recognize that we have a lot of work to do. I realize that this is a approach that we've got to continue to refine. I recognize we've got to make sure we have the resources necessary to get there. But at the end of the day, ladies and gentlemen, I request your support for Senate Bill 214. Thank you, Mr. President. Are you? All right. Question is on the adoption of the Committee Substitute. Is there objection to the adoption of the Committee Substitute? Here, no, the Committee Substitute is adopted. Is there objection to agree to the report of the committee, which is favorable to the passes of the bill? Chair here is none. The report of the Committee is agreed to. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. Questions on the passes of the bill by Substitute? All those in favor of Vogue A, all opposed nay. Secretary, I'm locked in the machine. We're going to have a Senate from the 11th. Part of Mary, I agree. State you inquiring. Is it not true that paper ballots will be the best way to go in the future? We need to do it as soon as possible. It is so exciting to hear everyone in the chamber for paper ballots and not spending $70 million on upgrading that current system. That is correct. I recognize the senator from the second. Parliamentary angle and Mr. President. Mr. President, by voting on SB214, is it not true that the majority party agrees the Democrats were right? I think there's always room for people to admit when they're right and wrong in any situation. I recognize the senator from the 23rd. Parliamentary and Court of Justice. State you inquiring. Is it not true that anyone who voted no on this bill is opposed to paper ballots? Senator, the vote speak for themselves. The vote speak for themselves. On the passes of the bill, the A's are 33. The A's are 23. This bill, him and seated, Rex, the Constitution of Majority is therefore passed by substitute. All right, we've got a slugger report from the House here. So Secretary, read this report. Mr. President, the Senate and the Senate and the little governmental operations has had under consideration for legislation. It has instructed me to port the same message to the Senate with the bottom recommendation. House bill 7562 passed. House bill 768 passed. House bill 7678 passed. House bill 834 passed. House bill 837 passed. House bill 842 passed. House bill 855 passed. House bill 8562 passed. House bill 869 passed. House bill 811 passed. House bill 813 passed. House bill 814 passed. House bill 815 passed. House bill 843 passed. House bill 844 passes. House bill 848 passed. House bill 858 passed. House bill 853 passed. House bill 854 passed. House bill 859 passed. House bill 861 passed. House bill 878 passed. minutes are in Bixon, the Forte-Hot District Chairman, that completes the order, Ms. President. All these bills will be on a supplemental local calendar that will be distributed later today. Let's stand at ease for a little bit, get you a little water break or whatever, and we'll be back in about 15, 20 minutes.",
  "updated_at": "2026-02-13T13:08:48.402007+00:00"
}