{
  "video_id": "njiR6dROs5g",
  "url": "https://www.youtube.com/watch?v=njiR6dROs5g",
  "title": "Legislative Day 5 | 2024 Session | 1/12/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": 5,
  "video_date": null,
  "duration_minutes": 43,
  "summary": "Here is a summary of the Georgia Legislative Day 5 | 2024 Session | 1/12/2024 session:\n\n**Overview**\nThe session featured the introduction of several new bills, including SB 352, SB 353, and SR 443. There were also reports from various Senate committees and a motion to excuse several senators from the roll call.\n\n**Key Actions**\n- **HR 779**: No description provided\n- **SB 159**: No description provided \n- **SB 172**: No description provided\n\n**Bills Introduced (First Reading)**\n- SB 352: A bill to amend Part 1 of Article 1 of Chapter 8 of Title 4 of the OCGA, relating to general provisions.\n- SB 353: A bill to amend Title 32 of the OCGA, relating to highways, bridges, and ferries.\n- SR 443: A resolution appointing individuals to the State Election Board.\n\n**Notable Moments**\n- The Senate recognized it was National Kiss a Ginger Day and joked about the senator from the 19th district.\n- The Senate welcomed two pages, Henley Beckham from Bainbridge, Georgia and Lauren Lewis from Gwinnett County.\n- A motion was made to excuse several senators from the roll call, which prompted some playful banter.\n- The Senate heard an opening prayer and pledge of allegiance led by a pastor from Bethel Baptist Church in Richmond Hill.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nA motion was made to excuse several senators from the roll call, but the outcome is unclear.\n\n**Adjournment**\nThe transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nGood morning, good morning.\nGlad to see everybody here on this Friday morning.\nWe got here early so we can get out early so everybody can get home safe and sound.\nThe time for convenience has arrived. The Senate will come to order. At this time, I will ask all an authorized personnel to exit the chamber.\nRecognize the senator from the 28th for the bringing of the journal.\nGood morning, Mr. President.\nWe'll do you have a couple things I'd like to bring to everyone's attention today.\nToday is National Kiss a Ginger Day, so Senator from the 19th, you and your son better watch out\ntoday. We've got a couple of great pages here today with us. We've got Henley Beckham's come\nall the way from Bambridge, Georgia and we've got Lauren Lewis who has come from\nGwinnett County so y'all give our pages a big hand. Mr. President the journal\nhas been read and found to be correct. Thank you Senator. Is there objection to\nthe spending of the reading of the journal? Chair here's none the reading of\njournal is spent with. Is there objection to the confirmation of the journal?\nChair, here's none. The journal is confirmed. All senators who have bills and resolutions bring to the\nSecretary's desk at this time\nFirst reading references of Senate bills and resolutions secretary\nSenate bill 352 by Senator Anderson of the 24th and others a built-in town a night to a men part one of article one of chapter 8 of Title 4\nU of the OCGA relating to general provisions. Oh, the safety Senate bill 353 by Senator Dolnizal of the 27th and others\nand built to be in town and act to amend Title 32 of the OCEGA relating to highways,\nbridges and fairies.\nTransportation.\nSenate Resolution 443 by Senators, Kennedy of the 18th and others, a resolution of pointing\nrigged jeffries and to the election, state election board and further purposes.\nThat completes the order, Mr. President.\nFurther rules on that last one?\nThat completes the order, Mr. President.\nSecretary will read the communications from the Speaker of the House requesting Senate\nconfirmation of his appointment to the Judicial Qualifications Commission.\nSecretary.\nMr. President, the Senate has received communications from the Speaker and House of Representatives\nrequesting that the Senate confirm the following appointments to the Judicial Qualifications\nCommission.\nMr. Steven S. Green, a copy of this communication\nhas been placed on each senator's desk.\nThat completes the order of Mr. President.\nFor to pursue it to the Senate rules,\n3-3-1, the appointment is referred\nto committee on assignments.\nSecretary will read reports of standing committees.\nMr. President, the Senate committee on finances\nhad under consideration the following legislation\nand has instructed me to report the same\nback to the Senate with the following recommendation\nat House Bill 290 due pass by substitute.\nRespectfully submitted Senator Hubsettler of the 52nd\nDistrict Chairman.\nMr. President, the Senate Committee\non regulated industries and utilities has had\nunder consideration the following legislation\nand has instructed me to report the same back\nof the Senate with the following recommendation\nthat House Bill 455 due pass\nand Senate Bill 205 due pass.\nRespectfully submitted Senator Couser\nof the 46 District Chairman.\nThat completes the order, Mr. President.\nIt is now time for the morning roll call.\nAre there any motions to excuse, Senator from 33rd?\nThank you, Mr. President and the rest of y'all.\nGood morning.\nI'd like for unanimous consent to excuse the senators from the 16th, the 6th, the 38,\nthe 15th, the 36th and 10th, and certain of those are not your old college football signals.\nAll right, second and the second\nSenator has moved that\n16 6 38 15 36 10th and second\nI'm sorry. What was that Senator?\nHike\nI didn't understand the words you said\nFootball your football. Oh, okay. All right. All right\nAll right, either way, you came man and raster.\nYou like Florida State right now, it seems like, so.\nNo, but, all right, here we go.\nYou know, I'll take a motion to suspend roll call\nwith the senators from the 55th.\nWe got a motion and we got an objection.\nThe yeas and nays, on the motion, spin roll call, yeas and nays.\nThe yeas have it, all right, spin roll call, all right, here we go.\nIt is now time for the morning of motion, all senators, take your seats and see\nall conversation. I would ask the doorkeeper to secure the chambers at this time. I now recognize\nour good senator, the good doctor from Savannah, Georgia, to introduce our chaplain of the day,\nand leads in our pledge. Good morning. This is a pleasure, the allegiance.\nI pledge allegiance to the flag of the United States of America and to the Republic of\nthe Change, one nation under God, indivisible, with liberty and justice for all.\nIn the Georgia flag.\nI pledge allegiance to the Georgia flag in the principles of the way to change, wisdom,\njustice, moderation, courage.\nGood morning, everyone. It's my honor today to have the pastor of the day, Brian Cooper,\nof the Bethel Baptist Church in Richmond Hill. Pastor Brian grew up in a pastor's home.\nHe's lived in Richmond Hill, Georgia, which I hope that you know is in Southern Brian\nCounty. He's been in my district since I was in the house and now in the Senate.\nAt the age of 13, he trusted Jesus Christ as his savior. He has served in many\nareas of the ministry as an educator, youth pastor, and a pastor for 25 years.\nPastor Brian has been the pastor of Bethel Baptist Church since 2016. He grew up in\nthe church as his father was pastor for over 34 years. Remarkably, Bethel\nBaptist Church was established by approximately 35 organizers and has now grown to an average\nof 400 members.\nIn fact, it is now undergoing construction to double its capacity in order to accommodate\nthe church's rapidly expanding community.\nPastor Brian, like many of us, loves golf and is a huge, geordable dog span.\nHe and his wife, Ezio, who is over here in the corner.\nThank you for coming up from Richmond Hill and South Georgia.\ngive her a welcome here. So they were married June 27, 1998 and have\nrecently celebrated their 25th anniversary. They have four beautiful children,\nJulia, who's married to Sam, Preston, and then Peyton is married to Sarah and\nJustin. Pastor Brian, I give you Pastor Brian for the clergy of the day and for\nour message of the day.\nWell, it's an honor to be here, thank you, Mr. President, and for the opportunity.\nI don't have much to say, but I do know this, they've given a Baptist pastor five minutes\nthat might be a miracle.\nAnd so you pray that God shows us a miracle today.\nThe Bible says in the Gospel of John, chapter number one, in the beginning was the Word\nand the Word was with God, and the Word was God.\nThe same was in the beginning with God.\nthings were made by Him, without Him was not anything made that was made. In Him was life.\nAnd the life was the light of men. And the light shining in darkness. And the darkness\ncomprehended it not. I love the unity of the Word of God. If you go back to the Book of Genesis\nand you begin there, you'll find that it begins the same way that the New Testament begins with\nwith these words in the beginning.\nI remember being a young man growing up,\nthinking I would never be old enough\nto get my driver's license.\nI remember thinking that it would be,\nthe Lord would come back or something would take place\nand I just would never be able to drive.\nAnd then I got my driver's license\nand then I thought, you know, I'll never get married.\nNumber one, I'll never be able to talk to anybody\ninto marrying me, but I'll never be able to get married.\nI'll never be old enough to get married.\nAnd I got married and we had four beautiful children.\nAnd then they grew up and we're looking forward\ndriving and dad got the insurance bill and so now we should have never started\ndriving at all. But the truth of the matter is is sometimes when things begin we\ndon't always look to the end. When we begin the Word of God in this passage of\nscripture you'll find he says in the beginning and I want to remind you this\nmorning that you're doing a great work. I appreciate I'm thankful for those who\nserve in public life those who take the opportunity to help our great state to\nhelp those who are in need, those who are things that need to be addressed. You, you senators\nare doing a tremendous job and I appreciate and thank you for that. But the fact is everything\nin life begins with God in the beginning, God. The fact that you got up this morning,\nthis day began because God allowed it. The fact that we serve in this area is takes place\nbecause God allowed it.\nIn the beginning, God, life begins with God.\nAnd we need to understand that the responsibility that we've been given, we must first view\nit from God's perspective.\nWhy is it that God put us here?\nWhat is it that God is trying to accomplish?\nWhat is it that is pleasing to the Lord?\nIt all begins with God.\nThe Bible tells us that the powers that be are ordained of God.\nplace you hear for a purpose and God always places us in a, puts us in a place for a purpose\ngreater than ourselves. You understand that as public servants. It all begins with God. And\nwe must also recognize that if everything we do begins with God, then what we do must\nbe of eternal value. I remember being a young man listening to a preacher, he made this statement,\nAnd I've never forgotten it, anything done for eternity can never be undone.\nWhat we do has eternal value.\nThe decisions we make have an eternal value and why we make choices and why we make decisions\nwe cannot choose the consequences.\nWe must live with eternity in mind.\nIn the beginning was the Word and the Word was with God and the Word was God.\nAnd that Word was the light that lighted the heart of every man's soul.\nwe do has an eternal value. And you might ask, why is it important that we understand\nthat every decision, the direction of this state, the direction of our country, we must\nconsider God first, why is that important? Because my friend, everything ends with God.\nThe Bible tells us that Jesus Christ was not only author, but he's the finisher of our\nHe's referred to in the Word of God as the beginning and the end, the alpha and the\nOmega.\nAnd the only thing that will matter when we meet the Lord is what did we do with Jesus?\nThe gospel can change a life, the gospel can change the course of a state, it can change\nthe direction of a nation.\nThe hope is Jesus, everything begins with God.\nWhat we do in the decisions we make, we must consider they have eternal value, because\nmy friend, every one of us will understand one day that it all ends with him.\nThe question that we must ask ourselves in the life that we've been given to live is\nwhat did we do with Jesus.\nI'm grateful for the day, Senator Watson mentioned when I was a 13-year-old boy, I understood\nthat God loved me.\nHe loved me so much that he gave his only son Jesus to die for me.\nAnd I as a young man put my faith in trust in Jesus Christ.\nI didn't trust my works and it trust my ability, I didn't trust my heritage.\nI put my faith in Jesus Christ alone because I've made that choice.\nI know when it all ends, I'll be with Jesus.\nI hope today that you know that.\nI'm so thankful for you and I'm grateful for you.\nchurch prays for you. We pray for the house. We pray for the leadership of this\nstate, because we cannot do what must be done in our own strength. We need God's\nhelp. Let's pray together.\nOur Father, we do thank You today for Your love. We praise You for Your grace and\nYour mercy. God, I ask that Your hand would be upon this Senate. I pray that You\nblessed each and every senator, you would bless their families. Lord, guide their decisions.\nLord, may they consider you with every choice that they make because it all begins with\nyou. Lord, may they understand the value of the decisions that they must make. Guide them,\ngive them the strength and courage necessary to do what must be done. God help our state\nto understand. There's a great work being done here in the capital. Our leaders, Lord,\nI pray that You would encourage them today. God, most of all, may we bring glory to You.\nThe hope of our country is Jesus Christ. May we continue to point people to Him. We ask\nthis in Jesus' name, amen.\nYou\nYou\nYou\nYou\nYou\nthe\nMr. President, I ask for unanimous consent to suspend the rule on the daily order of business\nso that we can take up an adjournment resolution and get the Senate calendar.\nresolution. That's good. Is there objection? I hope not. It is granted.\nYou\nIt's always nice to have our physicians.\nWe'd like to recognize our good doctors and our senator from the 14th.\nThis is his second doctor of the day this week.\nThis is impressive here.\nSo, thank you very much.\nYou\nYou\nI'd like to recognize Senator from the 14th to introduce our doctor of the day, Senator.\nThank you very much, Mr. President.\nFolks, as you can see, two doctors of the day back-to-back.\nIt is undisputed early in the session that Senate District 14\nis the medical capital of Georgia.\nWe're making an early play at medical dominance.\nSo I have the distinct honor of introducing you\nthis morning to Dr. Annie Sayed.\nDr. Sayed has specialties in internal medicine\nand geriatric medicine.\nShe has published on issues such as medication adherence,\nreal frontline, important issues for the state of Georgia,\nand part of its aging population.\nShe also got her medical degree at Dow Medical College\nin Karachi, Pakistan, and has been a Sandy Springs resident\nin the United States for 20 years.\nAnother great story about using worldwide talent here\nin the states and in Georgia to fill the critical needs\nwe talked about yesterday.\nAnd so it is my distinct honor to introduce you\nand give a few words to Dr. Syed.\nPlease help me, Walkmer.\nApplause.\nWell, thank you.\nI'm very thankful to the state legislators\nfor all your efforts to support a strong healthcare system\nin Georgia.\nAnd while I hope you all say healthy and don't need my services,\nbut miss Julia and I will be there if you need anything.\nThank you so much for helping me.\nAll right.\nThank you.\nThank you.\nYou\nWe have a second year in a row.\nWe have a German resolution, which we need to take up, Secretary Reed Resolution of House\nResolution 7779, please.\nHouse Resolution 7779, a resolution relative to meetings and adjournments of the General Assembly\nand for other purposes.\nThat completes the order, Mr. President.\nI recognize the majority leader, Senator from the 51st, speak to the resolution.\nThank you.\nGood morning colleagues, some great day, exciting day, it's Friday we're going home, we're going to move this resolution through and then you can start making plans for your future.\nWe're excited to announce that we have an adjournment resolution that has been agreed upon between the House and the Senate, we've worked on it all week.\nI'd like to bring a few things to your attention that are important to know, as you recall last year we took off from having legislative day on Fridays through the whole session.\nHowever, we made a few changes to that for obvious reasons.\nWe've added four days this year on Friday to be session days.\nAnd those days are January the 12th, January 26th, February 9th, and March the 8th.\nThose are the only Fridays that we will be in session.\nA couple of other things I'll bring to your attention too is the week of February the\nthe 19th through the 23rd, we will be off that Monday,\nthat is President's Day, and we'll also be off\nthat Friday the 23rd.\nWe looked at a lot of the school calendars\naround the state, and a lot of schools are out that week\nfor their winter break, and so we wanted to be sensitive\nto the young families that are in the chamber\nof the house in the Senate, give us a little time\nto be with our young ones at home or grandkids,\nwhatever situation may be.\nAnd so we've added those two days off that week\nso we can be with our families.\nIf you look at day 21 and 22,\nthere's a day off between February 13th and the 15th,\nthat would be Valentine's Day.\nSo we'll be off on Valentine's Day this year.\nSo none of us have an excuse not to be\nwith our sweethearts back home.\ngoing forward, the most important day that you will be looking at is day 40, which will\nbe March the 28th, which will be Sonny Die.\nI want to thank the leadership in the House, the Speaker, the Majority Leader, the Pro-Tem\nover in the House, work with us to get this calendar accomplished again this year.\nI also want to thank our Lieutenant Governor behind me, our leadership in the Senate,\nthe Pro Tem, the Committee on Assignments,\nwe worked on this.\nBut I wanna make one other comment.\nThe reason that we worked on this calendar\na little longer this year was last year\nwas the first time we'd ever had a 40 day calendar\nthat we agreed upon.\nAnd one of the things that we learned from that experience\nwas at the end of session,\nwe felt like we were pushed to get our budget finished over here\non time to get it back to the House\nfor Conference Committee on the Big Budget.\nAnd so we have an agreement with the House\nbetween the speaker and the lieutenant governor\nthat the amended 24 budget will pass the House on day 16.\nIt'll come over to the Senate.\nAnd we have committed to pass the amended budget\nout of the Senate on day 25,\ngiven time for the conference committee report\nto be approved by February 26.\nThe big budget is scheduled to leave the House on day 28.\nIt'll come over to the Senate.\nWe will do our work and then we will return it to them on day 38\nand give us a couple days to work over the weekend on a conference committee\nif needed and then it will be finalized either day 39 or day 40.\nSenators, we appreciate your patience while we work through this adjournment resolution.\nI think it gives everybody an opportunity to plug these days into your schedules\nand build a go-back home and run your business and take care of your family needs.\nMr. President, I'm sure we'll have 100% support\nof this resolution, but I'm happy to take questions.\nSenator from 29th, you have a question.\nOkay, great job, leader, and you have no questions.\nDoes any of the Senator, which speak for the resolution?\nChair, here's none.\nIs there objection to the main question being ordered?\nChair, here's none of the main question is ordered.\nAll the adoption, Secretary, and on the adoption, those in favor of the resolution will vote\nyay, those opposed nay, Secretary-in-Lock machine.\nYou\nOn the adoption of the resolution of the A's are 42 and the A's are zero directorate\nConstitution majority is there for adopted.\nServing from 5th verse.\nYes sir, I'd like to make a motion that we transmit this wonderful resolution immediately\nback to the House.\nMajority leader has made a motion that we immediately transfer resolution 7779 to the House.\nIs there objection, objection, motion prevails.\nAnd by the way, a great job, a majority leader.\nAnd the pro team, I know we did have some good discussions, let's give them a round of\napplause.\nAnd I'd like to echo what you said in the well there, Senator.\nIt was the speaker and the leadership over in the House were very good to work with.\nWe became very popular last year when we had a 40-day calendar.\nand hopefully that will ring true this year\nin a building that's hard to be popular.\nSo it's right now you're on top of your game.\nSo thank you for that.\nI recognize the Senator for our 29th form.\nMr. President, pursuant to Senate rule seven,\ndash 1.10b is in Bravo.\nI give notice that on the next legislative day,\nI intend to move that the Senate consider House action on SB 159.\nSenator has moved.\nSecretary, read the caption.\nSenate Bill 159, a bill by the Senate of the 29th and others.\nA bill to be entitled not to amend Article 1 of Chapter 5 of Title 42 of the OCGA,\nrelating to general provisions regarding correctional institutions of states and counties.\nSo as to provide, so as to prohibit wireless communications and\nstandalone electronic devices behind guard lines to provide for penalties,\nprovide for definitions, and for the purposes.\nThat completes your order, Mr. President.\nSenator, thank you for the notice, and you can make your motion upon the next\nlegislative session, which will be the Monday that we get back.\nSo, all right, thank you.\nOkay, we're going to now moving to the Senate calendar.\nSecretary will read SB 172.\nSenate Bill 172, a bill by the Center of the 46 and others,\na bill to be in town and not to amend Title 50 of the OCGA relating to state\ngovernment, so as to authorize and provide for the regulation and\nTaxation of sports betting in this state to provide for additional powers and duties of the Georgia lottery cooperation\nTo amend title 48 of the OCGA relating to revenue and taxation\nSo as to exempt waiters placed as part of sports betting and further purposes that completes the order mr\nPresident\nGreg and I as a senator from the 46\nThank mr\nPresident I ask for unanimous consent to plates SB 172 on the table due to the\nThe noted absences here today, if this issue deserves a full contingent of senators to be considered.\nThank you, Senator.\nSenator has moved that SB 172 be table is their objection.\nHearing done, SB 172 will be put on the table.\nThank you, Senator.\nWe recognize the senator from the 31st parliamentary inquiry.\nMr. President, I'd like to excuse the senators from the 11th, the 20th, the 49th, and the 52nd.\nWhat are you saying?\nCould you repeat that, actually, Senator?\nCould you just walk up here and get the secretary of those numbers?\nI'm having a hard time here and y'all today.\nYou\nThank you, Mr President. Good morning. I move that the Senate stand adjourned\npursuant to HR 779 until 10 a.m. on Monday, January 22, 2024.\nThe pro-tam pitch in for the majority later has moved that we adjourn until Monday\nweek to 9 a.m. Secretary read the announcements.\nThe rules committee will meet in 450 upon adjournment today.\nThe state and local government operations committee will meet at 12 30 p.m. in 450 today.\nThat completes the order, Mr. President.\nSenator from the 28th, I believe you said you had something you wanted to announce.\nThank you, Mr. President. I got a couple announcements real quick. We're going to do, we are going\nto hold rules after this. I've got a few bills and standing committee that we will be moving\nout today, hopefully. And also, so I do need a quorum, so I need people there. And if\nyour bills and standing. I got a list right here. You may want to come present it. And then also,\nat 12 o'clock today, Georgia Congresswoman Marjorie Taylor Green will be holding a hearing on COVID-19\nvaccine injuries. So if you'd like to click the link, you can actually come click this paper right\nhere so thank you that's all I got. Thank you Senator Senator from the 19th. Our\nappropriation is chair. Thank you Mr. President. Members of the Senate hope you\nhad a chance to grab your budget book yesterday from the Senate budget office if\nyou didn't they're still in the L.O.B. Remember you or your administrative\nassistant can sign out for them. Budget meetings will start Tuesday at 9 a.m. We\nWe will roll through starting Tuesday, go as late as we need to into the evening, and\nthen Wednesday and Thursday's meetings, I believe, start at 8 a.m.\nLook forward to seeing you there.\nIf you're not on our preparations, you're still more than welcome to come.\nIf you're on our preparations, we certainly expect you'll be there, thank you.\nVery important budget week next week.\nThe chairman is taking notes of who's going to be there.\nIt's taking notes.\nI recognize Senator from 43rd.\nThank you, Mr. President, good morning colleagues.\nI want to bring your attention to the fact\nthat today is the Martin Luther King Jr. celebration\nfor our state capital.\nOur special guest is the granddaughter of Dr. King,\nMartin Thirds' daughter,\nand our Lieutenant Governor will be bringing greetings.\nSo we look forward to seeing you downstairs\non the North Wing, and just a few minutes, 10 o'clock.\nThank you, Mr. President, I yell the well.\nThank you, Senator, and look forward to being with you,\non the steps on the North Wing.\nRecognize Senator from the 47th.\nThank you, Mr. President. Happy Friday. I know nobody likes to stay after school any longer\nthan they have to, and today I'm going to ask my state and local government committee\nmeeting to weather the storm with me at 12.30. Here, I need to make sure I have a\nquorum, so if you're on state and local government, please be present.\nWe're going to meet in 450 capital. Thank you.\nAll right, with a pro-timp has moved that the Senate stand adjourned, pursue it, HR779 until\nMonday, January 22, 2024, 10 a.m. All those in favor of the motion will say aye. All those\nopposed, no. The eyes clearly have it. Y'all have to save weekend.\nYou\n",
  "updated_at": "2026-02-12T20:05:51.921887+00:00"
}