{
  "video_id": "npci-7-c5HI",
  "url": "https://youtu.be/npci-7-c5HI",
  "title": "Georgia House - Day 38 (2026-03-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-03-25",
  "duration_minutes": 230,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n## Overview\nThe session featured several recognitions and commendations, as well as the introduction and discussion of various bills related to mediation, civil practice, and dispute resolution.\n\n## Key Actions\n**SB 234**: Adopts the Uniform Mediation Act with some changes for Georgia, aiming to foster and preserve the mediation process as an alternative dispute resolution mechanism.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced according to the transcript.\n\n## Notable Moments\n- The session featured several recognitions and commendations, including for individuals, organizations, and school groups.\n- There was some lighthearted banter and joking between representatives during the discussion of SB 234.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript does not provide any explicit notes about quorum or attendance.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you President of Thomas Allen McCall, recognizing and commending Dr. Sandra Caraway, recognizing and commending for Peace I Rise LLC, recognizing and commending the Philapino American Association of Greater Atlanta, recognizing and commending, Willie Pringle on his outstanding community service, commending and graduating, Taylor Dax. Recognizing and commending the Piedmont chapter of the Georgia Society of the Suns, the American Revolution, congratulating the Rotary Club of Roswell on recognizing April 12th, 2021, as Roswell Rotary Day, recognizing and commending Brandon Salz on winning the class AAGHSA Wrestling State Championship, recognizing and commending Time Morse on winning the class AAGHSA Wrestling State Championship, recognizing and commending Debra Greenwood on our outstanding services and community activist, recognizing and commending. Amara Marcello on winning the class AAGHSA Wrestling State Championship, recognizing and commending Brock Bibby on winning the class AAGHSA Wrestling State Championship, recognizing and commending Debra Greenwood high schools one-act play team on a state championship when commending Georgia alignment and recognizing April 12th, 2021 as Georgia alignment appreciation day at the state capital, recognizing March 25th, 2021 as healthy foundations day of awareness and recognition, recognizing and commending Sandra Holmes on our outstanding community service, recognizing and commending Dr. Ed Williams on his outstanding service as a community activist, congratulating and commending Henry County Schools, recognizing and commending Joel Edwards on his outstanding services, community activist, and for other purposes that completes the reading of the privilege resolutions. Is there any objection to the adoption of the privilege resolutions that Chair here's done and the resolutions are adopted? We are going back to the rules calendar. Back to the rules calendar, Clark will read the caption to Senate Bill 234. Senate Bill 234 by Senate Kennedy, the AT Strickland, the 17th parent and the 42nd, Jones to the 22nd, Watson to the first, to be entitled to an act to amend title nine of the physical to Georgia, and to have a really civil practice, so it's the survivor, uniform laws, governing mediation and participants in mediation, it's bill over for the committee on judiciary, that committee recommends a disbilled do pass. Chair recognizes representative Leveret to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House is my pleasure to present to you Senate Bill 234, which would adopt the Uniform Mediation Act with some changes to make it suitable for Georgia. It is a collaboration and is endorsed by the State Bar, the Georgia Supreme Court's Commission on Dispute Resolution and the Judicial Council. So what this does is it fosters and preserves the institution and process of mediation, which is a type of alternative dispute resolution process. This is something you can do besides go to court and pay lawyers and court calls and court fees and be tied up in court forever. So we have a policy in the State of trying to encourage just speeding efficient resolution of disputes by the party so as to save scarce judicial resources and mediation does just that. Thus, complying with the biblical imperative of Romans 12, 18, if it be possible as much as life in you live peaceably with all men. So without getting too much into the process of mediation, it's crucial that a mediator who is the person who basically meets with the parties and tries to help them resolve their dispute and facilitate a negotiation. It's a structured negotiation. And the mediator needs to be able to get full and complete information from the parties so that he understands or she understands what their case is about and what the weaknesses and strengths of the case are. So he can help them fashion a possible settlement. And so it's crucial that the parties have confidence that the mediator want to disclose the things they tell him or her in confidence and that the mediator won't be compelled to reveal those later in some kind of court proceeding. So for example, to take a sample from the works of Roy D. Mercer, if your septic tank fails and your boy Raymond is in there when that happens and it ruins a perfectly good pair, a Dallas Cowboy Terrick law sweatpants, and you want to take action to recover for the sweatpants, this would give you an alternative way to make that claim. There wouldn't be as costly or expensive. The mediator cannot do anything. He can't compel you to settle but he just tries to facilitate the settlement. So that's why this is an important process and what's important to preserve because currently under Georgia law, there's some question as to what kind of standard of confidentiality applies, whether it's different, if you're doing it under court sponsored mediation or by a private agreement. And so this will preserve all that. It'll preserve mediation as a means of dispute resolution. So how does that do that? Well, first of all, it very clearly sets out the confidentiality standards and what the scope of those standards are. It makes them the same regardless of the origins of the mediation. And that does a couple of things again, and encourages the facility of mediation by encouraging people to feel comfortable with making disclosures, which are kept confidential by the mediator, not disclosed to the other party. And it also ensures that we'll have mediators because people won't be worried. They'll be subpoenaed to testify about what the other side said during the course of the mediation. It brings certainty to the process, which is always good in the law, and ensures disclosure of conflicts by the mediator. And it allows the party to vary the rules if they don't like them by agreement, thus ensuring freedom of contract. And it also, another thing is it makes Georgia a more attractive venue for international mediation. And yes, that apparently is a thing, and it's sort of a burgeoning industry here in Georgia. We've got the transportation infrastructure for that, and this would put a legal infrastructure in place. I want to thank Representative Beth Moore, I don't know if she's in the room or not, but there she is for making me aware of this legislation and helping me to be aware of it and understand it and being able to present it to you today. But don't worry, I'm not gonna get all do odd like Representative Gullet did. I watched the video. And finally, it brings me no small sense of pride and joy to be able to say the lady from the 139th, the strawberry queen, that this will help you collect bills for funeral services. And so I'm delighted to hear that. It's time we did more for royalty around the state, so thank you. So I'm confident of your approval of this legislation. I think it's very good for all of us, and I will yield the well for questions, Miss Speaker. Do you yield? I yield. Chair recognizes Representative Reeves to your left for a question. It's General McGeele. Yes, sir, I yield. Representative, is it not true that when I was a freshman and due to the time I was spending the well that people started calling me Wendell Jr.? If the gentleman so states. Is it also not true that I'm gonna start calling you Wendell III? Thank you, Mr. Representative. Wendell never told jokes like that though, I tell you. You're further yield. I yield. Chair recognizes Chairman Martin to your left for a question. Chairman Yeal. Yes, sir, I yield. Governor Floreley to Reeves took away a little bit of what I was gonna ask you. Representative Willard. I mean, representative. If you yield for a question, I was just wondering, following your Roy D. Mercer line, is it not true if you're gonna tell that story, we need to know how big a boy there I was if he was down in there. Yes, you do, Mr. Represidents. No further questions. Thank you, Mr. Speaker, ladies and gentlemen, the House, I'm confident of your approval of this measure so much so that in the words of Gibbluas, the former Speaker of the Texas House of Representatives, I will say I'm so grateful I'm filled with great humidity. Thank you, Mr. Chairman, I yield well. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill, the chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill, will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Please。 Please Jeane. Okay, nobody is in favor of the Committee. Has everyone vote nay? I have all members voted. I have all members voted. Mr. President and motion agree on the policy of Joan tomorrow. If so, the clerk will lock the machines on the passage of Senate Bill 234, the eyes are 159, the nays or six. This bill having received the requisite constitutional majority is therefore passed. Senate Bill 28 by Senator Hatchett of the 50th, Striclin on 17th, Dixon on the 45th, Payne on the 54th and Cowsr to the 46th. Me totaled an act to men chapter 11, total 15. And total 19 in the fish, go to George Anterley, and the juvenile code and domestic relations. So it's to strengthen, clarify and update provisions relating to the protection of children, this bill ever referred to, the Committee on Juvenile Justice. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Reeves to present the bill. Thank you, Mr. Speaker. And I suppose after my comment, the representative lever that I'm probably obligated to be brief. But Senate Bill 28 is part of the governor's foster care package for this year. And it mainly does three things. A few years ago, this body passed the temporary alternatives to foster care concept that was developed by our director Tom Rawlings of defects. And that was singularly the most effective thing that we have done in our ability to reduce our foster care population over the last two years. This bill goes in and clarifies some aspects of it and also makes some improvements. Also, the bill addresses some aspects of evidentiary hearings of juvenile court and what judges are permitted to hear. And finally, it goes into our domestic relations code and it expands the list of child abuse type observations that mandatory reporters are required to make a report on when they observe. And with that, Mr. Speaker, I will yield for any questions. You yield for questions. I do. Chair recognizes the minority leader, the House leader, Beverly to your left for a question. Thank you, Speaker. There's gentlemen, you yield. I do. I have a couple of questions around the hearsay evidence. It's in many of the sections within the bill. Sure. How does that impact, let's say for instance, a grandmother says to a defects worker, hey, this happened or a grandfather, I mean, how does that impact, it looks like it's new to this particular bill that you can actually use hearsay evidence in a court and trying to figure out what to do with kids. Sure, like here's a great example of, I've had cases, I've had a case recently in juvenile court where we were in a hearing where the judge was tasked with making a decision on placement of a child. And I had a report from a therapist that had been seeing the child and that report indicated that it would be extremely harmful for the child to be placed with his biological father at that time. And the therapist was not in court and was not able to come to court to testify in person. And so because of the, because of not, because of with this, I would have been able to submit the letter or the letterhead from the therapist so the judge could consider what the child's therapist had said and then she or he could take that into consideration. And I think that what's important with this is, it says the court may consider. And then it also says that the court has to find that it's relevant and most importantly reliable and necessary. So for example, the letter that I spoke about was on the official letterhead of a therapist that could be verified. If it's a, he said she said, that's the kind of thing that a judge may very well decide that it's not reliable. And so that's part of this test is built to relevance, reliability, and necessariness. Gentlemen, further you. I do. This is a different section. It's, I think I have a right LC, but it's lying 391 through 394 as it relates to the treatment of a child in good faith. Can you explain that? Let me get the, this is in the, all right, this is in the third, what I call part of the bill that deals with domestic relations and in domestic relations. B, the bulk of this is from B where we add the different, we add some new observations that folks can make about a potential child abuse. J, the treatment of a child, and I'm going to explain this to you in a quarter. So basically what J is saying is that treatment of child in good faith solely by spiritual means through prayer and accordance with the tenets and practices of a recognized church or a religious denomination by a duly accredited practitioner thereof shall not in and of itself be considered child abuse. I suppose, I did write this as Senate bill, and I don't know that I'm read that part of it, but I am going to guess that since this comes in the section of law that we, where we deal with reporting of child abuse and mandatory reporting, that if one were to find that a religious practice might be considered abusive to one person, what this really appears to do is it kind of seems to set an objective standard of, if it's a generally recognized, like if one person considers it abuse to pray.\n\nover a child, I think that what this is saying, and I don't know where this came from, I don't know if this has happened, my guess is, is somewhere something along the way has happened, is somebody's been reported for child abuse for praying or something, and I think this is just attempting to clarify that as long as it's a, you know, walking across fire could be a religious ceremony for somebody, but that would be child abuse, right? But praying over somebody would not be. I do. So to that point, who sets the standard for the spiritual means whereby this is going to be okay? Well, I think it says in accordance, by spiritual means through prayer, in accordance with the tenets and practices of a recognized church or religious denomination. So I think what limit, a recognized church, you know, the Southern Baptist Convention or whatever may be, I may have the Church of Burt, right? That's not a, you know, that's not a recognized denomination. And if at the Church of Burt, I believe in fire walking, then this isn't gonna cover me. All right, Mr. Speaker, I will yield the well. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute to Chair Here's None? Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill, the chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote I? Those opposed will vote no, and the clerk will unlock the machines. What purpose does representative Erica Thomas rise? Polymonary inquiry. Statue inquiry. Is it not true that the last statement that was talking about religion and recognized religion was very confusing upon how we can put the stakes of a recognized religion into a bill pertaining to if our children are able to be in a home with someone that does not have a recognized religion? Well, I think it was a little bit as was your parliamentary inquiry to me. So, and I'm not being critical. Let's see, maybe we can have somebody shed some light. How about chair, what purpose does representative reaves rise? Parliamentary inquiry. Statue inquiry. Mr. Speaker, is it true that this section of the bill is not in contemplation of child placement or family placement, but it is in the section of the bill that deals with mandatory reporting of child abuse allegations. And so this section is strictly limited to the concept of what a mandatory reporter will be required to do it. And if they were to observe something that they thought was a religious practice that was abusive, then they would be able to make that report. But if it was a recognized church or religious domination that it would not be considered child abuse. Did anybody understand his parliamentary inquiry? If the gentleman so states, what purpose does representative, the minority caucus will represent to Wilkerson rise? Parliamentary inquiry. Statue inquiry. In the sense of bipartisanship, am I not going to, is it not true that online is 299? I believe this is it through 302. Basically, in this section, all we're doing is removing the language in one section, putting somewhere else. So it's basically in current law now. So we're not adding any new law by those lines. That's my understanding. Thank you. All right, one more parliamentary inquiry. What purpose does chairman Oliver rise? Parliamentary inquiry. Statue inquiry. Isn't it true, sir, that historically, these statutes that we're moving around right now have dealt with the religious sect that relates to blood products and that the courts routinely handle these matters when there's a conflict between a parent that opposes a certain medical service for the child. The law is fairly established that a court can have an opportunity and authority to intervene if the child's medical interest or primary and against the religious belief of a parent and example of a blood product service. Now, I know the lady knows that area of the law much better than anybody in here. But I happen to know that that's right, too. So all right, as all members voted, have all members voted if so, the clerk will lock the machines on the passage of Senate Bill 28. The eyes are 123. The nays are 46. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 218. Senate Bill 218 by Senator Walker, the 20th, doing the 30th, Patrick, the 32nd, Miller, the 49th, kind of the 18th and others. We entitled an act to amend chapter 5, entitled 45 of the physical and judge, and it will be a vacation of office so as to provide for the suspension of compensation for certain public officers who are suspended because of indictment for a felony. This bill having refer to the Committee on Judiciary. The Committee recommends that this bill do pass by rules committee substitute. Chair recognizes Chairman Eftration to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, earlier this week I brought to you Senate Resolution 134, you'll recall, and that was on an issue related to what I'll be discussing with you here today in the bill that's before you. So Chairman Larry Walker and the Senate brought Senate Resolution Constitutional Amendment that would prohibit elected officials who were suspended from office due to a felony indictment related to their, and that is for an offense related to their service as a public officer would prohibit them from receiving or suspend their pay during that period in which they are suspended from office. If they're ultimately acquitted, that pay could be recovered after the fact. What's before you today in part is in Senate Bill 218 is the same kind of treatment for local elected officials. So if a local elected official, not a statewide candidate, remember the General Assembly, but a local elected official is suspended from office due to an indictment for a felony. The suspension is based upon the indictment related to his or her service in public office, then their pay and benefits will also be suspended under those circumstances. And similar treatment, if they're ultimately acquitted, that amount can be recovered. So that is Senate Bill 218 as it came over. Now there is an additional part to the bill here today, which was House Bill 411, which you may recall this House previously considered and voted upon, representative Gullet had worked extensively on the issue of prosecutorial oversight, the need that we have because of an existing gap in state law. And the fact that elected prosecutors cannot be subjected to the same kind of review, even that we subject our judges to when there's questions as to misconduct. And I did not expect to have the opportunity, frankly, to discuss this issue here today with you prior to this, well, I didn't anticipate debating this personally until this was added as part of a rules substitute. But I am very grateful, actually, for the opportunity to tell you about how I came to this issue and my interest in it. So we all remember when the General Assembly was suspended last March due to COVID-19, it was not too long after that, that the horrific video of the killing of Amad Arbery became public through media reports. And I had a series of initial calls, I was serving as Chairman of Judiciary non-civil at the time. I had a series of calls with advocates, criminal justice reform advocates and others, trusted voices in the field to discuss what changes needed to be made to address the issues, the very apparent issues that we had as it related to that case. And of course, as I've well discussed from, before all of you in the past, it was of course seeing that the historic K-Crombs law was passed, was enacted, that was a critical, a repeal of citizens' arrest, that was a very important discussion that we had. But the other major discussion was prosecutorial oversight. What do we do in circumstances when an elected DA has done something that appears to be so far abroad from his or her office, which is clearly not consistent with the charge of his or her office and the responsibilities as an elected prosecutor? What do we do in those circumstances? And the fact is, there's very little that can be done. We are in a position ultimately of having no oversight for these elected's other than the communities in which elect them, so their judicial circuit or county in the case of a solicitor. And short of, I was reminded by a member earlier today of an impeachment proceeding before this body, which we all know how rare and infrequent that concept is raised. And what we have here are elected prosecutors across the state who by and large are doing hard work, or doing important work every day to protect their communities, to enforce the laws that we pass. But what do we do in circumstances when there is a prosecutor, an elected prosecutor, who goes beyond their area of responsibility, their sworn duty to protect the folks in their community to do what they should? And I think that that issue was no more clear to me than it became last spring and summer. And the need for this legislation was very clear to me at the time. And when I learned that Representative Gullet was working on what ultimately became House Bill 411, I was very grateful for that, for his work. So what we have here, you'll recall, is that there would be a body established to review circumstances in which a complaint is made as to the work of a prosecutor. And I want to thank many in this body who have worked on this legislation, as well as advocates in the hall, prosecutors who have participated in the process, been willing to collaborate, to make sure that the best possible bill is brought forward. And I would encourage you to support this legislation here today for two reasons, for the two different subject matters, well, for the subject matter of public safety that's being addressed, and the important protections that we have to have as far as our public official is doing what they're sworn to do. But in each of these areas, where we've got, first of all, elected officials suspended from office due to felony indictment related to their job that constitutionally, we've addressed, or the voters will ultimately address, that their pay may be suspended, assuming the constitutional amendment passes next year. But let's do the same for local elected officials. That's the first big, big thing. And you know that Senate resolution 134, passed unanimously here in the chamber, which I'm very grateful for, that strong message that we send. But the other part of this is that prosecutorial oversight is such a critical, critical element to what we have. And I don't hear anyone arguing that the JQC for our judges in some way impairs their decision making ability, their ability to do what's right, simply because there's oversight to ensure that if there's a problem that it can be addressed, really the same analysis, I think, is necessary for our elected prosecutors, our district attorneys and solicitors across the state, who, as I said, by and large, are always doing the right thing and are working very hard in their jobs. As you may know, I'm a former assistant district attorney myself and I'm familiar just from firsthand knowledge of the hard work that takes place by these prosecutors every day trying to do the right thing and follow the law that we pass. But when there are circumstances where prosecutors not doing that and elected prosecutor at the top of the job in that circuit or that county, there needs to be some accountability. There has to be a way for that to be investigated and action to be taken. And I would submit to you, this is one of the most important bills, one of the most important subject matters we're gonna cover this year. I think that ensuring that is so very important to each and every one of us to our communities, this goes far beyond politics. And as I said, for me, personally, that was never more apparent to me than when I saw that horrific video where a mod arboreus killed. How could a prosecutor watch this and prosecution not be pursued against these perpetrators? And what means do we have for oversight over these prosecutors? What is gonna be done? How is justice going to be served here to address this? And I believe that prosecutorial oversight as proposed in this bill is a strong message in response to that terrible case. And not only the, well, in response to the lack of action by the prosecutor reviewing the case. And so I would ask for your favorable consideration of Senate Bill 218 and Mr. Speaker, I'll be happy to answer any questions. Do you yield for questions? Yes, sir. Chair recognizes Chairman Wark-Hizer to your left for a question. Thank you, Chairman. We yield. Yes, sir. Isn't it true that the Constitution very explicitly gives the legislature that authority, but that's all it says, and this bill will give us the nuts and bolts of how to carry that out. So the authority is already given to us. Yes, sir, that's exactly right. We have the authority in the Constitution, and really it's incumbent upon the General Assembly, I would say, to pass exactly what the rules should be for that oversight, and that's what we're doing here. Yes, sir. Thank you. And just to let you know that the, one of the DA's that I represent who beat the DA in the case in Glen County, you're talking about, he mailed me this morning and supported this bill. So I appreciate it. Thank you, sir. Do you further yield? Yes. They're recognized as representative Derek Jackson up in the gallery to your left for a question. Thank you, Mr. Speaker. Does it gentlemen you? Yes, sir. I noticed you mentioned a mod, Aubrey, named several times. But this bill, Senate Bill 218, has absolutely nothing to do with keeping someone that looks like me alive while jogging in their own neighborhood. Is that not true? Sir, what I was referencing is prosecutors reviewed the facts of that case and did not indict the perpetrators of that offense. And that prosecutor who made that decision should be held accountable by somebody. And Senate Bill 218 will hold those prosecutors accountable for that failure to do their job. Does the gentleman further yield? Yes, sir. Excuse those who are clapping. They're not acknowledging the rule that the speaker continues to outline. This is not a pep rally. Does the gentleman further yield? Yes, sir. Again, just to make sure I'm clear, you mentioned a mod, Aubrey's name several times while presenting this bill to this August body. Senate Bill 218 has absolutely nothing to do with citizens arrest. Has absolutely nothing to do with stand your ground. Has absolutely nothing to do to change the climate in Georgia to ensure someone that looks like me jogging in my neighborhood will stay alive. Is that not true? No, sir, I completely disagree. And here's why. Every Georgian should have the assurance and understanding that elected prosecutors are going to protect every person who lives in their judicial circuit, every person who lives in their county, and that there will not be favor given or bias given based upon the person's race, gender, sex, any other classification, and ensuring that we have prosecutorial oversight will help to protect all Georgians in my view. And when I referenced those other matters, I very clearly said that in the conversations I had last summer, my immediate thoughts were to what policy issues needed to be addressed. And passing hate crimes and repealing citizens arrest and prosecutor oversight were those three top issues at the time. So I very much disagree with the characterization. Senate Bill 218 is important for this state to pass. And I think also sends an important message broadly that if a prosecutor is not protecting those who live within their district, their circuit, that there is going to be oversight to protect every single Georgian who lives in their circuit. Does the gentleman for the year? Yes, sir. Is it not true that the prosecutors that you're trying to prosecute are only prosecuting the policies that are currently on the books? So no, prosecutors have a responsibility to uphold the law and their determination of what matters to submit to the grand jury are within arguably within their discretion. And if a prosecutor is abusing that discretion, then we need oversight to ensure that that is addressed. Mr. Speaker, I know we've had a vigorous debate on this. And I think I've made my position very well at this point. I would ask each member of the body for their favorable support of Senate Bill 218 and I will yield the well. Gentlemen, as yielded the well, we have other members who wish to be heard. Chair recognizes representative Erica Thomas to speak to the bill. Thank you, Mr. Speaker. Let us be clear. SB218 is HB411. A Republican sponsor bill filed after the recent election of Democratic and progressive prosecutors. This bill is unnecessary because there are already at least three checks and balances in the law that can be utilized. One, currently the governor and attorney general have the authority to investigate district attorneys for criminal acts. Two, the state bar of Georgia has the authority to investigate district attorneys for unethical behavior. Three, the state bar of Georgia has recently voted to revise bar rule 3.8 to allow disbarment for prosecutors misconduct. The original penalty was a public reprimand. Furthermore, the general assembly has the authority to conduct an impeachment proceeding against a district attorney while in office. And most importantly, Georgia voters have the power to vote their district attorney in and out and have done so in eight jurisdictions during the 2020 election. The Celicitor General Association and the Georgia District Attorney's Association both oppose this bill. Speaker, I yield the will. Chair recognizes representative Stacey Evans to speak to the bill. Thank you, Mr. Speaker, ladies and gentlemen. Representative Tom has talked about how this is unnecessary and I'm gonna talk a little bit about that too, but let me start by very clearly telling you how this legislation is unnecessary to take care of what happened to Amod Aubrey. If you have any inkling in your mind that you are doing this to protect Amod Aubrey or future Amod Aubrey, let me dispel you of that myth right now. The voters took care of the district attorney who did not look out for Amod Aubrey. The voters, this is unnecessary litigation, unnecessary legislation. I forgot where I was for a second. Unnecessary legislation that will cost this state $850,000 a year. This legislation would have us been nearly a million dollars a year to try to discipline a group of elected officials that are already subject to discipline for violations of law or ethics. As we've talked about a little bit already if a DA violates the law, our state laws take care of that. Prosecutors are already subject to state bar disciplinary rules which are at this moment at their own request getting stronger. The state bar has disbarred two district attorneys when misconduct warranted it. District attorneys are policed. This legislation would have us spend against specifically $850,000 a year to deal with complaints that might be brought against 115 elected officials. That's because we have 49 elected district attorneys. 66 elected solicitor generals, that's all this bill applies to. Those specific 115 people. Over $7,000 a year, $7,391 a year per person for oversight. People that are already subject to oversight by the state bar, by state law, and by the voters. To put that money in perspective, ladies and gentlemen, that's more than each of us gets every year to run our office that's supposed to serve roughly 80,000 Georgians. Same amount of money for 115 people. We could use this money elsewhere. I've talked about our office budgets, but let's talk about our judicial system. We had Chief Justice Harold Melton here a little bit ago giving us the state of judiciary. He told us about the backlog of cases and other needs that the judicial system had. I think there are places where we can put this money to better use, a place where it's actually been requested by the system. We talked about the law overseeing these folks. We talked about the state bar. We talked about the voters. The same voters that oversee us. Do we not trust them to oversee their elected district attorneys and solicitors general? This legislation would have us create a bureaucratic, unelected group of people who could remove a district attorney or solicitor general from office who is duly elected by the people. Unelected people coming in and erasing your votes. Have we not had to talk enough about the sanctity of a vote in what it means? Now we're going to erase votes in favor of attorneys general and solicitor generals across this state. We've talked about if you break the law, we've got something for that. If you break an ethical law, we've got something for that. So what is this oversight commission actually supposed to do? I will tell you, political oversight. That's where this is headed. Don't like how a district attorney exercised his or her prosecutorial discretion. You think she said something too liberal or too conservative? Send it to the oversight commission. That's dangerous. Here's what the law says. You could make a complaint against somebody. If they have a stated policy written or otherwise, that demonstrates that the district attorney or solicitor general categorically refuses to prosecute any offense or offenses of which he or she is required by law to prosecute, required by law to prosecute. Because it's a law on a book. Are they required to prosecute it? Did they not have prosecutorial discretion? Are we erasing that? Some of you in here may think, well, if a prosecutor isn't charging marijuana possession charges, maybe they should be brought before the commission. Or if a prosecutor isn't charging the death penalty, maybe they should be brought before the commission. But stay with me for a second. What about a prosecutor that isn't going to prosecute any illegal firearm possession charges? You ready to bring them before the commission for oversight? What about a prosecutor that refuses to bring charges against any church that refuses to close its doors during a state emergency? Are you gonna bring that prosecutor before the oversight commission? Because you see it works both ways. Justice Melton again gave us the state of judiciary a little bit ago. I don't recall him telling us that there was any want of prosecution of laws in this state. What I heard him say is that we have a backlog of criminal trials to try when the court house court house is reopened. I didn't hear him say that he had concern that our prosecutors were not bringing cases and that our laws were not being enforced. How about we listen to the leaders? One other point I want to address, you say we have an oversight and extra oversight committee for judges. Certainly the law takes care of them when they break a law. Certainly the state bar could come after them for ethical problems, but we have this extra judicial oversight committee for judges. And I would say you're right. But I would also say this is not at all the same thing. You see judges are checks against us passing unconstitutional laws and against prosecutors who bring cases that lack evidence. The judicial oversight commission watches the watchers. Prosecutors are not watchers. They are watched by the law, by the state bar, by judges and by the people who elected them. That is plenty. The presenter who started us off here talked about how prosecutorial oversight through this commission is critical, very critical. We've got to have this. So critical ladies and gentlemen that we have survived the entirety of the history of our state without it. We don't need it today. Please join me ladies and gentlemen in voting against Senate Bill 218. I yield the will. Chair recognizes representative dryer to speak to the bill. Thank you, Mr. Speaker. I rise in opposition to Senate Bill 218 today. As my colleague just said in 2021, in the first time in our state history, we've decided we need...\n\nto supervised prosecutors. Despite having State Bar Rule 3.8 to discipline and disbar prosecutors that are not competent or ethical in their behavior, despite having the governor and the attorney general being able to prosecute prosecutors that undertake criminal conduct, and despite being able to impeach DA's as has been previously mentioned, and then of course the fourth way, elections. We all vote on our DA's. I would bet everyone in this room has their DA's cell phone number, and we know if they are representing the will of the people, or they are not representing the will of the people that elect them. But regardless of all those mechanisms, for the first time in our State's history, we're creating a body to supervise district attorneys and solicitor generals. And who's going to do the supervision? For people in our State, for elected officials in our State will appoint all five people that are able to bring, investigate, and bring charges. So there will be five individuals say to Georgia, but they will be appointed by four elected officials. This first will have a chilling effect. District attorneys are going to know who those four people are, who their political appointees are, and it's going to make their job more difficult, which they don't need. I think we should all agree that DA's and solicitor generals don't need us to make their jobs more difficult. And then when you look at what, beyond the appointment, what the DA's or solicitor generals can be prosecuted for under this thing. It's incapacity, conviction of a crime, which are already addressed in other ways. But the new one is, and this is what we heard from the Bill's original sponsor, political considerations from the district attorney. That goes to prosecutorial discretion. So first off, you're going to have five political appointees deciding if someone is using politics, if someone who is duly elected is using politics to inform their decisions, which I think we almost all hope that they are, so that they are responsible to the people. But on prosecutorial discretion, something's really important. We pass laws in this chamber for mandatory minimum sinencing. And there is always a debate when we do that. Well, what if so and so happens? What if someone is in the car with something else happening? And you know what, we always hear that. Well, prosecutors have discretion. Prosecutors have discretion. Well, they're not going to have discretion anymore. When we think about not prosecuting marijuana, petty marijuana possession charges, I mean, I think there's a lot of folks with the libertarians here who understand why that is valuable, why someone whole life should not be thrown away, because they were in a car with someone else that had marijuana. I think about that for my nine and 12 year old boys. And I think we should be thinking about that for every teenager in the state of Georgia. Prosecutorial discretion is absolutely crucial. But there's something else going on here. We've acknowledged under our last governor that we have over incarcerated and thrown people away. And what we ended up doing is we ended up costing a fortune of taxpayer dollars in the state of Georgia. And we committed immoral acts of throwing people away because of their worst decision. And I mean, sometimes we got to protect the public. I'm with you on that. But sometimes we're just doing it to be mean and to show we can. And there is a new philosophy and prosecution called restorative justice. And I would love for you to meet with my solicitor, General Keith Gammish, to talk about what that means. How do we build people up? How do we look at what the crime is? And if someone is not an immediate threat and we can redeem them, then let's do that. The last thing I'll say is former chief judge, still a judge for full and spirit court judgment burning. Since half the people I incarcerate, literally half the people I incarcerate would be paying taxes if we had adequate mental health care services. So can we look at a new way? Because we saw what happened in the 90s, in the late 80s, and the early 2000s. And it didn't work for anyone. So we weren't safer. We cost ourselves a lot of money. And we threw people's lives away. And if it was a family members of ours, we would think of them differently. I hope we can have a little more empathy. And I hope we can stand up for people that have made a mistake. And I hope that we can look at this thing. Because in 2021 to do this for the first time in our state's history, I don't see a need for it. Thank you, Mr. Speaker. I yield the well. We have some other members that wish to speak on the bill. Chair recognizes the chair of the Judiciary Non-Civil Committee Chairman, Bershit, to speak to the bill. Thank you, Mr. Speaker. Colleagues, it's been a long day already. Started out, fought with fireworks. And it seems like it's going to continue throughout the day. I just want to say I appreciate this whole process. Everybody coming up here and giving their pros and cons of this bill. I just want to come up here and I'll be very quick and say this. I support the bill. And this is the reason. There are checks and balances. But there are these checks and balances that are in place do not reach the actions that we're trying to reach. There is a rule the bar has 3.8. And they have said they are going to amend this rule. But it has been on the table since 2018. And they have not amended this rule. So the Georgia Constitution is clear. It gives the legislature the authority to remove prosecutors by general law. And that's what we're doing here. That's we're setting up a commission to oversee these prosecutors that are getting out of line. These prosecutors that are being indicted for sexual harassment, you know what the bar is going to do? They're not going to do anything. They cannot do anything. That's not a legal issue for them. It's not a professional code of conduct issue for them under 3.8. And the big thing I want you to remember here, folks, is this. The bar does not have the authority to remove a DA. They can't remove it. The only way to remove a DA from the bar's perspective is to disbar. That's the only way. So the actions we're trying to get to can't be reached with what we have in place. And I'll give you another one of our colleagues mentioned that Justice Melton didn't ask for this. That's because Justice Melton respects the law. The Constitution is clear. Justice Melton and the judiciary do not have oversight of removing DAs. We have oversight. It is within our purview alone to remove these DAs. And I want to mention impeachment. And impeachment trial for a DA would take seven days of the whole general assembly to take up only the impeachment. So we have 40 days. If we want to impeach one DA, it's going to take seven days for us to just take up that action. So that's not practical. That's not efficient. And then I want to address the election concern. So these are elected officials. So I agree with that entirely. But if the DA is acting nefariously during his term, we have to wait to the next election to get to him. So it's going to continue for whatever was left in his term. This commission can act immediately. They can go after the nefarious activity. And they can remove the DAs. I really understand why this is split along party lines. But I wish people would just consider that. We're not approaching this from a party perspective. We're approaching this from a practical perspective. You and I are able to be removed. Judges are able to be removed. This is just an oversight for DAs who are bad actors. No one wants to get involved in prosecutorial discretion. If you look at the bill, the folks that are going to be overseeing these prosecutors, many of them have to have prosecutorial experience. So these are going to be prosecutors that have stood in the same place of these prosecutors. They're going to understand the perspective that these prosecutors are these many issues that they're weighing out when they're considering what to prosecute. So we've got to trust them in doing that. I'd appreciate your favorable consideration of this bill. This is a good bill. This is a good government oversight bill. With that, I'll yield the will. I appreciate it. Chair recognizes representative Maynard to speak to the bill. Thank you, Speaker Ralston. Countless women and children die from stalking, domestic violence, sex crimes, and trafficking each moment we are granted a breath. Georgia is not a safe place until we close the loopholes in our criminal justice system, which reduces women to a number. In Fulton County, I am number 1-9-SC-179-97. Claiming Georgia is a safe place for women is done with fictitious smiles. The Mayor of Atlanta has declared the capital of Georgia to be in a public safety crisis. This bill is for more than just district attorneys. This bill would help protect myself from local elected officials that are using their influence in a broken system. Right now, not one single person has come up here and said the word victim. Let's protect victims and vote yes for SB218. I yield the will. Chair recognizes representative Gullett to speak to the bill. Thank you, Mr. Speaker. I don't really know what to say sometimes, I think. So we're here talking about oversight for elected officials. That's something I think as elected officials, we all want. As citizens, I think the citizens of the state all want us to be held accountable when we do something wrong. This bill does not address prosecutorial discretion. It absolutely does not. It talks specifically narrowed scope about totality of behavior with specific items, as well as courtroom behavior with specific items. If you file a complaint, you must do a sworn affidavit as the party to the complaint. Saying what happened. And if you file an affidavit specific to courtroom behavior, there's seven, six, I'm sorry, ABCDE and F, items that you must prove as possible. This is not get rid of prosecutorial discretion. That's absolutely vital to our way of government. That's vital to our justice system. If you've had a community that's dealt with a district attorney who has broken your judicial system, there's no, there's disdain for the office holder. No one trusts that office holder in the judicial system. It tears your community apart. I have a DA in my county, was indicted a couple weeks ago. It took two and a half years to indict him. Two and a half years to indict him on something that wasn't a surprise indictment of a secret that came out. It was two and a half years. And when you're going through that in your community, dealing with that in your community, two and a half years is forever. The people in my community and in my county have dealt with that for two and a half years. They're torn apart. No one trusted the DA. This just gives the ability by the Constitution has given us, gives us the ability, if those criteria are met to handle the situation, to have this commission, accept the complaint, vet it out, and handle as a dean necessary. That would have been vital to my community. It'd be vital to many of your communities who deal with DAs and solicitors the same way. I urge you as someone who's gone through this in their community to vote for this bill. It's extremely important. I believe it's important to our minority party. To vote for this bill, they've had a bill, HB 1214 last year. Not identical, but any stretch. But it was to handle and address these situations from district attorneys. They had a bill this year to do the exact same language, HB 143, to handle and address the situation. And now, with the time to come to take action, they're wanting to say they're scared of the action. Please, for people who deal with this in their community, vote for this bill. Mr. Speaker, I yield the well. Gentlemen, yields the well. The chairman has opted to use the chair's time, which is by a rule limited to 20 minutes, chair recognizes chairman frustration for the chairman's time. Thank you, Mr. Speaker. We have debated this issue extensively here today. So I, and I'm grateful for this rigorous debate. Frankly, I didn't, didn't maybe appreciate the, the degree of disagreement that we would see here today because as I look at this issue, this is a common sense issue. Georgians deserve the protections that we are talking about here. And that is that if there is a basis for a complaint to be made, for there to be an avenue, for that complaint to be brought, so that proper oversight can be given. The, as far as the prosecuting attorney's counsel, it's my understanding that they are neutral on the bill. They have not taken a vote of the counsel, and I know that it is, in my experience, it's not typical that they do vote on legislation, but as far as an official position of opposition for unpack, that does not exist for this bill. There is, this has already been budgeted for in the budget. We've insured that the funding is appropriated. We currently have oversight of our judges through the JQC, and you have not seen the kind of political, political attacks or politicization of the position that maybe has been talked about by some of the detractors here today. But I want to just conclude with this. I want to thank the members who have had the courage to work on this really tough issue. For Representative Gullet to come forward and talk about how his district attorney was under suspicion for years and was ultimately indicted a few weeks ago in how that's torn his community apart, and how that necessitates that we act on this bill. For Representative Mayner, my distinguished colleague to have the courage to come forward and share with you her personal experience. The fact that we need to focus on victims, I think is a reminder that all of us need to constantly hear, and I am very grateful to be honored and I'm honored to serve with her. And I take her support for this bill with great weight. In conclusion, Mr. Speaker, I am grateful to the members, each and every member of this body for the debate we've had on this issue. And I'd submit to you that we're only here because we've seen very specific and concrete examples of a need in this area. And the solution put forward is the fix that makes sense to address this, so that we can each go home to our communities, and we can say absolute power to decide who isn't isn't prosecuted within a community has a check. And if you're abusing your office, there is the ability for there to be, for a complaint to be brought oversight that's truly meaningful to be given. And based upon that, I'd ask each and every member to vote yes on Senate Bill 218, and I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? Chair, here's none of the previous question is ordered. Is there any objection to adopting the committee substitute offered to the substitute offered by the committee on rules? The chair, here's none of the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair, here's none of the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no, and the clerk will unlock the machines. What purpose does representative Sains rise? Parliamentary inquiry. Chair inquiry. Is it not true that Keith Higgins, the district attorney elected as an independent who is represents the originating court of the Amataabri case, has vocalized to every representative in his circuit that he is in strong support of this bill? If the gentleman so states what purpose does representative Shannon rise? Parliamentary inquiry. State your inquiry. Isn't it true that H before 11 had to be added to SB 218 because it was dying in the Senate meeting bipartisan opposition? And so the only way it could survive was to find a vehicle in the house. I usually don't keep up much with what the Senate does so I can't answer that parliamentary inquiry. All right, we'll do one more. What purpose is representative Wolenski rise to Parliamentary inquiry, Mr. Speaker? Can we take them one at a time? Yes, sir. Parliamentary inquiry. State your inquiry. Is it not true that there are some good things about the bill? However, my main concern is the word plausible on line 170. Parliamentary inquiry. The gentleman so states. Starting on line 167 to reach the commission may not entertain a complaint on the basis of a charging decision moving to 169. Unless the affidavits in any documents attached to the complaint show it is plausible that the district attorney or solicitor general made or knowingly authorised the decision based on going to line 174 a lack of probable cause. And the idea that we're using the term plausible there and a lack of probable cause makes it way too broad for the specific and concrete need that this bill seeks. Thank you. Okay, have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 218. The eyes are 101. The nays are 66. This bill having received the requisite constitutional majority is therefore passed. Before I have the clerk read the caption of the next bill, after the next bill we're going to the supplemental calendar and you will find those bills out in the hallway on the tables. So if you want to go ahead and get those so we can move along. Clerk will read the caption to Senate Bill 75. Senate Bill 75 by Senator Jackson of 41st, strictly the 17th parent of the 42nd Patrick of the 32nd, married to the 9th and others. We title an act to amend Code Section 44723, with the official go to Georgia annotated relating the termination of residential lease after issuance of civil family violence order or criminal or criminal family violence order. Notice an occupancy. This bill I refer to the committee on judiciary. That committee recommends that this bill do pass. Chair recognizes representative Gaines to present the bill. Thank you, Mr. Speaker. Senate Bill 75 mirrors language of this chamber and this general assembly pass in 2018 to protect victims of domestic violence to allow them to get out of their leases without financial penalty. This legislation would expand that to victims of stalking the apartment association supports this bill and had unanimous support in the Senate as well. Mr. Speaker, I'd be happy to answer any questions that there are any. You do not have any questions. Thank you, Mr. Speaker. I yield the well. Is there any objection to the previous question being ordered? The Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 75, the eyes are 158, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 6. The bill is passed. Senate Bill 6, my senator Albers, the 56, soft statler, the 52nd, well as the 53rd, due to the 51st, struggling with the 17th and others. To be entitled to amend Article 3, Chapter 5, with Title 2080, the fiscal to Georgia, and Tate relating to fiscal bills generally, so as to provide our independent economic analysis to be procured by the Office of Planning and Budget for certain tax benefits upon requests by chairpersons of the House Committee on Ways and Means and the Senate Finance Committee. This bill haven't been referred to the Committee on Ways and Means. That committee recommends that this bill do pass by committee substitute. Chair recognizes the chair of the House Ways and Means Committee Chairman Blackman to present the bill. Thank you, Mr. Speaker, fellow members. Bring before you, Senate Bill 6, which allows and provides first audits up to 10 of credits or exemptions or other types of tax exemptions per year. Provides a great deal of accountability with regards to those that are out there past. Back in 2019, you have seen this one before and very much the same form. I would also say that on this, we have added some language that would create the special counsel on tax reform and fairness for Georgians. So that would allow us to review our tax code very much like we did back in 2010 and bring back some recommendations. It functioned very similar to a study committee and we have amended it to provide for CPAs to participate. This measure would also include, and I know others are going to speak to this, but some of the same measures we passed supporting our renewal and recovery on Georgia jobs and economic development. And that's from our defense industry to our mega jobs and to our rural short line to the fine arts. We did make one change to that provision and it was adding a sunset to one of the provisions. Again, I know others will be speaking to that, but haven't had the opportunity to really thank everybody that is combined to put this together. The committee to a great degree, Secretary Williamson and Chairman Watson, Wip Wilkerson. I want to thank Representative Canard, Chairman Corvitt, Representative Buckner, Representative Fry, Representative Reeves, and Representative Lot. I just want to say they say thank you to all of you and many, many others. Mr. Speaker, I'll try to answer any questions if there are any. Otherwise, I know time is late and others want to speak to the bill. Would you give for me to ask you a question? Of course, sir. Does this do away with the nonpartisan fiscal expert that leader Beverly and I were trying to figure out the other day? What that meant? Yes, sir. It would do that. And replace it. That whatever that is with an economist. Or certified public account. CPA, of course. While Representative Wilkerson is giving all these thumbs up down there, I get it. So, okay, you yield for questions. I will take a couple, yes, sir. Chair recognizes Chairman Hausten, do you write for a question? Parliament question. Is it not true that the bill we had took away some of the powers that the Constitution reports the House? Yes, sir. We amended that to, yes, ma'am, I'm sorry. We amended that to remove that portion of the language. All right. Thank you. I haven't had time to read it, but I just wanted to make sure no power the House was taken away from him. No, ma'am, that is remains intact. Thank you. Madam Chair, I wrote that provision with my own pen. Do you need further yield? I will take one more, yes, sir. Chair recognizes Representative Wolenski. Thank you, Speaker. Chairman, do you yield? I do. Just for clarification, is this House Bill 586, House Bill 587 and Senate Bill 148 put together? And it starts with Senate Bill 6, but yes, or that is correct. Thank you, Chairman. Thank you. Mr. Speaker, I'm going to allow others to speak and yield the well. Thank you very much. Gentlemen, as yielded the well, Chair recognizes Representative Williamson to speak to the bill. Thank you, Mr. Speaker. Members of the House, this House passed the George Economic Renewal Act of 2021 under House Bill 587 with overwhelming bipartisan support. Sections 2 through 5 of this.\n\nare the exact same language that we passed with that. And as a reminder, it touched on the, trying to regrow and recruit pharmaceutical and personal, personal protection equipment, manufacturing to the state. It allows, it allows for the, the port act, the port credits to be used against payroll withholding. It removes the 4500 job cap on the mega job tax credit program. And importantly, it addresses the needs of the position of our largest aerospace defense contractor, lucky to be in position to attract and successfully bid on the next generation of fighter aircraft and Department of Defense projects. Best in section 25 of the bill. It also extends the Georgia Agribusiness and Rural Jobs Act, which is important to counties under 50,000 people, that job, that, that, Georgia Agribusiness and Rural Jobs Act has been very successful in 23 of our rural counties that need those every jobs precious. And finally, it extends the sunset on the short line railroad maintenance tax credit program. It's been very successful for our short line railroads. Miss Pick, I'll be happy to answer any questions. Otherwise, I'll yield a little bit. Well, you have no questions back in the speaker. Chair recognizes Chairman Watson to speak to the bill. Thank you, Mr. Speaker. If you'll look at section five of the bill, this is actually what we voted on in 586, a house version. The only changes that we've made here is we've extended the sun sets and put most of the sun sets back into this bill so that we can reevaluate these programs. But this is the project of regional significance that we use in our economic development, and it's just another tool. And the toolbox that our state can use to bring jobs in to Georgia, it's got the fine arts piece, allowing those entities in our communities access to try to help them out as they recover from COVID and concrete truck manufacturers that we use to build and do things in our state, continue into allow them to have a sunset and the boat retrofit. And that's what the bill, those sections do. It passed out of the house and just would appreciate your support. Be glad to take any questions if there are any, Miss Picker. Have no questions. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed to vote no. And the clerk will unlock the machine. If all members voted, have all members voted, if so, the clerk will lock the machine's own passage of Senate Bill 6. The eyes are 152. The nays are 14. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to Senate Bill 153. Senate Bill 153 by Senator Donzal of the 27th and Tillery the 19th to be entitled to amend Title 20, the fiscal of Georgia annotated relating to education, so it's deprived for goal academies. This bill then referred to the committee on education and committee recommends that this bill do pass by committee substitute. Chair recognizes the speaker, pro-tem of the House to present the bill. Thank you, Mr. Speaker. Senate Bill 153 was reworked from the Senate and it moves three regional alternative charter schools from the State Charter Commission to the State Board of Education for the remainder of their two and three year charter terms. These schools are mountain ed, but hills and coastal plains. The Department of Education will provide interim support and eventually assist them in transitioning to locally chartered regional schools that will receive their full QBE and a full proxy for their local share during this time. The bill was worked within collaboration with three schools and allows 3% growth and for them to add one site per year. But mainly the point of this bill is we're going to work with them and partner with these schools to create a sustainable, expandable model beginning this year so that we make sure that these alternative regional schools excellent work continues with students at risk of dropping out, already dropped out, incarcerated and overage continues. And we'll be looking at incentives for other school systems to form regional collaborative alternative schools, additional QBE weight for regional alternative schools, how the state will fully fund incarcerated and overage students and assistance to these schools. This may be the most important part to help them in creating mutually beneficial contracts among themselves. I want to say on behalf of Chairman Jasperce and Chairman Dubnik and I, it has been truly a pleasure to get to know these schools, work with them and we're fully committed to their continued success and we look forward to expanding this model in Georgia. I ask for your favorable consideration of House Bill 153 and I'm happy to answer any questions. Do you yield for a question? I do. Chair recognizes the Chair of the House Education Committee, Chairman Dubnik, to your left. Thank you, Mr. Speaker. We'll have a lady yield. I do. Madam Pro Tem, is it not true that we worked on this with the three schools in question and that those schools are in support of this measure? Yes, sir, it is. And if we further yield, yes, sir. And would you agree, Madam Pro Tem, is it not true that the purpose of this bill is to increase, enhance and give these schools the ability to sustain the excellent work that they are already doing for the children of the state of Georgia? That's true. Thank you. Well, thank you and I ask for your favorable consideration. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The Report of the Committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. From the passage of Senate Bill 153, the eyes are 105. The nays are 59. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 80. Senate Bill 80 by Senator Karpatcher. 30 second, Berkeley, 11th, Watson, First, Walker, 20th, Harvorson, 15th and others. Senator Karpatcher, 30th, Tom, 33th, the Fish Code of Georgia, Annotated, related to insurance, so is the required for standardized standards for utilization review. This bill then refer to the Committee on Insurance, Secondary, recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Newton to present the bill. Thank you, Mr. Speaker. I appreciate all the work this body has done to make patient care more expedited, more efficient. We're trying to make it more accessible and always working for ways. I'm excited to bring to you Senate Bill 80 today, ensuring transparency and prior authorization. I don't know if any of you have had a family member who's had a procedure that was recommended or maybe a surgical intervention, but it wasn't an emergency. I spend all my life in the emergency department, so I'm exempt from most prior authorizations. But I have a lot of colleagues both across the hall and across the state who have significant delays that go on when they're trying to get the needed authorization for care that a patient needs. Senate Bill 80 works hard to do that. It's a collaborative effort between both the health plans that we all trust and we all buy our insurance from, but also the providers in a way to come together in a way that adds some transparency, add some guidelines to this. A couple of things in the bill that it does do, it addresses utilization review, medical necessity, clinical criteria, clinical peers, and urgent medical services. It gives a definition to these. It adds actually to Title 46, the law that's already in place regarding health care utilization, kind of specifies the role of the insurance commissioner or for state health plans, the commissioner of DCH. So there's a lot of different things it does that it begins with with transparency on the company's website, some transparency regarding aggregated statistics regarding how often the prior authorizations are approved or denied and that can vary by different carriers. The peer-to-peer communication, when you have a specialist who recommends you or your family member have a particular procedure or intervention, that's going to be declined. This bill seeks to ensure that that's going to be declined by someone who actually does the procedure who understands it and maybe in the same or similar specialty. This bill also establishes a timeline for these determinations. We understand that care that's delayed is often not good care at all. There's no such thing as good care that's delayed too much. So it does give some clear guidelines for urgent cases, 72 hours, elective cases, 15 days. It keeps the authorization good for 45 days. Does come up with a way to handle violations when a carrier does not comply with this law. It's not good for a carrier to deal with how to make that better. The goal in all this, like the goal in a lot of our legislation, is to find ways we can streamline what is often a very complicated and confusing process of getting health care. This helps us do that in a way that's both efficient and keeping your premiums reasonable on the insurer side, but also efficient in getting you the care or your family member need, getting your care done as expeditiously as possible. So I would be glad to answer any questions. You have a question if you care to yield. I will yield. Chair recognizes Chairman Dollar to your left for a question. Gentlemen, you? Certainly. Thank you for bringing the bill. Isn't it true that I've had a number of constituents, doctors and dentists with their own practices, contact me with concerns over this bill or not concerns, but are interested in this bill? And is that okay? Sorry. Isn't it true that I've had quite a few constituents, doctors and dentists with their own practices, contact me with an interest in this bill and very glad to see this small business piece of legislation progress to this point. I would just encourage you to keep it strong if we can make it even stronger as it goes through the process and possibly ends up in conference or whatever the Senate chooses to do. Thank you. Yes, appreciate that. That is the goal of the bill. We understand many things are a multi-step process. Sometimes a multi-year process. First do know harm is not just a medical guideline. It's a guideline for us as legislators also. I'm glad that the former insurance chair, now rules chair, assisted us with getting the parties together to make sure we can make significant progress this year, but also with a plan to make more progress in the coming summer with some additional meetings. So I would appreciate your support. Mr. Speaker, I'll yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no when the clerk will unlock the machines. Have all members voted? Have all members voted? And so the clerk will lock the machines on the passage of Senate Bill 80. The eyes are 167. The nasors zero. This bill having received the requisite constitutional majority, and therefore has passed. Chair wants to bring your attention. I've had complaints from all three seating areas, the Chamber, the Gallery, and others that the volume of conversation is a little too high and people are having trouble hearing. So I want to ask you if you would to keep your conversations, turn the volume down or take them outside because there are members that like to hear the debate and want to hear the debate. So it would remind you that we still have the social distancing requirement in this body. Sit in your assigned seat only. Clerk will read the caption to Senate Bill 195. Senate Bill 195, Senator Mulles, the 53rd. To be entitled an act to amend Code Section 2233, the fiscal to Georgia and the United League definitions regarding hemp farming. So it provides a definition and a provide for related matters. This bill then refer to the Committee on Agriculture and Consumer Affairs. That committee recommends this bill do pass by rules committee substitute. There recognizes representative gravely to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, this bill is a bill that came before this House, the day before crossover. House Bill 645, which was the Medical Cannabis Commission clean up, which was the recommendations that the cannabis commission we created asked for in their annual report. This bill is also House Bill 601. It's my friend, Chairman Stevens, the Epidialex bill, which says that if a federally approved drug, it was once on schedule one, has been FDA approved through a clinical trial, but no other state or agency can claim that it doesn't have medical value. Now ladies and gentlemen, for the life of me, I don't know how to yet, unanimous bills that came out of this chamber, both bipartisan efforts got so tangled up in the Senate. But I want to thank the Senator who said you can use my bill because I support you issue. Now, there's a lot of people to thank on our side. The House has led on this for seven years. Seven years ago, that Alan Peak stood in this well and presented House Bill 885. And I followed him as a freshman legislator to offer my support. And every other session, we will come trying to fix and maneuver and make this issue palatable for the patients in this state. And in one month, ladies and gentlemen, we're going to issue six licenses, the cultivators in this state. And they'll have 12 months to create an oil for patients in this state. But in seven years, there's one thing we have not had and today we have it. And that is a letter of support from the Medical Association of Georgia, saying please support Senate Bill 195. And I was read one portion. The MAG Institute for Excellence in Medicine. Medical cannabis task force has reviewed HB645, which is now SB195. This bill will help remove barriers that currently exist to the delivery of safe and quality-controlled cannabinoid extracts that are produced in Georgia for Georgia patients. Ladies and gentlemen, let's send another message over there. I've met with the second floor. I know there are people meeting with the third floor. There's the floor we're on now. Right across the hall. Let's do this. There are people in our state that need medicine. And there are 500 people that use epidilex in this state. 500 patients. Ladies and gentlemen, I ask for your favorable consideration on SB195. Are you for any questions if there are any missed? Do you know for questions? Yes, sir. The chair recognizes Representative Eric Atomis to your left. Yes. I do. Yes, ma'am. I do. Yes, ma'am. Thank you for the question. That's a great question. Yes, indeed. This is a great bill. And I appreciate that. I yield for another question, Mr. Speaker. Only if it's like that one, right? Yes, sir. Yes, ma'am. Thank you so much. Is it not true that this bill will help for HBCUs, which are historically black colleges, across the state will be able to be involved in the processes and the learning abilities of this THC oil in other products? Yes, ma'am. Yes, ma'am. Indeed. I'd encourage everybody in this chamber to do something. If you have not done this, I would ask you to go tour what I call the trifecta. Just write down the road right here. More house, development and Clark Atlanta. There is more education going on right there in that little triangle than any place in the state in the United States, really. And it would help them get research. And they will provide research on this. Clark Atlanta, as I said before in this well, leading in the United States on prostate cancer. Let's let them study it. Let's let their doctors study it and then provide back the research to the dispensaries, to the cultivators, so that we can further understand how this medicine helps people in this state. Thank you for the questions. Great question. Are you for one more, Miss Speaker? Chair recognizes the Dean of the House. Dean Smiley to your left for a question. That's another great question. Thank you, sir. Test one, two. Yes, sir, I yield. I just wanted to follow up with my colleague because we had discussed this in our original bill. We had designated to the institution within the University System of Georgia. But now this opens it up. It still keeps the same number of licences, just per se, but just open up for research. That's right. Exactly. Which I think is a major step in the right direction because the more research that we have, the more we're able to help those people out there that need assistance. That is correct. The only two universities that are allowed to have a license, the only two will be the University of Georgia and Fort Valley State University. Because those are the only two land grant universities that we have in our state. No other universities are going to be able to grow this. No other university will be able to have a license designated for them. They will be able to petition to research, but they'll only be granted that ability to research if one of the cultivators agrees to partner with them, which all of them already have. Let's speak. I yield the well and ask for your favorable consideration on this very good bill. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. The purpose is representative Bentley rise. The hall of the parliament inquiry. The hall of the parliament inquiry. Mr. Speaker, is it not true that the author of the bill mentioned Fort Valley State University and that sits in my district and I would like to invite all members of this House down to the beautiful campus of the Fort Valley State University to see the resources actually going on in the land grant institution? And is it not further true, Mr. Speaker, that our dean of the House, Calvin Smirers, serves as the chair of the Foundation Board at the Fort Valley State University? And is it not further true, Mr. Speaker, that I will be getting some of that goat milk soap for all members of this chamber that vote yes for this bill on today? From Fort Valley State University, thank you, Mr. Speaker. I thought I saw your eyes light up when they said Fort Valley State. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 195. The eyes are 165. The nays are one. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 165. Senate Bill 165 by Senator Gooch, the 51st of Patrick's 32nd, peach 22nd. Miller, the 49th, again to the 47th, another to be titled an act to amend chapter 8 and total 40. The fiscal to Georgia annotated relating to equipment and inspection of motor vehicles. So it's the exempt fully autonomous vehicles from certain vehicle equipment requirements. This bill ever referred to committee on motor vehicles. That committee recommends that this bill do pass by committee substitute. Chair recognizes the gentleman from the city of St. Simon's. Chairman Don Hogan to present the bill. Thank you, Mr. Speaker. You're going to pay a lot of taxes when you come to St. Simon's. I can assure you. Thanks to Chairman Corbett for working this out for me to get part of my bill on Senate Gooch's bill of Senate Bill 165. It came out of House Committee on Motor Vehicles with the following substitute Senate Bill 165. What this does is vehicles that are used for farming and then being on public roads that must have an amber light or either a triangle with red and orange. Basically, that's what the bill that Senator Gooch said. And I was able to add on with Senator Corbett's help requiring that a permit that has required for an amber light on a slow moving vehicle that that can be done by the tax commissioner when you go to get a tag. Right now you must do a permit from the Department of Revenue. It costs $2. You have to get a money order, which is a dollar. And you have to have a $55 stamp to send it up to appear. And it could be done by the tax commissioner at a cost saving. And you've got to have that permit before you get a tag. So that's basically the bill. And I request that you vote positive in this to help out with the citizens that have slow moving vehicles. You do not. Well, you do have a question. Do you? Are you? Chair recognizes representative Ridley to your right for a question. This gentleman you, I do. I want to thank you for bringing this bill. I know we're heading to motor vehicles and you've done a great job on one question I did had. And I forgot to ask you the motor vehicles about this. Is this just to have to do with vehicles or will you actually have to have a slow moving sign on your back? Say that one more time. I said I love you. I'm thank you for bringing this bill. Gentlemen's out of order. He's very much out of order as most of the time. You yield for another question. I yield. Chair recognizes representative Meeks in the gallery, your seatmate, with sufficient social distancing in between you. I can assure you of that. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Mr. Chairman, you mentioned that he's trying to go ahead to be on farm vehicles. Can you describe the vehicles and does that include my truck and other members of the chair? It does include your truck. It would probably indicate my truck is not a slow moving vehicle. I'll only call it a farm vehicle. You use your truck for hunting and everything else. Thank you, Mr. Chairman. Thank you for the question. I yield the well and ask for you the positive vote. The gentleman has yielded the well. There is an amendment to the bill. There is an amendment. It's AM430198. Chairman Martin will speak to the amendment. Thank you, Mr. Speaker. Ladies and gentlemen, the amendment is just as simple as Chairman Hogan so aptly put it, he borrowed this to help folks at own slow moving vehicles. The amendment saves them additional money.\n\nSo in Georgia they got caught up a few years ago when we decided to put a $200 fee on electric vehicles that drive on our highways that inadvertently caught these slow moving vehicles. We were going to try to get them up on the board but there's a technical issue. These are these little gem carts. They're defined in Georgia code in 40-1-1. They go more than 20 miles an hour and less than 25 miles an hour on flat paid surfaces. So they can't be on a highway. What we seek to do with the amendments is just add a section so that these folks only pay $100 instead of $200. There's about 600 of them in the state of Georgia right now. So there won't be a huge financial impact about this. This will help do this. I believe I'm telling on my friend Chairman Hogan but I believe he said he paid about as much over a six-year period in these $200 fees as he paid for a vehicle originally. So he's paying 16% of what he paid for the vehicle annually to own it. That's a pretty high tax on it. So I ask for your favoral consideration on AM-430198. It only applies to slow moving vehicles about 600 in the state of Georgia. Mr. Speaker, I'll yield the well. Chairman, as yielded the well. All right. All right. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. There is an amendment. It is amendment AM-430198. Is there any objection? Clerk will read the caption to the amendment. The Committee on Rules Office following amendment AM-430198. Amending the House Committee substitute to 165. LC 39. 30. 36. S. The amendment is printed and in your books. All right. Is there any objection to adopting amendment AM-430198? Is there objection? The chair hears none and the amendment is adopted. Is there any objection to adopting the amendment offered by the Committee on Rules? The chair hears none. The amendment is adopted. Is there any objection to adopting the Committee substitute as amended? The chair hears none. The Committee substitute as amended is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The chair hears none. The report of the Committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The Committee on Rules Office following amendment AM-430198. Amending the House Committee substitute to 165. The Committee on Rules Office following amendment AM-430198. Amending the House Committee substitute to 165. What purpose does Chairman Workhazer rise? He waves. Have all members voted? Have all members voted? Yes, so the clerk will lock the machine on the passage of Senate Bill 165. The eyes are 166. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 193. Senate Bill 193 by Senator Mulles, the 53rd Harper, the 7th Harborson, the 15th Jackson, the 2nd. Attitude 50th and others to be entitled to amend. Chapter 5, on the 480th, the Fish Go to Georgia, and Tidet really an ad ballorum taxation of property. So it's the grant counties, the option of requiring that mobile homes procure and display decals. This bill I refer to the Committee on Ways and Means. The Committee recommends that this bill do pass. Chair recognizes representative Cameron to present the bill. Thank you, Mr. Speaker. Our yesterday to present Senate Bill 193. It makes a change to title 48 of the Georgia Code. Currently every year mobile home owners are required by April 1st to pay an ad ballorum tax. When they do that, they receive a permit in a decal. This bill does is give an option to counties who don't want to go out and inspect decals all over their area. Counties that want to continue to do businesses they have can continue to do that. Otherwise the homeowner will not have to put the decal on their mobile home. And what this does for counties, it saves them money and having people go out and do that gas. It also makes it easier for the homeowner not to have to put the decal on. And also if someone doesn't pay their ad ballorum tax, it will show up in a system and they'll be able to follow up with them. Now not shall Mr. Speaker, that's the bill. I have a question if you can. I yield for questions and abuse. Thank you, sir. I'm sure this will not be abuse. I'll have to say that. Chair recognizes representative seems in the gallery to your right for a question. Does the gentleman yield? How does the sticker decal sector Georgia feel about your effort to put them out of business? Oh, they're kind of ambivalent. Thank you. No further questions. No further questions. I'd ask your favor consideration of this bill. Thank you. Is there any objection to the previous question being ordered? The chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here's none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote I. Those opposed to vote no in the clerk will unlock the machines. I have all members voted. I have all members voted. If so, the clerk will lock the machines on the passage of Senate bill 193. The eyes are 163. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption. Clerk will read the caption to House Resolution 406. House Resolution 406, what represent of Lehood, 175th and others, the resolution urging the Georgia emergency operations plan to prioritize the continuum with the long term services and support system. This resolution haven't been referred to the Committee on Public Safety and Homeland Security. That committee recommends that this resolution be adopted. Chair recognizes representative Lehood to present the resolution. Thank you, Mr. Speaker and members of the House. House Resolution 406 is a urging resolution and is urging the Georgia emergency operations plan to include the entire spectrum of long term care provider, provider groups in the planning process. This is to ensure that a lot of a variety of provider types and the older adults and disabled citizens that they serve across the state that proper representation is there to identify and deploy resources to them during emergencies. I do want to take the time to say how grateful I am to those that have planned for the emergency conditions we've been under for the past year during the pandemic. I think that the folks involved there have done an amazing job done great work and I'm thankful for what they've done. The inclusion of more provider groups would just make sure that we cover more details and that thoroughly serve older giordans. Thank you and I ask for your favorable consideration. Are you on the way for a question? If there's a question I'll yield. Chair recognizes representative Cannon to your left for a question. Thank you. Do you yield? How does this bill affect those who are diagnosed with Alzheimer's considering the fact that after someone is diagnosed with Alzheimer's they're unable to claim long term coverage for care. So how does this bill affect those individuals in Georgia? Well, there's approximately 42,000 older adults that are covered in the long-term care provider groups that I'm urging in this resolution to be included and a lot of those do have Alzheimer's. And so my answer is that it will definitely help connect. So, do you have any questions for the children with Alzheimer's with the resources needed during emergencies? Do you further yield? Yes. So at this time in the state of Georgia after you are diagnosed with Alzheimer's you would be unable to apply for long-term care insurance. Just to double back down on my question this actually would only affect those who have already applied for that coverage before receiving the diagnosis of Alzheimer's or you're saying that afterwards they would also be able to be included in this population. This bill has nothing to do with long-term care insurance but if you'd like to talk offline I can explain more about what this bill does do. Speaker if there are no further questions I'll yield. You'll do well. You have no further questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote on. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will unlock the machines. On the adoption of House resolution 406 the eyes are 167 the nasors 0. This resolution having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 47. Senate Bill 47, Senator Gooch, the 51st Millow, 49th, Dougan the 30th, Kennedy, the 18th, Walker, the 20th and others. V. Toddle and Actuament, Article 33, Chapter 2, a total 20, the fiscal to Georgia, and it's ended relating to the Georgia special needs scholarship act. So it's revised the prior school year requirement. This bill ever further committee on education that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Will Wade to present the bill. Thank you, Mr. Speaker, and to the members of this body I appreciate the opportunity to be here today. I am here to present Senate Bill 47 and this is a simple bill to deal with a complex and special issue. That is those children in our state that I have some of the most amazing needs. I want to tell you a little bit about myself. Many of you don't know me. I know I'm a freshman. And this is my first presentation of a bill. For me is a former school board member in Dawson County for 15 years, a former member and president of the Georgia School Board Association, a person that is a product of a public school, a son of two public teachers, public school teachers. My wife is a special education director for a middle school and a 20 year career educator in the Lumpkin County Schools. Education is my center and children are at the core of that purpose of what this state's constitution requires of us. I'm here today to let you know that this will ensure that all students with special needs have access to the Georgia needs and scholarship. It is a slight expansion. I am not for broad-based expansion of vouchers. I believe in our school systems in this state and I believe that based on the data that is currently available as it relates to this current program that's been around for 14 years, that 99.7% of the students in this state are currently in places that they want to be. That represents 0.3% of the students. There are 5,203 students currently utilizing this special needs scholarship. This very moderate slight change to expand to some 504s that are outlined on page five of the bill will highlight to you that this would only give an opportunity to those students with those specific conditions who are not currently receiving the services that they need. I welcome the discussion and I know that this can be a very difficult vote for many of you. But I would ask that you listen as I present a few things. First, over the last 14 years, there have been 5,203 students across this state out of over 200,000 students with an IEP that are eligible. What does that mean? We have teachers and administrators and public school personnel like my wife across this state who work tirelessly to make sure students with special needs get the instruction that they need. Public schools are doing an amazing job. But even the best business does not get 100% satisfaction for 100% of its customers, 100% of the time. This for me is reminds me of something that actually wasn't going to bring up, but I've experienced something this year that has changed me. I've lost my father. Many of you stood with me. But I want to tell you a story about Macy Wade, my aunt that I never got to know who grew up in Leslie, Georgia. In 1942, when she was born, she barely made it into this world due a problem with a pregnancy. She became what we now call special needs, but in that generation they used the R word. For those of you that are passionate about children and adults that have trouble in this world, you understand what that R word is. And for me, it's as visceral as the nastiest word on this planet. You understand that public education system in this state back in those days? My aunt was not allowed to be in a public school setting. They did not have a place for her. I champion every single educator of every race and creed and every single background because they're serving the most special and precious among us. My aunt did not have that opportunity in a public school setting. And I am thankful to the good Lord that 99% of the students in this state, I believe especially that are special needs are being well served. But there are just a few that aren't. We talk about charter school systems. We talk about linear technical colleges. We talk about the college setting and career to path. Pathways for their careers. We try to make ways to allow every single person to find their way in this world and listen. As a public school person, I applaud the organizations like GSBA, G-S-S-A, GAE, Page, Gail. I can list them all. I know and I've got deep friends who love me that are not excited that I'm presenting this bill. Because their role is to advocate for the institution of public education. And I totally respect it. I was a part of that for 15 years. But I can also assure you that in my system, we acknowledge that there are just a few kids that the current system doesn't fit. This is going to allow a very moderate change. Now the Senate started out with a decent bill, but the House, as we always do, we improved it. And I appreciate those members on the Education Committee that brought forth ideas. And the amendment that I brought changed this legislation and made it tighter. I along with other members pushed to remove the diagnosis alone from qualifying a student for the scholarship. In addition, we require that the State Board of Education create a process to confirm that students with 504 plans that meet the eligibility criteria outlined in this bill and changed by this House Education Committee that they would qualify for the scholarship payment. I've heard terms like slippery slope. I've had folks reach out and tell me my school board's a little nervous. I love it. I respect it. That's what this process is about. But I want you to hear me. I'm from North Georgia. I understand what slopes are. But I've got roots in Sumter of County, and I'm telling you a growth of a program for 200,000 students in which only 5,000 students are utilizing over 14 years as a flitter is what my daddy would say. It means public schools are doing a good job. But our responsibility in this state is to ensure every single child has an opportunity for a quality basic education. I believe in excellence in education. And I believe that some parents need an option. Not many parents, because public schools where they are provide a great means. I've been in this program for 14 years, and I'm brand new to this House. I want you to hear me. The program needs some updating. And there's more work to be done. The reason I'm carrying this bill is because I'm not finished with fixing a program that currently is utilizing $35 million of Georgia taxpayer funds. It's not the local dollars. It's the QBE funding that follows these students. But folks, this is not a slippery slope. This is to help those students that currently are looking for a small option that isn't available. If you'll notice the list that I'm provided that is in the bill on page 5, many of these diagnosis become an IEP. But we heard testimony from parents in our committee that talked about their situation. The children with autism, children with cerebral palsy. And I want you to understand this from a 504 standpoint versus an IEP. I love education, my careers in banking, and we both love acronyms. What's a 504? What's an IEP? What are all those things about? It boils down to this folks. I heard a mother testify to me as a school board chairman years ago. And she said in order for my child to get an IEP, my child has to fail much more to show that they need more needs so that they can actually end up with the services that will serve them. I don't want my child to have to fail to get more services. I want my child's baseline to be their baseline, and I want to focus on my child's growth. And a 504 plan is what the teachers and my doctors are telling me it's needed. We don't need an IEP. An IEP actually would bring down some federal dollars. But if the parents and the teachers in the schools know it's not needed, why would we want a forced a child to fail just for the sake of drawing down funding? Again, I'm here because I want to serve this state and those children, especially those children, like my aunt. The world would say that she had a third grade level. But you know what? That was her maximum. But did not take away her ability to love my dad, her younger brother. It didn't take her ability to sing in her church, to deliver newspapers in a community, to worship her savior. These children deserve an opportunity. And I want you to hear me. This program has been around 14 years, and I've not seen in my capacity as a school board member much change to make improvements to listen to the concerns of those that are anti- anything that relates to vouchers. I respect their position. But this is a program that exists. I was elected to come down here and work to make things better and to keep awful things from happening. This program needs a little bit of work. But for me, the child is first. They are the center. They are the core of my purpose. And I believe our state's constitution backs that up. With that, I will be happy to answer any questions. And I will yield, Mr. Speaker. Do you yield for questions? I'm honored to do so, sir. Maybe not. I recognize the minority caucus will represent the Wilkerson to your left for a question. Thank you, Mr. Speaker. This is gentleman Yield. Thank you for your service to education. I have a couple of questions. I have the opportunity to look at the special needs scholarship. I remember when another representative was doing HB60, I got a chance to dig in deeper because education is also a passion of mine. I guess my question is, you mentioned a few counties. Lumpkin County. Can you tell me how many schools actually service special needs students in this qualify for this program? How many students are currently in this program? How many schools are available? What I'm looking at is the DOE list of SB 10 schools that are available. And when I click on Lumpkin County, nothing pops up. Is that correct? That is correct. But there are in Lumpkin County four students that are currently receiving the special needs scholarship for their extremely specific needs. Those families are transporting them from that community to a private provider. I just happen to know those families. Three of those are living below the poverty line. One of them would be what I would consider a moderate middle-waged family. Does it gentlemen for you? I do have a couple of questions. Thank you for this. But that transportation is not provided in this scholarship. That would be out of their pockets. If you're below the income level, this would be, I'm assuming, an undue burden. Would you agree with that? Well, the parents that are receiving that scholarship believe the opportunity to have the services provided meets that expectation. And they're willing to utilize and set their budget to transport their child as I can tell you that I would probably drive over heaven and earth for my daughter if she needed it. Thank you. And last question. You also mentioned, I think, Sumter County. Yes. How many schools on this list? As I click through, actually have SB 10 schools on that. Which I am not finding any schools. And I say that because I know a lot of the rural areas. This is a great bill if you're in the metro area for some folks. But my concern is in the rural areas, the up in the mountain areas, you know, that we just, they just, there are no schools. Is that a concern of yours? It is a concern of mine. I think it's a great question. I do believe that those families would have a similar opportunity to drive if they found something within their realm of possibility. As in education, anything, this is not going to be everything for all people. But it's a start for those families that have access. And I'd love to see us figure out a way to give other opportunities for those counties that you highlight that are not currently receiving a designated school that could be a provider. Thank you for the question. Do you further yield? I'll just take one more question. Chair recognizes representative Ridley. Do you're right for a question? It's just my friend you honor to do so. Is one of the, I guess the reason in here is dyslexia. Is it included in this bill? It is. Yes, sir. And so under this bill where my son was in public school, my wife was a vice principal there. He was going in the third grade couldn't read at all. And it was not included at the time. This would actually cover that for we actually had to move into a private school for him to actually get help. Is that correct? It would be covered if you have a 504 plan conducted by that school and then verified by the state board of education under this bill. That is correct. Thank you for the question. Thank you. Thank you for bringing this bill. I know you first bill. You're doing great job. Thank you, sir. Do you further yield? I believe that I have answered many questions and I appreciate the opportunity for our folks to vote and I would like to yield the well, sir. Gentlemen has yielded the well. Thank you. Got a number of people that wish to be heard on it. Chair recognizes to speak to the bill. Representative Benton. Thank you, Mr. Speaker. Ladies and gentlemen, I come today to speak against Senate bill 47. I rarely come to the well to speak for against a bill. I'd rather sit and listen to the discussion and see how other people are talking. But anytime a bill comes to the House floor that I feel will affect public education. I feel compelled to speak out. Public education was how I made my living. I taught school for 30 years.\n\nmiddle school setting. I taught kids kids at an age when their hormones are jumping around but I taught also in classes where we had special needs children in class with with regular students very passing about public education and so I want to talk to you for just a few minutes about my take on Senate Bill 47. The bill refers to a 504 plan and there's a lot of difference between a 504 plan and an IEP and I want to talk about that for just a minute and then I want to talk to you about some of the things some of the myths that are that are going on or and have gone around in this house chamber and so forth but what is a 405 or 404 plan it is a set of accommodations or changes in the classroom environment to help a child follow the regular curriculum in other words it is not a anything but a set of guidelines that the teachers have agreed to along with your parents a child's parents some things that can be done to try to help your child do better in the regular classroom it is less formal and involved than an IEP and does not change the instruction itself for example if a student uses a wheelchair but does not need academic help that student would have a 504 plan other accommodations might be to rearrange the classroom that your child take more time for a test or give certain types of learning age I know about these things because my 13-year-old grandson was diagnosed with ADHD and he is under a 504 plan all of these things have been done for him to try to accommodate him for lack of attention and other things that cause him problems in the classroom it did not change his curriculum he is still in the classroom with all of his classmates so what is an IEP it's a document that describes the special services your child will get to meet their educational needs it is a legal contract between the parent and school and it can go from being self-contained to being taught in a regular classroom but having a special head teacher in with with that class now there are a lot of myths that are going around concerning vouchers and concerning this bill here one of them is one student takes a voucher public schools funding is unaffected if I've heard this once I've heard it 50 times if enough students leave it means that teachers have to be let go whether or not a school is better off is debatable schools have two types of cost fixed and variable variable can change quickly but fixed cost remain regardless of whether a student leaves utilities custodial buses lunchrooms or some of those fixed cost the doors to a public school are open to all regardless of race color national origin and English speaking ability another myth is that parents can use these vouchers to exercise school choice for children it's hard to believe with all this a commotion but there is not a perfect market for school outside the public system there are few choices in rural areas a child might not be eligible for a certain school a child might not be the type of student that the private school is looking for or the nearest private school is not accredited by any reputable accrediting agency a third myth is that kids perform better own tests and private schools once they use vouchers vouchers are constantly associated with lower test scores for participating students studies out of Louisiana oh how the District of Columbia and Indiana show student performance suffers for students who change from public to private the biggest difference between public and private school students has probably more to do with family income than anything so why the need for this voucher is it just another attempt to get the proverbial camels nose under the tent flap let's recap why we do not need this version of sent bill 47 though having a 504 triggers student eligibility for the voucher using the voucher means the student loses their legal right to services to address their special needs the 504 does not change the curriculum only the accommodations because private schools accepting the vouchers aren't mandated to administer the same student assessments as public schools we don't know if private schools are going or doing a good job meeting qualifying students academic needs we also don't know how the voucher dollars are being spent and could be used for items or programs that public schools cannot spend tax dollars for this bill does not meet traditionally conservative goals of government accountability and transparency we need to amend this bill to add more fiscal transparency including an annual evaluation of the program by the state this should be done for all programs that seek to allow the spending of state dollars for private programs if the goal is to provide families with more school options parents need information about how successful private schools are at serving students with special needs this information should be provided to parents ahead of time like the voucher student retention rate of a private school accepting the voucher all of these are reasons to defeat the bill today and I hope you will join me in voting against Senate bill 47 mr. Speaker I yield well chair recognizes representative dryer to speak to the bill thank you mr. Speaker I want to say first that I've got a son that has a 504 plan I've gone through the IEP qualifications with him and I was pleased that the school and the teachers agreed he didn't need an IEP but I never felt any pressure to fail to get an IEP so I feel blessed in that way and I also want to tell the sponsor here the first bill I worked on in this chamber was to remove the R word from the Georgia code and I'm very proud I got that done I actually got that bill framed in my office but we do have a disagreement on this one this bill with its cap currently costs a state thirty five million dollars a year it specifically costs public schools thirty five million dollars a year by taking the cap off by expanding it to 504 programs like the representative just mentioned you could be going up tremendously that is on the back of us having cut since the start of the Great Depression ten point two billion dollars from education secondly public schools have to accommodate every single student as has been mentioned private schools don't and will not in fact some private schools may initially accommodate a difficult student and then when things get a little too rough say say no more and that student has to go back to a public school but yet they waved their federal rights because they had to wave those rights to get into the program that we're discussing today I'll give an example of public schools that don't do this somewhere very upfront a North Georgia Christian Academy says on its website it doesn't have the resources to accommodate students with most disabilities so that's a that's a flaw in the bill right there and would it even pay for a private education say this is roughly six K is what the year is what the numbers show but you're gonna see people thinking they're gonna be able to go to Westminster which is twenty eight thousand dollars a year thinking people are gonna go to Pi Day twenty four thousand dollars a year or woodwood twenty five thousand dollars a year even even more affordable ones like Southwest Christian Academy and Calvary Christian it's still is only going to pay about sixty percent of the cost and that doesn't take into account transportation and I would drive my my son all over heaven and hell to give him more opportunities but there's just people that can't do that as much as some parents would love to do that if they're single if they're working to jobs if they don't have adequate transportation that's just impossible for them to do that I was taking my sixth grader to school last week and I was asking him about this bill and in fairness I let the representative take my kid to school and he could get equal time with them but my I told my kid what this would do and he said dad we can't cut more money from school we don't have enough money it is is right now his school doesn't have music programs his middle school team sports don't start until the seventh grade because of funding art doesn't start until the seventh grade because of funding and the elementary school doesn't have a foreign language program which he just graduated and those were all cut since the start of the great recession this would just remove more funds and if you want to drive about five miles south of here with me I can show you schools and historically disadvantaged communities and those schools isn't what they have to do they have to provide health care regular health care dental health care mental health care I care three meals a day year round and they have to put washers and dryers in this school they have to do all of that just to have a small shot at educating some of these kids and yeah we need to help the system so that all that does not fall on the school but we at the same time cannot be removing more from the schools at this point and I think the thing that gets me the most if you're born in an historically poor neighborhood in South Atlanta you have a 4% chance of ever making $70,000 or more a year a 4% chance okay that's not opportunity that is not merit so a meritocracy as much as we feel comfortable thinking that as much as that helps some of the sleep at night and we're not in a meritocracy and we cannot disinvest in our public schools we cannot make it harder for these public schools to do already a hard job and that's what this bill would do it would remove resources and finally there's no data collection we're not going to be able to go back down the road and see if this is truly helping folks that could not otherwise go to schools and get them the resources because it's not in the bill and it's been asked for but it's not there so we can make this better I would like to support a bill that can make this better but I'm going to be voting no thank you mr. Speaker I yield the well chair recognizes representative Stacy Evans to speak to the bill thank you mr. speaker ladies and gentlemen let me start by saying that I have great respect for my seatmate representative Wade we've been fortunate or I feel fortunate I don't know if he does that we were seated next to each other on the seating chart and I know his heart for education and we've had a lot of great conversations about how we could do things better we just happened to disagree on this bill and for those of you that know me and that we served together in a prior life you know that I'm not against thinking outside the box on education issues that I don't have a knee jerk reaction against changes in our education system I know that we need to be innovative and I know that we need to be bold but I don't think that we're doing that generally and I don't think that we're doing that here this bill expands a program that already exists that we haven't studied we haven't reviewed it it doesn't have transparency we don't know how it's working for who it's working and how we might make it better now one good thing about this bill is that it does add some transparency in the what it's in the last section of the bill but it does that while otherwise expanding the bill before we get the results of those transparency tools let's do the transparency first let's find out what we're working with and then let's move from there I think that would be the most prudent course there are other problems that have been gone into and I know that my daughter report will go into so I'm gonna belabor those I just want to kind of take a review of where we are as a whole in education we're working with an outdated funding formula I think this funding formula is actually older than some members of this chamber just think about that for a second Joe Frank Harris was governor was the 80s I think I was an elementary school the last time we really looked at the QBE funding formula despite how it's outdated we also still underfunded with one exception have underfunded it how about we fund it let's fund that formula and judge our schools after that how about we write a funding formula that reflects what we know about education in 2021 then let's fund that and let's judge our public schools after that we're not giving our public schools a chance to show us what they can do for our kids we can't continue to fail to fully fund our public schools change mandates year after year back and forth back and forth give take and then say you're not getting it done and we think more kids should have the ability to get away from you that's not fair now I know life is not fair but we should be doing our best in here to make it as fair as possible some words to live by someone told me long time ago if you do what is easy I know this isn't about the turtle on the fence post if you do what is easy the journey will always be hard but if you do what's hard up front eventually the journey will become easier fully funding our public schools rewriting the funding formula that is hard we might have to revoke some lucrative tax breaks for our friends we might have to raise the tobacco tax we might have to do other hard things but when we spend smart on education we're gonna reap the reward our kids will reap the reward our economy will reap the award and we can say that we did it that we worked together that we dug in we did the hard thing and we did right by our kids we haven't even tried to rewrite this funding formula y'all for what the last eight years since it was that we undertook that when we abandoned that effort because it was hard let's do the big hard things that we need to do for education and quit doing small things quit picking 500 kids here a thousand kids here a 10,000 kids here what about everybody else even if you think this is the most perfect bill how many kids are we actually helping our responsibilities to all the kids in this state we're picking out a few and we're leaving the rest out there under what we know are outdated underfunded conditions mr. Speaker colleagues I asked that you join me in voting against this bill and I yield the well chair recognizes representative dukes to speak to the bill thank you mr. Speaker and to represent a way who has worked tirelessly and trying to bring this legislation my concerns with this rest in how does this bill help those people that I represent and when I say that specifically those people in rural Georgia you see we don't have those facilities first for those kids to go to I've spoken with every superintendent that I represent which happens to be four you know in rural Georgia so we we represent a lot of counties and none of them not a single one is in support of this legislation we do need your help in rural Georgia but we need your help in helping us to craft policies that are going to help all of Georgia's children and not such that we do out in cherry pick one or two we operate with such limited resources in my part of the state until you you remove sixty six thousand or whatever dollars that you are attempting to do we operate from economies of scale we can't afford it this bill as many have spoken to when we pay a Senate bill ten a few years ago we don't know how that is working or have it had an opportunity to accomplish its objectives so behalf of those people that I represent that being Dirty Miller Baker in Seminole counties I'm going to ask that you vote with me and hopes that we will defeat this measure and also I want you to help me as we can share craft legislation that is going to make education better for all of the children in the state of Georgia thank you Mr. Speaker I'm you all the way to the bill chair recognizes representative can trail to speak to the bill thank you Mr. Speaker I had a real nice speech planned but I'm just going to speak from the heart listening to my colleagues while I appreciate their comments it really makes me wonder if any of them read the bill instead they watched the tapes from fourteen years ago when the same speeches were made from the same podium talking about how sp ten was going to bring the demise of public education in the state of Georgia we have fourteen years have any of my colleagues met one of these families whose lives have been transformed for the better because they got their kid in an learning environment that actually worked for them this cost the state of Georgia absolutely not one penny more if every kid went back to the public schools would be spending the exact same amount of money as we are when they take advantage of this program in addition to that the public school gets to keep almost half of their funding so it's like it's like a me to side and I don't want to shop for groceries at publics anymore so I'm going to go to Kruger but guess what publics gets to keep fifty percent of my money even though I'm not shopping there anymore it's a big win for the public schools they get more funding I don't understand where we've lost our path that we're supposed to be doing what's best for the kids of this state I know many families whose lives have been transformed by this current program and we heard in the education community of the day many many more families who lives could be transformed if their kids were eligible their kids should have been eligible fourteen years ago but through a technicality they were left out it's not just about a five oh four read the bill you got to not only have a five oh four but then you have to have a diagnosed condition that goes along with that five oh four the current system motivates parents of kids with special needs who are fully engaged in help their kids keep from failing the current program motivates those parents to cause their kids to fail so the qualify for an IEP so the qualify for this program 200,000 kids are eligible for the program over 97 percent of them have stayed in our public schools our public schools are doing a great job this is not about our public schools not doing a great job they are doing an exceptional job 2.6 percent of kids who are eligible for this program are taking advantage of it only 2.6 percent in 14 years this is a great program if the same percentage take advantage of the expansion of this program is only expanding by about there'll be about 50,000 more kids eligible we're talking about 1300 to 1500 more kids that's all at no expense to the state because they are already in the budget you didn't realize that these kids will have been enrolled in public school for a year before they qualify for this program so the parents know well and good what they're receiving from the public school that they happen to be districted for so the parents are looking for a better option folks these special needs families are counting on us we're supposed to be down here doing what's best for kids what's best for kids is that you vote yes for SB 47 and I strongly encourage you to join me in enthusiastically supporting this bill thank you mr. speaker chair recognizes chairman sets were to speak to the bill thank you mr. speaker legend gentleman house I'm rising to speak to it everybody in this body perhaps even particularly members of the minority caucus I am honored to represent a part of Cobb County where the schools work great for special needs kids Baker elementary school in my district is a place that parents move from counties around to put their kids in Baker because a special needs programs at Baker elementary school for kids are great my son's high school can us all mountain high school even though it's a magnet school that sends 25 to 30 kids per year to Georgia Tech and Ivy League schools the pride and joy that schools not their top performers that are going to the Ivy League but is the incredible special needs program they have in their school but our votes here are not all about me they're all not all about us they're not all about our districts they're about what's best for those in the state who perhaps don't share some of the benefits that we do I heard the gentleman talk earlier friend of mine who represents the area right around this capital talk about let's go five miles south of here let's look at what things look like there well let's go there indeed let's let's take the question the other gentleman ask and raise that an IEP is really a contract I would suggest if we head five miles south of here in southwest Atlanta and talk to somebody perhaps someone that's struggling perhaps let's imagine a single mom that's working two jobs keep the lights on what if the contract is not being fulfilled by her public school what if in spite of all of her efforts the school that serves her first graders just not working in spite of all the promises in the contract does the single mom work in two jobs to keep the lights on have the ability to move to to a district where they can afford a six hundred thousand dollar house for the school's work no can they stay home and home school their kids because the schools don't work no can they afford even the cheaper lower cost private schools even if they're willing to sacrifice can they afford a thirteen thousand dollar fifteen thousand dollar a year school on their own salary the answer is of course no if I she might ask the same questions the representative can trail so articulately asked why why why do my own elected officials that represent me in southwest Atlanta or other parts of the state why can't they see the systems failing my kid she's not looking to destroy the system she just recognizes her obligation is to this little one this first grader who struggling and has an i.e.p. it's not being served in schools maybe they get through first grade maybe they get through second grade and still going into third grade they're looking at a third year of a failed outcome for their kid for whom they have an individual obligation how is this general assembly empowered that young mom to do the right thing by her kid the answer is well we're just ideologically opposed to this idea of private dollars leaving the system for any reason she might ask well gosh the schools aren't being hurt my school district loses no money if I were to transfer to another district or to transfer to one of these schools but why would we make someone like that whose entire support network is right there in a community their mom or their friends that are on who may depend for lots of things are there they can't just move three counties away why is this general assembly going to leave them stranded to deal with it when their obligation to their little eight year old has failed for three years in the row is this general assembly going to say deal with it we support our public schools we all support public schools friends but we are called to look at the least of these we're called ask ourselves this hard question friends don't let the ideology of national politics pollute taking dollars and allowing to to follow a person that can make a difference in the lives of their kids in a way that's not going to hurt your public school system with one single scent because if you leave to another district the money follows them if you leave to to get one of these vouchers the money follows them just the same mr. speaker all closed with this story I was had the honor in fact I'm wearing a sport coat today that I've had for a number of years I was wearing this sport coat in Marietta middle school about nine years ago and one of my good friends who served with me no longer serves she formally represented the 39th house district from South Cobb County and I were talking to a group of alpha kappa alphas sorority sisters and as she was making her presentation she said she was talking about school choice and about school vouchers and she was wrapping her her talk I was standing her right she said one of the most the funnest things I've heard since I've been in politics since town on meeting she looked at me she pointed says look at him a room of about 40 to 50 exceptional professional women who've done very well in life between the ages about 40 and 60 she pointed to me and she said look at him look at him they turned to look to me he was kind of an awkward moment she said why is it that people that look like him or the ones that are fighting for our babies get a good attention with the knife I can tell your friends that's a question we should all ask ourselves why is it that folks here who live in areas like Baker Elementary School a Kennesaw Mountain High School that serve their kids well or fight for people who live in areas that simply don't\n\nWere the schools violate the contract? Were they tried to or not? I'm scrubbing the motorbore. If there's schools where the kids are not being served, the least of these, why can't we simply let a mom who's willing to sacrifice? Look, six to $8,000 a year follow her kid. It may not pay the whole tuition, but she's willing to pay the difference. Why can't we let those dollars follow her in a way that would follow somebody that has the means to move to a different county? I'm talking to members of the minority party here, and I want to ask you, let's all fight for the babies who need this. Let's all fight for the kids and the parents who simply need this little amount to make a difference in the lives of the least of these. I'd ask you to join me in supporting Senate Bill 47. Chair recognizes representative Bonner to speak to the bill. Thank you, Mr. Speaker. I would be brief. Colleagues, I like many of you have received hundreds of emails regarding this topic. I've received a number of what we would refer to as cookie cutter or form emails. Got hundreds of those, but I've also gotten a number of other emails. Private emails, personal emails. Some of those emails are from the same teachers that sent out the form emails because they felt like they had to. These are teachers that are in our communities that are teaching our kids with special needs, and they're contacting me and they're saying thank you for supporting this bill because as good as these schools are, we can't do it all. Where I live, in my community in Fayette County, we have great schools. In fact, as Representative Setsler mentioned, one of the things that we're known for is our ability to teach in these special needs programs, but we also have some other schools in our community. In particular, I'm thinking of schools like Clearwater Academy and the Joseph Sam School. These are private schools where families sometimes drive hundreds of miles a day to bring their children there. Because in these schools, they are filled with teachers and caregivers that do this as a life's mission. It is their passion. And I would submit to you as good as our public schools are. There's some things that they just fall short on. And the fact of the matter is, do you want sometimes that dispassionate government entity looking after your children, caring for those the least of these, or do you want those that have this as a life's passion that do this sometimes with would have to pay. Sometimes, no pay that are out there raising private funds to outfit these schools with some of the most modern equipment around. I know where I'd like for my children to be, and I think we all know that. One of the things I've heard during this debate is about how we've got to save public education and that we can't take money away from public education. And here's what it comes down to. We have this sense of we must save public education at all cost. Well, my friends, I would submit to you that there is a cost. And the cost is these children's and the families who are suffering because they're kid, even though they're in the public school, they're only getting a little bit, a little bit of that education, a little bit of that opportunity. But what they want, what every parent wants for their child, is an opportunity. An opportunity to excel, an opportunity to achieve, an opportunity to be a productive member of society. And so I would submit to you colleagues that this bill, it only helps a small segment of this population, but it's worthy of our support. You know, around here I've learned that there's a lot of lobbyist groups, right? Our superintendents have a lobbyist effort. Our teachers have a lobbyist effort. But oftentimes there's that one group that goes without representation. And that's our children. And that's where we come in. So to my colleagues who believe that this somehow impacts public education, this somehow diminishes the ability of our public institutions to provide education. For those of you that think that this somehow gets the camel's nose under the tent as it was said, I would urge you. Let's take this opportunity to give the least of these that one little bit of opportunity that our families are so deserving of. Thank you, Mr. Speaker. And I would encourage all of you to support Senate Bill 47. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report and we have the chairments time by rule. It's 20 minutes each chair recognizes representative Becky Evans to speak to the minority report. Thank you, Mr. Speaker. And thank you, colleagues. And I rise today in opposition to Senate Bill 47. I do want to speak that I have the highest regard for the Bill sponsor and to my colleagues on the Education Committee. I am a proud public school student and parent of three students who went through public school and they had a wonderful inclusion program at our school. And I know that I joined with my colleagues in wanting to support this public schools throughout our state. One thing that Senate Bill 47 is that no one knows the true price tag of the bill or the number of private schools and families that will utilize it because there are no limits on participants and no caps on the costs for Senate Bill 47. I have a $300,000,000 to $36 million. In a few short years, any educators believe that this appropriation could increase to $200 million annually. I ask that we fully fund QBE first. It should be a condition of Senate Bill 47 that QBE be funded before we consider any expansion of state paid subsidies for private school education. As we all know, QBE has only been fully funded in the past two years and the past two decades. And Georgia ranks 35th in the country in per pupil spending. The actual cost of this bill would be enough to restore the budget cuts. The General Assembly has made a QBE this year alone and yet our funding for private schools keeps going up every year. So Senate Bill 47 allows the student with the 504 plan to qualify. That's what this bill is all about. And as you've heard, 504 plans are often written for temporary measures like a broken arm. And while this substitute does attempt to limit these 504 disabilities, it also does leave it open for the State Department of Education to later include any condition for which a 504 plan is developed. Long after this condition is resolved, a qualifying student gets to keep this private school subsidy for the remainder of his or her education. Potentially from first grade all the way through high school, all paid for by taxpayers in Georgia and up to about 200,000 cumulatively for some students. And of course the great irony of this bill is that private schools are not required to offer the accommodation for these five of four students. Senate Bill 47 hurts students in schools and communities in rural Georgia the most as representative dukes was talking about. Areas where there are very few private school options in such cases the money would not only leave the local public schools but also could be spent on private school in any other county or community miles away. Voucher programs like Senate Bill 47 are most often utilized by wealthy families in Metro Atlanta as a way to lower their existing private school costs. Sell them to buy it to voucher programs actually benefit these low income families most in need those the least of these. At the largest private school beneficiary of vouchers in Georgia St. Francis school in Roswell Georgia tuition runs as high as $24,000 a year with another $7,000 in fees. For many families in need this legislation offers nothing but a false hope as the voucher is not nearly enough to cover most private school traditions. Senate Bill 47 offers no new true accountability or transparency. A satisfaction survey of the parents of children who receive these vouchers is not a substitute for audits and public records that are required of a by appropriations from the general assembly. Senate Bill 47 has the potential to create to separate state funded school systems one for the halves and one for the have nots. I've listened closely to my colleagues who support this bill and I know they cure deeply about educating all of the students in Georgia and I know the frustration that families feel when the public education system does not work for them. I as a parent have had to go outside the public school system and pay for schooling for one of my children with the learning disability. But my biggest concern with this bill is that we keep chipping away at the funding for our public school systems. We've given the private school tax credits. We remove funding for insurance for school bus drivers and nutrition workers. We decrease transportation funding. We decrease the percentage of equalization grants. We don't fully fund QBE and we keep expecting them to do it all. Private schools do not have to meet federal requirements and in many cases private school teachers are not certified to do so. How can we support spending state funds to subsidize private schools when they ultimately may not serve the student's special needs? If a student needs to attend a private school to meet their needs, I am supportive. I'm supportive of serving the least of these with using private dollars and charitable dollars. Colleagues, I ask that you please join me in voting no on Senate bill 47. Thank you, Mr. Speaker. I yield the well. Chair recognizes representative butler to speak to the minority report. Thank you, Mr. Speaker. I've heard a lot of impassioned things said today and it makes this even harder because I'll be to the point. For the most part, I'm one of those ideologically opposed to voucher type people. And it's partly because of the fact that I went to a public school and I learned a quote that has always stayed with me. Alexander Hamilton said when the people find that they can vote themselves money, that will herald the end of democracy. So taking public money for public schools to private schools has always been a problem for me. And in a rural area, it's especially a problem because you're taking public money that is limited. It's tight budgets and quite honestly there aren't that many choices for private options for those students. The money that the parents get they think will cover the cost and they go down the road of working really hard and trying to get their child back and forth, driving many, many miles to private schools. And within two years, we find that the majority of the students who left return to the public school. And when they do, they have left for the private school that had no obligation, no requirement, no accountability, not only of how the money was used and spent, but how the child was special need was taken care of. They go back to the public school where the public school has to pick up the pieces. It's a stressful thing for the student, for the teachers who try to help them and financially. Superintendents have seen this, for my area, I've talked to every one of them and they have seen this because all of them are mature and have been in the school business for a while. And they are really concerned that the public schools have such strenuous requirements such as audits and posting budgets and achievement, tracking and zero accountability for this. And all, there's just lots that they report and keep up with for the feds and for the state and for the parents and for the school board. But those same requirements have not been made upon the private schools. As a state, we don't get a return on our investment, whether it's the money or the achievement. This is a report that I asked for to see what the average amount of voucher would be from different county and city schools. And what it would mean if students left those school districts. It's in red because if we do this, if we pass this bill and people take advantage of it based on past performance that we know a little bit about, we are looking at having over roughly 146 cities whose school systems will be in the red. The county would be in, I couldn't get all the numbers for the county quite honestly, but there were close to 50. I think it was 46, 48 close to 50 county schools that would have difficulty balancing. I really don't want to disparage anybody's plea and desire to have the very best education for their children. I taught school and I taught in a rural area just a few miles north of Sumter County and Taylor County. And I know the resources in those schools were very much underrated. We had special education teachers in those public schools that if people left the public school, went to a private school, they came back because they realized what they had and they had given up. There's no way at 1874 that a family can cover the private school cost with just the voucher. It's got to be matched with in my area at least another nine to $12,000 a year to cover the cost. I am very opposed to this because it makes me really sad that we don't value education at a level where we are taking care of them. And yet we're making a move to remove some of that funding and have no accountability. That just isn't a good way to do business in my opinion. And if we want to remain the number one state to do business in the nation, we need to have our next goal be the number one state in public education. And with that, Mr. Speaker, I urge people to seriously consider voting no and I yield a well. Thank you. Chair recognizes the minority caucus who are representative Wilkerson to speak to the minority report. Thank you, Mr. Speaker. I just wanted to touch on a few things and I appreciate the passion and I look forward to working with you off there on education issues because as long as I've been here, the things that usually come down on are either money or education. That's when I come down here and this one, it's actually both. I recognize the passion and yes to the gentleman's comment I did read the bill and I'm going to touch on a few things. I heard a few counties mentioned two things are access and money. So access, I think some of the representatives talked about it and I mentioned Taylor County, Sumter County, Lumpkin County. None of them have these private schools in there. So if you go to Georgia DOE.org, it will tell you what schools actually do these scholarships. So when you go home, you can tell these your families that you helped zero families. That's one number, zero. Because that's how many are going to help based on this bill because the majority of counties in Georgia do not have SB 10 schools. That's one thing. So if you're in the rural area and you're not outside of, if you're outside of Cobb or DeCab or Fulton, you're not helping anybody. Now, I know you can catch a ride but when I was a kid I rode the bus like many of folks did and I wouldn't have been able to get to a school outside my district. The other thing is the actual cost and this came up in the rules and I was trying to figure it out because there is no way that I could figure where we could take money from a school and they come out better. It just didn't make sense and I heard that a lot of times. Schools are actually better than more kids we pull out. It doesn't make sense and I'll tell you why that's wrong. It's completely wrong because the way these scholarships work is when you go in, you are funded at the level that you enter the grade in. So in education folks will know that a first grader, if you look at the fiscal note, like I said, here goes the numbers. A first grader and fiscal year 20 would receive $3,600 in funds. A high school receives $2,700 in funds. So what happens is when you come into the scholarship you were locked in at that number. So for all grades you will get that $3,600. Every grade you get $3,600. Whereas if you stayed in the public schools it would be $3,600 and then go down to $2,700. So where is that school would be getting $2,700 in high school, they're pulling out $3,600. So that's why the schools are being hurt by this. So your local districts are being hurt by every student that you put into this program if they have an actual school they could go to in your district. So to the gentleman's point that's been mentioned several times, this does hurt your local districts. If anybody wants to look at those numbers when we have a more than happy to go with them. As you know, I appreciate different sizes of the argument. But what I want to make sure people actually have the facts when they work on a bill and if it deals with numbers I will work with both sides. I will support both sides when it comes to financial respects. But in this bill it's a bad bill. It hurts people. It hurts the public school system. And these are not talking points about any advocacy group. These are based on the fiscal note and the bill that I read. And with that out yield any questions that there are any I'll yield the well. Do you yield for questions? I do miss the speaker. Chair recognizes Chairman Houston. Do you write for a question? Isn't it not true that the public schools of Georgia had more money in reserve than the state of Georgia had in reserve when this pandemic started? You know, let me tell you what is true. I don't want you to answer my question. Give me that question again. Is it not true that the public schools of Georgia had more in reserve than the state of Georgia had in reserve when this pandemic started? You know what? I will say that's true and I'll tell you why. Maybe if we did a better job of funding at the state level instead of using DC money we would have more money to stay. Thank you for asking that question. The locals have done a better job at managing the money and we should not be taking it from them. Yes, I agree. Is that not true? That is true that the locals have done a better job. Is it not true that people are so concerned this is not about my child going to West Minister or my grandchild going to West Minister and this is not true from a rural area. I don't have one of these schools in my district but I've got a little compassion for people who don't have any money and a stuck in a school situation where it was your compassion. Thank you. Thank you. Thank you. I do appreciate the generalities passion. What I was talking about was not disparaging anybody about their passion or not. What I was talking about is the fundamentals of this bill. And I've heard comments in this chamber about y'all and protecting black folk and I'm concerned about black and black crime. This is not about black and black crime. This is not about protecting y'all. This is about local schools across this state. And so what I'm concerned about is just making sure we actually have the numbers. So yes, I won't answer any questions and I just ask people to vote their district. Vote your interest and I would never insult anybody's passion and if there are no other questions I will yield the well. Do you yield for other questions? I'll share a will and I'll take one more. One more. Chair recognizes representative McLeod in the gallery to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield the well? Well, I yield to your question. Yes, thank you. I mean, yield to my question. Thank you. I'm not sure that the special needs program for children in Georgia is being funded by the federal government under Title One. The lady knows what she speaks. Is it not true that my grandson had a speech delay and the public school system stepped in and did an awesome job? The lady, I'm sure the lady knows what she speaks. And now he's us chatty has his glamour. Oh, that's something. Yes. So I introduce HB71 to look at the QBE formula and it's a pilot program that has not yet been, that has not gotten any hearing on it at all. And I think we must first fully fund our public schools before we start looking at funding something else. Thank you for that. And I thank the author for bringing this bill and I look forward to working with you then. I yield the well. Time for the minority report has expired. Chair recognizes the chair of the committee from which the bill came Chairman Dubnik for the chairman's time. Thank you, Mr. Speaker. I'm raising gentlemen, it's 540 on whatever day we're on, 38. If I'm asked every member to raise their hand of how many phone calls, emails and text messages you've received from parents, advocates, superintendents, I would be hard pressed to believe that there wouldn't be 180 hands to go up. I'm not down here to talk about politics. Wasn't even going to come down here and speak. As Chairman Jones said, I made a lot of good chicken scratch notes. They probably don't even make sense to me. But I think Chairman Cantrell put it best. Sometimes you just got to speak from the heart. The gentleman who talked about numbers, I feel like my life is an Excel spreadsheet. But I'm going to focus on two numbers when I talk about my support for this bill. According to the gentleman who spoke to the bill, there's 5203 current students taking advantage of this special need scholarship. I'm not really that good without an Excel spreadsheet to do that math. But what my handy iPhone calculator tells me is that that is a very, very small number of the 1.7 million students that are in this state. Someone said earlier when speaking to this bill that we should craft legislation that helps all Georgia children. That statement spoke to me and then there's a piece of paper in our notebooks that I just discovered. And one of the lines says we have a duty to provide the best educational opportunities for all students in our state. We have a duty to provide the best educational opportunities for all students in our states. We need to craft legislation that helps all Georgia children. I've said those things enough. I can't imagine what it would be like to search for options for my children, only to be told that there were no options or that they didn't exist. I can't imagine the challenge of being a parent to a child where special needs exist. And I knew that there were members of a legislative body who were opposed to supporting educational opportunities for my children because they were in a minority population of 0.003% of all students. I believe as one of our colleagues said that parents know best what their child needs. And this is bill is in no way in no way anything but supporting families and their children who are begging us for an option. This says nothing against our public school system. This is for those families who are simply asking for help. Now close with this. Someone who spoke.\n\nas well said, well maybe there are no options in rural Georgia. Well, maybe that is the case, but that means that that child may stay in that public school. Folks said there may not be an option for a private school or tutoring in my area. That's okay. Do you know why? Because 99.7% of the students with special needs are in public schools today. Those public schools are serving them. And they're serving them well. But ladies and gentlemen, I ask for your favorable consideration on Senate Bill 47 to give that incredibly small percentage of our families. And that is an option and a choice to take care of their children. Mr. Speaker, I'll yield the balance of my time to other speakers. Chair recognizes representative Carpenter for a portion of the chairman's time. Thank you, Mr. Speaker. Ladies and gentlemen of this house, I come up here today in support of Senate Bill 47. There ever was a year that families needed choices in education. It was 2020. We have kids in this state that have not been in a classroom for over a year. And as a parent of four children, that is completely unacceptable. I understand that we're all getting a lot of pressure from our school systems. But this bill does not address my concerns with public education. I have tried to explain to my superintendent friends across the state that this is not about them. But as a state, we have to address the fact that systems have disregarded the science of this virus and disregarded an entire generation of kids, simply because it was more about the teachers than the students. This was not the case in Whitfield County and in Dalton. Our systems busted their tails to make sure that students received an education over the last year, an in-class room education. They did everything in their power to make this happen. If all systems in Georgia had to act this way, I wouldn't be standing here today. But as a member of this body, I will not be silent and watch the lives of Georgia's future be thrown away. In a minute when the speaker rings the bell, my fellow Republicans, a green vote is not a vote against your school system. It is not an easy vote as someone in this well suggested earlier. It is a vote that says we are going to provide certain children of this state an opportunity to address unmet needs. Parents of Georgia, we hear your cries for help. We know you're being held captives and Senate Bill 47 seeks to give you some hope. And I yield to the next speaker. Chair recognizes Chairman Houston for a portion of the chairman's time. She waves. Chair recognizes representative Wade for the balance of the chairman's time. Thank you, Mr. Chair. Mr. Speaker, ladies and gentlemen, first I want to tell you, thank you for spending my birthday today, this long serving the citizens of Georgia. I just got a couple of final comments. Look, I appreciate every single person that spoke to this bill, whether you are fully in favor, moderately in favor, still at that last moment of trying to decide how you're going to vote when the bell rings. And if you are moderately opposed or if you are adamantly opposed, I respect you. But this is not about me or you. This is about children. As a child, I remember being the son of an educator who during the summers worked on farms. And every time I got a new customer, if you will, a family member, they would ask him to mend defense to build something out of wood. They would say, hey, tell me what you do for us the year. What do you teach? My dad has three degrees. His favorite was mathematics, but he never once talked about subjects. His answer every time was I teach children. My high school sweetheart, my wife, has dedicated her life to education. She's been a first grade teacher. She's taught gifted students. And for the last several years, she transitioned to teach special ed and took over a special ed department in which in lumpkin county schools, we have about 14% of our students for special needs. I just want you to listen to this list. And I want to talk about the funding question that everyone has mentioned. And I want to thank both the Evans speakers, especially not to give any credence over anyone else, but I do appreciate the comments from my gallery mate and also from the other representative of Evans who spoke to the minority report. She mentioned something that triggered my thought because my dad was a math teacher, I was exposed to it at a young age. And I want to explain some math to you. I feel for her and her child in her situation. Listen folks, she mentioned that she had a child with special needs. And she made the choice to take her child out of the school. If there is anyone in this school in this building who made that same decision and you had the financial ability to do so, I'm excited and thankful for you. But I want you to understand that every person that has done that, if you were in the school system at some point, your student counted as a number that is embedded in the QBE formula. And when representative Evans made that choice that she, I believe, has the full right to do to serve her child's needs that now I realize the public school setting she was in did not meet her child's needs. And she felt compelled as any mother or father or parent or custodian of a child would do to pull her child out of a public school that was not meeting the need. And the moment that happened the next time the QBE student count happened, her student was not there and that state funding did not stay in that school. Every single person that takes their child out to go to a private school that QBE dollar is no longer in our QBE formula. This follows the student. Listen to this and I'll close. Attention deficit hyperactivity disorder autism spectrum bipolar disorder cancer cerebral palsy cystic fibosis deafness down syndrome drug or alcohol abuse. Imagine that child who's born into the world who's parent suffered with those. Dual sensory impairment dyslexia emotional or behavioral disorder epilepsy hearing impairment intellectual disability muscular distrophy special learning disability spine obiphate a traumatic brain injury visual impairment or any rare disease identified by the National Institutes of Health Genetic and Rare Disease information centers list of rare disease disorders. And I'm sure the items that a 504 must comply with and address. These are the special needs students that this moderate and I would actually consider it very minimal expansion of this program is for. I appreciate each of you. I respect your vote, but I humbly ask you for all of us that think we know everything as my dad reminded me. When I became married, he said you'll learn son that you don't know what you think you know your wife will be there to remind you and help you along the way. And she has and I'm a big fan of basketball and I can't be a levored is and I can't meet the wit that my fellow freshman has brought to you, but I do want to give you this quote. Just to make a little bit of a light mood and I celebrate this March madness. I'm not talking about the legislature. I'm talking about basketball. John Wooden is one of those that I look up to and he was one of those fantastic coaches that changed the lives of many. He said it's what you learn after you know everything that counts. I hope that you will learn that right now this is not about adults and systems. This is about children and I yield the well. Is there any objection to adopting the committee substitute? The chair here's none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of Senate bill two third or Senate bill 47 will vote. I those opposed will vote no and the clerk will unlock the machines. What purpose does representative Bennett rise. Thank you, Mr. Speaker is a there for the right of over 35 years. I actually excuse based on how through 133 lady has that ride in the journal will so reflect what purpose does. Representative cannon rise parliamentary inquiry is it not true that there are racial differences in special education identification as evidence by Amanda Gorman the speaker at the inauguration which says that I. The right of the bill is actually the right of the bill. I'm sure the lady believes that to be true what purpose does representative really rise. Is it not true, Mr. Speaker that ever email text and call that we receive from school system and even the people that spoke today in opposition of this bill has yet to want not once speak about the children but only speak about the money. And I don't know about you but for myself my kids are not for sale to any teacher union or association. Sure the gentleman believes that to be true what purpose does chairman burshit rise parliamentary inquiry. Stature inquiry is it not true that was one of the toughest first bills of any freshman and this representative appreciates him and wants to wish him a happy birthday. What purpose does representative singleton rise. I'm sure the gentleman believes that to be true. All members voted. If so the clerk will lock the machines on the passage of Senate bill 47. What I said earlier today applies to both sides of the on the passage of Senate bill 47 the eyes are 91 the days are 71 this bill having received the requisite constitutional majority is therefore passed. What purpose does representative the minority caucus whip rise make a motion. State your motion. I would like to reconsider Senate bill 47. What is it. Serve notice for a reconsideration for Senate bill 47. We're on the last three days of the session so we'll vote reconsideration now. All right gentlemen is moved that the this House reconsider its action in giving a constitutional majority to Senate bill 47 all those in favor of the gentleman's motion will vote aye those opposed will vote no and the clerk will unlock the machine. All members voted. All members voted. If so the clerk will lock the machines on the gentleman's motion that this House reconsider its action on Senate bill 47 the eyes are 61 the days are 96 this House has failed to reconsider its action in giving constitutional majority to Senate bill 47. Mr. Chairman of the rules committee there was a rumor out earlier and I don't pass along rumors that you wanted to be recognized for an announcement. Yes sir I would like to be recognized for announcement. What's your announcement. Well the announcement is we will not have another rules committee today. We will let you all applaud on that one now. All right Senate bill 213 will be postponed to the next legislative day Senate bill 246 will be postponed to the next legislative day. We will first reading of Senate bills and resolutions the clerk will read Senate bill 300 by Senator Hickman of the fourth be a ton of active and that creating board of commission's retinal county. Senate bill 301 by Senator Dougan in the 30th to be titled back to authorize the city of Carroll's and George. Senate bill 302 by Senator Walker the 20th to be titled back to amend the next bribe for minimum compensation for certain officer. The intracor governmental coordination Senate bill 304 by Senator Kennedy to be entitled to act to create the Peach County Public Facilities Authority. The intracor governmental coordination Senate bill 305 by Senator Berk and the 11th to be entitled to act to provide a homestead exemption from early county school district dad Valoria. The intracor governmental coordination Senate bill 306 by Senator Jones the 10th to be entitled to act to amend the act to provide for a new board of commission's of Henry County. The intracor governmental coordination Senate bill 307 by Senator Walker the 20th to be titled back to create a board of elections and registration for the last candidate. The intracor governmental coordination. The intracor governmental coordination Senate bill 306 by Senator Jones the 10th to be entitled back to amend the next bribe for minimum compensation for certain officer. An diracodied title will be provided. Uh-huh. Um or Lamar Calora. team for winning the GHSA, singing a private and varsity football state championship for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here is known and the resolutions are adopted. We've got a couple of announcements if you signed up for an announcement, be making your way to the front of the chamber if you have an announcement. In the meantime, we have two birthdays today. Let's wish a happy birthday to representative Sherry Gilligan and a happy birthday again to representative Will Wade. On Saturday, March 27th, a happy birthday to representative Jody Lot. Chair recognizes the chairman of the Judiciary Committee, Chairman F. Strachan, for an announcement. Thank you, Mr. Speaker. Members of the House Judiciary Committee, we will have a meeting upon adjournment, room 403, just one bill, room 403 upon adjournment, 403 of the Capitol. Thank you. Chair recognizes the chairman of the Judiciary Non-Sivil Committee, Chairman Bershit, for an announcement. Thank you, Mr. Speaker. Members of the Judiciary Non-Sivil, we have a meeting of the full committee upon adjournment, room 132. Thank you, Mr. Speaker. That completes our announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. A good day. Mr. Speaker, I moved this House stand adjourned until 10 a.m. Monday, March 29th, 2021. The majority leader has moved that this House be adjourned until Monday, March 29th, at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes clearly have it. This House will be adjourned until Monday, March 29th, at 10 a.m. Monday, March 29th, at 10 a.m.",
  "updated_at": "2026-02-14T00:19:10.178104+00:00"
}