{
  "video_id": "NqVPwoQTON4",
  "url": "https://youtu.be/NqVPwoQTON4",
  "title": "Georgia House - Day 8 (2026-01-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": "2026-01-29",
  "duration_minutes": 49,
  "summary": "Here is a summary of the Georgia House session transcript from 2026-01-29:\n\n**Overview**\nThe session featured a scripture reading and prayer by the chaplain, Father Michael Silaway, who spoke about the virtues and example of St. Joseph, the foster father of Jesus. There was no major legislative activity detected in the transcript.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative Dave Belton introduced Father Michael Silaway, the chaplain, and spoke about his own religious background and experiences.\n- Father Silaway gave a sermon focusing on the character and witness of St. Joseph, praising his virtues of patience, integrity, and vulnerability.\n\n**Votes**\nNo recorded votes were mentioned.\n\n**Attendance**\nThe transcript indicates that all members were present and voting to signify their attendance.\n\n**Adjournment**\nThe session adjourned, but the transcript does not provide the exact time or mention the date of the next scheduled session.",
  "transcript": "All members of the House will please report to the floor.\nAll members of this House will please report to the floor of the House.\nThe clerk will ring the bell.\nYou\nWe're about to have the morning roll call.\nAll right, we're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nI have all members voted.\nall members now voted. If so, Mr. Clerk, you may lock the machines.\nWell, good morning. Welcome to Friday. Get away day. So, I hope everyone has a great weekend.\nDoorkeepers will please close the doors and keep them closed. We will begin our day with\nScripture reading in prayer by the chaplain, after which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the\n112th House District, Chairman Dave Belton.\nChairman Belton.\nThank you, Mr. Speaker.\nI was raised a Baptist. My father was a career submarine officer and we moved dozens of times to many different nations.\nIt's been to many different kinds of churches all around the world, but mostly it was Baptist.\nBut soon I grew up and I realized that no self-respecting Baptist girl would have anything to do with me.\nSo I married the only Catholic girl that I knew.\nShe said I was her cross-to-bearer.\nWe Catholics, we love pain and suffering.\nYou know, the whole Lent thing.\nAll y'all get the Mardi Gras and the Fat Tuesday.\nTuesday with Catholics get Ash Wednesday and 40 days of Lent and fasting and\nabstinence. So as a man and a family, I immediately submitted to a she who must\nbe obeyed and I became Catholic. Of course, she didn't tell me about purgatory.\nIt founds out a thousand years of purgatory to look forward to.\nMr. Speaker, that means that you'll see the pearly gates about a millennium\nbefore I will, if I make it, which is very downfall.\nBut it is so worth it being married to my gorgeous Catholic bride because I found in\nthe church a real unity and diversity, this unrivaled on this planet.\nI heard the Pope preach once in the Vatican that Mass took three hours.\nIt took three hours because they did the prayers in all thirty different languages of the\nof the 30 different cultures that were present that day.\nLike my Catholic Church in Green County,\nby the way, they ran me out of all the churches\nin Morgan County.\nI had to go to church in Chairman Trey Rhodes.\nI'm sure appreciate Chairman,\nyou let me go to church there, thank you.\nBut my Catholic Church in Green County is half Hispanic.\nAnd it's probably the thing I most admire about Father Michael\nis not only his fluent Spanish,\nbut his ability to shepherd a flock of richly diverse,\nyet unified believers.\nLadies and gentlemen, my pastor, Father Michael Silaway.\nThank you, Representative Belton.\nThank you, Mr. Speaker, for the honor of being here\nwith you all today.\nI'd like to begin every sermon I preach with\ninviting and invoking the power of the Holy Spirit\nto be with me.\nIt will give me the words to say\nthe way to say them the right way, and that those who hear them may receive what the\nLord wants them to hear.\nSo I'll begin with, come Holy Spirit, fill the hearts of your faithful, and kindle in\nthem the fire of your love, send forth your Spirit, and they shall be created, and you shall\nrenew the face of the earth, amen.\ndistinguished members of the Georgia House of Representatives, it really truly is an honor\nfor me to be with you this morning. To begin this day of discerning and debating and deciding\nwith you in a moment of intentional openness to divine things. And since my theme will be\nbriefly on the virtues of the gospel character of Saint Joseph, the husband of the blessed Virgin Mary\nand the foster father of Jesus Christ,\nto whom God only spoke through dreams,\nif you happen to nod off for even just a moment,\nI will take absolutely no offense,\nbut rather trust that God has invited you\nto a deep personal conversation.\nMy dear friends, the saints are those\nwho we believe are in heaven.\nOur veneration of them is akin to the special reverence\nthat we have for our civic heroes.\nJust as we are rightly moved by the sacrifices\nof our servicemen and women who set aside\ntheir own ambitions and life plans\nto defend and protect what is most sacred to us\nin our state and nation.\nSo we're invited to be moved by those\nwith that exceptional balance of conviction and patience.\nSet aside to faithfully commit themselves\nto the gospel way of life.\nJust as we venerate and hold up for emulation,\nour state's biggest and brightest and bravest,\nthe very best in every age.\nSo to in faith, do we celebrate and seek to mirror\nthose whose virtue was truly heroic\nand whose witness to selfless love\nwas clearly expressed in the way that they lived.\nAnd among such faith heroes,\nSt. Joseph is among the greatest and his witnesses\nof particular benefit and assistance to us today.\nMy boss's boss, Pope Francis,\njust last month proposed to the whole church\nand to the world that we take this new year of 2021\nto find hope and renewal in this most august tradesman.\nAfter the challenge and pain of 2020,\na tattered year held together mostly\nby the hidden sacrifices of selfless individuals\nmade for the protection and betterment of others.\nPope Francis said, each of us can discover in Joseph,\nthe man who goes unnoticed, a daily discreet and hidden\npresence, an intercessor, a support and a guide\nin times of trouble.\nSo with this moment I have with you,\ninvites you to get to know this humble and hardworking foster dad, who the church confidently\nproclaims both to be the mirror of patience and even the terror of demons.\nWhile Scripture never shows Joseph ever speaking, as we know the cliche, actions always speak\nlouder than words, Joseph was a man of such profound integrity, doing the right thing\nespecially when nobody was looking.\nHe didn't abandon his betrothed Mary after she was found to be pregnant with someone else's\nchild.\nAnd he believed the revelation of the angel who presented the true origin of her conception,\nforced to flee his native land because of the dictates of an irate potentate.\nHe bravely faced every danger while protecting his wife and child.\nHe understands how God works through all things, even those things that seem to be the\nmost God forsaken.\nHe's indeed the mirror of patience, because He sees the big picture at all times, knowing\nthat goodness and beauty and truth will prevail in the end.\nHe understands shame and disrespect, being silenced, even in the pain caused by family\nbeing indifferent to his plight as he arrived with his pregnant fiance to his hometown\nand no one even among his relatives would take him in.\nPerhaps though the most significant lesson that this silent servant can teach us through\nthe witness we have of him in his brief presentation in the gospel is his lesson of vulnerability.\nWhile keenly St. Joseph was probably aware of his weakness, think about it, knowing that\nhis wife was the sinless chosen handmade of the Lord, and that the child over whom he\npledged his fatherhood was to be a manual, the God with us.\nHis imperfections were the only ones in the house, but he knew that when he became aware\nof his weaknesses and yielded not to them but to the one who heals, that is where\ngreat grace flows.\nHow holy this made St. Joseph, what a powerful lesson he gives to us, to yield before the\none whose power is made perfect in weakness, says St. Paul.\nMy dear brothers and sisters in the church built over the supposed home of St. Joseph\nin his workshop in Nazareth.\nThere's a statue of this venerable tradesman as he has one arm protecting the child Jesus\nand in his other arm, a scroll that simply says,\nEte Ad Yosef, go to Joseph.\nI want to encourage you when you have a moment of your own\nto reflect on the gospels, to look at the events\nof our Lord's coming through the eyes of His foster dad.\nThis mirror of patience, this one because of His fidelity\nwas the terror of demons.\nI invite you now to please stand as we close in prayer.\nO mighty God, we praise you for another day.\nWe thank you for surrounding us with so great a cloud of witnesses who show us how to\nlove as you love these heroes of virtue.\nRain down upon this chamber and these halls your spirit of wisdom in understanding.\nInspire within the hearts of these civil servants an undying devotion to the truth.\nwith them the graces they need as they pursue the common good on behalf of us all.\nMay they be faithful representatives of your people.\nConsol and strengthen them to make these hidden sacrifices out of love to lead our beloved\nstate. May the example and witness of St. Joseph spur them on through this legislative day\nand indeed through the rest of their lives, amen.\nfor the pledge. I pledge allegiance to the flag of the United States of America and to the\nRepublic for which it stands, one nation under God, indivisible, with liberty and justice for all.\nThank you, Speaker. Doorkeepers will please unlock the doors.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information\nand audits. Thank you, Mr. Speaker. Your Committee on Information and\nAudits has read the journal of the previous legislative day and found it to\nbe correct. And furthermore, Mr. Speaker, this is from Woody Woodside. No\nmatter how educated, talented, rich or cool you believe you are, how you treat\npeople ultimately tells all. Thank you. Well said. Chairman Hogan, the chair of\nof the Committee on Information and Audits reports\nthat the journal, the previous legislative day,\nhas been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's none, and the journal is confirmed.\nThe clerk will read the resolution\nestablishing the order of business for the day.\nMr. Burns, under 59, this filing\nbe established as the order of business\nthat are the first part of the period,\nunanimous consents, introduction of bills and resolutions,\nFirst reading and reference of House bills and resolutions.\nSecond reading of bills and resolutions.\nReports of standing committees.\nMorning orders.\nIs there any objection to the adoption of the resolution\nestablishing the order of business for the day?\nThe chair here is none in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 1 by Robson to bottom of the 72nd air heart of the 36 Jones to the 25th Williams to the 145th\ncolor of the 19th and others will be taught on an act to amend chapter 1 and title 20 the physical to Georgia annotated relating to education generally\nHigher education House Bill 156 by ribs and a Parsons to the 44th Martin of the 49th Kelly the 16 Smith of the 133rd and next to the 69th\nBill Bitton and act to amend titles 38 and 50.\nThe official go to Georgia annotated relating the military, emergency management, and veteran affairs.\nEnergy, utilities, and telecommunications.\nHouse Bill 157, erosion of Irwin of the 28th and Anderson of the 10th.\nBill Bitton and act to provide a new charter for the town of Mount Erie.\nIntergovernmental coordination.\nHouse Bill 158, erosion of Crow of the 110th Gamble of the 15th,\ntotal of the 26th and Williams, the 145th,\nthey'll be titled to amend Article 1 of Chapter 7\nof Title 52, the fish go to Georgia annotated,\nrelating the general provisions\nrelative to registration, operation,\nand sale of watercraft.\nGame, fish, and parks.\nHouse Bill 159, my resident Parsons,\nthe 44th Martin of the 49th,\nKelly the 16th, Smith and 133rd, next to 69th.\nThey'll be titled to amend Title 33,\nthe official go to Georgia annotated,\nrelating the military, emergency management,\nand better in affairs.\nEnergy utilities and telecommunications.\nHospital 160 by ropes and a boaty,\nthe 62nd drier of the 59th,\nScofield the 60th,\nbuilding tunnel and act to Menark,\nfour chapter eight, a total 48.\nThe fish go to Georgia,\nannotated, relating to water and sewer projects.\nWays and Mains.\nHospital 161 by ropes and a taxi,\nthe 160th, Dickey, the 140th,\nFleming and the 121st,\nRich of the 97th and Houston of the 170th,\nBill B. Todd on active men chapter 42,\na total 36 of the official go to Georgia,\nand I tell you relating the downtown development authorities.\nGovernmental affairs.\nHouse Bill 162,\nCongress of the Belt and the 112th.\nBill B. Todd on active men,\nthe act to create a board of elections\nand registration for Morgan County.\nThe answer, governmental coordination.\nHouse Bill 163,\nCongress of Cooper,\nthe 43rd gains a lot of 17th,\nemceing the 13th,\nfire of the 118th,\nand loves to do the 12th.\nBill B. Title NACTIMENT, article 7, chapter 4,\nof Title 49 in the fish go to Georgia,\nand attend to relating the medical assistance generally.\nHealth and Human Services, House Bill 164,\nby represent of Douglas, the 78th Cooper, the 43rd,\nFriday, the 118th Stevens, the 164th,\nand Evans, the 57th, Bill B. Title NACTIMENT,\nchapter 24, Title 33, the fish go to Georgia,\nand attend to relating the insurance generally.\nSpecial committee on access to quality health care.\nHouse Bill 165 by Rose, at a bar of the 130th, Hedges, on and 61st.\nClark on the 147th, Minks on the 178th, and Lomston to the 12th and others.\nHe'll be titled an act to amend part four of Article I and Chapter 8 of Title 40.\nThe official go to Georgia annotated, relating to horns, exhaust systems, and mirrors.\nMotor vehicles.\nHouse Bill 166 by Representative Ayerhardt of the 36th.\nBill B. Tonne, an act of men article two, chapter 19 of Title 15, the Fiscal of Georgia\nAnnotated Relating the State Bar of Georgia.\nBudget and Fiscal Affairs Oversight.\nHouse Bill 167 by reps of Davis, the 87th McLeod of the 105th Scott of the 76th.\nScofield of the 60th Bernal of the 77th and others.\nBill B. Tonne, an act of men, Title 50 of the Fiscal of Georgia Annotated Relating\nthe State Government.\nGovernmental affairs House bill 168 by ropes of Petrie the 166th even 164th Williamson in the 115 Fleming 121st Clark the 147th and others\nBuilding town on an act to amend a code section 42 536 the fish go to Georgia annotated relating to confidentially information\nJudiciary non-civil House bill 169 or represent a Corbett of the 174th Ridley the 6th\nMount Island on the 17th perk with 155th and lots of the 172nd.\nBill B. Todd on act to men code section 45, 147 of the fish go to Georgia annotated relating\nthe requirements for issuance of commercial driver's license.\nMotor vehicles.\nHouse bill 170 by represent a park of the 101st, runner of the 85th, Mitchell 106th, Clark\nof the 108th and fry the 118th and others.\nBill B. Todd on act to men article 2, chapter 7, title 48 of the fish go to Georgia annotated\nrelating the imposition rate computation of income taxes.\nWays and Means.\n7171 by refs at a park of 101st.\nBetley the 139th.\nEugly the 136th.\nRoba show the 48th.\nFry the 118th and others.\nBill B. Todd, an act of men.\nArticle 2, chapter 7.\nTodd, a 48th.\nA physical to charge annotated.\nRelated income tax imposition.\nRate computation and exemptions.\nWays and Means.\n7172 by refs at a ticket.\nThe 140th in Washburn in 141st.\nBill Bitton and act to amend and act in corporating the city in Cullidon and the county of Monroe.\nIntergovernmental coordination. House bills 173,\nCongressman Benton, the 31st work highest of 157 Stevens on the 64th.\nMcDonald, the 26th, the wheat hour, the 119th.\nBill Bitton and act to amend Code Section 4720, 87.\nThe fish go to Georgia, annotated relating to eligible large retirement systems.\nRetirement.\nCouncilman 174 by refs on a wheat hour 119th gains on 17th Smith the 18th crow the 110th\nlever into the 33rd and others will be taught on act to amend code section 41 eight of the\nfish Dakota George annotated relating the safe operations and motor carriers motor vehicles\nCouncilman 175 by refs and boating the 62nd Jackson 64th McClaren of the 51st gofield\nwith the 60th Ben of the 94th and others.\nBill B. Todd and Acta Men,\nan article two, chapter five,\na title 16,\nthe Fiscal of Georgia,\nAnitator relating to salt and battery.\nJudiciary non-sevel.\nHouse Bill 176,\nby the Reps of Puckner,\nthe 137th Allem of the 82nd Clark,\nthe 100th and 8th Williams of the 37th.\nAllem of the 40th and others.\nBill B. Todd and Acta Men,\npart one of Article two,\nchapter eight and title 12.\nThe Fiscal of Georgia,\nAnitator relating to general provisions,\nof solid waste management. Natural resources and environment. House Bill 177 by\nRepresentative Bonner, the 72nd Jones, the 47th Reeds, the 34th Riches, the 97th,\na lot of the 122nd and others. The title of the act to amend chapter one in\ntitle 51, the official go to George annotated relating the general provisions\nregarding torts. Judiciary House Bill 178 by Representative Bonner, the 72nd\nof Allinger, the 23rd Jones to the 47th,\nGaines to the 117th, pays more to the 63rd and others.\nThey'll be tied on act to amend chapter 12,\nbut tied on 19th, fiscal to Georgia and intended,\nrelating the name change to provide\nthat victims of human trafficking may petition.\nJanissary.\nHouse of 179, members of camp on 131st,\nRichard 97th, bird to the 20th,\nhomes of the 129th,\nMatthew Yak with 73rd and others.\nThey'll be tied on act to amend code section 40 to 86.\nthe fish go to Georgia annotated related special license plates motor vehicles house for 180\nbar graphs under limb of the 99th manor of the 56 Lopez of the 86 Thomas of the 65th\nwill be taught on act to men chapter one title 50 the fish go to Georgia annotated\nrelated general visions of state government governmental affairs house for 181 bar graphs\nof limb of the 99th park of the 101st manor of the 56 Thomas of the 65th and fry of the\n18th building Todd and active men chapter one and title 34 the fish go to\nGeorgia annotated relating to general provisions of labor and industrial\nrelations industry and labor house bill 182 barbers and a limb of the 99th\nLopez in the 86 Maynard 56 and Thomas the 65th building Todd and active men\nchapter 7 and title 50 the fish go to Georgia annotated relating to the\nDepartment of Economic Development Economic Development Intourism House of\nThe 183 programs that have limited the 99th Maynard,\nthe 56th and Thomas, the 65th.\nThey'll be taught on act to men.\nPart two of Article 15 to chapter one.\nA title 10 of the physical to Georgia and attended\nrelating to the Fair Businesses Practices Act.\nJudiciary.\nThat's for 184 by residents of Limitless,\n99th Maynard, the 56th and Thomas, the 65th.\nThey'll be taught on act to amend code section 10,\none, 393, the physical to Georgia and annotated\nrelating unfair or deceptive practices.\nAgriculture and consumer affairs.\nHouse bill 185% of Lim of the 99th and Mainer of the 56th.\nBill B. Todd and Active Men, part four of ARCA.\nI want to chapter 8 of Title 40.\nThe fish go to Georgia, Antidio Related and Horns,\nExhaust Systems and Marars.\nMotor vehicles.\nHouse bill 186 by Representative Lim of the 99th,\nMainer of the 56th.\nLopez of the 86th and Thomas of the 65th.\nBill B. Todd and Active Men, chapter 66.\nin Title 36, the official go to Georgia and intended relating\nto zoning procedures.\nGovernmental affairs.\nHousema 187, Representative Lim of the 99th Maynard,\nthe 56th and Thomas of the 65th.\nBill B. Todd on Act to amend chapter eight in Title 36,\nthe official go to Georgia and intended,\nrelating to gentle provisions applicable to counties.\nGovernmental affairs.\nHouse Bill 188, part of the Senate of Lim of the 99th Maynard,\nthe 56th, one of the 89th.\nThomas of the 65th.\nBill B. Todd on Act to amend Code Section 55.\n132 the official go to Georgia annotated relating eligibility and procedures for certification\ngovernmental affairs house bill 189 our resident Wilson the 80th Beverly the 143rd\nHugley the 136th been in the 94th heavens the 57th and others will be taught on active men chapter one\nin total 2080 physical to Georgia annotated relating the general provisions regarding the general\nassembly legislative and congressional reapportionment house bill 190 members and a whole\nwill come in the 81st, Paris the 142nd,\nCanada the 102nd, Mitchell the 106th,\nHugley the 136th and others.\nThey'll be tied on active in title 42,\nthe physical to George annotated,\nrelating the penal institutions.\nPublic safety and homeland security.\nAlso 191 by Brooks and a patent of the 31st,\nPaul the 32nd, Svirey on 35th, Green in the 151st,\nParis the 158th and others.\nThey'll be tied on active in chapter 7 and title 47.\nthe Fiscal and Georgia Annotated Related General, Georgia\nLegislative Retirement System.\nRetirement House Bill 192 by Rose.\nI abstain to the 180th, the perchette of the 176th,\nfrustration of the 104th, and Hitchens 161st.\nThere'll be Todd on active men, Code Section 167, 29th,\nArticle 2 of Chapter 6, Title 5, and Article 1 of Chapter 3\nof Title 35 of the Fiscal to Georgia Annotated relating\nan interference with electronic monitoring devices.\nJudiciary non-sevel.\nHouse bill 193 by groups of saints,\nthe 180th of the Perchetta, the 176th,\nabstraction 104th in Hitchens, the 161st.\nBill B. Todd and Acto men chapter 24,\ntitle 15, the fish go to Georgia, annotated,\nrelating to sexual assault protocol.\nJudiciary non-sevel.\nHouse bill 194 by groups of saints,\nthe 180th of the Perchetta, the 176th.\nAbstration 104th in Hitchens, the 161st.\nBill B. Todd and Acto men, article 1 of chapter 10,\nTitle 17, the fiscal to Georgia annotated a relay in the\nprocedure for sentencing and imposition of punishment.\nJudiciary non-civil.\nHouse Resolution 52 by President Dempsey,\nthe 13th Gamble of 15th, Oliver the 82nd Cooper,\nthe 43rd, and parish of 158th Resolution creating\nthe Joint Study Committee on Childhood Lead Exposure.\nHealth and Human Services.\nHouse Resolution 53 by Representative Scofield,\nthe 16th Scott of the 76th,\nDavis to the 87, McLeod of the 105th, Hutchinson the 100th and 7th and others, Resolution\nurging Congress to place moratorium on the three main credit reporting bureaus.\nAgriculture and consumer affairs, House Resolution 54 of our reps and administration\non 104th, Resolution honoring the life of Mayor Jimmy Wilbanks and dedicating the road\nand his memory.\nTransportation, House Resolution 55 of our reps and the Wilson of the 80th, Hugley the\n136, bed of the 94th Evans, the 57th Roberts, the 52nd and others.\nThe resolution for prositing amendment to the Constitution\nshows to provide that legislative and congressional reapportionment\nbe done by independent nonpartisan commission.\nLegislative and congressional reapportionment.\nHouse Resolution 56 by reps of single 10 to the 71st,\nApollo 32nd, Hogan of the 179th,\nTarvern of the 2nd, Cantrell of the 22nd and others.\nresolution, a resolution proposing an amendment to the Constitution of the State of Georgia\nshows a clarify that only citizens of the United States shall have the right to vote.\nSpecial Committee on Election Integrity, that completes First Readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 130 by Representative Gallaud of the 19th\nSains of the 180th, Williams of the 145th,\ngravely of the 67th, the Montpain of the 17th.\nA bill relating to general provisions applicable\nto counties and municipal corporations.\nHouse Bill 131 by Representative Maynard,\nthe 56th, pays more of the 63rd, Thomas of the 39th.\nLim of the 99th, the Roberts of the 52nd,\na bill relating to stalking.\nHouse Bill 132 by Representative Maynard,\nthe 56th, dukes of the 154th,\nScott of the 76th.\nLim of the 99th, Roberts of the 52nd,\na bill relating to elections and primaries.\nYou see me right there.\nHouse Bill 133 by Bremson, main air of the 56th dukes of the 154th Bayesmore, the 63rd\nScott of the 76th Thomas of the 39th and others, Bill relating to crime victims of Bill\nof Rights, House Bill 134 by Bremson, Anderson of the 10th, Jones of the 47th, Jones of the\n25th, Dubnick of the 29th, Hawkins of the 27th, the Bill relating to open and public meetings,\nHouse Bill 135 by Bremson, Williams of the 145th, Mathis of the 144th, McDonald of the\n26th, Powell of the 32nd, Collins of the 68th, the Bill relating to death certificates,\nHouse Bill 136 by episode 111 of the 12th,\nscogons of the 14th,\nthe frustration of 104th,\nthumbing of the 121st,\nTaylor of the 173rd,\na bill relating to primaries and elections.\nHouse Bill 137 by reps those,\nscogons of the 14th,\nKelly of the 16th,\nGamble of the 15th,\nSmith of the 18th,\nand Lums of the 12th,\na bill relating to income taxes.\nHouse Bill 138 by reps,\nand Maynard of the 56th,\nMallow of the 163rd,\nThomas of the 65th,\na bill relating to landlord and tenant.\nHouse Bill 139 by reps,\nand Maynard of the 56th,\ndukes of the 154th,\nMcLean of the 100th,\nMallow of the 163rd Thomas of the 65th,\na bill relating to regulation of maintenance\nand use of public roads and railroads\nand the operation of trains and crossings,\nHouse Bill 140 by Reptibody of the 62nd,\nKendrick of the 93rd Williams of the 168th,\nMallow of the 163rd and Frazier of the 126th,\na bill relating to change of venue.\nHouse Bill 141 by Reptibody of the 117th,\nturns of the 47th,\nwe now are 119 degrees of the 34th,\nthe workies are of the 157th,\na bill relating to victim compensation.\nHouse Bill 142 by Reptibody of the 4th,\nThe bill relating to imposition rate computation and exemptions from state income taxes.\nHouse bill 143 by reference about the 60 second more than 95th clerk of the 108th Evans of the 83rd Couch of the 50th and others.\nThe bill relating to general provisions regarding district attorneys House bill 144 by reference and clerk of the 147th Smire of the 135th Williams of the 168th\n68th, the second, Kitchens of the 161st and others have been relating to imposition rate computation and exemptions from state income tax house bill 145\nby representability of the 62nd Thomas of the 65th Hutchinson in 107th,\nPark of the 108th, dry of the 159th, and others have been relating to authorization of a rescue to deadly force adoption, or\npublication of conflicting regulations, policies, ordinance, resolutions, and authority of nuclear power, facility security officer.\nHouse Bill 146, by reference to the gains of the 117th Cooper of the 43rd, Jones of the 47th,\nwe dour the 119th, which is the 97th and others available relating to general provisions regarding\npersonnel and registration, House Bill 147, by reference of Clark of the 147th, Jasper's\nof the 11th Blames and 115th, Washington of the 111st, Martin of the 49th and others,\nthe bill relating to general provisions of professions and businesses, House Bill 148, by reference\nof Scofield of the 60th Bernal of the 77th, Scott of the 76th, Douglas of the 78th, Bayes\nmore than sixty-third of bill relating to development authorities, directors, officers,\ncompensation, adoption of by-laws, delegation of powers and duties, conflict of interest\nand audits, House Bill 149 by Reptile Williams in the 115th Carson of the 46th night of the\n130th Blackmen of the 146th Petrie of the 166th Bill relating to income taxes, House Bill\n150 by Reptile Williams in the 115th hatches of the 150th Kelly of the 16th Fraser of the\n126th Carson of the 44th and others of bill relating to public utilities and public transportation,\nHouse Bill 151 by Representative Bernal of the 77th Neal of the 74th phase, more of the 63rd.\nScott of the 76th, a bill relating to property tax exemptions.\nHouse Bill 152 by Representative with hour of the 119th, gains of the 117th,\nCrow of the 100th, and 10th, part of the 5th Anderson of the 10th and\nothers, the bill relating to non-public, post-secondary, educational institutions.\nHouse Bill 153 by Representative with hour of the 119th, gains of the 117th,\nCrow of the 110th, part of the 5th Anderson of the 10th and others,\nBill relating to the Fair Businesses Practices Act of 1975.\nHouse Bill 154 by reps of reach of the 34th\nillustration of the 104th Oliver of the 82nd\nRichard the 97th, but now of the 119th and others\nof Bill relating to domestic relations.\nHouse Bill 155 by reps of Thomas of the 39th\nbody of the 62nd Canon of the 58th,\nScott of the 70th Sakes, Kendrick of the 93rd and others.\nBill relating to education.\nHouse Resolution 39 by reps of camp of the 131st,\nGamble of the 15th and who of the 30th,\nMathiaque of the 73rd, Clark of the 147th and others, a resolution requesting that the United States Congress call a convention under Article 5 of the Constitution of the United States.\nThree second readers.\nReports of standing committees, the clerk will read.\nRepresentative Matheac on the 73rd District Chairman of Committee on State Planning and Community Affairs submitted the following report.\nMr. Speaker, your committee on State Planning and Community Affairs is in consideration the following bill of the House.\nThis is struck to meet the report the same back to the House with the following recommendations.\nHouse Bill 44, due pass.\nRespectfully submitted, Representative Matheac on the 73rd District Chairman.\nThat completes the reports of standing committees.\nWe are going on now to morning orders.\nWe're going on to morning orders and the chair is going to ask that members please take\nyour seats. Remember the advice that I've dispensed from up here for a lot of years.\nTreat the member in the well as you would want to be treated if you were in the well.\nA really complex thing. All right. Chair recognizes for a morning order.\nChairman Matt Dubnik.\nThank you, Mr. Speaker.\nLadies and gentlemen, I unfortunately\nbring side news of a very tragic event\nthat occurred yesterday morning in my district around 10\no'clock when we were convening.\nThere were hundreds of hardworking\nGeorgians that went to work at foundation food groups,\nManufacturing facility in Gainesville and, unfortunately,\na liquid nitrogen line erupted.\nIt resulted in five deaths on the scene of six\nthat the hospital.\nThere are three that are still in the hospital\nin critical condition.\nThree firefighters treated and released one\nthat a fourth that is still there at the hospital.\nAnd we hope is going to be released this morning.\nBut I do want to, in light of the tragedy,\nalso pause and give such tremendous praise to Hall County Sheriff's Office, Hall County\nFire Department, Gainesville Police Department, and Gainesville Fire Department. As many of\nyou know, Gainesville and Hall County's been hit so incredibly hard by COVID, and we're\nstill in the middle of that. But within half an hour, Northeast Georgia Health System\nstood up a remote triage facility. It treated over 130 workers from that facility in conjunction\nwith free chapel worship center there on their campus so a very sad day and in\nGainesville and Hall County and I hope you would join me in a moment of silence\njust to remember those lives that were lost. Thank you Mr. Speaker. Chair\nrecognizes representative Robus Show for a morning order.\nThank you, Mr. Speaker. It said that there's a special\nbottom between fathers and daughters, and I know that's true.\nMy father Walter Guillot, and you only thought the name you had a problem with, was Robus\nshow, passed away last Friday peacefully at my home, where we were honored to support\nhim for the last six years of his life. He died at the age of 95. I want to thank everyone\nfor all of the kind thoughts and words. Daddy was an amazing man. He worked for the\nsame company for 60 years and then started his own companies at the age of 80. Daddy\nHe was 16 when he heard about the bombing at Pearl Harbor and his brothers were out in\nthe sugar cane fields cutting sugar cane.\nHe and his three brothers, all of them older, daddy was the baby, all went to enlist that\nday, the next day, sorry, because it was a Sunday that they heard.\nMy dad was rejected because he was actually born blind in his left eye.\nBut he didn't give up.\nHis three brothers did enlist in various areas of the service and served throughout World\nWar II and also one of my uncles served his entire career.\nBut Daddy didn't give up.\nHe went back to the age of 17 but was rejected again because he was still blind in the eye.\nWhen he turned 18 though he had finally figured out the system and he actually cheated on\nhis eye exam.\nAnd yes from that I know of this is the only time in his life that he ever cheated\nat anything.\nHe served in the Navy during World War II in the Pacific Theater, where he was the machinist\nfirst class from 1944 to 1946, on the USS LSM 340.\nHe was part of the Philippine Liberation Force and the Japanese invasion force.\nSixteen million Americans served during World War II, and this week another member of\nthe greatest generation went to a final resting place.\nThere are only two percent of these Americans left with us, and I have been blessed to learn\nhis stories and to be able to pass them on to future generations.\nHis family and friends were a vital part of his life.\nRemember my dad was the youngest of eight children, and he enjoyed gatherings where good\nfood and great conversations were the main event because we are from Louisiana.\nEvery summer he would take all of us in the family station wagon, and we would take weeks\nlong cross-country trips, which were created amazing memories for all of us seven children.\nFew things gave him more pleasure than sharing a hamper of boiled crabs with family and\nfriends at Supermore Point.\nDaddy taught me to treat everyone with respect and to always give back to make life better\nfor those around you.\nTo stand up not only for yourself, but for others who may not have a voice.\nAnd again, remember, you had to do that when you were one of seven kids.\nI will always be daddy's girl and try to live up to his vision.\nThank you, Mr. Speaker.\nChair recognizes Chairman Dempsey for a morning order. I think she's going to be\njoined by Chairman Lumsden and Representative Scottkins.\nGood morning. Thank you, Mr. Speaker. Last night we spoke to a group in\nand we actually tried to explain the feelings\nof being in the house right now.\nHow every morning begins with painful loss and reflection\nof life that we each care about\nand then have touched each of ours.\nI ask you today to help me recognize someone\nwho we lost in our hometown.\nThose lives that we're celebrating have been touched\nby the loss of COVID, by natural causes,\nBy tragic impacts also of the tragic situations\nthat we face as we all try to journey through COVID\nand the isolation that is felt.\nYesterday morning, we lost a great saying in Rome.\nHer name is Dorothy Jordan.\nI had the privilege of working with her a lot.\nShe is the wife of former Chief Justice Norman Fletcher.\nI said Jordan, it was Jordan Fletcher.\nI'm so sorry.\nDorothy Fletcher.\nShe lost her battle to COVID after weeks in the hospital.\nWe all know people that are fighting today.\nWe all know people that our hearts are heavy for.\nAnd I just ask you right now, to be in prayer,\nto pause a moment for Chief Justice Fletcher,\nfor his family, for his children and grandchildren,\nand for the saint, another saint that is making her way to heaven.\nThank you.\nThank you, Mr. Speaker.\nChair recognizes Representative Carpenter\nfor a morning order.\nThank you, Speaker.\nI come today infuriated by the actions of my local GOP\nand one lobbyist with a weird mustache.\nIt is not an absurd idea to allow a DACA student\nto pay a taxpayer rate for college\nwhen in fact they are or will be taxpayers.\nThe federal government needs to get their act together,\nsecure the borders, and streamline the immigration process.\nEveryone in this room can trace their heritage\nto an immigrant.\nPraise God until the 1920s, America had a show up\nimmigration policy, or a huge majority of us in this room\nwould not be here today.\nFurthermore, the immigration policies of ancient Egypt\nallowed Joseph and his family to survive a famine.\nJesus Christ, to escape the wrath of Herod, our Republican Party has always been about\nfairness and opportunities, and it's high time that we extend these opportunities to\nthese tax paying individuals who have been in Georgia since 2013 or longer through no\nfault of their own.\nMove just across the speaker.\nChair recognizes representative Eric Allen for a morning order.\nThank you, Mr. Speaker.\nGood morning, everyone.\nOne of the communities that have been impacted\nvery heavily during the current pandemic\nare those that are suffering from substance use disorders.\nSince March of last year, substance use has been up\nas much as 30%.\nAnd we cannot turn our eyes away from this situation\nor this issue, but there is hope\nbecause of the strong recovery community here in Georgia.\nAnd the support that this body gives\nto that recovery community.\nNext Tuesday, February 2nd is gonna be\nannual recovery in addiction day and although it will be virtual this year, it is more important\nthan ever that we continue to support Georgians in recovery. So let's remove the stigma and\nencourage those that we know who are suffering from or dealing with substance use to seek the\nsupport they need and to inform them that recovery is an option and recovery is real. So thank you\nThank you, Mr. Speaker, I oath well.\nThe clerk will read the caption to a group of privileged resolutions.\nRecognizing in commending, Captain Andrea Hall, recognizing together Georgia, honoring\ncommending the firefighters of Georgia and recognizing February 2, 2021 as firefighter\nrecognition day at the State Capitol, commending the Red Cross in recognizing March 2021 as Red Cross\nMonth in Georgia, recognizing and commending the Health for Humanity, Yohgothan on January 16 through\n31st 2021, commending and congratulating Zelda Small Miller, honoring the life and memory of Patrick\nand for all the purposes that completes the reading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none in the resolutions are adopted.\nIf you have signed up for an announcement, please make your way to the front of the chamber\nnow.\nWe're about to do announcements.\nIf you have signed up, I want you to help me wish a happy birthday to the Chair of the\nGovernmental Affairs Committee, Chairman Darling Taylor, happy birthday, Chairman Taylor.\nThey recognize his representative, Holland, for an announcement.\nDo you do you have an announcement you know sometimes there is a reason that I ask you\nto pay attention and be orderly and be quiet so that maybe you hear your name\ncalled or something like that. I'm getting too soft and weak in my latter\nfor 12-year representative Williams.\nApologies, Mr. Speaker. The commute is long from the gallery. For the City of Atlanta delegation, just a reminder, we have a meeting via Zoom today at 11.45. Thank you.\nThat completes our announcements, completes our business and work for the week.\nChair wants to wish all of you a very happy weekend, but above all, stay well.\nChair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker. Mr. Speaker, I'd move that this House\nStand adjourned until 10 a.m. Monday, February the 1st, 2021.\nThe majority leader has moved that this has to be adjourned until Monday, February 1 at 10 o'clock a.m.\nAll those in favor of the motion will say aye.\nThose opposed to say no, the eyes have it, this house will be adjourned until Monday at 10 a.m.\n",
  "updated_at": "2026-02-12T16:05:23.711978+00:00"
}