{
  "video_id": "NSYSUjGwCtE",
  "url": "https://www.youtube.com/watch?v=NSYSUjGwCtE",
  "title": "1/24/2024 Senate Committee on Rules",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Rules session on 1/24/2024:\n\n## Overview\nThis session focused on a mix of bills and resolutions, including a notable bill to define antisemitism in Georgia law. The committee advanced several measures for floor consideration the next day.\n\n## Key Actions\n**HB 30**: Provides a definition of antisemitism in Georgia law\n**SB 353**: A Department of Revenue bill that was previously passed and vetoed, now cleaned up and passed out of committee unanimously\n**SR 443**: Appointment of Rick Jeffries to the state election board\n\n## Bills Introduced (First Reading)\nNone mentioned\n\n## Notable Moments\n- Opening prayer led by the committee chair\n- Discussions around senators not being present to speak to their own bills\n- Praise for the committee clerk's note-taking abilities\n\n## Votes\n- **HB 30, SB 353, SR 443, SR 158**: Passed unanimously\n\n## Attendance\nA quorum was present, though some senators were noted as not being in attendance for their own bills.\n\n## Adjournment\nThe meeting was adjourned after the votes. The next session was not specified.",
  "transcript": "Thank you for joining us here today, thank you for joining us here today, thank you\nThank you for joining us here today on Wednesday, January 24, 2024 in the year of our Lord.\nAnodominant.\nIt's for our E-latin speakers.\nPrimer Sadies.\nYou probably speak Latin too, don't you?\nWhatever you do.\nYou do now.\nA little bit.\nYeah.\nYou speak Latin now.\nI just dubbed it.\nOkay.\nI tell you what, let's start off with a prayer today.\nHe looks like a good prayer in man or woman.\nMadam Leader, you want to leave some prayer today?\nOh, center house teller, ladies and prayer please.\nLet us all pray.\nDear Heavenly Father, we thank you for this day that you've given us.\nWe know you have been good to us in so many ways and we ask for your wisdom and you're\nleading us to the past that we should be on and all that we do that we could honor you today.\nWe thank you for all that you provided and asked that you could continue to provide us with the ability to do the best we can.\nWe ask this in your name. Amen.\nThank you for that, Chairman.\nAll right, first on the docket, we've got SB 348 Senator Williams.\nIs he here? Rick Williams?\nNot here\nAll right, so dollars all we're\nAll right, so nobody's bills gonna get picked if you're not here. So they're out of a S. R. One five eight\nSame bill presented yesterday this basically just designated it was just X corridor in West Northwest Georgia\nAny questions\nAll right, we've got S-R-4-4-3, Senator Kennedy.\nYou'll cover that one.\nYes, Mr. Chairman. Good morning, everybody.\nThis is the appointment for Rick Jeffries to the state election board.\nI spoke to this the other day. Most everyone probably in the room.\nNot just those of us on the committee. No Rick. He's a good businessman.\na good person served in the Senate for a number of years and it is the choice of\nrecommendation that he serve on the state election board. Any questions? If you\nall aren't talking about Rick Jeffries then I'm gonna need you to stop. Okay. I\nfigured you were. I'm just gonna make sure. All right good job. All right. Senator\nDolezal, you want to cover SB 353?\nThank you, Mr. Evans.\nWell, G. Department Bill, we actually passed this bill.\nAbout 95% of the form that it is currently in last year\nis vetoed due to a change that we actually\nmay on the Senate floor, and that's been cleaned up\nand passed out of committee unanimously.\nAny questions?\nOkay.\nWe're hoping to wait for Senator or representative Carson,\ndon't you snuck in on me all right well once you come up to the podium for some\ncover HB 30 absolutely we were patiently awaiting your arrival I know you were\nI apologize for my delay you beat us actually I had blooms were going to be\ncoming out of the ceiling, but is that right before we get them prepared?\nVery good. Yes, chairman members of the committee, this is House Bill 30, the\nanti-semitism bill to provide and to title 50 for the first time a definition for\nanti-semitism to help us identify it for the purposes of judges and\nprosecutors to determine not for any violation of first amendment rights but in\nregard to the criminal or discriminatory intent against our friends in the\nJewish community. This is a I would argue a much needed bill two years ago in\nlast year but especially in light of recent events both national and local.\nand that's all it does is provide a definition of any\nstigmatism into the Georgia code any questions from the\ncommittee all right good job thank you sir\nall right sir Williams is not here to cover SB 348 so\nSenator parent did you have anything here hanging out we're glad to have\nyou glad to have you all right well let's pick a few SB 348 is not available\nso we're gonna pick three of these four remaining all right so Senator\nThank you, Mr. Kennedy.\nPresident Protein.\nThank you.\nMr. Chairman, I would be very honored to pick House Bill 30\nto be on the floor for tomorrow, Thursday.\nAll right.\nGot House Bill 30.\nAll right, let's go with my secretary.\nHe just takes such good notes.\nI feel like I need to reward him with a pick.\nI know you are.\nThank you so much for giving me an opportunity.\nI will select Senate Resolution 443 from old friend, Rick Jeffries.\n443. Good choice, good choice. All right, let's go one more.\nSenator Harbson not here. Senator Jones, you see anything on there you won't.\nYes, Mr. Chair. What number are you?\nThat's our 158.\nThat's our 158. Good pick.\nAll right.\nI think that'll do it for tomorrow.\nWe have.\nExcuse me.\nThat's our 158.\nThat's our 443.\nHB 3Z rail.\nI got a motion from a vice chairman.\nI got a second from the President of Poutine, any further discussion?\nAll in favor, say aye.\nAll opposed, same sign.\nMotion passed as unanimous.\nWe'll be on the floor tomorrow, meeting adjourned.\n",
  "updated_at": "2026-02-12T19:58:02.019405+00:00"
}