{
  "video_id": "nvBPujx4ljQ",
  "url": "https://youtu.be/nvBPujx4ljQ?t=2654",
  "title": "Georgia House - Day 10 (2026-02-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-02-02",
  "duration_minutes": 132,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThe transcript does not contain any substantive legislative actions or debates. Instead, it describes the opening procedures of the session, including the prayer, Pledge of Allegiance, and a speech by a guest chaplain.\n\n**Key Actions**\nNo bills were passed, referred, or introduced.\n\n**Notable Moments**\n- The guest chaplain, Pastor Mark Pritchett, gave a speech reflecting on the importance of one's \"why\" or purpose in life, using the example of the Wright brothers vs. Samuel Langley in the pursuit of powered flight.\n- The chaplain discussed his own journey from serving in the military to becoming a pastor, emphasizing the role of faith and freedom.\n\n**Attendance**\nThe transcript indicates that all members were present and reported to the floor, with the doorkeepers closing the doors after the morning roll call.\n\n**Adjournment**\nThe transcript does not provide information on when the session adjourned or the date of the next session.",
  "transcript": "I'm going to make a little bit of a hole in the middle of the hole. I'm going to make a hole in the middle of the hole. I'm going to make a hole in the middle of the hole. I'm going to make a hole in the middle of the hole. I'm going to make a hole in the middle of the hole. I'm going to make a hole around the hole.\n\nThey are convening having arrived all members. Will please report to the floor of the house and take your seats. All members. Will please report to your seats on the floor of the house. Mr. Clark, would you ring the bell please? We are about to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning everyone. We are now, after today, we will be one-fourth of the way through. You got to celebrate small victory sometimes. We will begin our day today with Scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 131st House District Representative Beth Camp. Good morning. Thank you, Mr. Speaker and members of the house. It's a pleasure to be here with you today. And my honor to introduce Pastor Mark Pritchett, who is from Meansville, Georgia, and the wonderful 131 District, which I represent. Mark Pritchett is the founder of Rush Ministries, incorporated in the founding pastor of Northridge Church in Tomiston. He has been married to the love of his life Stephanie for 32 years and they have two amazing children and five grandchildren. I was just informed that the grandchildren are pretty much the best thing ever. He's a 15-year veteran of the United States Army and we thank him and all of our veterans for their service. He's a national speaker, a visionary, and an author with a new book coming out in just a few weeks. He holds a bachelor's degree in business administration, a master's degree in pastoral leadership, and is in the final phases of obtaining his doctoral degree in theology. Mark Pritchett speaks to groups. I had the absolute privilege to be a part of a very tragic, well, the privilege was he was there. And he brought the spirit in. It was a very tragic situation. But Pastor Mark Pritchett came in and he brought so much warmth and love. It was hard not to fill the love of our father in heaven around us at that point in time because he was so compassionate and so kind. He's excited for him to be here today simply because he represents my district in so many ways. He loves the outdoors. He loves America and he certainly tries to bring the word of Christ to those around him. So without further ado, I introduce Pastor Mark Pritchett. Thank you, Mr. Speaker. Thank you so much, honored lawmakers. And of course, for the invitation, Representative Beth Camp, I appreciate so much those kind words. Any other grandparents in the house, just wave your hand. Praise God for the grandbabies. Amen. That's the gift you get for not killing your children along the way. 1986, 17 years of age, I joined the United States Army. Amen. Because that was my why. My why was very clear to me because I wanted to honor my country. I wanted to represent the Constitution of the United States for America to defend it against all enemies both foreign and domestic and to bear true faith and allegiance to the same. That was my why because it made sense. It made sense and to the point that God changed my why. In 1999, after 10 years of marriage, deployment, life happening and hitting me between the eyes and two children later, my family came under attack as many have. We were soon to be if we remain in that same trajectory, a statistic of a broken home. At that point, God changed my why by healing our marriage. He healed our home and put us on a different path and gave me a different trajectory. He called me after almost 15 years of service the United States military to resign and to follow in a different path to fight a different fight, one of faith and one yet of freedom. From there, I begin to live a different life, still a patriot, still of our nation. But today as a pastor, I look back to that why. I look back to that defining moment that determines who I am today as a father, as a pastor, as a grandparent and again as a patriot. If I can explain it this way, I believe that everything we do in our life originates from that why. In fact, if I were to pull you in here today and ask you, how many of you know a man named Samuel Peerpot Langley? Many of you would say you do not know him. But at the turn of the 20th century in the pursuit of powered man flight, Samuel Peerpot Langley rose above most. He was known by everyone. He was given $50,000 grant by the War Department. He had a seat at Harvard University and he was employed by the Smithsonian in which he would later become the director. He was followed around by all the great news media outlets. Of course, the New York Times rose to the top. He was given all the great minds of the day to follow him in this great pursuit. The problem was that Samuel Peerpot Langley had a problem. He had all the recipes for success but his why was skewed. Because as you see 200 miles away from that place where he lived was Dayton, Ohio and two young brothers, Orville and Wilbur Wright, who owned a bicycle shop. And not from any grants but through their modest earnings or their bicycle shop, they took their money and they pursued that same effort. But not because they wanted fame, not because they wanted wealth, not because they wanted a platform, but because they're hard and they're why originated in air supremacy and battlefield supremacy for the United States military at that time. But also to give man a different means of travel. You see the two distinguishing wise determined the trajectory from that point forward. Because on the day of December the 17th, 1903, Orville and Wilbur Wright became the first in flight. You see there was a path that took them to a greater cause. There was a why that took them to a greater purpose. And it's interesting because on the day that they put the airplane in flight for the first time, there was no media. The New York Times was not there. In fact, not even the local newspaper. They didn't have degrees. In fact, no one on their team had a college degree including Orville and Wilbur Wright. The difference is they were driven by the cause, the why of their life. And you know, you know this today because at the day that it was announced two or three days later, if they're flight and then to attain the first air flight of a man-powered flight, Samuel Peerpot Langley resigned. He quit. He walked away. He could have added to their why. He could have became through his technological advances, through the minds, through all the accolades and all that he had. Could have made it better. But because of his lack of why that was his end. I say that today because I simply pose this question to you as something I have to reconcile in my mind, you do whether it be in the form of a lawmaker, whether it be a doctor, a lawyer, real estate agent, or whatever it is that you do in your life. Do you remember your why? Do you remember why you ran for this position? Do you remember why you occupy one of these 180 seats? Do you remember the calls for which you fought so hard? Was it for the great pay? I think probably not. If it were up, I think that probably no pun intended didn't pay great dividends. Was it because you believed in a calls greater than yourself? Was it because you truly believe that your vote, your voice, your part in this great thing called the Constitution that your voice could make a difference? You see today as a pastor, I believe that it does. I believe that your role can change the trajectory of history because it matters. But I believe that there's a greater cause that we all must reconcile one day, that there is a name above every other name, that there is a day in which we will stand before our maker, our creator, and the one who can redeem. You see, I believe today, according to the Prince of the Prophet Isaiah chapter 43 and verse 7, he says that all of those who are called by my name, and whom I have created for my glory. You see, our greatest purpose is not to write laws, to change laws, to write bills. Our greatest purpose is not even to pastor a church. If I can be very bold, our greatest passion and purpose is not even to be the husband or the wife or the mother or father or even, as well as it is to be a grandparent. But to be a child of the most high God, to serve him in the capacity in which he has gave us. So today, I challenge you, I implore you, to be reminded of your wine, to get back to that purpose because I believe you can change the world. I want to invite you, if you will, to stand to your feet as we pray today, as we go before the throne of God, to ask for his grace upon your life and upon everything that you will say and do here in this time. Let us pray together. Father, we come today before you in the mighty name of Jesus Christ our Lord. We thank you, Father, that you have made a way where there was no way. We thank you that you have given forethought to this session for every person that sits and occupies the seat. You have given forethought for the bills that would be written, the laws that would be changed, everything that would be challenged. And I pray today that these men and women would honor the sacred constitution that was written, that people have given thought for how it was written under the premise of Christian faith. And I pray today, God, that you would guide their steps, God, that you would go before us. As you say in Psalms 3, I pray you would be the lifter of our head today, that we would walk in a new confidence of who we are in you to realize that there is not just a means to an end, but there is an end. One day, we each will stand before you to hear those words, well done, that faithful servant. God, I pray that that's the words that everyone in this room hears. And God, if not today, you would change hearts before it's everlasting too late. And we give you praise for you alone or worthy. And this in the mighty and matchless name of Jesus we pray, and all of God's people said, Amen. Let us pledge. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible, with liberty and justice for all. Doorkeepers will unlock the doors. Members may greet the chaplain in the south, any room. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, Matt Dollar requested that I do this. He thinks I told I would him something, so I'm going to do it. He says, many great men have passed this chamber over the years, but none will be missed more than Matt Dollar. Matt and Matt Dollar wrote that. Somehow I thought he probably did. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is not in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. The first part of the period unanimous consent is the order of business for the first part of the period. Instruction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions. Is there any objection to the adoption of the resolution establishing the order of bills?\n\nThis is for the day. The chair here is not in the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 1097, my name is Jack Aslan. I'm his 32nd Bill, Bitton, and Act of Men, and I have to reconstitute the Maryweather County Board of Education. The Intergovernmental Coordination. House Bill 1098, my name is Jack Aslan. I'm his 32nd Bill, Bitton, and Act of Men, and I have to create a Board of Commissioners in Maryweather County. Intergovernmental Coordination. House Bill 1099, my Jongler, me, for a little hepiny. 1102 by represent a green and 151st Bill of Utah and act to men in that creating board of commissioners of early camps The other government coordination bill 1103 by represent Chokus the 138 Stevens the 164th green and 150 first Williams the 145th Hawkins of the 27th and others It'll be taught an act to amend code section 40 to 167 the Fisher code of Georgia annotated relating to separately stated fees in a rental agreement Motor vehicles House bill 1104 by represent a house in the 170th Bill being taught on act to amend the act creating board of commissioners of cook county the intergovernmental coordination bill 1105 by represent a constant of 170th Bill be taught on act to amend the act creating cook county board of education the intergovernmental Coordination bill 1106 by represent a Williams 1148th and home in the 179th Bill be taught an act to amend the act creating the board of commissioners of Wilcox County The intergovernmental coordination bill 1107 by represent Williams the 148th Hogan and then 79th Stevens the 164th and dollar the 45th Bill be taught an act to provide the future elections to the office of pro-paid judge of crisp county shall be The intergovernmental coordination bill 1108 by represent a rose the 120th and Williams the 145th Bill be taught an act to amend the act creating board of commissioners for cook county the intergovernmental coordination bill 1109 by represent a Mathieu act of 73rd night of the 130th Bill be taught an act to amend the act established riffing Spawning county school system board of intergovernmental coordination bill 1110 by represent a mathieu act of 73rd night of the 130th Bill be taught an act to amend an act creating the board of commissioners of spawning county the intergovernmental coordination House bill 1111 by represent a mix of 178th Bill be taught an act to amend the act creating the board of commissioners of fierce county The intergovernmental coordination bill 1112 by represent a mix of 178th Bill be taught an act to amend an act providing for the composition selection of board of education appears county The intergovernmental coordination bill 1113 by represent a purple 155th Bill be taught an act to amend the act creating board of commissioners of Ben Hill county The intergovernmental coordination bill 1114 by represent a bet and a 31st and gains 117th Bill be taught an act to amend the act to reconstitute the laws governing the Jackson County school system The intergovernmental coordination bill 1115 by represent a bet and a 31st Bill be taught an act to amend the act providing a new charter for the city of commerce The intergovernmental coordination bill 1116 by represent a bet and a 31st and gains the 117th Bill be taught an act to amend the act creating board of commissioners of the county of Jackson The intergovernmental coordination bill 1117 by represent a Stevens the 164th Ptree the 166th tankers lead the 160th Bill be taught an act to authorize the assessment collection of a technology fee by the state court of Bryan county The intergovernmental coordination bill 1118 by represent a balance of the 23rd can trail of the 22nd bird of the 20th Carson the 46 and timeless the 21st the bill be taught an act to amend the act providing for the number of positions the membership of the Cherokee county board of education Intergovernmental coordination 1119 by represent a Campbell 1171th Taylor 173rd Bill be taught an act to amend the relating the board of commissioners of Decatur County The intergovernmental coordination bill 1125 by represent a power the 24th prince the 127th Frazier on 26 and Nelson the honor 25th Bill be taught an act to amend the act providing governmental affairs 11 house bill 1121 by represent a power to the 124th Prince of the 127th Frazier on 26 and Nelson the 125th Bill be taught an act to amend the act regularly Public instruction for the county of Richmond governmental affairs house bill 1122 by resident of Campbell 1171th Taylor 173rd Bill be taught an act to amend the act providing for the composition of the board of education in Decatur County Intergovernmental coordination 1223 by resident of Hogan on this 179th and delo近 167th Bill be taught an act to amend the act providing for the board of education of Glen County Intergovernmental coordination on 1224 by resident of blackman on 146 Clark on 147th tick of the 140th Williams on 148th and Mathis on 144th Bill be taught an act to amend the act reconstituting the board of education housed in camp Intergovernmental coordination on 1125 by represent a percol 150 fifth Bill be taught an act to amend the act providing for the county Composition to Ben Hill County Board of Education Intergovernmental coordination on 1126 by represent a delo近 167th Bill be taught an act to amend the act creating the board of education of McIntosh County The intergovernmental coordination on 1227 by represent a carpenter of the 4th Tarvern of the 2nd Ridley the 6th Bill be taught an act to amend the act creating the board of commissioners of Wittfield County Intergovernmental coordination on 1228 by represent a carpenter of the 4th Tarvern of the 2nd Ridley the 6th Bill be taught an act to amend the act to revise and restate the law relating to Wittfield County Board of Education Intergovernmental coordination on 129 by represent a corporate of 174th Bill be taught an act to amend the act providing for the election of members of the Board of Education, Charles County Intergovernmental coordination on 1230 by represent a benton of the 31st Bill be taught an act to amend chapter 71 in the title 36 the fiscal to Georgia and Entated relating to the development impact fees Governor Lefair's House Bill 1131 by resident of limbo 99th camp of the 131st May near the 56th and Gunner of the 8th Bill be taught an act to amend title 50 the fiscal to Georgia and Entated relating the state government state planning and community affairs House Bill 1132 by represent a home on 79th house to the 70th to Lodge on 67th Stevens, the 64th and Gileary on 62nd Bill be taught an act to amend chapter 83 the fiscal to Georgia and Entated relating fees and taxes insurance House Bill 1133 by represent chocus on 38th Stevens the 164th Collins the 68th gains the 117th Corbord of the 174th and others The title an act to amend chapter 2 to the title 46 the fiscal to Georgia and Entated relating the public service commission Energy utilities and telecommunications House Bill 1134 by resident of administration and 104th bottom of the 72nd lot of the 120 second McDonald the 26th weeks and 178th Bill be taught an act to amend code section 16154 the efficient code of Georgia and Entated relating participation criminal gang activity Judiciary non-civil House Bill 1135 by resident of smith the 70th bottom of the 72nd checkers on his 32nd and singleton in the 71st Bill be taught an act to amend the act providing for the Composition of Board of Education in Coedah County The intergovernmental coordination House Bill 1136 by rooms and smith the 70th bottom of the 72nd checkers on 32nd and singleton in the 71st Bill be taught an act to amend the act creating the Board of Commissioners for Coedah County The intergovernmental coordination House Bill 1137 by represent work highs to the 157th goal field of 60th Abstraction to the 104th and McLaren of the 51st Bill be taught an act to amend article on the chapter 13 title 50 the fiscal Georgia and Entated relating the general provisions of administrative procedure Public safety and homeland security House Bill 1138 by resident of nila 74th for now the 77th pays more the 63rd Douglas the 78th in scott of the 76th Bill be taught an act to amend an act providing home state exemption from certain city of Mara. I have a alarm taxes The intergovernmental coordination House Bill 1139 by resident work highs to the 157th building the title an act to amend an act providing for the election of members of the Board of Education in top of County The intergovernmental coordination House Bill 1140 by resident burn one of the 28th building the title an act to amend an act changing the best method of choosing the members of the bank county Board of Education The intergovernmental coordination House Bill 1141 by resident of nila 28th built the title an act to amend an act creating Board of Commission for bank county The intergovernmental coordination House Bill 1142 by resident case on the 17th wheat hour the 119th fri the 118th Bill be taught an act to amend an act providing for the merger the existing independent school system the mayor and council the city of Athens The intergovernmental coordination House Bill 1143 by resident balance of the 23rd can't trail of the 22nd bird of the 20th carcass of the 46th and time of the 21st Bill be taught an act to amend an act creating Board of Commissioners of Cherokee County The intergovernmental coordination House Bill 1144 by resident parker the 101st to clerk the 100th to claim to the 100th Hutchinson on earth 7th Mitchell 106th and others Bill be taught an act to amend an act creating Board of Commissioners of Gwyneth County Governor Milo Affairs House Bill 1145 by resident Gollett of the 19th gravely 67th Buckner of 137th May the 56th Campbell of 15th and others Bill be taught an act to amend part one of our 5th chapter 9 of title 45 The official go to Georgia and it's literally the Georgia State in demnification fund public safety and homeland security House Bill 1146 by resident wild and 120 second columns the 68th Hutchinson 60th Bruce Lumpston to the 12th and McDonald the 26th Bill be taught an act to amend title 40 the fiscal go to Georgia and it's related motor vehicles and traffic Public safety and homeland security House Bill 1147 by resident grows the 120th Corb of the 174th The hood of the 175th Ridley the 6th Smith of the 18th Bill be taught an act to amend chapter 3 title 27 the fiscal go to Georgia and it's related to wildlife channel game Mission Parks House Bill 1148 by resident grows the 120th Corb of the 174th The hood of the 175th night the 130th Ridley the 6th Bill be taught an act to amend code section 275 2.1 the fiscal go to Georgia and it's related possession of serving purposes game Mission Parks House Bill 1149 by resident colonel the 77th Bode of the 60th dry on the 59th Alan 40th Holland the 54th and others will be taught an act to amend code section 44 50 the fiscal go to Georgia and it's related to man for possession judiciary House Bill 1150 by resident dicky the 140th Watson the 72nd England of the 16th Task Force the 11th Perk will 155th will be taught an act to amend code section 41 7 the fiscal go to Georgia and it's related to treatment of bag and cultural facilities agriculture and consumer affairs House Bill 1151 by resident Clark with the 98th Bill be taught an act to amend chapter 5 with title 21 of the fiscal go to Georgia and it's related to ethics and government rules House Bill 1152 by resident mayner the 56th limit the 99th Lopez the 86th Jackson the 128th Bill be taught an act to amend part two of article 15 to chapter 1 to title 10 the fiscal go to Georgia and it's related to fair business practices agriculture and consumer affairs the 35th of the 30th of the 56th limit the 99th Lopez the 86th Bill be taught an act to amend part three of article six to chapter two titled 20 the fiscal go to Georgia and it's related to educational program education House will 1154 by resident Carson the 46th Cecil or the 35th they're hard to 36 Dollar the 45th C-Ball the 34th and others will be taught an act to amend an act to amend and board commissioner Sir Coyote County Governor Lynn Lefayr House resolution 664 by both the Greens and other 51st Lomston and the 12th Donna who the 30th resolution authorizing at least a certain state owned property State properties House for resolution 665 are the hugely the 136th binary 135th and eventually the 88th resolution to compensate Ashley Jordan Ashley Devil Lomber appropriations House for resolution 666 by resident benton 31st resolution proposing an amendment to the Constitution The governmental affairs House for resolution 667 by resident made early 56 Lopez and the 86th limit the 99th Williams the 37th Mitchell the 88th resolution creating house study committing on state Special rules House for resolution 648 by resident Thomas the 21st Congress the 14th jasper to 11th Carson the 46 Jones the 47th and others A resolution honoring the life memory of officer Joseph W. Berson and dedicating interchange in his memory Transportation House resolution 669 by resident can in 58th Thomas the 39th Park will 100 days Kendrick 93rd now on the 40th and others a resolution committing uphold the reproductive freedom of the occasion 49th anniversary roe versus way rules Senate bill 330 by senator valberts of the 56 Doobin the 30th robinson 29th Miller the 49th Carpenter 30 second and others will be titled an act of men title 33 the fish go to Georgia annotated relating insurance Insurance Senate bill 332 by senator valberts of 56 doobin and 30th Miller the 49th Carpenter 30 second Robinson 29th and others will be titled an act of men chapter one title 10 of the fish go to Georgia annotated related selling and other trade practices Judiciary Senate bill 373 by senator and Bartelle 31st bill be titled an act of men and act creating a multi-number board of commissioners of heraldson county Intergovernmental coordination That completes first readers second reading of bills and resolutions a clerk or aid House bill 1060 by reps the math is of the 144th the bill is authorized to governing authority of the sea of Conquering to levy and excise tax House bill 1061 by reps of year to have the 150 second to build to a miniatry and In Board of Commissioners of Lee County House bill 1062 by reps of camp of the 131st A bill to provide a homestay exemption from upson county edgel or in taxes House bill 1063 by reps and a mix of 178th and workies or 1507th the bill to a miniatry creating a board of commissioners of Wayne County House bill 1064 by reps of p3 of the 166th Smith of the 144th Bonner of the 72nd root and 123rd black one of the 146th and others of bill relating to imposition rate computation Exemptions and credit from state income tax House bill 1065 by rep of them of the 99 frustration of 104th all over the 82nd and Kelly of the 16th the bill relating to mental health House bill 1066 by reps and a green of the 51st the bill to a miniatry and board of commissioners of Stewart County House bill 1067 by reps and a green of the 51st the bill to a miniatry leading to the board of education of Stewart County House bill 1068 by rep of the 1133rd Kelly of the 16th Hall from the 81st the bill relating to state toward claims House bill 1069 by rep of the Williamson of the 115th Cooper of the 43rd hatchet of the 150th all over 82nd Parish of the 158th and others of bill relating to examination treatment or mental illness House bill 1070 by reps and homes of the 29th and Mathis of the 144th a bill to a miniatry creating the Jones County board of education House bill 1071 by rep of the homes of the 129th and Mathis of the 144th the bill to a miniatry creating board of commissioners of Jones County House bill 1073 by reps and a Stevens of the 164th Tinkers the bill 160th Petrie of the 166th a bill to a miniatry providing for the election of members of the board of commissioners of Brian County House bill 1074 by rep of the Stevens of the 164th Tinkers the bill to a miniatry providing for the election of members of the board of education of Brian County House bill 1075 by reps of parish of the 158th the bill to a miniatry establishing board of commissioners of Loads and revenues for the County of Jenkins House bill 1076 by reps and Taylor of the 173rd to fill to a miniatry creating board of commissioners of forwarded the Procounciling Brady House bill 1077 by reps and Taylor of the 173rd Watson of the 170th second load of the 175th a bill to a miniatry providing for the board of education of Thomas County House Bill 1078 by reps of Della of the 19th graphically of the 67th mom to hand on the 17th Alexander the 66th Kelly of the 16th and others a bill to a miniatry creating the board of commissioners of the Palvin County House bill 1079 by reps and Diki of the 140th and Bentley of the 19th of built a miniatry providing for the Board of Education of Peach County House bill 1080 by reps and Diki of the 140th and Bentley of the 139th of build to a miniatry creating board of commissioners of roads and revenues for Peach County House bill 1080 1 by reps and parish of the 150th to build a miniatry creating for the New Board of Education for Jenkins County House bill 1082 by reps and roads of 120th and the levert of the 33rd. a bill to amend an act creating, recreating the Board of Commissioners of Wilkes County House Bill 1083 by Rep. Setslow, 35th, Powell, 32nd, Jones, 25th, Parsons of the 44th, Drenner, 85th, a bill relating to Generation Distribution and Electricity. House Bill 1084 by Rep. Setsow, 8th, Jones, 47th, Dundin, 29th, Minks, 178th, Thomas of the 21st and others, a bill relating to Education House Bill 1085 by Rep. Gellin, 19th, Sains of the 180th, more of the 95th, Williams of the 145th, Evans of the 57th and others, the bill relating to Primaries and Elections, House Bill 1086 by Rep. Dempsey of the 13th, Cooper of the 43rd, Hutchinson of the 178th, Newton of the 123rd, Drenner of the 85th, a bill relating to Influence of Vaccinations for Discharge Patients, 865 and older. House Bill 1087 by Rep. Hutchinson of the 107th, Quinn of the 89th, Mitchell of the 106th, Park of the 101st and Scopefield of the 60th, the bill relating to Offences, involving Illegal Aliens, House Bill 1088 by Rep. Guntran VIII, Gamal of the 15th Saga, over 14th Smith of the 18th Hogan of the 179th and others, a bill relating to Miscellaneous Provisions regarding Time Chair of Projects and Programs, House Bill 1089 by Rep. Smith of the 133rd, Bradley of the 6th, Barbara of the 174th and with our 119th, a bill relating to Road Tax on Motor Vehicles, House Bill 1090 by Rep. Manta Han of the 17th, Galat of the 19th, Kelly of the 16th, Chasvers of the 11th Powell of the 32nd and others, a bill relating to Revenue Attacksation, House Bill 1091 by Rep. Manta Han of the 17th, Galat of the 19th, Chasvers of the 11th Powell of the 32nd, Mathis of the 144th and others, a bill relating to General Provisions regarding liability of owners and occupiers of land, House Bill 1092 by Rep. Cooper of the 43rd Demptsy of the 13th Smith of the 70th and all of it to the 42nd Parish of the 140th and others, a bill relating to Arrest by Law of Forceman Officers, House Bill 1093 by Rep. Washburn of the 141st Powell of the 32nd, Bradley of the 6th, Williams of the 115th Mitchell of the 88th and others, a bill relating to local government, House Bill 1094, by Rep. Lever of the 33rd and Hagen of the 156th, a bill relating to annual notices of current assessment contents, posting a new assessment of description, House Bill 1095 by Rep. Mallow of the 163rd Evans of the 57th Jackson of the 165th Roberts of the 52nd Giller, the 162nd, a bill relating to disposition of property seized, House Bill 1096 by Rep. More of the 95th, by Rep. Mallow of the 143rd Maclod of the 105th, Hutchison of the 107th Alexander of the 66th and others, a bill relating to primaries and elections, House Resolution 647 by Rep. Hatchet of the 150th, Williams of the 115th, Newton of the 123rd Parish of the 158th, Stevens of the 164th, a resolution urging the Georgia Department of Community Health to apply for federal approval to allow institutions for mental disease in this state to qualify for Medicaid reimbursement, House Resolution 648 by Rep. L. 12, D. 13th Cuggins of the 14th, Department of the 2nd, Cameron of the 1st Resolution honoring the life and memory of Mr. Bobby Lee Cook and dedicating intersection in his memory, House Resolution 649 by Rep. L. 12, D. 13th Cuggins of the 14th Resolution honoring the life of Judge F. Larry Salman in dedicating an intersection in his memory, House Resolution 650, by Rep. L. 13th Gamble of the 15th Evans of the 83rd Green of the 135th Matthews of the 73rd Parish of the 142nd Resolution creating the House Study Committee on Literacy Instruction, House Resolution 651 by Rep. Hatchet of the 110th Coupre of the 43rd, all over the 82nd Beverly of the 143rd and Scuffield of the 60th, a resolution creating the House Study Committee on evaluating, simplifying the eliminated duplication of regulatory requirements for mental health and social service providers, House Resolution 652, by Rep. L. 16th Park of the 110th Scuffield of the 76th Hatchet of the 170th, a resolution encouraging the Georgia Department of Public Health and the Georgia Department's Community Health to improve the quality of care for those with HIV on the State Georgia's Medicaid program. Senate Bill 362 by Senator Goodman of the 8th Miller of the 49th Duggan of the 30th Park of the 11th Gu� to the 51st and others of the Bill to the Madden X creating a linear county building authority in Senate Bill 365 by Senator Duggan of the 30th and brass of the 28th of Bill to the Madden X amending revising superseding and consolidating the loss pertaining to the Board of Commissioners of Carroll County Senate Bill 357 by Senator Goodman of the 51st of Bill to the Madden X provide for the election of members of the Lumpkin County Board of Education Senate Bill 368 by Senator Goodman of the 51st of Bill to the Madden and act to provide for the method of elections of the members of the Board of Education of White County, three second readers. Reports of Standing Committees, the clerk will read. Reports of the Williams of the 48th District Chairman of the Committee on Banks and Banking submitted the following report and the Speaker and Committee on Banks and Banking. The following bill is in consideration. The following bill is in the House of the Stuck Community Report to the same back to the House of the Following Recommendations, Hospital 891, new pass, Hospital 899, new pass, respectfully submitted. Reports of the Williams of the 48th District Chairman. Reports of the Davis of the 164th District Chairman of the Committee on Economic Development Tourism submitted the following report and the Speaker and Committee on Economic Development Tourism. It's in consideration. The following bill is in the House of the Stuck Community Report to the same back to the House of the Following Recommendation, Hospital 1044, new pass by Committee Substitute, respectfully submitted. Reports of the Davis of the 164th District Chairman. Reports of the Madame of the 29th District Chairman of the Committee on Higher Education submitted the following report. The Speaker and Committee on Higher Education had the consideration of following bills of the House of the Stuck Community Report, same back to the House of the Following Recommendations, Hospital 895, new pass by Committee Substitute, House of the 16, new pass by Committee Substitute, respectfully submitted. Reports of the Madame of the 29th District Chairman. Reports of the Madame of the 40th District Chairman of the Committee on Health and Human Services submitted the following report. The Speaker and Committee on Health and Human Services had a consideration following bill of the House of the Stuck Community Report to the same back to the House of the Following Recommendation, Hospital 1049, new pass, respectfully submitted. Reports of the Madame of the 40th District Chairman. Reports of the Madame of the 274th District Chairman Committee on Motor Vehicles submitted the following report. The Speaker and Committee on Motor Vehicles had a consideration following bills of the House of the Stuck Community Report, same back to the House of the Following Recommendations. Hospital 1090, pass by Committee Substitute, House of the 1055, new pass, respectfully submitted. Representative John Corber to the 174th District Chairman. Representative Allen Pallava of the 32nd District Chairman of the Committee on Regulated and Industry submitted the following report. The Speaker and Committee on Regulated and Industry, seven consideration following bills of the House. Instructed to meet the report to the same back to the House of the Following Recommendations, Hospital 412, new pass by Committee Substitute, House of the 430, new pass by Committee Substitute, respectfully submitted. Representative Allen Pallava of the 32nd District Chairman. Representative Carson of the 46th District Chairman of the Committee on Retirement, some of the following report. And the Speaker and Committee on Retirement, is on the consideration following bill of the House. Instructed to meet the report, same back to the House of the Following Recommendations, Hospital 780, new pass. You're up to them, Jan Tancersley, the 160th District Chairman of the Committee on Intergovernment Coordination Locals, some of the following report and the Speaker Committee on Intergovernment Coordination Locals on consideration following bills of the House. Instructed to meet the report to same back to the following recommendations, Hospital 945, new pass, Hospital 946, new pass, Hospital 1012, new pass, Hospital 1014, new pass, Hospital 1015, new pass, Hospital 1016, new pass, Hospital 1017, new pass, Hospital 1018, new pass, Hospital 1019, new pass, Hospital 1020, new pass, Hospital 1013, new pass, Hospital 1024, new pass, Tabla Hospital 1025, new pass, Hospital 1026, new pass, Hospital a1027, new pass, Hospital 1013., new pass, Hospital 1036, new pass, Hospital 1029, new pass, Hospital Attend 31, new pass, respectfully demeanor represented. Chairman. That completes the report's standing committees. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nHouse Bill 1029 by resident Jones the 47th City of Milton House Bill 1030 by resident Jones the 47th City of Milton House Bill 1031 by resident Jones the 47th City of Milton is there any objection to the previous question being ordered on the local calendar the chair here is none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills the chair here is none the report of the committee is agreed to shall not be a Here's none the report of the committee has agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted. If so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 115. The nays are 46. These bills having received the requisite constitutional majority. I'm sorry. We got three that needed two thirds, did not get it. Mr. Clerk, what were those three keys? House Bill 1029 by Rebs and Jones, the 47th City of Milton, House Bill 1030 by Rebs and Jones, the 47th City of Milton, and House Bill 1031 by Rebs and Jones, the 47th City of Milton. What purpose does the Speaker approach him rise? Make a motion. State your motion. I'd like to move that we actually serve notice that we reconsider this at the proper time. Okay, that would be the next legislative day, and they will be... So, the posture we're in is that, all with the exception of those three bills, the rest of the local calendar passed. What purpose does Chairman Tancersley rise? To make a motion. State your motion. Mr. Speaker, I move that we immediately transmit the local calendar to the Senate. Minus the three bills that are subject to reconsideration. Thank you. The lady has moved that this House immediately transmit the local bills that did receive a requisite constitutional majority to the Senate. Is there any objection? Chair here's none, and it is so ordered, and we will take up the Speaker Pro Tems reconsideration tomorrow. All right, we're going on now to morning orders, going on to morning orders. If you have chairs going to limit morning orders today to two minutes each, no warning at the end of two minutes, the mic will be cut off. Chair recognizes Chairman Dickie for a morning order. Thank you, Mr. Speaker. And colleagues on your desk, you receive an invitation to the University of Georgia College of Agriculture Environmental Sciences or Legislative Reception Day down the blue room. You can go see our great folks that do extension research and education for wonderful college that supports our agriculture throughout this state. And also ensure our great students are being educated in the field of agriculture and agribusiness. And I just want to appreciate y'all coming by and speaking to them. You go next door and get you a lounge county fried quail. But you might see extension and research folks from UGA around the capital day. And just not keep for the great job they are doing over in Athens and throughout our state. I know all of y'all have got offices in each of your counties from our extension and research folks and just they're a great resource for. So thank you for your support for them. Y'all will. Chair recognizes representative Rebecca Mitchell for a morning order. Thank you, Mr. Speaker. Today I rise to talk to you about engineering controls. And I specifically want to talk to you about engineering controls from the perspective of a mom of four small children. We really rely on engineering controls to keep us safe in the world, to make the choices that we have a little bit easier. If I take four small children to a playground that has a fence all the way around, I know if they're behind the slide. They're still there. That's an engineering control. This weekend in Snalville, we had an example where we didn't have an engineering control in place that could have made a meaningful difference in the lives of a family in Snalville. This weekend, one family in Snalville had to take a seven-year-old to the hospital for a gunshot wound. That wound was the result of a gun that was not sufficiently secured and was loaded and was picked up by their nine-year-old sibling. We have the ability to prevent more families from experiencing this trauma with an engineering control. That control is in house bill 971 by Representative Scott. I encourage you all to read the bill and think thoughtfully about what we can do to help families be safer from this type of risk. Thank you very much, and I yield the well. Chair recognizes Representative Edna Jackson for a morning order. Thank you, Mr. Chairman. On January 30, 1865, the 13th Amendment of US Constitution was passed by Congress and signed by President Abraham Lincoln. This was the emancipation of the slaves. Richard R. Wright was among those emancipated. He later became the founding president of Georgia State Industrial College for College Youth, now known as Savannah State University. He was the architect and champion of the law signed by President Harry Truman on June 1948, declaring each February 1 as National Freedom Day. This decoration is inclusive of all human beings, regardless of race. We ask that you join us to fight against current law day challenges, the dangers that seek to recast slavery in various forms, such as human trafficking and the right of every citizen to vote. Remember, National Freedom Day was on yesterday in these United States of America. Will you please stand with us in recognition of National Freedom Day? Thank you. What do I say? I yield the well. Chair recognizes Chairman Corbett, Chairman LeHood, and represented to Sharper for a morning order. Thank you, Mr. Speaker. On behalf of the Lounge County delegation, I would invite everyone to the depot this afternoon at 5 p.m. for the Lounge County bird supper. And in recognition of Groundhog Day, I can guarantee you you'll cast a bigger shadow tomorrow. Chair recognizes representative Park and representative Moore for a morning order. Thank you, Mr. Speaker. It is my pleasure and honor to welcome the Gwyneth Chamber to the Georgia State Capitol. Established in 1947 as a rule chamber of commerce, serving farmers, today the Gwyneth Chamber serves more than 2,200 members throughout Metro Atlanta. The Gwyneth Chamber is dedicated to expanding economic opportunities for all and improving our quality of life with a focus on sustainable infrastructure, education and workforce development, revitalization and redevelopment. We have with us this morning, Nick Macino, president of the Gwyneth Chamber, Randy Dillinger from Jackson EMC, Dr. Jan Joseph and Haley Howell from Georgia Gwyneth College, Paul O from the Gwyneth Chamber, Joel Edwards, the 2022 chair, and Nadi Cho from Missy Cosmetics. Members, if you all see members of the Gwyneth Chamber and Gwyneth small business owners out in the hallways, please give them a kind welcome to the people's house. Thank you, Mr. Speaker. I yield the well. Chair recognizes representative Derek Jackson for a morning order. Thank you, Mr. Speaker. Good morning, ladies and gentlemen. For my moment of black history, it's about black history itself. History is the reflection of historical events that took place. But unfortunately, our grade school textbooks do not include the full history. If I said to you all, founding fathers, what comes to your mind? Does someone like me come to your mind? Like you, I was forced to learn and memorize the accomplishments of George Washington and Benjamin Franklin Thomas Jefferson and so many more individuals that do not look like me. But why can't or didn't, I learn about our unsung heroes? Because our black history goes beyond Dr. Martin Luther King and Rosa Parks. We have more who contribute to this country, like Claudette Caulvin, Alice Coachman, Bayer Rustin, Anna Lee Cooper, Bessie Coleman, Robert Abbott, Gordon Parks, General Benjamin O. Davis Senior, Henrietta Lacks, and many more. But black creative geniuses and critical thinkers who saw so many problems in these United States, but they're not reflected in our textbooks. In order for us to heal from our historical past, our past must be confronted. This is not about critical race theory. This is not about 1619 project. This is about inclusion and truth. This is about confronting the past, the good, the bad, and the ugly. Gentlemen, it has 10 seconds remaining. This moment of black history is about America's history, which is black history. Thank you, Mr. Speaker, you do well. Chair recognizes representative Taylor, Chairman Taylor, for a morning order. Thank you, Mr. Speaker. I honor black history a month. I would like to share some information about Jackie Robinson. He was a trailblazer and set many major league records. He was the first African-American in modern Bay, Major League Baseball. And in 1977, our beloved Braves retired his number 44 on the 30th anniversary of him breaking the color barrier. K-Rogue, Georgia, is the birthplace of Jackie Robinson. And we are very proud of that. Robinson was born 13 miles south of K-Rogue on January 34. Before he moved to California. The Jackie Robinson K-Rogue Memorial Institute, along with the Georgia Historical Society, and the Major League Baseball recently dedicated to historical markers in K-Rogue. The markers referenced his birthplace in Grady County. It's actually at County Road 154 south of K-Rogue. And it replaced a marker that had been damaged. We also placed a new one in the library. Together, these two historical markers will allow residents and visitors alike to learn more about one of baseball and America's most important historical figures. Major League Baseball is largely responsible for the two markers being placed in K-Rogue. I think it is important that we remember that which has gone on before us. The endowment will provide a perpetual care for these historical markers. The legacy he has left will live on. Thank you, Mr. Speaker, I yield the will. Chair recognizes Representative McLeod for a morning order. Thank you, Mr. Speaker. Today I'm here to thank the taxpayers of the great state of Georgia. Anyone who pays income tax, sales tax, or occasional fees, to this state, you deserve this body to fund services that will give you a return on investments. Our state budget revenue is about $30 billion. Of that, 76% comes directly from your income and sales tax. 12% comes from corporate taxes. And another 12% comes from fees. Remember, this is a government of the people, by the people, and for the people. So we must do right on behalf of the people. One Georgia, I yield the will. That completes our morning orders. Complets morning orders. We are now going on to the rules calendar. We are going on to the rules calendar. Members will give attention. And if you don't care to hear the debate, then please step outside and not distract those who do. Clerk will read the caption to House Bill 478. House Bill 478 by President Rich, the 97th and others to be titled an act to men chapter seven, a title to warn. 24th of the fiscal to Georgia, and to add overlaying opinions and expert testimony. Ms. Bill lemmer, for the committee on judiciary non-civil, that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Bonnie Rich to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. Today I bring to you House Bill 478. House Bill 478 updates the Georgia rules of evidence to require the same standard for admitting expert testimony in criminal cases as is used in civil cases. This important change is supported by the legal community. In fact, all of the major stakeholders in the community who work with us here at the Capitol are in agreement. We have the Georgia Association of Criminal Defense Lawyers, the Prosecuting Attorney's Council, GTLA and NADL, the National Association of Defense Lawyers. Since 1993, federal courts, including those in Georgia, have used in both civil and criminal cases the standard as set forth in the United States Supreme Court case of Dobert versus Merrill Dow. This case sets the trial judge up as the gatekeeper and provides a list and it's not an exhaustive list. It provides a list of factors that the judge is to consider and determining the admissibility of scientific evidence and expert testimony now too. Some of those factors include whether the theory or the technique has been tested, whether it's been peer reviewed and published, any error rate, the existence and maintenance of standards controlling its operation, and finally, whether it has widespread acceptance in the scientific community. That latter factor is currently the only standard that we have in criminal cases in Georgia. Even beyond 1993, Georgia did continue to use this old Harper versus the state standard, which is a 1982 case for the admission of scientific evidence in both civil and criminal cases. This standard simply requires that scientific evidence reach only a verifiable stage of certainty without regard for reliability. The General Assembly took up an extensive tort reform package in 2005 and as part of that, we passed legislation which applies the dogurt standard in civil cases. Unfortunately, we continue to use the old Harper standard in our criminal cases even to this day. And sadly, this is resulted in the use of unreliable scientific evidence which has resulted in wrongful convictions. According to the National Registry of Exoneration, we've had 39 documented exoneration in Georgia over the last 30 years. And at least 25 of those wrongful convictions were due at least in part to faulty scientific evidence that was admitted under the Harper standard. That means that 64% of our wrongful convictions have been based on faulty evidence. Those 25 people, those 25 Georgians lost over 312 years of their lives and cost Georgia taxpayers well over $6.2 million. It does not reflect our Georgia values that it is more difficult to get expert testimony included in a case about money and property than it is about life and liberty. House Bill 478 will stop that and will bring Georgia's evidence code up to the standard it should be. Mr. Speaker, I will yield for any questions. You have some questions. Do you care to yield? Yes, I do. Chair recognizes representative Stacey Evans to your left for a question. Thank you, Mr. Speaker. Just lay the yield. I do. Hopefully this is just my misunderstanding. But I just looked quickly at 24-7-702 which seems to be the section that we're amending according to the presentation to change the standards in criminal cases but 24-7-702 is in the civil section. That is in the civil section and let's see. Let's make sure we're working off of the right LC number. This LC441884S is that what we have here? Yes, that's okay. Okay. Okay. Do you further yield? Yes, I do. Chair recognizes representative Wolenski to your left for a question. He waves. Chair recognizes representative Jasmine Clark to your left for a question. Thank you, Mr. Speaker, it doesn't generate a yield. I do. I'm not a lawyer, so I'm just asking this for clarification. What's the difference between civil proceedings and criminal proceedings? Well, civil proceedings are lawsuits over money damages or property rights and criminal proceedings are just that they're criminal proceedings based on whether someone has committed a crime. Does the lady further yield? Yes. Are there any other types of proceedings or are there only just those two civil or criminal? With respect to the rules of evidence, yes, there are just two broad categories of civil and criminal. Thank you. Mr. Speaker, unless we have other questions, I will yield the well. I'm making sure the representative Clark, were you finished? Okay. Mr. Speaker, I request favorable consideration of House Bill 478 and I yield the well. The lady is yielded the well. Is there any objection to the previous question being ordered? The chair here is now in the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is now in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is now in the report of the committee. Is agreed to shall this bill now pass all those in favor of the passage of House Bill 478 will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative McLaren rise? Parliament or any criminal speaker? Mr. Speaker, is it not true that this bill is the happiest I've literally ever been in a House judiciary non-civil committee? You have a very low standard of happiness with the gentlemen so states actually when I chaired that committee I was thrilled to be there every day representative. Thank you Mr. Speaker. I feel the same way. Thank you. Have all members voted? Have all members voted? Yes so the clerk will lock the machine. On the passage of House Bill 478 the eyes are 138. The nays are 25. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 907. House Bill 907, I'm Smith to the 18th and others to be entitled and act to amend. Go to section 212, 540 the fiscal to draw janitor relating to conduct with special primaries and special elections generally. This bill had refer the committee on government affairs. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Tyler Paul Smith to present the bill. Thank you Mr. Speaker. Good morning members of this August body. It's good to be with you this morning. Today I bring to you House Bill 907. House Bill 907 will deal with a problem that we have encountered here in our state especially with what we call single county T-splice designees. For these single county T-splice designees, when they originally passed their T-splice referendum, allowing them to collect these revenues, they had to set a cap. What we have seen thanks to this body having passed the marketplace facilitator bill and this unexpected robust economy that we have seen in the last two years, a lot of these counties are nearing those caps. My home county of Herylson County reached that cap as of last year. In the current code section dealing with special elections, you would have to wait until May in an off presidential year to call this referendum. This would allow for counties to call a special election on the third Tuesday of March. What I will note and I have discussed with several members and I appreciate all the questions I have had from each member that has come to me with it. This will sunset on July 1, 2024. If a county were to encounter say that they are capped amount of what they could collect, they admit that they either have this March or the next March in which to call this special election. This is a good bill. I will note that my home county, if they were to have to wait until the May election, they could potentially lose out on several million dollars worth of revenue. To our small rural and frankly poor counties, that kind of money is huge. And I will just share with you the burden that has to be born on taxes that would usually go to the property owners. So this transportation tax, if this house were to pass it, it would help these rural communities and not losing any more revenue than what they already have. Mr. Speaker, I will yield for any questions if there are any. Do you yield for questions? Yes, Mr. Speaker. Chair recognizes representative Al Williams to your left for a question. Thank you, Mr. Speaker. Mr. Chairman, yield for my friend, for a question. I followed you very closely and it points you both stony and accent kind of threw me off. But I did want to say I support your bill, principal, and I see what you're doing. And it has some very good points. I'm only concerned. I stated in rules and it's a concern. It's not big enough for me to vote against the bill, but the turnout is representative of the overall population. But I've heard that because of the size of your bank rule, you're going to see that there was a great turnout in March. Yes, sir. That is correct. And, you know, this is upon the county to make sure that they advertise that this is something that we need. And to be clear, for my home county, it's not going to be a tax increase. It's just going to continue this tax. What you would have to do in the event that you shut down those, you have to change the machines that collect that tax. You can no longer collect that tax.\n\nand so it's even a burden on business owners in these different counties throughout our state. Thank you for the question. You further you? Yes, Mr. Speaker. Chair recognizes representative Derek Jackson up in the gallery, I think. For a question. Thank you, Mr. Speaker. Does the gentleman you? Yes, sir. I'm referring to him. I'm clarified, so your bill will have the voting precincts open in March in order for citizens of Georgia to go and vote for this T-splots. If that particular county called this special election, yes, or they would be open for that. Does the gentleman further you? One more, yes, sir. So if the whole discussion around voting, is to minimize the cost to Georgians, why wouldn't your bill be aligned when we will have voting such as in May, which will not incur additional costs? Because now you have to train the public at large that they simply have to go and vote in March for a T-splots when we do not do the same effort for them to cast their vote for their representatives of choice in May. So thank you for the question. The cost of this election is born by the county like the gentleman states. I think you'll see the revenues collected will more than make up for the money spent on that special referendum election. Thank you for the question. Do you further you? Miss Speaker, I'll take one more and then I think I'm going to be done. Okay, Chair recognizes representative Jasmine Clark to your left for a question. Thank you, Mrs. Clark. Thank you, Mrs. Youngerman. Thank you, Mrs. Speaker, does the gentleman you? For a question, yes. So you mentioned that this will only be for the next two years. So this seems like this legislation is very much tailored to something very specific that you want. Is that correct? Well, there are several, there's actually around 40 counties that can very well find themselves in this same situation as in addition to my home county. Because I mean, look, the economy's doing great. If they were to hit that cap, they would then be able to call that special referendum to raise the cap to continue collecting that T-Splash revenue. All right, that's a gentleman further you? One more. If you, or if this bill were to pass, and for today is February 2nd, and if this bill were to pass, and then go to the other chamber and pass there, and then the governor were to sign this immediately, would your election officials in your county have time to administer an entire election, and then turn around and administer a second election less than two months later? Yes, they would. We've got the timeline and the deadline down, and they are fully prepared to implement this if we're able to pass this great bill. Thank you for answering the question. Thank you. Miss Speaker, with that, I will yield the well and ask this body's favorable consideration. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. The number is voted. If so, the clerk will lock the machines on the passage of House Bill 907. The eyes are 137. The nays are 29. This bill having received the requisite constitutional majority is therefore passed. The bill has been passed as representative Tyler Paul Smith rise to make a motion. State your motion. Mr. Speaker, I move the House Bill 907 be immediately transmitted to the Senate. Representative Smith has moved that House Bill 907 be immediately transmitted to the Senate. Is there objection? Is there objection to the chair here's none? It is so ordered. Clerk will read the caption to agree with privilege and resolutions. I remember a lot. Memorizing the Mr. Amard Marquez Arbery. Recognizing commending the NAACP Atlanta branch, commending, congratulating Robert Birch, a fan and senior, recognizing and commending, Jada Williams, recognizing commending pastor. Stasi Ayrton on the occasion of her 25th anniversary in ministry. Commemorating black restaurant week, recognizing commending the Andrew Young School of Policy Studies at Georgia State University on the occasion of his 25th anniversary, recognizing February 1st, 2022. This Girl Scout Day at the State Capitol, commending John Matthew Fernandez, celebrating the 11th annual fire and ice chili cookoff in craft beer festival, recognizing commending. Refique Amard on his outstanding public service, remembering Mr. Kendrick Lamar Johnson, recognizing commending his Treen Arnold James, President of the Georgia Nationals organization for women, commending Camille Addixon Paik Creek's elementary school, 2021 teacher of the year. Commending Carla Lossett Coleman, Smith Elementary Schools, 2021, 2022 teacher of the year, commending Lisa Martinez-Bargas, Rex Mill, Middle Schools, 2021, 2022 teacher of the year, commending Pamela Booker, Thurgood Marshall Elementary Schools, 2021, 2022 teacher of the year, commending Daniel Perkins, Marrow Middle Schools, 2021, 2022 teacher of the year, and for other purposes. That completes the reading with privilege resolutions. Is there any objection to adopting the privilege resolutions that Chair here's done and the resolutions are adopted? We're going on now to announcements. Listen up, on announcements. First of all, if you signed up for one, come on down to the front of the chamber and be prepared to go. Chair recognizes the chair of the Natural Resources and Environment Committee, Chairman Lynn Smith, for an announcement. Thank you, Mr. Speaker, members of the House. Tomorrow morning at 8 o'clock in the room, at 6 o'clock, there will be a full committee meeting of the House Natural Resources and Environment Committee. We will hand in to Nix's bill and it's room 6 o'clock. Welcome back to the early times, thank you. Chair recognizes Chairman Bonny Rich for an announcement. The majority caucus will have a meeting immediately upon adjournment in room 403 and lunch will be served. Chair recognizes Representative Dorene Carter for an announcement. Good morning and thank you. Just one to remind everyone to wear red tomorrow. The American Heart Association has asked us to acknowledge Go Red for Women on Thursday. And if you would like to join the representatives of the American Heart Association, we will take a picture on the south steps at 9.38am tomorrow morning. Thank you. Chair recognizes Chairman Steve Tarvan for an announcement. Insurance subcommittee on property and casualty meets in 5.15 at 1pm today. 5.15, say a little bit. Chair recognizes Chairman Chuck Martin for an announcement. Thank you, Mr. Speaker. Your House Higher Education Committee will meet in CLOB 606 today. It's a virtual and it's a hybrid meeting but I encourage everyone able to come. We'll have a presentation from the state auditor. 606 at 1 o'clock, House Higher Ed. Thank you, Mr. Speaker. Chair recognizes Representative Becky Evans for an announcement. Thank you, Mr. Speaker. The DeCab delegation will meet the Zoom today and you can pick up your lunch and room 216 cab. Chair recognizes Chairman Warkhizer for an announcement. Thank you, Mr. Speaker. The Industry and Labor Committee will meet today at 3 o'clock, CLOB 5.06. Thank you. Chair recognizes Chairman Becky for an announcement. Thank you, Mr. Speaker. There will be a meeting of our Coach and the Zoomer Affairs this afternoon at 1.30 in 5.06, CLOB. I apologize for any conflicting information the last couple of days but it is today at 1.30. Thank you. Chair recognizes Representative Jasmine Clark for an announcement. Thank you, Mr. Speaker. Upon adjournment, there will be a meeting greet with members of the Gwinnett Chamber of Commerce and small business owners from Gwinnett County. Right outside on the second floor, Rotunda, all members of the Gwinnett delegation, lunch will be available for you and CLOB 328. Please stop by and pick up a lunch box sponsored by the Gwinnett, Georgia Gwinnett College. Thank you, Mr. Speaker. Chair recognizes Representative Gullett for an announcement. Thank you, Mr. Speaker. We have a Governor-Lafair's meeting today 2 o'clock, 4.06 in the CLOB. Thank you so much. Chair recognizes Chairman Carpenter for an announcement. Creative film will be meeting in room 406 at 3 p.m. today. I look forward to all you fine folks attending. That completes our announcements. The Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 10 a.m. Thursday, February 3, 2022. The majority leader has moved that this House be adjourned until Thursday, February 3 at 10 a.m., all those in favor of the motion. We'll say aye. Those opposed will say no. No. The eyes have it in this House stand adjourned.",
  "updated_at": "2026-02-13T07:09:38.176657+00:00"
}