{
  "video_id": "nwrfrr1O0ZA",
  "url": "https://www.youtube.com/watch?v=nwrfrr1O0ZA",
  "title": "10/16/23 Senate Study Committee on CON Reform",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 156,
  "summary": "Overview:\nThe Georgia Senate Study Committee on CON Reform held a session at the Memorial Health facility in Savannah, Georgia. The session featured remarks from Senator Ben Watson and a representative from Memorial Health, highlighting the importance of the healthcare industry and the role of the hospital in the local economy.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Senator Ben Watson provided an overview of the Savannah area, highlighting its population growth, major industries (manufacturing, ports, military, education), and economic importance.\n- A representative from Memorial Health, a major healthcare provider in the region, discussed the hospital's role as a Level 1 trauma center, its children's hospital, and its economic impact as a major employer and provider of charity care.\n\nVotes:\nNone detected.\n\nAttendance:\nQuorum was present, with some committee members joining via Zoom/WebEx.\n\nAdjournment:\nThe transcript does not provide information on the adjournment or the next session date.",
  "transcript": "but use it wisely to make great decisions for the people of the state of Georgia that every heart be open to change, positive change that would benefit to the people of Georgia as well as America. Thank you for safe travel here and for, thank you Father for the blessed of the state and every aspects in Jesus' name, Amen. Thank you, Mr. Chairman. Thank you all for joining us here this morning live and for those of you that are joining us via Zoom as well. I know we have some committee members that will be having come in via Zoom or WebEx in just a few minutes as well. So recognize them when they get here. Before we dive into our agenda this morning, I do wanna recognize Dr. Chairman Senator Ben Watson. I'm gonna share a few words with us about his home city here as well as the place of work that he called home for a number of years. It is, thank you, thank you Chairman. I was just telling Chairman Horvason that I had just stopped going to the hospital after about 34 years here at Memorial, still do private practice outpatient care and my badge still works. I was really happy about that this morning. Just about Savannah in our area is that if we remember back a few years ago from a population standpoint, there are only two areas outside of Metro Atlanta that grew and kept up with the Metro Atlanta area. One was Columbia County, which is just west of Augusta and the other was our Metro area here, Effingham, Chatham, Brian counties. Those grew and actually my district I had to give up because I had grown more, my district area had grown more than the Metro Atlanta area. The rest of the coast, believe it or not, down south of us did not grow. They actually had a little bit of a negative population from that standpoint. So a little bit of a clarification there. Savannah itself is booming from that perspective. Our tourism is about 14 million a year, about a third of those spend the night, a night or two. We have large manufacturing presence, 12,000 employees at Gulfstream and we're about to pop down another industry about the same size with Hyundai and North Rhine, which is our Metro area. So that's probably it's gonna have 8,000 on site and about total of about 16,000 in our area go all the way up to Canmer County, which is a matter, goes down to Liberty County. These are suppliers and Tier 1 suppliers over at Effingham County and so forth. So the area from that perspective, manufacturing is a major industry. Everybody knows about the Georgia Ports Authority that goes down to Brunswick with the largest roll on roll on facility in the nation. We are the third largest container vessel here in Savannah, specifically New York, New Jersey and LA Long Beach is larger and we're number three. Probably will overtake one of those in the near future. I know that the George Port State of the Port addressed us last week and he's talking about being all in and being progressive and you know, we have had a lot of things going on with that. Military is another major industry here in our area. We have 37% of all active duty military in the state of Georgia at Fort Stewart and Hunter, which is our Metro area. Education, another major player in our area with scad with over 10,000 students in the city. Been a major renovator of historical properties here in our area. Of course, Georgia Southern Armstrong with the Medical School coming on board in the near future and maybe more in the future relating to that. And then Savannah State, of which the Lieutenant Governor is touring here in a few minutes and is a very important cop. we can bring up a list of제를zamdust and then dishing across the three quarters of the 24th year we will include four teams of thirty-three insiders and five employees of the upper rising pocket working here. Are you ready? OK, I am midnight, total manager, I am cast備 and you you you you or who I'm going to have to go to the community. And one of the things that a lot of communities, you know, the communities all the way, you're always looking for the same thing. I don't care what community you're in. People won't get quality of life and that is always centered around job opportunities, educational opportunities, and then also health care access. And so we're taking a good hard look at what our certificate need process looks like right now and looking to make some changes, and but I appreciate everybody being involved in the process, particularly the associations who are both forward and against this. You know, we don't want to try to ramp something through that process, but we're going to have a good time. And I know that everybody at the at the at everybody having a seat at the table. And I know the senator Dose all in chairman here has told me about how well all associations and all the partners that have been working with our office and I greatly appreciate that. And hopefully we'll come out of here with some great recommendations. I appreciate the service all of us. I hope you're having a very special time. You know we have a lot of people on the board who are on the board here, I am glad to be here and look forward to the discussion. Thank you, Governor. Happy to have you here. I drove around this morning I didn't know if I was at a hospital or a college campus due to the size and scope of this facility. from H.C. A memorial forward to share a few words about the work that they're doing here in the city. You can come down right here, please. Well, thank you, Senator. Appreciate the committee being here today. Welcome to Savannah. I can't say anything more about our area than Senator Watson did. That was a great Chamber of Commerce speech. And so I'll let Bert Brantley know that his job may be on the line if things don't work out in the Senate. But no, Bert's a great friend of the hospital and doing great things for our community since he arrived earlier this year. But Memorial Health, as you touched on just a moment ago, is a significant player in the healthcare space in South Georgia, but also an economic factor in South Georgia. And I think that's important for the committee and the folks watching on line to understand. Last year alone, we treated over 280,000 people for some sort of healthcare condition across our various healthcare offerings. And so we truly do serve South Georgia. Our service area is 35 counties. And predominantly, obviously, Chattam County and our close surrounding counties. But we reach out as far as 35 counties, Level 1 trauma center. We have a 92-bed, Level 3 NICU, the only Level 3 NICU in South Georgia, the only dedicated children's hospital in South Georgia with the opening of the children's hospital of Savannah. Just a couple of years ago, we have a number of acute care offerings as well as a strong resident CGME program. We have a great relationship with Mercer University. Our school of medicine is here on campus as well. So in addition to our 150-some odd residents that we have in the GME program training here on campus, we also at any given time have 250 medical students as well that are all going to be committed to serving Georgia when they graduate, which I think is a great thing. So again, I could give a really great commercial for Memorial Health, but with our 4,200 employees here over 800 physicians, we mean a lot to this community from an economic standpoint as well. We pay a lot in taxes each and every year, over $65 million in charity care alone provided last year in addition to that. So we're a good community resource. We're a good community steward, and we just appreciate the committee being here today on our campus. So thank you. Thank you, Brad. I certainly appreciate you hosting us this morning and appreciate it and enjoyed our conversation. We're able to have offline on the topic of CONs. Thank you for your insight. We're going to have four presenters this morning, and there's a sign-up sheet in the hallway for anybody who would like to speak during our general public testimony time. Each of the four members are going to have 10 minutes to present. I would like you to stay as close to that as you can because we do have a hard stop for a few of our members, and then we'll open it up to the committee for any questions, which the Q&A tends to be the most robust and helpful part of this process. So with that, we'd like to welcome up our former colleague and dear friend. He's listed here as Dr. Dean Burke. He'll always be Senator to us. So Senator Burke, you could come forward. And committee members, we have a deck here. I believe there's going to be slides as well for those in the audience who are Dr. Burke's presentation. Good morning. It's going to be with you all. It's great to be in wonderful city of Savannah again. As CEO of the hospital was talking earlier, brought me back to the summer of 1980 as a medical student doing a senior surgery rotation here on this campus. And what I got to do during that month was probably make a residency director cringe because if somebody came in with a laceration, this senior medical student stitched them up. They had a broken bone. We worked them up. And I'm afraid some of that's been lost as we've taken more care to protect patients, which is obviously very important. But we've also lost a little bit of the training aspect of being thrown in the deep end of the pool. I really enjoyed my time here. I want to bring greetings from Russell Carson, the commissioner and department. We've been asked to present a brief overview today of the DPP program, directed pavement program to make sure people are up to date on the changes that have occurred since that was implemented over the last couple of years. We had several sessions with the legislature educational sessions last session to try to let people know what it was about. But now that we have more data coming in and we're required to report every year to CMS the quality aspects and update them on this because this isn't unlike a lot of programs that's required to be updated annually. So I'm going to introduce Cody Whitlock, our new CFO and then just a time I've had several other things I wanted to talk about. But we'll limit that today and then cover in question. I will be doing the closing and have some slides of some rural facilities in this region that I want to highlight what's going on, the good and the bad and the ugly. So Cody, can you introduce your speaker? Thank you, Dr. Burke, members of the committee. Cody Whitlock, the chief financial officer of the department of community health. With us today, two members of Sellers Dorsey, they've been very helpful in implementing the directed pavement program. So I'd just like to introduce them real quick. It's Tonya Boone. She's been with Sellers Dorsey for quite some time, really detailed in Medicaid financing. I believe most of y'all know, Mark O'Wigton, who is with Sellers Dorsey as well. So if y'all want to come up and go ahead and present. Thank you. Great to be here. So this will be a challenge because we have about eight minutes, but I'll try to go through a very complex topic in about eight minutes or so and then turn back over to Dr. Burke. So I'm going this. OK. So I think the most important piece, if I could start, is that directed pavement programs, if there's three things to leave you with. Number one, they are beneficial to providers and to the communities and patients they serve, but it's not a magic wand. So it's a benefit, but it doesn't solve a lot of the financial challenges that hospitals have. Number two, they're highly variable in terms of the amount of impact that these programs are. It really depends on a hospital's patient mix, the services they provide, and ultimately the size of their payments is based on the mothers and babies that they serve in Medicaid, specifically. Number three, there's actually no state general revenue. That supports these programs because of the way that they're designed through provider assessments and intergovernmental transfers by public hospitals. So those are the three overarching statements wanted to make to begin with. The slide here has some of the specifics on directed pavement programs. So the first point is essentially that they're relatively new. It's from 2016 that CMS put out guidance on directed pavement programs. What they are is a state Medicaid agency is able to direct payments through managed care organizations on to providers. So that's what it refers to. Number two, I mentioned this, but Medicaid is partially state, partially federal, federally funded, and these programs in particular are able to utilize provider fees and intergovernmental transfers. So no state general revenue. The next point here, I mentioned as well, these are highly variable based on specifically CMO utilization within hospitals. So there's an add on payment. But the point is that the payments are tied to Medicaid utilization. But at the end of the day, the intent is to improve patient outcomes in those populations. So specifically, mothers and babies in Georgia because those are the populations in managed care. There are essentially five programs that DCH and the state has worked on over the last few years. And we're going to go through some of the specifics on those. So ultimately directed payments are meant to support the policy and goals of the state. So you can see here improving health services and experience and smarter spending. Overall, there are several programs that work in concert with each other. So you all have probably heard about the Georgia aid program that originally intended to support Grady and Augusta University Medical Center, a hospital directed payment program that supports public and private hospitals throughout the state, and then ultimately the Georgia strong program. I will say that also these programs, these directed payment programs serve to free up dish funding to support rural hospitals. So that's another component of the overall program. Okay, there are a lot of words on this page, but I'll point out a couple things. At the top, you see the purpose of each of the program. They each do a little different things and have different goals. There are metrics tied to all of these programs. So there is annual approval by CMS. And they look for an evaluation plan and how the providers are doing in terms of their goals and meeting the metrics that have been laid out. So again, annual approval. You can see here the number of providers, the program size. These are very big dollars. And I'll mention again, the non-federal share component, you can see for each of these programs how they're funded in terms of the state share. Bottom line is the initial approval date. So you can see these have really come into existence in the last two years. Okay. All right. So now we get into the waterfall. So probably heard about that. The idea of this DPP as well is that there is new funding available that then can offset and allow for increased dish dollars to flow to small rural hospitals. So at the top, you see essentially how things looked back in 2022, which is that $493 million are available to Georgia hospitals for dish funding. And there was a set amount that would flow to the small rural hospitals. The small rural hospitals. And that was $76 million. The urban and non-small rural pools essentially the remainder of the pool flowed to them. So in 2023, this looks different and you'll see some of the graphs coming up here. But essentially the size of the pool increased because of primarily inflation. But now what happens is the state decided to move forward with the methodology to completely fill the uncompensated care costs for Medicaid specifically for the small rural pool. And the remainder then flows to the urban and non-small rural pool. Okay. In terms of how the calculations are done, each program is a little different. The Georgia aid program is an individual average commercial rate. There are dollars at risk. So about 10% of dollars at risk. The Georgia strong program is a uniform percent increase. But 10 to 20% of those funds are reinvested specifically in workforce activities. And this was something that DCH and the state really looked to hospitals to be able to report out where those funds are invested. And a lot of the providers are investing in partners as well as community colleges and working on workforce challenges. On the bottom, I just wanted to point out the estimated impact ranges. This gets to the variability. So you can see some hospitals benefit quite significantly. But there are about 53 hospitals that benefit between $15,000 and a million dollars a year. Okay. These are some of the questions that have been raised previously. I'm actually going to skip over this and just point out the formula at the bottom here. And so that we can get into some of the examples. But essentially the important part of uncompensated care costs is there is a formula. And it's essentially Medicaid costs. Then you subtract out all the Medicaid payments, including directed payment programs. So it's Medicaid shortfall. So essentially where costs, Medicaid costs, the cost of providing care exceeds payments. So that's your Medicaid shortfall. The remainder is uninsured costs minus uninsured payments. So that essentially that dollar amount is the amount of dish that you can receive, that a provider can receive. It's also referred to I try not to use a lot of acronyms because there's a ton of them in this space. But HSL is hospital specific women. So that gets to the total amount that a hospital could receive for dish dollars. And the reason why that's important is because there was a change, as I mentioned, as a result from the directed payment programs, to completely fill the HSL for rural hospitals. Now that is only for Medicaid shortfall and uncompensated care for uninsured and low income patients. So what it does incorporate in, and Dr. Burke will get into this, is bad debt. So that is a major component of a lot of financial challenges for rural hospitals, especially, but all hospitals. Okay. So this gets into the dish and uncompensated care costs in terms of the total amount that existed in 2022 versus 2023. So you can see there's a big change from the small rural pool which still had $99 million of uncompensated care costs, again, is defined by Medicaid. And the urban and non-small rule, which was 1.5 billion. Now moving forward to 2023, you can see the impact of these programs. Zero dollars in terms of paying the small rural pool up to what they can receive for Medicaid uncompensated care cost coverage. Well, that's in that's dish. Again, I'll remind folks that there's also the component where a lot of the hospitals pay through their hospital authorities. And as a public hospital, they pay an intergovernmental transfer. So you'll see that in the next slide as well. And you can also see that uncompensated care costs greatly reduced for the urban and non-small hospitals. Okay. This is Dr. Berk will actually go through the impact specifically on some of the small rural hospitals in the area. Thank you, Tonya. And we'll be brief, but I think the map here is a good representation. The blue represents rural hospitals and rural counties. So obviously the stages dominated by those facilities. And again, the hospital finance, and I was sharing that much of that Dr. Watson has now for eight years. And every year I learned a little more and a little more, but I'm still learning about hospital finance and the intergovernmental relationship between CMS and the federal partners that we have. But I don't think it's important to emphasize that the direct-to-payment program results in dish money that is freed up from the bigger facilities because they're hitting their hospital-specific limit. And so that's where that waterfall thing came from. It's that extra dish money gets to fill up the HSL or hospital-specific limit for the rules. And that's a huge deal. It's cash that those hospitals didn't have before this was implemented. But I think it's important to realize that if you look at this slide, the 34th million at the top, that patched area, is the intergovernmental transfers or bed tax payments, depending on whether it's a public or private entity. So this funding is coming from the sales that the beds are matching. It's not a state-funded program. The state has to run it and enforce it to make sure we're hitting the quality metrics. But it's not our money. The light blue represents the dish and the new money is the DPP down at the bottom. And what I'm trying to do today, because we have the rural hospital tax credit that several of you were in the Senate when we passed that. Our former Lieutenant Governor was the house sponsor for that bill, and I was the Senate sponsor. And it provides money to the rural's in the time of this presentation. The last number was 58 million. Which is, again, a great thing. But what's important to realize in this slide is what I call the big picture. Those three buckets on the left represent the DPP and the dish money and the rural hospital tax credit money. The other three columns are the bad debt, instant care and charity care numbers that the rural still have. So I think it's really important to understand that, while that extra $30 million down at the bottom is great for those facilities. It doesn't come anywhere close to making them hold from the standpoint of their financial struggles. And these numbers are presented every year. They have the rural hospitals to participate in that rural hospital tax credit. They have to produce audited financial statements. So these numbers are coming from that program because they have to keep at least a 10% short file to be eligible for that rural hospital tax credit. The question was, okay, would DPP make a big dent in making those people not be eligible anymore because financially their whole so to speak? And the numbers bring out what the rural hospital CEOs tell us all the time. Before DPP, their indigent care, charity care and bad debt was about 30 represented on average across all the hospitals, about 34%. And after DPP, it's down to 31 to 32%. So while it is a new money for rural hospitals that are desperately needed, I think these slides represent well the fact that the other programs that we're providing for rural hospital where that's the rural hospital stabilization grants that are out there, the rural hospital tax credit. All of these programs are necessary and I would argue as someone who spent the last 30 years working in rural hospital in the last 10, being an executive in one, we would have a lot more work to do to stabilize those facilities if we want them to remain open and provide a safety net for those people that are living in rural Georgia. And these slides here are just...\n\nwhich represented the same thing that I won't go into because of time. But I did want to show a couple slides showing the actual facilities in this region. This is one from Liberty Medical. And as you can see, that represents $17 million. A huge number of people don't realize. Evans Memorial, I think they're here in the room. This is their numbers, again, very similar. Phoebe Sumpcher, and this is for Freddie Pyle of SAMHSA, is not here at Center SAMHSA. It's always interested in her health care facilities. We had numbers of conversations about that on the floor of the Senate. And again, this is their Phoebe's facility in Sumpkka County. America's not too far from the Department of Harmony since the American Food and Little Bit South. But again, showing the same picture. And then Miller County is another one of the Senator Sands. Miller County's unique and George, they have a program where they do respiratory support, ventilator support for patients that are long, long, long term ventilators. And their facility is from a financial standpoint, although you can see they still have issues. They're probably in the top few stable rural facilities based on their program that they develop. They actually have patients there from all over the country that can't find a place to serve these patients that are long term ventilator. In Mitch County, again, another facility in Durham. Sims is district and. He's got a lot of rural counties, which he's got a lot of rural county hospitals. So that's the end of the program that I do want to answer questions. And I know this is a CON hearing and department is ready to implement whatever the legislature and the governor decides at the end of the day on what needs to happen. We want to make sure you have the back is in regarding to the management of CON, which is the department of community helps statutory role. We want to make sure you're making decisions based on good solid information and ready to partner with y'all in that regard. So glad to answer questions, Mr. Dr. Bergen recognize Senator Karpachry. Thank you so much for trying to simplify a complicated issue. And you may have to dumb it down a little more because I'm going to repeat the sort of so. When you refer to bad debt, is that include amounts that are not paid by insurance that are that are billed? So in other words, deduct tools, co pays, things like that. Is that included in that bad debt? That number and again, I'm not, you know, the expert on the financial side of these folks over here probably can help me with that. You know, we know that even if you have the best insurance, there are dollars that the patients are responsible for. So these, these would be dollars that the patient is responsible for that they're not paying, whether it's co pays deductibles, non insured, you know, whatever. All goes on that same bucket. Okay, and then just follow up. I've been looking at the GDAC dashboard on charity and in the care. So now I'm really confused about the uncompensated care. I'm not sure how those definitions all fit because I don't know if everyone understands the formula because when I'm looking at it, it's all over the map in terms of what different hospitals are doing. So maybe I should have some hospitals. Well, they can speak for themselves, but you know, it is complicated and you know, all of these formulas are truly can be different. So you have to really dig down to be sure that you're comparing apples to apples and when you get these, these numbers. I think that was a lot of the confusion last year about, not last year, but during the last session about the uncompensated care being made whole. It is for Medicaid. So Medicaid as a program is generally 70% of a Medicare rates. So it's lower because it's supposed to be a safety net. It's not supposed to be as robust a program. But most facilities and again, some of them are here. We'll say that they lose significant amount of money on the Medicaid patient when you add up all of their costs. So even though you're a whole Medicaid, it doesn't mean you're not still losing money. I think it's the way to put it again. They're better off on you know, my hospital, I think it's around $600,000 from DPP, which is, you know, great new money. We didn't have before the $600,000 when you're losing $6 million a year is, you know, I mean, it is not making you whole is it's a, you know, it's a benefit. It's money. We didn't have the goal. It is not the solution to rural health financial instability. Terrible. Thank you. Chairman Burke or Dr. Burke appreciate that. I still consider you part of the Senate. I know you've known to the executive branch, but we certainly appreciate what you're doing there. You could just sort of follow up and give us a definition what the bad dad is, but it helped me understand it. So the rural hospitals are made whole from a Medicaid standpoint and of course, Grady and AU and the 22 teaching hospitals from a Medicaid standpoint. They're all made whole because if I remember correctly, Medicaid pays maybe 70% of actually what it is. They're being paid at 120% or whatever the commercial rate is. And then Medicare may pay 85% of actual calls or so, but it is the private portion that serves most of the hospitals that makes up for the rest of the the indigent care. But that that is certainly a windfall and that bad dad has been there for years. And this is a little rambling from that perspective, but you know, there's sort of the second part of the state. If you question other states like Florida and Texas and South Carolina just did away with CLM. And some of those don't even have DPP from what I understand. So I was just wondering the comparison and contrast there. I think it's, you know, you explain it correctly in that it number one is it's very complicated. And the aid and strong problems are much more financially robust. And from the standpoint of comparing them to what the rural hospitals are getting. And I think that's what I'm trying to emphasize is you can't pay the hospital industry with one brush because the financial issues that pays for the rural facilities. And mainly it is just patient mix from the standpoint how much commercial care they have. And generally speaking most of them have anywhere from 70 to 80% either Medicaid, indigent or Medicare and very little 15, 20%. Commercial, whereas if you flip that model, if you happen to live in a suburban area of Savannah or perhaps in Augusta or Atlanta, you know, those hospitals have a much more higher number of commercial patients. And therefore their financial situations a lot more stable. I think to the degree that this has anything to do with sealant and I'm not sure it really does is it's a matter of making sure that the committee understands that the program, the DPP program, not solve all the problem. And where I'm coming from is again speaking for rural Georgia because that's one of our responsibilities and the agency is to we are kind of the heard people they call when they can't make payroll and say, hey, we need help and just want to do guys to know that DPP does not solve that problem. They still have a lot of facilities that are having trouble with their cash flow and the DPP did not solve their financial worries whether that has any influence on your decisions about seal and or not. I think it's each person can decide to themselves. Yeah, I want to let her speak to the bad death question, right? And even then, you know, I've heard it 10 times. I'm still not for I had here several times to. Yes. And by no means an expert in this area and we can follow up, we can help these each follow up on this, but in general terms, bad that is when there's an expectation of payment. That means there's some agreement made, there's some insurance, there's an expectation of payment and then ultimately, folks don't pay. On the other side, uncompensated care, indigent care, charity care, there isn't an expectation of payment. So that's just a little bit of a difference there, but we can follow up on the specifics on that. I also wanted to answer the question on on Florida, Texas, they actually do have pretty large directed payment programs are relatively new, but they do both have. I think they're both in the three billion dollar range now for Texas and Florida just to give you some. And I'll be over number is about what's our big number one point to one point two compared to three billion free one of them and they neither of those have CON ledges. They're CON free states, correct? That is that is accurate. Texas does not have CON. And Florida just got a three point five. Three point five billion. Yeah, so that's their that's a new program for them. So they're following the lead and maybe we'll be following their. I do have a question for one or two of you who would be able to best answer this, but of the 55 hospitals who are eligible. Did any of it. I'm more so concerned with net net proceeds, not 12% right? Because I think that what Dr. Watson was getting at was this bad debt was has been priced into the business model probably for decades, right? And that's an expectation in terms of the financials of doing this as a real hospital has DPP. Inverted any of that in other words, do we have hospitals who were losing money who are not making money because of DPP? Do we have hospitals and we think we're on the verge of bankruptcy? The 60000 or whatever number may be has changed that or what is essentially the thesis that you're putting forward. This is more so something that has impacted gradity to teaching hospitals and larger urban hospitals much more than it has the rules. Yeah, I would say the latter is true now. I think the final numbers for the for the real hospital tax credit program to know if any of the ones that are eligible this year have had enough benefit, whether it's coming from this program. You know, they're all constantly trying to improve their service line what they're given to their customers. So it's not like they are not trying to improve their bottom line, whether it's DPP or not. I want to mean that all of them are trying to find out what can we do tomorrow that we're not doing today to make our business model better. So I think it's important to realize that part changes every year, the number of facilities that are in the black or in the red. You know, if we'll wiggles and wobbles, I mean, it's not the same constantly. I would say that's probably again a little different for those hospitals have better payermakes that are kind of every year they're going to make some money in the rules. It's there much more sensitive to what might be going on. I mean, if you have a facility that's doing a loss later and charging almost nothing for MRIs 30 miles away, then that may be the only service at this rural facility that's actually making a margin on all that goes away and all of a sudden they go from being in the black being the red, you know, overnight on us. So I think it's important to realize that we will do the math and we will determine how many of those 55 or continue to be eligible. The margin by legislation was 10%. So they have to be over that in their uncompetated care of, indigent care on those three buckets or what we measure, we add them together and that's the thresholds at 10% number. And I'm fairly sure if we have any that are moved into the not be eligible for that program, then it'll be just a couple. It won't be like half of them or anything. And I know from the travel that I've done in the last, you know, 10 years, there are a lot of CEOs that said without the rural hospital tax credit, they'd already would have closed. I mean, that program, I think, saved number of rural facilities. And it's important to realize that's a, you know, we've we bumped the number of some extra year will be a little more money eligible and that that's almost twice as big as the. Yeah, it's a big when it comes to the actual dollar. Right. Okay. Thank you, Mr. Chairman. You did one month calling chair, Dr. Burke, and this may be a question for some of the folks at sellers to a couple of points for the bad debt and the nginj and charity care. Are we using like the state statutory definition that you all set for how this calculator is the IRS definition or is it bill charges? I think it's the what's in the statute because that's where these numbers came from. So we're on hospital tax program that the folks in cordial and in the department of revenue work together to determine those eligibility. Right. Second question, I say anything that's not accurate. Second question, you know, we have a five part, you know, DPP at this point, are we limited into further approaches of the state wanted to take a look at enhancing this more. And we used to talk about you P L headroom is the hospital specific limit the same concept or is there more that the state could do. So the short answer is possibly so there is a proposed managed care rule in front of CMS right now that is considering. So we're going to have a couple of different types of data that are happening. The size or percentage of directed payments as a percentage of underlying managed care. So right now it's it's around the upper. Catholic man that CMS is considering so possibly depends on what happens with the managed care rule. And that was my third question is do you think that there's a risk to CMS looking at does because they have exploded across the country. So programs have grown quite exponentially and what CMS is looking for is really return on investment. So how are patient outcomes improving in the populations that that the payments are based on. So in this case again in Georgia it's it's moms and babies and Medicaid. So they want to see that that patient outcomes are improving. So I think to the in the reason why there's annual evaluation and approvals is because CMS wants to see what's happening. Are we moving the needle on some of these outcomes and benchmarks so potentially. We follow the question of that. You hear me okay. I understand it correctly. This this program which has evolved and particularly changed as of last year. Is it approved on an annual basis from from CMS? Yes. Okay. They're depending on the program and again that fly that had all the boxes has a little more detail about that. But the program that Brady's eligible for you know has a callback you know 10% at risk. Some of that money can be pulled back if they don't hit the metrics that are determined. But CMS does require it's one of these new words that I've learned this year. So we have to send them you know what the the data shows for each program. And then they have the option of asking questions or saying sorry you know you're not getting what you need out of this. And we're not going to prove it so it's calm. So it is at risk for each each program though is measured separately on the merits of that particular. So just the bucket of funds though overall that you're just reading does that does that wax and Wayne based on what CMS approves. We have because it's you know the formulas based on what they do with that. Okay. That's CMO managed care volume so that can can change with any facility any any given year. Ultimately denominator is how much Medicaid actually flows through that facility. The reason for my comment my question is really just representing hospitals many in the audience here is if we're very grateful for that program. Being a CEO and a rural based hospital it has been very helpful. And has given us the opportunity to look at different things to ensure that we're looking at our viability our health but also programs that are important for the community that we serve particularly women's and children's labor delivery. With regards to where we're by daily closest labor and delivery center is about 50 minutes in any way direction. And so it's important that we continue to be able to provide those services and this has been a helpful in doing that. I think from a hospital perspective knowing that this is not a one and done type program but it's something in perpetuity is helpful in planning. Well I think from the department's standpoint that you know we have absolutely no interest in doing anything but making us robust is the federal government allowance to be beyond that. Anybody's guess. I recognize that. I'm watching for last question and we're going to the next time. So just just to follow up the claw back for. Grady and. MCG is that's that's a quality metric isn't that right and then and then the claw back from rules is on workforce development. That's the measurement there they're being measured against but it's not there's no claw back on that. So it's just a measure to see the answer. And I mean but isn't that isn't that a good thing that the federal government is doing I mean requiring quality for this windfall and and requiring workforce development. I mean that's in that sort of what we want to do I mean we want to stress quality. And that's what I think it's important to especially the rural areas as far as where I come from I think it is very very important that we shift as much as we can to the outcome based so there's no problem from where I said I'll. I mean from a physician or patient standpoint I would I would want that to be quality driven and workforce driven and and I mean I'm not beaten up on anybody but you know shame on us. I mean I mean if you can't deliver the quality of the workforce that you're asked to do because those are both needed in your in your hospital and in your community so renewal would be based on what you're actually doing you know for your patients. And if we implied anything otherwise it was not meant to be it's just that this is different because most plant amendments that we submit are for five years I mean that's that's the way to see a mess normally does so this particular program is a little different. It is it sounds different every year sounds almost you know me sounds good yeah I mean that's that's a good thing. I would certainly not want to hear any complaining about that. I think we all for making the trip and I think each time we hear about this we learn a little bit more so it's helpful to see this thank you for this packet together I'm going to give us these. We're open for any written questions or anybody that need to further information but sure you just let us know thank you. Thank you so much. I'm going to recognize Katie Chug. I'm going to go to the next. Good morning my name is Katie Chug and I'm the founding director of the Augusta birth center no PowerPoint presentation for me you're just going to have to listen to this British accent. I'm going to go to America with a hundred dollars and the pursuit of the American dream in 2009 maybe not the best year to move here. I open several successful small businesses that my eye was always on the price to open the most incredible nonprofit birth center in Georgia. I wanted a place that could offer birth postpartum annual checkups women centered care mental health fitness and nutritional support all under one roof. I'm going to go to the next budget we would take Medicaid and utilize brand writers to make us Augusta especially the safest place to give birth in Georgia. Unfortunately we're unable to open a service mothers and mothers to be because my quant application was not approved. I sat for months and wrote 826 pages. I got over 500 written statements from members by community including physicians nurses surgeons politicians saying that this was so needed for a guest. I did not fail at the con in fact Department of Community Health said my application was a success apart from one rule which I was unable to fulfill. I could not obtain a transfer agreement with local hospitals. They did not want to partner with me because a transfer agreement would stop me from opening. They've stated this publicly through the local commissioner and Augusta branding Garrett and they've stated it on the con opposition which is publicly recorded in our file. When we had our opposition statement meeting where the local hospitals joined us and the Department of Community Health on the phone. The hospitals freely and openly admitted with signed documentation that they they will have not and will not be providing a transfer agreement effectively exercising a competitors veto against the law. You can imagine my surprise when after several meetings with the formerly named University Hospital leadership to determine the terms of our agreement. Having their labor and delivery department on board it was denied outright by the hospital's legal representative. You can imagine my even deeper surprise than just this past week two years later. A lobbyist leveraged a brazen lie to make it look and appear as if we had rejected a transfer agreement. Women of public statements across the board from every hospital and why they would not provide us with one. Not only in the corn proceedings but also in press comments when asked for comments to any comments that Augusta birth center has made. So why the hospital is threatened by a small family run business where minority owned veteran owned woman owned. We have documentation and proof of our hospital communications because like any good millennial woman I go from my attorney and my attorney communicates with the hospitals. Pacific Legal Foundation which is my legal representing firm has all the documentations to prove this lobbyist lie is completely false. The revelations suggest that certain elements in the corn were potentially manipulated allowing established entities to exert monopolistic control over the health care market in the region effectively eliminating any competition. Such monopolization is emblematic of interest violations were a single entity or coordinated entities. This is a type of competition to dominate a particular sector. Essentially the cons used to inadvertently or perhaps intentionally granted existing competitors of veto power over new entrance further solidifying their market position. When we brought these potential antitrust violations to light during our role waiver submission to the corn our concerns were unfortunately dismissed. The scenario and discourse how established entities can exploit regulatory framework like the corn to maintain and amplify their market dominance. We have never not wanted to work with the hospitals in fact several of the local hospitals based with the OB practices currently sit on my advisory board. We came up with a workable solution for our maternal health mortality prices. Our birth center wants to take the low risk patients to take the pressure off the overworked OB guidance and allow them to focus more on complex cases to direct their attention. A COG states on their professional documentation that the safest place to give birth is accredited birth centers and hospitals and they stated this in 2019 and have continued to state it every year since to this day there has not been a maternal or fetal death in the state of Georgia at a birth center. I was inspired to move forward with my mission to build the Augusta birth center following my labor and delivery at the Atlanta birth center. The care I received there was like nothing else that experienced in the United States. It's hard to describe the comfort and care that my husband and I experienced contrasted with the cold environment I had at the hospital for my second birth. The staff let me share my opinions. I was told consent over coercion and I expressed how I wanted to carry and deliver my baby. Since I began this journey opening the birth center I received endless support through the Augusta community whether they are medical professionals mothers or mothers to be there's not a single person who said to me we don't need this. Our website makes it clear that we're not open yet every day including five minutes ago I received messages from mothers asking when are we going to be open what options are there for birth. Sadly I have to turn everybody away. Through my current four businesses I'm currently reminded that it's great needed in Augusta. The solution I ask of this committee is simple and for the legislators a whole is straightforward remove the cone requirements for a susceptible facilities so that I and others may open birth centers to better serve women who feel and deserve by their current communities. And yes I do have a solution for rural health care as well to get obese into those communities. I don't want to be the worst state. I want to be the best. I'm very very pro Georgia for someone who immigrated here we are considered to be a pro life state but we have one of the worst maternal mortalities without any sort of change women are going to continue to die and we've seen that happen this year already. Women want more options and choices they want consent they want to be able to voice their opinion. We are currently worse in maternal mortality in Augusta and Syria and Cuba so we're worse than a third world country at war. Because of the lack of options for birth in our area I still have to send women to local hospitals despite the opposing me. I know this is the only place for them to give birth besides home birth but speaking of home birth because we don't have a viable option for alternative birth women are traveling to South Carolina to use birth centers because the three Georgia locations are too far and I know that I drove two and a half hours in labor. So now not only we are unable to care for women we're sending women into South Carolina who is since completely reform their con laws so that brings profit into South Carolina. On top of this we now see midwives coming down from South Carolina to Georgia delivering babies in Georgia and billing in South Carolina. You might not think this is significant but with hospitals suffering and already closing how much more can we afford to reject. Another fact that concerns me as a special needs foster parent is the fact that some people are choosing to have unattended home births to avoid hospitals and past trauma. Georgia this they do not register the birth with a state for fear of repercussions and essentially we're now losing track of children who might need services or support. My case is just one example of where the economy is to be reformed entirely. The law works as a framework to support existing healthcare networks regardless of their intentions and to push out competition. When that framework is threatened the lobby will straight light your faces or your representatives to maintain that system. If you want to improve the healthcare and rural communities of Georgia a billion dollar hospital investment into every one of them isn't going to help. As evidenced by the 15 hospitals that have closed in the past few years. What will help is removing the road blocks in place that keep enterprising local individuals with innate vested interest and improving our home and doing anything.\n\nabout it. Thank you very much for your time and I welcome any questions you might have, including about the certificate of need procedure itself, because I think there's any two of us in their room that have filed one. Thank you, Ms. Chum. Any questions to comments from the committee? Dr. Kepashak. My question is so that the crux of your issue was the transfer agreement with the hospital. Correct. But hospitals operate under MTALA. Yes. So they have to take the emergency patients, right? Yes, and I did bring that up in my role waiver through my attorney and Department of Community Health insisted that their rule was the one that had to be enforced. I understand MTALA is a federal regulation and I understand Department of Community Health's regulation was only for Georgia's certificate of need. And my role waiver actually went above and beyond, in my opinion, to fulfill this transfer agreement, I got a agreement with a maternal fetal medicine who have privileges at three hospitals. So I could transfer through her and have a maternal fetal medicine who is incredibly talented at looking over any patients I need to transfer. And that's better than any transfer agreement that's currently standing. But they still denied that because they said that I had to fulfill the rule as it is written, which is Augusta Baracentra has to be able to transfer to a local hospital directly without using a maternal fetal medicine who would be the doctor carrying for any transfers. I also gave my patients choices of which hospital they wanted to go to instead of just transferring to one hospital. So you know other questions in the committee, Ms. Chubb, thank you for your testimony. If possible, would you mind providing that in writing so that we can share that with the committee as well? All right, thank you. Next, going to recognize Anna Adams, Georgia Hospital Association. Thank you, Mr. Chairman, members of the committee. I'm Anna Adams, the Georgia Hospital Association, and I'm excited to be here before you today to recommend some changes to streamline and modernize the certificate of need process, which we believe will make it easier to get a CON if one is required and remove some of the requirements of CON in some cases. We have, as you all are aware, had a CON created work group. Throughout our membership, we have 19 members who were appointed as work group, and we've brought this before you and our first CON meeting where we talked about the purposes of the group who also adopted it, et cetera. This has been a really robust process where we have looked at CON talks about and talked about the different areas that CON impacts, and I'm very excited to talk with you today about the 14 recommendations that we have that impact, not just hospitals, but all healthcare providers across the spectrum. We have a total of 12 meetings, and I am pleased to report that at our final meeting, the GHA Board unanimously approved these 14 recommendations that we'll go through today, and I have shared with you all a separate document that looks like this. I think you have it printed that goes into more detail on each of these recommendations talks about the reasoning behind each one and what kind of impact it's going to have. The GHA position, currently, on certificate of need is to streamline and simplify the certificate of need process. This is a very different position than we have brought before you in the past. Previously, our statement said to protect the current certificate of need process. It no longer says that. At this point, it talks about supporting the state health planning process to ensure access to all healthcare services. That means services that run the gamut from labor and delivery to emergency department services, imaging, surgery, etc. We want to make sure that patients have access to every individual type of service, not just an abundance of one service in particular. Our goal in this study group was to focus on access to care while improving quality and safety. What is CON? I think it's important just to kind of highlight what we talked about within the group. It is a community-based health planning process, which was really the focus of a lot of our discussions, and ensuring the appropriate allocation of healthcare resources. We don't want one part of the state to have a ton of healthcare services while other parts of the state still have healthcare deserts, especially for specific service areas like labor and delivery. We want to make sure that the committee members understood that it requires providers to demonstrate a need within their communities, so very much a community-based focus. The current OCGI-stated purpose of certificate of need talks again about ensuring access and making sure that those are available to all citizens. Finally, I just wanted to highlight again some of the hallmarks of our discussions within our CON work group, ensuring access to comprehensive services, resource application, promoting charity care, which I know has been a focus for the group, and encouraging public input facilitating planning and policy, etc. So with that, I'll jump into our recommendations. So the general outline of our recommendations is again to encourage policy makers as you study the certificate of need program that any modifications to be considered in the context of the state's entire healthcare system, so not just in a vacuum. Many of the recommendations that we have are complimentary to each other and working concert with one another, but each of them provide greater access to care by streamlining the process, making sure that it is easier to get a CON if one is required. So our recommendations to the regulatory process, there are four here that coincides with the larger document that I have. The first being updating the state health planning process at least once every five years. Many of the state health plans are 20 years old or more, and so when you think about having to get a certificate of need for certain services, those guidelines are incredibly outdated, so our recommendation is that these be updated through the department at least once every five years. This would involve a first informant and update to each of them individually just to get them up today. This is going to have an impact on physicians, surgery centers, hospitals, each of the communities individually, so it's not just a hospital benefit. The second here is limiting opposition to in-state entities who service areas substantially over labs. There was a situation last year where an out-of-state entity opposed a certificate of need application in the state of Georgia, the department through regulation disallowed that. We want to make sure that that becomes a part of the statute so that any changes of the department later on don't allow those out-of-state entities to come back in and oppose. The third recommendation on the sheet is eliminating the certificate of need appeals panel. There have been a lot of discussions over the years about the burdens of the appeal panel, what that looks like, how difficult it can be and how challenging it is to navigate. So our proposal is to move those administrative hearings to the Office of State administrative hearings. It's a much more streamlined process with judges who have staff who are experts in this area, which will eliminate a lot of the headache from any of the applicants. And then finally, limiting the commissioners' review to 30 days. So this really speeds up the calendar for what it takes when you are applying for a certificate of need if there are appeals and oppositions. Our second set of recommendations is pertaining to thresholds. The first is eliminating the capital expenditure threshold for certificate of need. This applies to all provider types for construction-only projects, which means that it would not apply to a brand new service line that requires a sealant that you do not already have. However, if you want to do any kind of addition to your facility that is construction-only, that expenditure threshold would no longer apply, so you would not be required to get a certificate of need from the state under this recommendation. Further, the second recommendations under threshold is to eliminate the equipment expenditure thresholds. So same for Mrs. The Previous, threshold recommendation only it applies to equipment. Again, this applies to hospitals, physicians, freestanding imaging, and there's a little caveat at the bottom that you'll see there related to imaging centers that were grandfathered prior to the 2008 legislative changes. There was a pretty robust certificate need change in 2008 that carved out some of the imaging centers, this kind of streamlines, and makes them all unanimous. Treats the most same. Hearing needle services is one of the recommendation groups that we had probably some of the most robust discussion within our CON work group. And we think that this recommendation is going to have a pretty substantial impact on maternal mortality as you all are discussing solutions in that area. So first and foremost, from a perinatal services perspective, GHA feels that increasing access to pre and postnatal care in Georgia's maternity care deserts really impressed the state, specifically in those maternity care deserts is going to have just as much, if not more of an impact, then certificate of need to ensuring that those women in those areas have access to their services. So increased financial support for obstetricians, certified nurse midwives, and family medicine practitioners is an important piece of this recommendation. It's not specifically a certificate of need recommendation, but these all have to work hand in hand in order for any of these viewing recommendations to work. We recommend expanding access to telehealth services, for maternal care services, and then optimizing scope of practice regulations to maximize access to safe and affordable care for women. The final recommendation in the perinatal services piece is related to tour reform measures that can ensure providers will safe to practice in these varied settings. GHA has made a couple of recommendations related to tour reform so that these providers do feel safe to go to those rural areas to deliver babies and those rural areas have the ability to recruit those providers. If those four items are addressed, then GHA recommends exempting basic OB services from the certificate of need process. This includes labor and delivery and nurseries that go along with them. That would apply to hospitals and we would recommend revising the licensure standard to ensure that quality and volume standards are met with the sealant exemption. Our next set of recommendations is about new exemptions to the Certificate and Me program. The first is expanding current exemptions to allow closed facilities or service lines to reopen within 24 months. Currently, the Certificate and Me law allows you to reopen within 12 months under your same Certificate and Me. This wouldn't double that timeframe. The second recommendation is a new exemption to allow health systems to transfer existing beds or services from one hospital or campus to another existing hospital or campus as long as it's the same service in the same system within a 10 mile radius. That seems really complicated and there are a lot of caveats there but it is meant to address patient flow from facility to facility if one facility is at capacity and another has available beds and you are within a closed proximity, you would be able to have that flexibility to move those beds and services. The third recommendation under exemption is to expand the current exemption to allow existing hospitals to increase their bed capacity by the greater of 10 beds or 20 percent every three years if the hospital has maintained at least a 60 percent occupancy rate for the previous 12 months. Currently, the percentage is 75 percent and it's also a two-year timeframe. What we've done with this is made it easier to add more beds but we've extended the timeframe to reduce some of the burden on the Department of Community Health. We know that the department has a lot of applications, a lot of people coming to them for certificate of need and letters of determination and so this kind of frees them up to manage some of the responsibilities that they have. And then finally, expanding the current exemption to allow healthcare facilities in urban counties to relocate within five miles of the existing facility. In a rural county today, you can relocate a facility anywhere within the borders of the county under your same sea of land without having to get a new one. This allows urban counties to do it within five miles. They can currently do it although not all the way to five miles. Another area the group spent a lot of time discussing is psychiatric and sex-reservative services. We may be spent an entire meeting going through all of the various challenges related to psych and substance abuse and not just for the hospitals who offer psych services but for those who have emergency departments and see those patients in their ED setting. And so because of the robust and very complicated nature of how we offer psych services in the state of Georgia, we are recommending that any changes to psychiatric and substance abuse services be treated separately from the final certificate of any recommendations because they are so complicated. Psych right now is overseen in a dual capacity by both the Department of Community Health and the Department of Behavioral Health and Developmental Disabilities depending on the facility type. And there are very robust challenges with how those services are being offered and what the hospitals are facing with regard to those patients and making sure that they have access to those services. So first and foremost, the recommendation is to expand access to crisis services to stabilize the behavioral health safety net. Under the Department of Community Health category in their responsibility, the recommendation is equitable access to services in Medicaid fee for service and manage care programs because they are treated separately. Enhancing Medicaid payments to fully cover the cost of care that includes patients who are sitting in an emergency department setting, waiting for bed placement in a private facility or in a state owned facility and creating a new Medicaid Directive Payment Program as you all discussed earlier with Dr. Burke for psychiatric hospitals that are private. Under the Department of Behavioral Health and Developmental Disabilities section, we're going to recommend creating sufficient safety net capacity for crisis services to serve the needs of all publicly insured and uninsured behavioral health patients. These are the patients that often board first in a period of time in hospital emergency departments without access to those psych services. Enhancing payments for state contracted inpatient psych beds to fully cover the cost of care and establishing a direct funding mechanism to reimburse hospitals for the cost of boarding behavioral health patients in the emergency department and transporting patients to emergency receiving facilities. Once the behavioral health safety net is stabilized, GHA will recommend a new exemption for inpatient psychiatric and substance abuse beds provided that those new expanded beds be included in the DVHDD inventory to treat uninsured behavioral health patients in crisis, which means that if you were to get a certificate in need exemption for those new behavioral health beds, the state include those beds as an option for patients who are uninsured to be able to be transferred to while the state pays for those services in those beds. And then our final recommendation is related to the statutory organization that the statute has been updated multiple times since it was put into place and it has at this point become very complicated. It's cumbersome. You've heard from a lot of people testifying and I think there's a lot of confusion about what the certificate in need law entails, how to navigate it. And so our recommendation is to completely update chapter six of Title 31 to streamline the statute, make it easier to understand and easier to follow. We feel that providers at this point may not apply for certificate in need because of the confusion in the statute. And if you don't have an attorney on staff, you can help you navigate that process. It's incredibly cumbersome. And so we feel that rewriting the statute will really help with some of that confusion. That completes our recommendations and I am happy to answer any questions that you may have. Thank you, Miss Adams, I recognize Chairman Harrison. Thank you, Mr. Chairman. Under your exemptions and recommendations, the closed facility is part of it. For instance, in Moders, Umat, Georgia, that facility closed, regular hospital closed, and now serves psychiatric patients. This would theoretically give them a chance to reopen if they sold us out under your first exemption point within 24 months if they sold us out to do so. Is that right? If a service line has been closed for 24 months or fewer, this recommendation would allow them to reopen without going through the same certificate in need process for the same service line. So for example, if there were a hospital who in a rural area happened to close their labor and delivery unit and it had been 36 months, labor and delivery is not a great example because we're recommending an exemption for that, but psych services. Then after the 24 period, you would have to reapply. However, we've recommended so many changes throughout to who can oppose a certificate of need, making it more difficult to oppose eliminating the ability to oppose that it really kind of works hand in hand. You would theoretically be able to apply, no one would oppose and we would be looking forward. And secondly, if I may, Mr. Chairman, that 10 mile radius would be dropped from 35 to 10 that you're recommending. You suck them bullet point transfer existing beds from one hospital or campus, etc., etc. And within a 10 mile radius of the original location, is that currently 35 miles or? It's not right now there is no allowance to transfer beds from one facility to another. I think what you're referring to is the ability to oppose, which is the 35 mile radius. So our proposal is to keep the 35 miles radius for the ability to oppose, but then adding to that a substantially overlaps rule, meaning that 10% of the existing facilities, patient population, would have to be impacted by a new facility coming into that area. It's currently the threshold that the department uses for adverse impact anyway. And so we're kind of backing it up a step so that instead of getting it to the department level, having the department determine that there will be an adverse impact, we're going to prevent from opposing altogether. And if you said this, finally, I apologize, but under the psychiatric and substance abuse services, the second point is hand-to-medicate payments to full coverage of cost of care. Is that a federal directed payment or is it state? This is a state payment to make sure that when you are a Medicaid patient and you're receiving this psychiatric services, if you are admitted to a facility, the payment that you receive through the Medicaid program at least covers what it costs you to provide that care. Thank you. Dr. Bradshaw. Thank you for your presentation. I appreciate you all working on this for months. One of the questions that I had is the exemptions and the getting rid of the thresholds for equipment and things like that. Is that only for existing facilities or would that also apply to new facilities? If a new facility were to come into the state, these same threshold exemptions would apply to them. As long as it is a number one for the capital expenditure threshold, it would be a construction only project. And then number two, eliminating the equipment expenditure thresholds. Once you are established as a facility, this same threshold exemption would apply after you are established. But if you're a new facility. If you're a new facility, you would be subject to certificate of need as long as you are currently already subject to certificate need. So for example, if you wanted to build a new hospital, you would still have to go through the certificate of need process to build a new hospital. However, we have changed to all kinapost to that, so that process should be easier. But then once you are established, these would all apply. Okay, and then Mr. Chairman, I want more. I don't know if you guys had any conversation about this, but when physician practices are bought by hospitals, the many times there's a facility fee that is then attached to the services. And I don't know if that varies whether it's on campus or off campus. I know some states have addressed that with the facility fees only on campus services. And I just wondered if you all had that conversation. We did not have that conversation as it pertains specifically to certificate of need. However, we do have that conversation regularly, especially when it comes to the federal regulations related to hospital outpatient departments. And whether or not they are reimbursed, we call that site neutral. We're actually doing a lot of lobbying work right now at the federal level to ensure that the payment is the same regardless of whether the site is at the hospital or off campus. We want to ensure that physicians and providers, if they are providing that same service, are reimbursed in the same way. So are you saying that you guys are supporting getting rid of the site of service to parental? I'm not sure I'm following your question. Well, there's a differential between site of service for physicians office versus hospital. And I haven't heard anyone from the hospital business say that they would support getting rid of that differential. So the facility fee comes into play if the thing, if the service is provided at on campus facility versus off campus, I just wasn't clear where you guys were on that. We do support the facility fee if it is a hospital-based setting because it does cost more to operate those facilities. If a hospital that was purchasing a physician practice, we don't consider that a part of the certificate of need argument, but we're happy to talk more about that. Okay. Thank you. Rick, that's Jesse. Thank you, Mr. Chairman. I thank you. On the recommendation around the updating of the single plan, would that just be the department staff or does that include some sort of reconstituted health strategies advisory council or anything like that? The department already has the ability to do that. They just have to reconstitute those technical advisory committees, which would address each of the service-specific rules that we have here could streamline those. Theoretically, could make it a lot easier to get through this certificate in the process. Make sure that it's modernized. And a follow-up question. For some of these funding enhancements, particularly for the public patients, have you all gotten any financial estimates on what that would look like even ballpark? I do not, but I can tell you from a facility by facility perspective, those hospitals know what their costs are to treat those patients, and so we can certainly add that up. Chairman Lawson. Thank you, Chairman. Thank you for presenting to us. The, from my perspective, we certainly have done a fair amount of legislation relating to mental health and substance abuse and behavioral health. And don't get me wrong, I think that's been very important and has been vastly underfunded. But I do take a little issue with the signaling out mental health as being, I think it says, create a new Medicaid direct payment for private site-gatherer hospitals and enhance Medicaid payments to fully cover the calls to care. I mean, goodness gracious, I mean, I think Medicaid payments should fully fund the calls to care and for us not to be increasing that funding. If we're only funding 70% of the calls, then this is not really fair. Of course, the DPB does help out with that. I get that and it's helped the rural hospitals a lot. I got it. But we should be increasing reversion, whether that's for providers or hospitals from that perspective. So let me applaud you for asking for that, but let me go. I wouldn't single out single out substance abuse. I'd say for all levels of care, knowing with the exemptions though, why do we really care whether we have someone wants to put up a new hospital or add more beds? The addition of a new hospital within the community, while in many cases it's very beneficial to those community members who want to make sure that they have access to those care services, we also want to ensure that there's not an adverse enough impact to existing facilities so that certain services within the community that the new facility may not be offering with the old sort of monophilistic and anti-competitive, right? You want to, so you have a new hospital versus an old hospital and yet you want to protect that from a governmental standpoint. I mean, Texas and Florida don't have that and I think they're doing pretty well for their health care and South Carolina just did away with it. Why does the government want to be involved in regulating something like that? I think if there's a need within the community, it shouldn't be a challenge, it shouldn't be an issue. What you have, that's the issue is that I presume the folks that are doing the new hospital, they've done the numbers and they're maybe investors or maybe it's another governmental entity that's doing that. I would hope they wouldn't put something in there that's not a need. I mean, competition makes us all healthier. So I'm just, I'm just struggling with the why the, why the governmental regulation here? We just want to ensure that we're protecting those services that are sole services. But my regulations don't, they'll have to do those services too, although they'll have to be with that other entity, they have to sub-specialize, but they will have to adapt. But that's part of what happens in Florida and Texas and all the other states that don't have CLM. We have had conversations with the hospital associations and each of those respective states and we did consider a lot of their feedback and discussed it with our Certificate and Aid Work Group. We're both discussions about Florida, Texas, we've got recommendations from them on things to make sure that we included. One of which is included in our period annual services recommendation about the license or standards. We want to ensure that we do still have access to all the services, not just the abundance of one service. I think if a new facility wants to come into an area of the state where a facility already exists, if there is a need within that community, they shouldn't have an issue through the Department of Community Health. And we ask the questions that us, government folks or executive branches or bureaucrats are making the decision whether there's a need or not. I mean, that's not what's happening elsewhere. And that's sort of what we're, we're, we're, we're, critically doing. I do think that our recommendations address a lot of that, whether or not there is a need. We're preventing people from opposing all the front-end. I mean, interestingly, the feedback I'm getting from Florida and Texas is they don't have CON. They do know you're right. They do not. I mean, that's the feedback they're getting that I'm hearing. They don't have certificate of need, although I don't know that they have addressed through the absence of certificate of need, all of the challenges that we're trying to address here.\n\nGeorgia, which is why I mean Texas and Florida, I mean they're pretty huge. They have very similar demographics at times. I get it. Listen, I appreciate it. I mean, I'm glad to see the difference in GHA, your recommendations of What was difference in 2023 and what's different in 2024? Thank you. Appreciate it. Thank you. Thank you, General Watson. I did have a couple of questions. Miss Adams. We've heard different pieces of testimony from people to have struggled opening facilities in the state of Georgia. We heard one Just before you testified Could you pick one or two of those and maybe highlight how you would see the outcome of that process being different if we adopted every single one of the Recommendations here. Thank you for that question. I know you've heard testimony over the last several meetings For people some of which are referring back to COM law and statute prior to major COM Invervision so prior to 2008 prior to 2019 I think we have made incremental changes to the law over the years and that gets back to our final recommendation related to the way that statute is organized I think there are still a lot of people trying to navigate this process who don't understand the statute find it impossible to Understand impossible to navigate and so our hope is that by streamlining the statute itself We can address some of those concerns We do have an extension for example for single specialty surgery centers in the state of Georgia. They are not subject to certificate in need As far as the perinatal services is Requirement is concerned One thing that I do want to make sure that the committee understands and that we're thinking about is that certificate in need is one set Requirements and recommendations when it comes to building any facility in the state of Georgia But there is also a completely separate set of requirements under the licensure Part of each new organization and so while there may be requirements and certificate of need Eliminating that certificate of need does not address those same requirements existing in licensure and those requirements within licensure exist For patient safety to ensure that certain volume standards are met because you want to see the physician who's done this A thousand times not the one who does it once a month That's a quality and safety issue and so again certificate needs one thing we're addressing There are still other ways we can impact access to care and I think certificate needs sometimes gets Lined for a lot of the challenges throughout the process. We're trying to streamline those concerns We've baked into these recommendations and changes in those other areas to impact access But I do think adopting these will have a really large impact on patient access to care It's going to streamline the process in the way that the Department of Community Health is going to have less of a burden in this process because we're Eliminating people who kind of pose we're eliminating the need for certificate in need in a lot of situations and Kind of creating an easier to navigate the rules apply to everyone type of environment Thank you from my perspective what I've heard the most of us we've seen the boxes and hey Here's the size of my file for certificate needs to definitely have been conversation around that But I think that people are willing to deal with that if the outcome is that they're able to expand open of facility Do what it is they're wanting to do I don't think they'd be sitting at that table Testifying and showing the size of the file if at the end of the day they had gotten their certificate of meat So my question still remains is what I think you've been at all of our meetings and maybe we can talk about the person who testified previously specifically What's what be a different outcome that we would see? Because the expansion things I'm hearing that's all for people that are currently covering or seal and I'm specifically looking for the recommendations That may change outcomes for people who do not currently have a certificate of need they're going through the process That their experience will be different and that they will end up not standing at a podium someday telling us that they were not able to do something that they And endeavor to do it out here so So we are not in full disclosure recommend and getting rid of the certificate in a process altogether I do think that there are a lot of merits to the program It does provide safety for those services in which facilities are losing money You want to make sure we keep those or just the department services is a great example Hospitals are subject to them. Cala meaning they have to treat patients regardless of their ability to pay and they do take a loss for those services We want to ensure that the communities Still have access to those emergency services. I think you know having an emergency department within your community Brings me a business to the area ensures patients will save to live there work there play there Um, I think for somebody who doesn't currently have a certificate of need but wants to come into the state of Georgia These recommendations can give them peace of mind that they'll be able to apply and go through the process It will be fast. It will be fair and there will be fewer people who can oppose them and make that process more difficult Um, I think for some of the areas where we get a lot of pushback people who have concerns for for example perinatal services Opening up perinatal services to certificate of need so that you can offer that service within your hospital Um, and just instead go through the licensure process and sure that safety is happening there That's going to streamline the process hopefully bring services to rural areas But again that recommendation includes Recommendations related to Torre reform so that our providers will save to practice and that has to go hand in hand With what this recommendation looks like if you don't have providers within your rural areas It doesn't matter if your hospital offers labor and delivery services because there's no provider to deliver In that location so we want to draw providers do those areas um as far as the capital and equipment expenditure thresholds exemptions There are Hospitals that perhaps have a little bit of capital that want to add on to their facility But maybe don't want to do it because construction prices continue to rise and they don't want to go through this or Typically in any process because it's arduous this gets rid of that For hospitals that want to replace equipment This ensures that they can get the Most up-to-date equipment or add to their equipment inventory if they already have a certificate in need So that you're offering that service to the community Um, and it's state-of-the-art and it's cutting edge and so we do think that this eliminates a lot of the things that people stand up and complain about and people who have had have headaches about Because of the way that it's streamlined Now I'm going to We recognize that these are recommendations. This is a starting point There may be others who come with ideas Happy thought about this and we're happy to consider that Um, we want to be at the table for those discussions and hear those people out Thank you Can you provide for us? I know you now talked offline about some of this because not now But in some point in the future specifics around the tour of more measures that you're all talking about I think bifurcations one those that you guys are talked about I think that for me if we go through all of this and the the The net net is that People merely get their rejection faster I don't think that that's a win but that the hospital is now and I recognize you you're advocating for the hospitals But the hospitals have the ability to expand faster by new equipment stuff like that but for those looking to enter the space To maybe even be disruptors in the space to innovate within the space to Have a dream of operating in a medical facility even if they're not going to be disruptors or innovators I think that we have to think about them So I would encourage you maybe if you give some feedback to the committee I think we need to move the needle a little bit more um Such that the the net net for new providers is not just that we have them get their rejection faster um Because we have heard a lot of stories. I think because I want to be clear Honestly, this specific I want to try to understand this correctly as it relates to the previous testimony from his child Since she would not be operating in a hospital This new parianatial exemption that the housing would not apply to her or people who are endeavoring to do these labor For different centers that she's talking about it would not it is my understanding in that particular situation that That the challenge here is a transfer agreement between a hospital and that facility Transfer agreements are executed regularly many facilities have choice for agreements with more than one hospital at a time That's standard practice. That's a patient safety and quality Right requirement um while that is a requirement within certificate of need Again, it is also a requirement of licensure and so certificate of need aside that transfer agreement Requirements still exists in order for that facility to be licensed For hospitals to not license or I'm sorry to not have that existing transfer agreement with a facility They typically have a set of standards safety standards in particular that have to be met and so it's possible Something along that line of taking things off was not satisfied. I'm not sure I'm not familiar with this exact situation But we do in all of this still want to make sure that we maintain Patient safety is there compulsory requirement those you understand provide a transfer agreement if the licensure requirements are met or is that essentially a quasi Tool in the tool belt of hospitals to ensure that there is no competition that enters there Hospitals know that in that situation if there is an emergency they're they're going to get the patient anyway They're going to come through ambulance. They're going to come by a car The purpose of the transfer agreement is to make sure that the patient is free Where I just started the facility so that when they come in we know what you're allergic to we know you're approximate due date We know if the The baby is potentially at risk All of those various things make for a safer patient experience Should they need to come to the hospital setting? But if I'm a hospital and I compelled by statute if they check the boxes on the licensure piece and my compelled to provide that Do I have the ability of my own will for any reason to sad not going to buy that Usually if they choose not to provide the transfer agreement there's a reason It's not you know, we just don't want that competition There are a lot of work but it is there is nothing in current code that compels them to provide that if If the all the legal boxes are checked under the licensure Not to my analysis. Okay. Thank you But any questions or comments from Dr. One of the things that I brought up at a previous meeting was in my district there are Many big hospital systems and frequently There in litigation with each other over and you're representing all them sorry for you, but Would anything in here help that the part about moving the administrative hearings or something like that? What that's in there for so that that will certainly make the process faster Right now they through the appeals panel process the judges that staff that are not experts in CON They are overworked. They don't have staff access to help them do research and so the process gets dragged out um Going through the office administrative appeals Makes it so that you have judges who are experts who know this process can do it quickly or not asking for extensions You hear a lot about people who say this to peers and it just kept getting added onto we think this will stop that um That was not necessarily because of the hospital versus hospital in fact when we did our certificate in the work group And we looked at who is opposing who it was surprising the number of appeals and opposition that were not Hospital versus hospital but regardless We do think that that Streamlines the process in a way that people feel more comfortable using it and more are more prone to Initiate the process because they don't have to worry about that headache So just to follow up on the chairman's point It would likely just speed the process up and bring more expertise, but it wouldn't limit the that type of Enter system litigation some of our other recommendations would limit that inner system litigation um Specifically related to the overlapping service area Um getting rid of the need for a certificate of need altogether or capital and equipment Expanded you don't even have to get one anymore. So that stops some of that facility to facility um fighting should it it exists But That one alone does not fix it, but we think in conjunction with some of the other recommendations it does I Recognize that yeah just a just one follow up the Like a map first I'm sorry, sure Thank you, Anna um Thank mr. Chairman Just a little bit of a clarification with regards to the exemptions When you the with respect to current exemption to a lot of existing hospitals to increase bed capacity curious um No in the past it's been 10% moving the 20% any specific reasoning why the increase or not just removing that all together We we talked about both with the c.o.n. work group and I think this is where the group was most comfortable Expanding to we think it allows hospitals to add beds faster should they need to if the community is growing um You know, there's a need for additional in patient beds. I see you beds We want to make sure though that we are still doing that in a way that the state knows it's happening and it's aware And other hospitals know that it's happening in a way and so this creates kind of that notification without it going too far They just follow up to that um Would so with regards to who can contest um Would it allow For facilities to contest services that they don't necessarily No The current certificate of need statute says that you must offer the same service in order to oppose the certificate of need So this doesn't it this doesn't change that that's still the case what we've done is add to that Right now you have to offer the same service you have to do within 35 miles We're adding to that that the new proposed a new facility or service has to impact at least 10% of your patient Volume so we're making it again one step further even harder for you to oppose Thank you Now We happy to defer to others if they have questions that don't need to do that and just to Couple things when you know when we're talking about access. I mean it it goes both ways I mean you're a lot of hospitals have opposed You know, and I see you need a nail I see you's pediatric I see you pediatric beds emergency room pediatric beds. I just have a tough time swallowing now. I really did that's that's sort of difficult for me to understand And that's sort of a closing personal here in Savannah um Access again, you know the freestanding ERs that continually get opposed And I just I'm getting back to monopolies and anti-competitive Oldson That's just maybe a comment relating to access the And then I will stroke about give you a compliment just The the the quality that we're talking about Rules and regulations and approval by the feds CMS This is not related to CNN right Right, so from a quality and rules and regulations are approved by the state for any kind of facility goes through rigorous checks And not to mention You jesse weatherton's organization when it comes to insurance To get paid you have to Meet all their parameters also one of the most Positive things has come out of CMS has been their quality metrics mainly with with primary care But also hospitals which are lagging behind You know unfortunately, but I would hope they they embrace them because what we're here for are constituents and our patients Because that's that's what the bottom line should be So I want to compliment you On a perspective that the governor camp is weighed in on relating to Car insurance and price of car insurance and Tort reform, tort relief Because that certainly plays a role in health care and driving up the calls to health care and doesn't necessarily improve the quality of health care so What CMS is doing from a quality standpoint whether it's with the directed payment plan or through ACOs etc that that is a very positive move in the direction. I'm glad to see GAJ weighing in hopefully heavily when it comes to toward form to To relieve and that is much appreciated. Thank you. Thank you We want to make sure as I mentioned that providers will save to practice and those are not always hospital-based providers But we do work closely with providers within their respective communities and we recognize that as a hospital We're providing the location for those services, but we rely on those providers to provide that care and it very much is a partnership And so we are here to be supported In a very vocal way on some toward form measures to make sure that they will save Thank you miss Adams. I want to thank you and your team for the work that you've done You know you have a couple numbers of your team here as well as the committee So if you could on behalf of our committee. Thank you our committee For bringing these recommendations forward and we will certainly Continue to read through them asking any questions that we have and hopefully keep the open dialogue going through this process Thank you Next and our last speaker before we get the public testimonies Byron What's your last time after I was call your Coli It's byron here byron you can step right down here to the podium did I get it right I got one of the two is a call your holy holy Call the act I guess wrong Our I do want to thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Good morning. Thanks for being with us. Good morning. Good morning. My name is Byron Colley. I'm a native subanian. I want to say thank you for being here today. And all that you do under the gold dome. The citizens of our great state. Your decision has changed lives. I have practiced pediatric dentistry, dentistry for children here in Savannah for 20 years, 22 years. I have practiced pediatric dentistry since 1950. As pediatric dentists, our groups represent a wide catchment of area of Georgia. Georgia, Southeast region serving Camden, Glen, Macintosh, Long Liberty, Brian, Chatham, Brantley, Wayne, Effingham, Bullock, as well as other states like South Carolina. Because we have a patient, because we have a patient focused practice. We have a compassionate staff. We have a patient who is working in a safe environment. We have a patient who is working with patients. We get patients out of pain. We offer the operating room for dental treatment. We accept all types of payments. Private pay, insurance, and all government assisted programs. Access to safe and equitable anesthesia services is vital to the practice of restoring oral health to children. And is unquestionably recognized as the only safe and compassionate means of providing invasive procedures for children. Many dental patients in our region will routinely wait six months or longer for treatment under general anesthesia. Pain management, antibiotics, and temporary band-aid-like approaches are the only options. The misuse of antibiotics and narcotics in the pediatric population is well documented. And against the best practices guidelines of the American Academy of Pediatric Dentists and American Academy of Pediatricians. Despite being commonplace, these practices are needed equitable and warfare. Pediatric dentists have long been long-standing members of the surgery departments of our local hospitals for decades. Running care to young children, adults, and children with special healthcare needs. And, of course, with the guidelines from the American Academy of Pediatrics and the American Academy of Pediatric Dentistry. The American Academy of Pediatric Dentistry has witnessed a major decrease in operating room access over the last decade. A problem which began as hospital-spaced hard financial decisions has had different financial priorities. We are privately owned practice. We see children have severe dental needs and patients with a variety of medical conditions. Once the child is being diagnosed with multiple cavities in our office, we discuss with the parents how they would like us to treat their child's dental needs. We have options depending on the child's age, parents' decision, and type of insurance they have. We have the use of nitrosotic side for the cooperative patient who is old enough to understand what we are doing but is still anxious. We can use the papus, which is a restraint for young children, that does not understand what we are doing, is understandably uncooperative. Unfortunately, because the hospital caused for the wait time for the operating room to be able to take care of the patient and to take care of the patient and to take care of the patient for the wait time for the operating room at the hospital. Many families choose this even though they would rather their child be put to sleep in the operating room for dental procedures. We also have a vaginal anesthesia in the operating room. Parents' offering prefer the operating room option because it allows us to address all the problems while their child is asleep. As amnesia, a third treatment plan can be performed with x-rays. The child will have all their treatment done in one time without having to be placed in a papus restraint multiple times for dental treatment. Treatment in the operating room also allows all the dental treatment to be completed in one appointment instead of multiple appointments which allows the child to miss less school have pain relief immediately and the parent to miss less work. One treatment of this is typically less dramatic for the child also. For this reason, access to operating room is critical for our patients. There's a critical shortage in operating room access in Savannah and across Georgia. Let me show you a few pictures of what we do in the operating room. This is multiple decay teeth which are prepared. These are the teeth prepared for crowns. As you walk through, you'll see multiple decay teeth are here. And then you'll see the restored teeth. Our prices are explored opening a multi-special surgery center in the past. I know the conversation of multi-special surgery center is controversial. However, we good for the patients in our area especially for access to care. Therefore, I decided to test about publicly and I trusted because I have a diverse opinion from others in our community. There will not be any negative recourse towards my practice and the patients I serve. Instead, I hope there will be healthy dialogue to increase access to care for our patients. Because we're now allowed to have our own surgery center, our practice is patients in the operating room and our general anesthesia, St. Joseph Canner, here in Savannah. I have a great respect for Paul Henshwin and Kyle McCann and their team at St. Joseph's canner. They have taken the time to bring in a consultant group to streamline the operating room to make things more efficient. Unfortunately, we were not involved in the streamline process and we're told afterwards that after 20 years of seeing patients in the hospital, our block time in the operating room was going to be limited. We would also need to change locations to start seeing patients in their surgery center. Once we find that found out, we met with Mr. Henshwin, Mr. McCann and asked him if they would consider a joint venture with our practice in one of the specially surgery centers. One of the specially anest surgery centers, usually, the response was this was not in the hospital's strategic plan. Which I understand have a watch to this limit my ability to have a fully functioning multi-special surgery center to provide complete access to our patients. The ideal solution of restoring or or access as it was a decade ago is unrealistic and not sustainable with increasing pressures of decreasing reimbursement schedules and barriers to care. Hospitals are chained for charges with providing care on a vast continuum of health needs. And a hierarchy of services made you oral health and dental treatment as low priority. And an inventory service that is suited outside of the hospital setting. In competition between dental care and dental and general surgery and other medical specialty services in a community, dental care seldom wins. This may be because of the misperception of the value of oral health by decision makers. Or the need for hospitals to nurture a full range of surgical services. This often means commitment of offering room time to non-dental surgery over dentistry. Dental-specific inventory surgery centers for about the answer to this complex problem providing equitable access does significantly lower costs. However, a certificate of need laws were not written for dental specific care and provide no provisions for single-special dental sites. Moreover, many other states have recognized the value and provide pathways for this common sense solution. More importantly, these sites provide safety and honors to code from non-NOSIRA. In other words, our patients are at the complete mercy of the hospital. Only the hospital decides when or if, for where I can treat my patients. As a result, the current wait time for our surgery for my patients is seven to eight months. This is extremely harmful to my patients because routine dental treatment can result in abscess to leading to an extraction, which is what you see here on one side the tooth is not abscessed yet. But on the other side it has and has to be removed because of the wait time for dental treatment. Imagine telling a parent of a child that is in pain that they'll have to wait 17 months to resolve their dental problems. To prove able to open surgery center, we could also provide these surgeries for lower costs, making procedures more accessible. Again, I've heard the argument that hospitals are afraid of losing patients with private surgery centers open. But there are two reasons you should not be concerned with that. First, for more facilities open, more patients start seeing seeking treatment. The argument that the hospitals will lose patients as soon as there's a fixed number of patients and everyone is already getting services they need. But we know that isn't true. Patients get needed treatment all the time because they can't afford or can't access care. Second, states that have already a repealed certificate of need laws have more hospitals and more surgery centers per capita. This shows when surgery centers open, they don't push hospitals out of business, just the opposite. More hospitals open to patients or winners because they have access to more care. One of the South Carolina repealed its certificate of need laws this year and I'm guessing some of my patients here in Savannah may leave Georgia for treatment and South Carolina for services that will work more readily available. Keeping a certificate of need in place puts Georgia at a competitive disadvantage. In harm's patients who are forced to wait long and pay too much for care. Studies also show that there are 30% fewer rural hospitals in states with CON laws and 14% fewer rural surgery centers. I would ask the committee to recommend repealing CON because CON decreases access for all types of healthcare. Thank you. Any questions from the committee? Just one. You guys mad at me. Do you have to... So just thank you for your testimony and a good question. Do you have the ability under the current CON regulations to open a single specialty to provide those services? I think you answered that.\n\nBut any answer to that question that we do it does have come with some position. Okay. Could you expand on that? I think the hospital where we're opposed. That's doing that for our own single specialty service center. So it may take away from what they think is service they may be on the provider in our hospital. Okay. Thank you. Okay. Chair Watson. Yeah, I don't quite understand that you had. You said your your patients with two issues or cavities or developing the abscessive. You're seven to eight month weight. That's what you're saying. Yes, sir. So if a child comes in today and the parent decides they want their child to be seen in the hospital, currently our weight time is seven to eight months. Then it'll be seen. And so what happens is normally we like to see children every six months get their T-plane have x-rays like most of us do it at our dental office visits. Most of the time that dental treatment gets worse between now and that six-month checkup or two becomes infected and has to be removed because we didn't do the treatment earlier. Parents then choose for their child to be put in a papuce or a restraint. Instead of being able to go to the hospital to be put to sleep for the dental procedure, I think what this leads to is also kind of going outside the guidelines for American Academy of Pediatrics is people end up sedating or doing general anesthesia in their offices instead of in the hospital in the environment or in a surgery center that's run by anesthesiology with those who provide general anesthesia because of the infection. Thank you. Thank you Mr. Collefery testman. Thank you for what you do. I had a child in a chair with that thing around their nose just a few weeks ago. So certainly grateful for the work you do for the children. Thank you. Thank you very much. We're going to move on to the public testimony portion. Keenan is We're going to go. Okay. Mr. Collefery, if you could come back down, Senator Sims has a question for you. And are we able to recognize her? Do we need to raise her question? Yes. Oh, did she send her a question? We will. Stand by, Senator Sims still is able to join us if you don't mind actually sitting maybe closer to the podium and we'll recognize her if she enters the room again. In the meantime, is a rolling down line and available for public testimony. We'll go to him first. And for all those doing public testimony today, we'll have five minutes for each of you. And the committee will be able to answer questions if they desire. And roll into the floor as yours. Go ahead and take it away. Thank you, Mr. Chairman. My name is Roland Bayon, and I volunteer and serve on the board of the Georgia Chapter of the American Foundation for Suicide Prevention. I am also a co-founder of the Georgia Mental Health Policy Partnership. As you know, in Georgia, nearly 50 different facilities and services require a certificate of need before they can open. Thanks, food for extending emergency departments, mental health services, and obstetrical facilities, which include birth centers. I'm testifying today to encourage a form of the con law to allow for the establishment and operation of rural healthcare clusters consisting of freestanding emergency departments and M-Path units, which I will design later in my remarks. These healthcare clusters will put need very much closer to Georgians in rural communities, while the prevalence of mental illness and rural and metropolitan areas is generally similar. There are differences. For example, the suicide rate is nearly twice as great in the most rural areas of the US compared to the most urban areas. Georgians living in rural areas need to travel much farther than Georgians in rural areas, access both physical and mental emergency care, hospital closures result in even longer distance and geographical obstacles to a outcome, significantly affecting response and transport times. This is a persistent problem that requires innovative approaches to resolve. One innovative approach is to combine freestanding emergency departments with M-Path units. M-Path is the acronym for Emergencies, psychiatric assessment, treatment and healing. M-Path units are physical environments designed for acute psychiatric patients to receive assessment and treatment and to begin the process of healing. M-Path units have been recognized and recommended by the Joint Commission and the National Council for Behavioral Health. In fact, earlier this summer, South Carolina concluded a grant program in which it used $35 million to authorize the construction of 13 M-Path units across the state. Complimenting the emergency department, M-Path units provide a calm and comforted environment for patients, allowing movement and more importantly, human interaction that is vital in the first 24 hours of treatment. M-Path units streamline emergency department assessment of the health needs of mental health consumers and quickly transitions that out of emergency departments into a calm and space that allows for the rapid assessment support of behavioral health needs and linkages to other services. M-Path units present unnecessary EDM hospital admission, providing more compassionate care, improved EDG group of increased patients and providers that is mentioned. Better for point is that 75 percent of patients treated in an M-Path unit stabilized in return home within 24 hours without possibly impatient admissions or an urgency to perform. Creating a regional health cluster of EDGs and M-Path units puts negative health care and lets closer to Georgians in rural areas. The cluster is also unsure that emergency transport leading sheriff's department vehicles do not find themselves on multiple out-of-round trips to train its board patients to hospitals during which time their community is left without emergency and sheriff's department presorts this. These regional health clusters will enable complimentary health services including birth centers. The maternal mortality for 2021 was an amazing behind-hests for 100,000 live births. Further, the suicide is the second leading cause of death for women in the postpartum period, accounting for one in five deaths during the first year after birth. Over the past 40 years, the number of birth centers in the United States has grown to more than 400 as of 2021, including 91 in Texas and 31 in Florida. Currently, there are three birth centers in Georgia, a state with over 120,000 births annually. The difference in the number of birth centers in Georgia versus Florida in Texas is in part a function of the conglosks or the absence thereof in the three states. Further national conference who state the legislature's Florida's conglosks not applied to birth centers and Texas assessment noted does not have a conglom. The evidence shows that mothers who participate in birth centers are there, even if they have only prenatal caring to birth at a hospital. Experience and better outcomes, including lower rates of pre-turned delivery and cisterian births and higher birth weights and rates of breastfeeding. Together, rural health care clusters, along with birth centers, will help save lives and bring hope to Georgia's rural citizens in a manner that is less costly, less problematic, and more responsive to those dreams. Thank you to the sobretinity test to top. Thank you very much, Rowland. Any questions from the committee? I'm one of the good center for John. I may have missed it. She may have already said it, Mr. Bame, but are there existing impact units in the state? Can you maybe send us some information? There are no impact units currently within the state. There is, in a sense, a model of it at Brady in terms of their sort of separate facility. There are, as I mentioned, 13 that are in the process of being in Strix South Carolina. I will forward to this committee for distribution information on impact units. Part of that will include a link to testimony provided by Dr. Scott Zeller. He is the person who developed and passed centers about 15 years ago that he provided to Dr. Judy Fitzgerald's subcommittee at the Behavioral Health Reform and Innovation Commission. Thank you. Yes, Senator. Thank you for your testimony. I see no further questions. It's Barry Heron here. Barry, go ahead and step down. If you would please. And we don't have Senator Simms back. Is that correct? Okay. Flores, you're a sir. Thank you, Mr. Chairman. Senator's, ladies and gentlemen of the committee. I'm Barry Heron. We talked earlier this year with regard to the process of applying for a radiation therapy certificate of need in Augusta. I wanted to bring you up to date on that. It has been denied. I don't think anybody was surprised that was going to happen. However, you need to hear the reason why, because you should be as outraged as I am because of that. The point of our application was to access lower cost, 225 percent lower cost in a physician-based cancer environment, set of a hospital-based cancer environment. There is no physician-based cancer treatment for radiation therapy in Augusta. We mentioned this in our application as well as lots of community support for that. Here's what the department said in June in its denial letter. There are four reasons for the denial, the two that you should be bothered by or these two. The applicant presented no evidence of excessive or atypical costs or charges from existing providers. And the applicant did not demonstrate that patients are currently unable to access radiation therapy because of cost. I want you to let that marinate for a minute because it feels to me and it should to you that the standard that the department has imposed for remedying this cost barrier is that a patient has to decide whether they're going to buy something else instead of radiation therapy or that the provider can charge whatever they want. Right up to the point where a patient says I can't afford to pay that. And just to resonate the comments that were made by members of the committee earlier in response or other testimony, Mr. Chairman, as you were asking the question, I was writing down streamlining means denied things faster. Here's the important thing to remember. If a radiation therapy provider loses 89% loses up to 89% of his business or 11% goes down. They lose 11% of their business. They get to object. They have 89% of their patients and they can stop somebody else from coming into market. Two, licensure is not certificate of need. Accreditation is not licensure. Quality is not accreditation. Florida has addressed this with licensure and not certificate of need. But I think it's very important to keep what the department has done in mind. 20 years ago, the Cancer Initiative was passed by this General Assembly and others. And it said that one of the things we're supposed to do is improve access to quality care for all Georgians with cancer. How does that work down? I'll take exactly how that's worked down. Between 2006 and 2022, just that little measurement went down. The number of people that own radiation therapy centers has gone down from 30 to 25. The number of hospital sites has gone up from 38 to 51. The number of non-hospital sites has gone down from 19 to 15. So in the time that we're supposed to be expanding access for people at a lower cost, remember that cost differential that Senator Patrick talked about that hospital price versus that physician price? No facility fee payment for physicians or even during that 16 years, all we've done by empowering the department is to lower the number of units that are available to non-hospital providers by 10% and exacerbated the problem of higher quality or higher cost providers when they purport in the regulations to advance the cancer initiative. To the Senator's comment, it's exactly what the Federal Trade Commission and the Department of Justice were worried about 20 years ago when all this information was brought forward to General Simplies across the country. You're concentrating higher cost care in environments where the higher cost care providers can't object to lower cost care. And that's exactly what's happened here. And this rule bakes that in. Unless a person who applies can say, here's testimony from a real live person or maybe now a real dead person that couldn't afford to get cancer care at some place in my community because I had to buy food and groceries. If that is the if that's the standard, I just don't know how you get past that to say. Patients are currently unable to access services because of cost. You should also know that in the history of this rule, in the history of this rule, there has never been a CON application that's been granted based on a cost exception, not one. So my question for the committee is, how bad does it have to get? How pricey does it have to be? What percentage does the hospital get to charge before the department will say, that's too much? I mean, I really wish that the commission was here because I would say shame on you for letting that rule be the public policy of state of Georgia. That just can't be right. It can't be. And you'll have an opportunity to fix that by killing this thing before the department gets to make more decisions like this and prevent people from entering the marketplace without proof that somebody's gone without care before we'll allow a new venture. Thank you very much. I'm glad to entertain the questions. Seeing no questions. Thank you for joining us again. Oh, sorry. General, thank you for bringing this, Amanda. I don't, we haven't done in a ghost yet. Make it, was it, you think it was the house CONs that were the testimony may have been, but anyway, just for the point of order is that the 225% is a pretty major number when it comes to, I guess, what you're really referring to as inpatient versus outpatient. But Senator, it's actually the difference between hospital and physician payments. And that's just the difference in what Medicaid and the state merit system pay. Medicaid and state merit. So you all pay, you all the state of Georgia pays 225% more to have a patient treated for exactly the same condition in a hospital that you do in position for for state health benefit plan. Yes, sir. Yeah, I guess so. It's a pretty big number. Talk to me about quality a little bit. Well, sir, the comparing to the current contrast if you and well quality of the American College of Radiology certifies all radiation therapy centers. You have to get a license, not with staying in fact that you have a certificate of need. You have to have radiation safety officer who is an ACR certified radiologist. You have to have radiation oncologists that treat patients who are in most cases board certified in radiation oncology. I will mention to you that none of those things were a problem with this application, not a one. In fact, some of the providers that would be providing services already provide services at hospitals in the same time. The problem is we can't show that somebody decided to buy food or pay rent instead of getting radiation therapy services. The the bar center is so high that in 20 years there has never been a successful applicant. Never. And so my question simply is when is the state going to realize that it's been paying too much for care all this time? And does it really want its public policy to be somebody has to choose to do something other than pay for cancer care before we're going to give them some attention? And then how many of those people do there have to be before there's a need for that service? We don't know the answer because the department's never done it before. Yes, it's interesting. I mean, so you're telling me that quality is the same. If not, maybe done by the same providers. In this particular circumstance service. In many situations, I guess it's hard to argue that quality is not the same. So I get the calls to I mean, so the for the state health benefit plans paying 225 percent more than they could be. And in states like just South Carolina, Florida, Texas, and that very conservative state California also doesn't have these doesn't have these issues I presume. Well, sir, I can only speak to South Carolina because my client practices in both states and they can open a radiation therapy center in South Carolina in 18 months, in 18 months, or $4 million less and it would cost to do it in Georgia because of the regulatory noted burdens and start seeing all the patients that they would be seeing in South Carolina. And and the hospitals in Georgia would still lose, would still lose their 10 percent. I got you. So because you're on the span of river, you can go over in South Carolina and open one up and then Georgia loses that opportunity because of our, I guess, our cake would be a good word because that that's really sounds that that drives to a patient care standpoint and access standpoint. So that's ever so important. Thank you. Yes, I'm glad to answer that question. Thank you, sir, for your testimony. Thank you all very much. You look safe travels. Absolutely. You have two more folks to hear from today. Jamie Kavanaugh is here. I'm going to ask Jamie to step down and Gary, Galilee, you're going to be, you're going to be the Grand Finale. Florida's yours, Ms. Kavanaugh. Thank you. Good morning. Thanks for being here today, everyone. I'm talking about this important topic. I wanted to just address a couple of points that I heard today during the testimony. Remember that's a original purpose of certificate of need when it, when the federal government encouraged all the states to pass these laws was to decrease the number of facilities in order to control federal healthcare reimbursements. So of course, this point's been made many times, but when we're talking about access to healthcare, the original purpose of certificate of need was to slow down the growth of hospitals, decrease the number of hospitals, decrease the number of hospital beds. So of course, we can't use certificate of need to increase access to care. It's not what it was designed to do. It was designed to do the exact opposite. And in fact, we know that it has been successful because when we compare to states without certificate of need laws, we see that those states have more hospitals per capita, more surgeries centers per capita, more imaging centers per capita, more dialysis centers per capita. And unfortunately, patients in states with certificate of need laws have to travel for other distances to get care and are more likely to leave the state to get care, which we've heard over and over about patients deciding to go to South Carolina to seek care. Another thing I think that's really important that we heard today is that certificate of need laws can't address problems with healthcare reimbursements. And of course, healthcare reimbursements are a crucial part of maintaining access to healthcare, but that's a separate discussion from whether or not and how we use certificate of need laws. Dr. Berg himself mentioned that direct payment programs don't have anything to do with Khan and the Georgia Hospital Association's recommendations included recommendations to increase reimbursement. And that's something that certificate of need laws on their face can't address. But another thing that goes along with reimbursement is this idea that we're shifting the costs of care to our privately insured patients. And of course, any business does that. That's normal cross-obsetization. Where this gets a little foggy is where cross-obsetization becomes cost-shifting, which is this idea that a business or hospital cannot stay open without that versus sure we make more profit off some of the patients. But I think something that doesn't come up in these discussions is that half of the population here in Georgia has private healthcare insurance. And one in five Georgians has a medical bill in collections. So it might be attractive to say, yes, we have to cross-obsetize and everyone understands that. But what is the level that we're doing about that? You know, you're pushing half of your population with private healthcare insurance, many of them, you're pushing them into medical debt. So the solution can't just be we have to put the privately insured patients on the hook for making up for all the losses in the other areas. Again, that's a reimbursement issue, but for people who argue this is why we need to keep certificate of need law to make sure everyone is going to the hospitals and paying hospital prices for all of their services. We're absolutely decreasing access to care. People are skipping needed services because they can't afford it. People are going into medical debt. So that's not good for access either. I also think it's important to mention that when you look at what other states have been doing, of course, as I mentioned many times, that's all Carolina and Florida. Now, don't have certificate of need. And the Pennsylvania Hospital Association has actually publicly said that it doesn't want certificate of need back. Pennsylvania got rid of certificate of need in 1999. And I think back around 2015, 2016, the legislature had some proposals to reintroduce portions of certificate of need and the hospital association said we don't want that our members don't want to see that come back. And the hospital association today recognized that certificate of need is a complex statute. One of the recommendations is to rewrite the whole statute so that it's more straightforward. And I think a better way to do that would just be repealing certificate of need or repealing portions of certificate of need. Instead of trying to redo this framework which the hospital association admitted providers don't even seek certificates of need because it's so complex in some circumstances. And certainly smaller providers and providers who want to bring innovative services to Georgia. Certainly they avoid the state because they don't want to go through this process. So instead of making some of these changes that just layer on more complexities to a statute that some people already find a little bit baffling and hard to navigate. A better idea is probably to just eliminate most or all of the certificate of need requirements. But if the if this committee does want to make some recommendations for process updates, I think that it would do well to follow states like Indiana, Louisiana, Michigan, Nebraska, New York, New Jersey that don't allow competitors to intervene in the certificate of need process. Those states have very robust certificate of need programs. But they review applications without giving opposition the chance to intervene or appeal from a decision that they don't like. So just to sum up, Georgia is obviously an economic leader in so many ways and it would be a shame if it falls behind in health care to its state's neighboring states like South Carolina and Florida. I'd be happy to answer any questions. Before the states again, Indiana, Louisiana, Michigan, Nebraska, New York, and New Jersey. New Jersey does allow for some very, very limited circumstances where a competitor can intervene, but the rest of them is zero intervention by opposition. And I'm happy to sum that list to the committee. Great. I don't see any other questions for you. Thank you for joining our committee again. Thanks for the dialogue you've had with us and we see you in Atlanta as well. Lastly, we recognize Gary Galway. Come on down, sir. Thank you for joining us today, sir. The floor is yours. Thank you very much. Let me see what I'm going to say. First of all, thank you for the opportunity to come before this committee. Please understand that my comments are intentionally devoid of any intent to negatively portray any health care facility or provider. Because the fact that I am still alive is due to the medical treatment that I continue to receive. And a subnote here, we have medical professionals in the room. So everything that I share is through the ears of a patient over the course of time. My name is Gary Galway and I'm a stage four non-small cell lung cancer survivor. In the fall of 2016, following two weeks in Ireland and traveling a Colorado for my son's wedding, I began experiencing fatigue and shortness of breath while playing around the goal. A visit to my family practice doctor in Monroe, Georgia resulted in a siren in light ambulance ride to Athens for a week-long ICU stay on November 6th 2016. Dr. Petro's Nicolin Knocco's, note Namedi is Dr. Nick and henceforth Dr. Nick. And oncologist entered my hospital room and gave me the news that I had cancer. He shared with my wife, but not with me, that stage four non-small cell lung cancer is very aggressive and long-term survival is poor. 25 to 30 percent of patients with stage four non-small cell lung cancer die within three months of diagnosis. According to a 2021 study from the medical journal, Run Tears of oncology, that's not me, that's the journal. However, the remaining patients with stage four non-small cell lung cancer actually lived over 23 months on an average.\n\nI'm going to talk about how living your expiration date. I'm living proof. Aside from the testing for genetic markers, I was told that I was going to need to have a PET scan as soon as the genetic test results were back. This was very new to me and I laughed when I heard PETs again. I never heard it before. And the initial PET scan followed by dozen scents was shocking. Dr. Nick told me that the injected radioactive glucose imaging filled up like the lights of the National Christmas Tree. I experienced a number of physical side effects from the cancer, including clots in my legs, caused painful swelling until the blood thinner as another medications became effective. I managed to spend eight hours on December 24, 2016 at Piedmont's Athens Regional to receive a transfusion of two units of blood. My weight ballooned to 235 pounds by contrast to what it is now. And I struggled to shuffle around using a walker. In early 2017, I started having difficulty breathing and was discovered that the cancer nodules had eroded the chest cavity wall, allowing for fluid to flow in, restricting the expansion and contraction of my lungs. I and a series of procedures where a long needle was inserted through my back to extract the fluid. The first time, 1,500 milliliters was collected. The second trip yielded 1,350 milliliters and the final collection produced 1,100 milliliters of liquid. And I translate that into wine bottles and that's a lot of wine bottles. Fortunately, my genetic markers indicated that I was able to begin Piedmont with key trutum and immunotherapy drug. Shortly after I see you discharge, Dr. Nick a noted researcher had been conducting immunotherapy clinical trials research for years prior to my diagnosis. But I was one of the pioneers to be treated with this drug for my diagnosis. This is the U.S. Food and Drug Administration approved. He true, I won't give you the fancy name because I can't pronounce it. Dr. Treatment of Patients with Metastatic Non Small Cell Long Cancer, whose tumors express a program, ligand P1, as determined by an FDA approved test and they approved this October 24, 2016. So I was truly a lucky lucky camper. In addition to numerous ultrasounds, CT scans and X-rays, I've had quarterly PET scans since late 2016. My most recent PET scan was this past Friday. So I may glow a little bit brighter than normal. The radioactive glucose, radioactive glucose, grabs onto the cancer so cancer cell locations and any increased activity can be detected. If I've had a polydentaminotherapy treatment, the cancer seems to be more evident in the term I use as frisky. But the frisky nose is diminished on PET scans following immunotherapy, which knocks activity back. My treatment of regimen in the University Cancer and Blood Center in Athens has been appointments followed by immunotherapy IV treatment once every three weeks with the accepted taxes. The cause of this ordeal, I've had periodic side effects from the immunotherapy drug, but they are very distinct from the common chemo therapy treatment side effects such as possible hair loss. It's gone anyway. For nausea. Instead, my PET scans are revealed, opaque images do indicate possible onset of bronchialitis, which manifests itself again as a shortness of breath problem. My two dozen plus PET scans and 79 or 80 immunotherapy treatments have combined to successfully guide my treatment for almost seven years. This treatment plan was enhanced by data, gathered from clinical research with immunotherapy conducted by Dr. Nick and his team at University Cancer and Blood Center. Through the course of my treatment process, I've had my physical order, stat, diagnostic studies, ordered because cancer is tricky and has many twisted turns. However, the PET scanner is in high demand and there have been delays that have worried my doctor. If I extrapolate the scheduling hiccups that I've experienced through the years, do include the diagnostic needs of a North East Georgia catchment area that is fairly extensive to serve by University Cancer and Blood Center, a sole PET scan site can end up short-changing patients in the long run. There's nothing worse than the worry caused by delay, which drives fear of the unknown. In summary, I'd like to advocate for an installation of a PET scanner at University Cancer and Blood Center. Through the course of more than 100 trips to University Cancer and Blood Center, I've observed how difficult it is for some patients to even come through the door for their appointments or whatever kind of cancer. So it's possible to reduce the variables for physically challenged and ill patients. This is a win for them, their families, and caregivers. I'm not a politician and I'm not an expert on the many ramifications of the stupidity of need rules, regulations, or laws. But I am a passionate patient who would prefer the comfort and convenience of one-stop shopping for my treatment in a familiar and compassionate care environment. Thank you. Thank you, Sarah. Thank you for taking the time to join us today. Congratulations on beating the odds. I'm not a happy giver. Any questions? See if anybody has any questions? Seeing none, I can't think of a better way to end the day than your story. Thank you. Keep it up. And I'd tell you to come be a politician with the...",
  "updated_at": "2026-02-14T00:44:25.11268+00:00"
}