{
  "video_id": "nYB_xuckTNg",
  "url": "https://www.youtube.com/watch?v=nYB_xuckTNg",
  "title": "Intragovernmental Coordination Meeting for Day 25 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 25,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Overview: This legislative session covered the passage of two bills - HB 593, which made the election for the Probate Judge of Baker County nonpartisan, and HB 647, which allowed the city of Mulberry to annex roughly 45 parcels in a representative's district, giving more local control over development decisions.\n\nKey Actions:\n**HB 593**: Provided that future elections for the Office of Probate Judge of Baker County shall be nonpartisan.\n**HB 647**: Allowed the city of Mulberry to expand into a representative's district, adding 45 parcels to the city limits.\n\nBills Introduced (First Reading): None mentioned.\n\nNotable Moments:\n- This was the representative's first time presenting a bill in committee.\n- The representative cited constituent concerns over growth and high-density development as motivation for the annexation bill.\n- There was some procedural discussion, including a motion to \"do pass\" on HB 647.\n\nVotes:\n- HB 593 passed unanimously.\n- HB 647 passed with one opposed vote.\n\nAttendance: A quorum was present.\n\nAdjournment: The meeting was adjourned, but the next session date was not provided.",
  "transcript": "good afternoon all right so we're gonna do a little roll call make sure we have\na call in my believe we do give us just a moment\nGood afternoon. We have a quorum. Thank you everyone for promptly coming today. That\nmeans a lot and it certainly facilitates getting this meeting starting immediately. So thank\nyou. We're going to call House Intergovernmental Coordination Committee meeting to order and\nlet's see. Our first bill up is going to be House Bill 593 Dean Green and your front\nThank you.\nAll right.\nWhenever you're ready, please present your bill.\nThank you so much, Madam Chair, to the members of the committee.\nI bring you House Bill 593, which is to provide that the future elections for the Office\nof Probe Judge of Baker County shall be nonpartisan.\nAnd that's the district of the bill.\nI have a resolution from the county commissioners to go ahead and move forward on as well as the probate judge\nThank you, so there's no opposition you do have a resolution from everyone. Yeah from everyone\nSo little candy of about two thousand people\nSounds like a nice place to be yeah, and it really is there wonderful folks. All right. I do any member of the committee have\nany questions? All right, no questions. All right, since we have no questions, anyone\nlike to make a motion? Move to pass, second. All right, we have a move to pass by\nleader registration and a second by Chairman Parsons. All in favor say aye. Any opposed?\nAll right, thank you so much. You're a measure of passes.\nThank you so much. We really appreciate this and the people of Bank of County\nI could count and appreciate.\nThank you.\nI'm headed home.\nThank you.\nDrag safely.\nAll right.\nHey.\nThe speed.\nThat's good.\nShould we get in?\nI don't know.\nUh-oh.\nAll right.\nOur second measure of today is House Bill 647.\nRepresentative Donna Tucci, if you'd come to podium\nand present force, please.\nThank you, Madam Chair and Committee.\nThank you for hearing this bill today, HB 647.\nThis is my first time presenting a bill in committee.\nMy background is in land use.\nI served as a Gwinnett County Planning Commissioner.\nWhen I was running for office, one of the most frequent complaints raised by voters to\nme, besides inflation, was the issue of growth in Gwyneth County, specifically high-density\napartments and the rapid pace of growth and overburdening local infrastructure. The city\nof Mulberry was born out of the frustration and the request of the people, giving citizens\nwithin the county local control over planning and zoning. Now that I'm elected, I'm in\na position to do something to give my constituents more control over growth in our community. This\nThis annexation simply allows the city of Mulberry to expand into my district, adding\nroughly 45 parcels to the city limits.\nThese parcels are a mix of residential dwellings, commercial properties, and undeveloped land,\nprimarily located along one road on the north end of my district.\nMoving these parcels into the city of Mulberry will allow my constituents to have a greater\nlocal voice over how this land is developed and used in the future, allowing\ndecisions to be made by five locally elected citizens, Councilmen, rather than a\nmajority of county commissioners who do not live in the community. I understand\nthere's Councilmen here today from Mulberry and I'm happy to have them come up\nand testify but first I'll answer any questions. Madam Chairman. All right thank\nThank you so much and I know it's a little nerve wracking when it's your first bill so I will just tell you someone give me some great advice on my first bill they said if you don't know just say you don't know when the second good piece of advice is you can take a breath.\nI promise. Thank you.\nAll right. Does anyone have any questions regarding the measures brought by representative Donna Tucci?\nWe've got a couple of questions\nRepresentative Martinez let's hear from you first. Yes, Madam Mayor at the appropriate time. I'd like to do the bill do pass\nAll right. Thank you. Stand by. Okay. Well, all right. Are you waving representative Clark? Okay. Thank you\nAll right. We do have a motion at this time. Do we in a second calling the question all those in favor of passing the measure\nbrought forth on House Bill 647. Say aye. Opposed?\nWe do have one on post. Thank you. The measure does pass.\nThank everyone for their time and consideration on this matter and\nhave a wonderful safe trip home. Thank you.\n",
  "updated_at": "2026-02-12T18:35:29.074992+00:00"
}