{
  "video_id": "o0OECqHulew",
  "url": "https://youtu.be/o0OECqHulew",
  "title": "Georgia House - Day 35 (2026-03-18)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-18",
  "duration_minutes": 103,
  "summary": "Overview: The Georgia House session on 2026-03-18 focused on legislative business, including the introduction of a new bill, SB 34. The session featured a prayer by Reverend Valerie Allen Thompson, highlighting the importance of prayer and trust in God during challenging times.\n\nKey Actions:\n**SB 34**: Bill introduced (first reading)\n\nBills Introduced (First Reading):\n- SB 34\n\nNotable Moments:\n- Reverend Valerie Allen Thompson delivered a prayer, emphasizing the importance of prayer and trust in God, and using the \"Lift Every Voice and Sing\" hymn as a model for prayer.\n\nVotes: No recorded votes mentioned in the transcript.\n\nAttendance: Quorum present, as all members were required to report to their assigned seats.\n\nAdjournment: The transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "They are convening having arrived all members of this House will please report to their assigned seats. All members will report to their assigned seats. The clerk will ring the bell. Good morning. All members will please take their seats. We are going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. The clerk will please close the doors and keep them closed. Good morning. Came through the any room a minute ago and I can see blue skies and sunshine after a rainy night in Georgia. Hope everyone is well. Before we begin, I want to remind you that testing for COVID is going on to today until 11 a.m. It does every Thursday. If you have not tested, you have about 45 plus minutes so make your way down there. We will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 135th House District, the dean of this house, a friend of all of us, Dean Calvin Smiley. Good morning. Thank you, Mr. Speaker. It's a joy for me to be able to bring our chaplain of the day. I'm so delighted I've known her all her life and her mother and father, brother Rudolph Allen, her mother, dear friends of mine and her supporters of mine is when I ran for public office and I've shared a friendship with the Allen's every sense. Her church is in represent, the Carolyn Yuve was district. I was talking about asking someone to come today since the women's history month and recently Representative Valerie Allen Thompson was elected to serve on the Joe Missionary Convention of the State of Georgia as a regional vice president thus making history in the state of Georgia so I want to say that. She's the oldest daughter of seven children and attended the University of Wisconsin, the Muscoa County School System and the Mercy University and International Dynamitational Geological Center here in Atlanta, Georgia. Found and only passed a 25 year old revelation mission there about this church, the father of Rudolph Allen, a senior, filled the urge to retire in December 2004 and she has brothers but her father selected her and she became passionate at that time, the only female Baptist ministry in Columbus, Georgia. She has been an active person in our community. She has been on the board of various community organizations, the International Administereal Alliance and recently she was a former member of the Columbus City Council. When I called her and asked her what should I say about her and she said, just say three words, I love the Lord. So with that, please welcome Reverend Valerary Allen Thompson, the Vowry Mawks and our inspirational comments today, Reverend Allen. Good morning. To speak with Austin Dean Smiley and a special greeting to my district representative, Allen Huggley and to all the members of the Columbus delegation, it is indeed an honor and a pleasure to be here with you today. I know that we are still abiding by CDC guidelines. My family wanted to come but they couldn't but they are streaming and I want to say to them, thank you so much for their probably Smiley now, my revelation family. Allen now for acknowledging them this morning. When I was a child, when I was a kid, I used to pray every night for a bike. Then I learned that prayer doesn't work that way. So I decided to still a bike and prayed for God's forgiveness. Prayer isn't just about asking God for things you need or desire. It's about establishing a relationship with Him built on faith and trust in Him. God knows the desires of our hearts long before you even think to ask but He still loves to hear from us. Whether we are asking for guidance or giving things because what it does, it draws us closer to Him. One widely known prayer that is often set to music is the Lord's Prayer. However, there is another musical prayer that is not so widely known and it is called Lift Every Voice and Sing which we know it as the Negro National Anthem written by James Weldon Johnson. In the third stanza, he addressed his words to God for this reason, the third stanza constitute a prayer of petition. And this is what it says, it says, God of our weary years, God of our silent tears, thou who has brought us thus far on our way. Thou who has by thy might led us into the light keep us forever in the path. We pray then it says, last our feet, stray from the places our God where we met the last our hearts drunk with the wind of the world we forget. The shadowed beneath our hand may we forever stand true to our God, true to our native land. Like the Lord's Prayer, this is a good model for appraising people in the face of continuing injustice in the face of this pandemic, in the face of unnecessary violence. It certainly serves as a model for what we have endured this year. The reason why this prayer is such a good model prayer, first the focus of the writer's petition is upon God. Under such heavy affliction and terrible treatment, you would expect the focus of the prayer to be a litany of complaints about misery, about suffering, about injustice, but Johnson focused his prayer on the presence of the one who is able. It was not on how hard life was, but on how available God was and God is, not on how weary the years were but how sustaining the hand of God is. Yes, we have been through a lot, but we must continue to trust God. We have an insurance or a divine assignment from the one who does not grow weary. As a matter of fact, Isaiah 4029 said, he gives strength to the weary and increases the power of the weak. We have the assurance of assistance of the one who can lead us in the right way because he is the way and he is the best way. This model prayer conditions our soul for the Lord to order our steps where love overcomes hatred where God makes us secure at the deepest level, then whatever policies this nation develops toward us, we can forever stand true to our God. However much the shortcomings of this nation discourages us, the Lord will enable us to still stand true to the nation, nobulous promise to be one nation under God, indivisible with liberty and justice for all. Whatever this nation's policies and attitudes God will strengthen us to stand, that's why I like the verse in Ephesians 329 where it says, now unto Him, who is able to do exceeding abundantly above all that we can ask or think according to the power that works in us. Will you bow your heads with me in prayer? Dear wise and loving Father, God we thank you for your love, your kindness and your tend mercy. God we thank you on behalf of all who are gathered here today. Thank you for your many abundant blessings. Thank you for life itself, for the measure of health we need to fulfill our calling. Father, God therefore I pray for every representative, for the speaker of the house for the various levels of officials and particularly for this assembled body. I'm asking that you graciously grant them wisdom to govern amid the conflicting interests and issues of our time, that you grant them a sense of the welfare and true needs of your people, that you will grant them a king, thirks for justice and rightness and the ability to work together in harmony even when there is honest disagreement. Father, God give us an assurance of what would please you and what would benefit those who live and work in and around our beloved states, our cities and our communities and the world in which we live. It is in your most blessed name, the name of Jesus, amen. Let us pledge to the flag, I pledge allegiance to the flag of the United States of America and to the republic for which it stands one nation under God in the visible, with liberty and justice for all. Your keepers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous Legislative Day and found it to be correct. Furthermore, Mr. Speaker, grandma loves a social distancing with friends but has a problem with her enemy, needs to hug the enemy to know how deep and big to dig the hole in her backyard. Is there any objection to the Chairman Hogan, the chair of the Committee on Information and Audits, reports that the journal of the previous Legislative Day has been read and found to be correct? Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on 59th, who is filing me establishes the order of business in her first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference files, bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. Household 770, four by reps and more of the 95th Wilkeson to the 38th McLaren to the 51st dry of the 59th Wilensky, the 79th and others will be taught in act to amend chapter 2 to title 21 of the physical to Georgia annotated relating elections and primaries generally. Governmental affairs. Household 775 by reps and evently the 139th bill will be taught in act to amend and act change the number of members the Board of Education and Taylor Cancer Governmental Coordination. Household 776 by revenue. Jocuz to the 138th Jasper to the 11th bar, the $133, the 45th and Stevens to the 164th bill will be taught in act to amend chapter 2 to the title 46 and Article 6 to the 13 to the total 48. The official go to Georgia annotated relating the Public Service Commission. Ways and means. Household 777 by reps and a Wilson of the 80th Penned of the 94th Taylor of the 91st Kendrick of the 93rd Davis of the 87th and others. The International be taught in act to amend and act creating a state courted cab county. The Intergovernmental Coordination House of Resolution 406 by reps and a will of the hoed of the 175th Ptree, the 166th Kirby, the 114th Taylor, the 173rd Gamble of the 15th Resolution urging the Georgia Emergency Operations Plan to prioritize a continuum of long service, long term services and sports. Public safety and homeland security. Senate bill 294 by Senator Harrell of the 40th and bill will be in title of act to amend and act creating a new charter for the City of Shambley. Intergovernmental Coordination. And I can please first readers. Second reading of bills and resolutions, the clerk will read. House bill 761 by reps of Carter of the 92nd Kendrick of the 93rd Davis of the 87th, the 85th Taylor of the 91st and others. The bill to amend and act to provide a new charter for the City of Lithonia, House bill 762 by reps of May, the 56th Thomas of the 65th Evans of the 57th Properts of the 52nd more than 95th and others. The bills will create the Fulton Technology and Energy Enhancement Authority. House bill 763 by reps of Hill of the 3rd and Tarvon of the 2nd, the bills will amend and act creating the Office of Commissioner of the Suits of County. House bill 764 by reps of Hill of the 3rd and Tarvon of the 2nd. The bill to authorize the City of Fort Oralport to exercise all redevelopment and other powers under the redevelopment powers law. House bill 765 by reps of Hill of the 3rd and Tarvon of the 2nd. The bill to create the Contuse of County Public Facilities Authority. House bill 766 by reps of Hill of the 3rd and Tarvon of the 2nd. The bill to authorize the Contuse of County to exercise all redevelopment and other powers under the redevelopment powers law. House bill 767 by reps of Year 2 of the 150th second. The bill to amend and act to authorize the Magistrate Court of Lee County to charge the Law Library fee. House bill 768 by reps of Powell of the 3rd and Tarvon of the 2nd. The bill to amend and act to provide a new charter for the City of Royston. House bill 770 by reps of Rolston of the 7th. The bill to authorize the Assessment and Collection of the Technology fee by the Magistrate Court of Gilmer County. House bill 771 by reps of Thomas of the 39th. Wilkerson of the 38th, of the 42nd. Williams of the 37th and others. The bill to amend and act to provide a new charter for the City of Austin. House bill 772 by reps of Park of the 101st. Clark of the 108th. Kendrick of the 93rd. More than 96. The cloud of the 105th and others. The bill to reconstitute and reestablish the Board of Registration and Elections for Gwyneth County. House bill 773 by reps of Park of the 101st. Clark of the 108th. Kendrick of the 93rd. More than 96. The cloud of the 105th and others. The bill to amend and act to provide a Gwyneth County Board of Registrations and Elections. House Resolution 392. I represent a Singleton of the 71st. The term of the 114th. We have the 115th. Resolution honoring the lives of it. Mark Allen and Sergeant Mike Stokeley and dedicating a road in their memory. House Resolution 393 by reps of Smith of the 18th. Kelly of the 16th. Resolution honoring the life of Mr. Bradley Scott Brad Vines. Dedicating a road in his memory. Through 2nd readers. Reports of standing committees. The clerk will read. Representative Timothy Barlow, 103rd. District Chairman of the committee on code revision submitted the following report. And speaking of committee on road code revision. Is that under consideration. Following bill of the Senate. Instruct committee report. Same back. House following recommendations. Senate bill 238. Do pass by committee substitute. Respectfully submitted. Representative Timothy Barlow, 103rd. District chairman. Representative Chan Takers, the 160th. District Chairman of the committee on intergovernmental coordination. Local submitted the following report. And speaking of committee on intergovernmental coordination. Locals out of consideration. The following bills in the house in the Senate. Instruct committee report. The same back the last following recommendations. House bill 739. Do pass by substitute. House bill 740. Do pass. House bill 753. Do pass. House bill 754. Do pass. House bill 755. Do pass. House bill 756. Do pass. House bill 757. Do pass. House bill 759. Do pass. House bill 769. Do pass. Senate bill 280. Do pass. Senate bill 282. Do pass. Senate bill 283. Do pass. House bill 732. Do pass. Respectfully submitted. Chan Takersley. The 160th district. Chairman. Representative Chuck Offstration of the 104th district. Chairman of the committee on judiciary. Submitted the following report. Mr. Speaker, committee on judiciary. Is that a consideration? The following bills in the Senate. Instruct committee report. The same back the house. The following recommendations. Senate bill 33. Do pass. Senate bill 86. Do pass. Committee substitute. Senate bill 200. Do pass. Committee substitute. Senate bill 218. Do pass. Senate bill 234. Do pass. Senate resolution 134. Do pass. Respectfully submitted. Chuck Offstration of the 104th district. Chairman. Representative James Parchett of the 176th district. Chairman of the committee on judiciary. Submitted the following report. Mr. Speaker, committee on judiciary. Non-civil. Is that a consideration? Following bill of the Senate. Is the instructor committee report. Same back the house. Following recommendation. Senate bill 105. Do pass. Respectfully submitted. James Parchett of the 176th district. Chairman. Representative Rick Jasker. Is that a 11th district. Chairman of the committee on transportation. Submitted the following report. Mr. Speaker, committee on transportation. Senate consideration. The following resolutions of the Senate. Is that a. Is it a instructive meeting. Reports. Same back the house. The following recommendations. Senate resolution 84. Do pass. Committee substitute. Resolution 102. Do pass. Respectfully submitted. Rick Jasker is the 11th district. Chairman. That completes the reading and reports. Instanding committees. the report to standing committees. All right, we're going on now to the local calendar, going on to the local calendar, third reading and passage of uncontested local bills. What purpose does representative meek arise? Mr. Speaker, I've moved that House bill 755 and 756 be delayed to the next latest Labor Day. Where we'll read the captions. House will 755 over a week. House bill 755 abolishes the Pierce County Board of Elections and Registration. House bill 756 by the way, makes the 178th Pierce County House bill 756 reconstitutes and reestablishes the Pierce County Board of Elections and Registration. On the gentleman's motion, that House bill 755 and House bill 756 be postponed to the next legislative day. Is there any objection? Is there any objection? Chair, here's none and it is so ordered. Okay, now on to the local calendar minus those two bills. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds roll call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered that clerk will read the local calendar. House bill 739 by substitute by reps and a roll. So the 7th City of Blue Ridge, House bill 740 by reps and a benton of the 31st town of Pendergrass. House bill 755 by reps and a smith of the 70th, Coedah County. House bill 754 by reps and a benton of the 31st City of Huston. House bill 757 by reps and a win of the 89th City of Atlanta. House bill 759 by reps and a Petrie of the 166th City town of Thunderbolt. House bill 769 by reps and Mathy Ack, the 73rd, Spalding County. Senate bill 280 by Senator Gouge, the 51st, Lumpkin County. Senate bill 282 by Senator Anderson, the 24th Lincoln County. Senate bill 283 by Senator Anderson, the 24th Lincoln County. House bill 732 by reps and a dryer, the 59th City of Atlanta. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. The chair here is none. The chair here is none. The chair here is none. The chair here is none. The chair here is none. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 137. The nays are 11. These bills having received the requisite constitutional majority are therefore passed. The chair here is none. The chair here is none. The chair here is none. The chair here is none. The chair here is none. All right, we're going on now to morning orders. We're going on to morning orders. If you have signed up for a morning order, then be prepared and be at the front of the chamber a total of 10 minutes for all morning orders. Chair recognizes the majority caucus whip, Representative Kelly for a morning order. Thank you, Mr. Speaker. I'm joined by Representative Smith. I'm because it's not often Mr. Speaker that we actually take the time to congratulate and to tell the staff that we work with how much we appreciate them and how proud of all the great work they accomplished. But I want to do that this morning. Choose D-Night, a Ryan Farmer, our House Policy Manager, put his name on the ballot like we have. And I'm proud to share with you that he won overwhelmingly in his election to the Herylson County Commission. So I hope that everyone would join me in congratulating him for putting his name on the ballot and being successful. Thank you, Mr. Speaker. I'm receiving troubling reports from that county, though, that there could have been some election fraud and the election could have been stolen. I mean, is any merit to that? I'll say Mr. Speaker, I think the results speak for themselves. And he got the only disappointing thing is he only got 91.7% of the vote instead of 92. Well, okay. Chair recognizes Chairman Bonny Rich for a morning order. Thank you, Mr. Speaker. In recognition of women's history month, I come before you today to honor Alice Heryl Strickland, Georgia's first woman mayor. And she was mayor of my very own Duluth. In 1915, Alice became a widow, leaving her with two of their seven children still at home.\n\nShe didn't have a college education or a career, but she didn't let that stop her from serving her community. Her interests ranged from health care to conservation. But her very biggest challenge came in 1921, when at the age of 62, she ran for mayor of Duluth. Women had gained the right to vote only one year earlier, and she, a country girl from Duluth, actually came down here to, came to the Capitol, actually, and lobbied for the right to vote. Alice was determined to clean up her town, which had become riddled with drunken brawls and knifeings. She campaigned on the side of law and order in an openly hostile political climate. Imagine that. And she won the election. By being, quote, considerate to petty offenders, but severe with those who willingly and flagrantly disregarded the rights of others, Alice cleaned up Duluth. Alice Strickland is a role model for women of all ages, backgrounds, and education, demonstrating that neither social status nor age can stand in the way of a woman of fierce determination and courage. Thank you, Mr. Speaker. I yield the well. Chair recognizes Chairman Lynn Smith for a morning order. Thank you, Mr. Speaker and members of the House. On March 15th, Governor Kim's office sent out an email announcing the 84 appointments to Georgia Regional Water Planning District, looking to see if the map shows up. This amount, this announcement probably slipped by most of you because water issues are not on our radar. Believe me, they will be when there is a drought or a lawsuit from our neighboring states. Thank heavens, the General Assembly hunkered down during the first decade of the 21st century to address these concerns. In 2001, the General Assembly created the Metropolitan North Georgia Water Planning District, otherwise known as the Metro District. In 2008, the General Assembly created its efforts in this area, creating regional plans for the rest of the state. You can see the map up there now and you can see the water basins and then you can kind of pick out your area. If you'll take a moment to relate to where your district is and what is showing up there, I'm going to tell you now why that's so important. The council's decisions determine the preferred water management practices for each regional water resource needs. I encourage you, when you're about home in your district, to take the time to learn about your regional water planning districts. This is not, again, on our radar, but when it is, it's one of the most overwhelming issues we have to deal with. So during this quiet time, please take the time to meet and learn about your regional water council. Paraphrase in our founding father, Benjamin Franklin, we learned the worth of water when our well goes dry. Thank you, Mr. Speaker, you'll the well. Chair recognizes Representative Benton, Chairman England, Chairman Dickey, and Representative Gaines for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen, House, I've last week, Jackson County, Laos, for one of its most outstanding citizens. Mr. Hayley Fleming was 94 when he passed away. Besides being a veteran and raising a family in Jackson County, he dedicated 37 years to the educational mission of helping students acquire the knowledge and life skills necessary to become productive citizens. He taught at Lula, Jefferson, Commerce, and Jackson County High Schools during his career after receiving his backslurs at his master's and specialist degree. The success of his former students is one of Mr. Fleming's greatest pleasures. His former students worked in varieties of agricultural careers. Five of his students carried on his calling by becoming agricultural education teachers. Mr. Fleming set a standard of excellence for his FFA members that helped them bring home many awards. He had 76 students named State FFA. He had 76 students named State FFA winners. He coached nine teams to national FFA competitions. Also State competitions. His FFA chapters produced seven State FFA officers, four FFA scholarship winners, countless Georgia Planner degree recipients, and eight American former degree winners. Jackson County built so close to Mr. Fleming and thought so much about him. We have been diode a Haley Fleming agricultural scholarship. Jackson County will truly miss him. He was truly an outstanding citizen. Thank you, Mr. Speaker. I yield the well. Chair recognizes representative Carter for a morning order. Good morning. Thank you, Speaker Austin. In recognition of women's history month, we wanted to share with you some famous women who were born on March the 19th. You know Ruth Pointer from the Point of Sister. Moms Maible from the Tetland Circuit. By all the David from the Georgia General Assembly and the Georgia General Assembly. And of course, yours truly during Carter hells from the city of Atlanta. And we believe that we were destined to be here. The stars were aligned. And we believe that everyone born during this season of high-speed or awesome and powerful people and speak of Austin. We include you too. Thank you. Thank you. Thank you. Thank you. Speaker Austin, we include you too. He was born on March the 14th. And again, big up, it's spicy season. To all the spicy is in the house. Let's party. Speaker Austin, we yield the well. Chair recognizes representative bird for a morning order. Good morning. As we continue to celebrate women's history month and their achievements, I want to share Mamie George's Williams life, a politician from Georgia, and served on the Republican National Committee. In 1924, Ms. Williams became the first woman from Georgia and first African American woman to speak on the floor of the National Republican Convention. Mamie Williams was born in 1872 in Savannah, Georgia to Reverend James and Sarah Miller. Ms. Williams was educated at the Beach Institute in Savannah and at the Atlanta University. After the 19th Amendment was passed granting women the right to vote, Williams took action and registered a large number of African American women to vote. During the 1920 presidential election, Williams was created credited with turning out over 40,000 women for Georgia to vote. After her passing in 1951, the editor of the Savannah Times utilized Williams by writing. Mamie Williams was indeed a tireless fighter. She was a leader in the state, regional and national women's clubs fought for a Republican delegation representative of both Black and White citizens of Georgia and scored first visits. Red light. Oh, my time's over. All right. She did a great job for women. Thank you, Mr. Speaker. I'll yield the well. Time for morning orders has expired for today. We're going on now to the rules calendar. Going on to the rules calendar. Eric will read the caption to Senate Bill 143. Senate Bill 143 by Senator Tipens, the 37th, Duke, and the 30th, Guget, the 51st, Miller, the 49th, Kennedy, the 18th, being taught in act to the men. Part three of Article A, the chapter 14, the top of 44, the fish go to Georgia, and it's at a relay in mechanics and material men. It's a conformer reference within the statutory form regarding waiver of lean and labor for material bond rights. This bill that I refer to the Committee on Judiciary, that committee recommends that this bill do pass. Chair recognizes Chairman Todd Jones to present the bill. Thank you, Mr. Speaker. Colleagues, Senate Bill 143 is a simple, but very important bill to the construction industry. Last year, the Senate and the House passed this language unanimously. We realize that we made one mistake. You will see that online 72. And both Judiciary Committees passed it through this year unanimously. And so I ask for your favorable consideration, and I yield the well. I would like to thank you for your time. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Gentlemen, I had no questions. Is there any objection? I'm sorry. There is a, what purpose does Chairman Setslow rise? Parliamentary commissioner. Mr. Speaker. I'd like to ask the gentleman, isn't it true there may be some questions about the details of this bill and answer what does this bill do? Well, I think that's sort of parliamentary inquiry. You need to go see him about. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agree to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no in the clerical. Unlock the machines. The chair here is none. The chair here is none. The chair here is none. The chair here is none. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 143. The eyes are 156. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 210. Senate Bill 210 by Senator Robertson of the 29th mill of the 49th bane of the 54th capacitors of the 32nd brass of the 28th. We title them back to amend, title 40. The fish bill of Georgia and Tate related motor vehicles and traffic assisted provide for definitions relative to registration and licensing of motor vehicles as bill them refer to the committee on motor vehicles. That committee recommends the disbale do pass. Chair recognizes representative Monter hand to present the bill. Thank you, Mr Speaker. And members of the House, today I rise to present to you Senate Bill 210. Senate Bill 210 is some enabling legislation by the House Georgians to have a new and improved digital license plate. This new technology has been vetted by the Department of Revenue for three years. The pilot program is currently ongoing and successful and is waiting on the passage of this bill. This plate is hard to remove and uses bank level 256 bit encryption. This bill is nearly identical to a bill this House passed out where they vote of 160 to 7. Thank you, Mr Speaker and thank you members for your favor of consideration. Mr Speaker, I'd here for questions if there are any. You do not have any questions. Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is not in the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machine. Chairman Tankersley, I'll authorize you to vote Chairman Martin's machine. Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 210. The eyes are 113 and the days are 47. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 169. Senator Walker, the 20th, the 17th, the 45th, the 49th, the 42nd and the 42nd. The title of the act will be on the 10th, the 13th. The official to Joe J. Amitete will be relating to general provisions regarding contracts for public works. This bill has been leveraged for the committee. The committee recommends this bill do pass. Chair recognizes representative Gunter to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, Senate Bill 169 is an extension of Governor Kemp's executive orders and permanently codifies the acceptance of electronic signatures and corporate seals for surety bonds. Before the pandemic, surety bonds required a raised seal and handwritten signatures to be completed. Through Governor Kemp's executive order, the acceptance of electronic signatures and corporate seals has allowed for quicker transactions. This bill has been spent up the process for all the parties involved in modernized way we do business in Georgia. If you're curious as to what a surety bond is, it's a three-party contract where the surety guarantees the performance of the second party and guarantees it to a third party. I'll take any questions. Okay, you have no questions. I'm sorry. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no in the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 169. The eyes are 162. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 34. Senate Bill 34, Senator Dixon, the 45th hatch of the 50th mull is the 53rd muller of the 49th jacks and the 2nd and others. We title them back to a man chapter 12 and title 19. The official go to Georgia and it's under relating the name change. So it's to provide that victims of human trafficking may petition for name change under seal. This bill ever referred to the committee on judiciary. That committee recommends that this bill do pass. Chair recognizes representative Bonner to present the bill. Thank you, Mr. Speaker. This morning I rise to present Senate Bill 34. It builds on the anti-human trafficking efforts of First Lady Marty Kemp through the Grace Commission co-chair to buy our own speaker pro Tim Jones. This bill is a continuation of the efforts of Chairwoman Mendy Ballinger and so many of others here in the chamber to this effort. SB 34 allows victims of human trafficking who are petitioning for name change to do so without that petition being made public. We currently allow those that are victims of family violence to do the same. It's a simple bill and with that Mr. Speaker, I'll be happy to stand for any questions. You have a question if you care to yield. How yield? Chair recognizes representative Cannon to your left for a question. Thank you. Do you yield? I do. So to make this just a little bit more clear, does this mean that now there is not an ad that will be run in the local legal organ for that person's name change and protects their security and privacy? That's correct. If there are other questions, Mr. Speaker, I'll go to other questions. Thank you. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? Yes, so the clerk will lock the machine on the passage of Senate Bill 34. The eyes are 162. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 168. Senate Bill 168 by Senator Walker, the 20th, the 17th, about the 55th, the 49th, the 42nd and others. We title an act to amend part one of our seven chapter two, title 14. The official go to George Annett, Senate relating to meetings. So it will provide that corporations may hold annual shareholders meetings and special shareholders meetings by means of remote communication. Does bill ever refer to the committee on banks and banking? That committee recommends that this bill do pass. Chair recognizes once again, Representative Gunter. Thank you, Mr. Speaker. Ladies and gentlemen, Senate Bill 168 is the same bill that we passed out of here, which was House Bill 306. It has a couple of changes though that I think are very good changes. One of them is online, 27, which changes the word solely to holy. And then section 4 was added in to make this a approved on the signature of the governor. Some of the corporations in Georgia have their annual meetings prior to July 1. So this was to help them with that. And basically what this bill does is it's a virtual hearing or virtual shareholder meetings, which can be done holy or partially. And that's basically what the bill does. And I would ask for your favorable consideration. I'll take any questions. You have no questions. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 168. The eyes are 161. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 163. Senate Bill 163 by Senate. The 17th, Kennedy 18th, hatched the 50th, Jones the 22nd, and read the 33rd. To be entitled to an act of men, part 2 of Article 3, Chapter 3, Title 38, for the official code of Georgia and Attedity relating to judicial emergencies. So to provide for the suspension of statutory speed trial requirements when compliance with such statutory speed trial requirements becomes in practice. We'll following a judicial emergency. This bill I refer to the committee on judiciary. The committee recommends that this bill do pass by committee substitute. Representative Gunter, my dying choir. How much more of your, the Gunter agenda is left after today? I'm not real sure. That's not real optimistic there. There's still more out there. Chair recognizes representative Gunter to present the bill. Thank you, Mr. Speaker. All right. Ladies and gentlemen, we heard from Chief Justice Melton on Tuesday about the backlog that has accumulated in our superior and state courts due to the suspension of jury trials during the pandemic. He spoke about this bill specifically Senate bill 163 is legislation amending our code 38 3161 and 38 3162 to authorize the continued tolling of statutory speedy trial requirements following a judicial emergency. This bill does not impact constitutional speedy trial. That's still there and you can find that online. So 134 to 135. The passage of this bill is both urgent and time sensitive. The court supports this legislation because they foresee a systematic crisis on the horizon if they can't continue to told these deadlines. This tolling would occur at the local level not statewide to provide a targeted approach. Current authority for a judicial emergency is 90 days and initial 30 days and plus two 30 day extensions beyond that. Without this legislation, once the governor's declaration and the corresponding judicial emergency is lifted, if a defendant makes a proper speedy trial demand under 1717170 or 17171 and is not tried within the applicable timeframe here she shall be absolutely discharged and acquitted. As the chief justice said, we need to have a system that actually determines whether people who have been charged and indicted with a crime or guilty or innocent before allowing them to walk free. Despite the efforts of judges to keep their jail populations down there is still a large number of inmates in jail waiting for their cases to be heard. That means far more cases awaiting trials which will have to proceed much more slowly because of the safety precautions and physical distancing. Because so many of these cases are not yet indicted or charged due to the tolling deadlines, a statutory speedy trial demand cannot yet be made. The bill has a sunset of June 30, 2023. It is targeted to help the courts get through this large backlog. And with that Mr. Speaker, I'll open for any questions. Do you yield for questions? Yes, sir. Chair recognizes the chairman of the Judiciary Committee. Chairman, abstra- should you are left for a question? Is it gentleman yield? Aye, you. Isn't it true that this legislation is the top priority of the Judiciary right now is referenced by Chief Justice Milton in the state of the Judiciary Speech this week and requested the General Assembly by the Judicial Council? That is correct. All right, important bill. Thank you. Thank you. Do you further yield? I do. Chair recognizes representative Jasmine Clark to your left up in the gallery for a question. Thank you, Mr. Speaker. Does the gentleman yield? Aye, you. So what happens to the defendants or the people who are requesting a speedy trial? How long might they be sitting in jail waiting for a trial under this bill? The way it works is that the chief judge of the Superior Court of that county can ask for a suspension of the speedy trial statutes. The longest period, and that's based on the longest term of court in the state of Georgia is eight months. So it could be up to an eight month period. Does the gentleman for the yield? I do. Is there any consideration for during this possible eight months that a person who has not been convicted of anything for them to be released from incarceration while they await their speedy trial? Is it possible that people would be incarcerated for the entire eight months prior to being convicted of anything? It's possible both ways. Thank you. And that's because of the discretion of the judge in allowing a bond or not. Thank you. Do you further yield? I'll take one more. Chair recognizes Chairman Hitchens to your right for a question. Well, the gentleman yield. Is it not true that our subcommittee on appropriations put extra money in there this year to bring senior court judges back to deal with this problem? That is true. Yes, sir. Thank you. I yield the well. Chairman is yielded to well.\n\nIs there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. What purpose does representative Wolenski rise? Parliamentary inquiry. Statuary inquiry. Is it not true that many have been sitting over this whole year not getting to go forward with their trials? And one of the most important things that this bill is recognized at the highest priority for these judges to recognize who's been sitting the longest? I'm sure the gentleman knows that about which he speaks. Well, purpose does representative Reeves rise? Parliamentary inquiry. Statuary inquiry. Mr. Speaker, is it not true that over the last year prosecutors, defense attorneys, and judges have worked together in an unprecedented way to attempt to get as many people that are currently incarcerated, waiting trial, a bond situation that they can make? I'm sure the gentleman knows that to be true. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 163, the eyes are 157. The nays are six. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 221. Senate Bill 221 by Senate Morals, the 53rd Mill over the 49th, Duke and the 30th, Gute and the 51st, Kennedy the 18th and others to be entitled to amend Chapter 5, the Title 21 of the fiscal to Georgia and to relay ethics and government, so to provide for a definition to provide for leadership committees and to provide for chairpersons. This bill having referred to the Committee on Judiciary that Committee recommends that this bill do pass. There are recognizes that minority caucus whip representative Kelly to present the bill. Thank you, Mr. Speaker. I bring before you a Senate Bill 221 LC28192 and it does a simple thing. It creates eight leadership committees that have the ability to raise funds like they currently can today but allows them the opportunity to coordinate with their respective candidates. Those eight leadership committees are made up of first the governor and then a nominee for a political party for governor, the lieutenant governor and the nominee of another political party for lieutenant governor. The respective majority and minority caucuses in this house and the respective majority and minority caucuses of the Senate. Currently these committees exist and are able to raise funds but when they go to expend those funds they have to do it through an outside group if they want any direct coordination. This would eliminate that need. That's simply what it does. This bill is full of transparency and sunshine because as you see, you see that once $500 raised then the funds will have to be disclosed in the same way our individual campaign committees are disclosed. Also when funds are expended on this measure they have to have a disclaimer saying that it comes from that leadership committee. Mr. Speaker, I'd be glad to yield for some questions on this simple bill. Do you yield? Yes, sir. Chair recognizes representative Bruce to your right for a question. Robert gentleman, you. I sure will. Is the purpose of this to give the political parties the opportunity to spend more money directly on a candidate of their choice? Is that what you are suggesting? You know, the political parties as an organization already have this ability. What this does is seek to give our individual caucuses the ability to function like the parties do today. It will allow us for the funds that we raise to be directly spent without having to go through the party. And it is very clear that both sides of the political aisle get treated the same in this bill. The gentleman further here. Sure. So the intent is to have an unlimited amount of money to be able to be spent by the caucus on the candidates of their choice. Is that correct? Currently that can be done now. It only has to, but it has to flow through the political party to coordinate. So that's the only thing this changes is a coordination. I appreciate that question. You further yield? I will. Chair recognizes the minority caucus will representative Wilkerson to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Probably glad to. I appreciate you bringing this bill forward to help everyone in this chamber. I look forward to your yes, but. Well, let me continue. You mentioned that it's going to be similar to what we do as a candidate. So does that mean there's going to be a prohibition on raising money during session? Currently, as you know, our caucuses have different organizations that do not or not mail by that restriction. I only think that changes in regards to our caucus activities is the ability to coordinate with our candidates. But the disclosure requirements for these will be exactly like we are individually. OK. Does the gentleman further you up to more questions than I'll be done? I'll be glad to. Thank you, sir. I'm looking at ethics.ga.gov and I'll tell you, this would not, would this not expand the gap because I know that some caucuses have trust and some do not. Some raise money during session, some do not. So do you, is there any concern that this will just amplify what happens or would you make a commitment that every time a check is in the hallway that we would have a bipartisan nature and make sure that someone from both parties goes out and talk to a lobbyist to get that check from them? I can't spend other people's money. This isn't Washington the belief that they do up there. So I can't guarantee you that, but everybody will have the opportunity to. OK. So you have no concerns over money being spent during session while we're voting on legislation. I think both caucuses, just like they do today, will still continue to have the opportunity to decide whether they raise those funds. We have the ability to do that today. This doesn't change that. The minority caucus can raise funds during session. The majority caucus can raise funds during session. I think both caucuses make very conscious decisions of how they handle that. I know at least we do. I hope y'all do as well. Do you further yield? I'll take one more, Mr. Speaker. Chair recognizes the majority leader of the House. Your burns to your right for a question. Gentlemen, yield? I will. Mr. Wim, is it not true as I read the bill and per your statements that this bill impacts both parties equally? You're exactly right, Mr. Leader. That was a core piece of this is making sure that we weren't tilting the balance in favor of any political party. We wanted this to be something that would be bipartisan in nature in terms of how the parties were affected and hopefully as a result we'll have some bipartisan support. EO for another question. I'll yield for another. So you could say it's an equal opportunity bill. I would agree with that. I would also say Mr. Leader that's a very transparent bill because of the reporting requirements. That would be my last question. If you'd yield one more question, please. Mr. Wim. Mr. Wim, with this language and this bill and this law not only require the full disclosure of all funds spent and received giving full transparency does not exist now. That's exactly right, Mr. Leader. I appreciate those questions. We made great efforts here to make sure that the funds that were raised would be disclosed and the funds spent would be disclosed as well as putting a disclaimer on the expenditures that mentioned the where that the leadership committee was responsible for that spending. So I appreciate that question. Thank you for your work. Thank you, Mr. Leader. Mr. Speaker, I know there's other signed up to speak. So for now I'll yield the well and maybe come back in a few minutes. Thank you. Okay. We have a minority report. Is there any objection to the previous question being ordered? The chair here is none of the previous question is ordered. We will now go on to the minority report by rule of the House a total time of 20 minutes. Chair recognizes representative Evans to speak to the minority report. Thank you, Mr. Speaker, ladies and gentlemen of the House. I rise in opposition to Senate Bill 221. Our laws have long reflected a policy position against PACs coordinating with individual campaign committees. That's been a staple of our campaign finance laws for a long time and I have a big problem with us so flippantly with a switch changing that long standing public policy that we've all supported over the years. But I have a very practical reason for talking to you today about why I would suggest that you vote against this bill. Now, I'm a proud Democrat. Many of you in this chamber, you're proud Republicans. I agree with most of my party's positions and my leadership. We normally are on the same page. But I also have an independent streak and I know a lot of you in here do too. On the D side of the aisle and on the R side of the aisle. So I want to just have you think to yourself and perhaps ask yourself a rhetorical question. Do you really want to vote to give your caucus leadership, whoever they may be, now and in the future, more power over your fate to allow them to use unlimited campaign contributions and coordinate with your opponents if they think you're getting out of line? Not only to do it, but to threaten it to hold that over your head in a way that they can't right now. Do you really want to vote to give away your own power? I leave you with that and I yield remaining time on the minority report to Representative Wolensky. Chair recognizes Representative Wolensky to speak to the minority report. Thank you, Speaker. Thank you all here today. So I've been down at the Capitol since 2010. I came down here helping out one of the groups and I spent a lot of time in the Judiciary Committee watching Chairman Wendell Willard was there at the time. And I've been here while and I was elected person in 2018 and one of the proudest things I have always had is that we are not like Congress. We're not like the federal government. Everybody will always ask me. What's the difference between Georgia and the federal government? And I'll say there's too many things. Two main things. One is as we know, 95 percent of the time, hopefully 98 percent of the time, we all agree. We're working to make our state better. We are working together. We get along. We hang out with each other. I'm very proud of that. The other thing I've always been proud to say is that the money, there's a big difference in how money is used, how money is applied, and there are barriers in place to keep our campaigns and everything involved safe. This bill will make it more expansive on how money can be used. As Representative Evans just said, this will allow a leadership committee to directly coordinate with a large amount of money. As we know, we've heard from both parties on the federal elections in Georgia, there's been so much money raised. It's been a major concern. And I'll ask a similar question and just ask, do we want to make it more expansive and bring more money into Georgia politics? Because I know that I have been here helping and now as state rep for almost 10 years. And I've always been proud to say that we are different. And we have elections where people work hard and people represent their constituents. And they speak for their constituents because of the constituents elected them, not because their leadership. I've always been proud to say. I've always been proud to say. I've always been proud to say that the money is different here. That there are barriers in place so our constituents elect us, not that a leadership team or others appointed who was elected. And when I go back to my constituents, I'll be able to say that I stood up and made sure money is still being used in Georgia and I asked for a no vote and I relinquished the rest of my time to Representative Wilson. Thank you, Speaker. Here recognizes Representative Wilson for the balance of the minority report. Thank you, Mr. Speaker and I appreciate my colleagues. Why are we here? As we get later and later in session, I'm sure it's a question on a lot of our minds. Why are we here? And I would venture that for almost all of us, the answer would be public service to serve the public. But who is the public? Who is your public? The only purpose that this bill serves is to funnel more money into our politics. That's all it does. And fundamentally, I believe, and I think most of you believe, we need fewer ways to get money into politics, not more. This bill should be called the Gold Dome Swamp Bill because that's what it does. The majority leader referred to this as an equal opportunity bill. And he's right. It is an equal opportunity bill. An equal opportunity at corruption and equal opportunity at tilting the scales. This would only make it harder for us to serve the people of this state. Money always finds a way into every nook and cranny that we allow it to. And it keeps from putting the interest, it keeps us from putting the interests of our citizens first. It can incentivize, for instance, passage of liability shields for businesses instead of protections for workers. There are no limits on the amount of money that donors can give to these committees. So this bill would create even more incentives for special interest to donate unlimited funds. Deering session. Let me say that again. Deering legislative session. It gets us closer to that quid pro quo that our laws today acknowledge we need to be wary of. We need to prevent. This is a very way to get around public corruption. Not only would we have coordination between these leadership committees and individual campaigns, but there would be coordination between the committees and the well-moneyed interests in the hall. Just think about this. Financial incentives from the leadership of these funds, potentially for individual legislative actions taken by members. Just think about that. This is the wrong direction. And if I'm being truly honest, it's very telling to me that we're headed down this path of adding more unlimited amounts of money in politics and decreasing the transparency over it at the same time that we're making it harder for Georgians to vote. We're raising barriers to ballot access for folks working long hours, six or seven days a week while creating yet another way for well-moneyed interest to influence our elections and influence our legislative process. This bill has our priorities completely out of order and I would urge you to reject the Gold Dome swamp bill. Mr. Speaker, I'll leave you with this and my colleagues. I can assure you that every one of our constituents are watching us this session. The stakes are very, very high. And they're watching this bill too. This bill will show them where our priorities lie, where your priorities lie, with them or with the protection of your seat, with them or with the well-moneyed interest in the hallway. I would urge you to make your choice accordingly. Thank you, Mr. Speaker. I yield the well. Gentlemen, as yielded the well, the chair of the committee has asked for the chairman's time, which is also 20 minutes, chair recognizes chairman of the administration. Thank you, Mr. Speaker. I'll yield the chairman's time to the majority whip, Representative Kelly. Majority whip, Kelly, is recognized. Thank you, Mr. Speaker. I'm going to be brief here because we heard a lot of talk about what the bill doesn't do. I'm just going to again be very clear here. This bill will take money that currently is being spent in dark money packs and it will bring sunshine on the back. It will make clear the donors that are coming from New York and California that that has to be shown now. What we're looking for here, Mr. Speaker, is just an effort for transparency and the ability to coordinate for our caucuses. But no one's been forced to do this. I would ask my colleagues on the other side of the aisle. If you don't want to support it today, I hope that you'll make the decision to be principled in your opposition and just not establish one because this isn't mandatory. This is selective. And so if you're going to be as critical today, I hope you'll be as mindful when you have the opportunity to do that. And Mr. Speaker, I'll yell the well. Gentlemen, as you'll do well, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is now in the report of the committee, as agreed to. Now this bill now pass. All those in favor of the passage of Senate Bill 221 will vote aye. Those opposed will vote no and the court will unlock the machine. What purpose does the minority caucus whip representative Wilkerson? Parlement inquiry. State your inquiry. I will gladly make that commitment to my friend, the fellow whip. If he returns that money to DC that they just sent us this week, the $1,400 plus all the child tear tracks, child care tax credits, the Republicans all voted against. So I will make that commitment if he writes the check for the same thing. What purpose does Chairman House to arise? The Parliamentary inquiry. State your inquiry. Can we change the tax cuts now? What's the ruling on tax cuts? I think that may have to be decided by a court somewhere. Thank you, because I don't think that is it not true in the new COVID bill that they said something about us not doing that, which cuts to say. Thank you. What purpose does Chairman Bershet rise? Parliamentary inquiry. State your inquiry. Isn't it true, Mr. Speaker, that currently there are no prohibitions whatsoever for any pact in the state of Georgia to raise money at any time or at any amount? I believe that is to correct. All right, we're going to do one more parliamentary inquiry and then we're going to close it out. What purpose does Chairman Oliver rise? Parliamentary inquiry. State your inquiry. Isn't it true, sir, that in the early part of our careers, in a very brief period of time, there was legislative effort to reduce the amount of money in politics and the recent two-thirds of our career. Every single step has been to increase the amount of money that comes into politics. Well, I know that a lot of money got spent here in Georgia last year. I don't know who spent it or where it came from. And all members voted. And all members voted if so, the clerk will lock the machine. From the passage of Senate Bill 221, the eyes are 96, the nays are 69. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 66. Senate Bill 66 by Senator Anna DeVarque, the 31st paying in the 54th, all is the 53rd. The cows with 46 strictly under the 17th and others being taught on act to amend, title 20, and title 48th, Bishop of the Georgia and Teddy relating the education and revenue and taxation respectively. So it's authorized a nonprofit corporation incorporated by the Georgia Foundation, the public education, the received private donations this bill ever referred to the committee on education that committee recommends that this bill do pass. It recognizes representative Gamble to present the bill. Thank you, Mr. Speaker, colleagues. I rise today to present to you Senate Bill 66. And basically what this bill does is it merges two existing foundations. Senate Bill 66 merges the Georgia Foundation for Public Education and the Innovation Fund Foundation. The Georgia Foundation for Public Education was created in 2010 and a 501C3 arm was attached in 2019. It has a mission to support our public schools in a broad way by raising philanthropic money. The Innovation Fund Foundation was created in 2013 as a 501C3 to raise money and award grants to schools and partners for innovative programs. A 100% state tax credit was added in 2017 that the Innovation Fund Foundation would manage. This was the brainchild of former House Education Committee Chairman Representative Brooks Coleman. Many of you will remember his passion for this issue. So in summary, all this bill does is merge these two foundations supported by both foundations and the Department of Education so that they can maximize their ability to support our public schools. With that, Mr. Speaker, I ask for this body's favorable consideration. I'm happy to yield for any questions. You yield for one question? Yes, sir. The Chair of the Education Committee Chairman Dubnik, to your left for a question. Thank you, Mr. Speaker. Mr. General, I do. I do. Representative, is it not true that this simply combines two nonprofits into one to allow for greater efficiency and effectiveness? You are correct. That's what this bill will accomplish. And just to confirm, isn't it true that this does not impact the tax credit? This does not impact the limit that can be used to support public education, nor does this in any way limit the grants that could go to innovation. That is correct. Everything will be the same as far as the fundamentals of both of these foundations. They will just exist together and it will allow them to have better synergy to raise money for our public schools. I appreciate your question. With that, Mr. Speaker, I yield the will. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair hears none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The bill is bill 66. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 66. The eyes are 159. The nays are two. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 148. Senate Bill 148 by Senator Hostel, the 50th. Miller, the 49th. Butler, the 55th. Dugan, the 30th. Parent, the 42nd and others. Meantado, Mac to the men, total. The 28th. The official go to Georgia and attendee will lead the general assembly. So is the creed. The 2021 special counsel on tax reform and fairness for Georgia's and special joint committee on Georgia revenue structure. Senate Bill them refer to the committee on budget and fiscal affairs oversight. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Hawkins to present the bill. Thank you, Mr. Speaker. I bring to you Senate Bill 148 today. This bill, I've heard quite a bit of comment from my colleagues and I appreciate that and I appreciate your speaking to me about this bill. In my heart, I feel like this is a good bill. This does establish, reestablish once again from what we did in 2017, a special counsel on tax reform and fairness for Georgia's and then also a special joint committee for Georgia's revenue structure. It's the special counsel that provides a study and a study by and their counsel made up of experts in the economy in business. Also includes the commissioner of economic development. This group comes up with the suggestions and ideas that are passed on to the special counsel, made up solely of legislators who will then move legislation forward to this house being taxation bills. And our speaker appointing these bills at a timely manner.\n\nYou know, when this legislation actually occurred in 2017, and what we got out of that legislation was the reduction or removal of tax, energy tax or manufacturing, changes in our auto tax, changes in the transportation fuel tax, and it created agate exemptions. The benefits of this, these proposals were felt throughout this state from cities to our rural areas. So that's what this bill does. And Mr. Speaker, due to the late time, I think I'll take no questions. And when the yielded the well, Chair recognizes the minority caucus whip, representative Wilkerson to speak to the bill. Thank you, Mr. Speaker. I'll also be brief. But I think it's a great idea to do to update the tax reform council. My only concern is that I look as I look through lines 55 through 66, I don't see a CPA on here. I don't know how you do tax reform without having a certified public accountant on it. Anybody that talks taxes probably does not talk to their economist about it. They probably talk to an accountant. And so I would recommend that it's a good bill. I would ask that we vote it down, send it back, and then add in their certified public account or two to make sure that we actually know what we're doing when it comes to tax reform. And I'll take an I'll yield any questions. You yield for a question. I do. Chair recognizes leader Beverly, minority leader Beverly for a question to your left. The gentleman you. I do. The author of the bill, I know he left a well pretty quickly without answering this question. Maybe he can help me out with line 58 and 59. What is a nonpartisan fiscal expert? You know, as the CPA, I have no idea what a nonpartisan fiscal expert is. I guess when I talk to my like exterminator, he thinks he's an expert, but I have no idea. The Senate does think sometimes we don't know what they're doing, but I'm not sure. But that be someone who just balances their checkbook. Could that, I mean, is for half of Americans, as you remember, we actually are doing a class on balancing checkbooks, et cetera, because people don't do it. So yes, I would consider that a fiscal expert. Thank you. Thank you, Mr. Whip. I will. If there's no more questions, I would yield the well. Thank you, Mr. Leader, for that question. I was wondering what that was, too. Yeah. So, and like I said, I asked that you vote this down. We reconsider it. It's back to rules and put a CPA, which I do know what that is on there and move this back to the Senate. But thank you. I yield the well. All right. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair hears none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill. Will vote aye. Those opposed to vote no and the clerk will unlock the machine. What purpose does representative Ridley rise? Parliamentary inquiry. Parliamentary inquiry. Is it not true, in my opinion, that this is a backdoor way to do tax increases by using this council? I'm not sure I can say no to that. Thanks, sir. What purpose does representative Carpenter rise? Parliamentary inquiry. Statue of inquiry. Is it not true it would be extremely rare for a tax council to suggest lowering taxes? I will adopt my same answer. What purpose does representative Duke's rise? How many ringgroom is speaker? Statue of inquiry. Is there any specific reason why there was outlined in this bill that there was no one from rural Georgia even considered as an ex-official member? You would need to go across the hall and ask the author representative. Thank you, Mr. Speaker. All right. We're going to do a couple more and then we're going to vote it. What purpose does chairman Martin rise? Parliamentary inquiry. Statue of inquiry. Isn't it true, Mr. Speaker, that tax that was mentioned on energy was done by former member of this house, Jeff Lewis, and he's been gone 12 years, so it was done long before 2017. Isn't that true? Actually, I think that was done in the bill that we did the last tax thing, 2013 or so by Governor Deel. The only reason I mentioned that is, and it's true, Mr. Speaker, the reason I mentioned that is, didn't want anybody to think that that commission necessarily brought back a tax decrease. That they did not bring one back. All right. What purpose does chairman Houston rise? She waves. All right. If all members voted, have all members voted. And if so, the clerk will lock the machine on the passage of Senate Bill 148. The eyes are 20. The nays are 139. This bill having failed to receive the requisite constitutional majority is therefore failed. Okay. The clerk will read the caption to a group of privilege resolutions. Honoring the life and memory of memory west Dunahoo senior. Honoring the life and memory of Reverend Bryant Ornell Reigns. Honoring the life and memory of Don Stevens. Honoring the life and memory of Diana Catherine Colbert Wayne. Honoring the 135th anniversary of Ebenezer Baptist Church, commending and congratulating Prem a serif in upon the grand occasion of her 90th birthday. Commending and congratulating Jane Richardson senior. Recognizing March 11th, 2021 as the 10 year anniversary of the devastating earthquake in Great East Japan. Congratulations, commending Foster Brady Farms. Recognizing commending a swear little peak for her outstanding work as a speaker advocate and businesswoman. And gradually in the Camden County High School wrestling team. Commending the Carol Carrollton High School and debate team on their state championship win. And recognizing commanding and mon looking associates and for other purposes that completes the reading of privilege resolution. Is there any objection to adopting the privilege resolutions that chair hears none and the resolutions are adopted? All right. If you signed up for an announcement to make your way to the front of the chamber. And while we're doing that, we've got several birthdays coming up. Please help me wish a happy birthday today to Chairman Ed Setsler. Chairman Setsler. And on Friday, wish a happy birthday to Representative Doreen Carter. Representative Donna McLeod. Representative Viola Davis. Chair recognizes for an announcement. Chairman Dickey. Thank you, Mr. Speaker. I know many of you going to be here early Monday morning for some committees. So the Georgia Calamon Association is going to have you a state biscuit Monday morning from 7.30 to 9. I'm in the Mitchell Street between TLOB and Capitol. So I hope you'll stop by. I know Chairman England have to come back outside. He'll be here a lot sooner than 7.30 and come get his biscuit. But Monday morning, thank you. Chair recognizes the chair of the minority caucus. Chairman Mitchell for an announcement. Thank you, Mr. Speaker. There will be lunch provided to the minority party in room 216 immediately upon the adjournment. I look to see you there. Thank you, Mr. Speaker. Chair recognizes Chairman Matthew Hack for an announcement. Thank you, Mr. Speaker. State Planning and Community Affairs will have a short meeting today at 3.30, 606, CLOB. Thank you. Chair recognizes Chairman Ballinger for an announcement. Thank you, Mr. Speaker. We have a juvenile justice committee meeting. We'll be meeting today at 1 in room 403. There's also a Zoom option for those of you who prefer that. But look forward to seeing you at 1 in room 403. Thank you. Chair, representative butner for an announcement. Thank you, Mr. Speaker. Working families will be meeting today. Your lunches will be in room 310 of CLOB and we'll of course have our meeting by Zoom. Thank you. Chair recognizes representative Holland for an announcement. Thank you, Mr. Speaker. The City of Atlanta delegation will meet tomorrow, Friday at noon via Zoom. Thank you. Chair recognizes Chairman Dollar for an announcement. Thank you, Speaker. The House Creative Arts Entertainment Committee will meet today to a clock over in 5.06. We have one bill on the agenda and we'll be getting another update from industry experts. Thank you. Chair recognizes Chairman Collins for an announcement. Thank you, Mr. Speaker. The House Public Safety and Homeland Security Committee, subcommittee A, will meet at 1.30 in room 415, CLOB. Thank you very much. That completes the announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. The Speaker, I moved to this House, stand adjourned until 1 p.m. Monday, March the 22, 2021. The majority leader has moved that this House be adjourned until Monday, March 22, at 1 p.m. Before I call for the vote, let me remind you that we will be Monday as a testing day. We will be testing from 7 until 11. So be sure to get your test and again, we're encouraging committees to meet very aggressively Monday morning and later in the day if you choose. Okay, the motion was that this House adjourned until Monday, March 22, at 1 p.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Monday, March 22, at 1 p.m.",
  "updated_at": "2026-02-13T23:18:51.323049+00:00"
}