{
  "video_id": "O1Uf8jr9m48",
  "url": "https://youtu.be/O1Uf8jr9m48",
  "title": "Georgia House - Day 2 (2026-01-12)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-01-12",
  "duration_minutes": 56,
  "summary": "## Georgia House of Representatives - Day 2, 2022 Session (January 12, 2022)\n\n### Overview\nSecond day of the 2022 session, the morning after Georgia Bulldogs' national championship victory. Session opened with championship game highlights played in the chamber.\n\n### Key Actions\n- **SR 362**: Joint resolution notifying Governor that General Assembly has convened (adopted)\n- Committee of Notification appointed (8 members including Rep. Meeks, Rep. Bonner, Chairman Hogan)\n\n### Bills Introduced (First Reading)\n- **HB 870-874**: Local bills for Bullock County Board of Commissioners, Bullock County Board of Education, Bibb County redistricting\n\n### Morning Orders & Memorials\n- **Officer Ricky Tottenson**: Moment of silence for Newton Police Department officer (18-year veteran, school resource officer known as \"Officer T\") who died in the line of duty\n- Coweta delegation presented the memorial\n\n### Announcements\n- **Local Redistricting**: Chairman Tankersley reminded members about January 7th memo on local redistricting procedures; bills affecting 2022 elections should pass by first week of February\n- **Senator Cleveland Memorial**: Originally scheduled for Friday, postponed to April\n- **Keep Georgia Wild Day**: Scheduled for January 13th in the rotunda at 9 AM with Governor and conservation groups\n- **State of the State**: Governor's address scheduled for Thursday, January 13th\n\n### Notable Moments\n- Championship game celebration video played at session opening\n- Speaker joked about Rep. Gullet attending a different bowl game (and losing)\n- Birthday recognition: Chairman Jan Tankersley\n\n### Adjournment\nAdjourned until Thursday, January 13th at 10 AM (State of the State day).",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe arrow convening, having arrived, all members of this house will please report to the floor and take your seats. All members will report to the floor, the clerk will ring the bill.\nWe're about to have the morning roll call.\nAll right, all members present will please vote green to signify their presence in the chamber and somebody please vote representative Douglass's machine.\nhave all members voted have all members voted you know so the clerk will lock\nthe machines. Okay, y'all told me when I left here Monday to bring back a win.\nnot only did I bring back a win they gave me a pullback to block for me on the way back\nYeah.\nWelcome to the Calibur Play Interim.\nNational Championship game presented by AT&T,\na delusion of SEC rivals.\nAlabama and Georgia.\nYoung gets it to fall.\nNobody's not gonna get there.\nLower seed.\nSee, they've taken to Bowers.\nHere's a downfield shot.\nGarg Piggins, a downbeat catch.\nYoung on the move.\nBang Pettling.\nHey there, Garg, I'm back in the 20.\nI see he was actually been flicking\nand he just haven't found the end zone.\nYoung launches downfield.\nThe balance lay and it's picked up by Smith.\nA lot of a wanker.\nWho is to make it?\nFor the front tonight, but it's blocked.\nIt's got blazing speed, James Cuck in a foot race, and the tie cracking down, they finally get him inside the 15.\nAnd Zeus White muscles in for a pretty good blocking tie in this match, and now another flag, and it launching, Mitchell caught it.\nTouchdown, Georgia.\nI don't like the spot at all.\nYou're scurrying along, you're gonna go for it.\nBowers has got it.\nHe's gonna block the touchdown, Georgia.\nYou need 10, they fucking four.\nFrom the pocket, launching downfield,\non your ground, and intercepted.\nKingley Ringo has an escarp down the sidelines.\nAll the way to the end zone, and Georgia,\nIt's going to cover the crimson tie in the back six to jail, and one more fight for the Georgia defense.\nGeorgia on the mountain top.\nDemons be gone, and the crowd is over.\nIf that don't bring tears to your eyes, nothing will.\nThe doorkeepers will please close the doors and keep them closed.\nBy the way, y'all got the memo before session, we reconvene that we would not have groups\nin this session except by a special order of the speaker's office.\nThey're coming.\nFor us to want to talk about his budget up there the other night after it was over, it depends\non one day you bring him.\nWe're going to begin our day with Scripture reading and prayer by the Chaplain, after which\nwe will pledge allegiance to the flag of our country.\nOur Chaplain this morning will be introduced by the gentleman from the 179th House District,\nthe chairman of the Committee on Information and Audits, chairman Don Hogan, chairman Hogan.\nThank you, Mr. Speaker.\nToday's pastor is Mark Baker.\nHe is the founder of the great works ministry\nlocated in Brunswick, Georgia.\nHe was born and raised, where he was born and raised.\nHe's a man of vision.\nHe's a dynamic teacher of faith and holiness.\nPastor Baker is known as a very humble servant\nwho is energized and pushing the vision of others.\nIt is the desire of Pastor Baker to help each generation\nbelieve in the promises and faithfulness of God.\nHis teaching have been told globally\nand has impacted many lives in various ways.\nHe's strongly supported by his loving parents,\nJames and Luminous Baker, his beautiful wife,\nLady Laura Baker and their children.\nAnd he's the glue I heard this morning\nat the chamber about somebody being the glue\nthe whole thing is together. He was one of the ones that had the glue, the whole Brunswick\nand Glen County together in our recent tragedy. We worked tirelessly and he did also in helping\ntry to heal our community and he's a great work of ministry. So I welcome Pastor Mark Baker.\nThank you so much to our speaker, David Rosden, as well as to my good friend again,\nRepresentative Don Hogan.\nI'm blessed to be here on this morning and I'm blessed to see so many of you off faces\ntoday.\nLet us pray.\nFather, we thank you for this time that you allow us to go into your word, and we pray\nthat you were on these lips of clay and let us speak\nnothing but your truth, that your name will be glorified\nand that your name will be lifted up in Jesus name.\nWe do pray, amen.\nThis morning I was, since I was asked to do this,\nMark chapter 11 and version number 22 has been a very\nfamiliar verse of scripture for me for many, many years\nbecause it speaks of Jesus and he tells his disciples\nafter he had just cursed a fig tree that had not buried fruit for three or three years.\nAnd so Jesus said to his disciples in March 11, verse 22, he said unto them, have faith\nin God.\nAnd many times in life we find ourselves in situations like all of us are in today having\nto find out where do we get faith from.\nAnd in the word of faith it says, and more than anything, faith is simply personally believing\nin God's Word.\nAnd in Genesis chapter, we found out in scripture\nwhere as it talks about how God created the heavens\nand how God created the earth.\nBut John one in one, I love it, it says,\nin the beginning was the Word and the Word was with God\nand the Word was God.\nJoshua 1 and 8 tells us again that we\nshould never let the book of the law depart from our mouths,\nbut we should meditate in them day and night\nthat we may observe to do according to all that is written in it, but then we'll make our own\nway prosperous and then we will have good success. I often tell people I wake up every morning,\nnot just because I'm a pastor, but I try to acknowledge God in His Word because in Proverbs\nchapter 3 He says in all of your ways acknowledge me and I will direct your path. And so as we acknowledge\nGod. And I'm sure all of you all this morning, you acknowledge God in all of your ways.\nProverbs, Psalms 103, in verse number 20, it says, blessed the Lord, you his angels,\nwho excels in strength, who do his word, heeding to the voices of the words of God. Every\nmorning, angels are looking for us to acknowledge God. And how do we acknowledge God again? We\nacknowledge him through his word. And so this morning, I want to\ncontinually encourage many of you all as well as myself. Let's\ncontinue to acknowledge God. And the way again, we acknowledge\nhim is we acknowledge him through his word. James chapter one, it\nsays, brothers, count it all, Joel, when we fall into various\ntrials, knowing that the testing of our faith, work of\npatient, but let patient have his perfect word that may we may be\nperfect, not better than anyone, not enticing anyone, but let\npatient have his perfect word that we may and that we may. And he\nsays, if any of you like wisdom, he say, let him acts of God, who\ngives to all men's liberal without reproach. He said, I will\ngive it to you. But he say, let him acts in faith. As I close\nthis morning, Hebrews chapter 11 verse number one, it says,\nNow faith is the substance of things hope for.\nAnd it is the evidence of things not seen.\nWhen we look at second Corinthians chapter four,\naround about verse number 16, it says,\nwhy we look not at things which are seen\nfor the things which are seen is just temporal.\nIt's the thing that is not seen is eternal.\nMany people ask me again and say,\nwhy do you continuously speak the word this way?\nBecause Isaiah said, God Himself says,\nbring my words back to my remembrance and that's so important in the hour that we're living in\nwith all that is taking place in our land and I want to encourage many of you all today,\nespecially with love ones. I dealt with so much over these past months, even with this virus,\nbut I'm constantly holding to Isaiah chapter 53 where he says he was wounded by our transgressions\nand he was bruised by our equities and the chastisement of our peace was upon him.\nAnd by his stripes, we are healed. First Peter 2 and 24 says, you were healed.\nSo if he healed us on that cross, you may have a loved one. You may have someone close to you,\nbut I want you to continually to have the faith of God. Even now, he was loving him in verse number\nsix is without faith it is impossible to please God and it says he who comes to\nhim they must first believe that he is a rewarder of those who diligently seek\nhim and I want us to not just to believe just to believe I want us to have faith\nand have what I just gave you Mark 11 in verse 22 have faith in God and what\nWhat is that faith?\nWe're almost 4 and 17 and he called those things which be not as though they were.\nThis morning as I pray with you and I pray for your family and I pray for all that the\nLord will do for our great country and our great state and I pray by faith that everyone\nthat is here this morning, that God will continually to answer your prayers according to that same\nmark, chapter 11.\nIt says you can say in verse 23, it says you can say to this mountain, mountain be\nYou remove, be cast in the sea, and doubt nothing in your heart.\nBut believe the things that you say will be done, you will have whatever you say.\nSo he said, therefore, when you pray, believe, and you will receive.\nLet us pray this morning.\nFather, we thank you for this day, Lord, and I thank you for this opportunity that you\nhave allowed me to stand here, and I thank you for our speaker, God, and I thank you that\nYou are continually to use him, God, in ways God like never before.\nAnd as he will continually lead God in all of these that you have placed here, God,\nthat will continually lead this great state and not only state, but this country, Lord.\nWe ask God that you will continually to show yourself mightily and show yourself\nstrong because we do have God kind of faith.\nAnd in Jesus' name we do pray, Amen.\nLet us pledge allegiance to the flag of the United States of America and to the Republic\nof which is staying one nation ungodly, indivisible with liberty and justice for all.\nDoor capers will unlock the doors.\nYou\nChair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, if you don't know where you're going, you'll end up some\nplace else, Yogi Barrow.\nYeah, Chairman Hogan, the chair of the Committee on Information and\nAudits reports that the journal of the previous legislative day has been read\nand found to be correct. Is there any objection to the confirmation of the\njournal? The chair here is not and the journal is confirmed. Clerk will read the\nResolution, establishing the order of business for the day.\nMr. Burns, on the 59th Ms. Follow Me, established the order of business termed the first part\nof the period unanimous consent, introduction of bills and resolutions, first reading\nand reference of House bills and resolutions, second reading of bills and resolutions,\nmorning orders.\nYou\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing\nthe order of business for the day.\nFirst reading of bills and resolutions,\nthe clerk will read.\nHouse bill 870, got to represent\ntacklessly the 160th parish to the 158th\nand burns 159th.\nHe'll be taught an act to amend an act\ncreating the Board of Commissioners of Bollock County.\nIntergovernmental Coordination House release 71 by represent tackers Lee 160th parish of the hundred fifty-eighth and burns on her fifty-ninth\nBill Vuitton and act to amend the NAC providing for the reconstitution of the Board of Education of Bullock County\nIntergovernmental Coordination House bill 872 by resident of Parkville 101st Parkville 100th and Nathan McLean of the 100th\nBill Vuitton and act to amend an act relating educational districts for the election of members of the Board of Education of Buoneth County\nIntergovernmental Coordination House bill 873 members in the park go 101st\nClark 100 and 8th and recline to the 100th there'll be Todd and act to amend\nand that creating the Board of Commissioners when that county\nIntergovernmental Coordination House bill 874 members of NYX the 69th Bill\nbe Todd and act to amend and that providing for the election of members of the\nBoard of Education of Hurd County Intergovernmental Coordination that completes\nfirst readers. Second reading of bills and resolutions, the clerk will read.\nHouse Bill 843 by Representative Holland of the 54th,\na bill relating to property tax exemptions and deferral. House Bill 846 by Representative Smith\nof the 41st, a bill relating to uniform rules of the road. House Bill 847 by Representative Smith\nof the 41st, a bill relating to his own provisions of labor and industrial relations. House Bill 848\ninto conditions of detention.\nHouse Bill A53 by Rep. Scott at the 76th.\nScofield at the 60th, Wilkinson at the 38th.\nDavis at the 87th and McLeod at the 105th.\nA bill relating to procedure for sensing\nan imposition of punishment.\nHouse Bill A54 by Rep. Jones at the 25th.\nA bill to incorporate the city of Buckhead City.\nHouse Resolution 529 by Rep. Knight at the 130th.\nRoads at the 120th, corporate at the 174th.\nDubnic of the 29th, the Ricky of the 169th.\nResolution expressing concern regarding\nNational Park Service Special Resource Study of the Smolge River Corridor, 3-Second Readers.\nThere are no standing committee reports, we're going on now to morning orders, I would ask\nthe members who have signed up for morning orders to limit their remarks to no more than\ntwo minutes each, two minutes. Chair recognizes Representative Bonner for a morning order.\nThank you, Mr. Speaker, and I'm being joined by the members of the Cowita delegation.\nColleagues, this morning I rise to mark the end of watch for police officer with the City\nof Newton, officer Ricky Tottenson died last week and is being laid to rest today.\nOfficer Tottenson was a 18-year veteran of law enforcement and spent the last 10 years\nof his career with the City of Newton Police Department.\nHis most recent assignment was at Evans Middle School as a school resource officer.\nknown it by the kids as Officer T.\nHe was beloved by the students, the faculty,\nand all the parents who had the joy to come in contact\nwith Officer Toddins.\nSo at this time, colleagues, I would ask\nthat you observe a moment of silence.\nThank you, and thank you, Mr. Speaker.\nChair recognizes representative Holley for a morning order.\nRepresentative Holley for a morning order.\nAll right, moving right along.\nthe\nCommending Amber Cardell and for early purposes that completes the reading of the Privileged Resolution.\nIs there any objection to adopting the Privileged Resolution? The chair here is none and the resolution is adopted?\nYou\nOkay, we have one item of business to take up.\nThe clerk will read, listen up now, if you'll give us your attention just for another\nminute or two, we'll be able to finish our business today.\nfor Reed Decaption to Senate Resolution 362.\nSenate Resolution 362 by Senator Miller, 49th,\nDougan the 30th, Gucci the 51st,\nKennedy the 18th, Berk the 11th and others,\na resolution to notify the governor\nthat the General Assembly has convened.\nChair recognizes the whip of the majority caucus.\nWe have hatchet to explain the resolution.\nThank you Mr. Speaker, colleagues, I think this tells us that maybe the people across the\nhall are in session and hopefully they'll do some work.\nIs there any objection to adopting the joint resolution, Senate resolution 362, notifying\nthe governor of our session and appointing a committee of escort or a committee of notification.\nHearing none, it is so ordered to chair a points as a committee of notification the following\nmembers. Representative Meeks of the 178th representative lot of the 122nd representative\nBonner from the 72nd Representative McDonnell from the 26th Representative\nHagen from the 156th Representative Seba from the 34th Representative Fry from\nthe 118th and Chairman Hogan from the 179th we have some announcements\nWe have some announcements so listen up chair recognizes for an announcement chairman tanker sleeve\nThank you. Thank you mr. Speaker. I'd like just take a minute to remind you we've had so much communications come in\nOn our desk, but the the speakers office sent out a very important memo this past\nFriday, January the 7th, and it's all about local redistricting.\nI really urge you to take some time and review that memo with careful thought.\nAt the very least, you can run your legal notice in your legal organ that's in your district\nas soon as possible, that could come from Legislative Council.\nSo once the ad has ran, then you can go ahead and work on your bill and get it through.\nBut our recommendation is to have legislative counsel draft that ad for you.\nAnd then if you're redistricting bills affect the 2022 election cycle, we recommend that\nthese bills be passed out of the house during the first week of February.\nSo I'm around and available to answer questions and we'll get any questions you have answered\nby the appropriate office.\nThank you so much.\nChair recognizes Representative Holcomb for an announcement.\nThank you, Mr. Speaker.\nI want to let everybody know that the memorial service that was planned for the late Senator\nCleveland that was planned for Friday, all members were invited, has been postponed, will\nlikely be scheduled in April and everybody will be invited then.\nThank you.\nChair recognizes Chairman Mitchell, the Chair of the Minority Caucus.\nThank you, Mr. Speaker.\nThe Democratic Caucus will meet via Zoom at noon.\nYou can pick up your lunch in 216 prior to.\nThank you.\nChair recognizes representative Gullet for an announcement.\nThank you, Mr. Speaker.\nTwo quick announcements.\nGovernor LaFaire's subcommittee on cityhood with me today, one o'clock.\nThat is in 406, CLOB.\nAnd then tomorrow morning, at 8 o'clock, there's a full committee for government affairs\nthat meets at 606 in the CLOB.\nThank you.\nRepresentative Gollett, have you told Representative or Chairman Todd Jones where you've been the\nlast two days?\nI did.\ncommiserated earlier today for that and you didn't even offer anybody in the\nhouse tickets to the what was the name of the bowl and y'all were in that you\nlost you lost to some junior college or something down in there I know it's\nthe it's sad Mr. Speaker really is ahead but I did go and cheer on the\nbulldogs and I think of the group that I went with I was the only one who lost\nThat's my voice cheering, so I cheered hard for you guys.\nChair recognizes Chairman Knight for an announcement.\nThank you, Mr. Speaker.\nMany of you know every session we get kicked off with what many of you knew formally as\nthe sportsman's day at a capital.\nyear it's I think we're renaming it but it's it's so all of our conservation groups are going to\ncome in and it's keep Georgia while day at the Capitol. So I want to encourage you tomorrow to\ncome and intend events it'll be down in the rotunda starting about nine o'clock with speakers\nthe governor and others but again Georgia is one of the best places we care about our state and we\ncare about true conservation and we've got our conservation partners that will be here tomorrow\nI want to encourage you to come down, meet those partners we have again starting at nine o'clock\nin the morning. The official program will start off. Thank you.\nOkay, we have a birthday. I want y'all to join with me and record you. And y'all better,\nif you're going to have a local bill this session, you better be taking a lot of cake\nto Chairman Jan Tancersley on her birthday. Happy birthday, Madam Chair.\nOkay, before I recognize the whip, let me remind you that there seems to be a little poetic\njustice in the fact that tomorrow is the state of the state address and it's\nWhile creature day here at the Capitol, I mean chairman not how did that come about do you think?\nAnyway tomorrow is the state of the state. We're gonna start promptly at 10 o'clock\nGet through with our business, so we'll be\nready when we convene in joint session\nSo just remember that\nchair now recognizes for emotion the majority caucus\nWe'll patch it.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this house stand adjourned\nuntil 10 a.m. Thursday, January 13th, 2022.\nHowever, Mr. Speaker, we all know that you do have the authority\nto bring this house back to order anywhere from 33 to 18 minutes early.\n33 points, 333 lift.\nWow.\nChairman Hatchett has moved that this house adjourned\nuntil Thursday morning at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes clearly have it.\nThis house will be adjourned until Thursday at 10 a.m.\nYou\n",
  "updated_at": "2026-02-11T21:09:11.287288+00:00"
}