{
  "video_id": "O72pcG72VIE",
  "url": "https://youtu.be/O72pcG72VIE?t=807",
  "title": "Georgia House - Day 7 (2026-01-23)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 7,
  "video_date": "2026-01-23",
  "duration_minutes": 90,
  "summary": "Overview: The Georgia House session featured a powerful prayer from Rabbi Adam Starr, the senior rabbi of Congregation B'nai Torah in Sandy Springs. The prayer drew inspiration from the biblical story of Jethro providing guidance to Moses, emphasizing the importance of legislators being \"people of valor, God-fearing, people of truth, haters of ill-gotten gain.\" No substantive legislative actions were detected in the transcript.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- Rabbi Adam Starr delivered an inspiring prayer, calling on legislators to have the courage, moral compass, and integrity to serve the greater good.\n- The House recognized Dr. James Short as the doctor of the day, invited by Representative Mary Margaret Oliver.\n- Committee Chair Rep. Tarvan reported the journal from the previous legislative day was found to be correct.\n\nVotes: None detected.\n\nAttendance: Quorum was present.\n\nAdjournment: The transcript does not provide the exact time of adjournment or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I saw us with an amazing love and love, love fly with us you as the senior rabbi of congregation Benetara of Sandy Springs since 2004. He is a ninth generation rabbi. During his time in Georgia, he has grown the synagogue to become one of the largest Jewish congregations in the entire state. We have 900 families in membership. He has served many leadership roles in our community, including his president of the Atlanta Rebinnical Association, board member of the Jewish Federation of Greater Atlanta, and Jewish Family and Career Services. Rabi Heller has served on the Sandy Springs City Ethics Commission and the Commission on Diversity. Rabi Heller is visible on the national scene as a member of the committee on Jewish law and standards, and a member of the advisory board of the Pozen Library of Jewish Culture and Civilization. Before becoming a leader in our community, Rabi Heller graduated from Harvard University with honors and published research in the journal for Computational Neuroscience and served as director of distance learning for the Jewish Theological Seminary. During the period after 9-11, he served as the rabbi of the downtown synagogue, having started his job on September 9. It was one of the synagogue's closest to the site of the World Trade Center. Rabi Heller and his wife Wendy are the proud parents of three children. Welcome, Rabi Heller. Thank you. Mr. Speaker, honored representatives, thank you for allowing me to bring you blessings today. As we reflect on the awesome work that each of you has committed to carry out, let us take the words of Exodus chapter 18 for inspiration and guidance. It is the story of a man named Jethro, not the clampets denwitted cousin, but Moses's thoughtful father-in-law. He was the high priest of Midian, and he heard about all the troubles that the Israelites had encountered and how God saved them, liberating them from slavery in Egypt, bringing them through the waters of the sea, saving them from implacable foes who attacked, and bringing them on their way to the promised land. On my heart this morning is the journey, the wilderness through which my people wander at this very moment. That is a burden that I bring and carry with me, but my task today is to bring blessing to you. So let me share with you the words that Jethro brought to Moses. So Jethro saw Moses judging the people from early in the morning to very late at night every day. It was like signy die every day. And he sees Moses and he says, you can do better, and he suggested to Moses appoint yourself a legislature. Jethro says, seek out from amongst all the people, people of valor, God fearing people, people of truth, haters of ill-gotten gain. And Jethro is saying that only with people of that caliber, leaders of tens of fifties of hundreds of thousands, will this nation come to its rightful place, its promised land in peace. I'd like to suggest that the advice that Jethro gave is the very same advice and guidance that we ourselves need, that we need to see ourselves as being from among the people, knowing that we each represent an important segment of the community, that we have to be people of courage, being willing to act for truth even if it is against what is popular, that we must be people who are God fearing. It is not enough to have convictions, but those convictions can't be the convictions that lead to convictions. We have to have a moral compass. We have to be on se, I met, we have to be people of truth, with the wisdom and discernment, to understand the reality of a matter, even when others might seek to obscure it. We must be haters of ill-gotten gain, we must come with integrity and look for the good of all, not just for the good of ourselves. Now of course the greatest miracle of the Bible, I don't know if it's that a father-in-law has useful advice or that a son-in-law chooses to take it, but indeed it is a chapter later that Moses has taken this advice and with that legacy in place, the people of Israel, the children of Israel are able to receive the Ten Commandments, a legacy that we, that they would pass on to the world and are still in North Star for so many. With that verse, with that lesson in mind, let us pray. God of all, we ask your blessings for these men and women who have taken on the awesome responsibility of service to the people of the state of Georgia. Help them be, as Jethro said, from among the people remembering always whom they are here to serve. Help them be people of courage, not afraid to say what must be said even if it is not what brings accolades or approval. Help them to be God-fearing guided by faith and conscience. Help them to be people of truth with the discernment to reach the heart of every matter, even when facts are obscured by rhetoric so that they may enact laws and carry out policies that benefit all who live and work in our state. Help them to be haters of ill-gotten gain. Let them approach every issue with integrity without regard to their own well-being, without temptation. Let them have the strength of character to always put ethics before ego, purpose before personality, and public before party. Let our lawmakers indeed be worthy so that you may bless them. Bless our lawmakers with wisdom to ensure the safety and security, the health and wholeness of all who dwell here. Bless them with the vision to help our state preserve the beautiful gifts of nature that you have given us. Bless them with discernment to alleviate poverty and seek prosperity for all. Bless them with the insight to conduct their affairs with integrity. Bless them as they leave their home and work untended to offer service to the greater good. Watch over their families, their businesses, their homes, bless partners and children, co-workers and clients, and all who wait for their return. And may their sacrifices of time and treasure yield blessings for all. May they be illuminated, Lord, by your light, to be people of the nation, to be people of courage, to be the fears of God, to be people of truth, to be haters of the all-gotten gain, so that the people of Georgia, all of us, your children, to reach the place of your promises, the places of truest potential in peace, and let us all say amen. Now we recite the pledge. I pledge allegiance to the flag of the United States of America, and I remember in all the for which it stands, one nation under God, with liberty and justice for all. Also, thank you, Mike. Thank you so much. Thank you. Get one? Yes, sir. Thank you, Rabbi Heller, for those words and your lessons and your encouragement. Door, keep your May unlocked the doors, members, you may join Rabbi Heller in the south any room to meet him and have a photo that be your desire. Well, good morning again, members. Thank you, Rabbi. Today, we are the beneficiary of the doctor of the day. Dr. James Short is downstairs in the medical aid station. I want to thank Representative Mary Margaret Oliver for inviting our doctor of the day, and we appreciate if you need, thank you. If you need any sort of attention, I'm sure Dr. Short will be very glad to take care of you. Thank you, Representative Oliver, for making this invitation. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits, Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. On another note, I am not what I was forced to be. I am what I chose to become. That's very profound in your too, by the way. Thank you for your service. Chairman Tarvan, the Chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Here in none, the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, station 104th, whose following be established is the order of business center. First part of the period, unanimous consents, introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none and the resolution is adopted. Mr. Clerk, are you ready? First reading the bills and resolutions. The clerk will read. House bill 950 by Representative Alexander, 66 Bruce, 61 Thomas, 65th and new the 64th Bill B. Todd will enact authorizing assessment collection of a technology fee by the Pro-Bate Court of Douglas County. Intergovernmental coordination. House bill 951 by the Rubs of Gunner, the 8th Bill B. Todd will enact amendment act to reconstitute the Board of Education of Towns County.\n\nIntergovernmental coordination. Household 952 by Rimsund of Anderson to the 10th and Irwin to the 32nd. Bill B. Todd will act to authorize the assessment collection distribution of a technology fee by the magistrate court of a Havisham County. Intergovernmental coordination. Household 953 by Rimsund of green in the 154th. Bill B. Todd will act to create a board of elections and registration for Calhoun County. Intergovernmental coordination. Household 954 by Rimsund of parish to the 158th. Bill B. Todd will act to provide for the judge the probate court of a manual county. Intergovernmental coordination. Household 955 by Rimsund of Bruce the 61st Mitchell, the 88th base, more the 69th gillier to the 162nd. Williams, 168th and others. Bill B. Todd will act to amend chapter 12, the title 50. And the official go to Georgia and Tata, relating commissions and other agencies. State planning and community affairs. Household 956 by Rimsund of carpenter, the 4th, the 2nd, Ridley the 6th. Bill B. Todd will act to provide for the designation of chief judge, the connoisseur of judicial circuit. Intergovernmental coordination. Household 957 by Rimsund of p3, the 166th, Stevens the 164th. Saints of the 180th, Towns of the 179th, the Lodge of the 167th and others. Bill B. Todd will act to amend article 3, chapter 7, the title 52, the official go to Georgia and Tata, related to abandoned vessels. Public safety and homeland security. Household 958 by Rimsund of lot of the 111st, 111st, 120 second, Newton, 117th. Bill B. Todd will act to authorize the magistrate court of Columbia County to impose and collect county law and library fees. Intergovernmental coordination. Household 959 by Rimsund of carpenter, the 174th, Lumsund of the 12th, Mathis the 149th, Ridley the 6th, Prince the 132nd. Bill B. Todd will act to amend article 1, chapter 6, the title 40, the official go to Georgia and Tata, related to general provisions, relative to uniform rules of the road. Motor vehicles. Household 958 by Rimsund of black men of the 146, Williams the 148th, Ballard the 147th, Dickie the 145th. Bill B. Todd will act to amend code section 1562, the official go to Georgia and Tata, related to the number of judges, the superior courts. Judiciary. Household 961 by Rimsund of Lumsund of the 12th. Bill B. Todd will act to amend and act to provide a new charter for the city of Menlo. Intergovernmental coordination. Household 962 by Rimsund of scott of the 76, Davis the 87th, Skowfield the 63rd. Bill B. Todd will act to amend chapter 14 and title 16, the official go to Georgia and Tata, related to racketeer influence and corrupt organizations. Judiciary non-civil. Household 963 by Rimsund of scott of the 76, Davis the 87th, Skowfield the 63rd. Bill B. Todd will act to amend part three of article 16, chapter two, the title 20, the official go to Georgia and Tata, related to health of elementary and secondary school students. Education. Household 964 by Rimsund of scott of the 76, Davis the 87th, Skowfield the 63rd. Bill B. Todd will act to amend chapter four, the title 25, go to section 31, 1152, and chapter eight, the title 35, the official go to Georgia and Tata, related to firefighter standards and training. Public safety and homeland security. Household 965 by Rimsund of scott of the 76, Davis the 87th, Skowfield the 63rd. Bill B. Todd will act to amend article on chapter seven, the title 44, the official go to Georgia and Tata, related to landlord and tenant in general. Judiciary. Household 966 by Rimsund of scott of the 76, Skowfield the 63rd. Davis the 87th, Bill B. Todd will act to amend chapter three, the title 50, the official go to Georgia and Tata, related to state flag seal and other symbols. State properties. Household 967 by Rimsund of scott of the 17th, math is the 149th, call it the 19th can in the 172nd, Kelly the 16th and others, Bill B. Todd will act to amend article on chapter 10, the title 15, the official go to Georgia and Tata, related to general provisions relative to magistrate courts. Judiciary. Household 968 by Rimsund of scott of the 63rd, car pern of the 4th train of the 80th, Gillier the 62nd, hollum of the 54th, Bill B. Todd will act to amend chapter two, the title 39, the official go to Georgia and Tata, relating to the regulation of the employment of minors. Industry and labor. Household 969 by Rimsund of scowfield the 63rd, sky to the 76, Davis the 87th, Gillier the 62nd, Bill B. Todd will act to amend title 80, the official go to Georgia and Tata, related to buildings and housing. Public and community health. Household 977 by Rimsund of dicky the 145th, 934th, Irwin of the 32nd, Dempsey the 13th, math is the 149th and others, Bill B. Todd will act to amend part four. Household 977 by Rimsund of article 7 of chapter three, title 20, the official go to Georgia and Tata, relating, relating the realizing educational achievement can happen scholarship. Higher education. Household 971 by Rimsund of newton on 27th, Hilton of the 48th, Reeves the 99th still Cox the 53rd, Hitchens the 61st and others, Bill B. Todd will act to amend chapter seven, the title 48, the official go to Georgia and Tata, relating, the income taxes. Household 972 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to authorize the governing authority of the city of Fort Old, author up to Levy and excise tax. Intergovernmental coordination. Household 973 by Rimsund of camp, loan 35th, Collins the 71st, Hitchens the 61st, lumps into the 12th, Connor the 8th and others, Bill B. Todd will act to amend article 2, chapter seven, the title 48, the official go to Georgia and Tata, relating, the impositionary, computation, exceptions and credits. Household 974 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to amend chapter two, the title 21, the official go to Georgia and Tata, relating, the primaries and elections generally. Household 975 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to amend chapter two, the title 21, the official go to Georgia and Tata, relating, the primaries and elections generally. Household 976 by Rimsund of the 1st, the 175th and Anderson, the 10th, the 1st, the 23rd, black men in the 146, Jones of the 25th and others, Bill B. Todd will act to amend chapter two, the title 21, the official go to Georgia and Tata, relating, the primaries and elections generally. Household 977 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to amend chapter two, the title 21, the official go to Georgia and Tata, relating, the primaries and elections generally. Governmental affairs. Motor vehicles. Household 976 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to amend chapter two, the official go to Georgia and Tata, relating, the primaries and elections generally. Household 981 by Rimsund of the 1st, Harvard and 2nd, Bill B. Todd will act to amend chapter two, the official go to Georgia and Tata, relating, the primaries and elections generally. Agriculture and consumer affairs. Household 982 by Rimsund of gamble, the 15th, Dubnic of the 29th, or one of the 32nd, Martin of the 49th, Hong of the 103rd, Bill B. Todd will act to amend chapter 14, the title 34, the official go to Georgia and Tata, relating, the state workforce development board. Higher education. Household 983 by Rimsund of the 76th, Davis of the 87th, Skullfield of the 63rd. Bill B. Todd will act to amend article on chapter 18, the title 15, the official go to Georgia and Tata, relating, the general provisions relative to prosecuting attorneys. Judiciary non-subtle. Household 984 by Rimsund of lumsund of the 12th, Harvard of the 2nd, Taylor of the 173rd, Williams of the 48th, and Col. of the 19th. Bill B. Todd will act to amend, the title 25 of the 33, the official go to Georgia and Tata, relating, the fire protection and safety and insurance. Insurance. Household 985 by Rimsund of martin of the 49th, and gamble of the 15th. Bill B. Todd will act to amend article 7 of chapter 3, the title 20, the official go to Georgia and Tata, relating, the scholarships, loans and grants. Higher education. Household 986 by Rimsund of Thomas the 21st, Jones the 25th, Jasper's the 11th camp of the 135th, gone through the 8th and others. Bill B. Todd will act to amend, chapter 2, the title 21 of the official go to Georgia and Tata, relating, the elections and primaries generally. Government affairs. Household 97 by Rimsund of cannon of the 172nd, earned one of the 32nd, per shed of the 176th, year to the 150th, lever to the 123rd and others. Bill B. Todd will act to amend, go to section 22, 165 of the official go to Georgia and Tata, relating, the equalization grants. Education. Household 988 by Rimsund of Thomas the 21st, Jones the 25th, Jasper's the 11th camp of the 135th, gone through the 8th and others. Bill B. Todd will act to amend, chapter 25 of the title 50, the official go to Georgia and Tata, relating, the Georgia technology authority. Technology and infrastructure innovation. Household 989 by Rimsund of nulla, which is the 42nd stoner of the 40th, Wilkins Wilkins, will descend to the 38th, Campbell of the 35th. Bill B. Todd will act to amend, the election and members of the Board of Education, Cobb County. Intergovernmental coordination. Household 990 by Rimsund of bill 75th, Willis of the 55th, Carper of the 4th. Evans of the 57th, Green of the 154th. Bill B. Todd will act to amend, go to section 24, 923, the official go to Georgia and Tata, relating, the immiscibility of photographs. Chair, Mr. Clerk, hold it just for a second. I know we're almost done. Thank you. proceed, Mr. Clerk. House resolution 807 by Rimsund of school field of 63rd Davis, the 87th, Evans of the 89th, Buckner of the 137th, and Scott of the 76th. Resolution supporting a state goal of 100% clean energy by 2050. Energy, utilities and telecommunications. House of resolution 808 by Rimsund of school field of 63rd, Scott of the 76th, Davis of the 87th, Mitchell of the 88th, Buckner of the 137th, Resolution urging Congress to allow certain benefits to be used. Public and community health. House resolution 809 by Rimsund of school field of 63rd, Mitchell of the 88th, Beverly of the 143rd, Davis of the 87th, Scott of the 76th. Resolution supporting the creation of a state work group to increase chronic disease information and screenings. Public and community health. That completes first readers. Thank you, Mr. Clerk. Second reading of bills and resolutions. The clerk will read. House bill 98 by Rimsund of the 22nd, Ridley of the 6th, Powell of the 33rd corner of the 3rd Fleming of the 114th, Billed relating to appointment of substitute for absent or disqualified district attorney, House bill 929 by Rimsund of the 22nd, Ridley of the 6th, Powell of the 33rd corner of the 3rd, Pursing of the 119th and others. A bill relating to imposition rate, computation exemptions and credit for state income tax, House bill 930 by Rimsund of the 22nd, Ridley of the 6th, Reeves of the 99th, Powell of the 33rd, Horner of the 3rd, a bill relating to disclosure of a rest booking photographs prohibited. House bill 931 by Rimsund of the 22nd, Ridley of the 6th, Reeves of the 99th, Horner of the 3rd, and Pursing of the 119th, a bill relating to government transparency and campaign finance, House bill 932 by represent Mathis of the 149th, Gunther of the 8th, Gallaud of the 19th, Bands of the 133rd, a bill relating to murder, Mouser of the 131st and others, a bill relating to murder, Mouser of the 3rd, a bill relating to murder, Murder and Murder in the 2nd, Degree, House of the 933 by represent Mump-Tan of the 17th, Part of the 5th, Mathis of the 149th, a bill relating to special license plates promoting or supporting certain worthy agencies, funds and nonprofit corporations, House of the 934 by represent Mump-Tan of the 17th, Mathis of the 149th, Gallaud of the 19th, Canada of the 172nd, Gunther of the 8th, and others, a bill relating to self-service storage facilities, House bill 935 by represent advance of the 133rd, Hitchens of the 161st, Cameron of the 1st, Skollgons of the 14th, Chastain of the 7th and others, a bill relating to use of speed detection devices and red light cameras, House of the 936 by represent Mump-Tan of the 7th, Gallaud of the 16th, Gallaud of the 16th, Gallaud of the 134th and others, a bill relating to health of elementary and secondary school students, House bill 937 by represent Mump-Tan of the 17th, Gallaud of the 19th, Camp of the 135th, Canada of the 172nd, Camp of the 174th, a bill relating to right share network services and transportation referral services, House bill 938 by represent bars of the 86th, Taylor of the 92nd, Glazer of the 67th, Alexander of the 66th, Bell of the 75th and others, a bill relating to landlord and tenant, House bill 939 by represent of Reeves of the 99th, Hitchens of the 161st, Lums of the 12th, Bands of the 133rd, Skollgons of the 14th and others, a bill relating to motor vehicles and traffic, House bill 940 by represent Jones of the 25th, the Williams of the 148th, Canada of the 172nd, the 4th and the 3rd, Barrett of the 24th, the bill relating to fair business practices, active 1975, House bill 941 by represent Irwin of the 32nd, Jones of the 47th, Dominic of the 29th, Jones of the 25th Reeves of the 99th and others, a bill relating to capital outlay funds and elementary and secondary education, House bill 942 by represent of Maynard of the 56th, lot of the 131st, Daniel of the 117th, Dempsey of the 13th, Hagen of the 156th and others, a bill relating to sexual extortion, House bill 943, by represent jasters of the 11th, Powell of the 33rd, Balanchor of the 20th, Horner of the 3rd, Ridley of the 22nd, others, a bill relating to exemptions from sales and use tax, House bill 944 by represent Hawkins of the 27th, Dunhuve, the 31st, lever of the 123rd, McCallum of the 30th, Cox of the 28th, a bill relating to Advalor and Taxation of Property, House bill 945 by represent of Hawkins of the 27th, Taylor of the 173rd, Anderson of the 10th, Irwin of the 32nd, Paris of the 158th, a bill relating to state employees, health insurance plan, House bill 946, by represent of Hawkins of the 27th, Dunhuve, the 31st, McCallum of the 30th, Cox of the 28th, Irwin of the 32nd, others, a bill relating to special district mass transportation sales and use tax, House bill 947, by represent of the 113rd, frustration of the 104th, Pallum of the 103rd, Dunhuve, the 8th and Oliver of the 82nd, a bill relating to general provisions concerning superior courts. House bill 948 by represent of 10 of the 17th, Kelly of the 16th, Delta of the 19th, Scotland of the 14th, part of the 5th, and others, a bill relating to primary and elections generally, House resolution 804 by represent of the Martin of the 49th sale, Cox of the 53rd, Jones of the 47th, Jones of the 25th. A resolution provides the amendments to the constitution, so it's changed the date by which temporary loans for counties, municipalities, other political subdivisions of the state are payable and full from the end of the calendar year to within 12 months of the initial funding date of the loans, through 2nd readers. Thank you, clerk, report, sustaining committees, the clerk will read. President Tyler Qual Smith of the 18th District Chairman of the Committee on Judiciary, noncivil submitted the following report. Mr. Speaker, your committee on judiciary, noncivil, is that it's consideration following bill of the House, instructing me to report the same back to the House, the following recommendation. House bill 880, one did pass by committee substitute, respectfully submitted, represent of Smith, the 18th District Chairman. I completes the reading of the report, sustaining committees. Thank you, Mr. Clerk. We will be giving a test before we adjourn today to make sure everyone heard with the clerk just read. If you don't know, you got to stay here. We'll adjourn about five, maybe six. Y'all are listening closely. Members will please take seats. You'll come in from any rooms. We'll get on with the further business of the day. Take your seats and cease conversation. Or if you need to have conversation, take it to the any room. We'll move on the morning orders, but before we do that, members, we have two former members of this body that are back today that will be recognized in that capacity in just a moment. But I want to take a moment and recognize Chairman Heath Clark. Chairman Clark is good to see you. Hope your family's well. Good to have you back. And I thank you, brought some friends with you that we'll talk about them in a few moments. And Chairman Tom Taylor, sitting in the gallery, Tom always good to have you back in the house. Thank you for your service as well. And I thank you, have some friends with you as well. We'll speak to them in just a moment. All right, now we have some morning orders. Now, we're going to alert you when two minutes is up. And I think all of you can get this done before two minutes. And so feel free to do just that. So the Augusta delegation, if you'll make your way down front, representing Frazier, you'll recognize for a morning order. Representative Gloria Frazier. So wait just a moment. I think you have some folks that are a little well close enough. If you want them up there with you, they parked your delegation. So you have a couple of stragglers there. We got them on stragglers. But they're good friends. Reptile Frazier. Good morning. Thank you, Mr. Speaker. And to my colleagues, we're here today because we have some distinguished guests in the gallery today. And I would just like for all of my veterans to please stand that are in the gallery today that have traveled here from Augusta, Georgia. Augusta, Georgia. The members that you see here today. And all the veterans that are here today, we are working very diligently to get a veteran cemetery in Augusta, Georgia. We have over 66,000 military families in the Great Augusta area. And with this cemetery is projected that we will be entering about 749 members veterans per year. So they are here actually lobbying for this veteran cemetery. And Mr. Speaker, I just want to say really quickly between the House and the Senate, have a Miranda Senate right now. We have 675 years of collective service protecting our United States of America. Thank you all so much. We are, we have the Army, the Navy, Air Force, and the Marines. We have combat tours, veterans. We have the Cold War. It doesn't storm. Somalia, Operation Iraq, Freedom, Operation Enduring Freedom. And one of the members representing the Women Army Corps, the WAC, Racial Hand. We also have with us our distinguished participants that are trying to get this pass through. And it is our former mayor of Augusta, Bob Young. He's a Vietnam veteran, United States Air Force. We have our Augusta Commissioner, Evan Mason. He is US Army, American Legion State Commander, Mayor of Inweaver. There's a Storm Army, American Legion District Commander, Thomas Pintney. We have Patriot Guard Writers. These are the Writers that ride with the veterans as they are going to be laid to rest. We have our Commander, Leon Maglam. We'd like to thank you all for coming up today to advocate for our cemetery in the Augusta Richmond CSRA area. We are here to support you. I am a military spouse, so I understand how important it is to make sure that we have our husbands and loves one laid to rest close to us so that we can actually visit them. Currently right now, we have to, we have internment in Fort Jackson and Millageville, Georgia. And a lot of these spouses would like to visit their loved ones a lot more. So thank you again for joining us, and we thank you for your service. Thank you, Representative. Thank you for the veterans here. Thank you for those veterans in the gallery. Thank you for your service to our great country. Representative Nullowicz, saying, Chairman Knight, recognize for a morning order. Give the members in the well your attention, please. Chairman, lady, okay, Representative Nullowicz. Thank you. Thank you everyone. Today, as you may have noticed, coming into the capital is Georgia, Japan Day at the capital. This is the 50th anniversary in 2024 of official diplomatic relations between the state of Georgia and the nation of Japan. And we are very excited that there are multiple Japanese businesses here today that you can learn about, you can learn about the tremendous economic impact that Japanese owned companies have in the state of Georgia. And most importantly, I think we would like to recognize some friends who are in the gallery right now. We have Consul General of Japan, Miyomita, and several members of the Constellar staff. Thank you so much for joining us today. And it is especially notable that this evening, Consul General of Miyomita is going to be conferring upon former Governor Nathan Deal, the order of the rising sun, gold and silver star in recognition of his outstanding contribution to promoting regional exchanges and mutual understanding between Japan, the United States, and Japan. We look forward to seeing that this evening. Chairman, may I? As many of you know, we've been up here before with a special relationship that we have with Japan. Georgia has with Japan, but not only Georgia, but our country. They are a global partner and strategic ally. And it is so important that we continue these relationships and particularly to Georgia. 50 years, they are one of our largest trade partners. And if you look around your communities, you're going to find that there is a Japanese business there and they are employing Georgians, almost 50,000 Georgians. So it is a great, great partnership that we have all around with Japan. And we are excited about the 50th anniversary, and we're excited about the next 50 years. Consul General, thank you so much, and we look forward to the rest of the day. Thank you, members. What a great evening and what a great honor for Governor Dio and thank you, Consul General, for recognizing the Governor at that time later in the day. Thank you all for being here in the house today, and thank you for your relationship, your friendship. Chairman Dickey, in the Houston County delegation. Oh, yeah. Thank you, Mr. Speaker. They're on the way. They're on the way. We got a very distinguished house in County delegation. Oh, it's fine. We got a new, do we have a new member? You do? He loves you, every day, because he's a very new member. He's just kind of in it. I'm glad to have him. Anyway, Mr. Speaker, I'd like to recognize the distinguished group in the gallery that came this morning, Houston County Leadership Class. They're juniors, and we feel the stand. They're juniors from all the high schools across Houston County. And I really appreciate the great job April Bragg does leading our chamber and bringing this group along with the Chairman Heath Cart. This morning too. It was great to see both of y'all and what you do in Houston County. I hope these young people enjoy that day here, and great to see y'all. Thank you, Mr. Chairman. Good looking group. Y'all have a great delegation. I wasn't talking about the delegation being good looking. I was talking about that group up there. Thank y'all for being here, juniors, and we wish you the best. It's the last meeting of the year and your senior year. So thanks for representing Houston County. We'll park, Florida Hong, recognize for a morning order. Give the members your attention, please. All of these are very important to a lot of people, not just the members making the presentation. Thank you, Mr. Speaker. Good morning, colleagues. Today we are celebrating Korean American Day in Georgia. This year marks 121st anniversary of the first Korean immigrants who came to this country and pursued of the American Dream.\n\nWith more than 100,000 Korean Americans who call Georgia home, they've not only made critical contributions to our economy and society, they've helped strengthen the critical bilateral relationship between the state of Georgia and the Republic of Korea that's resulted in approximately $14.5 billion in investments here in the state of Georgia over the past few years. We have some special guests with us this morning. The console general from the Republic of Korea and leaders of key organizations that serve the Korean American community, including the Korean American Association of Greater Atlanta, the Peaceful Unification Advisory Council, the Korean Veterans Association, the Korean American Chamber of Commerce, the Korean American Coalition of Metro Atlanta, and many others. So to our special guests, if y'all would rise and be recognized, and members, if y'all will give them a warm welcome to the People's House. Thank you, Mr. Speaker. I yield the welcome. Thank you, we're apart. Welcome to the People's House. We're glad you're here. And boy, what a great relationship we have with South Korea and everything y'all do for the partner with us here in the state of Georgia. We got to go on pretty good, don't we? It's good stuff. So thank y'all for being here and thank you for your support. And come back again. Mr. Clerk, will you read the caps into a group of privileged resolutions? Reconnaising the life and memory of Diane Larsche, honoring the life and memory of Margaret Lee Ayerz. Recognizing commending Tyler Jesse Simmons, recognizing commending Judge Kelly Hill, recognizing commending the Georgia Speech Language Hearing Association, recognizing commending Masoud Khan, recognizing commending, seek to fulfill, commending Niko Shiree, commending, graduating Kevin Green, recognizing commending Hill, Delvar Syed and his positive impact on small business, recognizing January 30, 2024 as Latino Day at the state capital, recognizing commending the coalition for global hepatitis elimination of the task force for global health, recognizing commending Yo Hanse and Bai Diao and Cynthia Bay, recognizing the 2024 Lunar New Year celebration, and honoring the United States Capitol Law Enforcement for protecting the United States Capitol and for other purposes that completes the reading of the privileged resolutions. Is there any objection to adopting the privileged resolutions? Chair, here's none, and the resolutions are adopted. Members, we will move on to afternoon orders. First I want to make you aware of one of the key, if I can have your attention, one of the critical players in our success in keeping order and the work that we do here at the Scotty Long, one of the in the clerk's office, Scotty has some health issues right now, he's in the hospital, so I'll ask you to say a prayer for Scotty, and remember him next couple of days, and he'll be back with us very soon. So remember Scotty, a dear friend and a great member of the team that helps this house function. Good men. Okay, afternoon orders. I've not been doing a very good job in enforcing time limits, but I'm getting very close to that. So afternoon orders, you have three minutes, three minutes, and you need to be getting to the end of your comments very close to the end of your comments, or we're going to let someone else speak. So with that, that's an admonition you should follow. We'll begin our afternoon orders with Representative Daniel for our first afternoon order and a friend. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you. Mr. Speaker. Thank you, Mr. Speaker. Thank you. Mr. Speaker. Thank you, Mr. Speaker. Thank you. Thank you, Mr. Speaker. Thank you. You're welcome. He's awake this morning. We'll see if he'll cooperate. Good morning, y'all. Over the past few weeks, I've sat at my seat back there and listened very intently about maternal mortality from my colleagues. And I've listened to them speak at length about the impact that it's having on women across our state and how it's affecting their families. And on those points, I couldn't agree more. But what has been glaringly and alarmingly absent from every single speech that they've given on this issue, as is typical with many of the issues they raise, are tangible solutions to the problem. And that's because they have none. There is no substance, no concrete plan, no action. It's a complaint filled words. Standing up here and referring to women as birthing people does not save women's lives. And releasing statements tying our maternal mortality rate to a lack of Medicaid expansion when Medicaid has already been expanded for expected mothers and their children is not only disingenuous, but dangerous. Since the beginning of session, they have stood up here and told the people of Georgia that they are urging Republicans to act on this important issue. But the truth is we have. Republicans in the House, under the leadership of Speaker Rauston and Speaker Burns, have worked on solutions and delivered results on this issue going all the way back to 2014 when the Georgia Maternal Mortality Review was created. Since then, Republicans have proactively led on this issue to deliver real results. And I'd like to read you some of those efforts that have been made over the last five years. A study committee was led by Chairwoman Cooper in 2019. It paved the way for significant policy to address the issue. House Bill 1114 and 2020 and later Senate Bill 338 in 2022 extended postpartum Medicaid coverage from mothers up to a year after birth, providing critical, continual care for an additional year. Senate Bill 106, the Healthy Babies Act, passed last year and was signed into law by the Governor that creates a Medicaid program to provide remote maternal health clear services to women with high risk pregnancies and rural areas. House Bill 911, our fiscal year's budget, included 800,000 to increase, select OBGYN reimbursement levels, which will increase access to expecting mothers. And the other in House Bill 19, another budget, it provided $1.7 million to fund the pilot program within Senate Bill 106 to provide home visits and at risk and underserved rural communities and through early childhood. It included $47.9 million in ongoing funding to provide coverage through 12 months post delivery. And it eliminated the waiting period for children and pregnant women to receive Medicaid. And finally Senate Bill 35, which was agreed to yesterday by this body, it required glucose monitors to be covered as a benefit for Medicaid recipients to address diabetes, which is one of the leading complications of infant mortality. These are just a handful of solutions that Republicans in this body have delivered on to address maternal mortality in our state. And as someone who just recently survived a very complicated and high risk pregnancy, I want to offer my sincere gratitude to Chairwoman Cooper for her continued efforts around maternal health because it is possible that I wouldn't be standing here today with you guys if it were not for the efforts that have been made over the last decade. Today I have a number of resolutions so bear with me. I'm going to try and talk fast. But the first is to recognize today as maternal health awareness day. And I have a group of women in the gallery if you guys want to stand. They will be sharing their stories later on. They're here with healthy mothers, healthy babies. And they're going to be sharing their stories in Liberty Plaza from 3 to 5 p.m. this afternoon. And so I would encourage all of my colleagues to stop by if you have the time. Second, I would like to recognize Miss Sharina Heinz Rush if you could stand up. This woman was solely responsible for keeping me in the hospital and recognizing the life-threatening issues that I was experiencing. And so I brought her today and I'd also like to shout out some of my doctors because I owe an immense amount of gratitude to them. Dr. Tameka C. Dr. Topay Fapahunda. My midwife Shannon Mayfield and my team of nurses Susan Katie Tammy Sharina, Aura and LaShika. Please help me recognize their efforts and contributions to maternal and infant care in Georgia. I'll end my statements today by saying I believe that it is vital that we are honest with the women of the state about the efforts that are being made to improve maternal and fetal outcomes so that women will feel comfortable seeking care when they need it most. While I cannot say whether or not my friends across the aisle will continue to stand up here and politicize this important issue, I can guarantee that we in this body will continue to lead and we will seek solutions because that is what the women of Georgia deserve. Thank you, Mr. Speaker. Members will… Chairman Gilead, you ready? Fine gentleman from down on the coast in Savannah, Georgia. Give the representative your attention, please. If you'll stand. Thank you, Mr. Speaker. Members and brothers and sisters of this Georgia General Assembly, we stand today with the world, we stand today with the nation, we stand today with the state of Georgia, and we stand today with the city of Atlanta. A gentle giant has taken his rest. We're praying right now just minutes ago the King family had a press conference and we're praying in the home going of Mr. Dexter Scott King. Yesterday he took his rest and fighting a battle dealing with prostate cancer, but he took his rest from being that gentle giant, from fighting for the rights of intellectual property of the King legacy, from fighting for the rights as a general giant and following the wishes of his mother to make sure we had a Martin Luther King Center for non-violence and social change. We're praying today for Bernice, we're praying for Marty, we're praying for Leah, we also praying that Dr. Naomi King is in the hospital for the last month, one of the matriots of the family. We're praying for Isaac Ferris and we're praying for every other member of the King family. Today we stand with the gentle giant who they said emulating his father and looks and in conversation and in voice, but more so a great giant who was very quiet, who has taken his rest. And so to the members of this assembly, we stand here today and asking for your prayers that we will pray for the King family and we'll pray for the family of the late Dexter Scott King when we have a moment of silence. Thank you, Mr. Speaker. Thank you, Mr. Chairman. We are appropriate. Thank you members for your attention and your respect. Thank you, Mr. Jasperous. Take just a second, let it win. Chairman Jasperous has recognized for an afternoon order. Thank you, Mr. Speaker. Members, if you'll look on your desk today and all the other things that are on there, you see our color, how to do a road naming resolution handout. I'm going to give you a couple of hints. We have a great policy analyst, Abby Day, that created this for you. We did this last year to try to simplify how this is done. Mr. Chairman, suspend just for a moment. Yes, sir. Members, I want you to pay attention to this because if you come ask me how to name a road, I'm not going to help you. Chairman's doing that right now. So for those who don't read very well, you best listen up. This is the audio version. No, thank you, Mr. Speaker. Yeah, we do talk to a lot of people about this, but this is a great honor that you have at your hands to be able to name a road around about a bridge, intersection, section of a road, whatever you choose to, after someone in your community that needs to be honored. If you're not doing it, you're missing out. Because it's a great opportunity in your community to recognize these special individuals that have done something, special in your community. Now I do underline the words when I say choose carefully, especially if you're choosing someone who is still alive because things change, things happen. So be careful about that. You and you bring a bill to me that does this. I will warn you about that personally. Josh Waller, our G.repercentive is our key guy on this because you'll have to get what's called a conflict letter that says somebody already named it before you. Someone in your seat, House, when you know, 10 years ago, she could have named it. So we make sure that that's not done and then we go ahead and name these roads. So you've got a couple of weeks. It's not like a stress again and done yet, but it will become that because you've got to advertise it in your paper and all these little things like that have to be done. Do it. Don't be timid. I'll set right over here. You're welcome to come to me at any time and ask a question. Lisa Hague and our Vice Chairman of our Transportation Committee can also answer those and we're just glad to help you do that. Thank you, Mr. Speaker. No, thank you, Mr. Chairman. I think that's very helpful to the members. The Representative for now is recognized for an afternoon order. Thank you, Mr. Speaker. Today I rise honoring Sarah Lillian Plummer, the last living Tuskegee Airman who was a member of the elite group. She was hired as a time keeper for the famous flyers who trained in World War II and successfully escorting the United States bombers to victory over the Nazi German forces. She passed away on December 8th at the age of 101. Can we have a moment of silence? Thank you. Thank you, Mr. Speaker. Thank you, Representative Brinnell for that remembrance. Greatest generation, no doubt about it. Representative Reese recognized for, he's going to bring the dean of the house with him. Good stuff. Representative Reese. Thank you, Mr. Speaker. Today I rise with Representative Gerald Green to stand with my Albany State University family to remember and recognize the life of Joshua Reigns. The Sherat by the President of Albany State University, Dr. Mariam Ross Frederick, freshman student Joshua Reigns passed away at the tragic car accident this past Sunday. Two other students involved in accident are still in the hospital with serious injuries. Joshua was a health science major who had dreams of becoming a nurse. He graduated with Griffin High School Class of 2023 full of energy, hope, and aspirations, which we all should wish for our young people these days. On behalf of the Albany State University family, Representative Gerald Green, Representative David Sampson, and myself, I extend our deepest condolences to the family, his mother, Miss Jeanette Reigns, and his father, Mr. Johnny Reigns. None of us know the day nor the hour, but my God, blessed is your man, his family, and Albany State University. Please join me in a moment of silence. Thank you, Mr. Speaker. Thank you, Representative. Prayers for the family and for those young folks that are injured, prayers for them to recover. Representative Derek Jackson has recognized for an afternoon order. Representative Jackson. Thank you, Mr. Speaker. Colleagues, colleagues, if I can have your attention. The number of deaths that occur in these United States by guns, over 48,000 American citizens of died by guns. We started off this session, Mr. Speaker, recognizing those who were killed by guns in a line of duty. 118 law enforcement officers died in a line of duty. Nearly 2600 students died by gun. In fact, Mr. Speaker, since Columbine in 1999, more than 300 and 38,000 students experienced gun violence at school, at school, a place where they should be safe, a place that should be conducive for learning. Mr. Speaker, nearly 26,000 gun deaths by suicide, 57% of those suicides done by men. Over 20,000 deaths by gun from homicide, 80% of those homicide done by men. Because the speaker over 686 mass shootings took place last year. I know some probably thinking why are we talking about a national. So let me bring it home. Georgia ranks 20th when it comes to gun violence, averaging 2200 deaths per year. Mr. Speaker, we say we're the number one state to do business. And as the rabbi shared with us all this morning that we should put people over politics. And one way we can do this is create a safer environment for all Georgians. So they, too, do not have a moment of silence because we did not do something that we could have done. We yielded well. Thank you, Representative. Representative Gladney is recognized for an F New Order. Representative Lynn Gladney, there she is. Change your glasses from yesterday, didn't you? I like those, too. Thank you, Mr. Speaker. This is a gentle reminder that the women's caucus will be meeting today in room 216 here in the capital. Look forward to seeing you all there. Thank you. Thank you. The lady has yielded the well. Thank you, Representative. That completes our afternoon orders. We have some announcements. Chairman Chokus has an announcement. Take your time, man. I follow down and break your leg or something. I don't want that to happen. Chairman Chokus. Thank you, Mr. Speaker. The small Mrs. Development Committee will be meeting bright in early tomorrow morning at 8 a.m. in room 506. Our program tomorrow will be the Restaurant Association and our own Casey Carpenter will be bringing some delicious samples of his cuisine. And Brent Cox, I hope, will be there, too, to talk about the restaurant industry. Thank you, Mr. Speaker. Hope to see everyone there. Thank you, Mr. Chairman. I just want to thank Chairman Carpenter and Dalton for that beautiful, beautiful rug that we received yesterday. Thank you all so much. That's awesome. One of the best we've ever received. Thank you, Mr. Chairman. And Chairman Tarvan represents Dalton as well. Representative Jasmine Clark. Representative Carter, Dalton Carter is up. So we'll go ahead now. Representative Clark, Jasmine Clark. All right. Good morning, everybody. Thank you, Mr. Speaker. I am here to announce that tomorrow the Georgia Future Caucus is having a luncheon in room 502 in CLOB. All members of the Georgia Future Caucus, that's a bipartisan caucus, so Democrats and Republicans are invited to the luncheon. And then later that evening, we are having a reception at one flu, one flu south on the belt line. That reception starts at 630. It'll be a great opportunity for everyone to meet and network. And that is also for members of the Future Caucus. So lunch at 12 and reception at 630. Hope to see you there. Thank you, Mr. Speaker. Thank you, Representative. Chairman Meeks, you have an announcement. That's here. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Members of the House subcommittee on Economic Development will meet at 1 o'clock in room 341 here in the capital. 1 o'clock in room 341. Thank you, Mr. Speaker. Representative Park Cannon. There she is. Good morning. Good morning. Thank you, Mr. Speaker. Today is a good day in Georgia because it's Dula Day. And now until 2 p.m. they will be in capital room 125, which is right downstairs. I recommend you just stop by and learn about their scope of practice a little bit. They also come bringing free postpartum baby on the way boxes to all members that you can take home to your constituency. So if you just stop by 125 today until 2 p.m. you'll get to meet some Dulas. Thank you, Mr. Speaker. I yield well. Thank you. Go buy and visit. Representative Carter. Nara, we found her. Good morning. Representative Dureen Carter is recognized for an announcement. Good morning. I'm as happy Tuesday. So you all know why I'm here. Our next Thursday, February 1st, we want to encourage you to wear red. And then on Friday, which is actually to go red for women, we are encouraging you to even go back into your districts. Because heart disease is curable. And y'all know we'll come back next week and encourage out of e-bestables. But if we all change our diets, exercise and eat better, we could definitely live a little longer. But our next Thursday, we want to bring awareness to heart disease and women because it is the sila killer. And in this room, we know we're under a lot of stress and we have balanced that. So maybe one day we'll get some yoga inside the chamber. But for next Thursday, please wear red. Thank you. That's next Thursday. Thursday a week. Chairman Hart Newton. Oh, yeah, you've got the blood. Thank you, Mr. Speaker. This is just a reminder that starting tomorrow in between CLOB and the Capitol will be an opportunity to donate blood. It's an opportunity to do something that can help save the lives here in the metro area in particular. We have a blood single blood donation can save three lives. So it's an opportunity to make a big difference. I hope you'll join me tomorrow afternoon in between, I'm sorry, from 8 until 5, between CLOB and the Capitol. You can go in and donate blood. They'll take good care of you and you'll rest easy knowing that you've helped save lives. Thank you. Thank you, Mr. Speaker. Thank you. Thank you for the proponents of giving blood. Chairman Parsons. Recognize for an announcement. Thank you, Speaker Burns. This afternoon at 3 p.m. and room 403 of Capitol up here will have a meeting of the energy utilities and telecommunications committee, EUT. And we're going to be taking up or looking at legislation that we'll deal with the decommissioning of these big solar farms when they have reached the end of life. How it's to be a, how it occurs and who's going to pay for it and how it's done, how to clean up that property. That's a pretty important issue at 3 p.m. room 403 of Capitol. Thank you. Thank you, Speaker. Important meeting room 303 p.m. room 403 for room 3 3 p.m. Representative Brad Thomas, you have an announcement? Let's hear it. Thank you, Mr. Speaker. I'd like to remind all the Cherokee legislative delegation that we will be having a meeting upon adjournment in the anti-room. Thanks. Chairman Williamson, recognize for an announcement. Thank you, Mr. Speaker. I'd like to let everyone know that the majority caucus will be having a lunch at noon today, lunch noon and room 403 for the majority caucus. Thank you, Mr. Speaker. Thank you, Chairman. Thank you, Chairman. Chairman Robert Dickie is up again. Chairman Dickie. Thank you, Mr. Speaker. I have two announcements. If you pay attention, all of you have a disinvitation. It's this afternoon at 4.30 at the depot. The Catholic Isava and the members of the Georgia Food Industry Association and Kevin Perry and the Georgia Beverage Association invite you down for refreshments and social at the depot. That's the depot that's tonight. And also our Ag and Consumer Affairs Committee will be meeting at 8 o'clock in the morning. See you at the lobby. Thank you. Good event. Join them at the depot. That concludes our announcements. We do have a birthday. There's no white-headed guy over here who has a birthday. No, I'm not. Chairman Noel Williams has a birthday. How old are you anyway? 82. Oh. Yeah, he does look like 82. Happy birthday, Mr. Chairman. You're a good man.\n\nMajority leader of this house is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Wednesday, January 24, 2024. On the motion of the majority leader that this house stand adjourned until 10 a.m. Wednesday, January the 24th, 2024. All those in favor. In favor, we'll say aye. Those opposed will say no. That was a little closer by the ayes clearly have it. We are adjourned.",
  "updated_at": "2026-02-13T18:58:24.179164+00:00"
}