{
  "video_id": "obniXpbg8UU",
  "url": "https://youtu.be/obniXpbg8UU",
  "title": "Georgia House - Day 12 (2026-02-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 12,
  "video_date": "2026-02-04",
  "duration_minutes": 51,
  "summary": "Here is a summary of the Georgia House session on 2026-02-04:\n\n**Overview**\nThis was a routine Friday session to start the day with a prayer and pledge of allegiance. No substantive legislation was addressed.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The House chaplain was introduced by Rep. Robert Dickey, who praised the work of Pastor Brian Moore and his church, New Providence Baptist Church, in Monroe County.\n- Pastor Moore delivered the opening prayer, drawing parallels between the role of legislators and the role of priests in the Bible, representing the people before God.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nA quorum was present, as all members were instructed to report to their seats for the morning roll call.\n\n**Adjournment**\nThe session was adjourned. The next session date was not specified.",
  "transcript": "They are for convening, having arrived, all members will please take their seats, all members will report to their assigned seats in the House of Representatives, the clerk will ring the bell.\nWe're about to have the morning roll call, all members present will please vote\ngreen to signify their presence in the chamber and the clerk will unlock the machines.\nHave all members voted?\nThe bill has been sounded, that means to take up position and be ready to vote.\nHave all members now voted?\nSome of the clerk will lock the machines.\nDoorkeepers will please close the doors\nand keep them closed.\nWell, good morning.\nI guess this is what passes for a Friday here, huh?\nLast day of session for the week.\nAnd we will begin it with scripture reading\nand prayer by the chaplain,\nafter which we will pledge allegiance\nto the flag of our country.\nOur chaplain this morning will be introduced\nby the gentleman from the 140th House District,\nthe chairman of the House Agriculture\nand Consumer Affairs Committee,\nChairman Robert Dickie.\nChairman Dickie.\nThank you, Miss Speaker.\nGood morning, everyone.\nMonroe County is home to many churches,\nwhich served the citizens of that area,\nrepresented homes, and represented Washburn and I,\nhave the privilege of representing Monroe County\nhere in the house.\nBut that's a small pocket in Monroe County.\nMany of you probably not heard of.\nA little place called Smart, Georgia,\nright off of I-75, as you pass Versailles,\nit's on the railroad tracks,\nand you can probably,\nthey can probably hear the noise on Interstate.\nAnd this is a home of new Providence Baptist Church.\nI'm honored to introduce their senior pastor, Brian Moore.\nBrian grew up in the town of Versailles\nand has been in the ministry for 22 years\nand the senior pastor at New Providence for 14.\nHe's been married to his wife, Amisa, for 20 years,\nand together they have eight children and three grandchildren.\nBrian called to the ministry at age 19\nand he loves preaching God's Word and has the real passion for it.\nOne of the things that sets new providence apart that many other churches\nis a love for service to others.\nBrian's a real leader in this and it's evident that the many events his church sponsors\neach week with many different aspects of his ministry.\nThis church is celebrating his 200th anniversary\nWhen Brian arrived, it had 40 members.\nHe told me while I go, he has over 500 now.\nSo he has a real refreshing passion and energy\nfor his ministry.\nI found a couple of people who ask about his church,\nand this quote was just a couple of these quotes,\njust so nice.\nIt said, we wanted a church with a hometown feel,\nbut large enough to do mission work worldwide and locally.\nAfter meeting with pastor Brian, we knew this church was where God wanted us.\nAnd another one is you can call a church at place of worship, a Gavin Place, a host of\nevents, but my church is so much more than that, it's like I was sucking home, a place\nwhere genuine friendships are made.\nThat's the kind of church Brian has grown and nurtured and continues to pastor there.\nSo please welcome Pastor Brian Moore this morning.\nThank you, Chairman Dickey.\nThank you, Speaker.\nIt is such an honor to be here today.\nThis is not my first time to the Capitol, but my first time on the House floor, and I'm\ndelighted to be here.\nI have been a resident of Chairman Dickey's District for 41 years, and he has been one\nof our representatives for 10, so about a fourth of my life.\nYep, so we're very delighted for the work that he does.\nI have prayed about what I could speak on today\nthat would encourage you and that would exalt the Lord.\nAnd as I was leaving my house this morning,\nI got the usual encouragement from my children.\nAs I get every morning, one of those is be careful, daddy.\nAnother one is don't die.\nAnother one is tell them about Jesus.\nSo I'm going to try to do all three of those.\nAnd I'm delighted to be here to carry that mission out\nthat was set on me by my children.\nSo I want to read a passage of scripture\nfrom Hebrews chapter seven.\nWhen I think about what you have been called to do,\nI am reminded of the role that Jesus Christ plays in my life.\nIn the Old Testament, there's many, we call them typeologies\nor we call them pictures, we call them foreshadowings\nof what Jesus Christ was going to come and do.\nWe look at the priests and we see that.\nWe look at the sacrifices.\nWe even look at things like the ark\nand we see symbolizes of what Jesus Christ came\nto this earth to do.\nAnd even today, I look around me\nand I see things that remind me of the work\nthat Jesus came to earth to accomplish.\nThere's a joke, be careful what you do\nor say around the preacher\nbecause you'll become an illustration in his sermon.\nBut I want to let you know\nthat you ladies and gentlemen are my illustration this morning in what you've been called to do\nas a representative of your districts. You are here at the Capitol to represent families,\nindividual citizens of where you live. They have appointed you to be their voice, their mediator,\ntheir interceder to the governing authorities and to the rule setters for the state that they\ncall home. And I just want to read this passage. There are so many similarities, but beginning in\nverse 20 of Hebrews chapter seven. It says, and in as much as he was not able or not made\npriest without an oath, for they have become priests without an oath, but he with an oath\nby him who said to him, the Lord has sworn and will not relent. You are a priest forever\naccording to the order of Melchizedek. By so much more, Jesus has become a surety, a guarantee\nof a better covenant.\nAlso there were many priests because they were prevented by death from continuing, but\nhe because he continues forever has an unchangeable priesthood.\nTherefore he is able to save to the uttermost those who come to God through him, since\nhe always lives to make intercession for them.\nThe first resemblance or reminder that I have a thinking of the position that you hold\nis that of being sworn in by an oath.\nAnd typically in Bible times, when an oath was taken,\nit was an end all to disputes.\nBut the validity of that oath generally was based\non the character of the person making it.\nSo we believe that to be true today too,\nthe faith that we put in an oath,\nthe hope of a promise being fulfilled,\nor the confidence that we put in the person,\nmuch of that is based off of that person's character.\nimagine an oath made by an Almighty God, one who is perfect, one who is holy. That's an oath\nthat you can place trust and confidence in. It's an oath that you can say this is one that\nis going to be fulfilled because God will keep his word. And the oath is in Psalm 100 and when he\nstates, the specific reference is Psalm 110 verse 4, I swear that my son will come as a priest\nforever according to the order of Melchizedek.\nBut that's not the only reminder that I have this morning.\nWhen I think about the role of a priest, the role of a priest was to be the voice of\nthe people to God.\nHe was to be a go-between.\nHe was to be the one that would be permitted to go into the Holy of Holies once a year,\nmaking a sacrifice for his own sins, and then a sacrifice for the sins of his people,\nto be able to speak to God and offer up prayers on behalf of those that He represents.\nJust as you are here representing and being the voice to the government and to the governing\nauthorities, you're representing, you're speaking on behalf of your constituents.\nAnd Jesus Christ does that for us in the throne room of God.\nBut then there's this last element.\nAnd it's a picture that we really can't create in our own representation.\nIt says that these priests had to be constantly replaced.\nAs each of you will eventually be replaced, why?\nBecause of one truth that's going to be true of all of us, we die.\nBut the oath that was made of appointing Jesus Christ as high priest was based off of,\nAs long as He lives, He will fill this position.\nWell how long will Jesus Christ live?\nHe will live for all of eternity.\nSo how long will He fill the role of high priest?\nHe will fill it for all of eternity.\nSo how long can He be our guarantee?\nHe will be it for all of eternity.\nHow long will He eat, intercede, and mediate on our behalf?\nHe will do so for all of eternity.\nA role with a longevity that cannot be fulfilled by man.\nBut there's one last thing that I want to point out, and it comes up in the last verse\nthat I read, verse 25, therefore He is also able to save to the uttermost.\nThese priests were able to bring in some resemblance of salvation, but it was temporary in the\nintercession that they made with the sacrifices that were never intended to completely wash\naway sin.\npointed to one that would completely wash away sin.\nIf I were to walk in here today, especially with the COVID restrictions and all of the\nGeorgia State Patrol around the Capitol that I am so grateful for what they do, I would\nbe stopped from entering here because I do not have the proper credentials.\nEveryone would agree with that.\nI am thankful to have been able to be ushered in by Chairman Dickie and I was allowed to\ncome in because of the role that was specifically placed on me today.\nBut on any average day, if I tried to come in and do what you do, they would not allow\nme because I don't have the proper credentials.\nWell there are two credentials that were absolutely necessary in order for someone to enter\nthe presence of God and to remain there eternally.\nAnd those two credentials were that they be completely sinless, perfectly sinless, but\nthat's only half of it.\nThey also had to be perfectly righteous.\nThat means not only have they never done anything wrong, but they've always done everything\nright.\nWell, that eliminates all of us.\nAnd so the only way that we can entertain the presence of an Almighty God where those\ntwo credentials must be met is if we have someone who is constantly interceding on our\nbehalf.\nAnd we see from those two credentials that we single out one individual among all of mankind\nwho has ever walked the face of the earth.\nThere is only one who has been perfectly sinless.\nAnd there is only one who has been perfectly righteous, and guess where he sits now.\nHe sits at God's right hand.\nAnd guess what he's doing?\nIt says in verse 25, he always lives to make intercession for them.\nAnd so when I, a believer in the Lord Jesus Christ, believing that he is my representative,\nwhen I pray, there is one sitting at God's right hand, interceding for me.\nWhen I worship, there is one sitting at God's right hand, interceding for me.\nWhen I need help, there is one sitting at God's right hand, the only one eligible to sit\nat God's right hand, interceding for me.\nAnd when God looks over, when God the Father looks over at God the Son, what does He see?\nHe sees the guarantee that He swore was an oath of a new covenant.\nAnd he swore was the surety and the guarantee of a better covenant.\nBut you know what else he sees?\nHe looks at his hands and he sees some nail scars and he looks at his feet and he sees some\nnail scars and he looks at his side and he sees a spear scar where the soldier pierced his\nside as he hung them across of Calvary and then God sees the price has been paid.\nanyone who places their faith in the representation of the price that Jesus paid is welcome to\ncome into God's presence with the appropriate credentials because their representative\nis sitting at his right hand.\nThe veil has been torn from top to bottom through the work on the cross.\nThat is why there is no other way to approach the presence of God because there is no other\nway that satisfies those two criteria, perfectly sinless, perfectly righteous.\nAnd so with Jesus so faithfully fulfilling both of those credentials and fulfilling the\nrole of interceder and bearing the scars of the price being paid for the sins of His\npeople, then when those of us who trust in Jesus Christ as our Lord and Savior, when\nAnd we bow our heads to pray, or when we desire to worship and Almighty God, all Jesus has\nto say is He's one of mine.\nHe lives in my district.\nI've paid His price.\nHe's welcome in.\nYou can receive His prayers.\nYou can receive His worship.\nAnd when you look at Him, don't look at His sinful past.\nDon't look at His imperfect ability.\nlook at my representation, look at my righteousness, look at the scars I paid his price for him.\nSo my encouragement to you as you so faithfully represent the constituents that have voted\nyou into office, recognize that there is only one eligible representative who can intercede\nfor you before God and His name is Jesus.\nSo I want to pray in Jesus' name knowing that He is interceding for me, but I'm going\nto pray for what you have been called to do, and if you will stand and join me for that\nprayer.\nDear Heavenly Father, I first and foremost want to recognize the holy presence that I\nhave the boldness and the freedom to entertain when I lift my voice in prayer.\nIt's a presence that has been bought and paid for for me to enter by the blood of Jesus\nChrist on the cross of Calvary.\nI know that he is sitting at your right hand right now, interceding for me, and what\nI would like for him to intercede for is my request for wisdom and for understanding\nto be poured out upon this house of representatives\nfor the men and women that make up our house here\nin the state that we call home.\nThank you for putting them in the positions that they are in.\nThank you for the people that they represent.\nMay they represent them well.\nBut according to Romans 13,\nthey represent someone so much higher than their constituents.\nYou tell us in your Word that all governing authorities are set in place by you to carry\nout your will.\nSo my prayer today can be summed up, Lord, in just asking you to deliver your will in\nan understanding way to the people that you have put in place to carry it out in the great\nstate of Georgia.\nMay they hear it with clarity, with wisdom and understanding, and may they act upon that\nunderstanding led by your Holy Spirit. Thank you for sending your son Jesus to\ndown the cross for our sins, making a way for us to spend eternity with you. It is\nthrough his precious and holy name that we ask all of these things. Amen. Let's\nturn our attention toward the flag for the Pledge of Allegiance. I pledge allegiance\nto the flag of the United States of America and to the Republic for which it\nstands, one nation under God, indivisible with liberty and justice for all.\nThank you, Speaker.\nIt's very nice to meet you.\nYou got in a good place there, bro.\nI like that.\nThank you.\nDoorkeepers will unlock the doors.\nChair recognizes, Vice Chairman Dunahue, the Vice Chair of the Committee on Information\nand Audits.\nMr. Speaker, your committee on information and audits has read the journal of the previous\nlegislative day and found it to be correct.\nAnd to keep Chairman Don Hogan in his regular routine, he left me this.\nNo matter how educated talented Richard Koo, you believe you are in the house.\nHow you treat people ultimately tells it all.\nI would imagine that the chairman would equip you well.\nVice chairman Dunnett who the vice chair\nof the committee on information and audits reports\nthat the journal of the previous legislative day\nhas been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's known and the journal is confirmed.\nThe clerk will read the resolution establishing\nthe order of business for the day.\nMs. Burns, 1509th, moves to following me establishes the order of business and earned\nthe first part of the period unanimous consent, introduction of bills and resolutions, first\nreading and reference of house bills and resolutions, second reading of bills and resolutions,\nreports of standing committees, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day. The chair here is not in the resolution is adopted. First reading of bills\nand resolutions, a clerk will read.\nHouse Bill 266, my reps have died of the 130th Meeks, the 178th, Corbett of the 74th.\nRoads of the 120th and Perkle, the 150th. Bill Nitton, an act of menarchal, 3th chapter\n2, a total 40 of the physical to Georgia, annotated, relating to prestige, license, motor vehicles.\nHouse Bill 267, my resident of Thomas,\nthe 21st way to the ninth camp of the 131st\ngunner under the eighth, Chokus 138, and others.\nBill Bitton, an act of men, Chapter 2, a title 21.\nThe official go to Georgia, Anteddi,\nrelating to elections and primaries generally.\nSpecial committee on election integrity.\nHouse Bill 268, my resident of work highs\nto the 157th, a lot of the 120 second,\nBelton of the 112th, Bennett of the 94th,\nHawkins of the 27th and others.\nBill Bitton, an act of men, Chapter 28, a title 43.\nthe physical to Georgia and Tadeau relating to occupational therapists.\nRegulated industries.\nHospital 269, our resident of Clanton of the 75th,\nBill B. Toddl, an act to amend Code Section 6-3-21,\nand the physical to Georgia and Tadeau relating to lands acquired,\nowned, leased, and controlled.\nGovernmental affairs.\nHospital 270, our resident of Fleming of the 121st,\nJones of the 47th, the Loach of the 167th, the Williams of the 145th,\nPaul of the 32nd and others.\nBill B. Toddl, an act to amend chapter 2 of Title 21,\nthe physical to Georgia annotated relating elections in primaries generally.\nSpecial Committee on Election Integrity.\nHouse Bill 271 by resident of Reed is the 34th Cooper, the 43rd new owner, 23rd, a lot\nof the 120-second Sharper, the 177th building title and act to amend Article 2, Chapter 11,\nTitle 31.\nThe official go to Georgia, Ontario, relating to licenses for emergency medical services.\nHealth and human services.\nHouse Bill 272 by resident of Ballinger, the 23rd Hover, the 179th Gains, and a lot\nSeptember 17th, richer than 97th,\nper chat of the 176 and others,\nBill Bitton and act to amend chapter 11 of title 15,\nthe official go to Georgia,\nannotated relating to juvenile code.\nJuvenile justice.\nHouse Bill 273,\nRepresentative Ballinger,\nthe 23rd carpenter of the fourth,\ncolumns the 68th and dollar of the 45th,\nBill Bitton and act to amend our three, chapter four,\ntitle three, the official go to Georgia,\nannotated relating to local authorization\nof regulations for manufacture,\ndistribution and packet sales.\nRegulated industries.\nHospital 274 by Rose, an impalenger\nof the 23rd Fleming of the 111st\nof the 97th perched of the 176th\nand abstraction of the 104th.\nIt'll be titled an act to amend Article 2, chapter 11\nof Title 15.\nThe official go to Georgia,\nannotated relating the juvenile court administration.\nJuvenile justice.\nHospital 275 by Rose and a McDonald,\nthe 26th hatched in the 150th pile\nof the 32nd columns of the 68th smyrie, 135th and others.\nWilmington, an active men chapter four,\ntitle 25, an article three, a chapter 11, a title 31.\nThe official go to Georgia and Teddy relay general provisions\nrelative to firefighter standards.\nPublic safety and homeland security.\nHospital 276 by Rosa Singleton and 71st Cantrell\nof the 22nd, a lot of the 120 second.\nJones the 25th and Carpenter the 4th and others.\nWilmington, an active men, title 20.\nThe official go to Georgia and Teddy relating to education.\nEducation House bill 277 by reps and a Mitchell of the 88th building title an act to amend part four of article six in chapter three a title 12\nThe fish go to Georgia annotated relating the Stone Mountain Memorial Association rules\nHouse bill 278 by reps and a clerk of the hundred and forty seven workies of the hundred and fifty seven with the carpet of the fourth Martin of the 49\nTarvern of the second and others building title an act of men title three the fish go to Georgia annotated relating now\nCalcolic beverages regulated industries hospital to 79 members on the Lewis Ward of the hundred and nine th Allen of the 40th Clark of the hundred and eight Wilkerson of the thirty-eighth and Evans of the eighty-third\nThere'll be Todd and act to men article on the chapter 16 to title 12 the fish go to Georgia and it ended relating to environmental policy\nNatural resources and environment possible 280 by represent of Bodie the sixty second Beverly the hundred and forty-third Wilkerson of the thirty-eighth\n8th, Eugly, the 136, Clark, 100, 8th, and others.\nIlbyn Todd, an act to amend chapter 2,\na title 21 of the Efficiency of the Georgia Annotated,\nrelating to primaries and elections generally.\nSpecial committee on election integrity.\nHouse will 281 by reps of the percentage\nof the 176, Corbett of the 174th, B3, the 166th.\nThe hood of the 175th, Ridley, the 6th and others.\nIlbyn Todd, an act to amend part three of Article 4, chapter 11,\na title 16 of the Efficiency of the Georgia Annotated,\nrelating to carrying and possession of firearms.\nPublic safety and homeland security.\nHouse Bill 282, by resident Meeks of the 178th,\n116th hatches of the 150th Watson,\nthe 172nd and Dickie the 104th.\nBill B. Todd, an act of men article 13 in chapter five\nof Title 48, the official Georgia annotator\nrelating to ad ballorem taxation.\nWays and Means.\nHouse Bill 283 by resident of Wilkerson\nof the 38th couch of the 50th Sharper,\n177, Clark of the 108th, Park of the 101st and others,\nthere'll be Todd on act to men, coach section 20,\n3, 5, 19, the physical to Georgia,\nannotated relaying the definitions regarding hope scholarships.\nHigher education.\nHousema 284 by Rosa Cantrell of the 22nd, Evans of the 57th,\nWilson of the 80th, Park of the 101st and Clark of the 147th\nand others, there'll be Todd on act to amend chapter 2,\nentitled 21 of the physical to Georgia,\nannotated relaying the elections and primaries generally.\nSpecial Committee on Election Integrity.\nHouse Bill 285, I was in Cantrell of the 22nd bar\nof the 103rd, Clark of the 147th,\nand Work Heiser of the 157th.\nHe'll be Todd O'Nack to amend chapter two,\nthe title 21 of the official go to Georgia,\nand it ended relating elections in primaries generally.\nSpecial Committee on Election Integrity.\nHouse Bill 286 by Representative Gaines,\nthe 117th Kelly, the 100th of the 16th.\nDempsey of the 13th, Weed Hour of the 119th columns,\n68th and others.\nBill B. Todd on active men.\nChapter eight to title 36.\nThe fish go to Georgia.\nAnterty relating to county police.\nGovernmental affairs.\nHouse bill 287 by Rift and Rich.\nThe 97th Jasper's to the 11th new to the 123rd.\nBelton the 112th camp of the 131st and others.\nBill B. Todd on active men.\nPart two of Article six to chapter two.\nA title 20.\nThe fish go to Georgia.\nAnterty relating to competencies and core correctly.\nEducation House bill 288 by Rift and Belton.\nwith 112th, half-stration, 104th,\nballinger, the 23rd, rich of the 97th,\nand mopped a hand of the 17th.\nIlmeetown, an act of men article two,\nchapter nine, a title 42.\nThe fish go to Georgia, an Tadya,\nrelating to grants of pardons, peroles,\nand other relief.\nJudiciary non-seval.\nHospital 289, I wrote, set a belt\nin the 112th, corporate of the 174th,\nPaul the 32nd, Hitchens on, 61st,\npartner of the fifth, and others.\nIlmeetown, an act of men article two,\nchapter five, a title 40.\nThe fish go to Georgia, an Tadya,\nrelating the issuance, expiration, and renewals\nof driver's licenses.\nMotor vehicles.\nHospital 290, driver of some assessor of the 35th,\nNewton of the 123rd, and hatched into the 150th.\nBill Mitao, an active man, article 1, chapter 7,\ntitle 31.\nThe official go to Georgia, annotated, relating\nregulations, hospitals, and related institutions.\nHuman relations and aging.\nHospital 291, driver of some of Dempsey, the 13th,\nMartin, the 49th, spirited, and 135th,\nthey're hard of the 36th, and perished to the 158th.\nBill B. Todd, an act to amend Code Section 20, 3, 4-11\nof the official code of Georgia annotated relating\nto definitions regarding tuition equalization grants.\nHigher education.\nHouse Resolution 79 by Rosanna Dryer, the 59th.\nSkullfield of the 60th, the resolution urging\nthe Georgia Department of Transportation\nto erect sound barriers for the city of Hapel.\nTransportation.\nHouse Resolution 80 by Rosanna.\nMitchell, the 88th Thomas of the 39th,\nbeen of the 94th and Hugley of the 136th of a resolution to ratify proposed\namendment to the United States Constitution.\nJudiciary, that completes first readers.\nSecond reading of Bills and Resolutions, the Clark or Reed.\nHouse Bill 17 by Representative Scott of the 76th,\nSmirer of the 135th, Hugley of the 136th,\nThomas of the 39th and Kendrick of the 93rd of Delberlake,\nto law enforcement officers, agencies,\nIn the state twerk claims, House Bill 18 by Rep. Scott of the 76th,\nThomas of the 39th, the cloud of the 105th, the bill relating to law enforcement officers and agencies.\nHouse Bill 242 by Rep. Chokus of the 138th in Yarta of the 150th second,\na bill to amend an act, providing a new charter for the City of America's House Bill 243 by Rep.\nThomas of the 21st, Carson of the 46th, Smith of the 133rd,\nWashburn of the 141st, the bill relating to annexation,\npursuant to application by 100% of landowners, House Bill 244 by Rep.\nof Hogan of 179 to Louch of the 167th Sains of the 180th Meeks of the 178th Williams of the 148th\nthe bill relating to the funding of services House Bill 245 by Representative Lehood of the 175th\ngains of the 117th Cooper of the 43rd Mutant of the 123rd in the homes of the 129th the bill\nrelating to dietary practice House Bill 246 by Representative Watson of the 172nd\nCorporate of the 174th Ridley of the 6th Mathis of the 144th Mum to Hand of the 17th\nthe bill relating to driver's licenses, House Bill 247 by Representative Carson of the 46th\nthumbs of the 12th Collins of the 68th, Petrie of the 166th,\nKitchens of the 161st and others, the bill relating to uniform rules of the road,\nHouse Bill 248 by Representative Powell, 32nd Corp of the 174th,\nwill then give the 79th and Collins of the 68th, the bill relating to enforcement of speed\nthem in school zones with recorded images, House Bill 249 by Representative Powell,\n32nd Corp of the 174th, the bill relating to equipment and inspection of motor vehicles,\nHouse Bill 250 by reps of air heart of the 36th, Carson of the 46th, Parsons of the 44th, and Sets of the 35th.\nA bill relating to absentee voting, House Bill 251 by reps of Planson of the 75th, Bernal of the 77th, Neal of the 74th,\nBaysmore of the 63rd, and Scofield of the 60th, the bill to amend an act providing for the composition and manner of selection of the Board of Education of Clayton County, House Bill 252 by reps of Scott of the 76th.\nJackson of the 64th for now the 77th Williams of the 168th Davis of the 87th the bill relating to income taxes\nHouse bill 253 by reps of homes of the\n129th the bill to create the Jones County Public Facilities Authority House bill 254 by reps of 11 of the 12th\nWilliams in the 115th Taylor of the 173rd Hughley of the 136th and Tarvan of the 2nd\nthe bill relating to licensing of agents agencies sub agents counselors and adjusters House bill 255 by reps of\nof the 181st administration of the 104th Hitchens of the 161st all over the 82nd\nHugley 136 and others, a bill relating to the sexual assault protocol, hospital 256\nby Rep. Bernal of the 77th Mitchell of the 88th,\nHulcom of the 181st, Bentley of the 139th, more of the 95th and others, a bill relating\nto Hope Scholarships and Grants, hospital 257 by Rep. Setslow of the 35th, a bill relating\nto Children and Youth Services, hospital 258 by Rep. Sains of the 180th, mom to hand\nof the 17th camp of the 131st,\nwe're shadowed at 176, clock of the 147th,\nthe bill relating to sexual offenses.\nHouse bill 259 by reps of Bernal of the 77th,\nyou believe the 136, welcome of the 81st,\nmentally of the 139th,\ngo field of the 60th and others,\na bill relating to Hope Scholarships and Grants,\nHouse bill 260 by reps of Jones of the 25th,\nthe bill relating to selling and other trade practices,\nHouse bill 261 by reps of Jones of the 25th,\nPetri of the 166th,\nRidley of the 6th, Hatchet of the 150th,\nand Crabley of the 67th Bill relating to the care and protection of indigent and elderly patients.\nHouse Bill 2-62 by Representative Kenner to the 102nd clerk of the 108th win of the 89th Carter of the 92nd Wilson of the 80th and others of Bill relating to elementary and secondary education.\nHouse Bill 263 by reps of Skoggins of the 14th gamble of the 15th dollar of the 19th Williams of the 145th gamble of the 171st Bill relating to the amount of retirement benefits for judges of the probate courts.\n264 by Reptile Hutchinson of the 107th Park of the 101st Lopez of the 86 win of the 89th\nDofield of the 60 of the nuthers, the bill relating to offenses involving illegal aliens.\nHouse bill 265 by Reptile Knight of the 130th Williamson of the 115th blackman of the 146th\nof bill relating to revenue and taxation. House Resolution 76 by Reptile Hutchinson of the 107th\nPark of the 101st Lopez of the 86 win of the 89th Mitchell of the 88th and others resolution\nencouraging replacement of the term illegal alien with the term undocumented person in the official\nGeorgia annotated House Resolution 77 by Representative Prince of the 127th Nelson of the 125th\nNewton of the 123rd Lot of the 120th Second, Fleming of the 121st Resolution, supporting the creation of the State Veteran Cemetery and Augusta Richmond County House Resolution 78 by Representative Scott of the 76th Mitchell of the 88th Spire of the 135th Williams of the 168th\nYou believe the 136th and others Resolution declaring racism a public health crisis in Georgia, your second readers\n.\n.\n.\n.\nThe, um, could I have your, well, the house come to order, please.\nA number of members have indicated to my office that they forgot about testing today.\nWell, you got nine minutes to get down there and get tested.\nsuffer the repercussions. The other reminder is the wearing of mask on the floor of the\nhouse unless you are speaking into a microphone is mandatory. It's not optional. So mask up\ntake care of your neighbor and go get your test. Reports of standing\ncommittees, the clerk will read.\nRepresentative Chuck Martin of the 49th District Chairman of the Committee on Higher Education\nSubitone of the following report, I'm going to speak your committee on higher education\nadded to consideration, the following bill of the House. And it's a structure meeting\nreport to the same back to the House with the following recommendations House Bill 67\ndo pass, respectfully submitted, Representative Chuck Martin of the 49th District Chairman.\nRepresentative Chief of the 144th District Chairman of the Committee on Judiciary submitted the following report to speak your Committee on Judiciary's own consideration.\nThe following bill is in the House and the Senate is instructed to report the same back to the House of the following recommendations, House Bill 97, new pass, House Bill 134, new pass, Senate Bill 9, new pass, respectfully submitted, Representative Chuck\nregistration of the 104th District Chairman.\nRepresentative Tray Kelly, the 16th District Chairman,\nthe Committee on Special Committee on Access to the Civil Justice System submitted the following report.\nMr. Speaker, the Committee on the Special Access to the Civil Justice System is head on consideration the following bill of the House.\nMr. Stockton, we report the same back to the House of Defiling Recommendation, House Bill 112, do pass, respectfully submitted.\nRepresentative Tray Kelly, the 16th District Chairman.\nRepresentative Gerald Green in the 151st District Chairman of Committee on State Properties submitted the following report\nbut speaking to your Committee on State Properties has had a consideration following Bill of the House.\nHowling Resolution of the House and has instructed me to report same-backed the last filing recommendation House Resolution 14\ndue passed by Committee Substitute, respectfully submitted, Representative Gerald Green in the 151st District Chairman.\nRepresentative Shaw Blackman on the 146th District Chairman of the Committee on Ways and Means submitted the following report.\nAnd to speak your committee on Ways and Means is at a consideration the following bill of the House and instructor meeting reports saying back to the House the following recommendation House will 265 do pass.\nRespectfully submitted representative Shaw Blackman on the 146th District Chairman that completes the reading of the reports of standing committees.\nAll right, we're going on now to morning orders.\nHouse will come to order. The House will come to order. We're going on to\nmorning orders. Two minutes each for a morning order. If you have signed up and\nyou're not down front when your name is called, we're going on to other\nother business. Chair recognizes representative Doreen Carter for a morning\norder.\nOh, I was supposed to do. Okay, thank you. I give my time back. Good morning, everyone.\nI am here this morning. I'm going to need your social distancing.\nI'm here this morning again to remind everyone that it is heart month and in the month of\nFebruary the American Heart Association brings awareness to heart disease with women and\nI will say that over the last few years there has been some progress in some of the work\nthat has been done but we continue to have more work and I'm like the close by remembering\nCheryl Knutson who passed last year in her sleep after not feeling well and not telling\nanyone she had a heart attack in her sleep.\nI also want to remember Mrs. McLean,\nDewey's wife who's recovering from a stroke.\nAnd most recently on December 10th,\nI actually had a stroke after having a heart attack\nfew years ago.\nAnd so I want to continue to encourage everyone\nto be mindful of their health, be mindful of the work,\nand on tomorrow at 11.30 we'll have a virtual event\nfeaturing Dr. Jane Morgan, who is a cardiologist\nand clinical director of the COVID Task Force at P.\nMy Health.\nSo we will send you all the detail on that.\nThank you.\nWe yield the well.\nChair recognizes representative Bonner\nfor a morning order.\nThank you, Mr. Speaker.\nThis morning, I'd just like to recognize a group.\nYou may have seen some students\nin and around the capital of the last few days.\nand I just wanted to recognize TeenPak,\nit's an organization that began here in Georgia\nback in 1993 and it was started by our own Georgia\nPublic Service Commissioner Tim Eccles.\nIt's now a nationwide organization in all 50 states\nand the mission of TeenPak is this,\nthey seek to inspire youth in their relationship with Christ\nand train them to understand the political process,\nvalue their liberty, defend the Christian faith\nand engage the culture around them.\nThey offer classes on state government, policy,\ncritical thinking, and effective communication.\nSo if you see these students around the Capitol today,\nplease take a moment, speak to them.\nYou are more than likely to find a constituent or two\nand quite possibly your future replacement.\nThanks, Mr. Speaker, I yield the well.\nChair recognizes Representative Hutchinson\nfor a morning order.\nGood morning, colleagues.\nToday, I bring you Cameron.\nCameron is 11 years old, and he is available for adoption\nin the state of Georgia.\nCameron wants to be a police officer one day.\nCameron is active.\nHe loves playing outside.\nHe loves playing and watching football, basketball,\nand soccer.\nCameron loves to listen to Justin Bieber.\nHe loves watching action movies and Paw Patrol.\nAnd I picked him today because I thought he would do well\nin our bow tie caucus.\nThank you, Mr. Speaker.\nI yield the well.\nThat completes our morning orders.\nChair recognizes Chairman Darley and Taylor for a motion.\nI'd like to make a motion, state your motion, I move that we take House Bill 222 and move\nit from intergovernmental coordination to governmental affairs, both Chairman agreed.\nChairman Taylor has moved that House Bill 222 be transferred from the Intergovernmental\nCoordination Committee to Governmental Affairs Committee is their objection, Chair\nHere's none, it is so ordered.\nClark will read the caption to a group of privileged\nresolution.\nOrganizing and commending.\nLegion of Prussia.\nOrganizing and commending.\nHenrietta Antinent.\nrecognizing commending and celebrating March 25th, 2021\nas of the bicentennial anniversary\nof Greek independence day.\nCommending small businesses and recognizing\nMarch 24th, 2021 as women own business day\nat the state capital, honoring the life and memory\nof merit, Jay Johnson, the third, honoring the life and memory\nof Gerald Connor, honoring the life and memory\na memory of Sarah Sally Emory Daniels, honoring the life and memory of Ruth Marie Caudell\nand for all the purposes that completes the reading with privilege resolutions.\nYou\nIs there any objection to adopting the privileged resolutions that Chair here's not in the resolutions\nare adopted. Chairman Smith, when are we going to see some bills? I don't I mean I'm\nnot really pushing for them. Well I guess whatever we get some. Fair enough. Thank\nyou, Mr. Chairman. We may just pass a budget and go home, right, Mr. Chairman?\nAll right, if you signed up for an announcement, make your way to the front of the chamber.\nMake your way to the front of the chamber.\nThere are recognizes representative Holland for an announcement.\nThank you, Mr. Speaker.\nThe City of Atlanta delegation will meet tomorrow, Friday, at noon via Zoom.\nThank you.\nChair recognizes representative Buckner for an announcement.\nThank you, Mr. Speaker.\nThe working families call us, we'll meet today at noon.\nWe are and we will be virtual and also hybrid.\nSo if there's space available, come to 307 and sit with us.\nIf you want to watch it online, it will be available that way as well, but the lunches\nwill be in 307 and the LOB.\nThank you.\nChair recognizes Chairman Ballinger for an announcement.\nThank you, Mrs. Speaker.\nYour juvenile justice committee will meet today at one.\nMembers should have received a Zoom link\nif they would like to go ahead and depart our fine capital\nand head home, but we will be meeting it today at one.\nThank you.\nChair recognizes Chairman Matthew Act for an announcement.\nThank you, Mr. Speaker.\nHeads up to state planning and community affairs.\nPlease watch your email.\nWe will be meeting Monday at 10.\nThe email will give you the location.\nThank you, Mr. Speaker.\nChair recognizes representative Kendrick\nfor an announcement.\nRepresentative Kendrick going once.\nThank you, Mr. Speaker.\nSo for the women that took the photo all in white,\nIf you could come down to my desk and get a copy of your picture is right there on my desk.\nI appreciate it. Thank you, Mr. Speaker.\nThat completes our announcements.\nI want to wish all of you a great weekend.\nI'm looking for Chairman Ron Stevens. I've got my phone ready.\nWe've got a Super Bowl, Sunday.\nI want to see if he is open for business yet.\nChair recognizes the majority leader of the House for a motion.\nThank you, Miss Speaker.\nballgame this weekend I believe is it it yeah I don't think the Falcons are in it\nthough I'm afraid you're correct but they but they won't stuff there is that\npart maybe they'll continue to move forward we hope miss speaker I moved at\nthis House stand adjourned until 1 p.m. Monday, February 8th, 2021.\nThe majority leader has moved that this House stand adjourned until Monday, February 8th,\n2021 at 1 o'clock p.m. That's 1 o'clock p.m. All those in favor of the motion will say\neye. Those opposed will say no. The eyes have it and this house will be adjourned\nuntil Monday at 1 p.m.\nYou\n",
  "updated_at": "2026-02-12T15:36:02.36047+00:00"
}