{
  "video_id": "Oj_RYaSpi4o",
  "url": "https://www.youtube.com/watch?v=Oj_RYaSpi4o",
  "title": "Rules PM Meeting pt. 2 for Day 39 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 38,
  "summary": "Here is a structured summary of the Georgia Rules PM Meeting pt. 2 for Day 39 of the 2025 Session:\n\n**Overview:** This meeting focused on discussing and explaining the details of a substitute version of Senate Bill 12, which deals with defining custodians for open records requests and expanding legislative privilege.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Chairman Anderson explained the key provisions of the substitute Senate Bill 12, including defining custodians for open records requests and expanding legislative privilege to cover communications between the legislative and executive branches.\n- There was a discussion around whether the expanded legislative privilege provisions were intended to hide information from the public, with concerns raised about protecting communications with private entities that may influence legislation.\n- The chairmen defended the changes as necessary to protect the ability to have candid conversations and receive accurate information, arguing that existing legislative privilege should extend to written records as well.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** Quorum was present to conduct the meeting.\n\n**Adjournment:** The meeting was adjourned. No information provided on the next scheduled session.",
  "transcript": "You\nIf you would, please come in and have a seat, and we'll call the meeting to order.\nOkay Chairman Anderson you want to come up and explain substitute the Senate bill 12\nThank you, Mr. Chairman, and I will attempt to do what you have asked me to do\nSenate bill 12 is\nOriginally was a relatively short bill that simply defined custodian when it came to the question of open records requests\nAnd this is still in the bill.\nOkay, it's section two, I believe it is of the bill now.\nSo I'll talk about that first, but the original bill did was to,\nactually it's section three now with the rewrite of it.\nBut it defines custodian, it directs that all requests for public records.\nShe'll be made upon a custodian.\nIt also says that private persons or entities, she'll provide the custodian\nwith those records upon requests if they are in the public records and that they shall\nmaintain those in accordance with statutory requirements as far as time frame and that\nsort of thing. And then we in in the the sub we've gone further and added the word public\nin many sections in front of the word record simply because public record is defined\nbut just the simple word record is not in the code as amended.\nThat is that portion of it.\nNow, I'm going to drop back to Section 1.\nAnd Section 1 is relatively simple.\nIt excludes, and I'm going to read this to make sure I get everyone.\nIt says, we're talking about agency.\nAnd this would be an agency subject to open records request.\nSuch terms shall not include the legislative branch,\nincluding but not limited to the General Assembly and its members, officers, staff, committees,\ncommissions and offices.\nWe currently have and utilize legislative privilege on our conversations internally.\nWhat this does is this extends that to our conversations with other departments primarily\nin the executive branch.\nThat's my understanding as to the purpose of this.\nAnd there's a lot of, and just my commentary here, there's a whole lot of pages in here\nwhere nothing is done.\nSo the two and a half page bill went to 34 pages, but the bulk of those pages, there are\nno changes too.\nSo I'm going to jump over to page 10, I believe it is.\nAnd this is under the reference to code section 50-18-72.\nThis was a recommendation from the Prosecuting Attorney's Council.\nJust to, and what I'd like to do, if I may, Mr. Chairman, could I invoke the call of friend\noption and let Chairman Leveritt explain this portion where there's just a couple of lines\nadded to this code section?\nChairman Leveritt.\nThank you, Mr. Chairman.\nAnd thank you, Chairman Anderson, I didn't think you needed any help, you're doing great.\nBut so this is the statute 50, 1872, which are the exceptions to the Open Records Act.\nAnd one of them are records of law enforcement, or lighting to a pending investigation.\nBut there's an exception to that exception, even if there is a pending investigation,\nthe traditionally the word used in the code was the initial incident report, was still\nsomething that law enforcement will have to tinder in response to an open records request.\nWe're sort of clarifying that a little bit by making it the first incident report completed\non a standard incident report form to clarify what is the exception to the exception.\nAnd then there's also a provision in that exception that says, well, but at some point\nBut you can't use this exception about a pending investigation when the investigation is\nreally pretty much over.\nAnd we're just finally, the language was when all the rec litigation involving the investigation\nand prosecution has become final or otherwise terminated, PAC is asked to clarify that because\nI think there's been some disagreement about what that means to upon a final disposition\nof the accusation indictment or complaint and exhaustion of any right of appeal for all\nindividuals charged on the same accusation indictment or complaint.\nSo that was a, I think, of some just kind of, I guess you could consider it clean up or clarification that they requested to that particular provision in the exemption statute.\nOkay.\nThank you, sir.\nThen we jump to page 26 in the current version where there is added on line 677 and 678\na reference to the Department of Human Services which I would expect is was an omission in the\noriginal text of the statute that needed to be added to make sure we cover the appropriate\ndepartments within that section then the last provision that I have seen in the current\nrewrite of this occurs on chapter or excuse me page 30 where there are additional references\nto as I mentioned earlier the communications between the legislative branch and the\nexecutive branch Mr. Chairman I will okay be glad to attempt to get a\ncouple of questions with part. Thank you Mr. Chairman Chairman Anderson you\nare right there on page 30 with respect to line 769 to 777 why is the\nmajority party trying to expand from disclosure or to keep private\ncommunications between the legislative branch and a private person or a private entity.\nDoes that not greatly expand non-disclosure laws?\nWhat are y'all trying to protect?\nAnd then what are you trying to hide, I should say?\nAnd then on line 774 to 777, again, we are excluding from public disclosure\nor keeping hidden from the public movements within a building, any sort of government building.\nCan you help me better explain why we are trying to hide more information from the public,\nespecially when legislators are engaged in conversations or receive information from\na private person or a private entity?\nIf you'll give me one second, sir, let me just make sure, again, I was just given a fresh\nre-rattle, some of this.\nSo, Chamberlabor, if you look at this portion, we'll need to.\nYes.\nWell, first of all, I appreciate the sense of loving kindness in which you asked the question,\nyou know, what are you trying to hide?\nI don't think we're trying to hide anything.\nThere's currently existing under law, legislative privilege, and which protects conversations that\nwe have with people about legislation.\nThis is just saying, just because it ends up a document or a communication being in the hands of the executive branch doesn't remove the legislative privilege, it's still exempt from the open record.\nMy concern, I do have concern between further protecting conversations between the legislative and the executive branch, but again, this subsection 54, with respect to private persons or private entities and the performance of a service or function for the legislative branch.\nWell, generally my understanding is if I have a private conversation with someone about\nlegislation, legislative privilege applies to that.\nSo are you saying to simply codifies existing laws?\nWell, if it does, it just makes, if you have a written record of the communication that just\nexempts them from the open records, which just simply kind of furthers the existence of the\nprivilege, otherwise the privilege doesn't really mean anything.\nAnd I would think there are times when we have conversations\nthat involve we rely on people to give us honest information.\nAnd if they think that we're going to have to say what they told us,\nthey might not be as truthful with us about it or as forthright.\nI would respectfully disagree, I think,\nas elected officials subject and how accountable to the people.\nI think the people should have the right, would you not agree,\nto know where certain information that impacts and influences legislation,\nwhere that comes from, whether it is a extremist organization,\nwhether it is a foreign billionaire,\nI think the people are subject to that information\nof which my understanding and plain reading of this language\nis that that would protect those sorts of conversations\nand communications.\nSorry, I'm gonna talk to you.\nI mean, I respect the opinion.\nI agree that's a different policy,\nbut I think it's more important to get accurate information.\nAnd my understanding of the privilege is that that's the policy that's been adopted by the application of the privilege and that's why the privilege exists in the first place.\nAnd also you would ask about electronic access system. My understanding is that has to do with the security systems here and the codes and without that people could get access to all of the codes and be able to access building without being tracked.\nThat's part of the reason for that, because I'll know you didn't ask about that, but you did you did make some references up\nWe're trying to hide our goings and comings. That's not what's going on. We appreciate it has a question\nThank you chairman is for bringing the bill isn't it true chairman that the federal government recognizes a much broader legislative\nPrivilege than the state of Georgia and this this language is in line with that legislative privilege\nthat the federal government utilizes.\nIt is my understanding, sir.\nIsn't it also true that the key words in line 777 and 777\nand the performance of a service or function of legislative branch\nand to the point of Vice Chair that when we are performing\nour legislative function, in other words having conversations\nabout legislation or excuse me putting together legislation\nIf we want those honest conversations,\nthen folks don't want to be subject to any type of request\nof the information.\nAnd this is just clearly an opportunity for us\nto maintain a good piece of, or excuse me,\nit's an opportunity for us to just align ourselves\nwith a much broader legislative privilege, is that true?\nI would say yes sir and if I may further with that just to speak on behalf of my colleagues\nwho are not attorneys and seasoned in the ins and outs of law it is difficult sometimes\nfor us to determine what conversations we have in the course of conducting the business\nof the state and the legislature that are protected or not.\nSo what this does is for all of us it provides a clarity and provides a definitive answer\nto me of that question that those conversations in the course of doing my legislative duties\nare protected.\nOkay.\nWe had a question of Mr. Evans.\nThank you, Mr. Chairman, to the Chairman of the podium.\nThe parts of the bill that were other than the 39 lines or so that you said were the\noriginal Senate Bill 12 has any of the language, including the language we just been discussing\nat 767 to 7777 and then the other new language that wasn't part of the original.\nHas any of that, was that any of that in a bill that went through any substantive committee\non either the House or the Senate side for any vetting?\nI do not know the answer to that question.\nHow did it come to you?\nIt came to me as a sub, a rules committee sub that I am here presenting.\nAs far as you know, this language, it may have not been ever vetted at all, other than\nwhat we're doing right here.\nI can't speak to what may have been presented in the past.\nI'm not knowledgeable of any presentation of this this session.\nWell, if anybody on the committee knows and would be up to the chairman if they could\nshare now, but maybe they could share with me later.\nother question back on line 769. I understand the point that the whip and the\nvice chairman were making about our legislative privilege and I don't\ndisagree with that but this this language at line 769 wouldn't you agree is\nway broader because this says records are data relating to the legislative\nbranch. I'm not really sure what that is. Also it's going to protect just straight\ndate up data that an agency may create, an agency may create a spreadsheet summarizing\ninformation.\nIt may summarize dollars relating to some budget item and maybe that data was originally\nthe request of someone from the legislature but it's not its data, just like the attorney\nclient privilege doesn't protect data, it protects communications and advice.\nThis is going way further in protecting underlying data that perhaps we may request in a study\ncommittee that the public certainly has a right to know does that do you\nread it as broad as I do and does that not concern you I will defer also\nagain later to lines 170 171 where it does say that in the performance of a\nservice or function of the legislative branch or on behalf of the legislative\nbranch. Right. The data and the information, the records that would be covered in this would\nonly be for the purpose of the performance of that function. But when you agree that any data\nperhaps that the budget office prepares that summarizes dollars, reserves, spending over time,\nups and downs, that's all probably requested from someone in this body. But the data\nis not part of our legislative thinking and crafting that I think the\nlegislative privilege is designed to protect. Why are we trying to protect data\nand information in our state government from the public? I would have to say\nyou'll have your opinion on that again. My basis for supporting this would be the\nin the performance of a service or function. Do you agree that that should be\nshielded from the public. If we ask the budget office to create summaries of\nreserves and ups and downs and projections, do you agree that the public\nshouldn't see that just because perhaps the budget chairman asked an office to\ncreate it? I can't speak to every circumstance. I know there are circumstances\nwhen I do think that should be yes. Thank you. 15 Miller has a question. Thank\nThank you, Mr. Chairman, to the author of the bill on line 237-338, where we do quote-unquote\nclean up, oftentimes in investigations, criminal investigations are multiple incident reports\nand initial incident reports.\nofficers for example can respond to the scene and give an incident report based\non their observations. Is this meant to and those are routinely produced because\nthey are incident reports? When we say first initial the first initial report for\nany officer or any investigation can you just tell me what we're what we're\ntrying to do with this? I appreciate the question. I cannot answer that question.\nI would again defer to my learning colleague, Chairman Liberty, if I may, Mr. Chairman.\nIt's answering the lady's question.\nAs I read it, it's talking about the first incident report prepared.\nAnd my understanding is there is generally one incident report prepared for an investigation\nthat's the initial one that's done.\nAnd that would be attainable in open records.\nNow, this doesn't impact what you could get through discovery in the criminal case.\nNo, no, no.\nThank you.\nWe're just talking about what is subject and available by way of open records.\nIt is the intention to limit the amount of information that folks can get on a case\nthrough the open records.\nI think that you could get through to a pending case that's still being prosecuted.\nYes, I think it's intended to limit it to what I think customarily at least I've always\nunderstood as the city attorney was what you had to produce.\nOkay, and then to the broader scope of what I think this bill is trying to do, I guess\nmy question to the author is normally in, for example, attorney client privilege or\nwork product privilege or psychiatrist patient privilege, there are boundaries, there are\nthings that you have to establish. It is limited in scope. It can be waived. It does not\nprotect, for example, crime or fraud. And I'm wondering if you are contemplating in this\nprivilege, is it really as broad as anything that is communicated to a legislator in the\nprocess of them doing their job as a legislator, anything, any conversation, any record, any\npiece of data, is that what we're really trying to do here?\nFirst of all, my answer to that question upon reading what we have in front of us here\nis there is nothing that would prevent the waving of the privilege or voluntarily participating\nand that sort of thing, but as far as whether it is intended to cover anything, again, I defer\nback to line 770 and 771, that is in the performance of a service or function of the legislative\nbranch or it won't be half of the legislative branch.\nSo if it is in that performance and function, it would be covered under this, but those\nother provisions, the other exceptions and exclusions you spoke of, there's nothing\nI'll see you in here that we've heard of it then.\nThank you.\nI'd do, Mr. Chairman, I want to ask about the CARBA on 55 and just if there's an explanation\nfor those records which are the access records to the buildings, I think there's some oversight\naspect of whether or not somebody was actually working that day and so if you can share just\na little bit behind that. Is it a safety thing or something else?\nTo who I'm ever can answer it. Yeah, it's line 774 to 777. So\nthe exception 55. Yes. Yeah, that's my understanding is is without that\nexemption. All of our the codes that that are maintained by us could be subject\nto open records arguably. And it is a matter of not only of safety, but also\nsecurity in the building because if you know all the codes then you can make your own card and come\nany time. You're talking to a guy who's more analog than I am digital but that was my understanding\nof the need for that exception. I could understand the codes but it would seem whether or not we were\nusing the access cards to actually access the building should still be subject to being disclosed.\nWell, again, we're not talking about disclosure of facts.\nWe're talking about production of documents here.\nSo these are electronic or tangible three-dimensional documents.\nSo you could get electronic documents or electronic data\nrelating to all that information, which would allow you basically\nto hack the whole security system.\nOK.\nAll right, thank you.\nThat's my recollection as it was explained to an old guy.\nThank you, Mr. Chairman, to the chairman presenting the bill.\nJust a point of clarification in line 767, it talks about the legislative branch, any\nmembers, officers, et cetera.\nAnd then when you go to the line 7679 and later it just says the legislative branch.\nSo does that mean that anyone that's a member of the\nlegislative branch this applies to, or does it apply to like an official committee or\nthe House itself, explains me for clarification, what are we saying now?\nIf I can try and answer the lady's question, again this is the open records act.\nSo this is an act that provides generally that you have access to public records.\nThere are a number of exceptions to that, and we're adding three exceptions.\nThere is already, at least understand, a legislative privilege that applies to communications\nand some written communications as well.\nBut the Open Records Act is not a plot of the legislature.\nIt has not, since it was enacted, the Court of Appeals has said it on the plot of the legislature.\nBut it would a plot of executive branch agencies.\nSo this is just adding as another exemption communications they have with legislative\nbranch or members, et cetera, there are.\nSo again, we're talking about a request for production of documents relating to these\nmatters.\nThese things would be exempt from disclosure under the Open Records Act.\nIt doesn't necessarily mean you can't get it in litigation.\nThat's a different matter.\nSo I have to understand then that where it says legislative branch in several of these\nplaces that includes members as well as official committees and what I want to.\nBut you're not you couldn't make an open records act request to the lady as a member of\nthe legislature.\nIt would be made to an executive branch or executive agency and this would be an exception\nto the things they would be required to produce in response to.\nOne other thing Mr. Chairman and this is not exactly a question but I'm a little bit concerned\nthat nobody knows where this came from.\nAnd what is the urgency that brings us here\non the 39th day at this hour?\nAnd I suppose I don't know.\nI think it was just felt it would be good to put this\nin law while we had an opportunity to do so to clarify\nand to further sort of clean up some issues\nthat have arisen, you know,\nThe bill was initially because we had a court case\nthat I think interpreted requests made to vendors\nwho contract with local governments.\nAnd the understanding has always been,\nyou had to make the request to the local government\nand the local government has to track down the vendor\nand get the documents if they're responsible.\nThat's responsible.\nThe Court of Appeals read it differently.\nSo we were trying initially in the bill to clean that up.\nWell, there've also been some Court of Appeals cases\nand that the legislature is not subject to open records\nand open meetings, so we were cleaning that up,\nand then we were just adding these legislative privileges\nin here as well.\nSo it was not viewed really as being a substantive change,\nbut just as confirming what I think\nis already a reasonable extension of existing law.\nMr. Chairman, I'm not sure who this question\nwill be direct to, but isn't it true that some years ago\nThere was open records issues around, back in the day when we had toll booths about the tags being able to be when people went in and out of that under open records.\nThey were at one time subject of the operators and isn't true.\nThe reason we took that away was because it was a security risk.\nPeople knew when people were in their home or not and to that, isn't it true that 55 if this data were open, they would know if somebody were going to do something, you know,\nand Ellen tended to a member of this legislature,\na member of our staff.\nThey would know the goings in the Cummings\nand when they were in and out of the building\nand it's a safety issue\nbecause these are public records,\na private company would never do that.\nIsn't that what we're trying to get here?\nI mean, that's my understanding of 55 anyway.\nThat's what that night point is.\nIs it secure?\nChairman, if I may,\nas further clarification with what Chairman Lebritt said,\nand I think to the point of what Chairman Martin\nI was asking there in some of the notes that the Speaker's Office had provided me on\nthis exception 55 for security purposes, such that no one could access data to track\nan individual's movements within a state building.\nSo yes, it is probably, exception 55 is primarily for security purposes for each of you.\nOkay, I have one last question, Mr. Milton.\nThank you, Mr. Chairman.\nThank you for the second bite of the apple.\nJust something occurred to me.\nI guess I missed it when Chairman Leveritt indicated\nthat this is really more so designed\nto protect communications between the General Assembly\nand the executive branch.\nAnd I'm wondering, I know that this session,\nthere has been what I understand\nto be a whole lot of communication\nbetween the executive branch\nand the legislative branch about a certain priority.\nAnd I'm wondering if this isn't,\nif this is being done at this time in an attempt\nto shield the level of communication,\npressure, exertion, all the other things\nthat we've all talked about on the floor,\nis that what this is designed to cover?\nNo, no, this has nothing to do\nwith any legislative initiatives that have been launched.\nthis year. It's just, this was simply viewed as an opportunity to, again, make some clean\nup that was, you know, was desired and was not viewed as being that great a substantive\nchange. No grant conspiracy here. Okay. And the further that, it is my understanding\nthat it is very rare that we have bills related to section 50-18 in this code section.\nSo as the chairman alluded to, most of these additions to the original bill were done to\naddress issues that have come up over the last few years in communications and dealings\nthrough the courts on other issues as well as concerns for the prosecuting attorney's\ncounsel and what we've seen out of the court for appeals.\nOkay.\nWe've heard the explanation and the questions on this.\nOn Senate bill 12, by substitute, is there a motion to do pass?\nMotion do pass have a motion and a second to do pass is in opposition is\nobjection all those in favor say aye all those opposed no\nIt passes\nOkay, thank you\nNext Senate bill 20 by substitute chairman martin\nThanks chairman parish\nLadies and gentlemen, this Senate bill 20 is in five parts\nThe first portion of the bill parts one through three\nWe're originally passed by this body this rules committee in this house earlier this year as house bill\n56\nThose are as pass those parts one through\nThree of the bill part four of the bill is the original\nSenate bill 20 which passed out of\nHouse higher ed and in part five is just the implementation\nSo we have two pieces of legislation that have been vetted in the House Higher Ed Committee.\nOne of those past what is in House Bill 56 to or what was in House Bill 56 to help everyone's memory\nwas to extend to fallen public safety officers, spouses, an opportunity for education.\nAnd part three of the bill is to make that same extension\nfor public school teachers, public school professionals\nthat are killed in a lot of duty.\nAnd unfortunately, we had our first and I hope only\nto this fall, but that's what parts two and three\nof the bill, part one of the bill allows checkoffs.\nAt the time you're getting your drivers license\nif you want to help fund these scholarships.\nThat's what the bill does, Mr. Chairman.\nOkay, any questions, Kevin Martin?\nDon't see any questions.\nYou'll hear a motion of substitute\nto Senate Bill 22 pass.\nI have a motion and a second is any opposition?\nOkay, it passes.\nOkay, now let's set a third supplemental calendar\nfor today.\nSenate Bill 12 by substitute,\nLC 47, 37, 21, Fs.\nhave a motion in a second is our position okay all those in favor of putting it\non say aye all those opposed no it's on Senate bill 20 rule substitute LC 61\nzero two six six yes is there a motion have a motion in a second in your\nposition. It's on Senate Bill 36. I have a motion and a second in the\nopposition. There's objection. All those in favor say aye. I'll suppose no.\nI'll save it.\nHe's going to pick that up and bring it back just a minute, okay?\nOkay, while we're weighing on that, Senate Bill 46 have a motion and a second in the\nposition. It's on. And Senate bill 255. Moving second in any opposition. There is an objection.\nOkay. All those in favor of Senate bill 255 going on say aye. Any opposed?\nNo. No. No. I just have it. Okay. Just sit tight for just a minute. Okay.\nYou\nYou\nYou\nYou\nOkay, everyone have a copy of the proposed amendment AM 44-0228.\nWe can have a copy of the proposed amendment, AM 44-0228, okay.\nRepresentative Evans, you want to explain your amendment, please.\nYes, thank you, Mr. Chairman.\nLadies and gentlemen, the committee, this is a proposed amendment to send a bill 36.\nIt simply adds to the end of line 67 of the bill.\nIt already says benefits or exemptions, so it would just replace line 67 with the following.\nSo it would say nothing in this chapter shall be construed to allow discrimination and violation\nof a federal or state civil rights law or a local civil rights ordinance or resolution.\nThe author of the bill has indicated both in judiciary committee and in the press that\nhe does not intend Senate Bill 68 to be a tool for discrimination.\nSo this just simply clarifies that that is true.\nIt is language that you will find in other state laws around the same subject matter also\nin conservative states such as Texas have language similar to this and it just ensures\nthat while we place value on religious freedom, we also want to make sure that no one in our\nstate will be discriminated against and this just allows that balancing that I think all\nof us would like to have due unto others as we would have those due unto us and again,\nI'm not asking for this to be the rules to substitute this in.\nI'm asking for us to utilize the procedure that is provided for in House Rule 33.2 that says a modified structured rule bill which this is can have an amendment approved by the rules committee to have placed on the floor.\nAnd then whether myself or some other member attempts to move that is something that happens on the house floor.\nI'm simply asking that this committee allow this amendment to be placed on the House desk for having the ability to be potentially moved in the House. That's all I'm asking.\nOkay. You've heard the proposed amendment and you've heard the motion that it be placed that rules pass it out and place it on the floor. Is there a second to this motion? There is a second. Okay. All those in favor of moving this to the floor will say aye.\nAll those opposed will say no no okay all those who want to send this forward raise your hand\nOkay, all those opposed\nMotion fails\nExcuse me, symbol 36 is part of the supplemental calendar.\nWe had a motion, do pass, or be added to the calendar, is any opposition, objection,\nall those in favor of adding this to the calendar, say aye, all those opposed, no, it's\nadded on.\nOkay.\nThat's it.\nThank you.\nThank you for your patience.\nYou\n",
  "updated_at": "2026-02-12T17:14:40.290941+00:00"
}