{
  "video_id": "okb3LkUwX2M",
  "url": "https://www.youtube.com/watch?v=okb3LkUwX2M",
  "title": "Lawmakers Exclusive Interview with Georgia Chamber President, Chris Clark",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers Exclusive Interview with Georgia Chamber President, Chris Clark:\n\n## Overview\nThis interview discusses the recent passage of tort reform legislation in Georgia, the ongoing efforts to address insurance reform, and the Georgia Chamber's strategic plan for the state's economy through 2050. Key topics include the impact of the tort reform bill, the need to attract more insurers to the Georgia market, and the Georgia Chamber's long-term vision for the state's workforce and infrastructure.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this discussion.\n\n## Notable Moments\n- The interview highlights the 20-year history of tort reform efforts in Georgia, noting that the initial reforms were often overturned by the courts.\n- Georgia Chamber President Chris Clark emphasized the importance of involving \"hardworking Georgians\" and the \"grassroots\" in the tort reform push, not just business executives.\n- Clark expressed confidence that the state will be more vigilant in defending the recent tort reform legislation against legal challenges, unlike previous efforts.\n- The discussion touched on the Chamber's hope that insurance reform and increased competition will help stabilize insurance rates in Georgia.\n\n## Votes\nNo specific votes were mentioned.\n\n## Attendance\nNo quorum or attendance details were provided.\n\n## Adjournment\nNo adjournment details were given.",
  "transcript": "We're very excited and appreciative of the Governor, the Speaker of Lieutenant Governor\nof Passing, really the first piece of tort reform or lawsuit abuse reform.\nAnd it put in perspective with me the other day when I realized it was 20 years ago this\nyear that the Georgia Chamber worked with Governor Perdue to pass the first round of tort\nreform in Georgia.\nAnd it's been 20 years of work every day with our members and with the General Assembly.\nAnd so, you know, our hope here is that we see a reduction in some of the frivolous lawsuits\nthat we see some insurers return to Georgia that have left, that we see some stabilization\nof rates, and it may be most importantly, we can actually see some of our rural hospitals\nimprove their ability to attract doctors, particularly OB-GYNs, into some of the parts\nof the state that really just haven't been able to keep those physicians in place.\nAnd so big bill, 69 is still out there, some other bills that are still in that space,\nbut the governor's Senate Bill 68 was a huge win, a huge step.\nLet's talk about 20 years.\nWhat happened in that space, that tour reform space, over 20 years?\nSo what happened primarily was in those first five or six years after that, the court system\noverturned a lot of those findings that the General Assembly passed.\nAnd the General Assembly, for whatever reason, we didn't come back and fix them when the\ncourts pointed out that there were flaws and out there.\nAnd so between that, and then a lot of new calls of actions being passed at the same time,\nthe business community suffered through that, we made our points, but it wasn't until\nabout three years ago that we decided that we really needed to engage differently.\nThe governor was very engaged, he wanted to, you know, he's traveled the state this year\nto listening to businesses and doctors and everyone\nto really hear what those issues were\nand then he came out with his two bills in January.\nAnd you had some heavy hitters, you had Waffle House,\nyou had Uber, you had those big executives involved.\nYou had those executives, but I think what was more important\nis if you look at that first press conference\nthe governor held and you look behind him.\nI look behind him, I didn't see all the CEOs up there.\nWhen I saw, we're hardworking Georgians\nin their home depot aprons, in their waffle house aprons,\nin their hard hats, in their lab coats.\nThey said, this matters to me and my family,\nand I wanna be here.\nAnd we heard, I mean, every community that I toured\nin the last three months, we heard from small business\nowners with their stories, just,\nwe heard from doctors saying they were shutting down\ntheir practices because their physicians\nwere moving to North Carolina.\nI mean, we heard those horror stores everywhere we went.\nSo this wasn't just about the grass tops.\nThis was the grass roots.\nEvery day, hardworking George and saying,\nand we need to see a change.\nDo you worry about lawsuits like you had 20 years ago?\nOf course, and I think what we'll do this time\nis we'll go in and we'll battle those out\nand we'll try to preserve what Governor Kemp said\nwas important, what our members say is important.\nAnd we'll be much more vigilant\nthan our predecessors were 20 years ago.\nLet's talk a little about insurance reform.\nSo that is something that people are saying\nthat's next year.\nWhat are your feelings about that?\nSo I think we have to, first of all,\nwe need to make sure that these changes\nthat go into 68 and 69 have chance to work.\nWhat we've saw in Texas, what we saw in Florida\nis that those rates did come down.\nIn Texas, they saw Med Mall rates go down 54%.\nTook two years, but they saw them go in.\nSo, listen, last year, I consider what the governor\npassed last year was insurance form when insurers\nhad to provide all that data to John King.\nWe trust Commissioner King with what recommendations\nhe might come back with as he looks at that data.\nAnd so we'll be part of those discussions,\nbut I think we've gotta let,\nI think we'll see more insurers come back to the market\nbecause of what we've passed this year.\nAnd the more competition in that market,\nthe lower the rates are gonna be.\nIf you only got two or three companies\nthat are riding, you know,\ntrucking, underriding for trucking companies,\nthey're gonna set their own price.\nIf you got 20 coming in,\nit's a much more competitive market.\nAnd so that's what our hope is\nthat we'll see some immediately stabilization\nand then we'll work with the commissioner\nand others next year.\nSo you'll see some companies\nwho want to come into Georgia,\nStay in Georgia because they think insurance will stabilize at least if if nothing is right it hopefully\nThey don't we don't see the frivolous lawsuits\nWe don't see the nuclear verdicts at the same level. We've closed some of those loopholes and our hope is the insurance\nWe've talked to so we want to be in Georgia. We want to underwrite in Georgia\nJust not a feasible for us right now. Okay. Let's change gears a little bit and talk about your strategic plan Georgia\n2050 what is that so in January after almost two years of traveling the state listening to\nour members listening to legislators, elected leaders at the local level. We\nunveiled Georgia 2050. And it's a it's a bold 25-year outlook for the state's\neconomy. So it's more than just our strategic plan. It's really a strategy for\nthe state's economy. And what we heard from business leaders that we weren't\njust thinking four or five years out that they were making investments for\n20, 25 years. And you think about it this way. We were at Hyundai's Meta Plant\nGrand Opening announcement last week with the governor. They were very clear.\nThis is not a short-term investment.\nWe're going to be here for the next 100 years.\nTo fix the interstate going into Savannah is a 20-year project\nto build two new nuclear reactors is a 20-year project.\nTo deepen the port of Savannah is almost a 20-year project.\nAnd so we felt it was important to look long-term.\nSo this plan looks at the data, how Georgia's growing,\nwhere it's growing, what the business is going to look like,\nwhat the disruptions are going to be.\nAnd Donnet focused on five kind of core pillars, as we call them.\nmaking sure we've got the right workforce and talent in place, making sure those young men and\nwomen can AI proof their careers is what our big concern is. Number two to make sure that we've\ngot the energy production in place and the infrastructure investments that we need,\nto make sure that we're focused on growing the next generation of innovators and entrepreneurs\nin the state, that we remain a competitive and vibrant location for economic development,\nand at the end of the day that we have regional prosperity and healthy community,\nSo that every community in Georgia has the chance to grow and we've got the right health care supported systems in place to help them do that.\nAnd so every policy, every event, every program, every bill at the Capitol that we work on falls under one of those five pillars.\nFirst of all, let's talk about where are we now if we don't make some changes.\nI think there are two things we need to look at.\nNumber one is we have to get men and women that are disconnected from the workforce today back in.\nIf everybody that wanted to work could find a job and have the skills, we'd be at full employment.\nemployment. That's what we have bills like Senate Bill 207 on Occupational\nLicensure Reform coming from Senator Strickland to make it easier for men and\nwomen that have been incarcerated to get the license they need to go into the\nworkforce. And so that's part of what we got to work on. The other part is\nlooking at Generation Alpha, which are our elementary, our middle school kids\nright now, to make sure they've got the skillsets they need to be\nhorrible 20 years from now when they get out of college. And that they've got\nThe right skills in place is AI disrupts their first choice career and their second choice\ncareer.\nSo there's a lot of work that's got to go on in that space.\nWe have a couple of bills that the governor supported this year, best place for talent\nbeing one of those.\nAnd so we've got to have those types of policies, but I also think we've got to be much bolder.\nThe fact that my son's a freshman at UGA right now, go dogs.\nHe graduated with much the same class schedule that I had 30 something years ago.\nAnd that's not going to work in a system where kids need more real-world experience, more\ntechnology experience, more humanities.\nWe're going to have to really rethink K-12, I think, in the long term.\nWhat were the bills that dealt with AI that you were looking at this session?\nSo I think there's a lot of concerns.\nWe didn't have any specific bills, there are lots of bills that kind of floated out there\non data privacy and artificial intelligence, and I think our concern has been, and it\nwill continue to be.\ncompanies online transcend states, they transcend countries. And if every state has its own\nartificial intelligence bill and its own data privacy bill, all of a sudden your company,\nmy company, everyone else, we've got 50 different states that we've got to watch their\nlaws for. And so we think that's a national solution that tells us what the parameters are\nfor ethical AI and for ethical data privacy and that we're punishing the bad actors and\nnot the main street mom and pop companies that get hacked even though they did everything\nthey were supposed to do.\nAnd so that's been a lot of our education at the Capitol this year is helping legislators\nunderstand this is a very big issue, it's a national issue and let's make sure that\nif we do pass bills, they look like a bill that North Carolina passed or Alabama passed\nso that we're all on the same page.\nWell, almost a sunny day, what are you looking for in the next few days?\nSo we still need to pass a couple of bills in tort reform like the governor of Senate\nbill 69 needs to move out of the Senate or the out of the House. That deals with third\nparty and foreign litigation to make sure that people aren't abusing our legal system\nfrom Russia or from China or from London for that matter. And then we've got a couple\nof more bills on tax that we want to get out, but I think those will all move easily.\nAnd quite frankly, this part of the year you play a little bit of defense to make sure\nthat something that has unintended consequences doesn't undermine what you've been working\nI've got to ask some of the cutbacks at the federal level, especially grants, are already\nhitting some of the business community in Georgia.\nSo what are you hearing from your members and what are you saying to them?\nSo a lot of our members are worried about what the impact of tariffs are going to be.\nThey're worried about cuts, particularly in research and development.\nWe have a lot of research universities in Georgia.\nWe've spent out a lot of companies from those.\nSo we're now part of a national coalition that's looking at how you fund science, research\nand development to make sure that we're telling the right story and we're getting those\ndollars that are available back into our universities and into our state.\nYou know, I've heard from the president of Morehouse and Emory about the potential impacts\nthere.\nSo we're just trying to be a good advocate, make sure that our members of Congress understand\nwhere those dollars go, the impact that they have, and the fact that they're spinning\noff companies every single day in Georgia.\nand that's the great work of the Georgia Research Alliance.\nSo we're trying to advocate and be a good partner there.\nAnd then obviously on tariffs, we're just trying to work\nwith our partners all over the country, all over the world\nand make sure that Georgia businesses know what they need to do\nin order to be compliant and to mitigate\nor to lessen the impact of any of those tariffs\nand continue to talk to our friends in Washington every day\nabout the potential impact.\n",
  "updated_at": "2026-02-12T12:12:42.987461+00:00"
}