{
  "video_id": "oKMue-vyYGs",
  "url": "https://www.youtube.com/watch?v=oKMue-vyYGs",
  "title": "Sen. James Press Conference on Eric ID & Autism | 1/28/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 26,
  "summary": "Overview:\n- This press conference focused on two key legislative initiatives in Georgia: the Darren Lewis Saving Lives Act and Eric's ID Law, both aimed at improving public safety and protecting vulnerable populations.\n\nKey Actions:\n- None detected. This was a press conference to discuss proposed legislation, not an official legislative session.\n\nBills Introduced (First Reading):\n- **SB 419**: Eric's ID Law, modeled after a similar law in Maryland, to allow individuals with non-apparent disabilities to have an indicator on their driver's license or state ID to help inform law enforcement during interactions.\n- **HB 1011**: The Darren Lewis Saving Lives Act, proposed in response to the tragic death of Darren Lewis during a high-speed police chase in Savannah, Georgia.\n\nNotable Moments:\n- Emotional testimony from Kathy Lewis, the widow of Darren Lewis, about the loss of her husband.\n- Remarks from Senator Donzella James about the prevalence of autism and the need to protect individuals with non-apparent disabilities, including her own grandson.\n- Introduction of Eric, a young man with high-functioning autism, who will speak about his experience and the inspiration behind \"Eric's ID Law.\"\n\nVotes:\n- No votes were taken, as this was a press conference, not an official legislative session.\n\nAttendance:\n- No specific quorum or attendance details provided.\n\nAdjournment:\n- The press conference concluded, but no information on the next legislative session date was provided.",
  "transcript": "Thank you all for taking the opportunity to come today.\nI'm Representative Carl Giljar from District 162.\nAnd today we arise in the capital to the people's house to talk about saving lives.\nLast year the Georgia General Assembly stood together in the House of Representatives to pass House Bill 465 unanimously.\nHouse Bill 465 is the Autism Alert Act, which is a bill that focuses on saving lives modeled at the Maddie's Law.\nThat bill currently is in the Georgia State Senate.\nToday we stand unified to focus on saving lives with three bills.\nmyself, Senator Donzella James, Representative Eric Bell, members of the Georgia General\nAssembly, family members of the late Darren Lewis, those that would stand in the\nfields of autism and disabilities and invisible disabilities such as Eric's ID\nlaw. We're standing united. In March of 2025, Mr. Darren Lewis, a resident of Savannah, Georgia,\nChatham County, was just during the regular duties of a father, a husband, a grandfather,\nan uncle, and a son of the city. There was a high-speed chase, unfortunately, in our city,\na residential district in a residential neighborhood. And why we do understand that the mission\nof law enforcement is to get the quote unquote bad guy. At a point at some point in time,\nI've always learned that things are not working in the manner we go back and we get into\na huddle and we cease and assist the play. And so there has to be some guidelines for\nresidential chases from law enforcement.\nMr. Darren Lewis lost his life.\nDarren Lewis is one of those across the state\nthat have lost their life from alumni\nfrom Morse Brown University to law enforcement,\nto individuals all across the state of Georgia\nthat are civilian and law enforcement.\nSo that's why we have initiated a call to action\nand to save lives with the Darren Lewis saving lives at House Bill 1011.\nAnd so today we have the wife of Mr. Darren Lewis, a delegation from across the state,\nstudents from Savannah State University and others that are standing with us today.\nand we're gonna present Ms. Kathy Lewis\nfrom the Darren Lewis Foundation.\nThank you, Representative Giljard.\nLet me introduce myself.\nI am the wife of the late Darren Lewis,\nwho was tragically killed on March the 18th, 2025.\nMy husband was simply leaving his house, going to a dentist appointment, and there was\na high-speed chase in my neighborhood.\nWhen he left his house two minutes ago, he was gone.\nIt was tragic.\nMy husband was a great man.\nHe was a man with integrity.\nHe was a man that every woman dreamed of.\nAnd I thank God for allowing me to experience that fairy tale marriage.\nI thank Representative Carl Gail Yard.\nI thank all my supporters behind me.\nAnd we're here on the saving lives day.\nI've lost my husband, but we can save other lives.\nWe can save your mother, your father, your sister,\nyour brother, your auntie.\nWhat does Darren Lewis save a lives egg?\nSo I ask for all you guys support on this bill,\nbill 101, Darren Lewis save a lives egg.\nThank you.\nSo it takes courage for Miss Lewis and other sustain with us on the day.\nIt hasn't even been a year.\nMany of you have families that are autistic.\nI come from a family of ten.\nI'm the knee baby, but my younger brother is Down syndrome and autistic.\nWe understand the struggle of autistic families.\nSo, on today, I'm joined with my leader, the great senator and chairwoman of Urban Affairs,\nSenator Danzela James, who has a very special announcement and very special guest about\nEric's ID law, Senator James.\nI want to thank you all for being here for saving lives day at the State Capitol.\nWe need to save lives not just today but every day.\nAnd I want to begin by thanking Representative Gillia,\nand you can give him a hand because he's been out front\non so many issues that save lives.\nThank you.\nAlso, when we talk about saving lives,\nwe often think about emergencies after they happen.\nBut real public service also means preventing harm\nbefore any situation may happen.\nI thought I talked loud enough that I wouldn't even\nleave this.\nBut as I was saying, we have really\nworked hard to look at so many safety laws.\nAnd as representative Gilear was saying,\nAutism is something that is almost like an epidemic\nin our school system now.\nEven my second born grandchild, who is now 15 years old,\nBryce James is autistic.\nHe might be on the high spectrum\nbecause he makes A's and can speak.\nBut at seven years old, he couldn't even talk.\nHe was nonverbal.\nSo now we're beginning to screen our kids sooner,\nand we're finding out that we have so many of our babies\nwho are growing up with autism.\nI'm very proud of a young man that is standing with us\nbecause he was also on the high spectrum,\nand he has now gotten his driver's license,\nand he was one who was very, very interested\nin not only himself, but his friends who also had disabilities,\nor some kind of mental health condition.\nSo in moments of stress, though, he knew\nthat many of these young people may do something\nthat a police might misunderstand.\nWe want to train our police, but we\nwant them to know that we have a lot of some people\ncall them invisible disabilities,\nbecause you can't just look at them and tell.\nBut if they had a driver's license,\nlike Eric, who's gonna talk in a little bit,\nyou'll find that if you have some kind of mark on there\nand in his case in Maryland, they put a butterfly\nand everybody who has any condition like autism,\nthe police would be able to see it immediately\nand it would prevent so many problems.\nMy grandson, I told you, is 15 and now, he's six, two.\nHe's a tall, big guy.\nHe could be mistaken as a man.\nAnd if he was in the car with people\nand the police stopped him,\nthey always pulled these little kids out of the car.\nThey throw them on the ground sometime.\nHe wouldn't be able to take that.\nHe would probably be frail in his arms\nor just confused about what was going on.\nAnd some of the kids start running\nand we have had people who had artism to get shot\nand even kill in here in Georgia\nwithin the past few years.\nSo I have introduced Senate Bill 419,\nit bill 419 known as Eric's ID law and it is mimicked after Eric Carpenter\nGranham's bill that passed in Maryland. He's here and he's going to talk to us\nabout an epiphany that he had after George Floyd was killed. Then Eric was\nhigh functioning autism and he worried that the police may not recognize his\ndisability. All the ones of his friends like if at a traffic stop they might\npool all of them out. They might hurt someone and I definitely know that I don't\nwant them to hurt my grandson because they he didn't know what's going on. So\nSo Eric's ID is a simple tool that helps bridge the gap between individuals with non-apparent\ndisabilities and the people who support them.\nUnder this legislation, a person can choose to have a small butterfly placed on their\ndriver's license or on their state ID, indicating that they have a non-apparent disability.\nThis is well needed, it will help not just personally me and my grandson or representative\nGillian's brother, but it will help all these young people who have other disabilities\nas well.\nSo the bill requires annual training for Georgia Peace Officers starting in 2027 on how\nto interact, excuse me, with individuals\nwith non-appearant disabilities.\nThat training will include best practices\nfor communication, de-escalation and understanding\nthat notifying and notations mean what it means in real life.\nSo I will let at this time Erick's mother and Erick to come up\nand tell you about the Maryland law because it's passed already.\nSo we have some things here in Georgia\nthat may already, if you go down a long list,\nmaybe find some of these disabilities,\nbut they're not being enforced when lives are being lost\nor people with disabilities are being hurt by peace officers,\nby the police, then it's not working.\nSo we need to do something to let these people know\nthat these young people may have some disability.\nSo at this time, I'd like to introduce you to Eric.\nCan you come up?\nAnd I'm going to let you introduce your mother\nand just briefly tell us about your bill\nbecause Senate Bill 419 is just like your bill.\nAnd we hope it will pass just like your bill did.\nSo I will move for a minute.\nThank you.\nGood afternoon.\nI am Linda Carpenter-Grantham.\nI am the mother of where is he?\nThis amazing 21-year-old is my son, Eric Bless Carpenter-Grantham.\nAnd so I had a conversation with Eric once I realized that people with invisible disabilities,\nespecially autism, were being hurt harmed and killed by law enforcement.\nSo I had a conversation with Eric.\nI said, Eric, if you're ever stopped by law enforcement, put your hands up.\nDon't reach for your phone.\nThat could be very dangerous because he calls me for everything.\nA lot of have autism, yell out my number,\nand yell out someone called my mom.\nEric started to cry.\nHe said, mom, I could do that.\nBut the police might shoot my friends\nthat have autism and other disabilities\nbecause we're all different on the spectrum.\nSome of my friends have ADHD, they can't keep still.\nSome of them have sensory issues\nwhere they are sensitive to light and sound.\nHe said, mom, we gotta do something\nand we got to do something now.\nSo I said, Eric, let's think it through.\nHe came to me a little later.\nHe said, Mom, I would like to put something\non the Maryland State IDs where we live\nthat will let the police know\nthat me and my friends have an invisible disability.\nEric is also a person that loves God\nand he loves politics.\nHe said, Mom, can you take me to Congress?\nI would like to have a conversation with the House Speaker\nthat would create some laws for me and my friends\nto feel safe if we're ever stopped by the police.\nI said, Eric, I'm so proud of you.\nI'm going to do my best to get you there.\nSo we met with our Maryland State Center\nthat will see Smith, delegate Janelle Wilkins,\nwho's also the chairwoman of the Black Caucus,\nand delegate Kim Taylor.\nThey were able to get this law passed.\nIt didn't pass the first round,\nbecause we had opposition.\nAnd we had opposition from people who are not of color,\ntrying to stop this law.\nI don't teach my son to see color.\nI teach him what God's word says.\nLove thy name, but that means love everyone.\nSo, the delegates in the center\nwere able to finally get this bill passed this year.\nBut we were invited onto the view\nwould be Goldberg and we were invited on to the Sherry Shepherd show when we received\nover a million views and comments to make this a national law. We are happy to report\nthe Delaware, Pennsylvania, and New York have filed their bills for Eric's ID law.\nWe have people reaching out to us from other states to please help them get Eric's ID\nlaw because they're concerned for their children and loved ones that have autism,\nbipolar, whatever your invisible disability is. And if you're stopped by law\nenforcement and you cannot communicate, this butterfly will help you do that.\nAnd I'm going to let Eric talk to you about it. Thank you.\nGood afternoon. It's great to be here in the great state of Georgia. I would like\nto thank Finner, Dazzada James, and resident of Eric Bell\nfor inviting me and my mom.\nMy name is Eric Carpenter-Grantham.\nI'm 21 years old from Maryland, and I am highly\nfunctioning autistic, autistic.\nA conversation with my mother, driven by her concern\nfor my safety, that lead me to creating Eric's ID law.\nOh, here we go.\nMy mother felt, if I ever be stopped by law enforcement,\nI may not be able to respond at the man\nthat the police will suspect.\nGod had blessed me to create a special butterfly symbol\nto be placed on IDs for people like me and other\nto have available disabilities, like autism, mental health,\nhearing impaired, and all hidden disabilities.\nSo the police stop us, they will know that they will know\nthat this person have a hidden disability.\nThe butterfly symbol resident, hope, peace, freedom,\nand change.\nMy mother and I met with my Maryland State Center,\nwill see Smith who agreed to write the bill for Eric's ID law. Our sponsors for the bill for\nEric's ID law for the Maryland House of delegates were delegates and their Wilkins and delegate\nKim Taylor. We were blessed to receive over 48 extra delegates and 13 senators to co-sponsor\nEric's ID law, including our Maryland Senate president, Ms. the Bill Ferguson. Our Maryland state\ngovernor, Wes Moore signed the bill into law on May 13, 2025. They immediately became affected\non October 1st, 2025. As of today, 10,829 murders have gotten the\nbutterfly symbol on their state IDs in the state of Maryland. Since being the\nbuyer on the view, with Ms. Ruby Goldberg and the Sherry Shepherd show, where we\nhave received a 1 million views and comments to make this a national law. We are\nnow meeting with Congress and other states that make this a law so that all\npeople hitting disabilities are safe. Being an autism person, being a person with autism,\nI want the disability community to know that this law was created for you and me to feel safe\nand have a voice. I want to thank God for using me and my mom to do hit the buying assignment.\nThank you God for being with us through this journey. But the journey has not been easy,\nbut the journey has not finished yet. Because in Olympians 413, you say it, I can do all things\nwho christian triffits me. In closing my mom always told me I was created to stand out not to fit in.\nPlease support Eric's ID law as we move this mission forward nationally so that all people in\nvilla with disabilities are safe. Let's make Georgia the past Eric's ID law because it's time\nfor change. This is not a white law or a black law. This is a law for every single person who\nhave an invisible disability that be safe into the world because they don't have a voice like me.\nso I want to make this queer. I hear you, your lawmakers hear you, my mom can hear you,\nand everybody in this room can hear you. Who don't have a voice, who I can't speak for,\nand I'm speaking for others who look like me, who can't use their voice. Thank you all. God bless\nyou and God bless the great state of Georgia. And thank you to everyone who's here to support\nEric's ID law, Mr. King, my grandfather, and everybody else who's here to support Eric's\nID law.\nLet's get it passed.\nGood afternoon, everyone.\nCan we give this young man another round of applause?\nAnd also, can you give a round of applause for the Lewis family as well?\nThis takes courage for Georgia's up like these families to come here to make sure that\nevery Georgia is advocated for.\nMy name is Representative Eric Bell and I have the pleasure of carrying Eric's ID law\nin the House of Representatives for the State of Georgia.\nI want to thank Eric himself for having the courage to speak up for his friends and having\nthe foresight to know that others need help when they can't speak for themselves for\nhaving the courage.\nsomething. He said something and I hope all Georgians, all Americans in a time of\ncrisis have that same type of courage they are just displayed. Also like\nSt. Miss Grant him for raising a young man that can look outside of\nhimself and see that others are in need and see that if within him that he has\nbeen blessed to help others. So thank you both for being here for what you've\ndone and I would just like to say let's do the work let's get this passed in\nGeorgia. This is in a black bill. This is in a white bill. This is in a red green or blue bill.\nThis is a good bill that saves lives and reduces harms. Thank you all and I yield the podium.\nEverybody say saving lives. This is a great opportunity for Georgia.\nSenator Don Zeller-Jane's representative, Eric Bell to our good brother, Eric, to the\nLewis family, Ms. Kathy Lewis, to all that are in this together.\nWe pray that you will help us, the general public, to educate and lobby for these bills.\nTo go and talk to your senators and your state representatives so that we can get a hearing\non these bills.\nWe pray that you educate others about the importance of saving lives just recently in our good\ncity of Savannah, Georgia.\nWe lost another young man just the other day on River Street that was shot down that had\na mental health issue.\nWe all understand that we got family members.\nIf not ourselves, a lot of us are on the couch, but a lot of us have invisible disabilities.\nSo this is a saving life bill, saving life bills in the center of the house, and we\nask for your support in helping us.\nAt this time, we're going to entertain any questions you might have.\nI just want to let y'all know I'ma be brief this is a you've heard all like representative\ntell you over and over this is not a black this is not a white issue this is a right issue\nSo this is an opportunity for us to do the right thing.\nThis is an opportunity for us to change things.\nThis is an opportunity for put legislation in place\nthat protects all people.\nThat's what we care about, we care about everyone.\nSo I just want to let y'all know when the other,\nour counterparts was up here on this steps.\nThe whole surrounding section was quiet.\nThey were treated with respect.\nBut the whole time we couldn't even hear the mother what she was saying.\nWe couldn't even hear Eric what he was saying because everybody talking.\nSo why we can't get the same respect?\nSo, that's all I got to say.\nYou know, I just wanted to make sure that I speak\non the Darren Lewis field as well.\nWe've had incidents not just in Savannah,\nbut we can't bring our loved ones back.\nOne of my alumni, strong members at Mars Brown College,\nwent to pick her two grandchildren up\nas she did every other Sunday for church.\nAnd they got to, over near Morehouse College,\njust a little church there, they attended.\nAnd she was within a half a block\nwhen the police from Clayton County\nhave been chasing someone and Atlanta police\nwas joining them and they crashed into that car too\nand took the life of my good friend\nwho was a school teacher, she had gone on to get her PhD\nto get her PhD as she had her two little grandchildren\nwith all three of them were killed right there on that spot.\nSo you'll see another bill because I think\nwe're gonna try to merge it into your bill.\nAnd the bill is Senator Davenport's bill\nand we've been working on it for three years.\nSince we've been working on it,\nsometimes bills that don't pass still get enacted\nbecause some of the cities did pass a bill to stop the chases in neighborhoods and\nAtlanta was one of them.\nSo we need to work together and make sure that we make this a state law.\nAnd we will answer any questions, entertain any questions.\nThank you so much for coming out, thank everyone for attending.\nThank you.\n",
  "updated_at": "2026-02-12T01:36:15.713992+00:00"
}