{
  "video_id": "OLVPZKYvlnM",
  "url": "https://www.youtube.com/watch?v=OLVPZKYvlnM",
  "title": "3/16/23 - Committee on Judiciary",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 99,
  "summary": "Here is a structured markdown summary of the Georgia 3/16/23 - Committee on Judiciary session:\n\n**Overview**\nThis session focused on several bills related to the judicial process, including HB 126 which aimed to address issues around post-conviction litigation and withdrawal of guilty pleas.\n\n**Key Actions**\n**HB 126**: Proposed changes to the post-conviction litigation process, including providing more time for defendants to withdraw guilty pleas and a way to remove dead-docketed charges.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Discussion around the policy considerations of allowing judges discretion to issue temporary or permanent protective orders.\n- Explanation of the changes made in the committee substitute for HB 126, including providing more time for defendants to withdraw guilty pleas and addressing dead-docketed charges.\n\n**Votes**\n- HB 302 (Relating to protective orders): Passed unanimously.\n- HB 126 (Relating to post-conviction litigation): No recorded vote, but committee indicated support.\n\n**Attendance**\nQuorum was present, as indicated by the unanimous votes.\n\n**Adjournment**\nThe session adjourned, with no specific next session date provided.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nthat case is that it actually it's the opposite of the case. Yeah, it's the opposite. It's saying no, we don't have to do every executive every remedy before asking for junk to free. We don't have to come on to your property and try to replace your roof before we go get a court order. I've cut my grass before. But cut in your just so everyone knows cut in your grass. Some of those things are actually done by associations as self help versus incurring litigation expenses. We're more concerned with things that you can't get on and off the property while someone's at their day job and put people at risk. I got you. Okay. Thank you. Yeah, this is just a policy question. Do we want them to go the injunctive relief route instead of looking at the self help remedies? It's a policy question we have to answer with the bill. You have their questions from the committee. No one else I'd speak on the bill. What's the pleasure of the committee? Make a motion to do pass. Yes, chairman. We have motion to do pass by Senator Watson. Do we have a second? Second from Senator Hatchett any discussion? All those in favor of the motion do pass? Please raise your hand. Yes. Is she namus? Who's carrying the bill? I believe a certain Senate Judiciary Chair. Okay. All right. All right. That's all you have in our committee. You still have more. I still have more chairman. I look forward to seeing you again sometime. All right. Hopefully so. If not next year. Always right. Thank you. All right. We'll get back across the street. I think they're calling for you. Thank you. All right. Thank you. All right. We'll get back on the agenda. The House bill 302. Representative Franklin. Give us just a second. We are working off. That's passed in the House LC 480815. All right. Fullers yours. That's correct. Thank you. Mr. Chairman, members committee. So this bill amendments the code in Section 16-5-94 relating to protective orders and it gives the judge the discretion at the time of issuance to make that order a temporary or permanent at that time. There's actually two codes that are involved in this 16-5-90 and it already has that language super clear in that one. This bill just makes it super clear in 16-5-94. And the reason why this came about was there was the more I dug into it. There was a lot of victims that was coming up before these protective orders and they were getting a 12 months or a 3 months, 6 months, and they had to come back to face their accuser at a later date. And it was a it was a hardship for the court. It was hardship for the accused. It's a hardship for the victim in it. And this just makes it crystal clear for the judge that he sees the need that he added at his discretion. He could give that a and make an permanent order. All right so the existing code already says under the stalking TPO's that after hearing this is not the X part A order. I'm assuming that after the hearing a judge can issue several types of orders including a permanent or temporary order and you're just codifying that in the other part of that code where it actually talks about how the order what the order is going to be is that correct? That's correct. And it says permanent basis. Is there actually a time limit on permanent basis or is that really permanent? You know I'm not an attorney I don't know that's the first time I've had that question. I would assume that it'd be up to I mean permanent but I'm not sure. I think it's three years is that rising getting some nods. I think a permanent is actually three years. And the other question is does the bill again it's not really changing current law but if somebody believes that a permanent TPO should be amended and lifted they have the ability to go back in petition to have that permanent TPO removed? Yes sir from the vice office given by other attorneys that they could adjust can do that at any time and then if the victim so wants to reverse it to he or she just has to ask for it and it could be done. Your bill doesn't change any of that. No sir. Any questions in the committee? No one's signed up to speak on the bill what's the pleasure of the committee? Motion do pass from Senator Jones is there a second? Second from Senator Rat any discussion? All those in favor of the motion please raise your hand. Is unanimous and who is carrying the bill and the Senate? I believe it's Senator Ben Watson. All right Senator Watson. All right thank you representative. Thank you sir. All right chairman Smith your next on the agenda House bill 126 and on this one we do have a committee substitute we're working off of and so we are on LC480934S and I will give you the floor and of course let us know the changes in the substitute versus what passed in the House. Yes sir thank you Mr. Chairman members committee good morning good be with y'all so HB 126 which passed the House overwhelmingly this is going to fix our tangled up mass of post-conviction litigation process the crux of what was added additionally I'll start with the last section here part three it concerns withdrawal of a guilty plea and so you'll look at this process a lot of times a defendant whenever they play they'll be up against a very short deadline to withdraw that plea I mean very next day could be the end of that term of court in which they just submitted their plea so thanks for the Pro-Tams office and their staff for their staff attorneys for helping us with the fix to this we negotiated to where a defendant would have 30 days after the entry of that judgment or within the term of court so you would have until the end of that term of court whichever is later that way we provided those defendants with plenty of time in case you know for instance they were co-erced into the plea I've seen that too many times and I think that's a great addition the next section there this is going to actually make sure that and this is a excuse me Mr. Chairman this is going to be dealing with final judgments what you'll see a lot of times is that a defendant if they take a guilty plea and or verdict is reached that some charges will be dead documented this more so happens in police situations though so they'll plea guilty to certain charges and then they'll just dead dock at the other counts well those dead docket accounts they just stay there forever until Lord Jesus calls all home so this is going to provide a way for them to actually get rid of those charges section three here this is dealing with the filing for emotion for neutral and real quickly this is going to reinstate the meaningful access to request this post-conviction review from the court it provides a finite time frame still while keeping the consent of the state to this and making sure that they at least have their shot they do have habeas in addition to this but for some reason they had to exhaust habeas this would still provide them with a way to file a motion for neutral is an extraordinary situation very few cases are actually successful and even being granted this motion for a hearing much less having the motion granted so anyways Mr. Chairman in short that's the change to the bill and stand for any questions or any questions for Chairman Smith all right one person or two people sent to speak on the bill Jill Travis and Brandon Bullard with Georgia Association of Criminal Defense lawyers but they're in favor and they hear for any questions is that just for questions and just a little clarification section one of the bill is only for trials it's not for you section one the bill is only for trials and not for guilty police she says all right any questions for Miss Travis and Mr. Bullard all right thank you what is the pleasure of the committee we have motion to pass from four liter hatchet a second senator parent any discussion all those in favor of the motion to pass by committee substitute please say aye any opposed it is unanimous and who is carrying this in the okay is that me okay thank you Mr. Chairman I probably already said yes and don't remember it so yes I just feel we might trade one out happy to do it Mr. Chairman thank you thank you Mr. Mr. Chairman and by the way our committee is passing out Senate bills so just want to let you all know we're doing our part in duty non-soal all right you keep working now okay we'll keep doing the same thank you all right thank you next on the agenda hospital five forty three representative Reeves one of his ten bills that he passed out of the house this year you must be everybody's four liter over there we are working off of LC44227 8s that correct chairman Strickland I actually have LC 491335 yeah you're right I read the wrong one all right so LC 491335 this is as passed by the house right yes Mr. Chairman and members of the committee it's great to be back and Senate Judiciary Committee to present House Bill 543 this bill amends code section 15-12-1222 and one way currently the dollar threshold for a six-person jury in state court is 25,000 this raises it to 100,000 the statute has been around since 1800s I believe the dollar figures started coming in the 1970s it's moved from 5,000 to 10,000 back in 2002 it was raised to 25,000 the judicial council of Georgia they're represented today by Bob Rae and Tracy Mason they initiated this change it's been reviewed by the State Bar of Georgia's advisory committee on legislation I have with me today state court judge Al Wong who has worked on this from start to finish and can talk about some of the deliberations it was widely publicized to plaintiff attorneys defense attorneys we have a representative from state farm here today who's in support of the bill but just the mechanics of the current law if you have a suit for damages in state court and the Snot Superior Court it's just state court if you demand a jury trial and your claim is 25,000 dollars or less you were headed to a six-person jury trial if your claim is above 25,000 dollars you can demand a jury trial for 20 off with 12 jurors this bill would increase that to 100,000 the threshold and turn it over to the committee for questions unless Judge Wong would like to add about the process. Happy to answer any questions that you have. All right thank you Judge Wong any questions from the committee for the author or Judge Wong? Senator Calzot. Good to see you here. My understanding of the process was that you had kind of a committee that met over the summer spring and you reached out to number us to kind of get input and that that committee seemed to be okay with this. I don't believe that Georgia trial lawyers or Georgia defense lawyers have taken an official position on it as far as support although they were represented in your committee and had an opportunity for input. I'm not sure that's correct Senator. I met with painstakingly make sure the leadership of both organization were in our committee meetings. In fact it was GTLA GDLA and a boat of the border trial advocates which comprise a well plaintiff in defense lawyers on the defense side on the Georgia defense lawyers association. We had Ashley Eryce, Tracy Carmel, Dave Nelson, Sally Aiken, Dartmouth Mel, the president. All of them were in the loop of this. We met over the summer at least three to five times. You know I don't want to get into the sausage making but as you can imagine the negotiation that was back and forth. We did some very interesting survey with the mediation services. The keys is that settled between 50 to 100,000 and from 100 to 150,000 is two percent variance. It's a very small. So and the way we came to the threshold of the hundred was looking you know one side once more and one side once less and State Farm was totally supportive of the 100 and that was what was agreed upon. Give you a little legislative history of this bill and started in 1975 for superior courts. Any trials of 5,000 or less which try with the jury of six in 83 the Georgia Constitution was amended. In the Constitution article one section one paragraph 11 it is specifically stated all superior court trials have to be with jury of 12 except in misdemeanor cases and that there should be not less than six jurors in court so limited jurisdiction. State courts. So in 83 that knocked the superior court out of the game in 85 the statute was amended raising from 5,000 to 10,000 in 2002 it was raised to 25,000 and it's been at 25,000 since that time over 22 years. So we just need to make an adjustment to accommodate you know what is real life litigation out there because this is not just court cases this is commercial cases contract, dispossessory, hammer and nail cases look under the hood cases all of those kind of cases and where we have as you know coming out of COVID we've got a huge huge case little backlog and nobody goes trial and so these cases and let's just put on the calendar and if they know they don't have to go trial it won't go away so we need some help and this is I think one way one very reasonable way to resolve this you know another thing that Chief Justice talked about by the resources that we had at his state of the judiciary what he did not talk about him with I hope you understand the burden on the citizens I mean the ability to get jurors in the courthouse that's a huge challenge right now so we would really appreciate if you consider this I think this is a reasonable measure I know you're not particularly fond of it but we've vetted this we've talked to the judicial counsel Justice Peterson looked under the hood hard on this one and it passed there it passed the state bar have all the bar support and the carrier support so we would seriously ask you to consider passing this legislation I have a partner who's on the board of directors of Georgia defense lawyers and they had a board meeting this fall to consider this and could not reach consensus so they reached out to the membership through email asking for our input and still didn't get consensus support for this and since then I've been getting pounded with emails and questions particularly from the defense bar but also some plaintiffs lawyers saying they think this number was too high and they've raised a couple of other questions Mr. Chairman if I could ask just for input that they need a little clarification because at common law we all had a right to 12 person jury that was put in our constitution as you pointed out in 83 with the minimum exceptions of small claims they believe that it was raised to 25,000 in conjunction with the minimum insurance limits increasing so that a plaintiff would be incented to agree to a six person jury since that was all the money available anyway through insurance a defendant would be incented because it would protect them from an excess verdict you know so it made less of an impact on them to have less than 12 people under those circumstances but those limits haven't been raised and this is now quadrupling what this jurisdictional limit is so one question then is can a verdict be higher than this amount the way it reads is a claim for damages greater than you know in our complaints we may just put you know a nebulous amount for pain and suffering or you might have you might list your medical expenses or less than that but where in this does it prevent the verdict from being higher than the hundred thousand or is that by step you know we stipulate or agree in many of trials sure first of all great question if a verdict comes back for more than a hundred it's kept at a hundred the judges reduces it down to the stipulated amount if you can't it you can't get any more than that so does this statue cap it though or is that must it yes sir yes sir because if the defense or so this is the same question justice Peterson that says when in the legislative committee so what happens when defense wants a 12 person jury trial while the answer is no plaintiff is going to agree to camp damages so it has to be by agreement once there is an agreement verdict comes back more than a hundred judge the issues of remittor and there's judgment for the amount as agreed upon not a penny more senator cows that I would respond the pre trial order in addition to complaint that would be a time that the plaintiff makes clear what their claim is going to be a trial and if they go to trial and request more than their claim they're going to be in legal trouble subject to mistrial and then also as judge Wong pointed out if the plaintiff asked for a hundred thousand and the jury gives him two hundred fifty thousand that would be subject to post trial motions on point to get the verdict to conform to the claim judgment the pre trial orders are not required and there's an awful lot of courts outside of the metro area don't even have a pre trial conference unless it's on request you know that's a great point to send out there's only seventy two state courts we have a hundred and fifty nine counts so the bulk of these cases are only in what we're talking about in state courts so in the seventy two counties everything else in superior court is tried with the jury of twelve whether it's five hundred dollars or five hundred thousand dollars so it only affects a very small universe of state court cases and and for those who do not have pre trial orders or no pre trial conference just come in and try to case what there is not an agreement to camp it at a hundred so you'd be trying to it with jury of twelve anyways what I'm seeing is a great majority now of civil cases are being filed in state courts in the counties that they have them and so I think this is going to impact an awful lot of cases and that's why I'm troubled last question and I'll leave you alone is I've had one of the pushbacks I've had is that does this potentially reduce the racial diversity of the juries if you're selecting from a smaller group out of your jury veneier doesn't that create the possibility of less diversity or representation by minorities in a jury panel I don't think so sir because jury panels are selected based on you know multiple factors we now have very sophisticated jury post election system where diversity and race and gender and all of those factors are included so when you have a panel of twelve rather than a twenty four it's just proportion that to what's already in the pool so I know I don't think that would affect it at all it's not like we're going to pick six of this or six of that it's the whole pool it just proportionately reduced the question from senator hatchett thank you mr. man based on something that senator calzard said a second ago about the the limits being twenty five thousand and that perhaps coinciding with the minimum limits that we see on in car insurance policies right now is it time to raise the minimum limits for car insurance that's beyond my pay grade what do you do I guess in all seriousness was this number set to coincide with those limits I think there's some truth to that yes sir and so the reality of what's happening today you still have a batch of compliance with statutory minimum coverage of twenty five but most of the policy I see and I think the senator will agree that it's like in the thirties fifties and you know fifties hundred fifty slash one hundred so it's there's minimum policy of twenty five but we're also talking about a lot of these cases that we're dealing with are in the thirty fifty that range so I know for example taxi cabs still have to twenty five thousand minimum coverage so is it adequate I'm probably not for me to say and mr. man if I can I'm I'm just if if that twenty five thousand was set based on the minimum limits in the state for car insurance I mean going from twenty five to hundreds of big jump when the minimum limits are still at twenty five I guess do you think we should raise the limits to coincide with this six-person jury and if so is that something we could do in this bill I think that's a little bit put in the car before the horse or you know driving it the other way so what happens is I think the point we have to make is whether it's at twenty five or at a hundred the defense never has to agree number in that case it's a twelve-person jury trial period and and you know as a matter of reality no plane that will agree to cap at twenty five or a hundred and if they want to a person jury so so it's been twenty two years since we adjusted this number so I think it's it's really a needed process it will really help state court cases because you know if you try cases you put it on a calendar you know you got to have a jury of twelve before you go trial you'll never go off the dock okay thank you thank you and for the committee's sake the house members were heading back across the street they're about to vote on a bill and so the Matt representative Reeves had to go back across the street before we move on there any questions other questions for Judge Wong all right we have one of the first time to speak and we're going to have you Mr. Poff you want to come forward go and speak on this bill thank you chairman members of the committee I'm Bobby Potter and I'm here today on behalf of state farm I participated in a couple of zoom calls with with Judge Wong after the committee process it was a state farm lawyer engaged in his committee process I'm sure many of these questions that were asked were discussed during that process probably not the the question raised by Senator Hatchet but I'm here to voice support for that measure as presented at that number could be less I think state farm certainly resisted it being higher mostly in regard to judicial efficiency and not so much a tick for tack on one side of the other GTLA versus GDLA and I gather there may be some conflict within GDLA about how that works but I'm here to voice support for that the second thing I would say just because it was been raised Senator Hatchet obviously that is a much larger discussion about minimum limits availability affordability what drives that what drives the uninsured motorist out from availability so that's an entire huge discussion separate from how you resolve these cases are you questions from a committee from mr. Potter all right what we're gonna do is we're gonna hold on this bill until representative Reeves gets back over so if y'all are able to sit tight for a little bit we have we have until 12 to finish the committee but we have another bill we can move on that Senator Sessler is gonna present because it's a substitute and so we'll go down the agenda and let Senator Sessler if you want to come down thank you mr. Chairman yeah thank you judge it like I said if you can sit tight we'll come back on this bill so discuss and so we're gonna go to House Bill 204 which I said is a committee substitute that Senator Sessler we're working off of LC 47 to 445 S and Senator if you that lets you have the floor thank mr. Chairman's Committee bring before you to the House Bill 204 this bill that does two things and I've got with me the representative of the Municipal Court of Higher and Lowerment good morning my name is Jason James I'm the courted minister and chief clerk for the city of higher in Georgia Hp2 afford us two things it creates a council of municipal court clerks as we know there are in Georgia there are 389 active municipal courts you know some municipal courts are busy you know beehives of activity Atlanta Municipal Court is certainly that others actually meet is infrequently as every other month I know I've been in and around some of my work with small cities in Georgia the same person that's accepting payments for water bills is at 430 when they close down the city they start they're the clerk of the Municipal Court the duties are vast and they have the same obligations to that underlaw that large municipal courts have and the goal here is to create essentially a council\n\nSo that allows municipal courts to have professional training, standardization, and actually receive funds. It's again, it would be only subject to static preparations if there were any, doesn't require any, but really allows them to receive federal dollars for training. And again, we see we have standardization across the 389 municipal courts in our state. And again, the goals to professionalize the operations of courts and records across our very small communities. They can function in an increasingly professional way. That's the first component of the bill. Second component of the bill, Mr. Chairman's not new to the Senate. What it does is it clarifies in law two things. First, that it's only the led sletcher that has the power to apportion districts for county commissions. County commissions have some home repowers. They're all subject to accidental assembly. And never before if county commissions have been able to reapportion themselves. We do have a case that's pending right now. A county commission seeking to reapportion itself. This clarifies that only the general assembly has the power to apportion for county commissions. But it also adds in an amendment which I will refer to, which had this come to the floor on cross-served day. We just ran out of time. What I will refer to is the Setsler Tilleria amendment, which is section four of the bill, which clarifies that anybody who has any four year term, whether it's in a city council seat, county commission seat, any seat that's a four year term. If reapportionment happens during that term, they are not removed from their seat by virtue of their district lines changing. They can serve out that term in its completion. There is nothing in statute that clarifies that. And there's case law that sort of on both sides of that question in the state. So it clarifies once and for all that no one can be removed from their seat. I think that's a good clarity for us to provide in laws we do this. That the reapportionment process though folks can't control the lines that they should be able to serve out there for your terms. That's what section two of the bill does. Go ahead and take questions. All right. Going back to the first part of the bill's minor standing based on talking with the house sponsor. And Mr. Janies maybe you could clarify this that setting up this council will assist with training and also potentially assist with some grants as well. Is that part of the reason? Yes, absolutely. And currently I would just say that 36-3213 requires that only the chief clerk attends training. And so that's one of the big parts is as city government looks at budgets and decides training for the employees that we're wanting to make sure that everybody in the court has access to training. All right. You have a question from Senator Parent. Thank you so much. Questions actually on the other part that doesn't concern you. So I'm assuming this deals with and this bill hasn't been before this committee. This deals with redistricting litigation in Cobb County and Jericho Richardson's seat. And I'm assuming that's who you're referring to in this section four that should be permitted to finish her term. Let me answer that question with two parts. First part this is a statewide issue. We never before in Georgia that County commissions apportioned themselves to try to do that. So it provides clarity that can't be done moving forward. The only general assembly has the power to do that. Specifically the Cobb case that you're asking about. We had there was a County commissioner that very early in their term moved to a different part of their district. And the County has since asserted a home rule power that's never been contemplated in law before by any county to try to try to change the outcome there. What this would do would be to assure that home rule power couldn't be asserted in the future. And that any that any case that was ruled on subsequent to the past of this bill. Someone could not be removed from their seat. There's never been an intention from any member of our general assembly to have somebody move from their particular seat. It's just the consequence of a move. Contemporaneous with the reapportioning of lines had the effect that they're outside their district. So there's this would in essence if she were in her seat at the effective day of this bill would not be removable for receipt, which is fine with me. There's never been desired to do otherwise. I think it's it's fair to have folks serve out there for your terms. And as it stands today without this. They the county has asserted that if the plaintiffs appeal. Prevent on the merits, which I think by most accounts they will. The County has asserted she will absolutely be removed from receipt full stoppers. There's no way to prevent that. This would prevent that and provide clarity moving for that County's couldn't do this again. So. There is pending litigation. I think you just said. There's pending litigation on this this issue. There's been a litigation this issue and this would solve the question. Prospectively moving forward that no future claims of home rule could be exercised by county. That's correct. So this would this decide the pending litigation or would this only be an effect going forward on other issues. This in itself would not decide the pending litigation on the home rule claim. Because that's that that's that predates this. But with respect to the removal ruling, it would prevent anyone from being removed in a court ruling that happened after the date of signature this bill. So it does say online 38 where the General Assembly has enacted. So you're maintaining that this would not be retroactive at all. Yeah, you can't we can't retroactively apply this to a home rule claim by a county that happened on October 25th of 2022. So a home rule claim will still exist and still play out in the courts. This would prevent further assertions of that. But it would prevent the removal anybody from office if that removal was ordered subsequent to the passage of this bill. So you're saying that 102 would not therefore thereafter section four would not be retroactive because it has not that issue was not settled and that if this were to come into to law, then it could impact it since it's not settled. Whereas the home rule has already been asserted. With respect to the maps, the delegation passed. Yeah, it would not affect the home rule finding it would affect the removal of somebody from office because there in office now, as you know, case law is very clear in Georgia that any subsequent actions, if you were serving in office outside of the outside of the rules of your service. I'm sorry. If you're serving in office outside of the rules of your service, you know, your actions that day or night and validate are still valid actions. So that person until there was a finding that they were not validly in their seat that is. Well, I'm sorry. Are you talking about Commissioner Jericho Richardson? You keep saying they. I don't know your time out. In her case in particular. Okay, just trying to be clear. If it's later found that she's outside of her seat and was not. It was not valid in her seat. All the actions that that happened right now officially are still considered official action. That's the case. It was very clear about that. And because of that, she's validly in her seat. So if this is enacted, signed into law by the governor before some subsequent removal, she would mere move. This would be a safe haven for her in particular from not being removed from her seat as long as this is signed by the governor before. Before any court action that would remove her from her seat. So I do have a couple more questions about that if you're willing to entertain. So first of all, I take it that this was not properly thought through when the legislature took action last year because there must be issues with removing the commissioner from her seat in the middle of the term. Otherwise, why do we need to? I mean, or I don't know if there's a constitutional issue in terms of invalidating votes that were cast by by Cobb County voters. And that's part of why it took to be coming up and also in litigation. That to be clear, there is no. There is no stated homie, the Constitution tier one tier two powers of counties, tier two powers of counties of the constitutional powers, other statutory powers. There is it's very clear counties only have those powers that are specifically granted them by the general assembly. And it says specifically they have no powers to do anything related to the election of commissioners. So we believe it's going to be an open shut case in court that the county does not have a home role power. No, but that's not what I was asked. Okay, you want to find that's fine. That's that one. What else? Counties to nine powers to do not have home role powers to reportion themselves. That's going to be that's going to that's going to play out in court. The issue though is, and this is what's been very clear by the Cobb County attorney as they've argued on behalf of the commissioner that if the. If this is litigated in court, they've said unambiguously if they lose in court, the commissioner will be removed from office because the current. Framework under the Cobb County ordinance as you must live within your district the entire. Four years you're in office or your services void ab initio and you're thrown out of office. So they have said she has said herself. I if we lose the court case, I'm out of office. This provides a safe haven for not to be turned out of office. Well, I understand that, but my question is what. There is no. I'm taking your answer to my question to be you do not believe that there would be any kind of constitutional issue with the sort of voiding of the. The Cobb County voters that elected her the voiding essentially of that term because when the the voters of Cobb County elected her, they elected her to a four year term. So someone can make a conscious reclaim the only only case law that's that's even close to being on point is a mayor and Villa Rica. They they changed the city lines that they of the city. The mayor found themselves outside the city lines and was invalidated. Couldn't serve out their term because of being outside the city. It's the only thing that doesn't specifically apply to a county commissioner. So there's nothing directly on point. But there is a case in which someone's not being able to finish that therefore your terms because they failed the residential requirements. So I think that I think there's there's a high likelihood she would be turned out. Cobb County's attorneys have asserted she would be. She's assured that she would be. So they have essentially conceded the point that she'd be out of office if the court case goes forward. This provides a safe haven. So I did just one final one. So how will it work because the the delegation pass maps the general assembly overrode the local delegation? Well, I was there. I mean that fine. You may characterize it differently, but that's my memory of how it went down on the floor. To be clear, the delegation. Cobb County there's a there's a there's a partisan majority in the House delegation. There's not the Senate delegation. The Eric Allen has a eight six partisan majority in the House. For whatever purposes of the map was supported only by one party in the House in the Senate. There's a there's a three three split. Okay, that's sort of a factor. But to make the point, there was not a locally passed map. The only map that passed was a map that passed to the general process. I just want to clear about that. So the question is though, how will it work because these terms and my wrong would now be thrown off? So my question is, under the maps passed by the general assembly, what is the term of that seat and then what happens would there be a special election? Like if she did, if Commissioner Richardson did finish her term with that then throw off sort of like the normal order of events of electing commissioners and how will that work in terms of? Yet House bill 204 does not pass. And they lose the court case this summer. She'll be she'll be immediately or she'll be turned out of her seat. Special election will be called likely be depending on the timing. Could be contemporaneous with the municipal election this November. Special election will be called of all district two and Cobb County. And but there would be there would be a void in that seat until that special election were called. This seat seeks to remedy that. Thank you. Thank you. Thank you. Thank you. Senator Rat. I'm sorry. I think the man in chair answered my questions. I wanted to know if there was a court case. I think she. All right. Just to hear that. All right. Senator Hatchet, do you have a button push? Yes. Thank you, Mr. Chairman. And to the author, I know we had discussed this at a previous hearing I believe, but I know we're applying this to county governments and redistricting. Why are we not applying it to municipal governments as well and redistricting? Yeah. The part of the bill we apply to municipal governments is section four. The ability not to be turned out of office if you're in a four year term. And it is my understanding, municipal governments, that counties have been get that that cities have conventionally exercise home will power to reapportion themselves. The general assembly does not do so. The general assembly does so. Obviously that's going to trump with the cities do. It's my understanding that cities have her purposes of city districts convincing the past done that. So I didn't want to touch the city issue. I'm just trying to solve the county issue which has from time immemorial been that counties never had the power and have never attempted to apportion themselves. So I'm just trying to clarify that with us. I'm leaving the city issue untouched because I think it's a separate and distinct issue. No, it may be the desire of the general assembly to do that. I'm just not trying to invoke. I'm not trying to wait into that swamp. I'm leaving that alone. And if I can, Mr. Chairman, follow up. We pass the local law or I say, if we pass local law, drawing the districts a certain way in a city in your district. And then the city went back and exercised home rule and changed those districts. You're saying currently they can do that but you wouldn't want this bill to apply to them. Well, this bill doesn't apply to cities. I'm not asserting that cities can ever write the general assembly. It's been my understanding the cities can apportion themselves for city council districts unless the general assembly first acts, which I think they'd be prevented from doing that because this general assembly is spoken. I think the general assembly's silence, silence, it's my belief that cities can. But again, this bill was intentionally drawn intentionally in a way to not address the city issue at all because I don't want to create a new law. I'm just trying to clarify existing law. Okay. Thank you. Any other questions for the author? Or for the new author? Do you know your bill is this? I'm going to get this much talk. All right. Nobody else out to speak on the bill was a pleasure to committee. We have motion to pass by Senator Hatchet. I as a member of the committee will second that, Mr. All right. We have a second from Senator Hodges. Any discussion? All those in favor of the motion do pass by committee substitute. Please raise your hand. We have four. Oppose? We have one motion carries. I'm assuming you're carrying the bill in the Senate. I have this. All right. Thank you. All right. We will be at ease for hopefully only about five minutes. Let's see if we get our house members back. If you can stick around, this will make our Monday hearing a little bit shorter that there's any incentive for you. But we're going to have a hard stop at noon regardless. So if you're able to meet members, just stick around and just hold for just a minute. We can see if we can get our house members back. Thank you.\n\nyou you And for those that are setting up the next event, you're fine. We'll be out here about 12. Don't worry I know y'all gotta get set up. get set up. We are going to go back, we still have a court room, we have a court. We're going to go back, Representative Reeves. We completed the public testimony on your bill. We are back on House Bill 543. And so Mr. Potter spoke when you were out, Judge Wong spoke. Let me go back though now that you're back here. Any other questions for the author on House Bill 543? Is there anything you want to close with on this bill? Are you ready? Let me turn your mic on. There you go. Thank you for letting me go vote. Thank you for looking over this in detail. I had the opportunity to compare notes with Chairman Gunner when I was over there. He was skeptical that there would be an appreciable amount of jury trials at the $50,000 level at then there would be at 25. It hasn't been raised in over 20 years. There is a large case load in addition to the COVID backlog. In terms of diversity, I heard from several state court judges in Gwinnett that they like this idea. They think they could get more trials done with that diverse jury pool in Gwinnett. It would double the number of trials based on the same amount of jurors. And for those reasons, we would ask you to consider the work of the Judicial Council and State Board Advisory Committee on legislation as well as a number of state court judges have done. This will promote judicial economy and get a lot of cases moved at a time when it's needed. All right. At this point, what's the pleasure of the committee? We have a motion to pass by Senator Hatch's second by Senator Cowsard. Any discussion? Do we have any amendments? Let me turn your mic off. Representative Cowsard. I'd like to propose a amendment to change the $100,000 to $50,000 on line 21. All right. Senator Cowsard's proposing on line 21 changing the $100,000 figure to $50,000. Do we have a second for that amendment? A second from Senator Jones. Any discussion on that amendment? Does the author have anything you want to say on that amendment? There's been an awful lot of time and examination at $100,000. I'll let the Senate Judiciary Committee do your work and we'll get from there. All right. So we're going to start the vote on the amendment amendment. Everybody good? I understand what the amendment does? All those in favor of the amendment, please raise your hand. We have five opposed. We have one. So the amendment carries. So now any other amendments? All right. Now we're back to the airline motion due pass. Now as amended, all those in favor of the motion, please raise your hand. It is unanimous. I'm not understanding because you still don't have a conversation to confirm who's carried in this bill in the Senate. That's right. I'll be back and touched promptly. Okay. Thank you. Thanks a lot, Mr. Chair. I'm in committee. Appreciate it. I believe Representative Daniel is working on a bill on the floor. Okay. I did tell Representative Daniel that if she did not get back, if no one object in the committee, I could present. Senator Sessler is going to pass my teeth here. Is going to present and she has given us permission and less somebody objects and wants to hear from her. If so, speak up. Senator Sessler, House bill 298, even though as I've been confused for some reason this year when the S committee steps to, that's the House committee steps to, this is as passed by the House. LC 491364S. All right. The floor is yours. Thank you, Mr. Chairman. Nuss. That's bill 298 simply provides that if a parent, adoptive parent or natural adoptive parent has a child on the age of six months, that can be the basis of an excuse or deferral from jury duty. All right. Any questions for the new author of the bill? A question from Senator Hatchett. Like this bill at the appropriate time, I'd love to make a motion. Understand why you might like it. Are you going to continue to be a new parent of kids for a while? Discussion on the record here. Okay. That's probably more appropriate. All right. Are you a representative again? You presented two House bills today. That's right. It's like old times. Any other questions? No one's on it to speak on the bill. We have a motion to pass from Senator Hatchett. Do we have a second? Second from Senator Hodges. Any discussion? All those in favor? We have discussion. Senator Cowson. Just it's on the dressmanship almost. Right now you can still claim exemption from jury servicity appears if you have a child under six months and can avert that you don't have adequate child care. Why not just strike that out right there? Just strike out the part that says you don't need adequate child care? Is that essentially what we're doing, right? Was there? I just wonder if there's a reason. I'm in favor at times. That's right. Which essentially you're saying is it shouldn't have to demonstrate you don't have adequate child care and grandma can't watch the babies. If you're a parent under six months, child under six months, you have this almost by right. Okay. Right. Okay. Does Dylan, I just was asking out of curiosity if there was a reason on the dressmanship why you didn't just go that way. But I think there's that might be give rise to a friendly amendment. Let me. We stay. I don't want to say again. Senator, we stay. We said again. I said and part of this bill, let me find it. Put it back in my folder. You see where on fine 16 says provided further that any natural adopted parent under age of six. Who executes an affidavit saying they're in custody is excused right up above here. On lines 12 and 13, it already says that. I guess that's six years. It's six years and no child care. So right now, you have six years. If you can demonstrate, you have no child care. This is essentially six months period. Got it. Okay. That makes that's the difference. Thank you for that explanation. All right. We had a motion due pass and a second from the committee. All those in favor of the motion, please raise your hand. It is unanimous. She tell you who was carrying this. She did not tell me. I'm probably looking at the sponsor. I'm glad to carry my need to. Okay. We'll get we'll get with her to confirm then. Okay. Thank you. Or Senator Hatchett will figure it out. All right. Those I saw the business we have. Thank you, everybody, for being so flexible with us today. We will meet again on Monday. I'll have an agenda out. Hopefully tomorrow so you can see all the bills that will be out for Monday at our standard time, a four o'clock, or remember to let us come meet with that word, adjourned.",
  "updated_at": "2026-02-14T01:58:01.57713+00:00"
}