{
  "video_id": "OlymnZUpgY0",
  "url": "https://www.youtube.com/watch?v=OlymnZUpgY0",
  "title": "9-7-2023 Senator Colton Moore Press Conference",
  "chamber": null,
  "session_type": "press",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 40,
  "summary": "Here is a structured markdown summary of the Georgia 9-7-2023 Senator Colton Moore Press Conference:\n\n## Overview\nThis press conference by Senator Colton Moore focused on criticizing Fulton County District Attorney Fani Willis and calling for a special legislative session to investigate her. Senator Moore accused Willis of politicizing her office and misusing taxpayer funds, while also alleging a constitutional crisis due to a lack of checks and balances.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Senator Moore opened with a prayer led by \"Dr. King\".\n- Moore declared this was not about partisan politics, but about protecting children and freedoms.\n- Moore called for Governor Kemp to visit his district and ask constituents if they want their tax dollars going to DA Willis.\n- Moore criticized Willis for the issues at the Fulton County jail and the pace of high-profile criminal cases.\n- Moore accused fellow senators of being \"afraid to speak out\" due to fear of Willis.\n- Bruce LaValle, a close friend of Donald Trump, also spoke at the press conference, criticizing the current state of Georgia politics.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nNo quorum notes.\n\n## Adjournment\nNo formal adjournment noted.",
  "transcript": "Hello everyone. My name is Senator Colton Moore. I represent Northwest Georgia.\nI appreciate that. Thank you.\nI appreciate each and every one of you, thank you for coming to your capital today, I\nwant to get this started with Dr. King and have her lead us in prayer, please.\nMy boss Bruce LaValle say I can't be up here long, okay, Bruce, I got you.\nwe need Jesus, we need to be kind, we need to be righteous and just, and God will keep helping us.\nI'm just going to say hold your peace but do a good job and pray for favor and justice in times like these.\nWe need a savior in times like these. We need an anchor. Be very sure.\nbe very sure your anchor holds and grips the solid right 30 seconds\nAngela then I'm gonna say amen I just want to say one thing this isn't about\nRepublican or Democrat it's not about Christian it's not about Jew it's not\nabout Muslim it's not about gay it's not about straight this is about doing\nwas best for a country that we all live in. This is about protecting our children. This\nis about protecting our freedom, protecting our rights. Congratulations to you. We need\nmore people like this young man in office. Lord, I'm praying very hard for my friend,\nDonald Trump. You know that Lord. Now bless us. Give us justice. Help us God. In Jesus' name\nAnd by the power of your Holy Spirit, amen.\nMy friends, I call this press conference today because we need to set the record straight\non a few things.\nMy fellow Senate colleagues have published a statement and they've recognized to their\nconstituents that we do have a problem.\nMaybe they read in the paper, the AJC or the University of Georgia's poll that recognizes\nthat 83% of Georgians across this state recognize that what is happening right now with\nDistrict Attorney Fahny Willis is politicization.\nThat's what it is.\nThe most prestigious office in this state he calls and references me a grifter and a scammer.\nMy friends, I represent 200,000 hard work in Georgians and Northwest Georgia.\nThe people that I represent that duly elected me, they sweat hard for their tax dollars,\nand they don't want their tax dollars funding this type of corrupt government power.\nI challenge the governor to go to Northwest Georgia, find anyone working hard for their\ntax dollars and ask them, do you want your tax money funding district attorney, Fannie\nWillis?\nYou know, it's very disingenuous to say that, well, she only makes $120,000 a year and\nthat if we pull that away, we would have to pull that away from every district attorney.\nWell, let me be more clear.\nWhen I say defund Fannie Willis, I mean defund all of her Georgia State tax dollars besides\nthe $1 that we are constitutionally required to give her.\nYou see, this governor wants to elaborate that we have a separation of powers.\nWhat we do, but any high school kid coming out of government class understands that we\nalso have a thing called checks and balances.\nMy role as a senator is to call a special session on behalf of my constituents and any\nany Georgian who feels that their tax dollars shouldn't be going to Fahne Willis.\nBecause we, as a legislature, have no power to do anything until we are in session.\nAnd that's why we must have session now because we must investigate Fahne Willis.\nHow in the world can my friends that call themselves Democrats and champion themselves\nand criminal justice reform ignore the fact that half of the inmates at the Fulton County\njail have yet to be charged with a crime.\nAnd there are innocent people who are dying of bedbugs in that facility.\nHow in the world can the citizens of Fulton County demand justice and not get it when\nthey see things like young thug and young slime going to the courtroom for a year and yet\nto get through bondore and pick a jury, but yet this district attorney said she's going\nto take down these political prisoners in six months.\nThe millions of dollars that are being spent, both federally and through the state of\nGeorgia and through local Fulton County tax dollars, are funding this type of corruption.\nAnd what is so embarrassing, what is so embarrassing is Congress has gotten a head start and investigating\nand defunding Fahny Willis way further ahead than we are here in the Georgia legislature.\nVery embarrassing.\nThose same senators also said 72 hours after the governor says that any machine can be hacked,\nthey say that we are the number one state for election integrity.\nIt's unbelievable.\nWhat's also unbelievable is the constitutional crisis that we are in.\nWhen I talk to my fellow Senator and they are afraid to speak out, because they are worried\nthat they are going to find themselves in the crosshairs of this rogue district attorney.\nWhat happened to checks and balances, what happened to separation of powers?\nYou see, those Senators, they're duly elected to represent the 200,000 people that they\nrepresent, but those 200,000 people are being disenfranchised in our Republic because\ntheir senators have cowered down. My friends, I ask that we go forward and continue putting\npressure on these legislators because the legislative branch is the saving grace, but\nit cannot take advantage of its extraordinary constitutional power until we are in session.\nAnd I'm going to be open to any questions and all questions, but I have a few people,\nGeorgians who would like to say a few words. I want to start with you, Bruce LaVelle.\nOkay, thank you.\nThank you.\nIt's truly an honor. It's really hard to come behind a young, is this guy incredible?\nHow old are you? 29 years old. Oh my gosh, that is so incredible.\nListen, I'm here on behalf of representing two close friends of mine.\nGeorgia is a friend of mine and of course y'all know Donald John Trump is a very\nclose friend also. So that in that order, let me tell you why. I'm a four-generation\nGeorgian. And when I look around and I've been blessed to travel the world, my\nfather was a retired sergeant major. He went on to the Lord. He's from New\nand in Georgia. We traveled this great world and I was privileged to go to the\nFar East, the Middle East, as well as this great nation. And it's sad to see what's\nhappening in this great nation. And I say that because we were the city that\nlanded the Olympics ladies and gentlemen, think about that. We were a city that\nwas too busy to hate. Listen carefully. Too busy to hate meaning Democrats and Republicans\ncame together. You know, my business here for 30 years, some of the news people, y'all\nknow me for years, y'all know my character. Everybody knows the LaVale's, okay? So when\nI come up here and speak about our great state of Georgia, I'm very passionate about it.\nI showed up to the sound with $34. And I met Maynard Jackson in the restroom at Cyclorama.\nHere's the true story, at the urinals, yes, at the urinals, yes, and he looked over\nand I said, wow, the manor Jackson, I was invited to the Land Association of Black Journalism,\nyes, the conservative, yes, remember, Republicans, Democrats got along, okay, and he says, you\nknow now is the time to build a business, a black business especially, 1994 I had my\nribbon cutting, six years later I was a millionaire, and so when I, thank you, so when I see all\nAll the chaos when I saw the beautiful Atlanta with bout to lose through the riots and all\nthe other things and all the craziness going on.\nWe watched TV, we see what's going on, San Francisco, Oakland, New York and all across\nthe country, ladies and gentlemen, but let me tell you something, we're not short from\nthe same thing they're going through.\nAnd how it starts right now, we have a DA right now who was born in Englewood, California\nwho was predominantly raised in Washington, D.C.\nNow listen carefully guys, and the reason why we're here right now having this conference\nand the reason why we're at now is because we have both sides of the aisle, watch this,\nchannel two listen carefully, that both sides of the aisle are infected with pay to play\nin special interest, okay, that's why we're right there.\nYou can't govern when you owe favors, ladies and gentlemen, okay?\nThat's why you have a close friend of mine named Donald John Trump, who's in 60% polling\nright now out of all the craziness they're throwing at him, okay?\nBecause he made an oath and he keeps constantly saying, I don't want your money, I don't\nneed your money, I just want to do what's right for you.\nLadies and gentlemen, from the State House, to the State Senate, to the Congress, to the\ngovernor's mansion, all the way down to county commission, to the doll catcher.\nListen carefully.\nThe next ballot election, the next election we have, ladies and gentlemen, picked that\nperson who is she that's not tied to special interest.\nIt's very important because this is why we're in this mess right now.\nAnd where I'm going with this, Mallory hooked me when I'm ready, when you're ready.\n92% of Fawni Willis' funding comes from 44 states out of this country.\nThat means only 8% are fundraising in this community.\nWhat does that tell you right there?\nNow guys, this is serious.\nTwo years ago, I covered with Fox News, I went down to University Boulevard and this\nWendy's was still smoldering.\nThey burnt it to the ground.\nY'all know what happened.\nAll of these outsiders came in.\nI spent three hours on the ground talking to the local people\nbecause I used to mentor Carver High School down the road\nalong with Harper Hartra High School.\nSo I know this community.\nAnd they said, well, Mr. Vella, we didn't do this.\nThese other people come from all over, burn this down.\nAnd y'all know who burned that Wendy's down.\nY'all know who did.\nThey look like us.\nThey look like me.\nNo, no.\nSo here we are.\nAnd by the grace of God, Atlanta was saved\nbecause some few courageous conservatives stepped in\nand said enough is enough.\nThere's no protesting 11, 12 o'clock at night, ladies and gentlemen.\nI have never seen that.\nOK?\nAnd the reason why we had that is because we allow\nwokeness to come inside our great city.\nThe city that was too busy to hate.\nListen carefully.\nBut I say this, instead of going on a witch hunt\non a perfect phone call, ladies and gentlemen,\nwe have never had an election in the nation's history\nwhere the country was shut down and said,\nwe'll just send you a mail-in ballot.\nCome on, somebody.\nAll the military people in this room,\nincluding my dad, Alma uncles, who served from Korea,\nWorld War II, all the way to Vietnam.\nThe absentee ballot was designed for the military soldier\nand the people who were incapacitated.\nSo when you're an incumbent president like Donald John Trump,\nwho want more votes than the previous before.\nI am one of those 80 plus million voters that you and everyone watching this that represent\nthis great movement.\nAnd you come in here and say, well, wait a minute, I got more votes.\nLet me call up some folks and question the election.\nOkay?\nChallenge the election.\nquestions you have mail-in ballots my father had a mail-in ballot he's been\ndead four years how did that get mail to me come on somebody so you're gonna\ntell me that the nation has never shut down in the history okay we all\nagree to that you're gonna tell me if you won the lottery and I said well I\njust put it in the mail no you will kill yourself to come down there and get\nthat lottery ticket. So to play around with a precious ballot and it was just\nflowing around every it's it's okay to challenge the election. Ladies\nyou have the election was over. Let me call Brad up. Brad I know I won. I know\nthere's 11,000. Go back and look. That's called questioning. That's called asking\nquestions. When I think about that, I think about the great Reverend A.D. King, that was\nmy sister, Alvita King's daddy, who started the movement, ladies and gentlemen, and started\nwith Kentucky, okay, on housing. And all during that tenure, my uncles, who was Dr. Noel\nMelville had a church down here in Second Avenue who all marched in the SCLC who all marched\nto say, hey, we want to vote and to get persecuted and to be had their truck blown up, had their\nhouses threatened, their family threatened.\nThat's voter suppression, ladies and gentlemen.\nThat's voter suppression.\nBut here we are now, here we are now, a sitting U.S. president can't call and say, wait a\nminute.\nWait a minute.\nsomething's not right here but then you have a DA that runs on a campaign I'm\ngonna get Trump I'm gonna get Trump now listen carefully guys I'm gonna get\nyou have a DA saying they're gonna run on a platform to get what if that was you\nRudy Giuliani good friend of mine known for years set on that courthouse\nsteps he told you whether you vote Democrat Republic or not this pindling\nswings ladies and gentlemen and this could be you this could be your cousin\nThis could be your brother. This could be your mother. Right is right, wrong is wrong.\nAnd if we can't as a nation question our precious voting processes. Who are we to judge other\ncountries? Who are we? I can't see for the stick in my own eye. That's scripture.\nGreat! Who are we? Now guys, we have the same thing going on in New York. We had the same\nthing going on in Maryland. We had the same thing. And I'm going to tell you guys what I said\nearly in the speech. I'm going to sit down, Mallory. When you have elected official that\nhas consumed himself or herself in pay to play, listen carefully, ladies and gentlemen,\nare compromised. There is some right across in that building right there, Democrats and\nRepublicans who are involved in pay to play. Senator Moore, that's why they're scared,\nbro. That's us. Well, we can't do that, Senator Moore. Yeah, you can't because you're\nby play to pay. You all see what's going on. So when you have a person that says I'm not going\nto take your money, I don't need your money, let that be you. And ladies and gentlemen, I'm inspiring\nthe great men and women in this room. And if this gets out there, and I, it's to put your name\non the ballot and join the great America First Movement. America First Movement is for one blood,\none nation under God, not Republican, not Democrat, Angela, as you said, but one blood, one nation\nunder God. That's who we are. That's who we are. So watch this real quick and closing. And\nI want everyone to listen to this very carefully. What I'm about to say, because this is going\nto apply to everyone in here and everyone watching this video or the news tonight. Exactly.\nif you if you're at home and you make yourself a cup of coffee and you walk out\nand you look out your window and you see your neighbor's house being robbed\nand looted and you sit quiet and you say why don't want to get involved that's\nyou right here that's you if you allow this craziness to come in this great\ncity that's been so good to us to allow the spirit to come in here and to\nunravel everything that yes my good friend the mainer Jackson's the Andy\nYoung's Dr. Nolan Lavelle Dr. Adi King Dr. King everyone that helped build\nthis is this acceptable within by God we got to do something about it but\nguess what funny we're saying the only one there's many more we want people\nthat care about Georgia we want people that love Georgia we want people that\nget along each other how we landed the world stage that says, man, this city is too busy\nto hate.\nWe got to bring the world stage to the Olympics here in Atlanta, Georgia.\nThe largest airport in the world.\nThe Great Morehouse, the Great AU Centers, the Great Spellman Colleges, the Great Georgia\nTax, the Great UGA, the West Georgia College, the Middle Georgia's, all the University\nthe great military bases that we have. I'm going to tell you like this, going forward.\nAnd I share this because y'all know me. There's many people know me. The news, everybody,\nmy jewelry company for 30 years, everybody's wearing a watch, a ring, or something in this\ncommunity. And I don't want to call them names because y'all will come after them and\nBruce mentioned your name in the press conference and they'll try to terrorize them. But we know\nwho they are. How we amend this and how we fix this is that ballot, ladies and gentlemen,\nwe got to keep fighting. We got to early vote. We got to do everything we can. We got to\nget the message out and say enough's enough. We don't want to lose our great city and\nour great nation. God bless.\nGood morning. Thank you all for being out here today. All right,\nrights come from God and should we be questioning God's rights? I am Charlie\nSpurred State Representative District 20 from Cherokee County. I am also the\nchairman of our Georgia Freedom Caucus and it was started. The Georgia Freedom\ncaucus started about 18 months ago here in Georgia, and we were the first ones from that\nwas birthed out of the federal government in 2015 when the Freedom Caucus started at\nthe federal level.\nWith people like Jim Dement, Mark Meadows, you name it Jim Jordan, all of those guys\nwho are on the side of conservatism.\nSo that is how we started here in Georgia.\nWe were the first, and now we're in about 11 states, hope to be in a lot more states\nin the next several months.\nAnd we do a four-way test.\nOne is, does it grow government?\nDoes it raise taxes?\nDoes it increase regulation?\nAnd does it infringe on personal liberties?\nThe most important of all.\nThe purpose of this press conference\nis to petition the governor and our leaders\nto call for a special session to defund and investigate\nFanny Willis.\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nWe have the power to provide oversight and if appropriate impeachment.\nIf we can charge a president of the United States of America on indictment charges,\nI am telling you folks on the First Amendment, they're coming after you and me. It is only a matter\nof time. The First Amendment is the cornerstone of our Constitution.\nAnd we have the right to have the first amendment to say what we please.\nSo many others have said things they didn't want to give up their seat when they lost because\nthey said there was a fraudulent election.\nAnd now our president of the United States said there was fraud or there was misplacement\nof votes then we should not let him be indicted.\nSo I am thrilled that each and every one of you are here today.\nYou are warriors.\nYou are patriots and thank you ever so much.\nWe must keep up the fight.\nI'm Jenny Beth Martin, the honorary chairman of Tea Party Patriots Action.\nWe are here today to write a wrong.\nIn the district attorney indicted 19 people for trying to make sure our election was free\nand fair, that was wrong.\nWhen she said people who followed the advice of legal counsel to ensure a free and fair\nelection were actually engaging in a conspiracy to overthrow the election, she was wrong.\nAnd she said people could not exercise their first amendment rights to free speech and\nto petition the government for redress of grievances she was wrong.\nAnd every single day that goes by, that innocent people have to prepare to defend themselves\nin trial, that is wrong.\nAttorney Fannie Lewis has abused her power of office for partisan political purposes and\nthat is wrong. Her wrongful prosecution, which I actually think is a persecution, must\nbe defunded and an investigation must ensue. And if that investigation leads to an impeachment\nSo be it.\nThe Constitution of Georgia gives the legislature the power of the purse.\nThe Constitution of Georgia gives the legislature the power to impeach.\nThe Constitution of Georgia gives the governor the power to call a special session.\nTogether, the legislature and the governor must call a special session and must write this\nwrong now.\nAnd in the meantime, we are not going to allow this district attorney's abuse of her office\nto stop us from standing up for our first amendment rights.\nWe are going to keep speaking up, assimilating together, and petitioning our government for\nredress of grievances.\nWe're going to take some questions.\nI'm going to give the mic back to Senator Colson Moore.\nIf there's any from the media or the beautiful faces that are here, go for it.\nSenator Moore?\nYes, ma'am. That's what we're going to continue to do. Absolutely. I got a hand in the back. Yes, sir.\nWhen is anyone going to question this? I'm one of the people who saw fraud in hot county. I have to fill out an affidavit.\nYou want to know the governor who must be like OJ looking for Nicole's murderer. He hasn't called me. His people haven't called me.\nbe a state trooper has who called me my phone must not work it works for everybody\nelse but it doesn't work for the governor and then we got what's going on in\nthis county she is attempting to take away our election rights what are you\ngoing to do and let's be honest what prosecutor is going to do the right thing\nand let's get her right sir your your concerns are the same concerns that my\nconstituents have and that is why I'm pushing so hard for this special session. That's why I have\nspent money and some of my fellow Senators districts reminding their constituents that they are\nsitting on the sidelines calling themselves conservatives and not jumping into the action\nbecause they are discounting the power of their office. They are elected to serve in a legislature\nthat has the oversight capability, but until they jump into the action and call for a special\nsession themselves, then, you know, we live in two worlds.\nSir, they won't do it until there's three times this room.\nHow many people are on your feed-in Facebook?\nIs everybody who's out there?\nAnd you see Trump, this Trump, that, oh, he's my guy.\nWhere are they?\nThere's so many of them.\nBut there ain't a thousand of us.\nYou know my co-pager.\nSir, we're going to have to move on to the next question.\nMr. Pritchard.\nSir, Senator, my question to you\nis the state, the state Republican Senate caucus.\nYou have been called out.\nThere's been a lot of talk in the media.\nYou may be expelled from the caucus.\nYou may have broken rules sanctioned.\nAs the caucus met, have you received something official?\nAre there rules that they claim you broke?\nDo you think they're going to remove you\nfrom the Georgia State Senate Republican caucus?\nWell, I think that's a great question.\nWe do go into caucus behind closed doors, starting on Monday\nfor three days.\nIt'll be the first time that the Senate Republican caucus has met officially as a caucus since\nthis has went down.\nMy answer to your question and my answer to my fellow Republicans is make my day vote\nme out of the caucus.\nSo I have asked that question to the majority leader, I have yet to get an answer.\nThey say they're still looking into that.\nI think they're saying that maybe I'm impugning one's character, but I certainly think that\nMy character has been impugned on both sides of that.\nSo obviously, for me, this is much bigger\nthan my relationship with my fellow senator.\nIt's much bigger than the Republican party.\nIt's much bigger than President Donald Trump.\nThis is about basic fundamental First Amendment rights\nto question the integrity of an election.\nRemember, it took 19 days to certify the election results,\nany reasonable person with common sense\nseeing that there's 40,000 affidavits of fraud.\nSitting at the governor's desk,\nthose individuals have a first amendment right\nto question that election.\nSo.\nHi.\nHow can I say something like that?\nThat's good, we'll say it again.\nI think I will take a couple questions from the press.\nIf you'd say your name and who you're with, please.\nSenator Moore, my name is Jeff Baamey.\nI'm with the associated press.\nHow many signatures do you have on your petition\nfrom Senators and House members?\nSo there's three. There's three total, which is very disappointing.\nOur caucus, I think there's 20 something that signed on between the House and the summit.\nThere's Senator Brandon Beach, myself, and Representative Charlize Burrard, who you see here.\nVery disappointing.\nSir.\nHold on one second, folks. We got another question.\nany evidence that Penny will is could bring that might convince you that any of these suspects\nare guilty or are not. Absolutely not. That's right. What I want to do in my investigation,\nyou know, there's a lot of corruption that seems very obvious. Why in the world did this\nindictment come out hours before the grand jury ever concluded? There's a lot of that\nhave been indicted that feel that they were found themselves in the process and a very\ncorrupt way themselves and they're willing to come and testify, some of those that are\nindicted. So, you know, how much coordination has she had with the Department of Justice\nin D.C., you know, former speaker in Georgia Newt Gingrich claims that he believes that\nWashington D.C. was calling Fannie Willis and saying expedite this indictment. Those\nThose are the types of questions that the legislature needs to be investigating.\nThere is no evidence that I have seen that would suggest anything of the such.\nAnd I don't know if you've all read the indictment, but when I read the indictment, it's the\nmost poorly written indictment that I think you could possibly have.\nI mean, some of the evidence is nothing more than a tweet making a false statement.\nWell, when somebody honestly believes that the election is stolen, is that a false statement?\nNo, that's a persecution of their First Amendment rights.\nRight, all right.\nRight, all right.\nThat may be your radio.\nPart of the response from some of your fellow Republicans is the use of the prosecuting attorney's\nqualifications commission.\nDo you respond to that?\nYeah, absolutely.\nI was the only Republican to vote against it.\nAnd the reason why I voted against it was for very reasons that we stand in today.\nThis commission, right, is a bunch of unelected bureaucrats.\nWe as a legislature are giving them the power of the legislature to investigate and impeach,\nand that's why it's being challenged constitutionally. So for all those legislators who say that\nthis is the saving grace. Now I certainly hope Fannie Willis is the first one to go before it.\nBut the commission has never met, and the law also states that once the commission does meet,\nthey have to establish rules, and those rules have to be approved by the Supreme Court,\nso the time frame of which that can be done is up in the air. Whereas we know that we have\nhave the legislative authority to do the same thing\nthat prosecutorial commission can do,\nbecause think about this.\nHow does a legislature legislate itself out of power?\nIt can't do that, constitutionally.\nSo sure, we have the power, we've granted it\nto this prosecutorial commission,\nbut that means we've got the power to do the same thing\ntoday, we just need a special session.\nGood job, good job, good job, good job, good job.\nWe're going to continue to call,\nor I'm going to continue to call,\nand I'm sure other colleagues are as well,\nto call for this special session up until we are in session.\nAnd at that point, I will motion to amend the budget\nand de-fund Fannie Willis and we'll have a roll call vote\nright there on the Senate chamber.\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\njust like the representing 98 percent of the state doesn't agree with you, the special\nsection that's necessary.\nWould you say that or would would when the president\nfrom the media that was going to shoot out of the rest of the state and those lawmakers\nwho have made that decision?\nWell, I would refraiser question to the Uniparty does not agree with me, but the constituents\nof which they represent do agree with me.\nWe're happy.\nWe're happy.\nWe're happy.\nWe're happy.\nWe're happy.\nWe're happy.\nYeah.\nAre you with the media, sir?\nI know, sir.\nWe'll give another media question.\nWe'll come back to you.\nSenator, just to follow up on my earlier question, if lawmakers themselves were to call a special\nsession, there are 102 Republicans in the House and need 1008 signatures.\nHow are you going to commit six Democrats as I met the decision?\nWell, how did we convince Representative Misha Mayner to leave the Democratic Party and become\na Republican?\nHow did that happen?\nto discount what is going on in Atlanta and to say that Democrats will never come across\nas being very disingenuous.\nWhy am I not having an argument with Democrats who claim to be for criminal justice reform?\nWhy am I having this argument with my fellow Republican and that's what keeps me up at\nnight?\nSo the special session does nothing to eliminate the case.\nThe case would still continue.\nThe thing that the special session puts a check and balance on is it's able to defund it\nhopefully, right? And then if you pull the money away, then Fulton County Commission and Washington DC\nhave to decide do we substitute all of those dollars? Does the Fulton County citizen think well my\nneighbor on this side is getting robbed? My other neighbor on this side is getting murdered\nand I don't see any justice in my community. Do I want my tax dollars funding this political\npersecution or do I want my tax dollars taking care of justice? So that will be a question for them.\nBut what I also want to do, though, is take advantage of that investigative oversight\nthat we have, right?\nThe ethics committee of both the Senate and the House, under Georgia Code 28-1-16, has\nsubpoena power.\nAnd I want to bring in Fahny Willis and other people in her office, in addition to many\ndocuments that we need to see and investigate and inquire into the nature of, I would love\nnothing more than to see some of my fellow senators, who are some of the best trial attorneys\nin this state, cross-examine district attorney Fannie Willis in that session.\nOkay, so I'm going to come back to you.\nAccording to Katherine Echoberg, I can't pronounce her name properly, but she met with\na rapist group a few weeks after the election and she had come up with 384,000\nand voters on the voter roll, and Rackensburg admitted to that sounds about right.\nThere was no further investigation, and allegedly, according to Catholic Echeverk, 67,000 of those voters voted.\nThat's about 14 to 15 percent of the people that are not eligible vote voted.\nThe news is not out there. I'll treat you to vote.\nDo you have that information on hand?\nNo, sir, but the information that you give is very common.\nI have received probably 50 letters in the last two weeks of people documenting what\nthey saw in the 2020 election to be fraud, and these are Georgians across the...\nFrom Rapidsburg's own mouth, he never followed up with an investigation.\nTwo thousand years ago.\nSir, to answer your question, while all those things were horrendous in 2020, what I am\nfocused on right now is what has become even more horrendous, is where we are taking\npolitical prisoners who are questioning the very things that you talk about, which is\ntaking it to a whole nother level of authoritarianism, and then something else, we'll talk about\nat the rally here in just a minute if that's okay yeah yes ma'am. You know so we're\ntalking about authoritarianism and that's what we see right now taking these political prisoners\nBut what I think a lot of people in Georgia have missed is during the fish fry\nDown at the eighth district. We had people who were escorted out\nBy armed police officers\nFor merely expressing their first amendment rights and wearing a t-shirt that said paper ballot, please\nAnd this was at the direction of you know our governor to my understanding\nWhich is very disheartening very disturbing that we live in this state in this time\nI'm going to take one more question from the media, and then we're going to have to go.\nAre you with the media, sir?\nRight.\nSir, can I ask you a question, and I'm going to make a point.\nIf we do not have a First Amendment right, and we do not have an election ability to\ntake political prisoners for questioning an election, the oath is meaningless.\nSo if the unit party, Republicans and Democrats, fail on their vote to follow the law beyond\nthe state of Georgia, what other measures do we have if we are taken over by enemies\nfor and the best in both parties to cancel our voice, who beyond the state of Georgia\nhas authority over the entire crew of that restaurant.\nSir, I'm just like you.\nI don't have an answer to that.\nAnd unfortunately, that's why it's so critical and important that we take action now.\nBecause once we lose these rights, we will never get them back, and there is nowhere else\nto go.\nLadies and gentlemen, that's that, to the media, I will be available for interviews after\nthis.\nTo all of you, please join us at Liberty Plaza here at High New.\nThank you.\nThank you very much.\n",
  "updated_at": "2026-02-12T20:26:59.283611+00:00"
}