{
  "video_id": "OLYr8R0FEfc",
  "url": "https://www.youtube.com/watch?v=OLYr8R0FEfc",
  "title": "Joint Appropriations Special Session AM - January 22, 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 252,
  "summary": "Here is a structured markdown summary of the Georgia Joint Appropriations Special Session AM - January 22, 2026 session:\n\n## Overview\nThe session focused on preparing for upcoming winter weather and addressing concerns around delays in FEMA reimbursements for emergency management activities. The Georgia Emergency Management Agency (GEMA) director provided an update on the weather forecast and the reimbursement process.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- GEMA Director Lamb provided an overview of the upcoming winter weather forecast, indicating that widespread snow or freezing rain is expected across North and Central Georgia on Saturday and Sunday. Temperatures are expected to remain below freezing through early next week.\n- Director Lamb addressed concerns around delays in FEMA reimbursements, explaining that the delays are due to a combination of factors, including structural and policy changes at FEMA, as well as a high volume of reimbursement activity following Hurricane Helene. He provided a step-by-step explanation of the reimbursement process to clarify the distinction between obligation and final payment.\n- Director Lamb highlighted GEMA's key accomplishments over the past year, including the expansion of the Behavioral Threat Assessment Management (BTAM) program to 97 school systems across the state.\n\n## Votes\nNone detected.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nThe session adjourned, but no information on the next session date was provided.",
  "transcript": "Okay guys welcome to day three of the 2026 budget hearings. This eight o'clock we're Chairman Hatsons on his way up but we're gonna go ahead and do the invocation and get started because we have some other time pressing issues that are gonna happen a little bit later on today. Chairman Carpenter do you mind saying the invocation? No, that would be great. About your heads. Your Heavenly Father we just come to you and we just thank you so much for getting us out here safely. Be with us as we go through this budget process as we try to do what's right by the taxpayers and the citizens of this state. Father just be with us as we forecast what's going on in the in the weather the next few days in our state protect our citizens. We're gonna see each each of us home safely and just thank you for your love and your son's name we pray. Amen. Thank you. You'll see that we're a little bit out of order. The first group of supposed to be the Department of Law. Guys thanks for letting us take you all a little bit later on. It's gonna push everything back a little bit today. The purpose is gonna be so that director Lamb with Georgia Emergency Management Association can do it or yeah can go first agency not association sorry can go first there's obviously some weather related events happening today that we're trying to get ahead of and we need to get his having this hearing earlier allows him to coordinate with the governor and the governor's team on some joint virtual meetings that we're doing with our state wide officials later on this afternoon so with that opening director Lamb thanks for being in here this is your first time before our committee as well but not your first time with a storm so. So I heard there's a time on our age-old tradition that there's no questions of a first-time presenter so I was just hoping we could stick to that today but thank you very much for the introduction it's my honor to be here today and represent the men and women of Jimahomla in security and be able to present our budget. Again I do want to thank for Chairman Chair Liri and Chairman Hatchett for making the necessary adjustments for us to be able to present here early as we do have impending severe weather on the way. Before we discuss the budget so I want to begin by thanking Governor Kent for his leadership and continued commitment to emergency preparedness and public safety. I also want to thank the members of the joint appropriation committees for your support over the past year. Your investment allowed Jimahomla in security to continue delivering critical services to the people of Georgia during the period of significant physical and operational change. We appreciate you all getting here early this morning allowing us the opportunity to present our budget proposal as we are beginning to prep for winter weather. That said before we get into the details of the budget I would like to take this opportunity to address the upcoming winter weather. Wide spread snow in or freezing rain is expected across a large portion of north and central Georgia on Saturday and Sunday. Freezing or below freezing temperatures will continue into early next week. Jimah is closely monitoring the forecast and we will be standing up the SOC at 0700 hours on Saturday morning. While forecast continue to evolve confidence is increasing for significant impacts in areas generally north of I-20 this weekend. Impacts also remain possible in central Georgia but confidence is low in the southward and westward extent of the rain and freezing rain line. Expect further forecast updates as model guidance comes into better agreement. Temperatures will remain very cold early next week. High temperatures Monday may only reach to mid-30s for much of North Georgia while temperatures Tuesday morning will be a little bit more difficult to implement to the single digits and lower teams across the northern half of the state. Temperatures should steadily rise every day beginning next Wednesday but prolonged sub-freezing temperatures could prevent snow and ice accumulations from melting and drying from roads and potentially causing pipes to burst. As always our agency will continue to monitor conditions and provide updated weather information as it becomes available. Our legislative liaison scholar Whitaker has begun sending you all in. Lastly we encourage you to follow us on our social media for live updates and visit our website for resources as we prepare for winter weather. Secondly is all of you are aware structural and policy changes at FEMA have gradually trickled down to the state level. We recognize that reimbursement timelines have become a source of frustration for our partners local governments and this body and we take those concerns very seriously. It's important to clarify that reimbursement delays are not a result of a single issue but rather they're the cumulative impact of several factors within a multi-step federally driven process reimbursements move through multiple phases including applicant documentation state review federal validation and final approval prior to payment each phase is sequential and must make strict federal compliance standards. Recent structural and policy changes at FEMA including updated eligibility guidance additional documentation requirements and increased review layers of extended processing timelines nationwide. At the same time we experienced a higher volume of reimbursement activity due to hurricane helens historical impacts further contributing to delays. We appreciate the opportunity to provide clarity to this issue and remain committed to transparency accountability and continued improvement. Here we have included an on-the-screen step by step description of the reimbursement process. I want to briefly draw your attention to the obligation step you'll see in step one as this is often where confusion arises. Obligation does not mean that funds have been issued or that the check is in the mail. Rather obligation indicates that FEMA has approved the project and formally committed federal funds for it to move forward. As shown here obligation is an early step in a multi-phase process additional reviews and approvals must occur before funds are ultimately released to the applicant. Understanding this distinction is important as it helps clarify why time may elapse between obligation and final reimbursement. Today out of the nearly $1.4 billion that has been obligated to hurricane helene we've paid out nearly 75% of subrecipients which include county and municipal governments. Keep in mind that this is a capture of a moment in time because these numbers do change due to projects being obligated or revised. These payments reflect projects that have fully completed the federal review approval and reimbursement process. There's nothing more important to us than to move these funds as expeditiously as possible as we can in getting those funds to the ones that have been affected. We're in constant contact with the local counties and municipalities to work through any issues that may arise. GM Homeland Security is somewhat unique amongst state agencies in that approximately 98% of our funding is derived from federal grants. While this creates opportunities to leverage federal dollars it also means state funds are critical to meeting required matches and maintaining compliance with federal requirements change. Over the past year changes to federal grant structures have created new challenges that required careful planning and prioritization. Over the past year despite significant changes at the federal level GM Homeland Security has remained focused on sustaining our core mission and delivering results for the state. I'd like to briefly highlight a few key points our key accomplishments from the past year. Within our Homeland Security Division behavioral threat assessment management come when referred to as BTAM continues to be an ongoing priority. To date 97 school systems across Georgia have completed BTAM courses strengthening early identification and intervention efforts to keep students and community safe. Across the agency GM Homeland Security has provided facilitated a significant volume of training and professional development. During calendar year 2025 we delivered 1500 and 28 online and in-person course offerings reaching more than 32,000 participants statewide. In addition 813 individuals currently hold a certified emergency manager credential in Georgia reflecting the continued professionalization of emergency management at the state and local levels. Operationally in 2025 GM Homeland Security supported three statewide activations totaling 42 days. These included support for President Carter's final farewell wheel which included a required a 14-day activation a winter weather event lasting 25 days and a severe weather activation which span three days. Together these accomplishments demonstrate both the breadth of our preparedness efforts and our ability to sustain operations during extended real-world events. We successfully managed multiple federal grant cycles and shared compliance with evolving federal requirements and maintain statewide emergency preparedness capabilities. We also advanced planning and readiness efforts for next-generation 911 which I will address in a later slide. These accomplishments reflect careful prioritization and responsible stewardship of both state and federal funds. FY26 amended budget overview. I'll begin with the FY26 amended budget which we fully support. This amended budget ensures continued compliance with federal requirements supports critical public safety infrastructure and strength and protection efforts for Georgia communities. We'd like to sincerely thank the governor for including the one-time two thousand-dollar salary supplement state employees. Our personnel have expressed sincere appreciation for this recognition which reflects the value placed on their continued commitment to public service. EMPG match. The 5.7 million dollar increase allows Georgia to meet federal matching requirements for two emergency management performance grants. This requirement resulted from the federal government shortening the grant period of performance from three years to one year. As a result both the FY24 and 2025 EMPG awards now require a full-state match and must be extended by September 30th, 2026. Without this funding Georgia would risk losing significant federal preparedness dollars. The next item relates to the Georgia Emergency Communications Authority which is administratively attached to GIMMA Homeland Security. The additional 9.9 million dollars builds upon the existing 5 million dollar allocation and funds the first two years of GIS build out necessary to support next generation 911 services. This investment improves call routing, accuracy, response times and situational awareness for emergency responders statewide. The final item in the FY26 amended budget is a 1 million dollar transfer from the Department of Public Safety to GIMMA Homeland Security for the protection of communities grant program. These funds will be administered along with the along the federal non-profit security grant program allowing the state to better coordinate resources and strengthen security for at-risk communities across Georgia. I will pause for if there is any questions related to our 2026 amended budget. If not moving into the 2027 proposed budget, turning down to the Governor's proposed 2027 budget for GIMMA Homeland Security, the 1.429 million dollars covers the state match requirements for the first quarter of FY2027 which corresponds to the final quarter of the federal physical year 2026. The next item is a transfer of funds from GIMMA Homeland Security for gain case management system support. This program began in 2024 under us and the return of the program and funds will assist us with meeting our federal match requirement. The last item is a continuation of the transfer of 1 million dollars from DPS to GIMMA Homeland Security to continue to administer the protection of communities and conjunction with our federal non-profit security grant program. These investments have a direct and measurable impact on the state of Georgia. They ensure the state remains prepared to respond to emergencies, protect the progress achieved through prior investments, and reduce long-term calls by addressing risk early rather than reactively. I would be remiss if I didn't mention the risk that could occur without state action. In terms of grant dependency, many core agencies functions, finance, training, logistics, IT operations are almost entirely EMPG or FEMA funded. Elimination would directly halt essential services, not supplemental programs. We would continue to experience vulnerabilities and our 911 communication and aging infrastructures that relates to the next generation 911 and county preparedness would also be at risk as hazard mitigation plans are federally supported. Without state funding, counties risk losing FEMA eligibility for mitigation grants. With the state support, GIMMA Homeland Security can ensure continued statewide emergency preparedness and response. Ultimately, this budget strengthens public safety, resilience, and coordination across the state with our local and federal partners benefiting all Georgians. And with that, that concludes my presentation. I will yield any questions. Thank you very much. Thank you, Director Lamb. A couple of questions. Sorry, something just happened on our screen. Our screens went blank for a second. Sorry. Can you go back to your slide where you're talking about FEMA fund? The things we hear the most about, at least that I get the most calls about, are FEMA funding and things that go back through there. Can you talk about that for a second? I think it was the one we just passed. Currently, the states receive 38 million and the beds have walked me through this to make sure we understand this so I can figure out how much is still outstanding to the local governments in the state. So what this is a little bit complicated. So let me start with the bottom and the work all the way back up. So right now, Haleen is being estimated and this gets into how projects are built out. Some of them are estimated to call some are real calls. Right now, the total event with Haleen is estimated to be the 1.79 billion dollars sum you see at the bottom estimation. Out of what has been estimated for this to cause the 1.4 nearly you see on the line above is what has been obligated. That goes back to the obligation piece that I was explaining where the proper documentation has been sent forward and FEMA has signed off and said we're going to put federal funds toward these projects. Out of what has been obligated, federal part of that has been paid out is the right at 1 billion dollars and the state match that goes along with that is that 38 million dollars that you see above it. That estimated amount, it was based upon what local communities and the state turned in literally in the weeks after the storm. Right. It is, but my understanding is again that can change depending on how projects are obligated or revised within that process. Some there is a time frame on submitting them in but they can be revised afterwards and that that number can change. We expect that number to continue to climb or do you think that's pretty well set right now or what's your confidence level at the 1.7? I keep what I've always been told is it was going to be estimated somewhere around about 1.8 billion to 2 billion. So I would say this is we're getting close. Right. Of the 300 million roughly 400 million remaining, do we have any ideal the breakdown of how much of that is owed to the state versus how much is owed to the government? We probably do. I don't have that right now but we we have it broken down by projects on spreadsheets so that would be something we would be able to get even if I don't have it here now. And I know I want to give you credit too. I know you weren't with the federal partners. I mean if we had done this this map two months ago, I think the pay outs we would receive right then was around 700 million at that time. Well you just before Christmas we had about 1.2 billion dollars obligated out of what is referred to as the large project review which is where these major projects go to to go to an additional level of scrutiny. We had 1.2 billion dollars or so released out of that just before Christmas out of that and you and Chairman Hatcher are on the emails you've seen where we probably had over 600 million released since then. So money is flowing much better now than it was in the past. We're hoping we are so called over at the Hump sum you would say because money is flowing better but for a long time money wasn't flowing much at all and we understand that causes hardships for a lot of people. We're very sympathetic to it and again I would just assure everybody we're doing everything we can to try to move that money along and I would tell every one of you two and I know there's probably so in the rooms I've been people I've done this for in the room. Every one of these situations is different unique depending on the particular situation but if you call me we will dig into it say if we can move heaven and earth there's sometimes there is sometimes there isn't because again it is a federally driven process but I assure you we will do everything we can to get the money that are affected and then you. One last question on this topic you said there's a difference in it being obligated and then it coming to the state. Once what is the word that local government should be looking for when they're looking at their FEMA pages or it is not obligated what should they be looking to see? It is not obligated because again that obligation is just that FEMA has approved for the project to move forward and they are setting money aside. I'll go back and the critical piece in all of this is when our grant specialists are working with those counties and just refer to sub recipients they are in communication they're we're trying to change up some of the the wording so to speak because there's even one where it it refers to a check and it would lead you to believe that the check is in the mail it is not. I'd had to get the technical term on that but what I will say is they are in communication between and I'll just say this again you go back to the magnitude of this storm it is somewhat unique in just the fact that healing was so big and you had 95 counties that were affected by it so what's happened is all this influx of money have come in and you've got counties got a tremendous amount of dollars invested a lot of those have now brought in a consultant to help with that too we found sometimes when the consultant comes in the county steps back a little bit and will there's some miscommunication in the process and a lot of times it's getting the right people back talking to one another I don't know the exact word they should wait out what I would say is that communication is happening between our grant specialists and them was it dispersed was that the word they were using? do you know exactly what the the verbiage on that is? and maybe this is the better question to ask after the funds hit Gima when they hit your account what is our turnaround time to then give them issued out to the counties of the cities? once it hits Gima and let me back up stuff for that it doesn't actually hit Gima hits OPB OPB cuts that check once it gets to us we're getting it out in a matter of days I mean we're immediately making phone calls well we're putting people into I've had delivered checks we're having our full coordinators handle checks once we get the checks from OPB and it usually only it depends on what they OPB's cutting the check but they turn it around as quickly as possible too but once we get the OPB it comes to us we're delivering it almost immediately. Thanks. Director I just have one sort of request I understand the Delet Wild can't say I really understand the delays it's not your delay but will you just make sure that the people in your area under you they're working with the local entities are constantly communicating because you know who doesn't have their money yet and you know they're waiting on it you just please make sure you're communicating with them and keeping them in the loop. Absolutely yes sir. Thank you. Chairman Carpenter. Do you foresee increased cost obviously coming up with the World Cup and then the Super Bowl next year do you see that being Australian on your budgets? No and I'll tell you why a lot of that cost has been offset through federal dollars there was money put into the federal budget on that I think it's about 73 million dollars that's gone out that's being set aside for grant over time we've just went through that grant process where all the participating agencies are signing up to be eligible for that that overtime so I don't have concerns on that as of right now because it's going to be offset through federal money. Chairman Goodman. Thank you Mr. Chairman I represent District of South George and of course Hurricane came right through and you know I've been dealing with my local governments quite a bit you know when you've got things like City of South George about I said 14 million dollars and Acquence and Pierce County owed 7 million a piece I'm not sure I think some of them are still waiting on that money but I've done a little research into this and my understanding is the state of Florida has a fund where has they'll reimburse the locals and then when the money comes in the state gets from money back I would really love for us to at least look into that and understand we don't we don't we don't want to do anything that would slow down the urgency as far as our local governments have getting all their paperwork done and everything but at the end of the day that money that we've gotten the Treasury is a citizen's money you know and I just think if we could look at trying to do something like that I think it would be little received and I think it'd be a good use of the people's money. Yes and we are so a couple of things we've put a group together with NGEMA to look at alternate methods I'm also part of emergency managers association the name of the National Emergency Managers Association and I sit on the Responsible Recovery Subcommittee we're actually looking at it too because there are other there are some other states they're doing some other things now it does get into the weed somewhat of how that is funded and how they do it but it is something that we are actively looking into now because anything we can do to help is a good thing how we do it is like your thing else where you run into problems ever yesterday we we are looking at it both internally and externally as well because a lot of other states are battling with the same problems it's not just reserved to Georgia again going back kind of the magnitude of Helene it is truly that and some of the the federal changes it's a nationwide problem we're trying to work to it through it both on a local level but also nationally as well last question from Senator Sims thank you Mr. Chairman thank you for your presentation as quickly as possible we need to get these reimbursements especially to our farmers who plan they in one season and begin at the same time the next and it's very crucial and critical that they have these funds for planning purposes they cannot do anything without knowing that they're going to be reimbursed for their losses the bankers are waiting the fertilizer folks are waiting everybody is waiting to be paid so it's crucial that we take care of these farmers thank you so much 100% couldn't agree with you more I would just remind everybody that often we play a game in which we don't write the rules and it goes back to those federal guidelines I've come from a farming family I understand how it affects them and again I would I would just go back and ensure you we are trying to do everything but we we do understand the severity and the the importance of it so yes ma'am I said last question but somebody else asked and she's got a lot of seniority chair chair lady Lynn Smith thank you Mr. Chairman I'm over here straight in front of you yes ma'am so it's been my experience with local governments especially our very rural areas of the state that they do not have staff nor talent to fill out these applications and a lot of times the delay is due to inexperience and I don't know if our state has the system to support that but I'm doing a several of our real state counties create their own harm without knowing they're doing it yes ma'am well part that goes back to the money that's being that that's they get in relation to some of these events they can use some of that to bring on and correct me if I'm wrong but they can bring on consultants to help them with that process and that's what a lot of them have done but we do assist them in that process again I think it comes back to some of the magnitude is causing some of that issue too but yes ma'am that is something we look at and we're trying to alleviate any issues that they may have as far as their trouble and fill out their paperwork as well Director thanks for being here today if you don't mind this is roughly $400 million difference between the current estimate and obligated if you get us a list of where that would be just so we can kind of have it for our purposes understanding and planning really appreciate it thanks for what you're doing thanks for doing over the next 72 hours yeah we'll keep you updated on the weather thank you all very much next up we have right banks the chief deputy attorney general with an update from the attorney general's office Good morning chairman members of the committee I'm right banks I'm the chief deputy attorney general I'm here on behalf of Attorney's Journal Chris Carr who has a commitment this morning that I think is family related with me today is Travis Johnson our chief of staff and Adam Ross our finance director also have Jordan Watson in the back who's our director of external affairs and policy our amended budget and FY27 budget are basically flat budgets with the only changes being really being these statewide changes and amended 26 we pick up the two thousand dollar per employee payment which our employees are very excited about and we have a small adjustment of about ninety three thousand dollars that relates to the timing of our ability to fill some positions that we were given last last budget FY27 our budget is again flat with the only statewide adjustments being the DOAS adjustment that everybody has and the health benefit of playing adjustments with that I certainly would be glad to try to answer any questions we we would let you go first if you knew it was gonna be that fast well I spent a good bit of time working on that so I was getting that finalized in the back while Gimo was presenting I think chair Matilary has a question my questions are our first of all right thanks for being here I know you've been living with the department of law for a long time I'm curious back to the opioid settlement for a little bit we were asking Commissioner Tanner of some of these questions can you tell us right now the total dollars that we've received statewide and then what were it's like a cash collected think we're at about two hundred million dollars cash collected but now the the settlement obligations extend you know over multi years just remembering the distributor settlement my recollection is the state all distributors would get about six hundred million but that payout as I recall is over about 18 years of those funds what percentage of that two hundred million currently is that the\n\nAnd what percentage do we have some allocation over from the legislature? So I don't know that off-hands chairman. I'd be certainly glad to get you that. Of the 200 million, there was a first round of settlements you may recall with the distributors and Johnson and Johnson. Those funds, as I recall, all went to the trust. Then there have been, as collected, of course. Again, there's an obligation, a tail obligation. Then the individual settlements that have happened since then basically have an allocation that, as I recall, is a split where some of the funds go to the trust. Some of the funds go to the state treasury and are available for appropriation. But then have, of course, conditions on how they can be expended through the appropriation process that are forced on us by these national settlements. In the reason we're asking is, we heard the commissioner talk about the, in the heck, I think it was a WSB article this morning about the issues we're having with forensic beds. We've got 200 million that we can allocate towards state hospitals, forensic beds. Why would we not go ahead and see that? Some of that 200 million, I believe, he would know better than me. Some of it, I believe, has already been subject to grant processes. I think I remember reading that there were some number that was granted from the trust. Some of that 200 million is probably not, is still in process like we've collected it and we're about to remit it to treasury and over to the trust. Some part, but that is, but the cash does exist. But some of the 200 total that has gone to the trust, I believe, has already been granted out. I wouldn't presume to speak for them, of course. In that category, then, of the funds that the 200 that's currently there, are there permitted and un-permitted uses? Yes. What's permitted? There's a, we have a book on this topic, but you're essentially are expending for opioid evapment purposes. You've got to fit yourself within the confines of a national settlement that describes what you can do. But in general terms, there's a good bit of breadth there in terms of what you can do. So we were doing something. As I recall. So, if we were doing something with developmental disabilities, we're probably going to be okay. We certainly could talk, we're glad to have input on that if there's a specific proposal and, but it would be good to, you know, the devil was in the details, of course. Well, there is a specific proposal this year is about 30 million in the MAT program. It has been proposed to essentially use those funds instead. As some of the rest of the slides I was looking at doing years ago, we were told we couldn't do that, that we had to go through the opioid settlement fund. Instead, we couldn't directly allocate. I'm just wondering if there are change in policy there or what's happening. I don't, I forgive me. I don't know the details of that question. I apologize, but I would certainly, we would certainly try to be helpful on that point, but I don't know the details of that one. If there, we may have to revisit the issues concerning the legislators involvement with the trust as we move forward. Certainly, I understand. Sorry, I turned myself off. I apologize, I was just trying to keep these screens going today. Senator, Representative Hulcomb, sorry. Thank you, Mr. Chairman. In past years we've heard a lot about turnover and retention of staff, and we heard that yesterday from the Chief Justice with respect to the courts. Are you having similar issues within your agency still or are they resolved? Well, with the support of the legislature and the governor's office, we went through a three year process of getting some enhancements to our appropriations that we used to move our salary structure upward. We accomplished that over those three years. We moved our starting salary for lawyers, for example, from about $62,000 up to about $75,000. That has helped us. We've seen some stabilization, but are there challenges in hiring lawyers? Yes. Atlanta is a tough market. We compete with other government entities, local governments are paying. Some of the large local governments are paying large amounts to starting lawyers, for example. We lose people to our own clients sometimes. It is a challenging market, but the three years of support we have been given have helped us a lot. There are areas that remain challenging. If you're trying to go higher and experience litigator in the government sector, that's a tough market. Thank you. One final question, right. I know we've been working with you guys for years asking for your help with cell phones and prisons. Do you have any update on that topic? Well, we've had some look with the FCC here lately. A.G. Carr co-chaired with Arkansas, a letter recently with the FCC. We were one of the first to speak out on the long held position of the FCC about, you know, where they have basically taken an old radio law and interpreted it in my personal view to be prohibitive of restricting a cell phone, which didn't even exist when the law was passed a gazillion years ago when radio was first licensed. So we've been pretty active in that space and certainly remain so. And hope that we are making progress there have certainly been some positive signs from the FCC. Any updates you can give us since the letter? Not a specific update today, now. Any other questions for us? We'll try it. We do have one more. I think it's from Representative Mathis. Chairman, tell me, ask about the cell phones. Any movement as far as the drones that have flown over these prisons restricted areas? Is there a big problem? Well, I think if some support was given on the topic of jamming cell phones, that would also probably be very beneficial in terms of jamming related to drone activity. But I certainly see the same reports that I'm sure you do and related to a lot of the activity around the prisons. And there's one particular prison. I see stories all the time where the law enforcement are arresting people flying drones in. I don't think you have any more questions right now. Thank you. Thank you Attorney General for being here. Great. I appreciate it. You see us messing with us when we hit these buttons sometimes they're not turning your mics on. But the... But if you see us messing with us, it's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. It's us. Next, we have Colonel Bill Hitchens with the Georgia State Patrol Department of Public Thank you. Good morning, Mr. Chairman and members of the General Assembly. It's truly an honor to be here this morning and I'm thankful to have this opportunity to speak with all of you. We're excited to work closely with this legislative body as well as other state leaders during this legislative session and throughout the year. Our commitment has continued to be transparent and responsive to all of you and the citizens of the state of Georgia. We stood before you previously to explain the troubles we were having with our retention and recruitment. The Governor and this legislative body listened. I stand before you today to tell you our department is either moving in the right direction or we're holding steady in our divisions because of what you have done for our employees and our agency. Speaking of moving in the right direction, our employee retention is higher than it has been in years. With the $16,000 salary adjustments over the past four fiscal years for our starting sworn employees, it has increased our overall recruitment and retention for our agency. In December 2021, we had 769 troopers. Our position count as of December 2025 was 864 troopers. These are 95 additional troopers that have been able to recruit and retain for our department. For other sworn divisions as of December 2025, we currently have 222 commercial vehicle enforcement officers, 22 capital police officers and 147 dispatchers. The decrease in open positions is a large part due to the support we've received from Governor Kent, First Family and this legislative body. The salary increases have helped give our employees another reason to continue to call DPS their home. To bid on personnel, DPS would not exist if it were not for our incredible and dedicated employees. They are most treasured and valuable asset. They are the best looking patrol cars in the world, but if we don't have them, employees to drive them, what good are they? Our employees have become guardian angels of our state, the merciful and benevolent protectors of public safety. They will set the mission of DPS and they rose to stand between good and evil. They stand tall in the face of tremendous adversity, provocation and challenge. I'm here to tell you I've been on those front lines with our employees and it's not an easy task to be the one who stands between normal life and other chaos. I think we can all agree this has been highlighted over the past years. Their continued dedication and their profession is to allow citizens to sleep peacefully at night and go about their daily activities. We all know they will never be sufficiently compensated for the heroic deeds and was asked and demanded to them, but what they deliver is priceless. It's 1937 DPS is set to standard of what law enforcement agents should be. The legacy of our agency is in the hands of our personnel. They are the ones that are currently riding the next chapter of that legacy and is their responsibility to make sure the chapter they write becomes part of a bestseller. I want to assure you our command staff is committed to rewarding and recognizing our employees for their sacrifices. In 2021, Governor Camp came up with the idea of a crime suppression unit in Metro Atlanta. It's the creation of the 10 man GSP unit in the beginning of the larger multi-agency crime suppression details in Atlanta. They have conducted over 100,321 traffic stops, apprehended 1,345 one-of-person issued 1,220 reckless driving citations, taken 2,240 impaired drivers off the road, recovered 1,185 stolen vehicles valued at over 33.1 million dollars. The success of our crime suppression details in Metro Atlanta area has led to other police departments and sheriff's offices requesting our assistance in their jurisdiction. We have conducted successful crime suppression details in Albany, Blakely, Columbus, Cordillo, the cab, Macon, Savannah, Thomasville, Valdosta, and Warner Robbins. In 2025, our SWAT team handled 89 calls for service to highlight one call on the example of what they do on December 5, 2025. SWAT was requested by the DEA to execute two of four search warrants in Stockbridge. These warrants were related to a drug traffic investigation. I'll tell you what, eight people were arrested. 15 guns were seized. Seven of those were chambered. 1.4 kilograms of cocaine, 4.2 pounds of marijuana, and $3,000 cash were seized. Since April 15, 2021, we're again tracking apprehension of murder suspects, our specialty units that operate in the Metro area, including the SWAT team of apprehended 92 murder suspects today. None of those things would have been possible without our personnel. Working together, we achieved better results from providing safety to the citizens of our state. We greatly appreciate everything you've done and have a positive impact on our agency and our personnel. Your continued efforts and dedication have enabled us to achieve monumental feats, and we ask for your continued support moving forward. Our personnel still face a multitude of issues daily, and now it's not the time to come to complacent. Employment with our agency must be competitive in order to maintain and recruit quality applicants. It comes down to a simple decision, is it worth this to do that? The answer is no, they'll choose to do something else. Even though we've seen a significant reduction in these activities, law enforcement as a whole continues to struggle with a long-term effects of the defund the police movement of critical news media and people trying to use the justice system to promote their cause. While we weren't directly impacted by these here in our state, the psychological effect of seeing this on the national news certainly impacted our members. We're thankful for the support that you all give our agency. All of this has had an impact on personnel coming into or staying in this profession. As we have all seen, public safety is a 24-hour job. Our troopers work nights, weekends, holidays, and often get their days off cancel. Prime example of this is the anticipated need for extra personnel this weekend due to the winter weather forecast. The reality is that our troopers and officers miscountless family gatherings, birthday celebrations and children's events, because they understand the magnitude of the oath they took to ensure public safety. In terms of recruiting, it's important to point out that DPS is recruiting out of the same shrinking employment pool as our local and federal partners. Some agencies like ICE pay a $50,000 signing bonus and we have lost a few employees to ICE because of that. We leave there are three things that attract and keep employees out of an agency. That's pay benefits in work culture. I can assure you we're doing everything we know how to do to have a great work culture with the spread of core our agency has always been known for. For the time we've seen that as a number of troopers on the road increases, the number of roadway fatalities decrease. In birchley, fewer troopers on the road leads to more fatalities. Recruiting quality applicants is vital in providing our citizens with safe communities. I think it's a fair statement to say that with the power and responsibility given to members in law enforcement profession, this job is not for anyone. We see this time and time again to our trooper school training. In the training, the majority of people who start but don't graduate quit on their own. We continue to have stringent standards to ensure we hire the most qualified candidates. If you don't meet those standards, our agency doesn't want you in our ranks. If I stand before you today, I will personally assure you our commitment will always be to work hard for our employees of this department and the citizens of this state. We expect every member of our department to be leaders in our communities and leaders in law enforcement profession. Before we delve into the numbers portion of our presentation, this will remind everybody that in our society, there are those that answer the call to be protectors. Our agency has proudly served and protected during some extremely difficult times, and I'm proud of the men and women in our agency. They are compassionate, professional, trustworthy, and display the full attitude to do this job every day. They set the standard. We're thankful for the Governor's and legislative support that you provide us the last couple years budget process from the funds for the salary increases previously mentioned to the new radio system, additional K9 funds, and our bond funds. We've already highlighted the pay increases of huge reason for the recruitment and retention of our sworn members, but we also want to thank you for the funds we received in fiscal year 25 to implement our dispatcher career promotion path. In 2021, we're about to 126 dispatcher statewide. We currently have 147. While 20 may seem like a small number, they are the front line to our front line. They're often the first contact to the public has with DPS during an emergency, and most importantly, they are the lifeline for troopers and officers who control the loan. And our dispatchers also dispatch for several other state agencies. We don't have qualified and experienced dispatchers answering calls and ensuring troopers and officers are routed properly with correct information. We cannot meet the mission of our agency. We have completed installation of the statewide radio system. All nine communication centers have been upgraded to the TELX Dispatch software with new computers and monitors. We've also conducted successful test using Starlink as a backup network when deployed to areas that have no sale or radio coverage. We continue to be impressed with the implementation of our statewide radio system and its performance during most vulnerable times like Hurricane Helene. We currently have 52 DPS K-9s that are trained in a myriad of disciplines. In calendar year 2025, our K-9s conducted over 1,911 deployments versus only 703 years ago. Of those deployments, 176 resulted in felony arrest and 358 were to track individuals. Our K-9 teams have recovered over 1.7 million dollars and 1,308 kilograms of various drugs. The newest disciplines added to this program is apprehension of suspects through catching hold. This year we were able to floor our K-9s and apprehended 176 suspects. 30 of those apprehensions resulted in a catching hold of the suspect by the K-9. The ability to deploy the K-9s in dangerous situations provides a layer safety to the trooper officer we didn't have in the past. This program has been beneficial to our agency and we look forward to continuing its growth. Our bond projects, we have several projects in the agency that are ongoing. These include post-19 Swainsboro. DPS is developing conceptual design for building placement on the property. The Swainsboro Manual County Development Authority is surveying a 10 acre parcel and seeking release from the property from the FAA so it can be deeded over to DPS. The property is located on US 1 at State Route 57. Post 21 Sylvania, on November 19th, the bid for the new post located on US 21 was awarded to TQ Constructors and Site Work and Tree Removal began last week. We look forward to a ground-breaking ceremony soon. Post-32, Coney County, Sheridan Construction has been awarded the Site Work and Construction on the campus that will also include GBI and DDS on property. Last as far as updates and minutes 24 commercial vehicle enforcement division received the funds to update our way of motion hardware. We are well underway updating all 19 DPS waste stations. We have three that are fully operational with the new equipment upgrades, three stations that are currently in replacement phase and four stations that will soon begin the in-ground construction and equipment installation. This will give us seven to be completed by June 2026 for a total of 13 completed stations. The remaining six will be upgraded by fiscal year 27. Now I'd like to move to the Governor's budget recommendations for amended 26 and fiscal year 27. You'll find the Department of Public Safety on page 292 for the amended 26. We appreciate the Governor's recommendation for the one-time supplement of $2,000 for our full-time employees and field offices and services that transfer $1 million for the protection of community funds to GMO and line 2. We began working on the initiative with the House and Senate Liaisons and we're prepared to begin going live with the application online. We're happy to help transition the work that has been done over to GMO for a successful implementation if that is the desire of this body. We also support the Governor's recommendation to provide the funds for the ballistic helmet radio patches of $180,000 on line 3. We received the helmets and amended 25 and with the recommended funds this equipment will provide clear communication during our intense situations. It will especially be helpful as we prepare for protest as we plan for the FIFA World Cup events that we will help support. During the fiscal year 27, you'll find the Department of Public Safety's Governor's recommendations starting on page 294. For fiscal year 27, you'll see the statewide adjustments through all of our programs. You also see an increase to provide funds to enhance the retirement benefit for select post-certified law enforcement officers who are members of the G-SETS plan by increasing the employer contributions to that savings plan. We're in support of this initiative of the Governor. As mentioned throughout our presentation, retention of our sworn employees is the utmost importance and providing this change will encourage our sworn staff to maximize the amount they're contributing to their full 1K plan. Under this proposed plan on the employee's 10th year service, if they are maximizing their contribution, the employer contribution will be at 15%, a difference of 6% to the current retirement plan contribution. With this change, on top of the pension plan of all employees received, sworn staff will have the opportunity to increase their total 4-1K savings by over $200,000 by the time they retire with 30 years of service. Then in field offices and services on line 6, you'll see the same transfer of funds for protecting communities from DPS to GIMMA. Now we'll move to the Governor's recommendations for bond funds starting on page 380. In amended 26 on line 22, we support the $16 million to replace our DPS vehicles, and this includes the outfitting of equipment for those vehicles. This allows us to replace our vehicles when they're projected to reach 135,000 miles. On line 3, we also support the $15 million to design, construct and equip the new K9 facility at DPS headquarters property. With the growth of our K9 unit that now includes 52 K9 teams, we need a location within the state to conduct training not only for our K9 teams, but for other jurisdictions to use as well. The facility will provide training for various disciplines. These disciplines include odor detection, specialized need of narcotics or explosive materials, and we have the operational disciplines that include article detection, items discarded or lost by suspects, such as firearms, keys or other evidentiary items. Human tracking to locate suspects are missing persons by scent, and apprehensions simulation to utilize the catch and hold technique to safely detain a suspect until troopers or officers can affect and arrest. The facility would support the evolving needs of the unit and enhance readiness through the following features. A larger secure training area to ensure the safety of personnel, K9s and the public. A modified, well-shoothed house to support modern realistic training scenarios and prepare K9 teams for complex high-risk environments. A state-of-the-art boarding facility designed to properly house and care for K9 partners. Expanded office and storage space to meet the administrative and logistical demands of the growing unit. K9 conditioning and rehabilitation equipment support injury recovery and promote overall health and fitness. A large fence stand outdoor area for training, conditioning and daily exercise. Again, the K9 facility will not only support DPS, but we currently have 43 entities that are unit trains with. This includes DNR, County Sheriff's Office's Police Departments and two Tennessee Departments that would utilize the facility for training, exercise and any rehabilitation of their K9 statewide. Next, you will find our 2027 bond projects on page 389. Because in the past, we supported $1.4 million in major maintenance and repair for our facility statewide. We benefit from the annual MMR funds to maintain and update our 92 facilities that includes our post and waste stations as needed. On line two, we support the recommendation of 600,000 our aviation fleet, major maintenance and repair funds. This is a continued request from FY26, the aviation program budget funding is $5.1 million. And in FY26, it's projected that 72% will go to personnel, 17% to regular operating and 11% to general repairs and maintenance. These funds will help us upgrade some of the existing fleet equipment along with helping us cover any maintenance cost that is unforeseen during the hourly maintenance inspections that are required. On line three, we support the recommendation of 2.3 million to replace 400 of our tasers statewide. In fiscal year 2022, we purchased our entire sworn division tasers for a total of 1,230 units. Our plan going forward is to replace one third of our tasers for sworn members each year. We support the recommendation of $3 million for new posts in Lafayette Walker County on line four. This is based on an estimated cost for construction using the construction bit of the Reesville Post, which is the same floor plan. Post 41 Lafayette was built in March 1967 and DPS is leasing this site from Walker County Board of Commissioners for $1 a year. We did some renovations in 2007 and again in 2018. The bottom part of the post has some previous damage from the sewer water leak. This area is where the bedrooms in the kitchen are located and it has currently been stripped to just wood stud wall standing in the basement. Based on line 5 and 6, we are requesting $115,000 each to fund the furniture, fixtures and equipment needed for the new Swainsboro and Selenium Post. In the current state of law enforcement, the effectiveness of crime prevention and public safety is based on the law of supply and demand for personnel and resources. This is significantly impact of the ability to recruit and retain qualified applicants. In closing, I want to leave you with this. Members of the Georgia Department of Public Safety are never off duty. They have sworn an oath to protect public safety at any time in any place in this great state that we all call home. No matter the severity of the situation that arises since 1937, when the phone rings are men and women answer the call. I can assure you our troopers and officers do the selfless work of putting their lives on the line to protect our communities and keep each of you safe. Every civil unrest in our society, they frequently respond to or prevent crises completely without ever expecting any recognition. But I do want to thank the Governor and this legislative body for giving them the praise they deserve, even when no one's watching. I do want to thank everyone for your time this morning. I know your agenda is full from the third day in the road. So I try to keep this as short as I could be and I'm willing to answer any questions you may have at this time. Thank you, Colonel. I along with I'm sure everyone in this room and in this building appreciate everything you all do and especially when things might be getting a little out of hand in here and when a yodel appears in the room, it definitely makes you feel better and more safe. So Chairman Hitchens, I just wondered if you want to have the honor of asking the first question or I don't know if the Colonel's mama would have proved, but I'll let you ask. Well I'm not scared of much in this world but I'm scared of his mama and I don't want to ask him any difficult questions. As far as Gump said, I may not be a smart man but I do have a couple of questions. So you did have in one of the slides your goal or your ideal number of troopers was a thousand. When have we ever been in a thousand? No sir, we haven't. The closest we've been is in the 900s. Okay. That's your goal. Have you got a certain plan in place that you say I'm going to hit that this year and have you got a plan in place to tie that and try to get to that number? We do and we're moving in the right direction. We were very close to having 900 troopers this year. So as you see we've gone up 95 troopers in the year. We're still seeing a lot of interest in our trooper schools. As I stated our trooper schools are not easy so we do see a lot of attrition but we'll graduate hopefully about 80 troopers this year and that's what we're seeing year in and year out. So if we continue with our retention our numbers are going to continue to go up. Great. So if my memory serves me correctly and it doesn't always do that. In the past counties provided post locations and built the buildings to have you in their area. Have a trooper presence there. I notice we've got several line items for buildings of post and counties. Are the counties participating at any level in those construction laws? In these construction they do provide the land and some of them do provide services to get the land prepared.\n\nare paying for the actual building node. Okay, we may need to talk about that little chair and utility. You have any questions? I was going to go back to I know that's how we had done it in the past. And usually we used like community bids. Didn't we move them around a little bit? The community would decide that they wanted the increased throughput patrol there. So they moved to do that. Correct. I know we moved away on one time. And I thought we actually still did that on. Did we do that on the Jeff Davis facility? Yes, we still that is certainly still an option. Some of these places do not have the money to fund that. And we still have a lot of buildings that were built in the 60s. That cost us a lot of upkeep and renovation. Got you. Some questions. Let's start at the top over here, Chairman Robertson. Thank you, Colonel. I appreciate your presentation. Appreciate you coming in this morning. You mentioned on the K9 facility, there are 43 entities that will be participating with you and your team. Will they be contributing anything to the upkeep and operation of the facility? They will not. So is this something that we're doing out of the kindness of our heart to help support public safety and Tennessee and around the state of Georgia? What we do now is these groups train together already. So we do train in different areas. But they do come to our facility. Now we do not provide food. This will only have them in the building. They will not be getting any kind of money from the state to operate. It'll only be them utilizing what is built. Thank you, sir. We are here, Glee. Thank you, Mr. Chairman. Thank you so much for what you do and all your officers keeping us safe. My question has to do with training as it relates to dealing with those situations where there is a mental health concern or behavior or disability concern. How confident are you in that level of training for your officers? I'm very confident. Obviously things can go astray at a moment's notice. And we can't control every aspect of what's going on the scene. But our people go through CIT trainings. So they get that. They actually do and actually have people that have mental health issues come in and try and help them and show them ways that they can deal with people that have the same mental health issues that they do. But I'm confident that our folks can do that. I can't tell you that every interaction is going to be perfect because again, we can throw one side of that equation. We don't control the person that's got mental health issues. But our people are trained. Chairman Alvers. Thank you, Mr. Chairman. Colonel, thank you for the great work you continue to do. I'm not sure if everybody saw it, but isn't it true that you as the leader of public safety and our Colonel on holidays and our important events are actually out there on the road yourself, setting example, and stopping cars and really showing the entire state of Georgia what we're doing to keep him safe? Yes, sir. And it's not just me. That's an expectation we have of our command staff, our leaders, and our truth. How do we ask our people to go out and do things that we're not willing to do? And I can tell you, I get a lot of surprised faces when they say, tell your right stop them. LAUGHTER Chairman Hormison. Thank you, Mr. Chairman. Also, I'd like to extend my congratulations for doing a great job with the troopers and the professional attitude that they care about them. But in the area of that chairman had a question in the recruitment, is that a great advertising campaign with a military across the board? Just what's the extent of that outreach to reach that goal of 1,000 for your core? So it's a multi-faceted approach. We certainly use social media because that is what the young folks today are looking at. But we also have recruiters in each troop and region that go out to local events, either school events, recruitment events at colleges, anybody has. But we also have our personnel that go to military bases. And because traditionally, that has been a great source of our workforce. They're already trained. They're already have a discipline. So we send people, even out of state, to certain military bases to try and recruit them. And one of the big things that we get people from is just us being in the community. They see us places and want to be a part of it. But we try to hit all those avenues, and we do spend a little bit of money. We don't spend a ton of money, send them certain places we look at and go, we getting a return on investment by sending them certain places. But we do. We're very active in the schools, colleges, and the military. Well, thank you very much. I was going to ask another question. But I got a text from Chairman Hitches to let it go. So I'll give it a go. He's my traveling, buddy. Sorry. Chairman Goodman. Thank you, Mr. Chairman. I just, there's no saying that goes all y'all are welcome, but you got to act right. And the other one, majority of our citizens that come up here to have their voices heard do act right. But ever now, then we have something that don't. And of course, public safety is the foundation of any society. And I just want to tell you from the bottom of my heart that thank you for everything you do, because you all are the most important people in this building. You're more important than the governor, and lieutenant governor and speaker. And everybody in this room, because I'm just going to say it, because we could not do the work of the people without you. And I am grateful for it. And I will say that I think that all those people I mentioned, including everybody in this room would agree with me. So we're very thankful for you. Thanks, sir. I'll take the compliment, but I might not comment on it. Thank you. Amen. Repson of all Williams. Thank you, Mr. Chairman. And Senator, I know you're not running for anything, so forget it. The middle health issue was answered. But I didn't want to ask you. You should support for several localities all over the Georgia's backup. I've noticed this become quite popular. There are a whole lot of stars on shoulders. And I've seen some five stars. And we hadn't had one of those in the Army since World War II. You go in as a Colonel. Do you ever have to salute all these stars we have all over Georgia? No, sir. I do not. Oh, right. Got a couple more questions. I think Chairman Lee Anderson. Is that right? Colonel, thank you for what you all do. You all do. Make us feel safe. You all truly do a great job. I want to thank you for taking after your mother. But at the same time, I say the next five years. I know the goal is to get where you want to get to employees. But do we have very many that's going to be retired? Yes, sir. We do. I mean, we have where at the age of my age group, there's still a lot that can retire. What I will tell you though, just for our true preside, we have 57% of our employees with nine years or less. We are a very young agency. 52% with CVE, 77% with capital police, and 80% of our dispatchers have nine years or less. So there are a lot of people that are very young in our agency. But we do have something that we'll transition to retirement. It's not going to be a full-out exit. But we'll have a regular attrition that will go out. Chair, one of them, Don Zell-Jones. Thank you. Colonel, would it help if you could already identify that someone has mentally challenged or have a handicap as in a car that you're stopping? Would it help? Anytime we have more information going up there, it would help us understand why a person may be acting the way they are. I know there are several programs out there that try to have some kind of sticker or something that shows things. But anytime in our situation, more information is usually better. OK. I know that it's several pieces of legislation that one identifies on the tag that someone may have autism or they act out when they get nervous and they pull them at the car or so this would help to make sure they don't get hurt. And that's part of that training we go through. But it takes time to understand what you're seeing. So if you knew that, go on air, I mean, it's just like any time we get the more information we get on a call, it helps us formulate a plan as we whatever we're attacking. So it gives us information to either handle it this way or handle it that way. So anytime we get more information, it would be beneficial. OK. I know the other one is to have identification on your driver's license. But to me, is that after the fact? Because you already pulled them all. Well, you know, any information will be good. Part of the problem I would see with that is I'm sure you all have seen a lot of videos that people do not want to hand over their license. So is it? Do you create a problem before you get the license? But either one would help us just have more information. All right. Thank you so much. Chairman Carpenter. Thank you. Colonel, just a quick thought. I know there's been some concern around the nation about people with CDLs that maybe we shouldn't be allowed to drive, especially in the state of Georgia. And my question is, can you address maybe some thoughts on putting folks at waste stations at the edges of the state just to make sure that those folks are in our state driving? And really, more than that, competing with our trucking industries that's driving down across so they can't make a living. And we do some of our CVE side of our agency really is working hard. I've been amazed at the number of people that they are getting out of CVEs that are not licensed. And it is shot now. It's mostly in the middle Eastern or Middle European that are coming that I would have thought that would not be our major thing, but they are pulling those out. We have any time they come to a waste station that are required to have an officer there. And everybody that was eligible to do the 287G training with ICE, our apartment did that. So they have that authority to do it. And again, anytime you come into a waste station, an officer has to be present. So we have that capability already there. Colonel, one of your alumnus, Chairman Lomston. Thank you so much for carrying on the tradition of our great State Patrol. You mentioned something earlier that I wanted to see if we could get you to expand on accidents, injuries, and fatalities are major drivers when it comes to the insurance premiums that we pay. You said that for every trooper that we added, you saw our reduction in fatalities. Can you expand on that a little bit as far as it relates also to accidents and injuries? It does. And we're seeing that this year, it's a trend. And this is not new. When my father was here, they had this same chart, and it showed the same trend. And my thoughts on it are you have police departments and sheriff departments that are out there doing things, but they're handling calls as well. So when they get overrun with calls, what do they lose? Traffic enforcement. So as you put more troopers on the road, that is our main function. So you have somebody dedicated to do it. So you were having people in four straffing laws consistently when you have more troopers on it. And I'll also say knock on wood, getting away from the protest that we were seeing. Now our people are actually doing the job that they were designed to do. And I hope we can stay in that same vein. But we were down pretty significantly this year, about 15, between 15 and 20%. Well, I'm very pleased to see the increase in the numbers. I remember we were having trouble maintaining 700 for many, many years. Yes, sir. This is a very positive direction. And I just applaud you for your work and to continue to see our numbers grow. Thank you very much. Colonel, there's two more questions. Reps and a Reese. Thank you, Mr. Chairman, Colonel Hitchens. I was, thank you for your presentation. And thank you also for what you guys do for us. Really appreciate your service around the state. I was looking at your dispatch numbers. And I noticed on that chart that there's an upward trend. As you deep dive into those numbers, and I'm sure you do, is there a particular category that seems to be driving that? Or is it commiserate with the population increase? Or what type of insight do you have on your dispatch numbers increase? Well, I will tell you that we saw that, despite once we did the dispatcher career path prior to that, you got hired, you got a pay raise after one year, and then you didn't get anything unless you got promoted. So now there's some steps in there that gives them a future. So we saw that number go up at that point. But you also have to remember a lot of females do that job, and is a good job for some of them without kids, but they work a rotating shift, nice weekends, holidays. So they compete with other jobs that are Monday through Friday, nine to five jobs. But that is when we saw our numbers go up, when they got a pay increase in a step ladder. And what about the categories of the calls that you're sending? Some of that is just the population in our state going up. Some of that is also, we've added a few state agencies that have come on that they dispatch for now. But I would say the majority of that call is a number of the population going up and a number of troopers on the road that they have more people doing more work now. The best for last. Chairman Hitchens. I promised I wasn't gonna say anything here, but we talk about troopers straight. I went on the sacred road in 1969 and we had 700 troopers. Most people have no idea that all the states around us have over a thousand, even though some of them have power of size and population in geographical area. Nationwide, we come in last in troopers per capita. We have eight troopers for every 100,000 people. The national average is 24 per 100,000. So in order to come up just a national average, we would have to triple the size of our department right now. I wouldn't say that's an interesting note to close on. Thank you, Chairman. Colonel, thank you. Is again, thank you for all y'all do and thank you. And I know you're gonna have a busy weekend and we appreciate all of those. It will be out in harm's way, taking care of us. Thank you. And we did put some information if you need to call a patrol post or something, it'll be in the mail room to be distributed out. Thank you, Colonel. Thank you all very much. Our next presentation will come from the Georgia Bureau of Investigations, Director Chris Housie. Thank you. Thank you. Thank you. Director, welcome this afternoon. This is your third. Is this your third year, fourth year? Third. Yes sir. Thank you for what you do at the Georgia Bureau of Investigations and the floor is yours. Thank you sir. Thank you for allowing us to be here this morning and first off I couldn't begin without thanking the men dedicated men and women of the GBI across every division close to a thousand employees throughout our agency. The success of what we do each and every day is directly associated with their dedication to professionalism and worth it, work ethic. It has nothing to do with the director sitting in that chair. It is all dedicated to the men and women of the GBI. And due to that and in my goal of keeping our agency at the level that it is, we look at our operational challenges that we continue to look at each and every day in address. Many of these challenges are addressed in the Governor's Budget Recommendation and GBI's Operating Budget and Capital Projects are in line with a strategic plan that we have for this agency. We want to continue to maintain appropriate staffing levels. Currently our overall turnover rate throughout the agency we had a slight increase from 5% in 24 to 7.3 in fiscal year 25. There's a variety of reasons for that depending on which division of the agency that we go into. The Crom Lab scientists role that we hire for is different than any other scientific position in state government due to the expertise that they're required to have testifying court accreditation standards and so forth. But we continuously work throughout the year to ensure that any vacancies that do come up that we're working diligently to get those fields so that the work product does not slow down. The complexity of our cases continues to increase required us to continue to hire, retain and train staff and specific skill sets that can meet with the ever changing environment that we face in law enforcement. Along with our workforce is ensuring that our infrastructure within the agency has been addressed. Many of those are being addressed in our capital projects and facilities with a medical examiner office expansions at our headquarters facility and our making facility in middle Georgia. Along with working towards expanding the Crom Lab at our making facility as well so that services can be expanded and some services brought back to that lab that we lost some years back. And then regional investigative offices working through the build out of our region 11 office that is in Athens that will be going to Ocone County, Sharon property as a colonel mentioned with GSP and DDS. And then our region 10 office and it let covers the metro Atlanta area actually located in Conjures is getting a facility for them as well. And then lastly is the technology challenge and updates that we face each and every day with the change in world going on around us our GBI systems in the investigated division Crom Lab, MEO office, our C just network continue to evolve with increasing complexity when it's dealing with technology. But our staff is stepping up to answer that challenge but also looking to see what technology is out there that can better help us to better do our job be more efficient in the areas that we operate as an agency. In section 30 of the appropriation bill page 235 is the governor's budget recommendations. We appreciate governor's camp governor camps recommendation on a one time $2,000 salary supplement for state employees. And then the other statewide changes that are mentioned there GTA telecommunications infrastructure, DOAS premiums, changes state health benefit changes Georgia at work and teachers retirement which we have one staff member in the investigated division that that would affect there. Under our bureau administration number one funding for security contracts at our pool or lab and headquarters that's 144,168 for FY27. The GBI headquarters entrance in the security fencing around GBI headquarters will be reconfigured. It will be a one way in secured entrance with a guard posted at that location to help better secure our facility. Our main campus we have had some issues in that area in the past and we want to ensure that our employees are safe at work. These funds will also allow us to put one security guard along with that project at headquarters to add to the current security there but also to add one security guard to our pool or Crom Lab. That currently does not have a security guard there. The facility is built for there to be one but there's never been one assigned there and we have had some concerns coming up at that lab where we feel it is appropriate to put a security person at our pool or lab. Our C just criminal disinformation system 266,556 for FY27 involves disaster recovery for our C just system. This will allow us to comply with GTA's business and continuity disaster and recover policy by providing an off premises disaster recovery solution. Meaning we would have a backup for the critical systems that we have operating within GCI C. They include the GBI secure file transfer portal which contains such items as license plate reader information camera system information. It would also be a backup for our Georgia law enforcement message switch Georgia protective order registry the sex offender registry and computerized criminal histories. Under forensic sciences and services the number one would increase funds to replace software that allows for efficient connectivity to our federal DNA code of database. The governor's recommendation which we support includes funds for software licensing. It is for STAC STACS is the acronym sample tracking and control systems. This software will create more efficient operations in resulting quicker processing of offender samples from submission to upload into FBI codeus the combined DNA index system database. For FY26 include 618,170 and 1 time software cost and 74,920 for FY27 27 in ongoing maintenance costs. The current system that we have that does this activity or performs this activity is actually two systems and they are both outdated at this time. This system will add efficiency to that speed and allow our our crime lab scientists to be more efficient in the work in getting that information uploaded quicker. Number two would be to reduce funds based on hiring dates for new positions that's at 163,345. And if what 26 we receive funds for two new crime lab assistant managers to provide a better span of control and lab operations those positions were hired one on July 1st of 25 in the second one on August 1st of 25. We also receive funding for three positions at our central lab in Macon. One scientist was hired on February the 16th. One lab tech will start on March 16th and one evidence receiving tech is currently in background with an expected higher date of March the 1st. And FY27 would be to from in FY27 be to eliminate one time funds for three handheld portable mass spectrometers. That's at 327,546. And FY26 we were we received one time fund into purchase three handheld portable mass spectrometers. This was done into aid to aid in a preliminary reporting or preliminary testing project that we started back in the spring in our crime lab to reduce the backlog in drug chemistry. And I will mention while I'm on drug chemistry that our current backlog for drug chemistry which is the highest is at 69% with the efforts that have been made with new projects like preliminary testing and and putting scientists on the bench and just the hard work that they're conducting in that section of our lab. Our backlog rate was at 78% back in the fall so we've dropped it almost 10% or a little over 10% since then almost 10% since then so I'm proud of the work they're doing there and addressing that. And regional investigative services to annualized positions are heat unit which is our human trafficking unit in FY26. We have had six months of funding for three sworn positions that supported the human trafficking unit and their efforts across the state. The governor's recommendation which we support provides the annualized amount for both FY26 and FY27 that's $294,000 for FY26 and $287,300 for FY27. Also within this slide in annualizing the positions is in FY26 we had funding for nine months for criminal and tail analysts that were previously funded through a grant. That grant funding expired in August of 2024 due to CDC no longer being eligible to receive that grant and they cannot sub-ward the funds out. That grant requires to have a victims program assistance program which did not qualify us for that. The governor's recommendation provides to annualize that amount in FY27 for $171,841. Excuse me. Also to provide funds for three special agents. In last year we received funds for electronic surveillance equipment platform. That equipment is currently in production at this time and should be delivered hopefully very soon. In T&E and of that equipment when we were looking to purchase last year we utilized it on nine different investigations and we had nine successes in utilizing that equipment. These positions mentioned here for FY27 which is $543,750. They would be utilized to be assigned to that equipment full time. I will add that we were able to utilize some grant funds to purchase a second platform for this electronic surveillance equipment so that we can have one in North Georgia and South Georgia. But due to the technology of that equipment the upkeep of it the knowledge of how it operates we needed to fund or put assigned special agents to that equipment full time. I think we will see a benefit of it not only through our agency but also in assisting our partners across the state. And so we appreciate that support from last year. Also number three to reduce funds for personal services based on actual start dates. We had three digital forensic investigators. One was hired January 1st and the other two were expected to start in February and March of this year. Based on last year's funding FY26 we did hired two strategic threat assessment group agents. Stagged for short that are assigned under our G-SAC unit and two crime scene technical leaders. They were all hired on July 1st of 25. We also were able to fill four criminal and tell analyst positions that were transferred off the grant to funds this past fall as well. Also under regional investigative services with our statewide gang case management system. And FY26 funds were provided for developing an API to connect formula lyrics to the GBI's current criminal street gang database.\n\nThat will be a takeback of $800,000. In FY27, local law enforcement grant funding for the gain case management system will be transferred back to GEMA. That will be in the amount of $1 million. And then lastly on this slide, the one time equipment eliminating funds for one time equipment purchased, that was for the surveillance platform that I mentioned earlier, which was at $877,320. In our forensic scientific services, the GBI currently has a total of 19 medical examiner positions within the agency. 16 of those are field right now. 12 are located at headquarters, two at Pooler, and two at our Macon Lab. We do have three vacant positions for our medical examiners. Those are two at headquarters and one at our Pooler Lab. We currently have one part time doctor at Pooler and paying supplements to our headquarters doctors to help cover Pooler and Macon Labs when that is needed. In 2024, the number of autopsies that our medical examiner's conducted was 4,353. That is 329 autopsies per doctor, which is still above the national average of 250 autopsies per year that is recommended. In 2025, our number of autopsies dropped a little bit to 4,220, but that equated to 272 autopsies that our doctors performed, each doctor, per doctor in 2025, which is getting us closer to what the national average should be. And I attribute that in part to us being able to put doctors on due to many programs that were supported by the governor and you in this room here today. In the past year, we have hired two doctors and nine death investigation specialists. We also hired one child fatality review program manager and one as admin assistant. Three of our doctors that we currently have applied for the loan repayment program, which has been a success to help attract doctors to our agency. This will continue to increase as we hire more fellows who complete their training program. Our child abuse and death investigation unit is now fully staffed with a unit supervisor in three pediatric focused death investigation specialists who will remain, or who will streamline our child death investigation process and work closely with our child fatality review unit to improve child fatality prevention. Some other good news from our Emmy office is since starting October, in October of 2025 this past year is when we hired a forensic anthropologist. That doctor has completed 40 cases already, improving our turnaround time and identification of unidentified remains and reports on skeletal remains. And she has also provided consults to our crime scene specialist unit, which obviously comes into contact with unidentified or skeletal remains quite often. Our GBO, our excuse me, GBI Emmy O Fellowship Program is currently in at sixth year, and including this year's fellows has trained 12 forensic pathologists. The fellowship program has proven to be very successful in eating the state of Georgia and high forensic pathologist as six have been recruited from that program to full time Emmy positions at our Emmy office and GBI. We currently have two fellows in the program now and received 15 applications for the 2728 fellowship year. And we have narrowed that down and have scheduled 11 interviews to choose doctors or to choose fellows for the 2728 program. Currently we have 221 crime lab scientists on the benches. We have 24 vacant positions within the crime lab in the different disciplines. We are currently in the process of filling 12 of those 24. They are in what we refer to as critical higher positions being drug chemistry and biology being our two highest backlog areas. Our strategic threat assessment group that this body helped and the governor helped start last year in fun with agent positions. Their goal, the goal of the strategic threat assessment group, which is located under G-SAC, our stag for short is basically to mitigate threats. Threats to this state, threats to its people, threats to our public officials around the state. They look at mitigating these threats. They examine critical infrastructure, challenges or threats. They triage threats to public officials and intellectual properties. In calendar year 2025, there were 80 event support activities that our agents from the stag unit were involved in. There were 55 threat incidents that they were took place in. 23 tabletop exorcisms or briefings that took place. They assisted and worked along with our state partners on 46 visit or protection details in the state for a total of 204 incidents of activity that that unit was involved in. They are also utilizing drones and drone work in our investigations within stag but also throughout the investigative division. We've conducted 92 flights this past year for public events, high risk search warrants and major criminal case surveillance threat assessments and training. We currently have 35 drones in our fleet with 25 pilots. They are assigned to our crime scene specialist, our regional drug enforcement officers, our gang task forces and Georgia information sharing and analysis center G-SAC, which they are being utilized by the agents that are assigned to the strategic threat assessment group that I mentioned earlier. Our criminal street gang activity in Georgia, our gang officers are located in Atlanta or Conjures, making for our middle Georgia gang task force and Columbus, also for our West Georgia gang task force. The success of those three units right there are partnerships with local state and federal agencies here in the state of Georgia. Analysis of 235 gang investigations for calendar year 25. There were 90 gang cases. 21 of those were gang motivated, 76 were gang related or had gang ties to them. And other cases with gang, gang related or gang motivated designations were at 48. The gang unit in this and calendar year 25, the gang units arrested 286 individuals arrest by other GBI work units was at 85. The reason there were others is all of our work units across the state, our 15 regional offices, our four drug enforcement offices and specialized units are designated with it was at least one agent that is working as a regional gang specialist in their area or territory. And we currently have 25 that are designated as regional gang specialists across the state. Our gang related and motivated intelligence and analytical cases worked by G-SAC for this past year, which is our fusion center was at 193. Drugs in narcotic seizures was over $21 million over $68,000 in firearm seized and over 19,000 in vehicle. Grand total of seizures by these units was over $22 million for the calendar year of FY 25. Our officer involved shootings, which we are typically the agency this requested to investigate any use of force incident. In the state, we investigated 102 use of force incidents in 2025, 83 of those incidents involved, officer involved shootings. While 19 of those involved were non-fire-arm related use of force incidents such as blunt force trauma or impact weapons, tasers or OC spray. Our region 10 office in Atlanta or our Atlanta field office worked 36% of all the use of force investigations for calendar year 2025. That's 37 out of 102 of the cases. 43 of the 85 also involved shooting incidents were worked by Atlanta office in 16 of the 19 non-fire-arm related use of force incidents were investigated by them. Roughly one third of the use of force cases involved a potential mental health issue of those that we investigated this past year. I'll close by again thinking the men and women of the Georgia Bureau of Investigation. I think each one of you here today for your support of our agency. I also wanted to mention the strong partnerships that we have with our other law enforcement agencies. You heard from Colonel Hitchens just prior to me, a very strong working relationship that we have with him and his agency. And our other state agencies, our local agencies, our federal agencies here in Georgia because I believe it takes all of us working together to get the job done and we've had great success with that. So with that, I will stop and be glad to answer any questions. That again. Thank you, Director Whip Roberts. Thank you, Mr. Chairman. Thank you, Director. I appreciate the hard work you're doing and women are doing. I'm especially impressed with the threat assessment group and the work you're all doing there to keep us safe here in the state of Georgia. Couple of questions. The drug chemistry testing is 69% of the backlog, is that correct? Yes. And what's the majority of that do you know? It's going to be a mixture. Some of it is going to be marijuana because marijuana is a little bit harder to test because just in preliminary testing, we can tell you that it's marijuana, but it could also be hemp. But then we've got to go further to determine the THC level within it. The preliminary testing project that we started back in the spring is mainly focuses on our cocaine's mass, our powders, for lack of a better way of putting it. Because we can test those. We can provide the prosecutor with a result based on mass back and gas chromatography to say, this is what the drug is that you're dealing with. Is manpower or technology the reason that we have the backlog? It is a little bit of both. It is a little bit of both. When we have been able to go to different ways of doing things, this being one of them. And I'll give you an example when we started the preliminary testing project after I met with prosecutors across the state because I wanted to make sure it was something that they were amenable to. We started out in the first trial, if you will, with two judicial circuits. Both of them had backlogs close to 900, just backlogs. They were completed within a month of each other. Backlog was gone and we were doing preliminary testing on new submissions that were coming in. So that project is we continue to roll it out across the state because there's some training that needs to go with it. It's a little bit different so we need to get people used to it. And it doesn't fit every situation. So we know that there's times it's not going to fit. But it is continuing with ideas and furthering our technology and how we test drugs and how that process works. But it's also putting people in seats that we need to continue to do. OK, and the use of force investigations that your agency conducted were those just local law enforcement agencies county and municipalities municipal or were they also state agent, other state law enforcement agencies. There was some state involved. Was the Department of Corrections, do you all do the use of force investigations for DOC also? I would think it has to do with the situation. I don't recall one run off the top of my head for this past year. Typically the criteria is death, fear is bodily injury. Unless there's some other unfortunate circumstances within it that we need to get involved. I don't recall us doing one for GDC this past year. But I need to check and confirm that. Thank you, Director. Thank you. Chairman Petrie. Thank you, Mr. Chairman. Thank you, Director. Good work, y'all do. You and all the men and women at the GBI. I do want to thank you. I see the 70's right at 75,000 for upgraded DNA software. Very important for us to swiftly find perpetrators of crime, also solve cold cases. But I want to ask you this as we talk about updating DNA software. So ISIS directed has arrested seven people in George in the last six months for murder. Those murders were not largely committed in Georgia. There's a rest from it in Georgia. How robust is this most updated software to capture individuals that when we don't know who they are, they may be from other countries? Can you speak to that, sir? Thank you. My understanding of this software here, it is the first stage of even being able to take a sample, to enter it, to develop a profile for it. So it is not going to assist in what you're specifically referring to. In getting DNA to a point that it can go into CODIS, my weak understanding of science, if you will, there are several steps that take into that process. This is one where the initial entry is being made into our system that gets the ball rolling so that a profile can be developed that can be entered into CODIS. So there's many steps. And this is one where we need to just improve the efficiency of what we're doing. Right now we have two instrumentate piece of instrumentation that are doing it. Neither one of them is the same. So to, I guess, split hairs here for me to train a scientist to utilize it, I've got to train them on both. That's one disadvantage to it. Where now I can train them on one. Plus the systems that we have in place right now are well over 10 years old. Chairman Burns. Thank you, Mr. Chairman. Thank you, Director. Appreciate your service at the GBI. My question revolves around crime labs. I represent Levin counties in East Central Georgia, and Richmond and Columbian Burke, very experiencing significant delays in response to our top sees in crime lab reports. We had a crime lab in Augusta. You still own that facility, and it is still available for use. What are your plans to respond to East Georgia's needs for more reasonable response and reduce cost? Because the travel cost is killing my folks. Yes, sir. You're exactly right. We had a medical examiner's office in the building with our crime lab in Augusta. That side of the building was closed several years ago, is my understanding after that doctor retired. Some of that space has been now utilized to expand crime lab services in that area or at that lab. And we have continued to do that. I do not miss the fact that it is a long drive from Augusta area to bring a body to our headquarters facility. With turnaround times that you're referring to, what helps with that is our having doctors there to do it. But I know the benefit that it would be to bring a medical examiner's office back to Augusta, but it would take some build out of the current building to do that. It would take at least we've estimated two doctors and staff to be there. As I recall, bodies coming from that area is somewhere around 9 to 11 percent that are coming from the territory that in the office covered that is now being brought to our headquarters facility. I'm looking every day, thinking every day to be an agency that is providing better service to our customers out there. And I feel you pain on that one. I appreciate your consideration. Thank you. Just to remind the members, we did try to do a partnership with Mercer University to create more medical examiners. Our issue director is we turn out what, 40 a year, and we need about 400 a year medical examiner's. There's just, we are trying. And director in that vein, I know the partnership with Mercer didn't work even though they tried very hard to do it. If you see a different avenue that we can do with another school or in the center out of the state at this point, we're interested. What I recalled about the Mercer program was one thing that it did was it guaranteed I want to say three years for them to stay with us after completion was done. So that really helps with our projections as we move forward. Even with the fellowship program, I can estimate how many doctor positions we would have that would go through that fellowship program. Not all of them make it. Some do not want to stay. So it's our job to ensure that they do if they're, if they fit us is the big thing. You got a bunch more questions, so I'm going to try to hand it back. Reps in a bear it. Thank you, sir. The latest from the investigative, investigative division responsible request from criminal justice officials to investigate major crimes. But crimes against the elderly can be initiated without request. We have an alarming increase in financial crimes. And financial crimes tend to be geographically agnostic, often against perpetrated against senior citizens. And I'm just curious, are we, does your budget include adequate resources to preemptively go after and look for these things that are happening this year along we've had several major Ponzi schemes. That was a conviction yesterday for a $340 million Ponzi scheme. I'm just wondering, do we have enough money in the budget to preemptively start looking for these things as opposed to waiting for a local jurisdiction to actually report them? Right. Well, I'll say that we can always use more. There's no doubt about that. But currently our field offices are trained to work those kind of investigations along with our cyber unit in Augusta. They do a great job on helping track the money. The problem that we run into a lot of times is a delay in reporting that information to law enforcement. So if it is some sort of scheme, Ponzi scheme, or whatever it may be, time is of the essence that law enforcement, whether it be us, the feds that we work closely with on a lot of this are locals. Know about it as quick as they can so that we can get the proper authorities and proper individuals on that before that money disappears across our oceans. Chairman Alvers. Director, thank you for the great work you and your team do. Last year, we worked together to get those portable mass spectrometers. What is the feedback been for our local district attorneys and others who might be the benefactors of having those out and about in the state? Right. So currently the way where we are with the three portable mass spectres is we are working on doing the training with the manufacturer of the vendor only. My goal with those is because with the portable mass spectres, it is one sample test that can be done at a time is for our crime lab scientists to get very comfortable with how they operate, which it's the same technology, just a different application to it. And then I want that I'm having them write the protocols of the guidelines on how to use those portable mass spectres in the field. The next step from there is we will then push those out into our gang units and our drug offices across the state in hopes of that that preliminary testing can be done there. And evidence may never be submitted to the crime lab, which now cuts back on our submissions. To attack it from a different angle is what we started doing in the spring of this past year where the crime lab using the same technology is doing back samples of drugs where they can test more than one at a time. That's what's helping us not the back log down currently. Plymminary testing plus the use potentially of portable mass spectres in the field, which then I would love to see it go to our local law enforcement agencies around the state as well too, because it would save them time and money as well. Is that would be the next prong of trying to address this getting our chemistry drug chemistry back log down, but also addressing so that we don't have another build up or another way of it. What is the expected timeline for the training to be done and then those devices to be out with the local offices? I'd like to get you a timeline on that. The vendors came down and met with our crime lab scientists with the three that we have. It was about, I want to say, in November. And the next step is to have the training with the manufacturer on it. And then for our crime lab scientists to do the validation and testing that they need to do to get comfortable within our accreditation guidelines. And at the same time, writing the protocols for our work units currently that we can then push those out and get to go with. But in the meantime, what's taking place is this preliminary testing through our current mass spectres chromatography within our labs. That is batch testing, which we're testing a bunch of the, a lot at one time. Thank you. Thank you. Members, there's quite a few of you that have your buttons pressed. But I'm going to, this is going to be the last question. Chairman Hitchens. Well, first I'd like to thank you, director, for the pooler crime lab. I work very hard to get that property. And it's, I receive accolades all the time from the law enforcement community because it's so easily accessible. They're at I-16 and I-95 and the 20 year-so counties that they're, have to deliver the evidence are very appreciative. I've got a couple other questions. And one of them is DNA. And Chairman Williams in the Senate, when he was in the house, worked together a long time on the DNA. And how many people we solicit DNA from? You know, there was a revolution in law enforcement back when fingerprinting began. And one of the reasons that it was so effective was everybody got fingerprinted. Everybody went in the military, got fingerprinted. Everybody had got a job. And government pretty much got fingerprinted. Everybody that got arrested got fingerprinted. So they had a real database to go by. I've been in the FBI's headquarters complex where they do DNA. And they did it by hand. They have the ability to segment different types of fingerprints. They're about four different types. And they hand located and picked it up. Over DNA is much more effective. And in Georgia, the truth is we only take DNA samples from violent criminals. A lot of misdemeanor criminals, low profile criminals, burglars, peeping tombs, some people from minor sexual offenses, they don't give DNA. And isn't it true that we probably get more hits on DNA from other states who take more samples than we do from Georgia? I don't know the exact number on that or an accurate answer on it, but I'll say it does happen. There's no doubt about that. Well, he's got a bill now that we started on last year. And I've been a real advocate for it. And I think with the advances in DNA, particularly now, we're familiar with DNA that resolved the case in Idaho, where the kid went back to Pennsylvania. And they ran his DNA and realized that somebody in that family was responsible. And in the FBI went to some paper out of his trash can and found out that he was going to be his son, who very obviously had been there and come home. And I don't know if they would ever solve that case if that meant for that. So I'm hoping that we can do something about that. And the other thing is with regard to the crime lab and particularly the chemistry people. I know back a few years when we had two army bases here, they had an army crime lab here. And after we get somebody that gets hired by you, this got a mastery in some scientific field, it takes like 16, 18 months to train them up where they can actually perform by themselves. And it was a problem back then because the army would solicit them. And they would go over there for more pay and do have to work. Is that still ongoing? It's not as bad as it was. And a lot of that has been due to increase in salaries. The ones that we're losing now, and I asked our crime lab director, they before yesterday about that. And I mean, I read the exit interviews and so forth. And he said, it's easier to ask why people are staying versus why people are leaving. And the ones that I have looked at that are leaving the agency is not so much going to the federal labs. A lot of it is, I'm not from George. I want to move back to the state that I was raised in. Some of it is this is not what I expected. I want to change career fields altogether. What I look for in those exit interviews is are we not doing what we should be doing to take care of our people within the agency? It's best I can't. When I see those, I get concerned. And the pay is a big thing to all of them. But I still can't, as I was asked one time to put a price on a GBI agent, and I said, I can't do that. Because as soon as I do, I've told you how much they're worth. And they're going to be a lot more, a lot more than what I just said there. But that does help. When they know they're appreciated in that they're doing more work and they're making sufficient pay for that. There's no doubt. And I really appreciate the both medical examiner and pooler. Now we have a lot of orthopedics performed in the Savannah area and there for a while when you were having to sense somebody down from Atlanta or all the bodies up there. It was really difficult on the local law enforcement agencies. And I also applaud here for the fellowship with the medical college of George. And I heard you say earlier that you had more applications than you could handle. And a lot of people don't know. There are about 500 medical examiner positions, certified medical examiner positions in the United States. And there are only about 400 registered medical examiner. So it's a very competitive position. And people go where they want to go. And they go for the highest pay. And we don't pay what's competitive like we do in any fast of the state government with in the private sector. But I think we've gone a long ways. And I certainly want to try and get one of the gusts of two. I don't represent the gust area. But I know some people to do. And it's really difficult to haul somebody back and forth from a gust of dead bodies. Paying somebody to go up there and pick them up and take them back. And just to note, when I was chairman of public safety, no man's security, I took my video with the GBI. And we went through everything in the crime lab. And I was astonished. I'd seen many orthopsies. But I've warned some of the people before we went in there that they didn't want to go in. They didn't have to. But they had five people on the table in there that they were doing orthopsies on. And I know that's coming. And I was just astonished that four of them were very young people who died as a result of drug activity. And it's a cancer on a society. And I appreciate all you're doing to try and alleviate that. Because the people that went with me were just stunned. That, you know, 18, 19, 20-year-olds and they're getting the orthopies for overdosing on drugs. And thank you for what you do. Your deputy director has been very responsive a lot of requests that I've made to him. And he seems to jump right on it. I wish he worked that hard, but he worked for me. LAUGHTER Chair, thank you, Chairman Hitchens. And director, I don't know if you had a recorder to answer all that, address it. But if you'd like, we do have a little unscheduled, special guest here. So if you'd like to answer, try. Go ahead. I'll do my best. But I didn't know if there was a question in that. Did the buzzer... Thank you, director. Thank you, director. Colleagues, you may not want to go anywhere. You may want to continue in your seats. And not move. It's my honor to introduce, not a guest, not a visitor, but someone who cares deeply about this state. And us, the gentleman from Effingham County, the speaker of this house, the Honorable John Burns. Thank you.\n\nis my microphone on Mr. Speaker I've been having trouble with this button all day but it seems to work at the most in-op routine monies. Who knows and maybe the opportunity I don't know you never can say hey thank you all members and interested parties for being here the last few days and making sure you can be a part of this discussion with some very talented Georgians who lead our state and ensure that we are protected the last two were very important to us as we all know in public safety I'm impressed y'all very qualified folks Mr. Chairman former commissioner I'm glad things have moved on since you left there so they've done a good job but I just you all know what I know it is always a great day to be a part of being Georgian be a part of what goes on in this state but the work you you guys are drilling down and about we look forward to all continuing that work to make sure we take care of our only mandated number one task and that obviously is our balanced budget so we look very much forward to working with Chairman Hatchett and his team Chairman Tillery and your team to ensure that we we get our job done because we're here to get a job done and certainly that's what I would ask all of you to do to keep that focused we take care of what we're here hard to do take care of our work get the job done to make sure that Georgia remains the very very best place to live work and raise a family we look forward to working with y'all in the Senate and the House and all the members and certainly again thank you members for being here be safe on this weekend with potential for the weather that we have coming in so we just ask to keep your attention on the on any bulletins that may come out and we'll all be fine but take care of your families and take care of yourselves so thanks Mr. Chairman for let me speak thank you Mr. Chairman all right members we were a little ahead now we're back pretty much scheduled so let's let's move keep moving um Commissioner Nail welcome we look forward to hearing your update on our community supervision yes sir thank you Mr. Chairman and members of the committee we will keep you on schedule I'm hoping when we talk about our amended 2026 operating budget on page 141 it includes a two thousand dollar supplement for full-time regular staff that's going to be $3.9 million that represents 1,837 full-time staff for our agency amended 2026 for capital projects is 75 replacement vehicles that's on page 380 line seven this represents approximately 10% of our fleet that meets the surplus and replaced policy by DOAS and fleet management standards I will let this serve as a reminder that in essence these vehicles serve as the office for our officers that is where they do probably 90% of their work and that right there is a tune of 4.5 million dollars I'm sure you can understand if you're out and about going to houses by yourself supervising individuals you won't reliable transportation I can assure you that especially for transporting someone you don't want to break down on the side of the road moving to FY27 we have two items other than the statewide spreads I'll be more than happy to cover that if you desire otherwise I'll just talk about the two increasing funds for rent and West Georgia Oghiti and Mountain Judicial Circuits those hubs are in Carrollton statesburgr and Clarksville you'll find that on page 142 of the field program this is based on an increase or a non-renewal in those like locations and as you all know the marketplace and market value continues to increase so we've got to adjust accordingly second item is law enforcement to find contribution page 142 in the field program this is based on a calculation from OPB of 1000 and 7 officers that would come to $877,000 I hope I kept my word by keeping you on track and on time and subject any questions from the committee that concludes my report wow it's taken me 37 years to get that quick but I've got you uh uh uh uh it's about two soon got a couple of questions later hegly thank you Mr. Chairman I'm over here yeah there you go thank you very good to see you it's the commissioner thank you so much can you give us the number of our citizens that we have under supervision right now and also what is the cost that they pay sure I I can and here's here's going to get everything we broke 200,000 now we're at 194,000 we still lead this nation in the number of cases under supervision I will be fair and say that that 194,000 represents the entire population that were responsible for actively supervising meaning going to their house having them come to us whatever the case is 91,000 I am pleased to report that with your continued support case loads are the lowest they have been since the creation of of DCS and I never want to miss an opportunity thank you for that still not as low as as they could be or should be but I can't tell you how much your support means to us in that regard so thank you represent for you represent them stinting thank you mr. Chairman thank you commissioner for your presentation and just a special thanks to your team they came out and supported my resource day last year in my district so great team I really appreciate them but my question is relating to concerns that I'm hearing from constituents particularly that in the Taylor County area having to travel to Columbus every day for some type of drug treatment I was a part of their probation requirements and it is such a struggle for their family trying to get them Columbus from Taylor County every day men in rural Georgia so I was wondering is there any any thoughts of maybe finding a facility because I have an imp to build in in Taylor County I mean seriously that you know that really helped the people in that area because trying to get the Columbus every day is a real challenge and you you you are not alone transportation especially in the rural areas becomes a great challenge for us I will tell you that we are relocating our Columbus office and one of the biggest things we looked at is ensuring it is only bus line to help with transportation that might not help with the Taylor County situation but all I can do is acknowledge that yes it is a serious situation one thing we did to address it is I still remain firm in the belief community supervision does not take place in an office it takes place in the community and that's where these officers need to be however you can only have so many day reporting center spread throughout the state right now we have 37 one of them is Columbus one of the reasons we're moving is because to expand that day reporting center that's a judicial option without it these individuals would probably be in prison and I wish I had an answer for you but just being very candid and honest I recognize the challenge without a doubt follow up question Mr. Chairman this one so you're moving the Columbus office you stated it's going to be further for people in Taylor County or closer for people it won't be further it shouldn't be but it's but I will be candid it's not going to address that concern anywhere in Muscogee County it's still going to be far from Taylor County if you're the one that lives in Taylor County and I understand that issue day reporting centers are expensive I wish we could drop one everywhere but I don't think that's feasible plus just just too costly but if nothing else you you get empathy for me for the transportation issue I promise you that we are aware of it okay thank you yes ma'am thank you Mr. Chairman with promises thank you Mr. Chairman commissioner yes what you're talking about the individuals having to move from or go from Taylor County into Muscogee County and you're talking about day reporting or the vast majority of these having to actually report to their supervising officer or is this for drug testing or those are the day reporting center our offender or supervising population the majority of those we actually go out into the field and see them to include Taylor County they reporting centers have a census of a hundred individuals at under supervision and it does require drug testing and programming so yes they have to report to that location and these individuals are required to report based on certain diagnostics that are conducted by your department upon their release from prison is that right not all the way sir most of these are judicial sentences that judges actually hand out and we do initiate waivers if they have violated their conditions or have sanctions to be imposed those are the ones that make up the census of the day reporting center so it's a condition of their probation in order to follow the instructions of a superior court judge that is correct thank you represent a ball over thank you sir I remember a lot of conversation about Georgia being a total outlier on the number of offenders there in probation you said out of 194 91 thousand are active supervision I wasn't sure exactly what that meant but that obviously leaves I can't do them yeah 100 thousand people 100 thousand people what is your data research or the value of long term probation for folks who have not been in trouble for a long time that was a real issue of cutting back on those numbers when we discussed it last that that's correct a very good question the the legislature two years ago passed a bill to limit the time on under supervision and just the first day that was enacted we were able to cut off about 24 thousand off of our case load so really this is administrative status but they're still under the conditions of the Senate's they're just not being actively seen or supervised well the conditions are what after five years I mean we can follow up on that miss chairman but this is a lot of people that we're paying more and what is the safety return on investment I agree and in the conditions are the same the general conditions and as to research I will tell you research shows that beyond two years exactly what I remember you are not going to get a return on your investment that's exactly what I remember the numbers in Georgia aren't associated necessarily with the folks coming into the system it's the length we also had the longest sentences in the nation and that's that's where you get a stacking effect of if if it's two years that's great but when it's eight years you're still responsible for that individual until the recent passage but it's still going to take time for that legislation to catch up that's why it may have been joking but that's why these numbers continue to go down so they're going in the right direction if they don't violate within 18 months they don't violate generally that's what research shows us that's what I remember so we'll keep having this conversation about what's the benefit of following a hundred thousand people thank you sir reps into Gilear thank you mr chairman commissioner I see the bowtie still holds itself where let me let me thank you there you are thank you sir yes sir thank you so much for what you have done with us in Chatham County I ask you to come and speak and interact with the community at the breakfast club you came I have taken the rides with your staff the level of restitution was a problem in in a lot of ways and yes and I'm I'm thankful that your office has worked with us on the different programs we had show us your guns and others to help those citizens so that they will break the recidivism level and they'll meet their restitution so we look for it to work with you in the future but are there any future plans for Chatham County stay the course we we have a great day reporting center down there we have a great relationship with all the stakeholders we recognize we can't do it alone it does take community involvement these people just didn't get to that part of their life overnight and it takes a lot of work but I think to the point is just continue to strengthen the relationships that we have with Chatham County I would be remiss if I did not compliment the work of the nearly 2000 staff members I've got the easy job I get to talk about the great stuff they're doing they're the ones that are carrying the weight at the local level and I'm very very appreciative of what they are doing but I think just stay in the course in Chatham County in keep strengthening those relationships last question representative commissioner thank you mr. Chair commissioner I echo what others have said I really appreciated working with your staff thank you I had a quick question with respect to the the dynamic risk assessment tool which is I understand is not AI based to be absolutely clear but does look at a number of different factors and the early from engaging with your office I understand that it is showing early promise could you tell us like when you will be able to tell is this risk assessment tool working well the general risk assessment has has been around quite a while by statue we revalidated every five years it's not an off-the-shelf project it is actually normed on Georgia's population we are right now in the midst of doing one that is even more responsive our risk are calculated every night we share data that is put in by the officer or the counselor that uploads for instance their risk can go down if they go 30 days without a positive drug screen consequently it can go up there are a number of factors that go into that and they are populated with it even from the start we are one of the only ones in the nation that we actually have access to the GBI database which is absolutely critical when you're talking about risk and and needs assessment and and that's a good point it's not just a risk assessment it also identify those needs and when we talk about risk just to be clear we're talking about the risk to reoffend we're not talking about a physical risk I know for a lot of people that's what comes to mind first but we're talking about the risk to reengage in criminal behavior but we're we're making great progress progress with that continuing to validate it and update it yes sir thank you commissioner Nail keep up good work thank you sir appreciate the support next up is director J. Nail with the C.J. C.C. we are a little ahead of schedule but I imagine the next two after this presentation may take longer than scheduled so Hint Hint director Nail ready when you are thank you Mr. Chairman and I caught that Hint so that was for members that wasn't for you Mr. Chairman it Chairman Tiller it's an honor to be able to present to you on your committee today members of the committee appreciate the opportunity to come and share with you this morning C.J. C.C. has a few changes in their budget and I will highlight those for you and then I will answer any questions that you may have with us today also is executive director Taylor Jones from C.A. C.J. they are in our budget as well they have some changes that they would like to present to you in addition to our changes first changes the increased funds to provide one time salary supplement a two thousand dollars and the reason I mention I know there are other statewide that we're not talking about but you may remember there have been times in the past that not every employee has been included with similar recommendations and I wanted to thank the governor and the office of planning budget for ensuring that every one of our employees were included in the calculation this year so this two thousand dollars supplement is fully funded for our agency and we're very appreciative of that the second item is reducing funds for operations this is removing 33,558 where the intent language was considered non-binding by the governor the second are the third is to reduce funds for personal services based on the actual start date of new positions and we believe that that is an accurate calculation on those funds there is a yes and that's the utilize existing funds of 133,867 from rental savings for grant system connectivity we have downsize our space the actual savings because we didn't move in July 1 the actual savings was 77,000 instead of 133 for the fiscal year that we're currently in and by the way we have already spend at 170,000 for the Georgia at work connectivity work that has taken place for the fiscal year 27 governor's budget reducing funds for operations is again there of the 33,558 dollars and then the next two are removing one time funding reduce funds for the offset of the loss of victims of crime act funds for federal fiscal year 2025 3.125 million and eliminating funds for one time funding for gain prevention activities in Chatham County of 250,000 there is also a yes there again of utilizing existing funds from rental savings and that completes the recommendations the governor's recommendations for our budget I might need to use Chairman Hatches might since we know it's on the got a couple of questions okay representative Mary Margaret Alderman good morning thank you good morning I'm told that the child advocacy budget that's now with you that nobody's been paid anything since July is that true that is not true good so the we we learned the middle of June that the funding was going to be transferred to us we had to get a contract an MOU with DHS before we could do anything with those funds we also had to to get a little bit of information from ca c's to determine how that funding needed to be distributed to our local ca c's the ca c's were receiving about 67,100 dollars in those funds we were able to increase that each of our ca c's that we're getting 67,100 ended up getting 74,000 if I remember correctly we did 67,000 in our September meeting and then in the December meeting we we increased that to I think it total 74,000 we also the 3.125 million that was in our budget we also gave another 40 some thousand to the ca c's out of those funds as well so the ca c's are receiving additional funding from us this year from what they received last year have you changed the method by which they receive it do they have to apply for a grant now or is it still a direct appropriation so we asked them to submit to us it was it's not a competitive grant application but we did ask them to submit to us I think it's important to understand that the way things were being done with the H s there was no accountability at all for how those funds were being expended so we are we did ask them for a budget we're making sure that they're they're spending according to those budgets the money is being used very generally so it's not it doesn't have the same conditions that our federal grants have we are assuming that we have this again next year and we believe that we will we're moving to to get the contract and the MOU done in advance so that I'll be done before the beginning of the fiscal year and the the goal is next year in July for us to be ready to to give them an advance on that so they'll be getting advance on the the funding beginning in with the July one of 2026 final question Mr. Chairman are there seven or eight hundred interviews not scheduled yet in line for interviews I'm sorry what they're what's the number of victims that haven't been interviewed yet six seven hundred of victims that have not been interviewed forensic interviews I'm I am not familiar with that okay I hope I'm wrong thank you yeah I will say when we learned that this was going to happen I asked up my administrative assistant to get meetings set up for me and over the course of the fall last year I visited every one of our child advocacy centers and set down and spent a significant amount of time with the executive directors and the staff of each of our child advocacy centers wanted to get to know them a little bit and get to know a little bit about their needs and what their concerns were I felt like those are very productive meetings learned a lot about what was going on with our local child advocacy centers and some of the needs that they have one of the most important needs that we heard from them was their concern about lack of funding obviously we've been talking about funding for a long time with Voka cuts one of the things that surprised me was that there are a number of those child advocacy centers that already in this present fiscal year have already eliminated positions as a result of the funding cuts as a result of that we reached out to domestic violence shelters and sexual assault centers as well to ask them where they were and we learned that a number of our partners already have begun eliminating some positions based on funding issues and are looking at the potential of eliminating even more positions moving forward thank you. Chair later, Dempsey. Morning, fine here. Yeah, so just kind of following up on that just a little bit so of course I'm concerned when we hear about positions being eliminated because the workload and the needs are not increasing and if anything they're increasing so are you looking at some ways to address that that these positions are going away. So we have over the last several years exhausted every avenue possible for us to find additional funding. The Governor's Office and OPB allowed us access to a significant amount of ARPA funds for example. There were multiple supplemental grant that were available from the federal government and we went after those and we were successful in getting all of those. We have seen our VOKA award over the last several years. We've seen our VOKA award decrease from $79 million in fiscal year 18 to $35 million this past year. That's the cut that we've seen from the VOKA award. We've been able with the ARPA funds and with other supplemental funds to to fill the gap for the most part not completely but for the most part and that's the reason we've seen some of our partners begin to make some some reductions in forces this year with the ARPA funds being completely used by by the end September 30th they'll be all expended as my fax some of the partners already have expended their funds where we've been awarding with all fund sources combined we've been awarding $113 to $115 million a year for victim services. Last year we awarded $89 million this coming year we anticipate awarding about $82 million so that's about a $30 million cut for our partners in this coming year.\n\nOctober 1. I don't know where else we can find those funds. We've exhausted all of the grant funds that are available. We don't have any funds available. We'll certainly continue to look anywhere and everywhere that we can. We have I have partners that have reached out. I had one we've got one partner that went from one annual fundraiser. They did three fundraisers last year and they're still looking at a $200,000 gap. One of the things that we've been really talking to our partners about for several years is the important of diversification and a number of our partners have done that. But even with the diversification that we're still running into significant issues. For example, one of the Metro area of programs submitted to us that about 29% of their funding is federal. About 28 percent of their funding is private. About 21% of their funding is county given by the county. 11% is fees for forensic services and 9% is state funds. That organization is looking at a $500,000 gap when the arpe goes away. They shared with us that they're probably going to have to go from being a 24, 7, 365 program to being open weekdays only and having limited on call evenings and weekends. They're anticipating serving approximately 500 fewer survivors annually and significant reductions in counseling legal advocacy and cross-s respawns. And where we're hearing from our partners that the cuts are going to be made primarily are counselors, legal advocates, and victim advocates. The counselors obviously are trying to take care of these victims in some incredibly vulnerable times. And one of the things that they reported, we have one partner, for example, child advocacy center that reported us, he's going to have to let go a full-time therapist and a part-time therapist. And he said he already has 40 on a wait list for services. When he loses these positions, that obviously becomes an even greater problem. We're also hearing from our providers that if they try to encourage the victims to go somewhere else for services, they're not likely to do it. So being able to offer those services in the in-house is pretty critical, but the funds are not there going forward to continue being able offer that level of services. I appreciate what you are doing. I do find it quite tragic that we would have even one child who needs a forensic interview that cannot get it at the exact moment in place when they need it. The whole purpose of these centers is to help reduce that trauma, which does become lifelong without a doubt. And so I would say we're complicit in helping to add to that if we're not able to do it. So I hope as we continue to talk about this, the hearing for the subcommittee, the chair of my committee will be in the morning. And I hope we can figure out some ways to make this different because it's very impactful. And I have heard from some of the centers that they have not received money since July 1. So they are having to let people go there, having to not provide services. They're not even having those interviews, which means that child's case may be delayed for years or either they have to retestify over and over again. I will follow up and we can get to you the payments that have went out so you can see what's went out. I will say this over the course of the fall as I was visiting child advocacy centers, no child advocacy center was reporting to us that they had children that were needing forensic interviews and were not able to get them. There were some that were saying we're having to schedule interviews for next week instead of being able to do them right away. But none of them reported to us that they were not being able to complete the forensic interviews. Well I hope you'll help us figure out a way to address this. We're willing to work with you anyway we can. Thank you. Thank you, direct and yield. That answers all the questions. We appreciate everything you're doing and we're here for you. Thank you very much. Appreciate you all. Next up is Commissioner Reynolds Cobb with the Department of Geo and Justice. Good morning. Good morning Commissioner. Good morning. Thank you. The floor is yours. All right we'll get morning Mr. Chairman members of this committee. Thank you so much for giving me the opportunity to present to you our AFY 2026 FY 2027 governor's recommendation. I do want to say thank you to you all as well as governor kept for always been so supportive and understanding the needs of the agency as well as the challenges that we continue to face. We also want to make sure that I pause to also say thank you to the over 2600 men and women that make up the Department of Juvenile Justice because they are a very committed group of people and they make so many sacrifices and a lot of times you're making personal sacrifices to serve the young people that's in our care. On average daily we have 11,000 youth that we're serving. A little over 9,900 of those youth are in the community and the others are in our secure facilities and so often and I know we all get to hear about the negative stories and the things that our young people are doing but I thought that I would take just a few minutes to spotlight some of the positive outcomes that we're also seeing with them. We had 68 young people that graduated from high school or with their GEDs in the 24-25 school year from the Georgia Preparatory Academy where the 181st school district and the Georgia Preparatory Academy is our school. We also had 65 young people during the same time period that received certifications in things like prep cook, Microsoft, borrowing, fort lifting and welding and we thank our friends at the Technical Colleges for partnering with us to make this possible for them. We have 29 interns that set Cafe Momentum at Liente which is a restaurant that is in a few cities across the country and their sole focus is on juvenile just as involved youth. So they do pay interns, ships for our young people and in addition to teaching them about the restaurant business they also help them with schooling, they support them with mental health and they also do 24-7 case management and this helps us when our young people are leaving our facilities going back into the community it gives them something positive and a positive start. We also had eight young people that participated in the credible messenger youth summer violence intervention camp which is a 10-week intensive camp that works to reduce the risk of criminal activity. When we look at the staff and retention and recruitment is always a conversation that we have because for many years we have the highest turnover rate we had the highest vacancy rate as well. Well over the last two years we've been able to maintain an agency vacancy rate of 24 percent and we also have our turnover rate at FY2024 was 30.3 percent. We've seen just a slight uptick at FY25 to 30.6 percent but what you all also know is that what moves is right for us is what's happening with our correctional officers and so for years we talked about a 94 percent or 97.5 percent turnover rate. Last year we were able to report a 64.24 percent turnover rate with our JCO series and this moved a little bit at FY2025 to 68.19 percent. The reason why I'm not alarmed by this is because we also have to remember that we have a responsibility to hold people accountable and so where we want our numbers to be good we cannot sacrifice accountability but we're also working from a plan on recruitment and retention. We continue to focus on our culture because that's a big deal and we have moved from the days where we're just focusing in on the culture globally to also working now on the sub cultures in all 76 of our offices and our 25 facilities. We have seen great results from our stretch program which we believe helps us with succession planning, career development and is also a morale booster. What this program does is it allows staff that are showing a lot of growth potential and that want to grow to serve in a heart to feel vacant position on an interim basis and we provide on-the-job training, peer support and constant performance feedback to make sure that they are prepared for that next step. We've also improved our onboarding process and we're doing regular check-ins so that way the people when they are coming into our organization they know that we care about them and we care about their success to help with retention. We're doing ongoing advertising so that there's a study flow of applications and this has helped us to decrease our vacancy rate. We just recently rolled out a mentorship program which is helping us to foster an inclusive culture, increase engagement and improve retention. This gets us to our actual request. So with us, when we talk to our staff when I'm out at the different facilities or the community offices, when we're doing employee engagement, there are two things that we hear constantly from the team. We need to make more money and especially those on the front line because of the hours that they work is often hard for them to take on a part-time job and we have 55.28% of our staff that's making $50,000 or less and the second thing that we hear is about their safety. So I am very grateful and I know that all of the men and women that make up the department with the governor's recommendation for the supplemental $2,000 for all of the full-time staff and the other things that you will see in our request, they're also geared towards not only the safety of our youth but the safety of the men and women that work for the department. On page 244 with the supplement in our community services, the increase that we will be requesting is $1,450,357 and our departmental administration with the 2,000 supplement, it's $355,245 and our YDC budget that will be an increase of $1,681,493 and in our RYDCs that 2,000 supplement would increase to $2,611,589 for our budget. Now this next item has nothing to do with the $2,000 supplement but because we've had a decrease in the turnover rate and our RYDCs in order to make our budget and personal services we're requesting a $2,544,806 edition to make it through the end of this fiscal year. And now turn your attention please to page 380 for our amended capital projects. We're requesting $600,000 for our Muscogee YDC. We have a new 56th Bay at Housing Unit that will come online this summer. That construction should be done the end of June. So we need to add some additional cameras and while we're adding those cameras we need to move away from the outdated physical servers that we have to a cloud-based platform. The next item there is for repairs and sustainment for our RYDCs $2,833,800 is the request. Most of our RYDCs we have 19 of them. They were built somewhere between 1970 and 1990. So they are aging facilities. As I stand here today we have our way-cost facility that we need this money for as an example where we need 650,000 because we have to repair the sewer line. The laundry room is offline right now until we repair the sewer line and in addition to that we need to replace the vent head and we also need to replace the grease trap. This brings us to our FY2027 request for community services. We have all of the statewide increases or adjustments as the other agencies. I don't know Mr. Chairman whether you want me to go through each one of them. So what we will do, what I will point out there is because we are a school district unlike most agencies we do have the $119 increase for the teachers retirement system to reflect an increase in the actuarially determined employer contribution. Everything for our departmental administration is just the statewide adjustments and the same for our YDCs and our RYDCs which gets us to page 389, capital projects. So when we talk about our 2027 and excuse me that should be FY not AFY 2027 but when we talk about all of our 25 facilities it takes a lot to maintain them especially given the age in the wear and tear. So with this $10,615,000 request for repairs and sustainment I can pretty much tell you how we're going to utilize that money. That $6 million we have two facilities, our DECAB, RY and our Clayton County RYDC where the plumbing is pretty much almost gone. If we don't address the issue we will have to take those two facilities offline and that would be a total of 126 beds and we have no wear to put those young people. Three million of those dollars we would need to use to continue to do the work that we started last year and trying to address doors, locks and frames so that our young people cannot pop the locks through their sales. And then the additional a million dollars we have major systems that's at the end of their life cycle such as our HVAC chillers and generators so we would need to replace those. The last item that we have is for $5,970,000 for major repairs and renovations. We have about three facilities where we need to harden sillings, we have other facilities where we need to replace roofs and gutters and so those are the types of things and those are the things that we know. So often it's also the unforeseen things that we also have to budget with for that often causes us to struggle and trying to pick and choose what we do first. And with that I will pause for any questions. Thank you, Commissioner. I've got a couple. With the I think you stood your turnover rate had gone from about 60% to 30% is that correct? So no so the agency turnover rate went from 30.3% last year to 30.6% but for our JCOs that went from the 64.24% to 68.16% so you're still with your officers you're still in the 60s? Yes. Well we'll do whatever we can to help try to resolve that and that's very important for all of us. Commissioner what's your starting pay on JCO? It is 44,000 for a JCO one. And what's your average pay on JCO? The average would be maybe around 48, about 48, 49,000. Remind me too. Didn't we find a new prison in or jail in making? So we're the design and we have them. Yeah we're in the process of doing completing the design for the making facility and it's going to be the first facility where it would be all female, ROI and YDC. And that's all and when is that set to be complete? So we probably have about I'm going to say a timmer of months of design because we have to get it designed first and then we start the construction. Okay thank you. We're probably. Thank you Mr. Chairman. Thank you ma'am. Appreciate what you're doing. The attempts you are making to solve some of the issues we have in our juvenile community. You mentioned something about eight children going to a summer camp dealing with violence. How many juvenile's do you currently have in custody? So we have a total of 11,000 on any given day. Now that's in the community as well as in our secure facility. I'm talking about inside your secure facility. We have about 1100. 1100 inside secure facility. Yes. Did those eight come out of that 1100? No that would be. They are in the community. Okay thank you ma'am. And I appreciate the fact you said that you're focused on holding officers accountable. What percentage would you say of your staff and I'm just talking about your JCOs left voluntarily and how many of them are terminated? A majority I don't want to give you like a number because I know I would be off but what I can tell you is that majority of them are when they leave us is because we're terminating. Okay is that with that information be available that you could provide that to me? Yes. And where any of your JCOs are arrested and charged with any crimes related to their job within the institutions? I am sure that we've had some. That it all runs together because when they're going to court you're reliving things or an old but I'm sure that we have some and we can give you that information as well. Thank you ma'am. I appreciate you. You're welcome. Sure lady. Perfect. Thank you commissioner. I appreciate you highlighting Cafe momentum. It's right down the street y'all. It's on peach tree. They have great food and all the staff are just as involved with you. Yes. They provide wraparound services and we should be taking full advantage of it. I know you're working with them as well as another great nonprofit that's in center Anderson's Desiree Groken-Chackles. Yes. To try to get these kids back in the workforce. My question is did you have any are you working with the technical college system at all? Yes we are and so those certifications that I spoke about with those 65 young people it's because of the technical college they have been great for welding they bring the equipment to us and they are taught welding on site at our secure facilities. Thank you. Thank you. We're up to them. Thank you. Mr. Chairman. Thank you for your presentation. You talked about the condition of some of your facilities. Have there been any thoughts of maybe obtaining another facility because in Taylor County we have a facility that's stayed on that's not being utilized and it has been empty for a very long time and that could be a possible solution to your problem and also sent them to key up Patrick mentioned the wraparound services and the work with the technical colleges. Can you share what is some of the work you're doing and the rule Georgia that helps children that may be in your custody for wraparound services to be able to transition back into the community? So when we I'm going to start with the second half of your question. So when we're talking about like these certifications I'll give you an example. The first welding program that we did it was with the girls in our making our all female facility and so that catchment area for making that would be young people that's coming from South Georgia or Middle Georgia. Also with these other programs like Fort lifting that's a program that we have in our Wilkes facility also in our cat well facility. So majority of the programs that I spoke about with certifications a lot of them are actually for the young people in rural Georgia. What we tried to do is look at the data of what type of employment opportunities would be available for the kids and then from there we try to bring those certifications. We also have kids that are working at Kia and the Hyundai plant as well and these are kids from across the state and these are the community kids and they're doing pretty well. So we're trying to make sure that it's just not Atlanta focused. The only thing that I talked about that's just Metro focus is Cafe Momentum because that is downtown Atlanta. Now and as far as property we're always looking for property but what we have to be careful about is because we're working really hard with communities because we want to be on the prevention side of it. It hurts my heart when I'm talking to teachers and educators and we have five year olds that are being put out of a classroom and we don't know what to do with them. So we're working with local communities to try not to be the pipeline. So what we're trying to do is those facilities that are not in the best repair. We're trying to either repair them or bring them up to speed. There may be one or two that we may just need to close because they're old GDC facilities and we cannot overcome the adult feel to them but we don't want to have to bring we don't want to have to say we have 30 facilities. We already have 25 which is more than a lot of states and so we're trying to do all that we can to not push young people further into the justice system if that makes sense. You're welcome. You're welcome. Commissioner, that's all the questions. Thank you very much. Thank you. Next up is Commissioner Oliver with the Department of Corrections. Welcome Commissioner Oliver. We'll bring you in 30 minutes ahead of schedule. You don't have to take all the time but I imagine there might you might get a few questions say with that I'm going to turn it over to you. Yes sir thank you chairman and members of the committee. First I just wanted to start off with a I'm just sitting at the stage for budget recommendations from the government is kind of given overview or snapshot of GDC from a population perspective and other perspectives. So total total house population at 50,200 feet to two offenders plus an additional 3,000 plus probation for all offenders out of housing PDC's, assets and integrated treatment facilities. You can see our emissions and releases there are inmate breakdown 75% of violence three and every three and four 25% non-violent and that population has increased for 12% since 2012. Validated gang affiliation we've sitting about 15,888 is 31% of our population are classified self identified as security threat group or gang involved that's one in three. You can see the charts down there that breaks down the close medium and violent populations. Our synancing trends our current average sentence length is greater than 42 years almost half of our population serving 20 years life life without parole death penalty. Both averages, sentence averages and the server in the length of time, a significantly increase over the last 30 years. We currently have about 8,000, a little of 8,000 offenders serving a life sentence and a little over 22,000 serving life without parole. In that chart below you can kind of see the time serving on life sentences only. So back in the early 90s or 1990s there were serving at least about 12 years on a life sentence currently right now serving about 28 on average. Our health statistics 26% over 26% of offenders are actively on the mental health caseload ranging from medication therapeutic services up through intensive crisis stabilization. Mental health classification we have about 13,834 offenders on that caseload. Funders with chronic conditions over 25,000 that's grown from 33% to 60% since 2011. And chronic conditions are cardiovascular disease, diabetes,\n\nCOPD, cancers, HIV, hepatitis C. So you see that numbers continually grown and increasing. We dispense over 100,000 prescriptions per month to our fendipopulation, our average age of our fenders is about 41 years of age. And that's increased over the years, as you can see in that chart below. Our five year projection, with respect to see a 10% increase over the next five years, is about 55,000 offenders by the end of FY 2030. This does not include the additional 3,000 probation parole offenders' housing, our PDCs, our SETs, and integrated treatment facilities. And as you can see, that dip right there in COVID, during our COVID years, and then it's still continuing to gradually go back up and project it to go to 55,000 by 2030. Our security incidents, we're still training down, we see from the years before, won't go through each line of the chart, but it's kind of taken a minute to kind of look at that and see where our fights are inmate on staff assaults, have continually been trained over the last nine to ten years or so. And the same thing there. One thing to highlight with Smith State Prison, one of the things that we'll probably talk about a little bit later on in the presentation, we did a pilot at Smith State Prison and created single man cells, so I have about 500 beds offline at Smith State Prison because of the violence that was occurring there and in an institute of single man cell prison, and you can see how the incidents and assaults and fights have drastically decreased over the years where we only had 14 assaults. We include fights and assaults into that. I didn't put that slide in here, I do apologize for 25, county year 25, it was a total of 31 instead of 14. So that pilot seems to be going very, very well. Our contraband deterrence, as we step up our contraband deterrence, thanks to this body with different technologies and then our K-9 partners and local law enforcement partners, our contraband you can see has gone up. The wireless devices that we're getting and wireless devices, you see that 30,000 number in county year 25, that cell phones and charging, air pods, things of that nature, you just take out cell phones in that I think it's around 12,000 or 13,000 cell phones that we recovered and in county year 25 and in the weapons. We've also increased our shakedowns over the last couple of years, so this kind of given an example, in county year 23, we conducted a total of 83 shakedowns, 24, 131 and 2025, 224. And that's not including shakedowns that are done, that are conducted every day by the facilities out in the field. These are shakedowns that are done either by our tactical squads and or our IRT teams. All right, getting into the recommendations, FY26 and FY27, government recommendations found on page 147 and 149. Additional CO positions for the amended budget at 4.9 and 27, 26,8 million. This will improve our staffing ratios to 11 to 1. Our security count positions you see have increased for a net change of 317 from June 24 to December 25. When we started this journey, our current ratio was 1 to 16 in state prisons and currently we're at 1 to 14. FY funding will allow GDC to continue hiring and annualize the FY26 recommendations, adding 275 COs for result in the agency-wide staffing ratio of 1 to 12 by the end of fiscal year 27 depending on whether or not the offender population changes at that time. So we're still on the right track and we continue to make progress with our hiring and netting COs. And when I mean, it's kind of get this for context, the CO positions are just your entry level positions. It's not encompassing total security. So it's just your CO12 and 3 positions, entry level positions. On page 147 and 150 security threat group are gang coordinators, regional coordinators, that was recommending 3. The amended budget is 137,000. In the fiscal year 27, 377,000. This provides funding for additional, for 3 regional SDG coordinators to enhance communication and allow more efficient management of critical gang information throughout the state. Currently we have one that's trying to manage all that as you can see in the earlier slide. The third of our population are classified as security threat groups. So that will enhance communication across the state and better to manage that population. On 147 and 150 on your page, can I handle this recommending six additional canines? Currently we have 24 state, 26, I'm sorry. This will allow for an additional six canine to a total of 30. And so it's very important. I think our canines last year, we responded to over 4,000 calls callouts and just for 26 officers. So this will alleviate some burnout and then also provide security for not only staff or defenders to address current coverage gaps and burnout. And this also includes one time equipment purchases and ongoing salary and operational expenses for each canine handler. And provides funding for drone, 15 drones for our canine units to help with search and seizure. A lot of our efforts from canine not only contraband related, but they go out into the woods, look for people attempting to introduce contraband into these facilities. So those 15 drones were supplemented some of the manpower that would be needed to actually go into these areas to search for those people trying to introduce contraband and or missing persons that we assist local law enforcement with. State prison, safety security and technologies, recommendations for FOR 2627 on page 147 and 150. Our mange access and drone detection systems and amended is 13.3 million as you all, as I just mentioned again, with an introduction of contraband, our mange access and our drone detection systems are essential into our operations. Out of the 19 that were already funded 17 are fully operational with the last two coming online March of this year. So we're definitely seeing success with both our mange access system and our drone detection system. Mange access analyst and fiscal year 27 is 409,000. This provides funding for five analysts to manage and oversee information collected, fund manage access, and drone detection systems as well as other data intelligent sources. This is important as we start to ramp up our safety technology, safety security and technology systems. It's important to have these analysts to manage that data that's coming in and it's been proven fruitful over the last several years with the analyst that we have. But of course, as we start to add systems, they're kind of getting overworked as well. On page 150, the annual lives of Overwatch unit, that's our fourth multiplier that was already funded. This is for personnel in the 27 or 1.2. It provides funding for six months additional to the base budget funding to fully annualize all our unit positions. And then in the out year again in 27, 5.5, it's a technology call. So video monitoring analytics for the out unit which is coming along very nicely there at headquarters. On page 147, public safety supplies and equipment, 2.4 million and amended that's to replace and purchase new vests for our officers and also equipment weapons replacements and things of that nature that are outdated and or expired. Still staying on 147, our peer-led programming pilot at Altry in the amended 150,000 this provides funding to initiate a pilot in two dorms for a blended learning program proposed by the mosque group which is our consultant at the governor and partnership with us brought in to a doing assessment of the system. It's been successful in other states and also it includes video segments, facilitate discussion, small group activities and personal reflection time. I personally went down and saw this in action, the habit in Texas and then the program was very successful there and I feel like we bring it to Georgia. It will help with some idle time with some of our fingers and also provide good outcomes for rehabilitation. Additional programming at Metro Reentry Facility in the amended 93,000 and then 27, 39,000 this provides funding to expand existing programs with the additional data driven curriculums programs include helping men recover parenting programs, relationship programs and speed of trust. 147 and on 150, the high school accreditation program currently are vendor as slowly phasing out there providing that service to us. We're requesting an amended 26, the 93,000 and FY27, 953,000 to get our high school to provide our own accrediting high school. This provides funding to allow GDC to become an accredited school district by transitioning prominent staff, promoting current staff to teach your pay scales and hiring new staff as needed and required state positions. That's essentially right now where I think we're having about 16 or 16 or 17 high school diplomas initiated. We're really pushing more GDCs than high school. We feel like doing our assessment. We identified about 900 almost close to 1,000 students that could graduate with a high school diploma with us but we don't have our own accreditation so by doing this we'll provide that opportunity for those offenders between 17 and 21 years of age and our system. Physical health and pharmacy, the next set of recommendations are related to our health program, contracts and utilize to ensure those under our custody maintain physical dental and mental health care. In the amended budget you see 38.8 physical year 27, 47.8. Governance recommendation is to support, it's based on this increased per dem rate to cover the calls of services provided by Centurion and also includes the opening of additional beds. Additional beds at Autry State Prison not including the original contract due to dry docking that facility for renovations will cover only 500 offenders and the 17-skill nursing unit. It will require future funding as we start, as we bring that facility back online after all the renovations are done late 27 and early FY 28. It also provides an additional, an addition to the McCray Remnth facility which includes a 24-7 14 bed infirmary reduction in services at Learendale due to the population moving to McCray's willing facility so it's going to shift that to accommodate McCray. An additional addition to Johnson State Prison, the medical intensive infirmary will also add 20 beds there and expansion of the long long-term acute care at a guist of medical prison which will be an additional 20 infirmary beds to reduce outside the wire care. Most of our calls are due to lack of infirmary beds within the system and so by this funding we probably bring that back behind the wire because it's going to reduce our calls significantly. It currently calls us about $4,000 per fender per day for outside the wire care for infirmary use or lack of infirmary beds and we usually average about how many randy so outside the wire. About 80 a day. That's how it would normally house. So by supporting this recommendation it'll bring a lot of those patients back inside the wire to reduce some of that calls. Also in this the FY 26 includes 15 million for risk share expenses for FY 26. Some of that risk shares just what I've just spoke about. GDC and securing a still reviewing the total claims data that will show the total obligation for both parties. The government is also recommending utilizing GDC as X-Tin funds to help cover some of those calls from previous fiscal years that we hold and reserve for that. A pharmacy contract currently for correct our ex at for fiscal year 27 at 3.6 million GDC contracts with correct our ex provide prescriptions to our fender population as I've stated earlier we've been minister over 100,000 prescriptions per month. This recommendation will cover projected projected increase calls and provide services prescription drugs and overnight shipping for our vendor. Our mental and dental health on page 146 148 mental dental health contracts and amended 497 479,000 in the mend and fiscal year 27 1.9 that is to for our staffing basis currently on staffing contract and they have a lot of vacancies in our mental health counselors like Chiatrists and Dennis providing this support in this on both contracts on the middle and dental health contract will support our vendor and providing those increases to help with recruiting and retaining that those critical needed positions. And if it's successful future funding will be needed in the outgoing fiscal years. On page 146 jail subsidy payments to local jails in the amended at 6.2 million it provides funding for current jail subsidy payments through December and projected calls through the end of 26. How we got here kind of what we're going to be facing hopefully not but what the weather is you remember last year we had harry cana leaners and ice storms early on we kind of got backed up with our jail backlog and then we also have beds offline for our renovation projects and so we're not be able to we have 15 days to get offenders out of the jails and so we have a kind of a backlog and that's been compounding due to those storms and cabin our beds offline so we're requesting the amount of 6.2 for the payout of the county jail for subsidy for housing some offenders longer than the 15 days that that we pick up. Our inmate assignment decision support system and maintenance and support see the amended 125,000 and in their FY27 to 157,000 this provides funding to increase the annual licensing and support costs for inmate assignment system insurers continue support of classification process and alignment with operational ability legal mandates program capacity and reentry goals. Private prisons 147 and 149 is to correct the tier funding from house bill 68 and the amended amount of 1 million and then same in 27 it allows the funding to be corrected in the contractual tier rate to fully maximize available beds at Jenkins and River Bend correctional facilities a 149 additional beds at coffee and Wheeler in FY27 at 4.2 million provides funding for 160 additional beds at coffee and 103 beds at Wheeler using current contractual rates. This allows flexibility for ongoing maintenance projects and increases overall bed capacity. Operational cost you can see on page 147 and 15 state prisons operations for our modular core units and food service at those mine core units provide six months of operational cost projected for amended year 26 and annualized in 27 including food service costs but excluding personal services calls. Dodge state prison expected to be fully operational by March 26 with the remaining facilities coming online one month apart thereafter. Liarindale operations 1.5 million and amended and also in 27 the reduction in the budget in FY24 was insufficient to cover the current positions the current operations at Liarindale it provides funding to sustain the operations for the 200 transitional center residents that remain there plus our fire services team. Staying on page 150 state prisons are food contract our vendors requesting air markets requesting a 4% increase through the price of food and FY27 at 528,000 our state prisons and for 147 and 150 again the lease costs for a training building at the Arnold Building North is where we house our BCOT North we created regional academies to accommodate and retain more staff there and those will be actually working very very well for us and so we're asking for 14,000 and both the amended and 27 for the increase in lease calls and also for our transitional centers for Lagrange and Clayton TC that 40,000 47,000 in the amended and also 47,000 in 27. Here's a statewide settlement that the government spoke about the $2,000 won't spend too much time on that I think everybody's familiar with with that but that's the $2,000 to $15,000,000 and these are statewide recommendations that thank pretty much all of us have gone through that you've been presented to you so I won't spend too much time on that but you can see it's broken down by program there on the screen and then the adjustments for the DOAS and telecommunications at 36.5 million so our recommendations by program and the amended amount were requesting 87.1 million in the amended amount broken down by programs there we discovered and at fiscal year 27, 66.7 million as we're pressing and we support the government's recommendations on that capital projects you'll see I won't spend too much time going through all this I know with our good partners we have at GBA we've been working closely and it locks step together on a lot of these projects and I know they're going to be presenting this afternoon but I will speak on some of them that we have in our vehicle replacements, vehicle and bus replacements currently we have 252 vehicles throughout our fleet that currently needs to be replaced tolling about 1.6 million of van replacement 2.9 we have replaced six buses and three vans the wardens house at a man and women's facility and then our food and farm equipment for our meat processing plan at 2.9 million and that's going to and also getting a tractor trailer with refrigeration to deliver that food around the state to our state prisons. I know I went that pretty quick because I know there's going to be a lot of questions I don't want to save some time for them so it's chairman if you don't have any questions on the presentation I'll be happy to answer any questions that you all may have. That was probably a good move. We're brothers.ritis rady. Here areinars are working. What? from 10 and the We have mic problems in 341 if anybody's listening. Thank you. Try. Thank you. Another great statement. Commissioner, appreciate your presentation and just real quick for my understanding how many law enforcement officers do you employ in the department corrections? About a little over 7,000 law enforcement positions that we have that's including our OPS units and correctional officers. Those are post certified peace officers. Yes. Okay, so that would make you the largest law enforcement agency in the state of Georgia. Yes, sir. Okay. A couple of things. You talked about inmate on staff assaults. Yes, sir. I'm way over here and I'm old. Could you tell me what the number was for last year? I think you had it on the slide. Let me go back. Or do you have that number? For last year inmate on inmate assaults instead. Inmate on officer assaults. I lumped them together so I don't have that broken down. What is that number? I don't know if you can read that small let me go back to the presentation. 1695. 1695. 1695. 1695. Yes, sir. Or is somebody charged in all those cases? I'll have to double check but typically on the OPS unit if they can identify and make charges we make charges and refer that to the DA's office. Okay, thank you. Currently your health care provider is Centurion. Is that right? Your physical health care provider? Yes, sir. And I know y'all are in some discussions looking at reshare. Yes, sir. Where y'all at in those discussions if you don't mind me asking? So it's still currently evaluating the reshare for 25. So we went to an auditing process when an outside auditor and then we're still going through those numbers with Centurion to kind of to kind of reconcile their invoices to the audit. And where you at in that contract year wise? This is we're completing year one. Okay, and now what how long is the contract? Ten. Ten years. It's a ten year contract? Yes, sir. Okay. And I think currently you there was some discussions about correct Rx looking for an increase of I didn't get a percentage number, but. Yes, it was. Let me get the percentage on here. I want to say it was a 4% increase. I know there was 4% on air mart food provider. Hang on one second. So it was 3.6 million to cover the projected cost increase for service for prescription drugs and the overnight shipping. And what year you in on that contract? Four. Okay, is the year four is that a is that a five or ten year contract or was that a ten? Okay, so this was not one of the contracts that automatically renew after the initial contract? No, sir. Okay, so you're in I'm sorry I missed it. What year you in on the contract? Four. Four. Okay. How many times has correct Rx come back and wanted to increase the cost on prescription medication since they've had the contract? I'm not sure on the on the on prescription medication is based on population increases. When the population increase they ask for an increase to cover the increase in the population. I have a double check whether or not it was any recommendations for prescription cost increase. Yeah, when these when these contracts are bid is or they provided with historical information based on population growth inside the Georgia Department of Corrections. Yes. Okay, but obviously we're missing the mark somewhere if they're coming back looking for increases, right? Well, I think when you when you take a look you take a deep dive into the data. You're seeing that once once individuals come into the system we're identifying and they're coming in a lot thicker. So we're identifying a lot more sick patients on a diagnostic process. I think I reported earlier we seen a 60% increase. We're sitting at 60% now. I know there was the chronic illnesses that coming in with a lot more chronic illnesses on that. We've identified them in in diagnostic process. So but based on some of your information these individuals health is or approving because they're living longer than people in in the past have once they become incarcerated. Is that not true? Yes, yes. Okay. Once we can start taking care of them. How close are you to getting the the backlog down on the 15 day pickup from county jails? Once we let me get back to that slide because I had a notice once that. So the goal is to get them in by the end of 26 bar and any other any other natural disasters or anything like that. So that's what kind of pushes into the backlog in the first place with Helene and the ice storms earlier last year. And it just compounds over over the over those next months. But we still have to keep certain amount of beds offline for our for our renovation projects that we that we have going on to all supported. Thank you. Thank you. Commissioner, I appreciate the job you do. Thank you. So when the mics were not working, I don't know if they're working. Yeah, if you did, we hit buttons on and off. So if you wanted to ask a question, please hit your button if you had earlier. We'll try it. Chairman Chokas, see if yours works. Thank you, Mr. Chairman. A commissioner. I noticed in the slide you had 13,000 cell phone. That's all retrieved from inmates. In the past, we've this has been a continuous problem. Are you getting, are we able to use new technologies to block that now or is it just going to continue to be a pain? So now when working with our fellow partners, I think it's in the public hearing comment for the FCC. So we're waiting to see what comes out of that. And then that will give us the ability to implement jamming technology. Right now we have, we call manage access. It's not jamming technology, but we're managing and controlling the signal to now out go out. Mr. Chairman, one more follow up. Yeah. What about drones? Well, I was on the committee that was, anyway, was on the committee earlier. We, drone technology had developed to the way the extent now. What are you doing to combat that? Well, thankfully for the governance support, no PB support in this, in this body from both chambers with our drone detection program. We've been very successful in detecting drones. Right now we don't have the mitigation authority for the fellow government to actually mitigate drones. But I think that was recently passed in the NDAA, the National Defense Authorization Act, to allow states to be able to mitigate drones. There's a certain steps and levels you have to go through trainings and reporting mechanisms that hadn't taken place yet. But from what I'm hearing, you know, Georgia's going to be kind of priority on that list. We were advocating really hard in DC for that. And so hopefully that'll take place soon. But right now we can identify and track drones, which has been very successful in identifying people trying to introduce contraband and polish. But we just need the mitigation authority to be able to actually prevent them from introducing contraband into our facilities. Thank you. Yes. Chairman Burns, let's try your mic. Thank you, Mr. Chairman. Thank you for coming to our guest last year. And this is my folks in Richmond County and I opportunity to tour the state medical prison there. The question relates to the increase in rates for private contractors who serve properties. I certainly support that. What is the current rate of prudium for a private prison? What is it? Private prison prudium? It varies based off the tier in the population that they're in. I can circle back with you. Help me with that because I have one of those in my district. The trick is what did you go from? What did you go to? And then the second question is for our county prison. So the county prisons and how state inmates? What's the current rate of prudium and what are the projected changes in the future? I'm 30 dollars. 30 dollars per inmate per day. Yes, sir. And this budget makes no recommendations to change that. Is that correct? Okay. And perhaps we can have a conversation later on about what? Yes, sir. The last things past fiscal year, current fiscal year we're in, well, it's recommended to go up to that 30 dollars. So they did receive an increase in the current fiscal year that we had. No, it didn't. 2026. Six. Correct. It did receive and went from? It was $6 increase. Thank you.\n\n$2.30. $2.30. $2.30. Thank you. Yes. 24-30. Chairman and the Hormison. Thank you, Mr. Chairman. Thank you for your information, Commissioner. We appreciate what you do every day. During the session, I met with several women's groups dealing with pregnant women who commit crimes and they have to go into the system. Currently, how do we deal with that? What kind of problem, problems? Does that pose for your department and how you deal with it? And secondly, the mental health and growth in that area. Is that a great impact on the budget? Is that growing? Or just how do you deal with it? Primarily, that issue currently with women who have pregnant or go into the system. How do we deal with that and currently is that working for us? Yes, so currently, I think we deal with pregnant females quite well. We partner with Emory University with our doula program to help our women. So there's their house at a separate facility and they have wraparound services in there for them. Pre and post, postpartum. So they receive phenomenal care with Emory University with our doula program. And I can get you some specific numbers if you want that. Numbers are on a physical impact. We met with talked about that number. And there's a facility to deal with it. Correct, correct. It's health, yes. And the mental health, that seems to be just spreading exponential. How do we deal with that and the cost of the impact of it, how you identify it and go for it? I think, you know, as you can tell, not only in state prisons, but across the country and around the state. Prison and jails become more indedated with mental health patients. And that's one of the reasons why I think our partner is asking for an increase to kind of help with mental health counselors. This body, and along with the government's office recommendation last year, we help support some of our mental health, our current mental health workers with an increase. But that population steadily increases, is increasing. We have a lot of offenders, I want to say, let's say 13,000, over 13,000, on a mental health case load currently. And that number is continuing to rise each year. I heard you mentioned also the elderly and the clients that commit crime, they still go to jail. Yes. And just, how is that affected? Now, how is that just really growing, how do we deal with it, let them go early, whether they're sick or not, or just be able to do the time? How does that work out? Yeah, I mean, I think, you know, based on the senate structure and how they're in how they're senate, and whether or not, they can't be released or not. I will say, you know, with that older population coming in and as they're coming in younger, staying with us a lot longer, that's what's kind of driving up some of our health care costs as well. Thank you for what you do, appreciate it. Thank you, sir. Thank you, Mr. President. Thank you, Mr. President. Thank you, Mr. President. Thank you, Mr. President. Thank you, Mr. President. Where's the mic? The portable mic. We got it right here. Sorry, I need to go. Sorry, I need to go. Sorry, I need to go. Thank you, Commissioner Oliver. I'm so glad to be on the subcommittee for corrections. So I know a lot of things that I never knew before until two years ago. You had a person reader, broker, who would answer the calls. I get at any given time, I have at least ten people who are parents or spouses who have questions. And now she's not there anymore and nobody calls me Pag or anything. I know you're having, I guess, employment is down a lot, isn't it? Yeah, but I think she was working for the Parthian Parole Board from our understanding. So she wasn't at the Department of Corrections, but we do have a line for families to call within GDC. And we have a designated team, a person, and a team there to kind of help facilitate those calls. Do we have one that legislators can call because when they call us, they always tell me that someone will call me right back and they never do. Yes. Who was doing it? I'll be forward, Lewis DeBruh, he's a legislative liaison, he's actually standing up right here, Lewis, you can raise your hand, you can get with him. And then we'll make sure you got his number again. We'll pass that along. Okay, I'll be able to email blast. Also, I look forward to working going to the subcommittee meeting because I have a whole lot of questions. I want to sit down with him or with whoever can talk to me. So I won't take up any more time from this committee. Yes, ma'am. Okay, thank you. And then y'all keep up the good work. I know you understand. You need some help. Thank you. Rep. Stinson. Thank you, Mr. Chairman. And thank you, Commissioner, for the work that you're doing. Thank you for recently being on a call with local law enforcement in my district. I really appreciate that. But the same question I've asked everybody else. That building in Taylor County, that's part of the department of corrections in Vitoring. So is there any plans to ever put that building back online? I have to take a look at it and assess. I think we spoke about it earlier. I think it was, we closed it for a reason. And so if there's a particular need and seeing what type of service you can actually provide for the department, we'd be able to take a look and assess that. But opening up as another facility of the house, the level of windows that we have right now, I don't think that might be the best use of that building. But maybe it could be used for something else. I sure hope so. But again, thank you, Bob, that you've been doing and I support what you work. Thank you. Thank you, ma'am. I think we're going to have a lot of people in Taylor County, they're representing them as trying to get that facility back used. Senator Lucas. Good. Commissioner. Can you walk me through what happens when you have a prisoner? That is being parole. What steps do you all take when he's being parole would be let out of any prison? Do you all work with him with the Labor Department anything trying to find a job basically? Because if you get out of here making some money, you don't want to lose that money. So that might help the recidivism rate. Yes, sir. We work very closely with Parks and Pro-Rod Board on releases. And we have monthly meetings with them and they work very closely not only with Parks and Pro-Rod, but also with community supervision to make sure that's a smooth handoff. Currently right now, especially working with our transitional center inmates, we ensure that they have a smooth transition back into the community where they can either stay in that community and continue to work and or maybe transfer somewhere else. For example, I know we have a couple of offenders that have actually left our custody and care with over like $20,000 or $30,000 in their bank account to help get started and still continue to work. As a matter of fact, we actually hire ex-offenders that we train for our fleet operations. So when they get out, we train them up and then for our auto body and mechanic and repair for repairing our vehicles. Once they get out or some of us still might be on probation, then we actually employ them as well to ensure continuity with their employment. Chairman Parsons. Thank you, Chairman. Commissioner, I wanted to ask you. I know there was a question about cell phones just before I came in here and understand their legal and technical issues revolving around that. I wanted to ask you though about the telephone system that are used by the in the facility. There's a system that's understanding where families or whoever wants to contact the inmates have to pay so much money to be able to use it, use that system. My question is, and of course, you know, anytime so many of the expenses when people are inmates or anywhere in the whole legal system falls back on the families anyway. But that's not my question. So my question is, who chooses the particular system that you all use? Is it Department of Corrections, is it the US, or how's that chosen, how often is it chosen? It's an appartanorship and we actually have an RFP out right now currently for that system. So I can't speak a little bit too much about that, but it's chosen by both DOAS and Department of Corrections. Okay, well, you know, good. I can't land on having any real information, but I would just ask if you all take that consideration. So many of these expenses, whether it's probation, expenses or whatever falls not only in the inmates, not only the person who's committed to crime, but it goes back on the families, parents, grandparents, cousins, whoever will chip in and that telephone as my understanding is a pretty great expense. I hope they take that consideration. Thank you. I think we're currently, I think with six cents, six cents a minute from 13. So we will have 13 is now at six cents, so we have reduced it. Yes. Chairman Parsons that use of those had gone down drastically because there were so many cell phones, but it has begun to pick up because we're stopping some of cell phones. Commissioner, I do have one question. If I'm an officer and I get caught bringing something in that I'm not supposed to, what happens to me? You'll be terminated and arrested on the spot. Turn over. I think you addressed it, but can you just, what is your current turnover right now or close to right now? Any special things that you all are doing to attract employees? I know I turn over and continue to reduce. I can get you to actually percentage as I had them here. I know for this sake of time, I can get them back to you, but year over year we reduce turnover. And what we've done over the past several years, at least the last three that I can speak of, intimately, definitely with the help of the government's office support with the current pay raises and its body support in this. But also our cultural assessment, our cultural alignment that we've done internally within the Department of Corrections is definitely helped a lot with our turnover. We've netted employees year over year. I think this past year I guess I stated earlier 317 correctional officers doesn't seem like a lot. But at one point we were losing about 60 officers per month. And now we're kind of, we're at a net game of starting netting employees and sitting around 20 something months, consecutive netting just correctional officers. And so I think pay raises have definitely helped, but then also in creating an environment and a cultural internally to where people and these officers and not only just officers, but people anybody who works behind the wires, a tough environment that they want to stay. And so we pride ourselves on making sure that that stays intact. It's a, it's a continual process. And not something that we continue that we started three years ago and let our foot off the gas. It's something that we continue to do each and every day, every second of the day to ensure that we support all of our employees that work behind the wire, not just our security staff, but not security as well. Make sure they have everything they need to do their jobs more efficiently and effectively. So we asked the commissioner of juvenile justice justice what they're starting with her starting officer pay was in years is. Right now for a 48,000 for a for CO one and a and then it jumps up to 50 stars at 50,000 when you work in a close security special mission prison and your average officer pay is around. It's like 47, 40 average like the average for all of them. Yes, yes, starting at 48 into 50. So that's going to be the average. Thank you. We you you certainly get a lot of attention from us and everyone and we know that you're every time you take one step forward. It seems like you take two steps back when I'm looking for the day is the reverse of that. So we appreciate all you do all your staff does they work they work long hours and anytime I've needed them. Are you you've been approachable and able to be reached to thank you. Keep up the tough work. Thank you. Thank you. We're going to move on to our presenter that was going to come after lunch so we can get a little ahead since we are a little ahead. Next up is our state property officer Marty Smith and state financing investment commission Diana Pope. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. All right, y'all we get let's let's try to get started back. Hey. Thank you. Thank you. Members, we'd like to start. Thank you. Who's up? This vote. You're up. Thank you. Floor's yours. Chairman Hatchett. Chairman Tillery out there. Members of the Appropriations Committee. Members of the General Assembly. Good afternoon. And thank you. It's an honor to be here today. Your work directly affects what we all do. And we appreciate the many hours and the many meetings you all will participate in over the next several months. And all the effort it takes to develop a fiscally balanced budget that serves the citizens of our great state and also protects the state's AAA credit ratings. It's intentional. I think that I'm kicking off our joint presentation here. A discussion of debt while critically important admittedly is not very exciting. The good news is I only have a few slides and then I'll hand the baton over to this great team here who will walk through the many positive things they are accomplishing with the capital investment funds that you've allocated to so many transformational projects. You've seen this graph before but it remains one of my favorite slides. It illustrates how the state has managed through challenging periods such as the Great Recession. The issue of highest debt service to prior year revenues peaked at 8.1%. And the current impact of leveraging recent surplus revenues. As a result, we now estimate ending this fiscal year 2026 with the lowest debt ratio in the state's history at 3%. This is a significant accomplishment. This slide is also one of my favorites because it showcases the impacts of key financial decisions. Most recently beginning with the amended fiscal year 22 budget and continuing through this fiscal year's original budget, the state has allocated over 6.7 billion in cash for substantial one time capital investments and other critical capital projects. And this team is very aware of managing all of those projects. Of that total around 3.6 billion was earmarked to the capital projects fund which was established in the amended 24 appropriations bill. By using cash to fund these capital needs rather than issuing general obligation bonds, the state reduced its outstanding geodet by more than 20% from the start of fiscal year 2023. This approach also generated significant savings by avoiding hundreds of millions in future debt service payments. Truly remarkable accomplishments. As someone who has been personally involved with the state's debt management plan since 1998, I can say it's rare to see a negative five year change reflected in the plan. This graph vividly demonstrates the powerful impact of cash funded capital projects. The state's outstanding debt peaked at 9.79 billion at the beginning of fiscal year 23 and after two years of funding those projects with cash instead of bonds, that debt increased by over 2.3 billion now standing at 7.47 billion. Although I have a personal plan to be debt free by the time I retire, let me also be clear that I'm not opposed to carry in debt until some of this covers an orchard full of money trees. Prudent and conservative debt management remains an important tool in advancing the state's goal supporting economic development, addressing population growth and continuing to invest in critical infrastructure. The state's debt supply gives a great picture of how the state has demonstrated discipline in challenging times while taking full advantage of good times. In every recession I have witnessed, the state has applied lessons learned, such as strengthening reserve levels and positioned itself for the next downturn because as governor camp noted last week, it is not a matter of if but when. So we cannot have a slide on debt without showing this map for we are very very very proud to be part of this elite triple a pure group. One change from last year's plan is that Maryland is no longer highlighted in green. Maryland earned its triple triple in 1993 but was recently downgraded by Moody's and May of 2025 to AA plus driven by economic and financial under performance, which is expected by Moody's to continue giving the state's heightened vulnerability to shifting federal policies and unemployment and its elevated fixed costs. Each year we make it a priority to make our case why our ratings should be affirmed. Always be mindful that triple a ratings are not something we can afford to take for granted. So what's on the watch list from a credit rating perspective rating agencies are closely monitoring several external and structural risks, including items shown here. What we hope to stress is that these factors underscore the importance of conservative planning and flexibility. Based on recent 2026 outlook reports, the rating agency will leave most states, including our great state, will be able to balance slowing revenue growth against rising expenditure needs while maintaining ample reserve balances. However, we are all aware of uncertainty regarding federal policies in which states are navigating a complex fiscal environment that may result in pushing more cost to states. Regarding moderating tax collections, the rating agencies have recognized that Georgia has been very strategic in reducing state income taxes. Demographic changes include an aging population, which we're all aware of, and how that can potentially impact population growth, workforce availability, and service demands. Regarding reserve levels, we're in a great position having built strong reserve levels over the years. Event risks are typically outside of our control. I was very proud of how quickly you all responded last year to assist with the Hurricane Helene efforts relief efforts. I think the bottom line is, as you all know, budgetary discipline will continue to be critical as states manage revenue pressures against rising expenses while preparing for the win regarding future downturns. This is my most favorite slide of all. We are grateful to be invited to present during the budget hearings, especially thankful that we're not here to ask for any money. As I stated earlier, your work directly affects all that we do, and we sincerely appreciate all the effort it takes to develop a fiscally balanced budget that helps our agencies carry out their missions, serves the citizens of our great state, and protects our AAA credit ratings. Georgia's credit profile is anchored by conservative fiscal governance and a strong commitment to structural balance. The state has demonstrated time over time, a willingness to make difficult policy decisions to align expenditures with revenues. Strong reserve levels provide resilience against economic volatility, and it seems each year has its own flavor of uncertainty. A diverse and growing economy supports long-term revenue stability, and there's many reasons why our state continues to be the number one state to do business in. And although not flashy, conservative debt management policies, including annual 100% funding A-DEC, remain a significant credit positive. So I'm making a note that I should have ended my part of our presentation with the last slide. The main takeaway of this slide is that we do make it a priority to make our case why we are deserving of the highest credit ratings, which includes maintaining those key credit strengths I just talked about. These factors enforce why discipline, budgeting, and cautious debt issuance remain critical. We hope to post the State's debt management plan later today. Highlight serve that Georgia is in a great position of strength, in which conservative debt practices, strong reserves, and discipline financial management continue to support the state's AAA ratings. So again, thank you. Oops, I guess that's it. I don't see any questions. Oh, any questions? Sorry. Those were great slides. Thank you. Thank you. Thank you. No. I know there are no questions. Thank you very often. Representative Spinson is going to ask you about a building in Taylor County, though. Oh, oh. It would not be. Thank you. Thank you. Thank you. I'm going to say something. Thank you. Thank you. Thank you. Thank you all for allowing us to be here today and present until a little bit of our story here. Hard act to follow the finance committee, Diana Pope and her team. I was appointed in 2019. She's got a great job, and finance and construction works day-to-day together, and she's got a wonderful team. So it's been great, and an opportunity, and a privilege to build a team around that as well. So Diana, thank you again for what you do. As just because of the state property officer, my name is Marty Smith. Under per view, I have the three divisions, Scott, the Georgia Building Authority, where we manage about five million square feet here on Capitol Hill from Badging Parking and the cafes and everything else. So if it has to do with GBA, it has to do right here on Capitol Hill all the way to the Governor's Mansion. With that being said, SPC, the State Properties Commission, we're basically the real estate arm for the state, where we help agencies, where we are purchasing land, where we are setting up leases for the state, or easements, and we do space utilization to help agency stay within their budget and their future growth as well. And then obviously, one we're going to talk about today a little bit more is just big. The Georgia State Finance and Investment Committee, we are the construction side and work hand in hand with Diana, as we each agency gets money from the General Assembly, whether it be bonds or cash each year. And then we're required to go out and procure and bring in agency agencies, General Contra-\n\nto do the building, remodeling, whatever we're doing for the state agencies there. With that said, and I was appointed in March of 2019, when I came on board, there were 146 active projects in Giswick, roughly about 1.2 billion under construction. As of December of this past year of 2025, there's a total now of 246 active projects and approximately 4.8 billion under construction. So you see how we've grown in just seven years and we've been able to do that with the generosity of the money coming to us, but we built a great team to work and we're taking on a lot more projects. We were challenged when I came on in 2019, to dive in and start working on the construction manual and contract for the state of Georgia. What we faced with, unfortunately, is that small little implement that jumped in was called COVID. So it almost delayed us to almost two years, but what it did allows to do was pull the three agencies together. We had shared services and we were reporting to Commissioner Greg Dozer at a time and he challenged us, said they'd been trying to get the three agencies together in the same building for 10 years. So we were able to make that happen. Of course, you'd see 1MLK is gone, so we are all located at Trinity, Washington now, and all agencies with shared services are located in one building. But one of the big things when we started changing the contract, we heard a lot of negativity across the state, how the contract used to be, the award system used to be, and our goal was to bring in people, get outside resources, and let them comment and bring in and help us make changes to this contract. What we found out is the average commission fee for contractors at the time was 11.88%. And that was awarded and negotiated after the contract was awarded on each job. The fee came into premise at that time. After changing the contract, we decided fee needed to be a factor on the input when we were selecting. What we'd heard is that everybody was going to quit working for the state. And I'm happy to say that the average C&N contract fee now has dropped from 11.88 down to 9.03. And 100% of that money goes back into the project. So we're not getting to retain any of that. But it is better, being better stewards of the money with the state, and we're getting a better project as well. Even with this change, we have been able to increase participation with contractors all over the state of Georgia. And we're pleased to say we're doing more work with more people than we have. People that used to say it was hard to do business with the state. We've opened the doors, applied training, different opportunities for them to come work with us. Leave it to me to tear it up. All righty. Our GFRIX projects right here on this next slide, I'd like you to look at is construction schedules. Right now, out of those 246 projects, 149 projects are in the design phase, 45 are roughly and actually under construction and 52 projects are in close out. But even with that total of 246 projects, only four are behind schedule and one is ahead of schedule, but the rest of them fall on schedule. And that's pretty good, considered we've got that many projects across the state. The next slide you'll see, what is very impressive, the reason we find out people love one is the money with the state is always good. Number two is when they submit an application, we're averaging them having money back in their hand once we approve and pay application within 16 days. And that's phenomenal when the national average is 83 days. So people love working with the state because we pay our bills and pay our bills on time. So contractors receive it in a very timely manner. Well, that being said, the next just project, almost five billion that we've got to under right there represents over 28,000 construction jobs across the state of Georgia of each community of people getting involved with the state and a lot of those are first time contractors. Right now I'm calling Mr. Gerald Pilgrim real quick, put on your seat belts, we're going to take a quick tour around the state of Georgia, get a few highlights of some projects. We're going to run around the state and land right back here on Capitol Hill to give you one you all want an update on and ask new L.O.B. building. Thank you, Mr. Smith. And I think that is one of the things that what this committee does, what the General Assembly is done by investing in these projects, the impact that goes into local communities. We're going to kind of talk about that a little bit and that the money goes in and Chairman and Hatchet and I've had a conversation and one of the things that I think the General Assembly is not aware of, even on state construction projects, we pay sales tax on those projects. So not only that, we're paying money and it's going into the local community where it's being built. So that is part of the state law we've gone through, that's part of revenue, the attorney generals opinions. So that's money that's going back in just like there. So we're adding services to the community in addition to some of the other things. But we'll go to think of all of y'all know about some medical college, new medical college at the UGA, $100 million project. Hopefully we'll have this completed November 15th, and $25.26, and what's unique about that $100 million within 35 miles of Athens, 25 million of that, so 25% of that are subcontractors that are located in that community. So we're think that's a very tailing, you'll see that is a pretty good average, most of them. We have the Larry Walker arena in Perry. That one has not started construction yet, but it's an $18.5 million project. The local contractor that was the contract selected was local within the community within several miles of the community. It's anticipated that the subcontractors are probably all going to be regional and within that community. So all those people are going to be working in those areas. Ms. Gogi, we've got the Commissioner, DJJ Commissioner of Moments ago, $23 million project over there within 28 miles of there, $6 million of that is into the local community. Waco, which is out in, we're marting our from out in the West Georgia area, small project, $10 million project, but $5 million that are within people within 10 to 15 miles of the campus, additionally the general contractor was located 10 miles, went through competitive process to be selected, Multie Georgia, $37 million project started nothing, it's wrapping up very hopefully within the end of this month, $5 million of that there. We don't have a big impact with all the construction going on in Savannah. But we all know with the impact that that will be, that construction starts in, they've got through all the area, going through final pricing, starts in April, finishing in May, 2028. We've washed the state prison, we've got the commission back there with his staff, so $876 $2,000. All the important things that that will be for corrections, but in Washington County, what is it mean? These are the local, you'll see on one side the local vendors that are actually participating in this project. This is a very complex project. It takes a lot of specialty people coming in. We've got people in the region, there'll be, but there'll be 500 jobs for two and a half years additional added. There are people going to come in and use the services and everything in that community. We're working with the local development authority about trying to find more businesses that could have opportunities as the construction starts that can provide help labor, other things along that lines in there. The Chamber of Commerce is working with us doing a guide for the 500 people that have come to this community that need to know where to buy groceries and eat. They're doing that. So we're proud of that local participation with there. That takes us to legislative office building. I think all of y'all like to hear that and that's what we're going to go from there. That's what's coming up over there. You'll see to the left, January 25 of last year. We were all sighted. This is January 1st of this year. It is flying up. So that is a $324 million project. We will be complete and have everyone in this being able to begin seats by October 31st of this year. So it is a very aggressive schedule. Our contractors have stepped up to it. We're very proud of that. Economically, you know, regionally this big for Georgia. It'll be something that I think will be added benefit. And as you see the bottom slide, well, the top slide is the balcony that will be looking out on the 5th floor, looking out to the Capitol, the view that will be a, that members will be able to take guests out. They'll be able to have receptions out there. And then the bottom view is the side view. We didn't get the front view when this slide, I don't know why, the side view from their new appropriations room. So next year this committee will be able to both house and senate that are members of the committee will have their own seat. They'll have a computer monitor in front of them. They'll have a comfortable chair. They'll be additional seating in the back for the public and for members that are not part of the committees. So very proud of that. And from there we kind of just take your questions and we've got a lot of things to go with from there. Thank you all. Any questions? Well, thank you for all the work you all have done. You're doing. We're all anxiously awaiting. Definitely that last one. This might be the last day of joint public hearings in this room. How about that? Thank you for having open and if there anyone like a tour we're giving tours at later times they just come and schedule one and we'll get you all over there. We will. We're done for lunch. We'll come back at one o'clock. And what we're going to do is everybody's since we're ahead we're going to push everybody ahead so we can finish earlier. Commissioner Walter Raven will be here at one director Johnny Sabo 145. Commissioner Nunn, 215. Director Nunn, 245. Thank you. Thank you. You",
  "updated_at": "2026-02-13T12:30:53.661426+00:00"
}