{
  "video_id": "Opnroz_3VX8",
  "url": "https://www.youtube.com/watch?v=Opnroz_3VX8",
  "title": "3/22/23 - Committee on Public Safety",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 17,
  "summary": "Overview:\nThis Georgia Senate Committee on Public Safety session focused on discussing and debating House Bill 348, which aims to update school camera laws in the state. The committee heard testimony and made amendments to the bill before potentially moving it forward.\n\nKey Actions:\nNone detected\n\nBills Introduced (First Reading):\nNone detected\n\nNotable Moments:\n- The committee chair thanked various staff and support personnel for their work in facilitating the committee meetings.\n- The chair noted that House Bill 301, related to the \"Protecting Victims and Dismantling Georgia Street Gangs Act\", would not be discussed again as it had already passed through the Senate.\n- The chair walked through the various sections of the substitute version of House Bill 348, explaining the changes and rationale behind them.\n\nVotes:\nNo recorded votes detected\n\nAttendance:\nQuorum present, though the chair noted the absence of the bill's sponsor, Rep. Collins, at the start of the discussion.\n\nAdjournment:\nNot specified, but this was noted as the last public safety committee meeting of the year.",
  "transcript": "You\nYou\nWe're going to call this meeting to order, as others come in, and we will catch them up.\nWe're going to have our very own Valencia C, our senator, to open us up in a word of prayer.\nWill you bow with me?\nFather God, I come to you once again just asking for your edge of protection all around\nall of us Lord, we ask that you just keep us in your arms and in your bosom and watch\nover us Lord. Give us and our families all the peace and grace that you have in your power\nin Jesus' name we pray amen. Amen thank you. This is going to be the last public safety committee\nfor this year and I want to take a moment to thank everybody that helps outside of just obviously\nWe are committee members, which we'll recognize later.\nBut we have right here Miss Allie Farmer, who actually does all of this work to pull it\nall together.\nSo, thank you for your great work, Allie.\nEven when we give her last minute substitutes, five minutes before the meeting starts and\nshe's got to print more folders out.\nAnd then right behind her, we've got Mr. Sean Cunningham, who has been our aide this year,\nwho's done phenomenal work.\nAnd I think maybe the first aide ever to actually pass a bill out of this committee and body.\nSo outstanding work.\nCarla Dawson from Senate Research over there.\nThank you for all the work to put together all the summaries\nwe have and all the information we need\nto make sure we're processing this properly.\nAnd then we've certainly got Ms. Rachel Moore over there\nwith the press office who puts all this stuff available\nand makes sure we turn the microphones on and off\nand then puts everything out properly.\nAnd then last but certainly at least Ms. Jenna Dullday\nwho we keep awfully busy time here\nthrough legislative council.\nShe does great work both before and during\nand sometimes after our meetings to make sure we're in the together.\nSo thank you to all the folks who make this process work.\nWe greatly appreciate your time.\nWe are going to hear two bills this morning to let you all know that we're going to start\nwith House Bill 348, which is going to be the school camera update bill.\nAnd then for those who have an interest, House Bill 301, most of that was combined into House Bill 348.\nThat is now a different bill.\nThat is the bill that passed through the Senate Committee\nand the Senate already, both this year and last year,\nwhich is the Protecting Victims and Dismentaling\nGeorgia Street Gangs Act.\nBecause that has already passed,\nwe are not going to do testimony on that again.\nSo if you're there for that one,\nI'll give you a little bit of your time back in your day.\nAll right, so we're gonna get in and start with 3.48.\nLooking for Chairman Collins,\nand I do not see him handy.\nSo I will start going through the bill, and when he gets here, we will catch him up.\nSo in front of our committee members, you should have a substitute to House Bill 338,\nthat's LC 39, 3922.\nIf you'd like to speak on this bill today, there's a sign up sheet right up there.\nThose that have been here a while know my rules.\nIf you don't fill the entire sheet out, you don't get the talk.\nAll right, so let's go through this bill.\nThis is a compilation of bills that have been passed\nin both the Senate, as well as the House,\nas well as other people's input to try and come up\nto a creative compromise.\nI know some people are happy about part of it.\nSome people are disappointed by part of it,\nwhich usually tells me that it's a pretty good bill.\nWe're going to move through this.\nFirst thing we're going to start out is on page two, section one.\nWhat that does is identify as a make sure\nthat a school zone is actually the existing master state order\nof accordance with the school area is.\nIt does not go a thousand feet before, after, or through.\nIt's actually just the school zone.\nI think that's pretty straightforward.\nSection two, which you'll begin on page three, make sure\nthat the signs are properly there, warning folks\nthat their speed detection devices in.\nI think most of these are there today, but this is just\nto make sure we clean up the code\nand make sure they're properly posted so people know what the zone is and then it's under a speed detection device camera.\nOn Section 3, this is specific to the evidence contained by the law enforcement officers in that area,\nthat we will not be using other traffic enforcement devices outside of what these are.\nYou're going to see this in a couple of areas specifically,\nif you've looked at the next page,\nthat no automated traffic enforcement safety\nshall be employed by any county, municipal,\nor campus law enforcement.\nWe apparently have some challenges now\nthat at least one city in Georgia\nhas put standalone speeding cameras in.\nAnd not only is that not allowed in our state of Georgia,\nbut we want to make it abundantly clear\nthat we do not want to live in Europe or in any state.\nAnd there is violations for that as well.\nYou will see in section four beginning on line 99 that that is prohibited and they can be penalized if they do such.\nSection five, this is the time of the day that cameras can run.\nThere have been a lot of questions and concerns about this and working with all the stakeholders.\nWe have made that the decammers can be an operational 60 minutes before school starts in the morning and 30 minutes after and then in the afternoon it's backwards 30 minutes before a school ends and 60 minutes after.\nSo limits the time to when schools in session but allows for the concerns that people had mentioned about people getting the school early for activities or being at school afterwards for activities.\nNext thing is the only governing body,\nthis was Senator Robertson's bill if you remember,\nthat's authorized to do this work and put him in,\nis actually the local county municipality,\nwho are the ones who are responsible\nfor maintaining the roads,\nwho respond to accidents,\nwho if there was not any other devices would be the people\nactually out there running radar and citing people.\nThey are ultimately control of the roads.\nI know there are some questions about the schools,\nbut the schools do not maintain the roads.\nContinuing on to the next page on page seven,\nthis just makes sure a cleans up some stuff\nfor first class away was written,\nbut also that it comes from the Department of Revenue.\nThank you to Austin Gibbons,\nthe Department of Revenue.\nWe've got a bunch of cleanups in here for them as well,\nwhich we'll talk about in the end.\nAll right, we're gonna continue on.\nThis allows someone, if you look on page eight,\nThat they will be assigned a hearing date in order in 60 days after the issue of the ordinance\nHowever, if you were not driving your car you also have the ability in this bill to sign an affidavit very similar to the language\nWe if you remember we put in years ago for the hands-free driving law\nMoving on section or sorry to page 9 a civil monetary penalty\nshould not be taxed on any fine penalty for your search\ncharge based upon the penalty.\nSo we're not going to tax a civil penalty.\nMoving on after that, if someone does not appear or pays\ntheir fine late, there's no more than a $5 late fee\nfor an unpaid civil penalty.\nThat is on the bottom of page nine.\nContinuing on, there's some clean up language in here.\nabout penalties, they're all just more consistency here.\nIf you flip to page 12, that's the next part.\nAny funds that are gained by the school's own cameras\nwill first be remitted to the police offices\nand newity benefit fund for that city or county.\nTherefore, making sure that they are helping to pay for\nand fund the pension system there,\nand then everything else will be directed back\ntoward things for public safety initiatives for local law\nenforcement. Moving on, this is pretty straightforward\nlanguage here. Some clean ups. Let me get you to the next\nchanges. We do get to the part of section 10. This is where we\nget to the cleanup language for the Department of Revenue.\nIf you remember, there is a concern about the work that was put onto them of sending out\nall the notices and then tying it to a vehicle, then that a vehicle could not be then traded\nor sold, et cetera.\nThat cleans it up and takes that civil penalty away from the actual vehicle itself.\nAgain, thank you for everyone working for that.\nThat is in.\nOne second, Mike.\nLet me get you the right line number here.\nYes, thank you.\nToo many lines in front of me right now.\nI think, yep, and that's the rest of its Department of Revenue Cleanup Language that\ngoes with that.\nThere's a lot of information in this bill.\nI want to thank the folks that gave us feedback.\nOh, there's the author right there.\nChairman Collins, would you like to come to the podium\nand talk about your bill?\nAt all, I know I just kind of took people through it.\nCome on up, so all the folks at home can see you.\nWe certainly can get you on.\nNope.\nAnd we did not make any changes last night\nthat we were on email.\nWe decided to keep it as this.\nThank you for here in the bill, you know, the genesis of this bill started out.\nExcuse me, I ran up the steps, I'm a little bit out of breath.\nTake your time, we're all right.\nYou're already a chance sir.\nYoung as I once was.\nSo the genesis of the bill was to clean up the title holes.\nAnd as I got into the bill, I started working it and realizing that there was a lot of other issues.\nI know you went over the changes that were made and you know if the committee\nfeels passionately about those I certainly would not stand in the way of those\nbeing made and just ask for your favorable consideration. All right questions\nfor Chairman Collins. I've got what number are you there? Senator Dukin. Good\nmorning. Do you want me to really ask a long question so you got chance to\nto catch your wind or if you'll vote to move this bill you may ask me anything I'm ready\nto be done. Hey look at go to 180 on page eight please. Okay. Yes tell me how that plays\nout tell me how that works.\nBut if you if you swear in a statement that you were not driving the vehicle, yes, that\npart.\nYeah.\nThen you.\nSo I'd just do a sworn affidavit that I wouldn't drive in the vehicle.\nHow many times can I do that?\nI'm assuming you could probably do that until the, let's say you can't.\nOkay.\nthe only thing I would mention there because this was the same thing that we did for the hands-free\nlaw. If you say that but they've got you there and you swore in affidavit, you're going to be in a\nlot more trouble than that ticket. Okay, that's where I'm going with it. What is, if I do a false\nswearing on this. I think I'll submit a gel for that.\nHey, can. Okay.\nI think you're hard, man. You're hard.\nWell, that was not what you do that. That's one of those things.\nYou know, the wheel's not perfect. They're a lot of...\nThis wheel's a lot different. It deals with civil monetary penalties, not traffic citations, so to speak.\nSo, we're trying to make this as line up as much as we could with the citation part of\nthe traffic.\nDon't get me wrong.\nI think it's a very good bill and I do intend to vote for it.\nI'm just looking at something that we're going to probably come back to in a year or\nso and say, how are we going to tighten this up?\nWell, I can tell you that the feedback that I've gotten from our constituents and the feedback\nthat I've gotten from those House members from around the state and even some of the\nother senators I've spoken with.\nThat's not the issue with this legislation.\nIssue with this legislation is the fact that you have those silimentary penalties are\nnot being paid and they're surprised titling is what I refer to it.\nThat's become a really real issue throughout the state.\nAnd then the fact that those cameras are operating throughout the entire day and not just\nin that window, that's the other issue that we see.\nI'm glad you addressed those here.\nAll right.\nSome oxygen too.\nSo, Phil.\nAre there questions for the chairman?\nSeeing none.\nNobody has signed up for this bill.\nAt the appropriate time, Mr. Chairman.\nAll right.\nIt is the appropriate time.\nI move that we do pass LC-392-2 Sierra.\nSecond from Senator Payne.\nFurther discussion with the committee members?\nWe do.\nSeeing none, all those in favor please raise your hand.\nOne, two, three, four, five.\nIt is unanimous.\nThank you.\nI appreciate you.\nThank you all very much.\nAnd we'll move you on to the rules.\nCongratulations.\nAll right.\nNext up, this one is going to be fairly simple.\nThis is House Bill 301.\nIt is not the one that originally came over.\nThank you, Representative Ridley.\nHe and I work together to incorporate much of his changes\nonto 348.\nThis is now the bill that passed with bipartisan support out of the Senate,\nwhich is dismantling Georgia Street Gangs and protecting victims.\nThis is the exact language we passed both last year and this year.\nBecause we've already gone through committee and I'm like that,\nso we're not going to do testimony on this bill today because it's already gone through twice.\nWhat you'll see is this is actually Senate bill 12 and 11.\nThe last part is for the GBI, if you remember, allowing them to work either concurrently or\nindependently for anything related to terrorism that would be involved in cyber-domestic\nbiological, chemical, and nuclear terrorism.\nSo again, you've all seen this bill multiple times.\nIt's not new language.\nAny questions from the committee members?\nIt is the appropriate time.\nGo ahead, Senator Payne.\nYes, Mr. Chairman, I'd like to make the motion do pass on LC393921S.\nfrom Senator Goodman, further discussion from the committee members.\nSo you know, and all the favor, please raise your hand.\nAll opposed?\nUnanimous, okay.\nGreat.\nWell, ladies and gentlemen, thank you so much for coming today.\nThis final meeting of the 2023 legislative session\nfor the Public Safety Committee is hereby adjourned.\nHave a great day.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:18:15.427643+00:00"
}