{
  "video_id": "OU8EeWlTmgU",
  "url": "https://youtu.be/OU8EeWlTmgU?t=862",
  "title": "Georgia House - Day 5 (2026-12-05)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": "2026-12-05",
  "duration_minutes": 195,
  "summary": "Overview: The Georgia House session included a special announcement about a new baby born to a representative, as well as an opening prayer and hymn led by a guest chaplain from Loganville.\n\nKey Actions:\n**SB1**: No action taken\n\nBills Introduced (First Reading): None noted\n\nNotable Moments:\n- Introduction and prayer by Rev. Calvin L. Mapp, pastor of Morningstar Baptist Church in Loganville\n- Rev. Mapp led the House in singing the hymn \"Give Me That Old Time Religion\"\n- Rep. Ray Martinez introduced Rev. Mapp and praised his work in the Loganville community\n\nVotes: None recorded\n\nAttendance: Quorum present \n\nAdjournment: No specific adjournment time noted. Next session scheduled for 2026-12-06.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you the I want to make an announcement before this chaplain and I've heard him pray this morning. I understand he's quite the prayer. He's already approved that. He's got some special talents. We all are going to enjoy our chaplain today, but I want to make an announcement. We have a new addition to the state of Georgia. Congratulations to Representative Phil Olailly and his wife Sabrina on the birth of their second son, a baby boy, mom and son are healthy and doing well. A baby boy, that's awesome. Congratulations. As is our custom, we will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 111th House District representing Rey Martinez, representing Martinez. Thank you so much, Mr. Speaker, fellow colleagues. What a beautiful day it is outside. What a beautiful day. I'm a speaker and colleagues. I rise today to introduce you not only to a beautiful friend and great friend, but Loganville's pastor and spiritual leader. When I decided to run for office in 2022, I asked Reverend Mapp, that's pretty good for what kind of week we're having, right? Reverend Mapp, to pray for my campaign and now to continue praying for a public service for our state or Georgia. Reverend Calvin L. Mapp senior was born in Atlanta, Georgia in 1974. He was called to preach the word of God since then he has dedicated his life to serving Jesus Christ. In 1969, Reverend Mapp joined the Air Force and served honorably for four years. During his time in the Air Force, he was a military police officer and was stationed in Korea at the Hill Air Force Base in Utah, where he met his lovely wife, Magna Mapp. They have four children, Wendell, Mary, Calvin, Jr., and Kevin, 11 grandchildren and two great grandchildren. He attended Carver Bible College, entered the non-Masinoleological Center. Hey, that's hard for me to say. And graduated from Liberty University. During his ministry, he was pastor several churches of Georgia. He is a dynamic speaker and has been asked to speak throughout Georgia, Tennessee, Alabama, Ohio, Utah, Connecticut, and Washington, DC. For the past 18 years, Reverend Mapp has been the pastor of Migrate City, Morningstar Baptist Church in Loganville, where he is an active member of the Loganville Christian community. He keeps busy by supporting the youth, visiting sick and homebound, participating in Loganville Community Prayer meetings, and also participating in the Morningstar Fund for Homeless. Previously he has been asked by the current mayor and past mayors of Loganville to pray at the Loganville City Council meetings and at the Loganville National Day of Prayer event. LoganMapp is a dedicated Mr. and loved by all who know him. And I love this man right here. He continues to do such great work in the city of Loganville. And I want you all to please welcome our pastor in Loganville, my pastor, Pastor Mapp. Thank you, brother. Speaker, to pray and to all of you. I thank God for this day. This is a beautiful day. It's cold but it's a beautiful day. I wish the family would have waited to next week to let the baby be born on the 14th. He would have been having birthdays together, amen? I'll be seven years, four years old, eights, thirteenth, the year seven to fourteen. What a birthday gift the Speaker of the House invited me to come and stand beside him with that beautiful smile. Thank you, brother Speaker. I'm honored. I never thought in all my days that I would be standing here in this place. Thank all of you for accepting me right now. I'm not going to preach because you didn't ask me to preach. You asked me to pray. Amen. I can preach all day. Y'all don't want me to start. Amen. But I want to thank God for morning star Baptist Church in Loganville, Georgia. Every member, I want to thank Dan Curry, the mayor, when I first came to Loganville. We have the National Day of Prayer at the City Hall. I prayed that day. I prayed. The next thing I know I was coming to the Council meeting praying. At the end of my friend, brother Ray, when he became the mayor, he let me come and skip who's the mayor right now. He let me come. I'm saying to these mayor, thank you so much for opening the doors. Amen. I hear somebody saying preach. Amen. This said the Lord's standing in the way and see and asked for the old path. Where is the good way? Walk there in. We shall find rest for your soul. Jeremiah 6 and 16. Where is the old path? What happened to that old path? Is still there? None of us, we walked in that path. But many will not walk in that path. So I pray today is that we all walk together in Christin love. Amen. That we would let God be first the leader and then we father the governor and lieutenant governor and then the speak of the house. And we do what we do best. Amen. Whatever we do, we do it for Christ. Someone wondering why would you choose this old passage of history this morning? There's a word there that say where is the old path? All of my life. I've been in the church. My dad was a preacher right around the corner on Kennedy Street, Lillie Other Valley Baptist Church. My dad and my mom, they taught us my brothers and my sisters to walk in the path of God. If you trust God, you don't know what's going to happen. If you seek God every day of your life, he will reward you. And I'm so thankful today that one of the things about me being in Loganville, I came here today to give you a scripture and a prayer. But that's an old hymn when we have prayer meetings and everything. The men have asked me to sing a song. And I want everybody, if you would help me with your hands, you don't have to sing if you don't want to. Amen. There's an old hymn of the church that keeps us together. No matter what happened in life, there's an old hymn. There's a hymn that say, there's a hymn, so deep. Give me that old time religion. Give me that old time religion. Give me that old time religion. It's good enough for. Oh, give me that old time. Oh, give me that old. Please give me that old time religion. It's good enough for. Oh, it was good for my dim mother. It was good for my dim mother. It was good for my dim mother. It's good enough. Just give me that old time. Please give me that old. If you sing it long enough, your feet might start moving. Oh, time really. Yeah, it's good enough. Oh, it will help you when you're in trouble. It will help you when. Oh, it will help you. Oh, it's good enough. Just give me that old time. Please give me that old. You may not sing right now, but if you keep living, God will let it come out your mouth. Oh, time. Yes, you know why it's so good? Last week when I got the word to come here, I hadn't been to sleep since then. Amen. I've been praying and I've been praying. I told the speaker that in January of this year, I was in Salt Lake City, getting ready to do a eulogy for my cousin. I was in the room in the phone, started ringing.\n\nwho it was calling me all the way from Georgia. And brother, as I said, pastor, I'm going to talk to the speaker, and we're asking where he invites you to come and grace all of you. This is the best birthday gift I've ever had in my life. I never thought in my days that Southwest high, right out there in Southwest Atlanta. I never thought as I passed by the dome. I never thought that I would stand here and be welcomed by the speaker of the house. What a joy. The reason why I didn't talk too long is because the paperwork say five minutes. And you know what? Obedience is better than sacrifice. Because if you be obedient, you may get another chance. Now I guarantee you, next time I come, you're about to be ready to shout, amen? And give God glory. Give him praise. Thank you again, my dear friend. When he got ready to run, he called me and asked me to come to the campaign. As he got ready, he started out, he called me past the cabin, y'all can call me cabin too. Amen. As you come in praying. I, Heavenly Father, we thank you for this opportunity to be in this gathering. Please help us to serve you in all that we do. Help us to honor you today and every day we pray for our governor, our lieutenant God, and our speaker of the house, and all the members of this great place we pray that this body will always be ready to do what God would have you to do in the name of Jesus. I pray. He I pray, O Lord. He I pray. Thank you, Lord, for this opportunity. It'll be in my heart. It'll be in my spirit. I love you, Lord. As I told the speaker, I believe my father and my mother and my sister is looking down from heaven on the great state of Georgia. There's no place like home. Thank you, Georgia. Thank you, Governor, Lieutenant. Thank you, Brother Speaker. Thank you, Brother Ray. For giving me this opportunity in Jesus name. Amen. Amen. Amen. We'll play a play. We'll play a job play. Brother Calvin was born just across the street at Grady Hospital. Soon to be, wait a minute. Don't come down, we got to take trouble. He was born almost 74 years ago. Right across the street in the old Grady Hospital. And we thank you for your service for our country. And thank you for an inspiring message and song this morning. We're so pleased to have you. Thank you. Thank you. Thank you. Doorkeepers will unlock the doors. Members, you may greet Brother Calvin in the south any room. And certainly let him know how much we appreciate his message today. What an inspiring message. Thank you again, sir. The doctor of the day resides in representing the extra pennage district. Dr. Jeff Marshall is our doctor of the day down in the in the medical aid station. Take time to go by and speak to him and thank him for being here and taking care of us today. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits, Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. Thank you, Chairman Tarvan. Is there any objection to the spints with the reading of the journal? The Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none. And the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative station 104th moves to follow me establishes the order of business and her first part of the period unanimous concerns. First reading and reference of House bills and resolutions. Reports of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none and the resolution is adopted. Mr. Clerk, first reading the bills and resolutions the clerk will read. House bill 5E, Expo, motion of the Beverly and the 143rd of Bill B. Tallahdack, required by for the composition and number of state house districts. Rear portionment and redistricting. House bill 6E, Expo, motion of the Beverly and the 143rd of Bill B. Tallahdack, required the composition and number of congressional districts. Rear portionment and redistricting. Senate bill 5E, Expo, motion of the 13th of Bill B. Tallahdack, amendment act, reading the state court of Turner County. Intergovernmental coordination. Dr. Police, first readers. We have no second readers. Mr. Clerk reports the standing committees the clerk will read. Representative Richard Smith and 139th District Chairman on Committee of Rules submitted the following report. I speak to your committee on rules. Has that under consideration the following resolution of the Senate? And is instructed to meet the report the same back to the House with the following recommendations. Senate resolution 6E, Ex, due pass respectfully submitted. Representative Richard Smith and 139th District Chairman. That can please the reading the reports of standing committees. Thank you, Mr. Clerk. Members will please take seats. Members will please take your seats and come to order. Members in the any room I would like for you to come to the floor please. We have a special morning order. Members will please come to the floor and give the representatives in the well your full attention. Members will please come to the floor and give the members that are about to present a morning order your full attention and respect. Members please take your seats. Just ahead we're having some technical difficulties a little bit this morning. Justin, here we are. We're good. Justin will, I think the mic is on. The mic is on. If you, the mic's not on. If you have a problem just bear with us this morning and Justin will certainly rectify any concerns that we have as far as the microphones work. This time, representatives long, representatives pennets and representative Roberts are recognized from morning order. Members will please stand. Thank you, Mr. Speaker. I stand before you today to ask you to share our regrets to the Lubin family who joins us up in the gallery today. David and Robin Lubin lost their daughter Rose a month ago. She was a Georgian native. She grew up in Dunwoody. She went to Dunwoody High where her classmates reached out to me and told me of stories of her and I vaguely remember seeing this young woman at high school games as a cheerleader and her reputation for being a fearless wrestler still roams the halls of Dunwoody today. As a young child, when she went to Israel, she met friends and she told them that she would return to Israel one day to serve and live in Israel. And she did that. Upon graduation, she moved to Israel and joined the IDF where she became a sergeant and much like in high school where she was the role model for her peers, she was the fitness role model for her peers in the IDF. On October 6, while off duty, the Hamas attack began and she defended her home area of kubuts from the terrorist attacks. On that day, none of her colleagues were lost, none of the residences were lost. Unlike the other areas that were under attack where so many were taken hostage and lives were lost. But a month later, while she was on duty, she was attacked and stabbed to death. It is a loss that is unfathomable to think about our youth passing away. As a father, I know the instinct to protect our children. But to be able to support them as her parents did, as she voluntarily chose to go fight for freedom and democracy. And in doing so, she made the ultimate sacrifice, paid the highest price. And it is a debt to the Lubin family that we can never repay. And so I share our regrets and our prayers to your family. And thank you for the sacrifice your daughter had to make in defense of Israel and freedom and democracy. Let us take a moment of silence. Thank you, Mr. Speaker. Thank you, members. And to the family, we appreciate y'all coming here to be with us as we honor Rose today, as you did. But a beautiful young lady, but a life of service to what she cared about, what this house cares about, freedom, democracy, the right to determination. Thank you for allowing her to live a full life and make choices. Thank you for that. And I will remind you all and remind us all that a story seldom told is soon forgotten. So never hesitate to tell her story as I know the community will as well. Thank you and our prayers are with you in these days that they come. Thank you. And if we can be of service in any way to you, don't hesitate to call on this house. Thank you. Thank you, members.ー Members , our posture is, we're Get in the couple of folks signed up, we're getting ready to move on to the rules calendar. We'll move on to the rules calendar. Mr. Clerk, if you'll read the caption to SB1X, 1EX, excuse me. Senate Bill 1EX by Senator Eccles, 49th, Kennedy the 18th, Gucci the 51st Robertson, the 29th brass, the 28th and others, to be a title and act to provide for the composition of number of state, senatorial districts to provide for a short title, provide for the contingent nature in this act, and the circumstances under which it shall not or shall apply. Mr. Clerk, I'd like to refer to the committee on re-apportionment and redistricting that committee recommends that this bill do pass. Before I recognize the chairman, chairman Leveritt to present the bill, I will remind members that rules committee has limited time, limited date to one hour for those in favor of the proposition, and one hour for those opposed to the proposition, and we will have a minority report and the chairman's time. So that's our posture. Mr. Chairman, are you ready? Chairman Leveritt will speak to the bill, SB1EX. Thank you, Mr. Speaker. Ladies and gentlemen of the House, good morning. I'm presenting to you today for your consideration Senate Bill 1EX, which we've got up on the screen here. If that bill, if passed by this body and signed by the governor, would adopt a set of electoral districts for the Georgia Senate. So we did the House last week and we're doing the Senate today. And when I presented House Bill 1EX last week, I gave you a little history to sort of put all this, or these bills in context. That background also applies to this bill. But I know I've already done it, and I'm sure all of you listened attentively and absorbed at all. Mr. Chairman, we use to spend just for a second. Yes, I forgot to make an announcement, make the members aware. Part of our technical difficulty is the screens are not coming down, so the map is up on the board. I know you'll probably have copies, but that's the reason the maps are the screens right down. Continue, Mr. Chairman. Thank you, Mr. Speaker. So just kind of reviewing the general overview and October of this year, Judge Steve Jones, federal judge sitting in the federal district court here in the Northern District in Atlanta, entered an order in which he ruled that the electoral district maps that we approved in 2021, including the map for the Senate, violate section two of the Voting Rights Act. As a result, he ordered that new maps must be drawn, but he graciously allowed us to remedy the violation by drawing these new maps ourselves. So Senate Bill 1EX addresses the portions of the judge's order that involved the Senate maps. Just with our House maps, Judge Jones, being ever the considerate and precedent following jurist, also gave us specific guidance on how we can comply with the portion of his order that involved the Senate maps. So he wrote the remedy involves two additional majority black Senate districts in South Metro Atlanta. That's on page 599 of his order. That's the portion we put on the screen last week. So now it falls to us, the general assembly to comply with Judge Jones's order. The bill you have before you does just that. It fully complies with Judge Jones's order by enacting the two required Senate districts and it places them in the South Metro Atlanta region. So we've got the maps up. I know they're a little tougher to see here. Could we try going to the modified, thank you. All right, so the two districts are up there are Senate District 17, which is in Clayton, Henry. It's sort of in the brown about the very center of the screen. And that's in Henry and Clayton counties and it resembles almost identically Mr. Esselstein's Senate District 25 from the grant litigation. He was one of the plaintiffs experts and then we have Senate District 28, which is anchored in South Fulton and runs up into Douglas and South Cobb. That's similar to Esselstein's Senate District 28 and that's also was a proposed map in the grant case. That was one of the plaintiffs. There were three pieces of litigation and they were all consolidated or I don't know if they were technically consolidated but they were sort of heard in conjunction. The Black Voting Age populations in Senate District 17 are 63.6% and it's approximately 56.42 in Senate District 28. So these are majority Black districts. Now let's just sort of drill down and we'll talk about these two a little bit. So Senate District 17, as I said, is parts of Henry and Clayton almost in the exact same location as the Esselstein Senate District 25. The district contains the panhandle of Clayton and southern part of Clayton, combined with most of Stockbridge and McDonough and it includes all of Hampton area. Judge Jones relied on the inclusion of most of McDonough Locust Grove and Hampton in the same district for this area and his order. That's at pages 285, 286 and 316 if you're checking it. The district bounty of 17 matches those communities in the center of McDonough. The Senate District 28 has parts of South Fulton West Douglas and South Cobb. The two plaintiffs experts in the two cases drew the district in two different places. One expert anchored the district in South Fulton as we have done here. District 28 is proposed as I said, anchored in South Fulton and ensures that Black voters in Fulton, Fayette and Clayton counties are all in majority Black districts. It includes part of the city of South Fulton and moves north into Allstale areas that the judge found in his order to share strong connections and be good communities of interest. It connects a number of suburbs around Metro Atlanta that are all experiencing growth and have diverse communities. This configuration of the district also limited the number of adjoining districts that had to be touched. Contrary to the assertions in the minority report which I'll anticipate we'll hear about later, these districts include almost all of the Black voters covered by the areas in the district proposed by the plaintiffs experts for those areas. As with our House plan creating these two new districts, it was somewhat disruptive not as much as to our maps, the five districts were our maps, but it was somewhat disruptive to the existing Senate districts, but it was less so because we only had the two districts to create. There are still ripple effects however even when you create two new districts, but they're not as substantial as in the House plan. Only 15 districts, the ones you see there before you, they're all in the Metro Atlanta area, are impacted. And that is less than would be changed by the plan submitted by the plaintiffs experts in the cases. As I mentioned when we discussed the House maps, these so-called ripple effects result primarily from the constitutional and legal requirements that the districts be the same size in terms of their population. We as a general assembly are allowed some statistical deviation and in Georgia we've traditionally limited ourselves to plus or minus 1%. So once these two new districts are dropped in areas and those boundaries of those districts were taken out of other existing districts then we had to add population to the existing districts from which these two were created to get the existing districts back to within the population deviation, which in the Senate the ideal size is 191,284 people. So like we did here in the House they took from neighboring districts and then the neighboring districts are short so they take from the neighbors and that process continues until it sort of works its way out. Like we did in the House the Senate followed existing traditional redistricting principles to work on the remaining districts. That includes maintaining district populations so the deviations are less than plus or minus 1%, limiting additional split counties, this does add one split county, Carroll County there. Drawing into districts utilizing the most recent precincts from county governments so that makes it easier on a local election officials, these maps will be consistent with what they'll have to administer in the next year. Ensuring all districts are contiguous, ensuring all districts are reasonably compact and shape and ensuring that communities of interest are protected as far as possible. And finally, avoiding the unnecessary pairing of incumbents as we did with the House map, Senate did the same. This plan involves no incumbent pairings. Every senator has a district in which he or she can run and no one is paired and the political composition the district is similar to the senator's current district. Now as you know my primary objective here and I hope it's all of our primary objective is to comply with Judge Jones's order to additional majority black senate districts in specified areas. This plan complies with the order fulfills our obligation as a general assembly with respect to the senate districts and asks that you vote in favor of it. Mr. Speaker, I'll hear for questions. Did gentleman have a couple of questions? The pro-tim of this House is recognized for a question the lady from the 47th pro-tim Jones recognized for a question. Well thank you, Mr. Speaker and will the gentleman yield? Yes ma'am. Please pardon me I have a few questions. Is it not true that the measure we're voting on today, the Senate map carefully conformed to the judge's order to create two additional black majority districts, avoided pairing any incumbent and kept all incumbents and seats that decidedly vote the same as the party of the incumbent but in contrast the Democrat proposed map plays two Republican incumbents and districts that vote Democrat majority. Yes ma'am I believe that's the each case. Does the gentleman from the Senate? I do yes ma'am. Thank you. Is it not also true that the Republican House map voted on by this body last Friday? Would result in three Democratic members through pairings and two Republican members by one pairing and one Republican being put in a Democrat majority district likely going home in contrast to the highly partisan targeted Democrat proposed map that would have resulted in six Republicans going home but not yet a single Democrat. Yes ma'am. And does the gentleman further yield? I do yes ma'am. Is it not further true that the Republican majority House map voted on by this body, carefully minimized pairing incumbents, avoided placing incumbents and districts with a majority of the opposite party and particularly shared the pain between the Republican and Democrat parties. Yes ma'am I believe that's an accurate statement. And further question is we will yield. And to place a point on the facts, is it not true that the Republican House map voted on by this body created three Democrat pairings and one Republican pairing as well as placed most unfortunately one Republican in a Democrat in a district with a decided Democrat majority which contrasts with the Democrat map that created two Republican pairings and a third Republican pairing containing three Republicans in the main in the Maiken area and it placed in a\n\nAdditional to Republican incumbents in districts that decidedly vote Democrat. That's correct, yes ma'am. And finally to not belay or this point, last question, Mr. Chairman. Is it not true that it was sloppy at best or calculated worst when the draw, and those drawing the map for the Democrat caucus placed three incumbent Republicans by the narrowest sliver possible into one district in the making area, all the while deviating ever so slightly in the same area to benefit a Democrat incumbent or Democrat incumbents. Yes ma'am. Thank you sir, that's all I have. Thank you. Gentlemen, has no further questions. Thank you Mr. Baker-Lazon. Mr. Baker-Lazon, I want to ask your favorable consideration of Senate Bill 1EX, and I'll yield the well. Thank you Mr. Chairman. You will certainly have your time when we complete those in favor and opposed for any further comments as a Chair. At this time we'll move on to those opposed, and I'll recognize Representative Alexander who has a portion of the time up to one hour for those opposed to SB1EX representative. Alexander. Thank you Mrs. Baker. You're good to start. Thank you Mr. Speaker, it won't be an hour. Good morning colleagues. I rise in opposition to SB1EX because it does not comply with the Judge Jones Federal Court order. Last month on October 26, 2023, a Federal District Court Judge ruled in favor of plaintiffs, affifiable, and found that Georgia State Senate maps violation 2 of the Vonor Rights Act. Specifically, the Judge wrote the court determined that in certain areas of Georgia, the political process is not equally open to Black voters. To comply with the Vonor Rights Act, the court ordered 2 additional majority Black Senate districts, we've heard that a lot, to be drawn in South Metro Atlanta. Specifically, Judge Jones identified 10 Senate districts in the area where 2 additional majority Black districts need to be drawn to remedy the violation of the Vonor Rights Act to increase opportunities for Black voters. Simply put, the court's order contained 2 directives, first that 2 new majority Black districts be created. And second that the new majority Black districts be created in the vote delusion area that court identified as not providing Black voters with an equal opportunity to elect the candidates of their choice. Unfortunately, the Republican map fails to comply with the court's specific order. In a Norris concerns raised by the public as well as the plaintiffs who testified against this, Republican proposal that has been accurately characterized as a shell game in a hold. Instead of creating 2 additional majority Black districts in the vote delusion area, as ordered by the court, the Republican plan moves Black voters around like puns in a gang. Republican's manipulation of the Senate maps fails to provide Black voters identified in the vote delusion area with new opportunities to elect their candidate of choice and violation of the voting rights. Moreover, the Republican map keeps illegal districts intact that the court specifically struck down as illegal. The Blank disregard for the Voting Rights Act is an insult to the legacy of civil rights and an affront to the principles of democracy. The open defiance of a federal judges order to comply with the Voting Rights Act is reminiscent of our dark past, in the response of southern legislators of the former Confederacy to Brown versus Board of Education. Here in Georgia, southern Dixacrats, who are today's Republicans, take every action to fight the integration of Georgia schools, including passage of a constitutional amendment to force the governor to cut off state funding to any school that de-segregated what a sad day in Georgia, whereby Republicans are taking our state backwards. What a sad day whereby to maintain political power Republicans have to dilute Black Voting power. The dilution of Black Voting power is not merely a political issue, it is a moral imperative. Black voters have fought long and hard for the right to vote, and it is our duty to ensure that their voices are heard. When we silence their voices, we de-untetermin the very foundation of our democracy. A yes on this map means you are voting to discriminate in the political power of Black voters in Georgia. We urge all members to vote no and to stand on the right side of history. Thank you Mr. Speaker, I yield the will. The lady has yielded the will, representing Draper, is recognized to speak to the bill. Thank you Mr. Speaker. Colleagues, I rise in opposition to Senate Bill 1EX because it does not comply with Judge Jones' federal order, and I am here to tell you why. As mentioned by my colleague, this Republican proposal, unfortunately, is nothing more than a thinly veiled attempt to maintain the status quo and continue to disenfranchise Black voters. In other words, the Republican proposal is a hoax. In the specific areas where the court found voting rights act violations, the majority proposal moves nearly as many Black residents out of existing Black majority districts as it moves in to existing Black majority districts. What do I mean by that? I mean that a net of only approximately 3,000 Black voters in the voter dilution area identified by the court were moved into Black majority districts. To add insult to injury, Republicans are trying to cover up this hoax with smoke and mirrors. They attempt to obscure what has been done in this map by reassigning the district numbers of multiple existing incumbents. But they cannot hide the truth. The truth is that this Republican map dilutes Black voting power just like the 2021 Republican map did. The Republican map does little if anything to improve Black voters ability to elect candidates of their choice. So let's look at Senate District 17. It's gray in the middle of the map in Henry and Clayton counties. The proposed Republican map creates the quote-unquote new Black majority district by simply moving Black voters from Senate Districts 10 and 44, who were already in Black majority districts. In other words, almost every Black voter in this new Senate District 17 was already in a Black majority district under the 2021 map. The Republican map also takes Black voters from Senate District 42, a non-Black majority district located outside of the court's vote dilution area of focus, into already majority Black districts. Moreover, rather than remedy Senate District 17 as enacted in 2021, which Judge Jones specifically found to be unlawful, Republican simply renamed the district Senate District 42 and kept its configuration the same with minimal changes. Lastly, the Republican map moves Black majority precincts in Newton County and Covington out of a Black majority district. Simply put, Republicans are shuffling around Black voters like a deck of cards rather than trying to comply with the Voting Rights Act. Is it too much to ask in this day and age to treat Black voters with the dignity and respect that they deserve? As noted in a memo dated November 28, 2023 from the ACLU representing the plaintiffs, a prime illustration of how the Republican map fails to rectify vote dilution as ordered by the court is seen through Alphapai Alpha plaintiff Eric Woods, who lives in Tyrone, Georgia. Under the Republican map, Mr Woods would continue to reside in a non-Black majority district, Senate District 16. Indeed, the Republican map leaves Senate District 16 entirely unchanged. Despite the fact that Mr Woods proved his case and prevailed in court, the Republican map provides Mr Woods and others similarly situated with no relief at all. As with the House Republican map, this map is unlawful. It does not follow Judge Jones's order and Judge Jones can and should reject this map. Now, you all can read the maps just as we can read the maps and you all have lawyers just as we have lawyers, right? And it looks like to me that you all want to send these maps back to court and not just to the district court but to the 11th Circuit as well. And that means that it could be years, years before these maps are finally sorted. That means that voters are going to face years of uncertainty and flip-flopping of districts and representation. And let's not forget our county election officials who have to undergo major adjustments every time a boundary is changed. That costs money and I hope we'll be considering appropriate budget adjustments to support our election officials come January. But in any event, because of these maps, we will see years of uncertainty. Our voters lose, our election officials lose, just so a few Republican senators won't have more competitive districts. It is amazing the lengths this body will go to just to deny Black voters an equal opportunity. And so I urge my fellow colleagues to vote no against these unlawful maps that continue to dilute the voting power of Black voters. Vote no against this Republican show of smoke and mirrors that continues to discriminate. All I am asking for is fair maps that give every Georgian the ability to freely elect their candidate of choice. Thank you, Mr. Speaker. I yield the well. Thank you, Representative Draper. Representative Becky Evans is recognized to speak to SB1EX. Representative Evans. Thank you, Mr. Speaker. Colleagues, I rise in opposition to Senate Bill 1EX because the Republican map for the Georgia State Senate is unlawful. Judge Jones can and should reject them. Unlike the discriminatory Republican map that continues to dilute the voting power of Black voters in South Metra, Atlanta, the Senate Democratic map complies with Judge Jones order and the Voting Rights Act. The difference between the two maps is important, not only with respect to complying with Judge Jones order and the Voting Rights Act, but because it demonstrates how Republicans and Democrats in Georgia treat Black voters. As we move into the 2024 election cycle, it is important for Georgia voters to understand who is for them and who is against them, who is on the right side of history and who is on the wrong side. Unlike the Republican map, the Democratic map complies with the Federal Court order and expands Black voters' opportunity to elect their candidate of choice in compliance with the Voting Rights Act. Unlike the Republican map, the Democratic map does exactly what the Judge ordered. It draws to additional Black majority districts in the vote dilution area, as my colleagues have talked about, where the court specifically found violations of the Voting Rights Act. In the Democratic map, the 16th and 17th districts are new majority Black districts and all of the proposed changes in the Democratic map are made in the area identified by the court. Unlike the Republican map that moves approximately 3000 Black voters in the vote dilution area to a majority Black districts, the Democratic map brings 150,000 Black residents that currently live in non-majority Black districts into majority Black districts. And the Democratic map moves zero Black voters out of majority Black districts into non-majority Black districts. Unlike the Republican map that modifies the boundaries of 15 Senate districts of which only eight were identified by the court as diluting Black voting power, the Democratic map leaves 46 Senate districts exactly the same as they were enacted in 2021 and modifies the boundaries of only those 10 Senate districts identified by the court as violating the Voting Rights Act. Lastly, the Republican map that changes district numbers to confuse and mislead the public, the Democratic map does not unnecessarily change district numbers or district boundaries have not dramatically changed to increase the Democrats' increase voter confidence and minimize voter confusion going into the 2024 election cycle. The difference between the Republican map and the Democratic maps are clear. This map, the Republicans it proposed continues to dilute Black voting power. In 2021 Georgia Democrats fought hard and voted against Republican maps that were ultimately struck down by a federal judge for being drawn in a racially discriminatory manner. We did all we could to stop these unlawful Republican maps. We fought against Republican efforts to discriminate a Black vote against Black voters. And when this opportunity arose to correct course, unfortunately the Republican party has decided to double down on discriminating against Black voters to maintain power. What a shame. Georgia deserves better. Georgia deserves fair maps that reflect the diversity of Georgia and make sure that every Georgia, regardless of every Georgia, especially Black Georgians, deserve the opportunity to elect their candidate of choice. For these reasons I urge members of the Georgia House of Representatives to vote no to these unlawful Republican maps. Thank you Mr. Speaker. I yield the well. Representative Reese is recognized to speak to the bill. So members will know when they go to the microphones you can tell from this one. We don't have the ability to alter the volume. So speak normally into the mic, but that if it gets a little louder or you can't hear you may ask him to speak up some, but I think you'll be good. Representative Reese. Thank you Mr. Speaker. Colleagues, I rise in opposition of Senate bill 1EX because the Republican maps from the Georgia State Senate does not comply with just Georgia's order. We were wisely reminded today by our awesome leader, Mr. Speaker, that a story seldom told is soon forgotten. I think it's very important to discuss the history that led to the Voting's right act of 1965. Knowing our history is so important, especially today, where there is an intentional effort to prevent Black history from being taught to the next generation. My grandmother, who was 89 years of age, born in 1934, worked 32 years for the state of Georgia cleaning floors and toilets and beds for people with disabilities and disabled veterans at Central State House of Representatives. She used to often tell me you cannot know where you're going if you don't know from where you came. The history of the racial discrimination in Georgia is deeply rooted in the legacy of slavery, segregation, and systemic racism. By 1750, a few years after the quality of Georgia was founded, slavery was permitted in Georgia. For more than 100 years, Georgia was a slave state that built his wealth on the backs of African American slaves. During this time, slavery became deeply ingrained in the social and economic fabric of Georgia. It was not until the defeat of the Confederacy in 1865 and ratification of the 13th Amendment to the Constitution as slavery in Georgia was abolished. Following the Civil War was the period of reconstruction that lasted for about 10 years, from 1865 to 1877. Efforts to integrate African Americans into civic life were met with fierce resistance, especially in former Confederate states, like Georgia. In 1868, three years after the abolishment of slavery, 33 African Americans were elected to the Georgia General Assembly. These were among the first African American state legislators in the United States. Twenty-four of the original 13 were ministers, just like the ministers that we invite every day to lead us into our opening session. What was the response from this body? Southern white legislators took action to expel the original 33 because they simply felt they did not belong. The third branch of government, the courts, had to step in and reinstate these legislators two years later, just like the court stepped in again to protect the voice and constitutional right of black voters in this state, which is why we are here today. Following the hope of reconstruction came the period of Jim Crow that lasted nearly 100 years from the late 19th century until 1965. States like Georgia implemented Jim Crow laws to reestablish white supremacy and control over African Americans by enforcing racial segregation and undermining the civil and political rights gained through reconstruction. My grandmother was born during this period. Many of the rights that I have today she did not have. 200 years of oppression gave rise to the civil rights movement in 1950 and 60s. That sought to dismantle the system of segregation and discrimination that we had inherited. By 1965 slavery was gone but Jim Crow was alive in Georgia just like other former states of the Confederacy preventing African Americans from voting and electing their candidates for choice. This is history. It's uncomfortable. The truth is not always comfortable. But as great Georgians we have accepted that truth and we have moved forward collectively to make a great difference for this state and its people. The civil rights movement led to the enactment of 1965 Voting Rights Act which is one of the most successful transformative pieces of legislation to address racial discrimination and voting. For more than 50 years the Voting Rights Act protected Georgia Voters for practices like drawing legislative maps and a racial discriminatory manner. And yet this landmark legislation was gutted and weakened by Republican appointed judges in 2013. And now today actions continue continuing their attacks against the protections of the Voting Rights Act persist. This Thanksgiving break I had family and time my wife and I decided to host for the first time. It was a great experience for us and as a young couple here in Georgia we were proud to accept people from all across the South East to our great state. So we can show off our amazing roles how economic development and why economic development is important to us. And we venture just a little up the road from Columbus Georgia to this place called the Little White House. If you haven't been there you definitely need to go sit. That was where President FDR spent a lot of his time. And there are some of my family members from throughout the South East learn about the President that worked and focused on bringing Americans together, providing opportunities for all. Opportunity is folks like my grandmother never had. On January the 9th 2023 I was sworn into this body. My grandmother sat right up there at the top row of the right part of this gallery. And when I was done I went to and I gave her a big hug. And she said to me son I clean floors on my hands and my knees so that you could stand on the house floor of the state Capitol. But that is not possible if all people are not giving opportunity to elect those that look like them. That is not possible if we're going to continue to play games with maps and put folks where we want them versus allowing folks to choose the people that they want. That moment in my eyes that moment in my soul my grandmother represented the long line of women in African Americans who have been disenfranchised right here in the state of Georgia. Though I remind you of our checker pass and ask you vote no on this bill we already know what will happen today. We were not ordered back here by Judge Jones to maintain the status quo. We were ordered here to change Georgia's maps so that they reflect the inevitable shift in Georgia's population and give voice to the deserving and innocent citizens of the state of Georgia. I want to leave you again what a great man once told us just this morning a story seldom told is soon forgotten. What will history reflect about this special session in the state of Georgia December of 2023. Thank you Mr. Speaker I hear the well. Thank you representative Reese that concludes the time the those have signed up to speak in opposition to SB one X we have a speaker in favor of this gentleman from Ben and we cross Georgia. Majority will be a check. Thank you Mr. Speaker it will take me very long to say what I've got to say here. I'm just going to go point by point sort of want to real folks back in here and read directly from the order. I think you know I get up here a lot and I say this we don't have the opportunity to come up here and make up the facts. We have an opportunity to come up here and actually read the words on the paper it's it's it's very clear. On page 509 judges Jones order I'm going to read the lines that apply to the Senate maps. Okay. Is ordered that two additional majority black Senate districts in South match Metro Atlanta are creating. That's that's what we're order to do and I heard a lot of I've heard a lot of this I've heard a lot of Democrat Matt Republican Matt. Judge didn't require us to draw a Democrat map or Republican map. He required us to draw one map one map and I will point out to my friends in the minority. In chairman in the chairman's committee the other day yesterday no one presented a map from the minority. Not not one map. So how do you take it under consideration if the map wasn't presented. Answer me that. Never never presented. So we're required to put together two. Majority black Senate districts in Metro Atlanta. Now we've got district 17 and district 28. Our friends over on the other side have drawn. And those. Districts are new they are they were not in our twenty twenty one maps. They're new. All right so that's that's one we marked off the new right. And the makeup of those districts. 63.8% of district 17 is black of age electors. That's that's number two majority black. That's one new to majority black. Now district twenty eight has fifty six point four two percent black electors. 56 point two so we have a new district twenty eight. And we've got fifty six point four two. Now we've we've done. Well our senate our senate friends have done exactly what the order says to additional majority black house districts. I don't I do I really do respect my friends in the minority party. But I don't understand coming to the well and and and sort of putting out this narrative that we're not doing exactly what the judge ordered. And if you do if you disagree with it that's fine. Let's let's debate this on the merits right on the merits. If you think the lines should be different let's have a conversation about that. But you can't come up here and just say we disagree we want a Democrat map and not propose a Democrat map. That's just that's not that's just patently untrue. You can't come to committee and say that we want our map and not bring a map. You can't do that. It's just it's not right. We just don't do that. I heard a lot about deluding the vote. How in the world to make less the word the word to loot to weaken to weaken how how in the world are we weakening the black vote in these two districts if we are drawing a majority district. How how you explain that to me because I cannot for the life of me figure that out. How are we deluding the vote. There's no way we are. It's disingenuous to come to the well and say that we are how are we deluding in these two districts. It's not possible. And I'm wrapping up here. Even our folks in the media which we're not kind.\n\nus very often. In November 27th, the AP headline wrote, Georgia Senate Republicans proposed Matt with two Black majority districts. The media has got it, right? And I know that everybody is looking at the same map as we are. So how in the world are we coming up with a narrative that this is, this is what we're doing. We're deluding the Black vote. I don't believe that to be true. I'd appreciate debating this bill, just like any other bill on the merits, but don't come up with your own facts. That's all I have, Mr. Speaker. I certainly appreciate it. Are you the well? Gentlemen, as you do the well, that concludes all of our speakers in favor of the bill. Before we move on to minority report, is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Well, now we've on to the minority report, which we have allocated 20 minutes. We're at part, are you going first? We're at part is recognized to speak to the bill. SB1EX. Thank you, Mr. Speaker. Good morning, colleagues. I rise in opposition to SB1EX, because it does not comply with Judge Jones' federal court order. It fails to comply with the Building Rights Act of 1965, and it continues the Republican Party's discrimination against Black voters in Georgia. Again, I'd like to reiterate some of the points that were previously made by my colleagues and rebut, and perhaps hopefully answer some of the questions asked by my Republican colleagues. Less than 4,000 Black voters, or approximately 3,000 Black voters, are being provided a remedy by this Republican map that does not address the voter dilution identified by Judge Jones in his 516-page court order. And the judge, again, was very specific. If you read the entire order, as opposed to nitpicking parts of it, for purposes of your argument, that it is those voters who deserve an opportunity to elect their candidate of choice. And let's take a step back. Over the past 10 years, where have we seen population growth in the state of Georgia? Primarily came from the Black community. If we've seen growth in Black voters here in the state of Georgia, their political representation should also increase, which this Republican map does not do. That is where the voter dilution comes into play, because you are not allowing these new Black voters to elect their candidate of choice. The Democratic map was mentioned not because this is a matter of partisanship, but to demonstrate the contrast of what it actually looks like to remedy and comply with Judge Jones' order. Under the Senate Democratic proposal, 150,000 Black voters would be moved into majority of Black districts that would allow them to elect their candidate of choice. The purpose of this court order is not simply to draw two majority of Black districts and you're done. It is to give the Black voters, it is to respect Black voters, constitutional rights, to ensure that they have the ability to elect their candidate of choice. That's what this is about. This is not about incumbent parings, as it was previously mentioned earlier this morning, but but complying with the Voting Rights Act, especially given the importance of what the Voting Rights Act means to this country. These are not politicians' districts. These are not Democratic districts or Republican districts. These are the people's districts. I'm here to be of service, and I hope each and every member of Democratic Republic understands that all of us are here to serve the people, not a political party. Unfortunately, this Republican majority seems intent on illegally diluting the Voting Power of Black voters in Congress, which we will address in the next few days. The Georgia State Senate, along with Black voters for legislative maps in the Georgia House of Representatives, it was my hope that Republicans would comply with Judge Jones' order. Instead, there are ignoring his very explicit, specific instructions, ignoring the court's order to draw two additional majority of Black districts in the vote dilution area, specifically identified by a federal court. It was my hope that my Republican colleagues would respect and comply with the landmark Voting Rights Act 1965. Instead, Republicans are acting not only with blatant disregard of the law, but they are taking action to once again challenge and weaken the Voting Rights Act to the detriment of Black voters and voters of color. As with the Republican map for the Georgia House, the Republican map for the State Senate is unlawful. Judge Jones can and should reject this map. I appreciate the respect of the chairman presenting the Republican map. And I understand that there is a strong difference of opinion in which ultimately the court will make his decision over the next few weeks. With that, again, I urge all members of this body to vote no to SB1EX. Now you're the well. Thank you, Mr. Speaker. Thank you, Wip Park. The gentleman's yield to the well, Representative Holly is recognized to speak to the bill. Thank you, Mr. Speaker. I am still hopeful. I rise today and ask that you join me in firmly voting no to Senate bill 1EX. Georgia experienced record exponential growth in the last decade, especially among African-American residents, via the U.S. Census data. More than 1 million new residents had moved into the state in the last 10 years, according to a 16% jump in black population growth. In December 2021, when the governor signed SB1EX and SB1EX into law, lawsuits were filed on behalf of disenfranchised black citizens to recognize that by not drawing additional black majority voter districts that recognized this extensive growth. This house, along with the Senate, had violated Section 2 of the Voting Rights Act. The legislature had purposely been diminishing the voting strength of black voters by redrawing these maps without adding majority black voting districts and direct violation of the landmark civil rights law, whose section 2 was recently upheld by the U.S. Supreme Court in Alabama's test case, Allen V. Milligan. For the press and the viewing public of today's hearing, Section 2 of the Voting Rights Act of 1965 prohibits voting practices or procedures that discriminate on the basis of race or color. Therefore, by not accounting for the additional 1 million new black residents who had moved into the state, by drawing districts reflecting this incredible growth, the damage had already been done. In Judge Steve Jones' 516-page decision, he made explicitly clear that the Georgia House and Senate must reconvene to draw new maps to remedy the illegality of the previous maps by creating two majority black senate districts, along with five majority black house districts. Judge Jones' decision also affirmed the plaintiff's recognition as to how hastily these unlawful maps were rushed through the process and how the Republican led legislature certainly had ample time to prepare remedial district maps and the event of an overturning. As noted by the Senate minority whip from Augusta, during these recent hearings, the Reapportionment Committee, again hastily rushed through the process, deflected Judge Jones' specific order to correct districts in violation of Section 2 of the Voting Rights Act, and instead spent a total of three hours to render a decision on 22 months of complex litigation. Further, the African American Attorney Senator noted still that the Senate Committee on Reapportionment had outright refused to recognize African Americans as the chiefly discriminated target of the state's voter suppression exercises throughout history, regardless of party, as continued under these hastily drawn maps. Three hours is not enough time for a lot of necessary considerations to comply with the federal court order. Three hours does not allow for ample public comment by local citizens, and more particularly by the citizens of color most impacted by these still discriminatory maps. During the committee hearings, no metrics were revealed as for measuring the precinct level or regional socio-economic activity, nor any particular relevant to maintaining community interests. Perhaps a careful review would have given Republicans a better understanding, a more acutely aware realization of the serious harms inflicted on voters, so that they too might fully value the historically tempered rationale of Judge Jones. Double-dog graduate of University of Georgia, and a pointe of former Governor, Zill Miller. And instead, those three hours were spent reviewing a Republican-re-drawn map where the majority party pulled voters from unaffected districts for partisan advantage, rather than correcting the 10 districts found to be non-compliant with the Voting Rights Act. Those are districts 10, 16, 17, 25, 28, 30, 34, 35, 43, and 44. I myself as a former resident of a multiple mid-cycle jury-mantered district, one that was redrafted more than three times in under a five-year period. I remember the silencing feeling of knowing voters like me, and those of my surrounding neighborhoods, had an electoral system that continued to stack up against us year after year. For example, my nearby senate district 17 that was rather dramatically cut far outside of Henry County into faraway places like Madison nearly 50 miles to the east. According to this redrafted map, while senate district 17 has been recut north into senate district 42, it is still unlawfully cracked, stripping away the uniformity of heavily black residential neighborhoods in favor of a jury-manjoring scheme that effectively weakens the voice of targeted African-American voters in Henry, Clayton, and DeCav Counties. Yet the committee chose to take voters in non-disenfranchised areas and add them to districts where voters were already found to be disenfranchised. Also, the committee failed to pass the Senate Bill 4EX that had followed the court's plan to remedy this issue by creating two districts which would enable black voters to elect a candidate of their choice. Sometimes old habits are hard to break, even for those who believe they have the best of intentions. It's one of the core reasons why our system of government respects a separation of powers because checks and balances are deemed necessary against potential abuses or discretion. Whether such acts are intentional or unintentional. It's also one of the reasons why the US Supreme Court held in section two that election practices which deny or bridge persons right to vote on the basis of color are inherently in violation of the law. Essentially, the court instructs that it is better to accept wrongdoing and start over again rather than try to spend three hours defending the constitutionally indefensible. As President Lyndon Baines Johnson, the one leader who arguably by passing such sweeping voting in civil rights laws caused such a seismic exodus from the Republican Party to the Democratic Party stated as he signed the Voting Rights Act into law. The court, under this act, if any county anywhere in this nation does not want federal intervention, it need only open its polling places to all its people. And I pledge you that we will not delay and we will not hesitate and we will not turn aside until Americans of every race and color in origin in this country have the same right as all others to share in the process of democracy. And so we will move step by step, often painfully. But I think with clear vision along the path to war American freedom. In quote, my colleagues, let us not be dismayed about the tremendous progress which has occurred in our state and nation in the 58 years since the passage of this great act. This House Chamber alone has seen a vast browning among its membership. Georgia has the largest concentration of elected black state lawmakers of any state in the nation proudly led by a principled gentleman from Garden City. We recently passed historic legislation together to eliminate a slavery era policy like citizens arrest which was responsible for hundreds of lynchings. We passed a centuries overdue hate crimes bill. We have also seen a candid, softening of relations within our chamber between men and women who would not have been in the same breathing space had the rules remained unchanged and the directives of Georgia's earliest founders. We have had hard conversations about the direction of our state, the replacement of racially charged symbols of division, and even the adoption of a state flag in some recent years. And there is still ample time to get it right, even on this remedial bill before us today. And should this body pass another discriminatory set of maps and violation of longstanding American laws, may God be with our federal circuit court who I know will regard citizenship over partisanship and render immediate justice in the spirit of Reverend James Orange, Miss Ella May-Bray Boy, Congressman John Lewis, and Freedom Fighters, Coretta Scott King, and Stock Bridge's own born son, Reverend Dr. Martin Luther King, Jr. It's scripture fervently reads that justice rolled down like waters in righteousness like an ever-flowing string. Thank you. The gentleman has ewered the well. That concludes our minority report. Now we recognize the chairman of the committee, chairman Levert, for up to 20 minutes for the chairman's report. Chairman Levert. Thank you, Mr. Speaker. I just have a couple points I would like to make in response to the things that have been said from this well today. And I joined with the majority whip and lamenting the degree to which political speeches have been made from this well rather than speeches devoted on the facts before us in the facts of Judge Jones' order. I did not realize, well, I knew Judge Jones' order was about as long as the Bible. I didn't realize it was such susceptible to as many varied interpretations, apparently. It is particularly somewhat difficult to take some of this when the people accusing us of not complying with Judge Jones' order as to the Senate map, Crawford a map which clearly did not comply with his order as to the House map. It had four majority black districts. And any one who reads English reasonably well will interpret that order as requiring five districts. Likewise, if we could place the order up on the screen, it's going to be a little tough to read, I know. But hopefully you remember it from late last week. It requires two districts. If you'll read starting at the end of the first line, the remedy involves an additional majority black congressional district in West Metro Atlanta, two additional majority black Senate districts in South Metro Atlanta. That second phrase is what we're here today to address. That's the order we're complying with. The map we have Crawford, the map that Senate Bill 1EX would enact does just that. It is two majority black Senate districts. So it seems to me that some of the members of the Chamber seem to think they're a better expert at voting rights act than Judge Jones is, because what he ordered us to do to comply is right there in front of you. He didn't order that we do something else. He didn't order that we do it a certain way. He ordered that we do those districts. I'm going to get to the issue of regions and areas. So the order does not find any existing districts necessarily illegal, not specific districts. He finds that the plan in general is illegal, because we could have created more majority black districts, two more. And he's telling us that's what we need to do to remedy the violation. And this is not sort of judicial GPS. It's not like it has to be in specific districts. There are certain areas he said we need to address, because the plan is to be able to produce plans that showed it was feasible to draw districts in certain areas. And that's what the Senate plan does. It puts those districts in the areas. Judge Jones said two. Now, unlike the plan that was offered in the Senate, there was no plan offered over here before my committee, before our House committee. We didn't see a Senate plan. It was done over in the Senate, though. So to be fair, I think there wasn't an alternative plan. And I can't speak. I can't speak to the process over there other than I do believe that the Senate chairman was equally a solicitor of public comment as I was. And I certainly invited all comment on both the House and the Senate plans. The plan that would be enacted by Senate Bill 1EX, frankly, is equally as helpful to Republicans and Democrats. It doesn't really hurt anybody. It complies with the order. Unlike the Democratic proposal. It almost seems to me that the objection to this plan is that it does not in construing the judge's order maximize democratic gains. But the Voting Rights Act doesn't require that. It doesn't protect political parties. It doesn't try to ensure the viability or success of any party. It protects voters. And in this particular case, an expert in the area, Judge Jones, has told us the way that we comply with the Voting Rights Act is by creating two new majority black Senate districts, which we're doing with this proposed plan. So to the extent people are saying it does not comply with the act, I mean, I, anything can happen in court. I may have misunderstood Judge Jones, but I don't believe I have. And I believe we are complying without order. And in order to say that we're not complying with the order, you basically have to conclude that Judge Jones didn't draw his order correctly, or he didn't understand the Voting Rights Act. And that's not an accusation. I'm in any position to make, nor am I willing to make it at any point. Now, one of the gentlemen who spoke in the will earlier talked about this Senate Bill 1EX maintains the status quo. I don't see how you can make that statement when it adds two new majority black Senate districts. That's not, if we're trying to maintain the status quo, I think we're doing it wrong. We're not doing it very well. And that is certainly not our intention. We're trying to comply with that order that you see up on the screen before you're right there. Some mention was made of the growth we've experienced in the state, and we certainly have. That is all very true. And that's part of the reflection of the orders that we are creating two new districts that didn't previously exist. Now, there's also some, there was a discussion about process. If I can go back to that, because that's something I tried to do with in the House Committee. You're right. It has been fast. We don't have a lot of time. We got to train to catch. We got to have all this done by the end of this week. So we don't have unlimited time. But I believe if you go back and look at the videos, you'll see that the chair entertained and listened to anyone who wanted to make a statement. Again, I certainly can say in the House Committee, that has been the case with all the plans we've seen. And that's going to continue to be the case. We're going to continue to entertain any comments that anyone in the public wants to make. But we don't have unlimited time here. We've got an order to comply with. And that's something I think all of you take seriously. I know I do. And we need to get that done in time. And finally, as to one remaining comment, there was some reference to the fact that no kind of socioeconomic or political analysis was done. Well, that's true. But we don't have to do that at this point. This is a remedial plan. We have an expert who's already done all that for us. His name is Stephen Jones. And he's told us what we can do to comply with the Voting Rights Act. The plan that Senate Bill 1EX would propose to enact does just that. It complies with the Voting Rights Act as determined by Judge Stephen Jones. And I would ask you to vote in favor of this bill so we can comply with his order as we are obligated to do. Thank you, Mr. Speaker. I yield the bill. The gentleman has yielded the way all that completes the chairman's time. Mr. Clerk, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's another report of the committee. He has agreed to shall this bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. And the clerk will unlock the machine. What for what purpose does Leader Beverly rise? Thank you, Mr. Speaker, Paul Marie Inquiry. State your inquiry. Isn't not true that the Senate minority leader offered an alternative plan to their re-apportionment committee. And that plan never received a hearing. Is that not true? If the gentleman's so states, I'm not really sure about what that group does on the side of this capital. They're mislead to be quite honest with you about it. But thank you, our respect, your opinion. Have all members, for what purpose does represent Campbell rise? Thank you, Mr. Speaker. Paul Marie Inquiry. State your inquiry. Is it not true that the House Democratic Caucus published House Districts on the public facing website ledges.ga.gov on November the 29th? I'm sure if the lady so speaks, I don't monitor that website regularly. But is there a further one? Parliamentary, one more inquiry, please. Is it also not true that the Senate Democratic Caucus published alternate district maps on the same public facing website ledges.ga.gov on November the 28th? I can't speak to that, but I'm sure the lady knows of what she speaks, that's factual. And if you would permit one last final inquiry. One last inquiry. Is it not true that these alternate maps available for all Georgians to view include a district packet, population summaries, GIS files? I'm sure the lady knows of what she speaks. Thank you, Mr. Chair. This is the, I will say that this is my answer from the Chair. We have very much attempted, and I think the Chairman has been very open and provided very adequate time to engage all members of this body on this side of this capital, this House of Representatives. I appreciate his work. I appreciate engagement of both parties as they've worked through these issues. And certainly we are at a point where we're going to, let's see, I think all members have voted. Have all members voted this. So the clerk will lock the machines on the passage of the bill. The yeas are at 98. The nays are 71. The bill having received a requisite constitutional majority is therefore passed. Thank you members for your respect of those folks that spoke in the well and of our process. It truly is appreciated. And I thank and admired by all Georgians. We'll move on to afternoon orders in the morning. Representative Kendrick is recognized for an afternoon order. Representative Kendrick. Thank you, Mr. Speaker. Good afternoon colleagues. You received a fire on your desk yesterday about a public hearing that I'm having at one o'clock down in room 216 of the capital to discuss diversity in Georgia's private equity spaces. So many of you know, I'm heavily involved in the venture capital community here in Georgia. And so we're going to talk about the Envish Georgia Fund, which many of you know is a public fund that invests in private equity here in the state of Georgia. So come down and hear from stakeholders about investments and how we can...\n\nContinue to make sure that Georgia is doing Business for everyone here in the state of Georgia if you have any questions let me know But 1 p.m. Down in 2 16 of the capital if you would come down for that public hearing. I would appreciate it. Thank you Thank you represent Kendrick Representative Allen Powell you want to make your way down? Mr. Chairman, I'm gonna let one come before you take your time take your time We want to I'll take one more representative Crawford has a afternoon order Okay They decided they didn't want to do there is mr. Chairman so chairman Allen Powell members will give your attention to the member in the well He will be joined by the Dean of this house This members if you'll move to your seats give the Memorand the well your attention. This is I think we need to stand for this don't we mr. Chairman? Chairman Powell Thank you mr. Speaker and ladies and gentlemen the house You know a lot of times I've been quoted a lot of the newer members as they come in About one of the best pieces of advice that I ever got when I was elected and it's warning in 1990 from Speaker Murphy was that there's a few things that you'll get of lasting value except for the friends that you make in The legislature Well this past weekend Bill Murphy who was a long time photographer for the house passed away Bill was a great guy He treated everybody with respect and was an outstanding photographer This was in the days that The house photographer had a lot of duties What in technical but they took pictures of everybody now that process has since passed because at an earlier day The legislature used to take in the house. We used to take pictures of every visitor that a member brought in and produced copies 8 by 10 copies for those folks to send to pages and constituents and all of that that practice was ended Probably about 04 but at that time Bill Murphy was for decades had been the long time photographer of the house He and highly-ward Edward from down in Butler and I'd be remiss if I didn't mention her name because she came in after that But if he would Value heads for just a second and say thanks to those good employees that serve this house so faithfully Thank you Thank you mr. Speaker. Thank you mr. Chairman and Chairman's we have a lot We've had a many many wonderful members of this house have served here But we've also had a many many dedicated Folks who've come in and been a part of the staff serving the people of George in this house members feel state receipts I'm going to Recognize representing Scofield Representative Davis And I saw representing more with y'all a moment ago For an afternoon order fueled remain standing and and give the representative your attention Thank you mr. Speaker members of the house yesterday Georgia lost a legend and a strong community leader Baba Alvin dollar was known by many and loved by all Alvin was also the uncle of our former house member William Bowdie He was one of the strong voices in the community and Atlanta, Fulton and South Decav He completed his last task by being a board member on the arts exchange art Community development project he finished his course and so so the family. I want to say weeping may endure for night But joy still comes in the morning. We love him. He will be miss and can I ask for a moment of silence, please? Thank you, mr. Speaker Thank you representatives Chair Lynn Smith is recognized for and Afternoon order Germans lady Smith Now I want y'all to listen up to this one I like doing that when it's something really important going to happen. I'm sorry mr. Clerk, but this is pretty special No, it's very special Chair ladies yeah good afternoon colleagues and thank you for your attention Jeremy go let you get out next to her He doesn't know we're doing this how many of you have gotten that off a phone call from a constituent problems with foster foster care in your community Well, I'm here to give you a wonderful story a Persistence of this man and his family and on December the 14th they will become the proud parents of Josiah Christian and so we're here I didn't have any trouble I Didn't have any trouble rounding up his buddies because they all hang out together here on the floor But this this is so special because so many of us want to hear the story more than we hear it and As we go into the Christian calendar Advent season Part of that is waiting for the birth of Christ Well this man and his wife had been on a layman's Advent journey for several several months and Now it will become a reality So it's not that I haven't heard all these stories about Josiah, but I do know That he loves school buses So his buddies and I went together to get into school bus and There's gonna be some legislation coming I think from the Senate side to make this an easier process Not a more difficult process so this three-year-old boy is now gonna have a loving home So let's again applaud their efforts for doing this Thank you We're Yale the well I don't know if any finer remember this house and representing Joseph Gallaud What a lucky young man Josiah is and what a lucky family you and your wife are to have him up Wish you all the best. We're very very proud for Josiah, but very very proud of you Thank you. Now we thank you for what you've done. Thank you That completes our afternoon order the clerk will read the caption Clarinal read the caption to a group of privilege resolutions honoring a life and memory of Dorian James beard Recognizing commending Peter Lewis Banks on this outstanding public service recognize and commending Dr. Duke Wilson Commending council member in JC Sebastian congratulating the Walton high school varsity co-ed competition cheerleading squad for winning the 2023 GHS a competition cheerleading state championship and for other purposes that completes the reading the privilege resolution He is there any objective to adopting the privileged Resolutions chair here's known and the resolutions are adopted All right, we got announcements all right listen up guys. We and girls. We have announcements First on the list the esteemed legend The rules committee chairman chairman Richard Smith from the great state of Columbus Recognize for announcement. I guess a legend in my own mind We will have rules tomorrow morning at nine o'clock in room 341 rules nine o'clock tomorrow morning. Thank you Rules at nine a.m. tomorrow morning Chairman work eyes are recognize for announcement He's passing What's today days Tuesday? Yeah, Morris Wednesday Representative chairman lever it is recognized for announcement Thank you, mr. Ladies and gentlemen, we will have a meeting this afternoon of the reapportionment redistricting committee To consider the proposed congressional map at this point. We don't have it yet It's still in the Senate so I don't know exactly when the meeting will be held Understand that today we're gonna Suspend and at some point will later adjourn once we receive transmission of their map of that congressional map And then we will hold a hearing on it hearing only this afternoon on the congressional map So at this point for all of you and anyone who's listening as well as members of my committee We're gonna have a meeting today. We will have a hearing only on the congressional maps I just don't know exactly when it'll start and I don't know exactly when it'll end But once we once we receive that we will make an announcement here from the well as to when that meeting will be will be held I believe I've accurately described that process, mr. Beaker For what purpose is represented Beverly rise just for point of clarification You see we're just gonna have a hearing will there be a vote today as well? No, no vote today. Thank you, mr. Chairman No vote and we'll be considering I think an additional map that will be submitted as well, mr. Weir have you mr. Chairman and my understanding you will not take a vote But you will be considering any maps that will be presented that is correct. Yes I see no further questions, mr. Chairman. Thank you for your announcement chairman Williamson Recognized for an announcement Thank you, mr. Chairman and mr. Speaker There will be a caucus breakfast tomorrow morning 403 is not a caucus meeting but a caucus breakfast at 7.45 a.m There will be a caucus meeting upon a German in room 403 with lunch provided caucus meeting majority caucus meeting 403 lunch provided upon a German thank you mr. Speaker Chairman Jasper's recognized for our announcement You don't talk about some transportation. Yes, yes, sir. All right. Let's hear it. Thank you, mr. Speaker We had a little clerical era the Transportation meeting today is that one o'clock. It's the room 406 or thereafter the caucus meeting have a number of different speakers. Thank you sir cheerleading Cooper Recognize for an announcement Thank you, mr. Speaker public health. We will have a meeting today at 1 15 In the CLOB 606 so public health will be meeting and we also have a number of speakers that are presenting today So we'll see you there at 1 15 CLO B 606 Representative Trayon is recognized for announcement Thank you Thank you, mr. Speaker the the cab delegation meeting is postponed But please come by 514 CLOB and think martyred their sponsoring our lunch today for the cab county delegation. Thank you mr. Speaker Representative Anderson There he is recognized Victor Anderson's recognized for announcement Thank you mr. Speaker the government affairs state and local subcommittee will have a meeting at 2 o'clock and 415 CLOB. Thank you Chairman Mitchell Chairman Billy Mitchell's recognized for an announcement Thank you, mr. Speaker the Decabe and Fulton delegations if you will meet in room 6.05 and the CLOB immediately upon the German the Democratic caucus We will have a meeting tomorrow morning at 8.30 in room 230 in the capital and breakfast will be served. Thank you, mr. Speaker Thank you, mr. Chairman Chairman night recognize for announcement Thank you, mr. Speaker to the members of sports miss caucus. I'm gonna apologize as we got towards the end of the session Our drawing that we usually do for the annual sportsman's the rifle how we fund our caucus Unfortunately the the time we didn't have to do it We got together yesterday with the chairman from the Senate and unfortunately I have bad news to deliver Senator Marty Harvin won the rifle so again I want to say thank you though for your continued support of the sports miss caucus and Again apologize for not having that rifle at the end of the session But we got busy, but we did do it and I look forward to your continued Support of the caucus as we go into the next session. Thank you. Who won the rifle Senator Marley Harvin how could you let that happen mr. Speaker? I'm I'm I'm hesitant to you But Kim in your office actually drew the ticket. Oh, you blame it me now Well Figures Thank you mr. Speaker Thank you, mr. Chairman Charlie night is reckon the camp excuse me cheerly the camp is recognized for announcement Good afternoon. This is a reminder that the Georgia Manufactured home association is gonna have a bus Sheddling people to the hybrid homes You could kind of see them yesterday on the flyer that was put out their neat homes. They have sheet rock tiles Tiles showers they look like any other home and there could be an answer to a workforce housing crisis So I encourage you to go check it out But there will be a vehicle to transport you there and back and if you're going to caucus meeting for the Republicans They're gonna continue doing that throughout the afternoon so you can go after caucus as well. Thank you You That concludes our announcement. I think doesn't this messenger So here we go We don't have any birthdays To announce today as members, but One of the people that help this This body function Is a Special assistant to the speaker is a young man named Jacob shield Y'all bet him in the speakers office a good South Georgia boy. You can tell by his accent right? So good South Georgia boy, so I'll ask you all to if you wish see Jacob wish you my happy birthday. He's doing a good job For us here's our posture This house will stand at ease until we receive messages from the Senate at which time bills will be assigned to committee and the majority leader will move that we stand adjourned Until 10 a.m. Tomorrow. Nothing would be voted on this will be the only business that we would take up With that this hand this house will stand at ease until we receive the messages from the Senate and then we will be adjourned Thank you members You You You You You You You You You You You You You You You You You You You You You You You You You You\n\n\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you I just want you to be only one channel working right now. I didn't know you guys knew this. I started getting things over the test. Okay. One light, can you use that or do we need it? If you can get that on your plate. Yeah, that one. Not this one. That one. There we need trust. Unless, hey, but there it is. Unless you need that one. And that's it. Well, I don't have any other feedback. Speakers, my concern. Yes. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Yes. I don't need this really, really, really. I don't need this. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test. Test test.",
  "updated_at": "2026-02-14T02:49:27.848974+00:00"
}