{
  "video_id": "OuAlPg_ZueA",
  "url": "https://youtu.be/OuAlPg_ZueA?t=989",
  "title": "Georgia House - Day 9 (2026-01-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-01-25",
  "duration_minutes": 93,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n## Overview\nThis session featured a prayer and scripture reading by the guest chaplain, Lieutenant Colonel Andy Parker, who encouraged the House members to uphold the values of justice, mercy, and humility in their legislative work. No substantive legislation was mentioned.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Lt. Col. Andy Parker, the guest chaplain, delivered a speech urging the House members to \"do justly, love mercy, and walk humbly\" in their legislative duties.\n- The House recognized Lt. Col. Parker's 27 years of military service and upcoming retirement.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe session began with a quorum call and members were instructed to vote green to signify their presence.\n\n## Adjournment\nThe transcript does not explicitly state when the session was adjourned. The next session date is also not provided.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Members will please come to the floor. The hour for convening, having arrived, all members will please come to the floor and take their seats. Mr. Clerk, will you please ring the bell. All members, we're going to have the morning row call. All members present in the chamber will please vote green to signify their presence in the chamber and Mr. Clerk, will you unlock the machines? Have all members voted? All members voted, I believe. If so, Mr. Clerk, will you lock the machines? Doorkeepers, will you please close the doors and keep them closed? As is our custom here in the house, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 73rd House District, Chairman Josh Bonner. Thank you, Mr. Speaker. Good morning colleagues. It truly is my honor today to introduce Lieutenant Colonel Andy Parker as our chaplain of the day. Chaplain Parker has completed 27 years of uniform service and will actually be retiring this March. Following 11 years of enlisted service in the Air Force, Lieutenant Colonel Parker received a direct commission in the United States Army National Guard. Since joining the Guard in 2009, he has completed five deployments to include tours in the Middle East and to our southern border. As a chaplain, Lieutenant Colonel Parker is charged with religious support of soldiers and their families and must possess the highest standards of discretion, integrity, and professional ethics. Lieutenant Colonel Parker is a constituent of House District 73 and resident of Peachtree City, where he and his wife run a small business providing test prep and tutoring services to our community. Thank you, Lieutenant Colonel. Well, it's a privilege to be with you this morning. I want to thank you for your service to our state. Each of you have been elected by your constituents and brought into this chamber to represent their interest. And I am grateful and thankful for each one of you being willing to serve this great state. You know, we live the greatest state of the Union. Here from the beaches to the mountains, from the farmlands to the bins, from Augusta to Columbus, from Brunswick to Wakecross to Valdosta, from Blue Ridge to Tacoma, we live in the greatest state in the Union. People from all over the world come to this country, from this country, come to this state. And each of you have been given the privilege and the responsibility to enable economic growth, the welfare of all, and the protection of those who are unable to protect themselves. The scripture reminds us that to whom much is given, much is required. Our state's been blessed with abundant resources, talented workforce, and incredible leaders from small to great. And I want to encourage each one of you, as you represent your constituents, to speak with boldness, to speak the needs of those that you represent, and to stand firm on what is right and good. The prophet Micah, when he was looking and asking the Lord, what do I do as a leader? How do I represent those that I am interceding for? How do I do that before Almighty God? He asked God, what does the Lord require of me? And here's what the Lord said. He said, the Lord said, to do justly, to love mercy, and to walk humbly with your God. I want to encourage you with those three quick points this morning, to do justly. It means to be righteous and equitable and have moral clarity in everything you do. It is a call to action, not to be silent, not to be complacent, but to especially represent those who are vulnerable, who are abused, mistreated, and in need, scorned, and exploited. As you do your work, stand in the gap for those. Speak boldly and with great courage as you do your work in this house. A second thing, not only are we to do justly, but it says to love mercy. That word mercy is a community word. It has to do with a covenant together. And we are living together in a community. We are trusting those to our right and trusting those to our left. And this word loving mercy means to be faithful to those around us. It's a community where we're depicting the idea of unity of spirit and of mind and of focus. God delights in showing us His covenant faithfulness. It is who He is. Not only because He has shown His mercy and faithfulness to us, can we do that to others. And as you accomplish your work in these chambers, I encourage you to strive for unity, exhibit the community for which this institution was designed. And the last thing is to walk humbly. To walk humbly with your God, walking in the spirit of humility means to demonstrate respect for others. And what we say, respect in what we do, how we interact with those around us. We demonstrate the humility of our own hearts in the way we treat other people. Other people aren't just a way that brings us some good or some benefit, but they are people because of they have been created by a holy God. So do be humble in the way you interact with others. It has to do with the value of every individual, the meaning and purpose of every man or woman. Humility is the opposite of pride and arrogance. When we have the opportunity to stand before others, sometimes our internal character is tested. The scripture says, the crucible for silver and the furnace for gold, but a man is tested by the praise of others. Be careful when people begin to praise you for who you are and what position you hold. Humility is the opposite of pride. Don't think of yourselves more highly than you are, but listen to this. Be teachable. Be open to beneficial conversation in these chambers. You represent those who have brought selected you to come and represent in this chamber. But be open to the conversations that represent them well. Be able to be instructed. Be quick to listen. Slow to speak. Great leaders influence. Each of you have the charge with the responsibility of influence. I offer these commands from our Lord as an exercise of your leadership in this house to do justly, love mercy and walk humbly. Would you join me in prayer? Almighty God, maker of heaven and earth, all we have, all we see here, smell and touch is from your hand. You have abundantly blessed this people, this city, this state, this nation. We recognize our full and complete dependence on you for life, wisdom, understanding, protection and liberty. As this body of leaders continues their work, may those tasks and conversations be characterized by professionalism, precision and unity. Fill them with the thoughts of your mind and heart that they may do their work justly, mercifully and humbly. Grant them a spirit of community, and though they may have disagreements, may they not be disagreeable. But rather be singly focused on determining the best path forward for the people, businesses and agencies of this great state. When this body of leaders is complete with their task, may others around the country see the progress of this house and the people of Georgia, and know that we continue to strive for excellence through justice, mercy and humility. And now may the name of the Lord be praised. Amen. Would you join me? Congratulations to the flag of the United States of America and to the Republic for which it stands, one nation in the visible with liberty and justice for all. Thank you, sir. Thank you, Colonel Parker, for that message. Doorkeepers will unlock the doors. As you may greet Colonel Parker in the south any room and have a photo opportunity with him, and we appreciate you being here again. And thank you for your service to our state and good luck in your retirement. Thank you. Today we can thank Chair Lady Katie Dimpsey for bringing us our doctor of the day, Dr. J. Michael Ware, who will be taking care of us today if you have any health concerns. Please join Dr. Ware and I'm sure they will be addressed. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Audits. Mr. Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous Legislative Day and found it to be correct. On another note, the things that we fear doing most.\n\nare usually the things we need to do most. I'm going to have to agree with you again, Chairman Tarvan. I think you're a spot on. I'm going to try to heed that and move forward with some things. Chairman Tarvan, the chair of the committee on information and audit reports that the journal of the previous legislative day have been read and found to be correct. Is there any objection to the spends with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative Strachan, the 104th Moose following me establishes the order of business and the first part of the period in unanimous consent in introduction of bills and resolutions first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none. The resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House Bill 1010 by Representative Jones, the 47th, and see the 13th silcox, the 53rd Baller, the 147th, Daniel 117th and others, Bill M. Tato, an act to amend chapter 20 in Title 45, the official vote of Joe Janitetti relating to personnel administration. Public and community health. House Bill 1011 by Representative Mopzani, the 17th goal of the 19th, Daniel 117th, the 113rd, Canon 112nd and others, Bill M. Tato, an act to amend code section 33, 6, 5, the official vote of Joe Janitetti relating to other unfair methods of competition. Insurance. House Bill 1012 by Representative Williams, the 148th, Bill M. Tato, an act to provide for the compensation of the Wilcox County Board of Education. Intergovernmental coordination. House Bill 1013 by Representative Thomas, the 21st Parsons, the 44th, Carson, the 46th, Verde, the 20th, Bill M. Tato, an act to amend the act, providing a homestead exemption from all city of Woodstock ad ballorum taxis. Intergovernmental coordination. House Bill 1014 by Representative Warkhizer, the 157th, Reeves, the 99th silcox, the 53rd, Volkham, the 81st, Smith, the 18th, and others. Bill M. Tato, an act to amend Tato, 17th, the official vote of Joe Janitetti relating to criminal procedure. Judiciary non-civil. House Bill 1015 by Representative MacDonald, the 26th, Blackmen, the 146th, Jones, the 47th, Hallen of the 100th, the 3rd, Wade of the 9th and others. Bill M. Tato, an act to amend Article 2, Chapter 7, and Tato, 48th, of the official vote of Joe Janitetti relating the imposition rate, competition, exemptions, and credits for all of the income taxis. Ways and means. House Bill 1016 by Representative Bruce, the 61st, Thomas, the 65th, plays, the 67th. Miller, the 62nd, Willow, the 55th, and others. Bill M. Tato, an act to create the city of South Fulton Public Facilities Authority. Intergovernmental coordination. House Bill 1017 by Representative Seaball, the 34th, Reeves, the 99th, percheddle, the 176th, Crow, the 118th, Silcox, the 53rd, and others. Bill M. Tato, an act to amend Code Section 167, 21th, the official vote of Joe Janitetti relating the criminal trust pass. Judiciary. House Bill 1018 by Representative Ridley, the 6th, Rhodes, the 124th, percheddle, the 176th. Williams, the 148th, Ridley, the 22nd, and others. Bill M. Tato, an act to amend Titles 10 and 16 of the official vote of Joe Janitetti relating the commerce and trade. That was truly taken. Yes sir. Thanks and banking. House Bill 1019 by Representative Reeves, the 99th, burns the 159th blackman, the 146th. Jones, the 47th, 9th, the 134th, and others. Bill M. Tato, an act to amend part one of Article II, chapter 5 of Title 46, Title 48 of the official vote of Joe Janitetti relating the tax exemption. Ways and Means. House Bill 1020 by Representative Saints, the 180th, followed with 147th, percheddle, the 176th, the hood of the 175th, and blackman of the 146th. Bill M. Tato, an act to amend Code Section 487, 40.1 of the official vote of Joe Janitetti relating the tax credits. Ways and Means. House Bill 1021 by Representative Daniel, the 117th, burns the 159th blackman of the 140th. Williams, Williamson, the 112th, socox, the 53rd, and others. Bill M. Tato, an act to amend Article II, chapter 7 of Title 48 of the official vote of Joe Janitetti relating the imposition rate computation, exemptions, and credits relative to income taxes. Ways and Means. House Bill 1022 by Representative Saints, the 180th, Smith, the 18th. Dempsey, the 13th, Maynard, the 56th, and Townsend, the 179th. Bill M. Tato, an act to amend Article 5 of Chapter 5 of Title 16 of the official vote of Joe Janitetti relating the cruelty to children. Juvenile Justice. House Bill 1023 by Representative, Williamson, the 112th, blackman of the 140th. Crow the 118th, socox, the 53rd, Hilton of the 48th, and others. Bill M. Tato, an act to amend Article II, chapter 7 of Title 48 of the official vote of Joe Janitetti relating the imposition rate computation, exemptions, and credits relative to income taxes. Ways and Means. House Bill 1024 by Representative, blackman of the 140th, Williams, the 112th, wait at the 9th, Hilton of the 103rd. Weeks of the 178th and others. Bill M. Tato, an act to amend Part 1 of Article 4, Chapter 12 of the Title 45 of the official vote of Joe Janitetti relating the management of budgetary and fiscal affairs. Appropriations. House Bill 1025 by Representative Ridley, the 22nd. Thomas the 21st, Jasper, the 11th, Ballinger, the 23rd. John's the 47th and others. Bill M. Tato, an act to amend and act providing a homestead exemption from a Cherokee County school district ad valorem taxes. Intergovernmental coordination. House Bill 1026 by Representative Hagin, the 156th, the situation of the 104th, the Chet of the 176. John's the 47th, Saints of the 180th and others. Bill M. Tato, an act to amend, Article 3, Chapter 3 of Title 50 of the official vote of Joe Janitetti relating the state symbols. Special rules. House Bill 1027 by Representative Baller, the 147th. John's the 25th or one of the 32nd. Dubnick of the 29th and Horner of the 3rd. Bill M. Tato, an act to amend, Part 2 of Article 6 of Chapter 2, Title 20 of the official vote of Joe Janitetti relating the compensation and core curriculum. Education. House Bill 1028 by Representative Lehood of the 175th. Cooper of the 45th, to see the 13th Hilton of the 48th and Oliver of the 82nd. Bill M. Tato, an act to amend, Title 20 of the official vote of Joe Janitetti relating the education. Public and Community Health. House Bill 1029 by Representative Matthew Yak of the 74th Cooper, the 45th, Maynard of the 56th, Camp of the 135th and Hagan of the 156th. Bill M. Tato, an act to amend, Chapter 12 of the Title 31 of the official vote of Joe Janitetti relating the control of hazardous conditions. Public and Community Health. House Bill 1030 by Representative Crow of the 118th Daniel, 117th, Camp of the 135th, Maynard of the 74th, Saints of the 180th and others. Bill M. Tato, an act to amend, Title 19 of the official vote of Joe Janitetti relating domestic relations. Public and Community Health. House Bill 1031 by Representative Blackman of the 146th, 9 to the 134th, Martin of the 49th and Crow of the 118th. Bill M. Tato, an act to amend, Chapter 5 of the Title 4080, the official vote of Joe Janitetti relating to Add Blorm, Taxation of the Property. Public and Community Health. House Bill 1032 by Representative Scott of the 76th, Davis of the 87th, Scofield of the 63rd. Bill M. Tato, an act to amend, Chapter 3 of the Title 44 of the official vote of Joe Janitetti relating the regulation of specialized land transactions. Judiciary. House Resolution 854 by Representative Hunnister, 72nd, Jasper, 11th, Collins of the 71st, Smith of the 18th, Resolution honoring the life of Mr. Keith Jackson, dedicating an intersection in his memory. Transportation. House Resolution 869 by Representative Bruce of the 61st, Jackson of the 68th, Williams of the 168th, Gillier to the 62nd, and Alexander of the 66th and others. Resolution urging the Secretary of State to keep Donald John Trump off any in all ballots. Rules. House Resolution 870 by Representative Scofield of the 63rd, Kendrick of the 95th, Scott of the 76th, Davis of the 87th, Hutchinson of the 106th. Resolution urging Congress to renew or extend the affordable connectivity program. Energy utilities and telecommunications. Senate Bill, 338 by Senator Sessler, 37th, Kirkpatrick of the 32nd, at Albers of the 56th, the Bill of the Tato, an act to amend the act providing for the elections and members of the Board of Education to Com County. Intergovernmental coordination. Second reading of bills and resolutions, the clerk will read. Second reading of bills and resolutions, the clerk will read. Second reading of bills and resolutions, the clerk will read. Second reading of bills and resolutions, the clerk will read. House Bill 101 by Representative Park of the 169th, Corporate of the 174th, Collins of the 71st, to bill relating to issuance expiration of renewal of driver's license, House Bill 102, representing camp of the 135th, Matthew of the 74th, Powell of the 33rd, Jasper of the 11th, Chastain of the 17th and others, to bill relating to the lottery for education, House Bill 103 by Representative Dunhu, 31st, Gaines of the 120th, or one of the 32nd, person of the 119th, to bill to provide a homes at exemption from Jackson County, school district ed, Lauren, taxes, House Bill 109, 1000 and 4 by Representative Dunhu, 31st, Gaines of the 120th, or one of the 32nd, person of the 119th, to bill to amended acts, providing a homes at exemption from Jackson County, school district ed, Lauren, taxes, House Bill 105 by Representative Lim of the 98th, camp of the 135th, Carpenter of the 4th, Maynard of the 56th, Owl of the 50th, and others, to bill relating to insurance, House Bill 106, My Reps of Lim of the 98th Maynard of the 56th, Jackson of the 128th, Dempsey of the 13th, or one of the 32nd, others, to bill relating to suicide prevention, awareness, training, and elementary and secondary education. House Bill 107 by Reps of the 113rd, a bill to amend and act to reconstitute and reestablish the board of elections and registrations for Lincoln County, House Bill 108 by Reps of the 113rd, a bill to amend and act, consolidating the offices of tax receiver and tax collector of Lincoln County into the Office of Tax Commissioner of Lincoln County. House Bill 109 by Reps of the 20th, a bill relating to dangerous instrumentalities and practices. House Resolution 836 by Reps of the 6th, the 133rd, the 143rd, to believe the 141st Roberts of the 52nd Davis of the 87th, and others, resolution proposing amendments to the Constitution, so it's to provide that every individual has a fundamental right to reproductive freedom and such rights, should not be denied burdened or infringed upon unless justified by compelling state interests. House Resolution 837 by Reps of the 4th, the 3rd, Cox of the 28th, Barrett of the 24th, Jasper's of the 11th, Dunhu, the 31st, and others, resolution creating a House Study Committee on Dominion Election Equipment, 3rd and 3rd. . Reports of Standing Committees, clerk will read. Representative John Lohood of the 175th District Chairman of the Committee on Governments submitted to following report and to speak to your committee on governmental affairs. Senator, consideration, following bills to the House. The House has instructed the Committee to report the same back to the House since following recommendations. House Bill E13, do pass by committee substitute. House Bill E83, do pass by committee substitute. House Bill 905, do pass, House Bill 976, do pass, respectfully submitted. Representative John Lohood of the 175th District Chairman. Representative Chuck Martin, 49th District Chairman, Committee on Higher Education submitted the following report. To speak to your committee on higher education, Senator, on her its consideration, following bill to the House. This is instructed to report the same back to the House since following recommendations. House Bill 985, do pass, respectfully submitted. Representative Chuck Martin, 49th District Chairman. Representative Bill Warkhizer, the 157th District Chairman of the Committee on Industry and Labor submitted the following report. Representative Speaker, your committee on industry and labor. Senator, it's consideration to following bills to the House and instruct the Committee to report the same back to the House. With the following recommendations. House Bill 501, do pass by committee substitute. House Bill 738, do pass, respectfully submitted. Representative Bill Warkhizer, the 157th District Chairman. Representative Beth Camp, the 135th District Chairman on Committee on Intergovernmental Coordination Local submitted the following report. Mr. Speaker, your committee on intergovernmental coordination local Senator, it's consideration. Following bills at the House and the Senate. This is instructed to report the same back to the House since following recommendations. House Bill 863, do pass. House Bill 864, do pass. House Bill 866, do pass. House Bill 921, do pass. House Bill 951, do pass. House Bill 953, do pass. House Bill 954, do pass. House Bill 979, do pass. House Bill 865, do pass. House Bill 877, do pass. Senate Bill 299, do pass. Respectfully submitted. Representative Beth Camp, the 135th District Chairman. Representative Gunner, the 8th District Chairman on Committee on Judiciary submitted the following report. Mr. Speaker, your committee on Judiciary's had a mood consideration. Following bills at the House. This is instructed to report the same back to the House. With the following recommendations. House Bill 628, do pass. House Bill 880, do pass. By committee substitute. House Bill 906, do pass. By committee substitute. Respectfully submitted. Representative Gunner, the 8th District Chairman. Representative Jay Collins, the 71st District Chairman on Committee on Public Safety and Homeland Security submitted the following report. Mr. Speaker, your committee on Public Safety and Homeland Security has had an urge consideration. Following bill at the House. This is instructed to report the same back to the House. The following recommendation. House Bill 451, do pass by committee substitute. Respectfully submitted. Representative Jay Collins, the 71st District Chairman. That completes the reading of the report's standing committees. All members will return to the floor and take your seats. We have a local calendar today. We need to vote on a local calendar. Members will please take your seats. We have a local calendar. We'll have a third reading and passage of the uncontested local bills. Two of the bills on the calendar relate to homestead exemption to require a recorded two-thirds roll call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. Mr. Clerk, will you read the local calendar? House Bill 863 by resident of camel, 171st City of Bainbridge, House Bill 864 by resident of green and 154th Miller County. House Bill 866 by resident of camel, 135th Pike County. House Bill 921 by resident of pernow, 77th City of Forest Park. House Bill 751 by resident of gunner, the 8th Towns County. House Bill 953 by resident of green and 154th Calhoun County. House Bill 954 by resident of perish, 158th of manual county. House Bill 979 by resident of camel, 15 Parto County. Senate Bill 299 by senator Malo, the second city of Port Wentworth. House Bill 865 by resident of camel, 135th Lamar County. House Bill 877 by resident of lumson, 12th Chattucker County. Is there any objection to the previous question being ordered on the local calendar? Chair, is none the previous question is ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Chair, is none the report of the committee is agreed to? Shall these bills now pass all those in favor of the passage of the bills on the local calendar? Will vote yes, all those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? Have all members voted? So Mr. Clerk, will you lock the machines on the passage of the bills on the local calendar? The yeas are 154, the nays are zero. These bills haven't received a requisite constitutional majority or therefore passed. Okay, we're moving on to morning orders. Okay, members, we're moving on to morning orders. We have 10 minutes for morning orders and we have six morning orders. So I can assure you you're going to have a maximum time of two minutes. We have some other important issues we need to take up today. So I'm going to recognize Representative Jordan Ridley for a morning order. Two minutes, Representative. Thank you, Mr. Speaker. Colleagues, today we stand the honor of the life and legacy of Ranger Steve Hadley. Members, would you join us? Ranger Hadley passed away during the holiday season at Edawaw Indian Mountain State Park. Working at the Department of Natural Resources, Steve Hadley personally trained myself and rendered all across the state. His friendship and mentorship has guided Rangers across the state for over two decades. And Rangers across the state feel the loss. Today we are joined by members of the Department of Natural Resources in the gallery. We will be receiving a signed resolution, recognizing Steve's service and memory to the state. So afterwards we will be presenting this with him if anyone would like to join us for a photo. At this time if we can just have a moment of silence recognizing. Thank you. Thank you, Representative. Thank you members. Commissioner, members of the team at DNR Steve was a good guy. Remember him well. So certainly he will be missed and we appreciate the service you provide to our state in so many different ways at DNR. Thank y'all. Thanks for being here. When the appropriate time comes we will invite you down to the south any room for some photos and greet some of the members. Thank you, Commissioner. Representative Will Wade, I think has some friends here that he would like to recognize. Representative Wade, are you in the building? Oh yeah, you are. Clear the aisle. Clear the aisle. Governor Floreau lead a will wait in Representative Johnny Chestain for a morning order. That's not two minutes each either. Yes sir. Thank you Speaker. Good morning everybody. If I could have you all look to the beautiful corner upstairs we've got the Dawson County Chamber of Commerce. Youth leadership program here. We've got a lot of great Dawson County high school juniors who are here to learn about leadership. What goes on in the people's house and this building and just so you know folks like good Georgians. They came to the Georgia House before they went to visit the Georgia Senate. So thank you very much for being here and we're honored to have you at our capital today. God bless you all. Once a tiger always a tiger. Special part of our state welcome. We're glad to have you in the people's house. Thank you for being here. Representative O'Coyay is recognized. There he comes. Representative O'Coyay for a morning order. Good to see you this morning sir. Thank you Mr. Speaker. Good morning colleagues. I rise this morning. To recognize the men and women of the Georgia public safety department. Especially the Georgia patrol. State patrol. Post number 50. And the Georgia capital police. These men and women keep us safe in this house as we do the people's business. And there are standing right there in the gallery. Please help me say thank you to them. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you Mr. Speaker. Thank you. Representative I can't say it any better than that. I'll just add my thank you for what you ladies and gentlemen do for us and do for our state and the people of our state. It's good to see y'all. You look good standing up there. Absolutely. Good to have y'all. Thank you for being here. Let's see. We have a distinguished group here representing Roberts, Pro Tem Jones, Chairman Martin, Representative Yowell. If she recovered from giving blood yesterday. She has. Representative Yowell, come on up. You're a part of this team. I don't know if she's here. Thank you Mr. Speaker. Good morning colleagues. I think it's so important that we encourage and recognize the accomplishments of our young people. Today I would like to recognize two exemplary students, Cynthia By and Johan Spadjall for founding and growing the Making and Impact project. This student run initiative based at Alfreda High School does an exceptional job of bringing awareness and inspiring action against the challenges faced by those who are paralyzed in our community. It was created in response to the alarming lack of awareness within the Alfreda community where only 10% of the student population was informed about.\n\nparalysis and its profound effects. Determine to address this issue, they aim to create an inclusive platform for both paralysis victims and professionals working in the field. Through making an impact, they successfully bridge the awareness gap, cultivated understanding and encouraged meaningful action. They've reached more than 300 students through collaborations, school clubs, and community engagements, and have made a significant impact on both students and adults. They've been able to do this through workshops, guest speakers, tutoring sessions, and collaborating with organizations like Next Step, a local nonprofit organization that works to find affordable health care for paralysis patients. This is not their first inspiring project, and I suspect it won't be the last. These young folks are identifying problems and executing solutions. So, Johansson, Cynthia, will you please stand so we can thank you for your initiative and hard work? Where are they? Oh, there they are. Thank you so much. Thank you, Mr. Speaker. Thank you for that hard work and congratulations. Thank you, representatives. Former Mayor of Savannah, representative Edna Jackson, is hitting her stride. Here she is, representative Jackson. Thank you, Mr. Chairman. I'm going to be joined by members of the delegation as well as a person we consider a member and that's representative Al Scott. It is, I mean, our Williams, Lord have mercy, you gonna kill me. Yes, you are to kill me. I know he's gonna kill me. I wouldn't be here. I did, but well, Al Scott. First, let me see. As you know, I represent Savannah, but in my district is Savannah State University. It is my honor, my pleasure, for the past day and until the end of the week, the president of our institution is here to become, to meet and to see all that we do here in our house, in our house. And I'm going to ask, I keep looking, I can't see. I'm going to ask, this is Cynthia Alexander, if you stand, oh, there she is. There she is. To give you a little background, a president and Alexander come to us from the board of regions in an area of finance. We're just happy to have her as our president at our institution and we're moving forward. We are the oldest, historically, like institution here in the state of Georgia. I hope that you will get a chance to shake her hand and also to let her know that she's going to be all right. Again, thank you very much. All right. Thank you. Thank you, Representative. I thank the president, this is you're going to be fine. This may help. I get it. I don't know about you, Al. Representative Scott. Yeah, no doubt about that. Representative Williams. Much, much better. So we have a, we've solved a problem here. We know have to give you a handle. Representative Tim Fleming. Now you're our only Fleming on the floor. So Representative Fleming is recognized for a morning order. And friends. Yeah, thank you, Mr. Speaker. I'm joined by our Newton delegation here today, Representative Carter and Representative Henderson. We're here to recognize a great group from Newton County. That's with us today here at the Capitol. And that's leadership in Newton County. If y'all could stand, welcome to Y'all State Capitol. We're glad y'all were here and look forward to being with y'all the rest today. Thank y'all. Thank you, Mr. Speaker. Thank y'all for being here. Thank you, delegation. A lot of good things going on in Newton County. We're pleased to see y'all. And thanks for being here. Appreciate you all playing our state's progress. Thank you. Charity Camp. You're recognized for a morning order. Thank you, Mr. Speaker. And good morning. I'm excited because I have some visitors from my district this morning. Crosse Point Christian Academy. Are you up in the gallery? Awesome. If you could rise and be recognized, they came here today to learn more about civics and government. So if you have an opportunity to speak to any of these wonderful future leaders, please do so. Welcome to the People's House. Thank you. Members of the House. Members of the House, do you take your seats? Members of the House. We have an invite resolution. It's pretty special as all of our invite resolutions are. But I really like this one. I think y'all are understanding why just a moment. We have a special invite resolution. And at this time, I recognize the gentleman who had our chapter of the day today as well. Member of the Georgia National Guard, Representative Josh Bonner, to speak to our resolution. Mr. Clerk, would you read the caption please to House Resolution 798? And then, Representative Bonner, would you speak to the resolution? House Resolution 798, by Representative Bonner, the 73rd clerk of the 100th Thomas the 21st, Canon of the 170 second, and Hitchens of the 161st. For resolution, recognizing January 25th, 2024, as National Guard Day at the State Capitol. Thank you, Mr. Speaker. Thank you, colleagues. Today is National Guard Day here at the State Capitol. It's a great day in Georgia. On your desk, you should have the 2023 Annual Report from the Georgia Department of Defense. I would highly encourage you to take a look through that. We have National Guard and Air Guard all throughout our state. There is someone in your community that is a member of this organization. And today, it is my extreme honor to introduce to this chamber, someone who is no stranger to this state, no stranger to this chamber, and all of our members, Major General Tom Cardin, the 43rd Adjutant General of the State of Georgia. General Cardin enlisted in the guard back in 1986, and he worked his way up to the ranks. He held every leadership position known to man to get to where he is today. And we are incredibly proud of the organization that he is a part of. General Cardin will be the first to say that he does not seek the limelight at all, but he continues to shine the limelight on the organization. Joining General Cardin today are some special guests. We've got Colonel Dirk Dobb from the Georgia State Defense Force, Chief Master Sergeant Linda Washington from the Georgia Air National Guard, Command Sergeant Major John Ballinger from the Georgia Army National Guard, and the Assistant Adjutant General Joe Ferraro is with us today. We also have a number of guardsmen that are in our gallery today, and you'll see those folks walking around the capital today. Please, if you would, shake their hand, and as we always say, we thank them for their service, and we thank them for what they do for the state of Georgia. So now I'd like to turn it over for a few remarks to Major General Tom Cardin. I'll listen to the statement. Speaker Murrins, Representative Monter, distinguished members of the Georgia House of Representatives, this is my honor to be before you today in the chamber to represent the 15,000 men and women of your National Guard. We're committed and resolute with respect to our important missions here at home and abroad. Our portfolio of responsibility starts in the fifth grade, teaching science, technology engineering, and mathematics to fifth through eighth graders through our Peach State Star-based program. From there, we move up to providing a much needed second chance to young men and women in our state from 16 to 18 years old through our youth challenge and job challenge programs. Notice I didn't call it the youth easy program. It's called the youth challenge program for a reason, but I'll tell you that program is graduated more than 19,000 young men and women since the inception of the program. The Sun never sets on your National Guard, and this year is no different. In the next few months, we will complete the deployment of over 2,100 service members around the globe and locations from our own Southwest border right here in the United States to the Sinophaneslam across the Middle East and Kosovo, just to name a few. When you consider all those requirements, in addition to our State Partnership programs with the countries of Georgia and Argentina, I can tell you that your National Guard has never been more relevant or more engaged than it is today. We have service members from every county in the state of Georgia. In addition to all the missions we complete at home and abroad, your National Guard is responsible for more than $1.1 billion in economic impact in this state every single year. None of this will be possible without you and without your support. And then this chamber today, I know for a fact that we have a number of veterans that are stood in the gap between freedom and tyranny, and I'd like to ask if you would to stand and let us recognize you and thank you for your service and the example that you've set. I told our organization earlier that the representatives that we brought here is we call this National Guard Day at the Capitol, but the purpose of this is really for your National Guard to come into the people's house and thank you for what you do. The work you do in this building literally bends the mathematical odds and favor of our service members going to do the mission and returning home to their families safely. Evil never takes a day off. And men and women that half a 1% of the U.S. population that puts on this uniform and stands in that gap between freedom and tyranny, many of them in the gallery here today. I can't tell you how humbled and honored I am to be in the room with you and to be able to represent the work and the commitment and the leadership and sacrifice of them, their families and their employers. Thank you for what you do. May God bless you all. May God bless the state of Georgia and the United States of America. So our Guard members are standing, y'all remain standing. I want to make sure that we give you a round of applause and show you our appreciation for what you do every day for us. General, what a mission. Not only for taking us around the world and here at home, but helping the youth of our state, it's quite a mission. We can only try to show you our appreciation and thanks for the sacrifices you and your families make all the time, but especially when you're deployed, we appreciate that. Thank you for your vigilance. That's why we're able to be here today. That's why we enjoy the freedoms we enjoy in this country. Members of 300 and how many years, General? 387 years, members, the Guard has been protecting Americans, protecting this country. We owe them a huge debt of gratitude. Thank you for what you do and thank you for being here with us. Allow our nurse, General, to honor all the men and women of the Guard and honor you as well. What a great career service you've had to the guards and to the people of this state and this country. Thank you. We're representing David Wilkinson as recognized for a morning order. Thank you, Mr. Speaker. Today is the coolest kids of the Capitol Day, CPA Day of the Capitol. So my fellow CPA, John Carson, is across the street doing some important business over in the Senate. I want to recognize some of the students that are here, that are CPA students from Lagrange, UGA and Emory. If you don't mind standing up and waving to everybody, I think you're up in the gallery. Thank you for being here today and welcome to the Capitol. So make sure you get to know them. These are the number of folks. Thank you. Thank you, Mr. Speaker. Hey, we have one more special morning order, a special tribute. Chair Lady Ballinger has something she'd like to inform us about. Now, thanks, special, at this time. Thanks, Charlotte. It is National Guard Day and I just want to give a shout out to my daughter, Alexandra Keane. She's actually a National Guard training at what was Fort Benning is now Fort Moore for her Jag Cor training. She joined the Jag Cor. She got commissioned late last year and she is now in her first initial phase of that Jag training. So hats off to Alexandra Keane. I should say Lieutenant, first class Alexandra Keane. She's in the Jag Cor now and she'll be going to Charlotte's full shortly. But hats off to her. I'll send her this via email later today. She's obviously busy probably doing some sort of PT. But anyway, thanks, I appreciate it. Thank you. Thank you. Until her, we appreciate her service. I know we could all say this, but since I had the microphone right now, I have a member from my county. David Smith is from down in the air guard in Savannah. We appreciate him being up here today. Many guards have been around our community just all over this state. We appreciate their service. Thank you. Members, if I can have your attention, members, we have some important business that we need to witness for this state, this important business for this house. It is our responsibility. So if I can have your attention, pursuant to House Resolution 806 and OCGA 21-2-30, the next order of business for the is the nomination and election of the chairperson of the state elections board. The house is now open for nominations for the chairperson of the state elections board. Chair recognizes gentlemen from the eighth, Chairman Stan Guthrer. Chairman Guthrer, I think you're on now. Mr. Speaker, I rise today to nominate a dedicated public servant, John Furveer, as chairman of the Georgia State Election Board. Chairman Guthrer is nominating a dedicated Georgian, Mr. John Furveer, as chairman of the elections board. Chair now recognizes gentlemen from the eighth, Chairman Billy Mitchell. Mr. Speaker, I'm glad to have the honor to second a very dedicated and qualified Georgian and a constituent for chair of the state election board, John Furveer. Thank you, Chairman Mitchell, for that second. The nomination is second. Now the chair, we appreciate you bringing him to our attention. Now the chair recognizes the majority leader for a motion. Mr. Speaker, I move that nominations be closed. The majority leaders may move that nominations be closed. Are there any objection to closing the nominations? Chair here's known that the nominations are closed on the election of the chairperson of the state elections board. Those voting for the honorable John Furveer should vote yes or green and those opposed should vote no or red. And Mr. Clerk will you unlock the machine. Have all members voted? Have all members voted if so the clerk will lock the machine? On the election of the chairperson of the state elections board, the honorable John Furveer received 160 votes and boy, zero nays. Have received a majority vote of the membership of the House of Representatives. The honorable John Furveer is therefore declared elected chairperson of the state elections board. Mr. Clerk. Majority leaders recognize for a motion. I think Mr. Speaker, I move that the confirmation of John Furveer be immediately transmitted to the Senate. Majority leaders move that the nomination of an election of John Furveer be immediately transmitted to the Senate is the objection. It is awarded. Thank you members for your attention. I hope you all join with me with recognizing a former member of this body who served with distinction. My friend, friend Malar, and good to see you for any of your questions. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the late Thomas B. Murphy, 69th speaker of the Georgia House of Representatives on the 100th anniversary of his birth. Honoring the life and memory of Dr. Tom Jacobs. Honoring the life and memory of Robert Bob Watkins senior. Commending and congratulating Jacob Levoi, commending and congratulating Phoenix Sheridan, commending and congratulating Samuel Guido, recognizing and commending the Georgia Cancer Control Consortium. Commemorating the 70th anniversary of the first flight of the Lockheed Martin C-130, Hercules Transport Aircraft, recognizing and commending the honorable Rachel Galloway, recognizing and commending the honorable Rosalind Kwan, recognizing and commending Hamza Yoseph, congratulating Aapu Inka, recognizing and commending Veronica Tuscanyne de Ligger, recognizing and commending the government liaison office of Guadalajuanco in Georgia. Recognizing commending, Bueno Energy Joint, recognizing and commending the Vietnamese Women's Association of Georgia, recognizing and commending the commitment of the Forsyth County delegation, House of Representatives, recognizing and commending past due Dacquindre Harnet on the occasion of his 16th pastoral anniversary, recognizing and commending division chief Keith Sudeth, congratulating University of North Georgia Women's softball team for winning the 2023 NCAA Championship, congratulating and commending Senior Pastor Dr. Darrell E. Hall, recognizing February 1, 2024 is where red day, recognizing and commending the Gotcha Covert Blankets Co-Program, recognizing and commending their Graham Blanks, congratulating the Prince of Avenue Fastbridge softball team for winning the 2023 GHA Class A Division 1 State softball championship, congratulating the Prince of Avenue Christian School football team for winning the GHA Single A Division 1 of our City Football State Championship, recognizing and commending Travis Heimer, recognizing and commending the Grady Allen and for other purposes that completes the reading of the privilege resolutions. Is there any objections to the privilege resolutions that Chair here is known and the resolutions are adopted? Here is the course of business for the rest of the day. Members, if you'll listen up, this is what a Chair is going to ask us to do. We have some important committee meetings that will kick off here in the 1 o'clock time frame. And I'm going to let the Chair of those committees come down and make sure if you have a 1 o'clock committee meeting and other announcements that may be pertinent, we're going to recess until 2.30 this afternoon until 2.30. We have some other business that we need to take up. So we're going to stay in recess until 2.30 until 2.30 after we have these announcements. We have members that need to make announcements. Chairman Noel Williams is recognized for announcement. You must speak, members, we have a bank's and banking meeting at 2 o'clock in CLEOV 406, 2 o'clock 406 CLEOV and we will be out by 2.30. Thank you. Stay on time. Thank you, sir. Representative Carter is recognized for announcement. Representative Doreen? Good morning, everyone. Just as a reminder, I've gotten a lot of questions. Next Thursday, February 1st, please wear your red. It's Go Red for Women. We're going to have the American Heart Association will be here from 8 to 10 doing blood pressure checks and then again from 10 to 2 doing blood pressure checks. So again, next Thursday, wear your red. Thank you. Next Thursday, wear your red. We got it. Thank you. You might better remind us some Monday or so, though, probably. Chairman Williamson is recognized for announcement. Chairman Williamson, you have an announcement? Thank you, Mr. Speaker. I just want to remind the majority caucus that will be a luncheon learned at noon in room 403. Very much encourage your attendance. It's luncheon learned noon, room 403 for the majority caucus today. Love for the senior there. Thank you, sir. Representative Dewey McClain, recognized for announcement. Thank you, Mr. Speaker. I just want to make everyone aware that the working family caucus luncheon will be in room CLOB 310 and today's we'll be talking about the state of working Georgia and the Reconfinable of GPI will be doing the presentation and that's at noon 310 CLOB. Thank you, Mr. Speaker. Thank you, Representative Dewey McClain. Representative Clint Crowe. Here he is. Representative Crowe. Thank you, Mr. Speaker. House, Ways and Means Subcommittee meetings that were scheduled to begin at 1 o'clock this afternoon or canceled. We'll reschedule those for next week. House, Ways and Means Subcommittee meetings that were scheduled for one will be canceled for today. Thank you, Mr. Speaker. Thank you, Representative. Chairman Jasper's, recognized for an announcement. Thank you, Mr. Speaker.\n\nThe big air transportation will meet today at 1 o'clock after all the different lunches. I hope you'll be there. The Georgia Highway Contractors have something for you as a gift for your service. But also if you tended the state of transportation last night was a great event at the New Norfolk Southern Building and I appreciate their hosting that. Glad you were there representing us well. That concludes our announcements. Members if you have a page today we're going to go ahead and greet our pledges with a page, excuse me, with a photo. So if you join us down front for page photos that completes our announcements. This house will stand in recess until 2.30 p.m. today and we'll come back to order. We'll see you at 2.30.",
  "updated_at": "2026-02-13T16:13:15.521507+00:00"
}