{
  "video_id": "oVHhCD7X8F4",
  "url": "https://youtu.be/oVHhCD7X8F4?t=839",
  "title": "Georgia House - Day 31 (2026-03-07)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 31,
  "video_date": "2026-03-07",
  "duration_minutes": 72,
  "summary": "Overview:\n- This Georgia House session focused on the fiscal year 2025 budget, with the highlight being the presentation and consideration of House Bill 916, the General Appropriations bill.\n\nKey Actions:\n- **HB 916**: General Appropriations bill for fiscal year 2025, setting a $36.1 billion revenue estimate and including various funding increases for state employee salaries, teacher pay, judicial compensation, and education transportation.\n\nBills Introduced (First Reading):\n- No new bills were introduced in this session.\n\nNotable Moments:\n- Chairman Matt Hatchett presented HB 916, highlighting key budget priorities such as 4% pay raises for state employees, additional salary adjustments for law enforcement and correctional officers, targeted increases for hard-to-fill state positions, and raises for assistant district attorneys and court staff.\n- The House agreed with the Governor's budget recommendations, which included significant investments in education, transportation, and school security.\n\nVotes:\n- HB 916 was considered in the Committee of the Whole and no recorded votes were mentioned.\n\nAttendance:\n- The quorum was met, and the House was able to conduct business.\n\nAdjournment:\n- The session adjourned, but the next session date was not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nMembers will come to the floor, Chairman Hatchett's prime logged and loaded, ready to go.\nMr. Clerk, how about ring the bell, please?\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nHouse will come to order, we'll get back on to the rules calendar.\nHouse can come to order.\nMembers will please take your seats.\nMr. Clerk, will you read the caption to House Bill 916, 916?\nHospital 916, by Rooms and adjourns 159.\nJones in the 47th administration of 104th\nand hatched to the 155th.\nTo be entitled to act to make and provide appropriations\nfor the state fiscal year beginning July 1st, 2024\nand ending June 30th, 2025.\nAnd to make and provide such appropriations\nfor the operation of the state government\nand its department's boards and bureaus.\nStill, I'm referring to the committee on appropriations.\nDoes that committee recommends that this bill do pass by committee substitute?\nLadies and gentlemen of the House, the chair resolves the House into a committee of the\nwhole House for the purpose of considering House Bill 916, the General Appropriations\nbill. The chair appoints the gentleman of the 104th House District Majority Leader\nRestoration as chairman to preside over the committee of the whole\nMr. Leader\nThank you miss speaker the chair recognizes the gentleman from the\nthe 155th District Chairman Matt Hatchett to present the bill.\nThank you, Mr. Leader.\nYou know earlier today there was a lot of talk about queens and festivals and I happen\nto live where we have a huge festival, the whole month of March, it's the St. Patrick's\nfestival. And I was trying to figure out what I could say when all that was going on.\nAnd I couldn't say I was a queen, but I've come up with this call me the leprechaun. I should\nhave had my green jacket today. Today I present House Bill 916, the fiscal year 2025\nbudget and is set by revenue estimate of $36.1 billion and increase of $3.6 billion or\n11.3% over the fiscal year 2024 original budget.\nThe amended budget is used to make one-time adjustments, some are housekeeping items and\nothers are workload adjustments.\nThese past two budget cycles, as we previously discussed,\nhave provided unprecedented opportunities\nto make one-time strategic investments\nin our state's infrastructure, be it technology projects\nor capital needs.\nThis base budget provides the opportunity\nto make impactful and permanent changes\nin the state budget and policy.\nIt provided the budget as recommended by the governor did just that.\nIt provided a good foundation and we support and thank the governor for including a number\nof items that were priorities of the General Assembly that we would not be able to fund\non our own.\nYou'll see throughout the document that many of the House priorities we included in the\nbudget last year are repeated in fiscal 2025 budget.\nThat's because these priorities reflect the needs of Georgians.\nWe know what the needs are because our constituents, friends and neighbors tell us at church, the grocery\nstore, at community events, over the phone and by email.\nThe needs of Georgians haven't changed in the last year, so neither have our priorities.\nThe budget is how we tell them we hear you.\nWe really and truly have one job at the State Capitol, and that is to be the appropriators.\nIf we can't do that, then why are we here?\nThere are a number of good items in this budget, 1170 lines of changes to be exact.\nBecause when you get caught in the weeds of each line item, you miss the powerful cumulative\neffect of the good in this document.\nSo let me give you the highlights.\nYou don't have to sit through very many budget hearings to understand that agency attrition\nis a problem.\nAs I mentioned in my remarks during the amended budget, the slow and steady increases in\nstate salary, both across the board and targeted increases in state salary in our most critical\npositions is moving the needle on state employment, employee recruitment and retention.\nThe governor's budget includes in the House agrees with over $250 million to provide\nstate employees with a 4% pay raise.\nThe governor's budget also includes additional $3,000 salary adjustments for law enforcement\nand correctional officers above the 4% along the priority of this house.\nThis brings the new starting salary to nearly $45,000 for correctional officers and $64,000\nfor a state trooper.\nThe budget also includes targeted salary adjustments\nfor other high turnover or difficult to fill positions,\nincluding for case workers, child welfare, child support,\nand elder abuse at the Department of Human Services.\nNurses and compliance specialists\nwho license and inspect our long-term care facilities\nand consumer protection workers at the Department of Ag\nto inspect and ensure the safety of our food and crime lab scientists and technicians\nand regional investigative personnel at the GBI working to process evidence and bring\njustice to crime victims.\nJustice cannot be served if there is not an adequate and seasoned supply of prosecuting\nattorneys to successfully bring charges against those who break the laws of this state and\nseat to harm others. Over the course of several meetings, we've been stunned by the testimony\nof the Prosecuting Attorney's Council. Statewide, the vacancy rate for assistant district\nattorneys or ADA's is 10%. But a further look into the data reveals that 11 circuits currently\nWe have a vacancy rate greater than 25%, with one circuit currently with a vacancy rate\nof 63%, with only three of eight positions filled.\nThe five-year average turnover is nearly 25%.\nThere may be a combination of factors contributing to these statistics including leadership and\nworkload, but there's no doubt with a starting salary of $58,000 compensation\nis absolutely a factor.\nTo move the needle and bring stability to DA's offices\nacross the state, PAC has requested\nand the House has fully funded their request\nfor $15.2 million to lift the whole salary schedule\nand bring the starting salary for ADA's\nto a more competitive $71,000 to be clear.\nThis is an adjustment is not for the district attorneys\nthemselves, but for the ADA's who are involved in the day-to-day prosecution.\nThe House also funds $2.5 million for targeted salary adjustments to address recruitment\nand retention issues for staff and attorneys at the Supreme Court and Court of Appeals,\nrecognizing that these courts have a constitutional obligation to complete their\ndocket within the term and cannot do so without adequate support and professional staff.\nThe House also funds $3.2 million for the Department of Law to fully implement a pay raise\nadjustment initiated last year to stabilize a turnover within that department.\nYou've already debated and approved House Bill 947 to change the structure of judicial\ncompensation for superior court judges, appellate judges, and the judges of the Georgia Supreme\nCourt.\nThis budget provides $10.6 million to phase in the salary increase over a two-year period.\nThe budget also includes a $2,500 pay increase for teachers.\nSince the beginning of this administration, the base teacher salary will have increased\nby nearly $10,000 and Georgia continues to dominate the southeast in the average teacher\nsalary.\nit all into education, in addition to the more than $380 million in regular formula growth\nfor QBE and equalization, the House wholeheartedly supports the governor's unprecedented investments\nin people transportation and school security.\nWith QBE fully funded, our attention now turns to the other formula that is a partnership\nbetween the state and local school systems that has historically been underfunded until\nnow. This budget includes an infusion of $204 million to reflect current\nbus count and mileage figures not updated in more than a decade and an\nincrease in operating to 40% of cost. This investment more than doubles the\nstate spending for people transportation and benefits all systems rural and\nurban, small, and large.\nWe all know that a lot has changed since many of us were in school, and there's nothing\nthat's more important than the safety of the children who are entrusted to our care.\nThat's why over the past several years, the General Assembly has made direct investments\nto enhance the safety and security of our public school buildings, $85 million in one\ntime appropriations since fiscal year 2019. But no money has been appropriated for ongoing\nsecurity needs until now. Recognizing that many school systems have their own police department\nand others contract with city or county law enforcement agencies for services,\nthat expense has solely been borne by local school systems. The state provides $104 million\nto provide a permanent funding stream of $45,000 per school to enhance school security\nservices and personnel.\nLast year, this body attempted to fund something new.\nThe student share of the cost of reduced price breakfast and lunch.\nWhile the state money for this endeavor didn't make it across the finish line, the Department\nof educational is able to use one-time federal funds to meet this expense for children and\nI thank the superintendent and the board for making that happen.\nNot much has changed since last year.\nFood prices are still high and kids are still not able to learn if they're hungry.\nI heard from many of you last year in this item was one of the items you were most proud\nof that that we funded in the budget. Many of you have personally shared with me the\ndifference this funding makes in your community. And that's why the house version of the budget\nagain includes $6.3 million in the Department of Education budget to cover the cost of\nbreakfast and lunch for reduced price students. This is expected to cover the cost of more\nthan 15 million meals for students.\nThis budget makes a huge investment in the health care infrastructure of our state.\nI want to thank the governor for leading the way with $146 million for full funding of\nthree provider rate studies for the now comp waiver, independent care, and elderly disabled\nand behavioral health provider rate adjustments.\nAdequately compensating providers ensures access to care.\nThat's why the House funds $27 million in Medicaid provider rate adjustments,\nincluding the Georgia Pediatric Program or GAP,\nspeech therapists, audiologists, physical therapists and occupational therapists, primary\ncare physicians and obstetricians and optometrist to name a few.\nThe House also provides $9.6 million to include basic dental care as a coverage service for\nthe Medicaid population.\nI know this initiative is important to many of you who are determined to make this coverage\na reality for your constituents.\nThis House fully supports the Governor's recommendation of $1.5 million in the Department\nof Community Help for new positions to monitor, evaluate, and improve the care management\norganization oversight.\nThis will be one of the things that we will remember we have done.\nhealth continues to be a priority of this house. And that's reflected in this budget\nwith $2 million dedicated to the Apex program to expand mental health services in schools.\n$3.2 million for jail-based competency restoration programs in Dodge and Cobb counties. And $3.2 million\nin DBHCD to operationalize a new crisis stabilization unit in making design to support adults with\nintellectual and developmental disabilities. Georgia cannot receive the behavioral health\nresources they need without an adequate network of providers. That's why this house budget\nincludes one and a half million dollars to establish the David Rosston Center for behavioral\nhealth and developmental disabilities at the University of Georgia.\nThis center will offer degrees to boost the pipeline of professionals needed to work\nin behavioral health and serve as a clearing house for research and best practices.\nContinuing in human services, the house provides $8.9 million for a 3% provider increase\nfor child-caring institutions, child-placing agencies, foster parents, and relative caregivers\nto recognize the rising cost of providing this service.\nAdditionally, $1 million is provided for additional supports for the court-appointed special advocates\nor CASA, and $1.2 million for Georgia family connections.\nWe've all heard a lot over the past several years about the VOCA cliff.\nLet me be clear about something.\nThis budget does not backfill the VOCA funds.\nWhat this budget does is use state money to find more than $20.4 million in state mandated\nservices and expectations for domestic, violent shelters, sexual assault centers and child\nadvocacy centers, recognizing the vital and needed services that they provide to Georgians\nwho are in their most vulnerable place.\nThe House also provides $2.7 million to support the operations of the Georgia Crime Victims\nemergency fund. The fund should be used for just that to offset the cost of\nservices needed to help victims of crime's recover and move forward.\nThere's been a lot of talk this session about housing. There are several house\nchanges that relate to housing homelessness and needed supports that span\nacross several agencies and policy areas in this budget, $1 million in the Department\nof Community Affairs to create the Accountable Housing Initiative.\nThis new initiative will provide funds for organizations that help homeless individuals\nobtain stable immediate housing in the short term in order to achieve affordable housing\nin the long term.\nThis funding is in addition to the $3.8 million the House agreed with the governor to fund\nin the state housing trust fund to pursue new federal grant opportunities for homelessness\nservices and $6 million in one Georgia to continue the workforce housing program.\nIn D.B.H.D., $2.9 million is provided to support Georgia's experiencing homelessness by funding\nover 300 new housing voucher slots $425,000 is provided for behavioral health and support\nservices for those experiencing homelessness and $125,000, $121,250 for the Department of\nVeteran Services to hire a coordinator to work with veterans experiencing homelessness.\nAll of this funding, which totals around $14 million, is in addition to the $2.9 million\nadded in the amended budget for the State Housing Trust Fund to leverage federal funds\nfor the Youth Homelessness Demonstration Program.\nIn closing, I'd like to offer thanks to all those that make this budget happen.\nChristine Murdoch and her entire house budget and research team.\nThey spend countless hours during session and after session gathering as our speaker likes\nto say the facts on our many agencies and budget requests. To the Appropriations Committee\nVice-Chairs, thank you for digging deep to bring great items forward for consideration\ninto this document. And I'd be remiss if I didn't acknowledge\nRepresentative is Parkle in Houston for their many years of support to the budget.\nAnd I'm going to break away from protocol.\nClay, I think I think you understand the transportation budget better than anyone in the state.\nAnd Miss Penny, no one, and I mean no one, has more love for the people of this state\nthan you, and it shows every day as you dig down on issues for all Georgians, you are\ntruly a conservative leader with a heart of gold.\nThank you, Mr. Leader, and I will try to answer any questions that may be out there, and\nstress try. All right. It's chairman to yield for questions. Yes sir. Chair\nrecognizes Chairwoman Darlene Taylor for a question. Does the gentleman yield?\nYes ma'am. Is it not true that this budget includes grant funding for three\nneeded FQHCs throughout the state? Yes that is correct. Does the gentleman\nfurther yield? Yes ma'am. Is it not true that we included increase for Medicaid reimbursement\nfor very needed physicians and therapists and things throughout the state and it's going\nto help us to increase the number of doctors and providers in the area of Medicaid? Yes it\nis and it's a known fact that we constantly are losing providers because we don't reimburse\nthem enough. And do you further yield? Yes. And finally, doesn't this budget help us\ngrow our own doctors throughout the state\nthrough expanding our residency programs\nand all of Georgia and especially rural Georgia.\nIt does, and it helps expand\nRezzi programs in rural Georgia.\nThank you.\nDo you yield further questions?\nYes, sir.\nChair recognizes representative Kinnerd for a question.\nThank you.\nDo you yield?\nYes, sir.\nThank you for your work on the budget.\nIs it true that the millions of dollars\nWe're appropriating to the state housing trust fund is the trust fund we just created last week\nIs that the same entity the state Georgia House the trust fund has not just been created. Okay. It's it gets federal funds\nOkay, thank you\nChair recognizes chairwoman Dempsey for a question\nDoes the gentleman you yes, chairman hatchet?\nIs it not true that not only appropriation committee members and many other members\nas well, spent many hours listening patiently to so many requests this year?\nYes.\nDoes the gentleman further you?\nIs it not true that this reflects a budget written with fidelity that as our morning started\nout with a message from the chaplain is focused on people, real people with real needs and\nshows how much the house and the each of us for a privilege to be in the house care?\nThank you Chair Lighty.\nDempsey, it has truly been very apparent to me over the last two years of the need throughout\nthis day and for many people across this day. Thank you.\nMr. Chairman, do you yield for further questions?\nYes, sir. I'll take a couple more.\nChair recognizes the whip of the minority party\nrepresenting part for a question.\nThank you, Mr. Chairman.\nChairman Hatchett, will you yield for a few questions?\nDefine a few, no.\nYes, I did.\nThank you, sir.\nIs it not true this budget includes $9.6 million\nincrease access to dental services for Georgians and 2 million increase access to mental health services in schools.\nYes.\nIs it not further true that this budget includes a $2,500 salary increase or a bonus for pre-K teachers,\nalong with K through 12 public education teachers?\nYes, it does and you know right now I think our average teacher pay is around $67,000.\nand this will actually take the average teacher pay\nto just under $70,000 a year, leading the southeast\nand many other states in the union.\nThis is in a minute for a few more questions.\nYes, sir.\nIs it not true that this budget fully funds a hope scholarship\nand the hope grant and includes $100 million\nfor school security?\nYes.\nIs it not further true this budget includes a 4% cost\nof living increase for approximately 300,000 state employees\nalong with $2.4 billion for transportation infrastructure.\nI agree with you 100%.\nYou know of what you speak.\nThank you, sir. My final question.\nYou've looked at the budget.\nThank you.\nYes, sir.\nThank you for the time to review.\nIs it not for, and this will be my last question.\nI appreciate you.\nThis is one you're going to try to stump me on.\nOkay, go ahead.\nWe'll see.\nWe'll see.\nIs it not true that I greatly appreciate your hard work,\nalong with the hard work of Christine Murdoch\nand the House Budget Office, and they're\nlooking forward to voting yes to this budget?\nThank you, and I appreciate your support.\nThank you, sir.\nthank you. Mr. Leader with that I will yield the well and ask for everyone's\nfavorable consideration of HB 916. The chairman has yielded the\nwell. I want to join in thanks to you Chairman Hatchett for your hard work on\nthis budget. I want to thank Christine Murdoch head of the House Budget and\nResearch Office as well as the entire staff for your outstanding work on the\nat this time, the Chair recognizes Chairman Hatchett for a motion.\nMr. Chair, I move that House Bill 916 do pass by committee substitute.\nChair recognizes Representative Clay Perkel.\nI'd like to second that motion.\nof purple has seconded the motion.\nAt this time, we'll call the question on House Bill 916.\nAll in favor will signify by saying aye.\nAll opposed will say no.\nThe ayes have it and House Bill 916 passes\nby committee substitute.\nThe chair recognizes the gentleman\nfrom the 155th District Chairman Hatchett.\nMr. Chair, as chairman of the committee of the whole house,\nyour instructed to report the action of the committee of the whole house to the house.\nThank you, Mr. Speaker, the committee of the whole house has had an under consideration\nHouse Bill 916 and has instructed me as its chairman to report the same back to the house\nwith the recommendation that House Bill 916 do pass by committee substitute.\nThe report of the chairman of the committee of the whole house is received.\nThe committee of the whole house has had under consideration House Bill 916 and have\nreported the same back to the house with the recommendation that House Bill 916 do pass\nby committee substitute. The committee of the whole house is hereby dissolved. Is there\nany objection to the previous question being ordered? Chair, here's none. The previous\nThis question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill, Chair here's none, the report of the committee is agreed to?\nShall this bill now pass, all in favor of the passage of the bill, we'll vote yes.\nAll those opposed will vote no, and the clerk will unlock the machine.\nYou\nhave all members voted for what purpose to chairman wheat hour rise.\nParliament inquiry. State you inquiry. Miss Speaker is it not true that this\nbudget includes just over 2.1 million dollars to revamp the licensure process in\nthe state of Georgia bringing much relief to all licensed professionals across\nthe state. I think I read that in there late night when I couldn't sleep but yes\nsir it does and that's a great ad to the budget thank you chairman thank you\nMr. Chairman for what purpose is representing Becky Evans rise Parliamentary\ninquiry. State inquiry. Yes Mr. Speaker isn't it true that I'm very excited about\nnot passing this budget, especially for all the good funding for education.\nI know the lady certainly has worked on the budget and appreciate her work, and I know\nshe's excited.\nAnd the follow-up question, Mr. Speaker, I'm also excited about the 9.5 million and lottery\nfunds for pre-K to take the class size from 22 to 20.\nIt is also true, Mr. Speaker, that I hope that this body will be able to give the salary\nincrease to pre-K teachers, which was included in the House's recommendation, and I do not\nbelieve the salary increase for the pre-K teachers was included in this budget, isn't that\ntrue, Mr. Speaker?\nI'm sure the lady has read this budget very keenly, and we've addressed some of those\nissues there, but, you know, we have more to do, but we made a great start, thank you\nfor your question.\nThank you.\nFor what purpose is representing Barnes, rise?\nParliamentary inquiry.\nState inquiry.\nIs it not true that when kids are fed, futures are nourished, so that 6.3 million in the\nbudget will feed more of our children in the school system?\nI'll have to agree with the lady that's strong.\nThanks for this house.\nFor what purpose is representing Lisa Campbell, rise?\nThank you, Mr. Speaker.\nParliamentary inquiry.\nState your inquiry.\nIsn't it true that I'm very excited to support this budget, and I'm very proud of the\nwork that Speaker Pro Tim Jan Jones and her committee and your support did this summer\nto increase coverage for childcare and to improve quality early learning?\nAnd is it not also true that I look forward to working with all of you to continue to\nWe grow the funding to cover the $73 million gap that we have in our CAHPS program this\nyear due to COVID funding ending.\nI'm sure the lady knows of what she speaks and I can't say I don't disagree with you.\nWe have some work to do but we've done great work and thanks for all the members pulling\ntogether.\nFor what purpose does it represent any phrasier rise?\nSecretary and Quarry.\nStaging Quarry.\nMrs. Speaker, isn't it not true that the $900,000\nthat has been added to the Appropriation budget\nis for the hematologist, for the Sickle Cell Foundation,\nwhich is much needed because many of our sickle cell patients\ndo not have a place to go to to get service since\nWales start closed.\nI'm sure the lady knows of what she speaks.\nHe's been an advocate, and we appreciate her advocacy.\nYou've done great work.\nNow, have all members voted.\nIf so, Mr. Clerk, will you lock the machine?\nOn the passage of House Bill 916, the yeas are 172.\nThe name is one.\nThis bill had received a requisite constitutional majority\nis therefore passed.\nCongratulations, Mr. Chairman.\nCongratulations, Mr. Chairman and congratulations, staff, great work, congratulations, house.\nFor what purpose does Chairman Hetchard rise?\nThank you, Mr. Speaker, to make a motion.\nState your motion.\nI move that House Bill 916 be immediately transmitted\nto the Senate.\nRepresentative Hatchet moves that House Bill 916\nbe immediately transmitted to the Senate\nis their objection, hearing none of this awarded.\nLet's do it again.\nMr. Chairman, committee subchairs, staff,\nthis is an awesome budget that addresses the needs\nGeorgia's from every walk of life, from every part of Georgia.\nThank you to everyone who voted for me to be on this bill.\nIt's good to see us all work together and find some areas we can agree on that benefits\nto people we care so much about.\nSo I'm going to applaud you all.\nYou all don't need to be applauding.\nmakes me proud to be a member of the House. Thank you.\nWe'll move on to afternoon orders.\nCheerleady Darling Taylor is recognized for an afternoon order.\nThank you, Mr. Speaker. Today, I want to share a brief history of\nan outstanding woman in American history, Sandra Day O'Connor. She was an\nAmerican attorney, politician and jurors, who served on the U.S. Supreme Court\nfrom 1981 to 2006. O'Connor was nominated by President Ronald Reagan and\nbecame the first woman to serve as a U.S. Supreme Court justice. She was\nconfirmed unanimously. Before her tenure on the court, she was an Arizona State\njudge and earlier an elected legislator in Arizona, serving as the first\nfemale majority leader in a state senate. During her term on the court she was\nknown for her well-researched opinions. O'Connor was regarded among the most\npowerful women in the world. After retiring, Justice O'Connor succeeded Henry Kissinger\nas the chancellor of William & Mary College. She remained an active advocate for\nfor judicial justice and the rule of law.\nIn recognition of her lifetime accomplishments,\nPresident Obama awarded Justice O'Connor\nthe nation's highest civil honor,\nthe presidential medal of freedom.\nI would like to leave you with some words of wisdom from her.\nQuote, do the best you can in every task,\nno matter how unimportant you may seem at the time.\nThank you, Mr. Speaker, I yield the well.\nThank you chair lady representative Hutchinson is recognized for an afternoon order the lady has the well\nThank you mr. Speaker good afternoon colleagues today. I'd like to introduce you to a sibling group\nLewis Lucian Leland and Lilliana\nLewis is friendly happy go lucky fun-loving and eager to engage\nLucian is quiet sweet loving boy who in joe's school\nLeland, who is eight, is affectionate, fun-loving, also in joy schools.\nAnd Liliana, who is five, is a very special girl who loves learning and attending preschool.\nWhen I look at this group of kids, I just think about what they've gone through in their short lifetime.\nPlease remember all of the children we have available for adoption in Georgia\nand let your friends know that we have this adorable, adorable group that needs forever home.\nThank you, Mr. Speaker, you're the well.\nRepresentative Scott Hilton has recognized for an afternoon order.\nThank you, Mr. Speaker.\nThis past Sunday, the 28 and three Wesleyan School Lady Wolves defeated Carver Columbus\nto advance to the 3A State Championship game this Friday at 1 p.m. and Megan.\nPlease join me in wishing good luck to our headmaster, Chris Cleveland, head coach\nEllen Peroli, and our entire Lady Wolves basketball team as they compete against the number\none seed, Ibron Christian Academy.\nLadies, let's bring home that trophy.\nThank you, Mr. Speaker.\nThank you, Representative.\nOkay, we have a great announcement that concerns this house.\nAnd the great athletic ability that this house has and the steady nerves, and I'm not\nsure if they can keep a scorecard, but nobody called them.\nGot some golfers here, Chairman Powell and his team is recognized and tell us about\na boy, one of the awesome trophy.\nJim and Powell.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House,\nwe stand here today to be proud to present to this House\nthe Governor's Cup trophy for the annual golf tournament\nbetween the House, the Lower Body, the Senate,\nthe Governor's Office, and the lobbyist or the business people\nof the State of Georgia.\nThis tournament was started back in the mid-90s and of course you'll be happy to know that your house teams\nhave predominantly won most years. Now there's a few years that there was a little cheatnet went on.\nYou know I continue to tell people about golf what a great character builder it is\nif you play by the rules. But a few times it's one and it's questionable because if you lose a ball\nyou don't, you're supposed to add a stroke and not take one off.\nThis past year it was played again down at the Shelman's Bluff course and Chairman DeLochis\ncourse of course.\nAnd we were victorious in that at a hard fault struggle.\nThe Senate, certain members of the Senate, did make a considerable wager to the House\nteam and some people in the house team predominantly the captain took that that\nwager and they still hadn't paid that bet as best I can tell but you know\nthat's all right they've got a little bit of time before I come to Will and I\nreally talk about folks who don't pay debts or who might cheat it to Game of\nGod so I would tell you for each and every member of this house we've had\ndance off contest, we've had basketball tournaments of a good friend in nature, but we take this\npretty serious about golf. Because golf is one of those sports that builds character. We have a\ngolfing industry in this state that brings in about $6 billion plus, not to say or forget that we\nhave two of the most famous golf facilities in the whole world of gusting national being one\nand each lake being another.\nAnd Georgia is a golfing state.\nSo on behalf of this team, go house.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nGood.\nThe members of the house, there's a resolution here\nto be signed, creating golf day next.\nI believe it's next week or week after.\nAnd remember how much golf contributes\nour economy, not including getting people out of the way from doing stupid things while\nthey're hitting the golf ball.\nCongratulations golf team.\nMr. Chairman, if you will just give us the names of those unpaid waivers, as unpaid\nbench, we'll hold their bills.\nThey certainly won't move forward.\nThat's awesome, Mr. Chairman.\nRepresentative Gladney, talking about Augusta, is represented to speak to a afternoon order.\nThank you, Mr. Speaker.\nIn honor of Women's Day, Women's History Day, Women's History Month, honoring Ambassador\nDr. Sharon Brown, who joins us today accompanied by her husband, Dr. LC Miles, both of Augusta.\nWe celebrate her today in recognition of women's history.\nShe's not only a survivor of her own first-hand horrific dark experience of human traffic\nand exploitation, but she has bravely turned that tragic circumstance into an empowering\nopportunity to inspire others through her humanitarian work at the United States Office\nof Victims of Crime and Center for Human Trafficking, among many, many other organizations\nthat the speaker would not allow me to have time to say them all.\nHer book and life story can be found how I found the power of my voice in the Library\nof Congress. Please recognize and honor Ambassador Dr. Sharon Brown. Thank you so much. We will\nhonor you with this resolution signed by my colleagues who support that struggle for women. Thank you\nso much for being here today. You can meet us in the Annie Room for a picture. Thank you for being here.\nYou're the well lady yields will thank you doctor Brown. Thank you for being here with us\nCheer lady Mathy act and Frant rotary friends\nRotarians\nCome to the well\nLadies recognized\nThank you, Mr. Speaker.\nToday, we get to honor Griffin Rotary's 100th birthday today,\nand we're so proud of our whole team and our whole club\nand all the things that they've done.\nThank you, Mr. Well, let's get to this picture first.\nMy all my rotitarians.\nYes, come on.\nYes.\nHappy birthday for Griffin today.\nThank you, sir, and I yield the well.\nThe dean's not measuring up as a photographer.\nHe's a little slow.\nI know where she is.\nThat concludes our afternoon orders.\nMr. Clerk, will you read the caption to a group of privileged resolutions?\nRecognizing commending the Milton Eagles football team for winning the 2023 GHA-7A State\nfootball championship, commending the Milton Lady Eagles lacrosse team for winning the\n2023 GHA-7A Girls lacrosse state championship.\nRecognizing commending the Milton Eagles boys golf team for winning the 2023 GHSA 7A Boys Golf State Championship.\nRecognizing and commending trail life USA, honoring and commending American Heritage Girls.\nRecognizing commending major Tom Carton and commending the Milton High School Theatre Company for winning the 2023 GHSA 7A One Act Play State Championship.\nand for other purposes that completes the reading of the privilege resolutions.\nThank you, Mr. Clerk. Is there any objection to adopting the privilege resolution?\nLucians, here's none the resolutions are adopted.\nWe have some announcements, but I'm going to do it backwards. I'm going to do\nbirthday first. Representative David Jenkins has a birthday today. Representative\nJenkins. Life's about time. You know keep going. Keep going. It's also Representative Mary\nMargaret Oliver's birthday. Perfect time and she's down front.\nHappy birthday to both of you. We have some announcements. Chairman Yerder,\nrecognize for an announcement. Thank you, Mr. Speaker. Code revision. We'll have a\nmeeting at 8.30 in the morning. 1.32 capital. So please be there.\nChairman Halkins recognized for an announcement.\nThank you, Mr. Speaker. The Chair on Health will meet tomorrow morning at 8 o'clock in\ncap 403 8 a.m. and 403. Thank you. Representative Pennich recognized for an announcement.\nThank you, Mr. Speaker.\nTomorrow there will be a joint House and Senate Fulton Delegation meeting at noon in CLEOB\n307.\nCLEOB 307 noon, tomorrow.\nThank you.\nThanks to the lady.\nChairman Gunther is recognized for an announcement.\nThank you, Mr. Speaker.\nHouse Judiciary will meet this afternoon at 2.30, we have four bills on the counter.\nIt won't take very long.\nAnd for those of you on the Judiciary Committee\nthat want to plan ahead upon adjournment tomorrow,\nwe're going to do our committee photo.\nHere in the chamber.\nThank you.\nChair Lady Ballinger has recognized\nfor the announcement.\nChair Lady Ballinger.\nThank you, Mr. Speaker.\nYour juvenile justice committee will meet upon\nthe adjournment of budget and fiscal affairs oversight.\nThey have 606 right before we do as soon as they're finished then we will and as soon as we have a quorum\nWe will go ahead and start our immediate meeting for budget for juvenile justice\nAnd we have four Senate bills that we need to perfect so look forward to seeing everybody there\nRepresentative Anderson is recognized for an announcement\nThank you Mr. Speaker\nGovernment affairs full committee will meet in CLOB 406 immediately upon a\nGerman of ways and means that's CLOB 406 thank you representing Brad Thomas\nis recognized for an announcement thank you mr. Speaker the Cherokee delegation\nmeeting at Representative Ballinger's desk upon a German thank you\nThank you, Mr. Speaker of the House Public Safety and Homeland Security Subcommittee will\nmeet today at 3 p.m. in room 506.\nOne bill, if you all will please come and meet there, we'll get out quickly.\nThank you, Mr. Speaker.\nRepresentative Hilton has recognized for an announcement.\nThank you, Mr. Speaker.\nThe House Education Policy Subcommittee will be meeting immediately after a\nadjournment in room 515 CLOB.\nWe've got two bills under consideration.\nThank you.\nThat concludes our announcements.\nThank you members for your attention today.\nHad a good day.\nShowed great respect for our guest in the house today.\nThank you for that.\nThe majority leader is recognized for a motion, Mr. Leader.\nThank you, Mr. Speaker.\nI move that this house stand adjourned\nuntil 10 a.m. on Friday, March 8th, 2024.\nOn the motion of the majority leader\nthat this house stands adjourned until 10 a.m.,\nFriday, March the 8th, 2024.\nAll those in favor will say aye.\nAll opposed, no.\nThe ayes have it.\nWe are adjourned.\n",
  "updated_at": "2026-02-12T14:13:44.393472+00:00"
}