{
  "video_id": "owNh7YvZsvc",
  "url": "https://www.youtube.com/watch?v=owNh7YvZsvc",
  "title": "4/3/2025 | Sen. Merritt  GLBC Press Conference",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 43,
  "summary": "Here is a summary of the Georgia 4/3/2025 | Sen. Merritt GLBC Press Conference session:\n\n**Overview**: The Georgia Legislative Black Caucus (GLBC) held a press conference to address two pieces of \"unacceptable\" legislation (HB 127 and a bill impacting voting) and to stand in solidarity with the residents of Sparta who are facing eminent domain actions by a private railroad company.\n\n**Key Actions**:\n- **HB 127**: Described as an \"attack on DI programs in our state\"\n- **Bill impacting voting**: Works to reduce Black voter turnout\n\n**Bills Introduced (First Reading)**: None mentioned\n\n**Notable Moments**:\n- Rep. Al Williams gave a passionate speech condemning the eminent domain actions against Hancock County residents, drawing parallels to the civil rights movement.\n- Rep. Spencer Fry, an associate member of the GLBC, also spoke in support of the Sparta residents, highlighting the importance of generational land ownership.\n- Larry Raleigh of the Ados Advocacy Foundation spoke in solidarity with the Sparta landowners, decrying the history of land theft from Black families.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No quorum notes provided.\n\n**Adjournment**: The transcript does not indicate when the press conference ended or the date of the next session.",
  "transcript": "Thank you all for joining us this morning and I want to start out with that the message\nthat I need everyone to understand here today is that the GLBC the Georgia Legislative\nBlack Caucus is watching in every corner of the state we are watching and ready to call\nout injustice where it strikes. We are here to push back on behalf of all marginalized\npeople. We have two pieces of legislation that are absolutely unacceptable, and we're\ngoing to talk about those once we finish the first part of this press conference, and\nwe are rallying to stop some of the injustice that we are seeing as we approach shiny\nWe have HB 127, which is the attack on DI programs in our state.\nWe also have a bill that cheats our voting, and it actually works to any time it seems\nlike we get more black citizens to come and vote.\nNow we want to change the rules, so we would speak on that.\nBut right now we want to speak on behalf of Sparta and the injustice that is happening\nwith imminent domain and the plans to have a railroad come through the land and the\nproperty of those who have been living there for years.\nSo with that, I'm going to go ahead and turn the press conference over to Representative\nAl Williams and he is going to open us up on that subject and then we have some speakers\nwho will be speaking on behalf of Sparta,\nfollowing Representative Al Williams\nand Representative Smiths or Fry.\nSo with that, Representative Al Williams.\nThank you, Madam Chair, and to my colleagues,\nand those from the Hancock area.\nIt was one thing for sure we have gotten nowhere\nwithout the invoking the spirit of God.\nSo I'm off the program a little bit,\nwe're gonna ask God to be here with us\nbecause that's who ultimately is going to have to help us.\nLet us pray.\nAll my everlasting God, we thank you for this day.\nWe thank you for those who have come.\nWe thank you for the strength of Hancock.\nAnd Lord, we just lift you up for it.\nIt is in your name, we pray.\nAmen.\nI spent a good deal of my life, long as it has been,\nstanding at courthouses, where corrupt public officials\ntook lands from black people.\nlands that dated back to reconstruction and actually the signing of Article 15 by General\nSherman stood there at homes with grieving mothers who had put their land up to get\nsomebody out of jail and had lost it for a pittance of what it's worth to corrupt public\nofficials. We stand here now. Eminent Domain was made into law for the purpose of public use,\nnot private gain. Obviously we have a Supreme Court that does not agree with that assessment.\nBut you come and generations of land takes a strip out of the middle to enrich further\nThere are just a few people who already rich.\nThis land was all a lot of these people had.\nAnd here we are today.\nI couldn't think of something more fitting to say than what the General Secretary of\nthe President of the United States said at the 1963 March on Washington, where I was honoured\nto be standing in the crowd.\nThe General Secretary said, we've come late, we've come, but we've come to set the record\nstraight and it's time to set the record straight. This is not time for those\nwho are faint of heart and they are certain folk with a lot of jingle in their\npocket. They can make us silent. These folks set us up here to speak power to\nspeak power and speak their needs and so we're here to tell the state of\nGeorgia this is wrong. This is abusive. You have robbed those who have nothing\nleft to be robbed of after you had taken so much. Let's forget about the foolishness of\nthis session, crazy legislation with just enough words called God in it to make it seem\njustified. It is unjustifiable what happened to the citizens of Hancock County. One little\nrailroad needed four miles to further enrich by hauling some gravel out. And now they claim\nin spite of all the noise and dust, we'll move a little farther out and put up some barriers\nand stuff, but that will not replace the land. We need to stand tall and stand with them.\nWe need to stand regardless to what has been said, because I'm old enough to remember\nwhen the Supreme Court was not even our friend. But we fought home, and sometimes we need\nto remember the struggles of the civil rights movement, when we sang songs like Angle,\nlet nobody turn me around. Let's dust off our shoes and be aggressive in helping\nthese folk from Hancock County who has been robbed. Oh, there's a lot I can\nsay but I'm gonna stop here to get good to them. I'm gonna ask you now to please\nlisten to my colleague and good friend State Representative Spencer Fry. Thank\nyou.\nYou know, we got a clap after that, you know, as a son of a preacher, and working with\nRepresentative Williams for a long time, I hate coming on after him, but here goes.\nYou know, you might be wondering what I'm doing here, well, I am an associate member of\nthe Black Caucus.\nIt's a very welcoming organization in Senator Mayor.\nI appreciate your leadership, and for organizing this.\nYou know, in the United States, the number one way that it has been proven to build generational\nwealth is through land ownership.\nAnd what we think about when we say land ownership, single family homes, but this is an issue\nthat I discovered, it means a lot to me personally.\nAnd we have a family farm that had a utility condemned part of the land and were given\npennies on the dollar for a one-time payment, it's heartbreaking.\nAnd I, obviously, am a white man in the South.\nWhat we're talking about right now are the things that have been going on in this country\nfor four hundred years. Longer than that. I had the opportunity to speak to\nMiss Jan, he'll be introduced in a second, and it's heart-wrenching to see a\nform bisected by a 50 yard wide swat, swat, for a railroad track with one\ncrossing in that property. It may have changed by now but that's what it was\ndescribed to me when I read the documents. Can you imagine having a farmland\nthat's been in a family for a hundred years and now having to give it away for\npennies on the dollar to a private entity to haul gravel while currently\nthey're doing it with a road, and they can still do it with a road.\nBut they want to put a railroad in the middle, take these folks' property away.\nThis is not the United States that I was born into.\nThis is not the Georgia that I was born into.\nBut this is what we are going to be fighting over and over and over again until we can put\na pen in it and call it done.\nAnd we've got the family that's going to speak here in a second, and I appreciate y'all\nmaking the trip and coming up, it's so good to see you.\nBut right now I need to introduce an advocacy organization, come on up here Larry.\nLarry, Larry Raleigh is an advocacy organization, and he's here to help us advocate for this\nfamily for their generational wealth and for the wrongs of private industry taking private\nproperty for private profit Larry. Thank you. Good afternoon everyone. I want to thank\neveryone for coming out for this very important occasion. So thank you. I want to extend\nmy gratitude to the Georgia Legislative Black Caucus for hosting this event and standing\nwith the residents of Sparta on this critical fight.\nToday we gather here, not here just to speak, but to stand firm against a long and familiar\ninjustice when it has taken land, stripped of wealth, and erased histories.\nThe Ados Advocacy Foundation stands with the land owners of Sparta.\nTheir fight is our fight.\nWe have seen time and time again how black families have had their land stolen, whether\nit's through violence, legal maneuvering, or corporate greed.\nFamilies forced out, generations robbed their opportunity.\nThe racial wealth gap didn't happen by mistake, and\nland theft has been one of the dividing of the driving forces.\nAnd now, Sandersville Railroad Company wants to continue that legacy under the false pretence of public benefit.\nLet it be clear, this is not about the public.\nThis is a private railroad company seeking private gain at the expense of\nSparta land owners. This community was never consulted because their best\ninches was never a priority. This past Sunday our organization traveled to\nSparta. We set with the residents, listened to their stories, and captured\ntheir truth. What we heard was a resilience. What we saw was a community unwilling to back\ndown. Many of those affected were veterans, men and women who fought for this country. And\njust as they fought on foreign soil, they are prepared to fight here to the very end\nagainst the Sanders, Ville, Railroad, and Benjamin,\ntar button.\nThis is not just a sparta issue.\nThis is a justice issue, a black wealth issue,\na Georgia issue, and it speaks to a larger truth\none that this country has yet to fully reckon with.\nBlack Americans who are the descendants of slavery\nare older dead.\na debt that has accumulated over generations of theft,\nexclusions, and economic sabotage.\nReparations are not just a more necessity,\nbut an economic imperative to restore what has been taken.\nThis fight in Sparta is one chapter\nand a much larger story.\nUntil that debt is paid, until Black land and Black wealth\nis protected, our work is not done.\nTo the residents of Sparta, you're not alone.\nWe stand with you.\nWe will fight with you.\nAnd we will not rest until it remains.\nThis land remains in the hands of the families who built it.\nAnd now I want to introduce you to the leaders\nof the No Railroad Coalition, Mr. and Mrs. Smith.\nMrs. Sally, Sally, Gary.\nThank you.\nCome on up here, sweetie.\nCome on here.\nCome on this side.\nCome on this side.\nGood afternoon to everyone.\nIt's very emotional for me right now.\nAnd that's because my husband and my sister here in Christ, we've been fighting three\nlong years, three long years to keep what is ours.\nI'd like you to introduce you to my husband of 45 years, a retired school teacher, a veteran,\nfather of our three sons, two who fought in Iraq. He's taught overseas. Those are children\njust make me. I just want to cry when I see those little children because he taught\nlittle children. When he started off, he was healthy. Three years ago, halfway through,\nhe was diagnosed with Parkinson's. The doctor said the stress, the stress of the fighting,\ndistress of him up at night knocking on doors and fighting for his family land, our land\nof over a hundred years where he was raised.\nHe was raised in the house his father was raised in and he lives on the land that his\ngrandfather fought so hard for and that we now live on and have raised our children.\nI'm also a retired Georgia school teacher.\nAnd I'm also a veteran.\nI served during desert storm.\nI'm also an army brat.\nI've lived all over the world.\nAnd I know injustice when I see it.\nThis beautiful lady standing over here next to me\nhas been on right arm, a left arm.\nShe's been a prayer partner.\nTheir property is next to us.\nI've never met her before until this happened.\nWe came together in a county that is divided,\nwhite and black.\nIt goes back history with legacy of plantation owners,\nracism, even today.\nBut she and Mark and I have bonded in something very common.\nHer family has legacy.\nShe wants to keep her family land.\nI've seen her little grandchildren come and play\non their family place for Christmas.\nIt's a sight to see you all.\nNow I'm going to say this.\nThis fight isn't about the Blacksmith family land.\nIt's not about the white Garrett family land.\nIt's not about the Griggs and the Riggs family.\nIt's about 50 American families also living\nin a small rural communities.\nFamilies who can trace their history back to slavery\nand the long brutal journey on slave ships from Africa.\nThis fight is about land ownership\nfor people across the country.\nIt is about our rights, specifically the Fifth Amendment\nright that says property can only be taken for public use,\nnot private gain.\nBut in this case, Mr. Tarbund and a few of his business\nassociates want to take our land for their private use,\nto move their goods using Mr. Tarbund's freight train\nback and forth through our property and community.\nMr. Tarbund has tried to pain our county,\nHancock County as poor and in desperate need\nof his millions in tax revenue.\nBut we already have,\nHancock County already has a CXX train line\nand two of the largest foreign-owned quarries,\nHeidelberg and Vulcan quarries within five miles\nof our property and our homes.\nI ask you this, why can't they get on that train?\nWhy do they have to have another train?\nThese businesses have been in our counties\nfor over 30 years.\nHas our economic situation changed?\nNo, it's only gotten worse.\nSo ask yourself, is this good to spur gonna really help us?\nLet me be clear, Mr. Tarbbutton,\npresident of the privately owned Sandersville Railroad,\nwon't something from us or land.\nTo run his freight train through,\nwe want nothing, nothing from him,\nexcept for him to leave us alone.\nLet him, let him go back to Standitzfield, Georgia,\nand focus on helping the poor black families who live\non Taipei Street.\nAnd I challenge you to go to Taipei Street\nand see how those black people have\nto live with a train running down their street.\nI've been there.\nI go there to encourage myself and remind myself\nThis is a fight worth fighting because this is what's\ngoing to happen to us.\nTo governor, to governor camp, to governor camp,\nwe're not millionaires like the tar buttons.\nWe wouldn't even be standing here today asking for help\nif it weren't for the pro bono attorneys for the Institute\nof Justice and the Southern Poverty Law Center who\ntalk our case. They're not outsiders. They're just people who see people hurting and have\na cause and have a fight. And they say, we're going to get in it with you. When they first\nmet us, they said, we're going to be in it with you to the end, Miss Smith. We're not going\nto leave you alone. They came down and saw our situation. Do you know how much three\nyears of legal fees? What have caused us? A lot. We didn't even have enough for a month\nof legal fees. The property owners, Governor Kemp, Governor Kemp, the property owners\nand 50 families from the show's role community in headcock county are asking for your support.\nWe are asking you and the judges to reexamine an outdated law from the 1800s that give a\nprivate railroad the same power as national freight trains.\nWe're also asking you not to allow the Public Service Commission, I'll say that again,\nGeorgia Public Service Commission, whose members have accepted campaign contributions\nfrom the tar buttons to that one hearing officer makes such a life altering decision for\nour families and our communities.\nBecause folks, if that trade comes through there, we're going to have to leave out of that.\nWe will not be able to live with two freight trains and two rock quarries and an asphalt\nwithin five miles of our home.\nNot through imminent domain.\nNot through imminent domain.\nWe're not asking Mr. Tarbotton, the judges are the state of Georgia to give us anything.\nYou gotta understand, we have been there some of us over 100 years, 150 years, I know my\nfamily has lived there, 30 years, Miss Sally has lived there longer than that, we have,\nwe've paid the taxes, we've lived there.\nWe did not go to Sandwichville, Georgia, we did not beg an ex-Mr. Todd buttoner, come\nto our county.\nHe felt the need to write us a letter. He didn't even have the dignity to knock on the door\nand call us on the phone. He just told us in a letter what he was going to do to us.\nTake our property. So we're asking you to let us keep what's already ours. God gave\nit to us. Jesus gave it to us. He did not give it to us. That's injustice.\nOur ancestral land, our ancestral land,\nland our enslaved ancestors worked,\nland our families fought in wars to protect,\nand land where some of our own were even lynched.\nThat means hanging for defending their own freedom.\nI want to thank you right now.\nget real emotional and I've been getting in a lot of trouble.\nBut it's all right.\nBecause I think, what did John Lewis y'all help me?\nThat said, his mama used to say, boy,\nwould you been out there and do it?\nAnd he said, mama, I've been out there getting it.\nIt's a good trouble.\nAnd that's what I've been getting into.\nAnd I didn't mean to get emotional,\nbut I left some people back on show's road\nand some friends and I'm going to say that Senator Fry,\nSo many people, the slaves, this organization right here\nwith Larry has, and there's some people out there,\nand people all over the country you are.\nThey're looking at Georgia.\nThey're looking at Georgia.\nThis is not no longer a Georgia situation.\nSo Georgia, what are you going to do?\nAre you going to let this country, this world,\nwatch you, hand over land. Not only my land, our land, Smith land, Garrett land,\nReed land, an entire community of families where that train's gonna run\nliterally in their backyard. I don't care what you read about football these\nfolks. Come down. They're watching to see what Georgia is going to do for its\npeople. All right? Thank you all very much for listening to us.\nGood afternoon everyone. My name is Mark Smith and I am from Shoes Road. My grandfather\nabout the property on Shoes Road where we live.\nHe bought 600 acres.\nIt's been been over 100 years ago.\nAnd none of that is taken into consideration when it comes\nto taking that land from us.\nWe have fought this fight for three years now,\nand we're going to continue to fight it.\nI have three sons who I want to continue this legacy.\nAnd I'm sure the Garrett's, they have sons\nwho they want to continue their legacy.\nWe don't want anybody to take this from us.\nWe got a letter in the mail some three years ago.\nAnd he told us, this is Mr. Tarbotton,\nhe told us that our land would be needed\nfor a project that he has.\nAnd that's all he said.\nHe didn't say anything about any kind of compensation\nor I'm sorry, he didn't say anything to none of that effect.\nIt was just that we needed.\nAnd so we didn't quite know what to do\nwhen we first got that message.\nThat's the first we'd ever heard of anything like that.\nAnd then when we told him that he's not welcome\nto come on our property that way,\nhe told me that he would call the sheriff department\nthem to remove me, you know. And we've had this property for over 100 years. My\ngrandfather bought it in 1926 and we could never believe that we would hear\nanything like this. So we just kind of didn't know what to do at first. And so\nthen we decided, okay, let's fight. And it's been an uphill battle ever since.\nIt cost us all kinds of money, it cost us, it even cost me my health, you know, this\nworrying about this thing and that I was going to lose my grandfather's property.\nAnd if you don't think that can work on you, and then here's a man with millions of dollars\ntelling you he's going to take it, you know, and you don't have that kind of money.\nBut like Jane said, we think the poverty center, who else is doing it with us, Institute\nfor Justice, these people stepped in and they have been fighting this battle for us for\nall this time.\nAnd we thank them for that.\nAnd I guess one of the other things I want to say here is, is everybody else in this room,\nyou have you make sure that you put it in a situation where nobody can come and\ntake it because this is what happens to us he didn't ask us he didn't say that\nthat's what he wanted to do for any good purposes he just said he needed it he\nwanted it you know but then he came up after we after we had something to say\nhe said that it was for the for the good of the people and we haven't seen\nanything good for the people in this year. It's good for him and his own. He wants to take what\nour family has, has and give it to his family. And we just, we've cried, we've done everything.\nWe didn't know. But, okay. It's, it's, uh,\nOkay, ladies and gentlemen, we have heard today pain frustration\nAnd this is just clearly a case of the rich coming in and let's call it what it is stealing\nland from everyday citizens that have lived, that have history and have built history in\ntheir families on that land for decades.\nAnd unfortunately, we're seeing the rich, the powerful, and big business do this across\nthe nation.\nBut we need to take a stand here in the state of Georgia, and I want to thank the residents\nof Sparta for coming down here to share your story today.\nWe are with you.\nWe are ready to help lift your voices on this issue and stick with you and do whatever\nwe can.\nSo I call on everybody today that's listening to us to reach out to Governor Kim, reach\nout to the legislators in this state, tell them what you've heard today, help the residents\nus part of, stop this big business from coming in and taking what is rightfully belonging\nto those that live there.\nSo with that, we're going to take questions, and if y'all stick around, we do have a little\nmore piece to do as we talk about some other things that are happening here, but we are\nopening up for questions for anyone that has any at this time.\nThank you all for showing up here today and speaking out and let us know what else we\ncan do to help.\nWith that, we're going to end this portion of the press conference.\nOkay, everyone.\nWe're going to shift here a little bit.\nWe still have members that are going to stay here and speak about this issue.\nWe have two other issues to talk about really quickly.\nAnd I want to hit on the injustice that we saw last night, play out on the Senate floor\nas we work to push back and stop HB127 that is a tack on DI in our state.\nAnd last night, after the majority prematurely ended discussion, they showed that they were\nunwilling to be accountable and to hear the concerns of GLBC members.\nI have never seen such an act of disrespect in the Georgia Senate during my time at the\ngold dome.\nWe were silenced, all we were seeking to do was to take a poorly written attack of a bill\nand make it better.\nTo try to fix it, actually, we had 19 amendments that the Senate Democrats introduced, and we\nwere not able to talk about any of them.\nThose were used, procedures were used to silence us and shut us down.\nAnd it specifically threatens funding, HB 127, the anti-DI Bill, threatens funding for\neducational program or discussion, and it is systemic oppression and social injustice\namong many other things.\nTell me how we can talk about Martin Luther King or John Lewis or two of Georgia's greatest\ncitizens and champions of social justice without discussing systemic oppression.\nWe also have HB 397 which is packed full of policies blatantly designed to shift powers\nin ways to help the majority cheat to win by changing the rules because they can't\nelections on their own merit. It appears that the majority party is no longer\nwilling to win support at the ballot box by passing policies that\nGeorgians support and are asking for. So they have worked continuously to\nengineer the results that they want and they want to change the rules of the\ngame every time black people get close to winning elections. I'm now going to\npass the podium on over to our leader, our Senate leader,\nminority leader, Senator Harold Jones, who's going to go\nfurther in-depth with important information about both\nof these bills.\nThank you.\nThank you.\nAnd one of the things that you'll notice about this\nis all of this is connected.\nhas been stated, it's the powerful versus the powerless.\nSo we're going to be talking about DEI Bill, the voting bill,\nall sorts of things that are happening\nwith these folks here in Hancock County and Washington County,\nand all is the powerful versus the powerless.\nOver this summer, Georgia plans to cancel 455,000\nactive voter registrations, one of the largest voter\npurges in the United States history.\nThese registrations take the form of persons\nwho have been moved.\nalso it takes the form of people who have not participated\nin the last two general elections.\nFirst, no one should ever be removed from a voter roll\nbecause they have not voted.\nThere could be various reasons where they have not had\nthe opportunity to vote.\nThose reasons number one could be that they're not voting\nactually tells you that they have a distrust or mistrust\nor they don't believe in the system.\nAnd it is our job to actually bring them back to the polls.\nBut does that not mean that they're not\ninterested in voting.\nAlso, they may not have had transportation\nfor those particular actions when those voting dates took place.\nThey could be various reasons that our person may miss voting,\nto remove a person off the voter rolls,\nbecause they have missed a vote is wrong,\nand Georgia's prepared to purge almost 100,000 people\nwho fit this particular category.\nThis purging, though, comes on the backdrop of HB 397,\nwhich Senate just passed.\nAnd understand this, these purgers are based on data produced by Eric, the Electronic\nRegistration Information Center.\nBut HB 397, which actually the Senate passed, says in July 1st, 2027, Georgia will be removed\nfrom Eric, and according to Senate Republicans will remove from Eric because we don't trust\nthe Eric system.\nTo understand, on the one hand you have the Georgia Secretary of State, who is actually\ngoing to remove 100,000 people, a total of 450,000 people using this Eric system.\nAnd on the other hand, you have this Republican Senate that is saying they don't trust the\nEric system and they actually want to come off of it.\nThe absurdity of this cannot be overstated.\nAnother aspect of 397 is that they would not allow counties to accept absentee ballots\nafter the advance voting actually taking place.\nSo the advance voting ends on that Friday.\nWhat some counties were doing was establishing absentee ballots\nlocations that a person could still actually bring their ballot there\non that Saturday or Sunday.\nHB 397 has eliminated that opportunity.\nAnd the word, the theory was that some counties,\nor counties may not be at a handle,\npeople dropping off their ballots on Saturday and Sunday\nbecause the election is on Tuesday.\nBut do we actually have people who came to testify to say,\nthe people that are receiving the ballots\non Saturday and Sunday?\nThey're not even the same folks necessarily\nthat will be working on Tuesday.\nBut here's the bottom line.\nCounty should have the opportunity\nto make that determination.\nWe appear in the state capital should not\nto prevent counties from actually being able to determine\nwhether they want to have ballot access on Saturday and Sunday.\nAs usual in the state capital,\nRepublicans are only like local control\nwhen they actually can control it.\nSo here's what we must do.\nThis is what the voters need to make sure that they do.\nNumber one, if you have missed a general election vote,\nyou need to contact your Board of Elections\nand let them know that you still want to actually vote.\nEven though the rule is what the Secretary of State is using\nis to last two general election votes,\nI would encourage anyone who's missed a general election vote\nto make sure you contact your Board of Elections.\nSecondly, if you have moved and returned in the last year,\nmake sure that you contact your board of elections.\nIf you have moved but you have returned in the last year,\nplease contact your board of elections\nand let them know you're here, you're now registered\nand you want to vote.\nAnd then third, if you receive any mail\nfrom the board of elections, do not discard it.\nMake sure that you open it, read it,\nand if it requires a response,\nmake sure that you actually respond.\nThis bill, HB 397, is not set in stone yet.\nIt still has to go to the house.\nSo we encourage that the house will actually\ndefeat this particular legislation.\nAnd we also encourage people to realize\nthat the Republicans are engaged in this voter suppression\nand actually trying to prevent people from voting.\nAnd with that, I'll turn it over to Ms. Senator Merrick.\nApplause\nOkay, we have one more speaker.\nWe have a student here, D.I.?\nYes, we got to go, we have one more speaker.\nYou're going to speak on the DI?\nYes.\nOK, we have one more speaker today.\nWe have Brandon, and he is going to talk a little bit\nabout the DI bill, that's HB127, that passed through last night.\nAnd we're going to let Brandon have the microphone.\nThank you.\nGood afternoon. My name is Brandon. I'm a student at Georgia Tech and I'm here\ntoday in between classes to plead with our Georgia State House\nrepresentatives to vote no on HB 127. I'm very disappointed to learn that this\nbill for teacher leave was being hijacked with language from a bill that did not\npass by the crossover deadline and that many of my fellow Georgia Tech students\nhave spoken up against. I'm here to continue speaking against it because I know\nthat diversity, equity, and inclusion programs\nare designed to give every student, students like me,\na fair chance to work hard and succeed.\nSupports for this bill argue that DEI programs\nhave become discriminatory.\nThat merit has been replaced by sympathy.\nBut I stand before you today to say\nthat this is not the entire picture.\nDEI is an acronym.\nIt stands for Diversity, Equity, and Inclusion.\nMuch of the outrage has been directed at diversity.\nPerhaps because it's easier to pinpoint,\nnumbers can be counted,\ndemographics can be tracked,\nbut that narrow focus misses the deeper work DEI does.\nSo let's turn our attention to the other two.\nLet's take a moment to talk about equity,\nensuring fair treatment, access, and opportunity\nfor all individuals.\nPicture a student applying to a prestigious university.\nA student who does everything that they can with what's available, a student who shows up\nto school every day, a student who has the potential to excel at the university, but they\ncannot because of their low income area.\nThe resources available are just not enough.\nTheir application is overlooked not because they lack intelligence, but because they lack\naccess to the tools needed to build a good one.\nYou cannot claim to value merit without ignoring the barriers that prevent students from\ncompeting on equal footing.\nThen there's inclusion, creating environments where everyone feels welcomed, respected,\nand supported.\nThink of the student who uses a wheelchair every day alone during recess because they\ncan't access the playground.\nThe bill would prevent schools from creating programs that bring that child into the community.\nI could fill the bookshelf with stories like these,\nboth unique and deeply common.\nStories of students who aren't asking for shortcuts\nbut are asking for shoes so that they could also race equally.\nYes, some DEI programs are not perfect,\nbut we do not abandon it.\nNo, we amend, revise, and evolve.\nBecause the vision it aspires to is worth the effort.\nThe bill is signed.\nThis bill is a sign of our representatives\ngiving up on those who need help the most.\nTurning their backs not because the work is done,\nbut because the work is hard.\nThe aim of DEI is not to replace merit,\nbut to reveal it.\nBy removing the noise of systematic barriers,\nunconscious biases, and unequal access.\nLet us move forward, not because it is easy,\nbut because it is the right thing to do.\nThank you.\nOkay, everyone, I want to thank you again for joining us.\nWe'll open up for any other questions that anyone has out there.\nAnd if not, thank you again for joining us and enjoy your afternoon.\nYou\n",
  "updated_at": "2026-02-12T18:50:58.499699+00:00"
}