{
  "video_id": "P4QzliqDTf0",
  "url": "https://www.youtube.com/watch?v=P4QzliqDTf0",
  "title": "Lt. Governor Burt Jones Inaugural Dekalb & Fulton Constituent Services Day",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "Overview:\nThis session featured remarks from Georgia Lt. Governor Burt Jones highlighting his office's focus on constituent services and education initiatives, including a book drive for underserved communities.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Lt. Governor Jones discussed his goal of having a \"Chick-fil-A mentality\" in his office's constituent services, with staff assigned to travel the state and address local issues.\n- He emphasized education as a top priority, noting it makes up nearly 60% of the state's budget. He praised partnerships with groups like the Georgia Leadership Council to promote reading comprehension and provide book donations.\n- Jones highlighted the work of former UGA and NFL player Malcolm Mitchell, who has focused on literacy initiatives since his football career.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes provided.\n\nAdjournment:\nNo adjournment time given, but this appears to be an event rather than a full legislative session.",
  "transcript": "Good afternoon, or maybe it's still good morning. We're pretty close. Thank you so\nmuch for coming today to our very own Lieutenant Governor Berk Jones\nConsituent Services Day for both the Cabin Foam County. The Lieutenant\nGovernor's position here in Georgia is so important and no one has let the\ncharge to be in with constituents to help them from their jobs to their\nhome life and their families more than Berk Jones. We're so thrilled that he has\nmade this a top priority for his office and we're here today with all these\nwonderful resources to help all those live in this community. So without further\nado I'd like to introduce you to the Lieutenant Governor for the State of\nGeorgia, Fertzhugs.\nGood morning! I appreciate everyone being here today. This is an exciting day and I'm\nI'm also very appreciative of all the senators and house members that we have here today.\nWe started something when I first got elected, Lieutenant Governor, I thought I always said\nI wanted our office to have a Chick-fil-A mentality, you know, with the constituent services\nand we wanted to be, because that's what we are.\nWe're elected by the people and we're supposed to be servants for the people.\nSo we started a constituent service program where we've got some great individuals, T.J.\nHudson, who is here as well as Ben Garcia and I don't know if Luke's here or not, but we've\ngot three out there that are covering the state and the governor's state and letting\nlocal officials know that they're coming to town to address issues, you know, every\nday constituent issues that a lot of people have.\nSo we're very proud of that.\nYou know, also when you're out on the campaign trail, you always make the one thing that's\nalways a constant when you hear a politician is education.\nYou know, education is going to be at the forefront of whatever that individual is running\nfor.\nBut a lot of times an education should be at the forefront because it's the largest portion\nof our budget.\nIt represents almost 60% of our budget, about 32 billion dollars a budget.\nI'm from, that's a lot of money, I don't know about children, but you know we said education\nwas going to be a priority, children were going to be a priority to us and helping parents\nand guardians and educators have the best tools to be successful and I am proud to have\nthe Georgia Leadership Council and this is our inaugural event here where we're doing\na book drive for those individuals who aren't, you know, as fortunate as some others.\nWe want to give them opportunities because I think reading comprehension is, I think that's\nthe key to success with anything, quite frankly.\nIf a child growing up, if they know how to read, write, and do arithmetic, they're way ahead\nof the game, you know.\nAnd I will tell you that I've always hear that, you know, that third grade, you know,\nmajority of your kids can't read to the third grade level, you know, by the time they\nreach that.\nI want that to change, you know, I want that to change, and I'm proud to have Scott Johnson\nhere with the council, proud to have Dr. Woods here, and I can't, you know, I still call\nrepresented, right? But I know you have had a lot of good roles and done a lot of good things,\nDr. Wood. I appreciate you being here and you know because all this takes partnerships and you've\ngot to have partnerships with house members, senate members and as well as people who are over\ndivisions as forward as Dr. Wood and Riley and also Johnson. So we're excited that we have\nhave been successful. Our goal was to have a thousand books, and we've got a little over\n2,000 books. So give yourself a round of applause.\nYou know, and he's not here today, but I tell you if you got this on the, on the, the,\nthe really got, brought it home to me. It's been a good friend, Malcolm Mitchell,\nHere from Valdosta, Georgia. He he's he's better known for his football play days at University of Georgia\nAlways telling me you'd be very glad you didn't play same time. I did mouth. I\nWould just been one more person you may look back\nbut\nMalcom is something he's obviously played universe Georgia went and went on to the NFL and played for the New England Patriots had a very good career there\nAnd what was so impressive about Malcolm is his story, you know, quite frankly.\nObviously, athletics was a reason why his abilities and athletics and him as an individual\nwas a reason why he got to the University of Georgia, but it took some real maturity and\nforesight on his part to realize that while he was there, even though he, he and I'm not\nhe didn't say himself, he said, you know, I couldn't read well, you know, I was not good\nin school, but he made it his mission to turn that around and then once he was done\nin the NFL, he wanted to make it his mission again to reach out and contact people in\nsimilar situations because he understands the value and he's doing great things with\nhis foundation and every time I try to get a chance to highlight his efforts and everything\nI try to do that so you know he's out of town right now I would be remiss if I didn't\nbring him up here so we're you know this is nothing more than to show our appreciation\nto folks up here and here in the crowd and like I said if you want I think if you have\nyou want to be serious about education you got to be doing things to show that\nyou're serious about education and and that's all forms that's that's public that's\nprivate and and at the university level that's you're from your technical\ncolleges to your university systems we want we want to be a partner with the\neducation outlets and and we're proud to do that so thank you all very much for\nbeing here and really appreciate this and and we will the goal next year will be\nThank you all very much, we appreciate it.\n",
  "updated_at": "2026-02-12T12:19:24.637167+00:00"
}