{
  "video_id": "p4viBxmlPrg",
  "url": "https://www.youtube.com/watch?v=p4viBxmlPrg",
  "title": "House Day 32 for the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 32,
  "video_date": null,
  "duration_minutes": 118,
  "summary": "Overview:\nThe Georgia House session on this day featured the introduction and consideration of several bills, including HB 743, HB 744, HB 745, HB 746, HB 884, SB 145, and SB 88. The session began with a scripture reading and prayer by the guest chaplain, Pastor Powell Goodhard from Sherwood Baptist Church in Albany.\n\nKey Actions:\n**HB 743**: [Bill description]\n**HB 744**: [Bill description] \n**HB 745**: [Bill description]\n**HB 746**: [Bill description]\n**HB 884**: [Bill description]\n**SB 145**: [Bill description]\n**SB 88**: [Bill description]\n\nBills Introduced (First Reading):\n- [Bill 1]: [Description]\n- [Bill 2]: [Description]\n- [Bill 3]: [Description]\n\nNotable Moments:\n- Pastor Powell Goodhard delivered the opening prayer and spoke about the importance of wisdom from the Book of Proverbs for the legislators.\n\nVotes:\n- HB 743 was opposed by some members but ultimately passed.\n- SB 145 was passed unanimously.\n\nAttendance:\n- The Speaker called all members to the floor and conducted a roll call to ensure a quorum was present.\n\nAdjournment:\nThe session was adjourned. The next session will be held on [Date].",
  "transcript": "All members will please come to the floor. All members. Our our convening having arrived. All members will please come to the floor and take their seats. Mr. Clerk will you ring the bell? All members please come to the floor. We were given just to many for regulated industries to get over here. All members please come to the floor. We're going to have the afternoon row call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk will you unlock the machines? All members voted. All members vote. Now I believe all members have voted. So Mr. Clerk you will lock the machines. Well good afternoon. Good to see you all after a couple days off and a great St. Patrick's Day celebrated down in Savannah and in Dublin and some other places around the state. Hope you all were able to enjoy all the good times. The St. Patrick's Day brings. But we got some business to do today. So we're going to get started. Doorkeeper, please close the doors and keep them closed. As is our custom, we will begin our day with Scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this afternoon be introduced by the gentleman from the 150 second House District. Representative Bill Yerter, Representative Yerter. Thank you Mr. Speaker. It's my pleasure to have Pastor Powell Goodhard from Sherwood Baptist Church in Albany. Powell has been married to Brebel for almost 29 years and they have two daughters, Shana and Kaylee. And they were not able to be with us today but Powell brought one of his members, Chad Wolvenson. Chad also serves on the City Commission down in Albany and glad to have Chad with us today. Pastor Powell received his BA from the University of Georgia, his Masters of Divinity from South Eastern Baptist Theological Seminary, and his PhD from Adonai University. He was the founding and lead pastor of Life Baptist Church in Las Vegas, Nevada. He's also published three books. Powell has been the senior pastor at Sherwood Baptist Church in Albany since 2021. Sherwood is commonly known as a church. It started the movie. Sherwood movie for me. They produce movies facing the Giants, Fireproof, Courageous, War Room, and most recently the Forge. These are inspirational movies that people have seen all over the world. Sherwood really does and Powell does a wonderful job, registering to the Albany Air and spreading the gospel to those folks. Powell, welcome to the people's house. Thank you, Representative Yerda, for the introduction and also speaker burns for the invitation. Distined ladies and gentlemen and members of the Georgia House of Representatives, it is an absolute honor to be with you all this afternoon. I want to thank you all for not only what you do but for the people you serve and how you go about serving the people in the state of Georgia. Now in your role I am gathering there is not a lack of people offering their opinions and bringing complaints and many times making demands. And as a Baptist pastor I can 100% connect with that entire idea. So anyway, many times people do not understand the way to responsibility that you all are shouldering each and every day. And the types of decisions that you are making that are going to impact thousands of people within your district as well as millions of people around the state of Georgia. And I want to thank you for your willingness to serve the people in the state. So as I was thinking about our time together I wanted there to be something that I could share that would be of value to you, to the role that you are in, to the responsibilities that you carry as well as to the decisions that you make. And very quickly the idea of the book of Proverbs came to mind. The book of Proverbs is a book of wisdom and wisdom is more than knowledge. Wisdom is the right application of knowledge. Wisdom is what allows a person to live a skillful life that they do the right thing at the right time. And in fact the very first four verses of Proverbs chapter 1 Solomon tells us the purpose behind the Proverbs. And here's what those verses say. These are the Proverbs of Solomon, David's son, King of Israel. Their purpose is to teach people wisdom and discipline to help them understand the insights of the wise. Their purpose is to teach people to live disciplined and successful lives, to help them do what is right, just and fair. These Proverbs will give insight to the simple knowledge and discernment to the young people. For the person who is willing to study the Proverbs and to apply the teachings that they will find, there are three different sets of benefits that Solomon describes to those who will study and apply these. The Proverbs will teach wisdom and discipline that enables a person to live a structured and successful life. Everybody wants to be competent and effective and successful in what they do. And Solomon is saying if you'll apply these, that's exactly what will happen. Also the Proverbs help a person gain understanding so that they will do what is right and what is just and what is fair. Wisdom leads to right actions and just living and fair treatment. It really doesn't matter what person you're talking to, what political party they're a part of, what religious affiliation they might have, or even personal worldview they might have. Those are values that many of us hold in common. The Proverbs also will give insight, knowledge, and discernment to those who are young or inexperienced. Just a connection piece here, I was 27 years old when I became a senior pastor. And I'm not exactly sure who thought that was a great idea, me for accepting the position or the church for offering the position, but at that point in my life, I thought I knew a pretty good amount about a lot of things. Over the course of the years, I have realized how little I actually knew at that point in my life. I needed insight and knowledge and discernment. And here's the thing, it doesn't matter how old we are right now. Our world has changed so fast we are always walking into challenges that there has not been a forerunner going into. We need wisdom and insight and discernment. So 26 years ago, I had a mentor come and challenge me to read the Proverbs, the chapter in the Book of Proverbs that corresponds with the date of the month. There's typically 31 days in the month, there's 31 chapters in the Book of Proverbs. And that was a challenge I took to heart, 26 years ago. It takes about five minutes a day, but here's what I can tell you. Five minutes a day, you will find a little bit of wisdom will make a huge impact in your life. There are countless times that what I read in the Book of Proverbs that day helped me not make an unwise decision. There are days I didn't know what to do, and Proverbs 35 and 6 would remind me, trust in the Lord with all of your heart. Do not lean on your own understanding. See his will in all you do, and he will show you which path to take. I didn't think I needed anybody's help to make the decision I was about to make, and yet at the same time Proverbs 12-15 challenged me. Fools think their own way is right, but the wise listen to others. There are some days that people would say some really hurtful things, and I wanted to respond and like fashion back to them. I read the Proverb of the day, and it says in Proverbs 12-16, a fool is quick-tempered, but a wise person stays calm when insulted. A little wisdom goes a long way. When we seek God, seek His will, God has a way of getting the right word at the right time to help us make the right decision. Many times the question is not, can I do it? The question is, is it wise? I encourage you, take that Proverbs challenge every single day. Five minutes of time can pay off in a huge way. A little bit of wisdom goes a long way. If you would stand with me as we have a word of prayer. Heavenly Father, we thank You so much for this group, for who is represented, for the decisions that are being made, for the laws, the pieces that are being passed God. We ask You are blessing upon every part of it. May You give wisdom, discernment, and insight that will impact not only the families and individual districts, but also those throughout the state of Georgia. We thank You for what You will do in Jesus' name. Amen. If You would, as pledge allegiance. We thank You for the pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God, indivisible with liberty and justice. Thank you. That was awesome. Members, we want to thank Brother Paul for that devotion. I will congratulate this house. You do listen a lot and you exhibit great wisdom and decisions we make. Keep up the good work. Doorkeepers, you may open the doors. Members, you may join Brother Paul in our south any room. Thank you for His words today and take a photo. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Members, our doctor of the day today was invited to join us by representative Katie Dempsey. And that is Dr. Gregory Harris. Dr. Harris is downstairs in eight states. If you need Dr. Harris, certainly go down to visit. We want to thank Dr. Harris for spending the time with us and willing to serve with this house. Chairman Hilton has recognized and cheer the committee on information on, oh, it's Chairman Hilton. Thank you, Mr. Speaker. It's picture day. Your committee and information and audience is looking good. We've read the journal the previous legislative day and we have found it to be correct. Thanks for your diligence. Chairman Hilton, the chair of the committee of the information and audience reports that the journal, the previous legislative day has been read and found to be correct, is any objection to the speech with the reading of the journal here in none. The journal is reading the journal is dismissed with this any objection to the confirmation of the journal here in none. The journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? The recommendation of the 104th moves following will be established as the order of business or in the first part of the period unanimous consensus introduction of bills and resolutions, first reading and reference files, bills and resolutions. Second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions. Good morning, orders. We're going to see the order of business for the day, period, none the resolution is adopted. First reading the bills and resolutions, clerk, will read. House bill 767, my represent have acclaimed the 109th Hilton and the 48th, back to the 96th, not a 2G, the 105th Martinez is the 111th and others. Bill Bittado, an act to amend the act, providing for the election to the Board of Education and Gwyneth County. Andrew Gervell, court nation. House bill 767, eight rate, represent a reach the 99th, that's station 104th, hung on the 103rd, clerk of the 108th, a coye, the 102nd and others. Bill Bittado, an act to amend the act to continue and recreate the state court of Gwyneth County. Andrew Gervell, mental court nation. House bill 767, that's station 69, represent a reach the 99th, that's station 104th, hung on the 103rd, clerk of the 108th, mentally 88th and others. Bill Bittado, an act to amend the act, creating the Gwyneth Judicial Circuit and providing for its powers, duties and jurisdiction. Andrew Gervell, court nation. House bill 770, by represent a reach the 99th, that's station 104th, hung on the 103rd, clerk of the 108th, beckles the 96th and others. Bill Bittado, an act to amend the act, creating the Gwyneth Judicial Circuit and providing for its powers, duties and jurisdiction. Andrew Gervell, mental court nation. House bill 771, by represent a reach the 21st, red, lead the 22nd, scogas, the 14th, Jones, the 47th, Jasper, the 11th and others. Bill Bittado, an act to amend the act, providing a homestead exemption from Cherokee County School District, ad volorum taxes. Andrew Gervell, mental court nation. House bill 772, by represent a enrollment of the 97th, beckles the 96th, limit of the 98th, bill Bittado, an act to amend the increase the homestead exemption from city and ad volorum taxes for residents of city and north cross. Andrew Gervell, mental court nation. House bill 773, by represent a reach the 21st, berry, the 56th, bill of the 75th, scog of the 76th, burn out of the 77th and others. Bill Bittado, an act to amend, title 47 of the official go to Georgia and send it relating to retirement and pensions. Retirement. House bill 774, by represent a Crawford of the 89th, renter of the 85th, Mitchell of the 88th, Barnes of the 86, Oliver of the 84th and others. Bill Bittado, an act to authorize the assessment collection of a technology fee by the probate quarter into cab county. Andrew, governmental coordination. House bill 775, by represent a Crow, the 118th, bill Bittado, an act to amend, and act to provide a homestead exemption from Buts County School District, ad volorum taxes. Andrew, governmental coordination. House bill 776, by represent a Jones, the 47th, blaze, and the 67th, martin the 49th, McQueen, and the 61st Jones, the 25th and others. Bill Bittado, an act to promote, provide a homestead exemption from Fulton County School District, ad volorum taxes. Andrew, governmental coordination. House bill 777, by represent a Jones, the 47th, blaze, and the 67th, martin the 49th, McQueen, and the 61st Jones, the 25th and others. Bill Bittado, an act to provide a homestead exemption from Fulton County School District, ad volorum taxes. House bill 777, by represent a Jones, the 47th, blaze, and the 67th. Andrew, governmental coordination. House resolution 590, by represent a Dickey, the 134th Parsons, the 44th, martin the 49th, Williams, the 37th, Anderson, the 10th. Resolution creating the House, study committing on telecommunication services and programs. Energy utilities and telecommunications. House resolution 591, by represent a can of the 58th, Bennett, and the 94th Miller, the 62nd, Hugley, the 141st, Gofield, the 63rd. Resolution recognizing March 14, 2025, is black and midwives day. Public and community health. House resolution 592, by represent a Newton, the 127th. Resolution creating the House, study committing on non-compete clauses and physician contracts. Health. House resolution 593, by represent a Newton, the 127th, Taylor, the 173rd, green to the 154th, Hawkins, the 27th, and Williams, the 168th. Resolution creating the House, study committing on maternal prenatal and pediatric care access and funding. Public and community health. That completes first readers. Second reading the bills and resolutions. Mr. Clerk, will you read? House bill 755, by represent a ballad of the 23rd, and Ridley of the 22nd, Thomas of the 21st, Jones of the 47th, Scottings of the 14th, and others, have billed to authorize the governing authority of Charity County, Celebian, X-size, tax. House bill 756, by represent Jackson of the 165th, Hitchens of the 161st, P3 of the 166th, Galliard of the 160th, Westbrook of the 163rd, have billed to him and in act creating a Chattano area of transit authority. House bill 757, by represent Cali of the 16th, Jasper of the 11th Kendrick of the 95th, Ridley of the 6th, and Mathis of the 133rd, have billed relating to Cratham. House bill 758, by represent Mathiac of the 82nd, camp of the 135th, the bill to provide a home sign exemption from Spalding County, School District AdVlor in taxes. House bill 759, by represent camp of the 135th, the Mathiac of the 82nd, have billed to him and in act to provide a board of elections for Spalding County. House bill 768, by represent Sains of the 180th, Townsend of the 179th, the Lodge of the 167th, have billed to a men in act creating board of commissioners of Glen County, House bill 761, by represent Clark of the 180th, the name of the 98th, and claim of the 109th, have billed to a men in act to provide a home sign exemption from all city of Wilburn adVlor in taxes for city purposes. House bill 762, by represent Gailiard of the 160th, and Petrie of the 166th, Hitchens of the 161st, Stevens of the 164th, the bill to provide for the creation of the Savannah Music Commission. House bill 763, by represent Stevens of the 164th, Petrie of the 166th, Franklin of the 160th, the bill to him, create and establish the Richmond Hill, Bryan County, and Airport Authority. House bill 764, by represent Jasper's of the 11th, the bill to a men in act providing for a new charter for the city of Nelson. House bill 765, by represent Campbell of the 35th, Robert Sothefifty's second, Cummings of the 39th, the 51st, Hughley of the 114th and others, have billed to a men in the Fair Business Practices Act of 1975, House bill 766, by represent Chalkas of the 151st, to build to create and establish the Sumter of America's County Unification Commission. House bill 765, 567, by represent of Canada, the 122nd, 470th, resolution honoring the life of Mr. Zara, D, story, and dedicating an interchange in his memory through second readers. Report sustaining committee is Mr. Clark, will you read represent a year to the 150th second district chairman of the committee on code revision submitted the file of report for speaker committee on code revision. As had under its consideration following bills of the senate is instructing me to report same back to the House and following recommendations Senate bill 9060 passed by committee substitute Senate bill 153, passed by committee substitute respectfully submitted represent of year to the 150th district chairman. President Chuck Martin of the 49th district chairman of the committee on higher education submitted the following report is speak to your committee on higher education is had under its consideration following bills of the senate is instructing me to report same back to the House the following recommendations Senate bill 85 to pass by committee substitute Senate bill 149 to pass Senate bill 193 to pass by committee substitute respectfully submitted represent Chuck Martin of the 49th district chairman. Representative Beth Camp of the 135th district chairman of committee on intergovernmental coordination submitted the following report for speaker committee on intergovernmental coordination is that under its consideration following bills of the senate is instructing me to report the same back to the House and following recommendations Senate bill 151 to pass by substitute Senate bill 252 to pass by substitute Senate bill 260 to pass by substitute respectfully submit represent of Beth Camp of the 135th district chairman. Representative John Corbett of the 174th district chairman of committee on motor vehicles submitted the following report you speak to your committee on motor vehicles is had under its consideration following bills and resolution of the House and senate is instructing me to report the same back to the House and following recommendations Senate bill 293 to pass by substitute house resolution 558 to pass by substitute respectfully submitted represent of John Corbett of the 174th district chairman. Representative Beth Camp of the 135th district chairman of committee on intergovernmental coordination.\n\nGlobal coordination locals submitted the final report to speak your committee on intergovernmental coordination locals out of news consideration Following bills of the House in the Senate is instructing media reports saying back to the House of filing recommendations House for 67 do pass House for 732 do pass House for 734 do pass House for 735 do pass House for 737 do pass House for 739 do pass House for 741 do pass House for 743 do pass House for 744 do pass House for 745 do pass House for 746 do pass Senate Bill 302 do pass Respectfully submitted represent Beth Camp of the 135th district Chairman That completes the read even reports of standing committees House will come to order House will come to order members please take your seats Members if I can have your attention please I have your attention please we have a special guest members the any rooms are full I can see them have a conversation you can take them there have a special guest this morning We have a member of the U.S. House of representatives so show him their proper respect and attention as a member of the House and a good Georgia native Representative Rich McCormick has joined us this morning he's been in the capital this morning and made some nice rounds speaking to some folks He does a good job of representing you folks who reside in the 7th congressional district I've visited his office and he's been extended a great warm welcome We appreciate that when we were in Washington and you've made me feel very much at home and we are very much appreciate that Appreciate the job you're doing representing Georgia we asked and we know you will keep up the good work come back to see us anytime Representative Rich McCormick home Thank you members Members we do have a local calendar this morning we have a local calendar Members we have six bills on the local calendar We have a local calendar six bills on the local calendar related home set exemption and as you know require a recorded two thirds roll code for roll call vote for passage For what purposes chair lady camp rise to make a motion state your motion to remove four bills from the local calendar and recommit them to intergovernment Orde nation You want to tell me which bills those are yes or HB 743 HB 744 HB 745 and HB 746 And you want to recommit them back to intergovernmental coordination Yes recommit them to intergovernmental coordination Ladies made a motion Mr. Clerk will you read a caption to those four bills House will 743 to be in tonne act to provide a home state exemption from the city of social circle add Walarrom taxes House will 744 To provide a home state exemption from the city of Lwala Grove add and lower taxes House will 745 to be in tonne act to provide he An exemption from city of Loganville add Dynavaluation for municipal purposes and House will 746 to be in tonne act to provide a home state exemption for City of Monroe add the latest motion the House bill 743, 744, 745, and 746 be removed from the local calendar and recommitted to intergovernmental coordination committee. Is the objection? Here it none is sorted. Yes sir. We will have now third reading and passage of uncontested local bills and the last four bills I just called out. If there's no objection we will vote on the local calendar as a whole with a recorded vote. Here he none it is sorted. Mr. Clerk will you read the local calendar without those four bills on the councilor? House bill 637 by Episode coming to 39 Cobb County House bill 732 by Episode of Townsend the 179 Glen County House bill 734 by Representative Hagen of the 156th City of Idaile House bill 735 by Representative Hagen and the 156th City of Lions House bill 737 by by Rift's and of Smith of the 18th Harrison County, House of 738 by Rift's and of Crow of the 118th Buts County, House of 739 by Rift's and of Park of the 107th City of Lawrenceville, House of 741 by Rift's and of Peachtree of the 166th Brian County, and Senate Bill 302 by Senator Kennedy, 18th Peach County. Members before I order, order the previous question, I want to let you know if you would like to join the Representative of the Democratic and South Any Room, have a few words and maybe it's a photo you'll be welcome to do that. You'll be very much welcome. Is there any objection to the previous question being ordered on the local calendar? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? Here in none, the report of the committee has agreed to shout, these bills now pass. All those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machines? All members voted. All members voted. If so, Mr. Clerk, will you lock the machine on the local calendar without House Bill 743, 744, 745, and 746, the yeas of 171, the nasal zero, these bills, having to see the requisite, constitutional majority are there, are there for the past? Members, we do have morning orders in the afternoon. We're going to begin our orders with a strict, very strict, two minute time limit. Hope you can do less, very strict, two minute time limit. The representative of the Congress is recognized for a afternoon order, a morning order in the afternoon, and friends. Mr. Speaker, ladies and gentlemen, the House, this is a very special day for me, for a very special person that's been a part of my life for 30 years. William Wright, stand up. William is just retiring as the 9-11 director of Barra County. William has served Fannen County, White County, Hall County, and his last tour of duty was in Barra County, where he's been serving there for quite a few years. A little story on William. He also works at the funeral home for me. He's a heck of a funeral director. One day we're up in Fannen County and walking from the church down to the grave and all of the sudden there's grave digger that grew up and he goes, sweet William. He's always been sweet William and me, and I'm so happy for your retirement. Before you get back to the funeral home full time, but you've got a resolution here, so when you finish, if you'll come down to the annual room, please. Hope, her singer? I just want to also thank you, William, for all of your service to Barra County. All of the planning and work that you did in helping coordinate our local agencies and everything and how the dispatch was handled on September 4th at Appalachia. Just thank you so much for everything you did and congratulations on your retirement. William, you'll come down to the third floor. Stand up, William. Mr. Wright, thank you for your service. We know your job is a very, very important job. 911 feels a void in our lives and helps us have order in our society. Thank you for your service to your fellow man. We appreciate you and thanks for being here today. I'm sure that you'll come down to the next floor. Thank you, Mr. Speaker. I am pleased to welcome Nesbitt Elementary and their student council here today with Principal Nakea Miller. I don't see them anymore in the gallery, so they probably went to catch their buses, but they served recognition all the same. I've spoken previously in this well about their excellence, particularly in robotics and the arts, but this year they put a special emphasis on something. I know it's very important to us that is literacy, recently hosting their first annual literacy night with over 200 families and stressing not just students, but also adults in the intergenerational nature of language development on a totally separate note, which I'll call financial literacy. I also wanted to recognize them as one of three Gwyneth County public schools to receive the Audit Excellence Award this year. They learned a lot here today. I particularly want to thank Leader Hewley for motivating and addressing them and representative Huddleston for showing them a freshly printed paper house bill where they learned as we all already know it all begins. Thank you, Mr. Speaker. I yield the well. Thank you, Representative William. We're sorry we missed Nesbitt. Sounds like a very impressive group. Thanks for bringing them down and giving my regards and inviting them back again. Representative Jasmine Clark and the Gwyneth delegation. Representative Jasmine Clark, Gwyneth delegation. Give the delegation and the well. Your attention please. The ladies recognized. Thank you, Mr. Speaker. Today we have the honor of having the Gwyneth Youth Commission join us today. The Gwyneth Youth Commission is a program designed to educate our youth in Gwyneth County about local government as well as to provide these youth with the opportunity to affect change in their community. They visited with the Senate earlier this morning at 10 o'clock and then they had lunch with members of the delegation and they should be here in the gallery. Are they still here? I don't know. They might have had to hit on the bus because Gwyneth has a lot of traffic to get there and they needed to get back. So thank you so much to the Gwyneth Youth Commission for coming down and learning about the legislative process and about all levels of government at the state and local level. Thank you, Mr. Speaker. Representative Mac Jackson, you recognize for an order. Thank you, Mr. Speaker. Today we rise to recognize the mayor of Thompson, Georgia, Mayor Jim, Benji Cranford and he has with him his son, JB, today. They've been excited to be here at the Capitol. They witnessed a lot of things going on. They were able to attend the rules meeting this morning. So let's give them a hand for being at the state cap of the day. Mayor Benji Cranford. If you come down to the Andrew Rooowow, get some pictures. Representative Johnny Chastain, recognize for an order. Thank you, Mr. Speaker. I have two groups from Fanning County with us today. And the first one, I'll go ahead and introduce both of them and then we can acknowledge them. The general will suspend just for a moment. I think your folks are in the gallery. We'll see. Thank you, Mr. Speaker. We have two groups with us today from Fanning County. The first one is our Fanning County High School GOP Republican Club. You guys stand up. And we also have the teacher advisors with us today with that group, Justin and Brittany Stenet. Stand up. Also, we have two special guests with us with that group, the Fanning County High School 2025 Soleditorian Julie Farmer. And the third in the class of 2025, Bella Patton. You guys stand up. Also, we have the Fanning County Lady Rebels, a single-aid 2025 State Basketball Champions with us today. You all stand up. Yeah, come on up here. Come on up here. It's your look just like that. Yes, it's standing there. All right. We have, with them, the head coach Ryan Chastain, the assistant coach Megan Orton and Randy Hallmark, assistant coach, and also we have the men's coach with us this afternoon, Greg Linder. These guys had a great season. They worked really hard like many great teams. They continue to get better each game. All the way up to the State Championship. A lot of hard work. We're very proud of you guys for winning the State Championship. And also, we have with us from the Fanning County Administration, the Superintendent of Schools, Shannon Dealer, the principal of Fanning County High School Scott Ramsay, the assistant principal David Henson, and the athletic director, Jeremy King. I'll be all stand up and welcome to the Capitol today. Thank you. We also have our resource officer with us somewhere up there at Mr. Anthony Walden, wherever he's at. My brother, while thank you Anthony, appreciate all you do for us. Keep us safe. Congratulations. I think Fanning County is always in the State Championship or close by, aren't you all? Congratulations. I know you're all proud. I've won several over the last few years. I've watched you. Great season. Thanks for all of you from Fanning County. Is anybody in Blue Ridge holding the fort down today? Hey, everybody's here. Good. Good to have you all. Representative Jenkins, you recognize for an order. Mr. Speaker, friends, today I rise to recognize members of the Georgia River Network for Boaters Day at the Capitol. As one has traveled the globe, I can personally say that Georgia's rivers are one of our state's finest treasures, and I encourage each and every one of you to take a minute and enjoy them. Our freedom to float is big business in Georgia generating 1.1 billion in economic activity. Georgia streams and sports small businesses, some 70,000 small businesses, or 70 small businesses, offer canoe kayak, raft, paddleboard, renters, and hundreds of independent fishing guides depend on access or floating on the state's 70,000 mile network of rivers and streams. Additionally, there are three Georgia-based manufacturers that manufacture kayaks. Water-based recreation means economic development in rural Georgia. Of Georgia's 159 counties, 96% are home to streams that are capable of floating recreational vessels like canoes and kayaks. For instance, in Gilmer County, the Whitewater stretches of the Carda K River are part of a 14.9 million a year local amusement industry that creates 263 local jobs and provides 2.9 million in income. So again, welcome the voters. Leader, your frustration has recognized for an order. Thank you, Mr. Speaker. I'm very excited to recognize House Resolution 430, recognizing the Poonjob language. Did you know that the Poonjob language is named for region in India and Pakistan, and that this language is the ninth most widely spoken language in the world? There are significant number of speakers in India, Pakistan, the UK, the United States, Canada, and Australia, and that there are actually 780,000 Poonjob-speaking Americans with more than 15,000 Poonjob-speaking Georgians. We have our friends from the Sea Community and Gwinnat County, including my dear friends who are under-sing with us here today. Members of the House, have you pleased rise to recognize the Poonjob language resolution which we have here. Stay cap-able. Thank you, Mr. Speaker. Thank you, Mr. Leader. Welcome. This is good to have you all. We're always good to have folks in the people's house. We appreciate you. And thanks and come any time. Come back to see us. Members, I want to get your attention. Both of you all coming up. Members, we have some guests in the Chamber there in the gallery. I want you to give your attention to the folks who are coming up to make a presentation. Mr. President, you're welcome. You're welcome. Please give the folks in the well. Your attention. Thank you, Mr. Speaker. Today is Japan Day at the State Capitol. And so we are honored to have had 19 different Japanese-based companies that were able to exhibit and be here today to celebrate. Japan has over 700 affiliated companies in Georgia and employs over 43,000 with a cumulative investment in our state of over $13.5 billion. And this year we celebrate the 51st anniversary of the Consulate Office here in Atlanta. And we're honored today. I serve as the co-chair and Representative Neil are both the co-chairs of our Japan Caucus. And we are honored today to be joined by Consulate General Miyo Meita. And so at this time we would ask that he along with us today please stand so that we can recognize you. Thank you. We also did a resolution honoring you and this was rescheduled from the snow that canceled the original date. But we're honored to celebrate Japan a day in their important relationship that we have with our state in trade. So thank you so much for being with us and letting us honor you. Thank you, Representative. Consulate General, friends, it was great to be with you all this morning. It's a great partnership and relationship we have Japan. And thanks for your investment here in Georgia and we look forward to reciprocating that and working with you as always. Representative Moore, Representative Moore, Representative Moore fuel hold just for a second. Representative Moore, Representative Moore hold just for a second. Members, I want you to... Members, if you will help me welcome back a former member of this house, Chairman Tom Taylor, it's good to have you back. Tom, good to see you. We appreciate your work. Appreciate your relationship with Japan and all you're doing to help build on the relationship. Thank you so much. Representative Moore, you're recognized for an order now in the afternoon. Give the lady your attention, please. Thank you, Mr. Speaker. Members, please help me welcome the Georgia Latino Film Alliance, which is the first film organization founded and produced by Afro Latinos. The Alliance inspires, promotes and advocates for Latinos, contents, creators and media and is established as a nonprofit organization here in Georgia. As well, I'd like to thank Governor Camp this morning for welcoming the organization to this group, to this house this morning and ask that you stop by 2.30 today and introduce yourself to the members. Please help me welcome the members of the Georgia to the Georgia House of Representatives. They're probably down in 2.30 by now. There are some of these right there. Welcome. Thank you all for coming. And what a great week to come. It is Georgia Film Week. Thank you, Representative. Good to have you all. The film industry does a lot here in Georgia. We appreciate y'all's input and your business in helping Georgia. Thank you for being here. If I can have your attention that completes our morning orders in the afternoon, we're going to take a panoramic right now in just a minute. So here's what we're going to do. If you don't want to look foolish in this photo, you need to listen to me just for a minute. Because we can only photoshop so much. Some of you is going to take a lot. So here's what we're going to do, y'all. Clear your desk. We need all members to clear your desk. We're going to stand at ease. I'm going to give you just a moment to do this. You don't have to do it. Help the shelter. But I'm going to, here's what we need to do. You need to clear your desk that includes your binders. You need to clear your desk, including your binders. Bring off your desk. We have a few empty seats on the front row. Members in the back, we're going to ask you to stand as we go through the process. But if any of you in the chamber, especially those on the back row would like to move to the front, you're welcome to do that. I'm going to ask all guests to please leave the chamber. All guests, if you will exit the chamber, that'd be great. Okay, members, we're going to stand at ease just for a minute while you get set for the panoramic. Again, clear your desk. That includes your binders. Members in the back row, you're welcome.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you I am you you I am you you you you you you It was meant to help them go out into their communities. But unfortunately, some people didn't found out that they could use them and almost like slave workshops, paying them far less and as little as 22 cents an hour. Yes, I said 22 cents an hour. We have eight of those programs out of 60 or so still functioning in the state of Georgia. This bill would do away with those programs and have them adapt. They would have two years with federal assistance helping them go from what they're paying now, which most is about the lowest I think is $2 an hour and help them get up to the federal minimum wage of 750. That's what the program does. It's about dignity and fairness and making sure that people with disabilities are paid at least what we can do. And at least what we consider the bare minimum wage for all other workers. Mr. Speaker, if there's no questions, I will yield the well and ask for this chamber's federal vote once again. The lady has a couple of questions. It's yield. I'll take a couple, sir. Representative Jasmine Clark to your left has recognized for a question. Thank you, Mr. Speaker. And thank you so much for the bill. Does the lady you? Yes, I will. So I appreciate what this bill is doing and I would love to support it and I do plan to support it. But one of the concerns is a lot of individuals with disabilities are also on SSI. And SSI has very strict rules about how much income you can have otherwise you would lose it. Right. Does there any concern that this might make someone who gets SSI all of a sudden ineligible? Thank you for that question. No, there is no concern because this chamber and the other one and with the Senator of the Governor has safeguards. Mainly our state's able accounts, which allows these people to make and save money without losing these benefits. So those benefits of Social Security, Medicaid and Medicare are safe. Lady, you have one more question. Yes, sir. Reps of DeHolly to your left. Thank you. Thank you, Mr. Speaker. Does it generally yield? I will. Thank you. Is it not true that this bill, not only do we pass it out last time, but the good news is that so many in the disability community know that by allowing them to take part in an integrated employment environment, will actually be respecting them and allow for them to finally be able to work a job to earn what most of us have in our first jobs. Is it not true? It is true. And I will tell you that this group of workers are often the very best you will ever get. They come through rain or snow to the office to work. They work long hours and they work to their very best ability and we should all be proud of the individuals in these programs. With that, Mr. Speaker, I will yield the well. Thank you. The ladies, you, the well. Thanks to you and Senator Hickman, a good bill. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee has agreed to. This bill now passed. All in favor, the passage of the bill will vote yes. All those opposed will vote no. Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 5555? The yeas are 163, the nays are two. This bill having to see the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 8888? Senate Bill 88 by Senator Beard, and the 30th and others to be entitled back to the men code section 1562. The official code of charge annotated relating the number of judges in superior courts. So as to revive for fourth judge in the superior courts is the Douglas Judicial Circuit. This bill, I'm referring to the committee on judiciary. That committee recommends that this bill do pass. Representative Kimberley knew as recognized to present the bill, representative knew. Thank you, Mr. Speaker and colleagues. It's my honor to speak to you today about House Senate Bill 88. This bill will add a fourth superior court judge for the Douglas Judicial Circuit. It also allows them to stagger the term and allows for an election in 2026. This legislation was requested on behalf of Chief Judge, the Chief Judge of Douglas County, because Douglas County has not added a superior court judge since 1998. Since then, the growth of our county has doubled. The Judicial Council of Georgia, based on the workload analysis, recognizes that Douglas County is currently the second highest judicial circuit in terms of workload assessment. Our three judges are doing the work of 4.5 judges and have been for the past several years. We are in the budget for 2026 and this bill passed the House unanimously. This bill was passed the House Assembly last year. It was HB884 and didn't quite make it over the finish line in the Senate. So, Mr. Speaker, that is the bill and I'll take any questions. Thank you. And I ask for your favorable consideration for SB 88. I yield the well. Is there an objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. This bill now pass all in favor of the passage of the bill. Will vote yes. All those votes will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members vote of this so, Mr. Clerk, will you lock the machine? All in the past just Senate bill 88. The yeas are 171. The nays are zero. This bill here in the seat of requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of the House to Senate bill? Senate bill 145. Senate bill 145 by Senator Burns, the 23rd to be entitled an act to amend code section 1562. The Fischgoda, Georgia, annotated relating the number of judges, the spirit court, so it's to provide for a six judge, the spirit court of the Augustan judicial circuit. This bill I'm referring to the committee on judiciary. That committee recommends that this bill do pass. Chair, would you recognize the bill 145? Thank you, Mr. Speaker and colleagues. I did come for you with SB 145. It has to do with another judgeship, which is adding a sixth superior court judge to the Augusta judicial circuit. That would be Augusta Richmond County and then Burke County as well. This legislation was requested on behalf of Chief Judge Glanville of Richmond County. The judicial counsel of Georgia based on that workload analysis we discussed a moment ago is the third highest in demand for an additional judge. We are in the 2026 budget for both the governor and the House for a six judge. I hope you'll join me in voting in favor of making this needed assessment for law enforcement and judicial needs. Glad to answer any questions, Speaker. The bill has no questions. Thank you. I appreciate it. I yield the well. The gentleman is yielded the well. Is any objection to the previous question being ordered? Here in none the previous question is ordered. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. Shout this bill now pass. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk will you lock the machine on the passage of Senate bill 145. The yeas are 172. The nays are zero. This bill hasn't received a requisite constitutional majority. The bill has passed. Mr. Clerk will you read a caption to Senate bill number six? 6 Senate bill 6 by Senator Kupatcher. Mr. Clerk, the 32nd and others to be titled. And act to amend Code section 263. 22 of the EFISCO to Georgia, and to relate to other laws unaffected by the Georgia drug and cosmetic acts. So it's authorized use of testing equipment to determine whether or not a controlled substance has been adulterated. The committee on health that committee recommends a dis bill do pass. Representative Sharon Cooper has recognized to present the bill. The lady's recognized. Thank you, Mr. Speaker. Ladies and gentlemen, the House of bringing you Senate bill 6. As you know, we have an opioid problem in this state. And this bill will give us another tool, our different tools to help fight against drug overdoses. As you may know, there are strips that peel and buy. They're fentanyl strips. And if you test a drug that you're going to take, and it has fentanyl in it, these strips will tell you that so that perhaps you won't take that drug and end up dying from it. Well, there are all sorts of other drugs that are just as lethal as the fentanyl that are being used to dilute the opioids in these illegal drugs. And these strips are coming on the market, and this bill would allow them to be sold to the public. The other thing it would do, it says that if someone has these strips on them, they're not considered drug paraphernalia. And the person would not be charged with the becarrying drugs, illegal drugs with them. So that is what the bill does. And I would ask for your favor. We'll vote for this. As I said, anything we can to print deaths as long as somebody is alive. We have a chance of helping them over a common addiction. When they're dead, there is no hope. Thank you, Mr. Speaker. I yield well. Ladies, yielded the will. She had no questions. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shout this bill now pass. All in favor, the passage of the bill will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? All the passes are in the right hand. All members voted if so, Mr. Clerk, will you lock the machine? All the passage of Senate Bill 6, the yeas are 170 nays or zero. This will have received a requisite constitutional majority. Is there for pass? Mr. Clerk, will you read the caption to Senate Bill 276276? Senate Bill 276 by Senator Eccles, 49th and others will be titled an act to amend Code Section 494-148 to the Fish Go to Georgia Annotated Related to Recovery of Medical Assistance for Third-Party Live of Persegnus, Injury Disease or Disability of this bill, I'm referring to the Committee on Insurance Act Committee recommends the disbill do pass. Representative Gamble is recognized to present the bill. The gentleman is recognized. Thank you, Mr. Speaker. Senate Bill 276 brings Georgia into compliance with federal requirements. The U.S. Consolidated Appropriations Act of 2022 requires states to have laws in effect that bar-level third-party payers from refusing payment to Medicaid for a service-based solely on the fact that prior authorization was not issued for the bill. This bill is being brought to us from the agency DCH has requested this in order to be in compliance with federal law. As you know, Medicaid is the payer of last resort and only pays for covered services if there are no other liable third-party payers. This could be a commercial insurance plan, a lawsuit settlement, or workers compensation settlement. This bill will ensure that those primary payment sources cannot unreasonably deny payment to Medicaid for services for which they are responsible. This bill will uphold the integrity of the Medicaid program and increase the revenue to the program as payment by primary sources are unable to be denied based on a requirement for prior authorization. That in effect is what the bill does and I'm happy to answer any questions. The gentleman has no questions. Thank you, Mr. Speaker. I ask for your favorable consideration. I yield the well. The gentleman's yielded the well. Is there any objection to the previous question being ordered? Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Hearing none the report of the committee has agreed to. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. Mr. Clerk, will you unlock the machine? All members voted. All members voted. If so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 276, the yeas are 168, the nays are two. The bill has received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 109, 109? Senate Bill 109 by Senator Harper, sin of the 15th to be entitled to act to amend chapter 25 in Title 33, the fiscal code of Georgia and attended relating to life insurance so as to prohibit a policy of group life insurance from excluding or restricting liability for certain deaths occurring while an individual's on active duty. This bill ever referred to the committee on insurance that committee recommends that this bill do pass. Chairman Eddie Lumpston has recognized to present the bill. Mr. Chairman. Thank you, Mr. Speaker, members of the House. I bring to you Senate Bill 109. This is the same as House Bill 182 that was passed unanimously by this body on February 24th. This is a Department of Insurance Bill that deals with group life insurance as it pertains to members of our armed forces. Every life insurance policy contains exclusions. An exclusion is a defined cause of death that is not covered by the terms of the policy and is clearly stated in the language of the policy. In most policies, the term active war is most often used to define this exclusion, however, in a group life policy, the term active duty is used. Now, a person can be on active duty and not be in a war zone. In fact, only about 5% of our military actually see combat. So the purpose of the language of this bill is to make it clear that simply being on active duty in and of itself is not a valid reason to deny claim. Mr. Speaker, that's the bill. I'll stand for any questions. The gentleman has a couple of questions to your left. Representative Heffner has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Sir, does this policy offer both the potential that would not allow it to deny military personnel or to address gaps in coverage for military personnel who may be traveling in uniform in an off-duty status like in the airport? That they are not performing a function of in a war combat zone. They are actually on leave traveling home. The term active duty can apply to whether you're actually engaged in some function of your job or whether you're off duty. The term active duty is a broad umbrella that applies in a lot of ways. And with an insurance policy, the exclusions that I'm referring to particularly in this sense, active war is generally the one that we're talking about as being the issue that is of concern because you can be in an accident while being on active duty. And this stem from a situation where a person was on active duty, but was involved in an automobile accident in his hometown. So...\n\nIt makes it clear that just simply being on active duty is not a basis for denying a claim. Thank you, Mr. Chairman, for such a clear explanation. Thank you for the bill, sir. You're welcome. Representative Rees, to your left in the back. Recognize he's standing to your left. Thank you, Mr. Speaker. Does the gentleman, you? I you. Sir, I want to thank you for carrying this bill for my colleague of the Columbus delegation, Senator Harvison, who worked with a young man in our community who indeed this did happen to the insurance company, the not his claim, under the military exemption, but he was nowhere near military duty at the time. So isn't it true that our insurance commission at work with Senator Harvison and others to craft this legislation so that we can protect our men and women in uniform that are operating on their personal business, but are being denied by insurance companies just because of their service to America? Gentlemen, those are 40 speaks. Thank you, sir. Gentlemen, has no further questions. Mr. Speaker, I'll yield well. I would appreciate your favorable consideration. Gentlemen, as you do the will, we do have a speaker to speak in favor. Leader Hewgley is recognized to speak to the bill. Members, give the lady in the well, your attention, please. Ladies, recognized. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I come to speak the name of the year. The young man who died and who this bill should be named for, Sergeant Brandon Frazier. His father came by my office yesterday and his father was to thank us for moving this bill forward because his son was involved in an accident as he was home visiting the family. He was home, he's in the military, but he was home visiting the family at the time. So Mr. Frazier wants us to remember his son's name, Sergeant Brandon Frazier. And with that, Mr. Speaker, I ask everyone's favorable consideration and I yield the will. Ladies and gentlemen, the lady has yielded the will. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no, Mr. Clerk. Will you unlock the machine? All the members voted this, so Mr. Clerk, will you lock the machine? On the passage of Senate Bill 109, 109, the yeas are 172, the nays are zero. This bill has a record. Costee majority is therefore passed. Mr. Clerk, will you read a caption to Senate Bill 3535? Senate Bill 35 by Senator Walker, the 20th and others to be entitled to amend code section 33, 34, 46, will you officially code a Georgia annotate, every late in the cancellation or non-renewal of certain property insurance policies? So it's an increase in number of days of notice required to be given a policy of older. This bill evidence for the committee on insurance, that committee recommends a dis bill, do pass. We're going straightness to the insurance stuff out here, I can tell. We're actually gamble to recognize to present Senate Bill 35. Give the gentleman your attention, please. Thank you, Mr. Speaker. Senate Bill 35 simply is a consumer friendly bill in the insurance space dealing with property and casualty insurance. Right now, you have 30 days upon cancellation or non-renewal of your property and casualty policy or your homeowner's policy. That you have to be notified and all this does is give you additional time. So if you're insured, decides for whatever reason to cancel your policy now rather than having the 30 days, you'll have 60 days. Part of the rationale for doing this, as you all know, the United States Postal Service has been a little bit slower in delivering mail. And so this will provide additional time for you to find coverage beyond the existing policy that you might have. So that's all this bill does is go from 30 days to 60 days and I'm happy to answer any questions. You did a good job. You don't have any questions. I ask for your favorable consideration and I yield the well. Thank you. Thank you for the bill. Is there any objection? The gentleman's yielded the well. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to shout this bill now passed. All in favor of the passage of the bill, we'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted this so, Mr. Clerk, will you lock the machine? All in the passage of Senate bill 35, the years are 168, the days are zero. This bill has received the requisite constitutional majority as therefore passed. Members, that completes our rules calendar. We'll move on to afternoon orders. Members, if you'll join me in standing, please welcome the committee. Thank you, Mr. Chair. Thank you, Mr. Speaker. Members, this past Sunday, marked four years since the violent spot shootings, in which across three businesses, eight people were killed, six of them, AAPI women, and so if we can just take a moment of silence to remember those victims. Thank you, Mr. Speaker. Thank you, Representative Tran. Representative Matahann and the Pauline delegation. Chairman Dullet. Thank you, Mr. Speaker. Give the gentleman a moment. Ladies and gentlemen, we had some severe weather in our state. The representatives are here to talk about and Representative Matahann is going to tell us about what happened in their community. So give him your attention, please. Thank you, Mr. Speaker. Late Saturday night and into early Sunday morning, Pauline County had a tremendous weather event. It was an EF-1 tornado that struck and touched down right in the heart of House District 17. About a quarter mile from my house. There were no injuries. There were no fatalities. We felt like the Lord was with us that night for sure. Wind speeds of up to 110 miles per hour. And it actually tracked the path of Mr. Speaker. I'm not sure how it did this between me and Representative Dullet's house. So I'll take what you will from that. But I wanted to thank the members who reached out to the members of our delegation who checked in on us, offered their generators and their support. I know that some members of our community are still without power as many of y'all in South Georgia have felt so recently. And we're still trying to work on communication wires and all that. But I did want to thank the Pauline EMA and GEMA, first responders, DOT, former member of this house is now a DOT member who worked those roads with me almost every day. Y'all can see some of the damage that's up here on the board. It was tremendous. And our lineman, Y'all, the lineman who got out there in the rain dealing with out of that trustee, we thank you all so much. Grace Stone and all the other EMCs that came in, they rushed the entire district to help us. Thank you so much. And thank you, Mr. Speaker, for an opportunity to say that. I don't know if these members would like to say anything. I know it affected Rickson and Gullah. That, Mr. Speaker. Thank you. Thank you, Mr. Speaker. Jim, Gullah, well, thank you members. We're certainly sorry that it impacted your community, but we're blessed, no deaths, no serious injuries, so that's a blessing. But I want to thank you in your delegation and the members of this house. Anytime there's, there's weather troubles around our state, this house is always responded to the fellow members, taking care of neighbors. So thank you for that. And I know that our Reptile Montahan has been a champion for helping folks all over the state, especially in South Georgia. So thank you for being so helpful to others. And sorry, it came home to y'all, but appreciate you helping your neighbors. Reptile Kendrick is recognized for an afternoon order. Reptile Kendrick. Thank you, Mr. Speaker. I am rising today to wish my grandmother a happy 83rd birthday. We celebrated this weekend with her. And so I just want to wish her a very happy birthday. Now, speaking of birthdays, this is my annual birthday rent. So for those of you that are new, you know that each time there is a member that has a birthday, the speaker calls out their name and everybody gives them a round of applause. But for those of us that have a birthday outside of the legislative session like me, August 28th, we don't get the here to speaker's name, we don't get a round of applause. So for those members who have a birthday outside of the legislative session, if you stand up so that our colleagues can give us our just-do for having birthdays outside of the legislative session. Thank you, Mr. Speaker. We could come back as special session to take care of that. What do you think? No, no, no, no. Think you're right, Shay. No, no, no. Got to get everyone in the act. That's a good one. Chairman Bonner recognized for an afternoon order. Thank you, Mr. Speaker, colleagues. I just wanted to bring your attention that earlier today we inducted 14 Georgia's in the Georgia Military Veterans Hall of Fame. Of those 14, seven of those awards were posthumous. But every single one of those folks represented every corner of Georgia represented all branches of service. And those photos will be on display down in the first floor hallway as you come through security. So I just want to draw your attention to that and take a moment to see those photos on your way out. Thank you. Chairman Dickie recognized hand friends and friends and friends who have friends. Chairman was recognized. Thank you, Mr. Speaker, colleagues. On each of your deaths is a commemorative bottle of Coca-Cola that our great commission of agriculture. Tyler Harper put on your desk and I just want to say a shout out to the wonderful things that your department of agriculture do. Not only for farmers keeping agriculture number one in this state, but also to consumers keeping them safe and fed in this state. So I hope you enjoy the commemorative bottle and the 150th anniversary of the Georgia Department of Agriculture. Thank you, Mr. Speaker. Thank you. Representative Sharper is recognized for an afternoon order. Thank you, Speaker. Those of you who know that I've been up here now 13 years. And I'd like to say that our doorkeepers are very, very special. We've seen some come and go and I try to stay in touch with them, you know, throughout the office session. But today we have a very, very special birthday. We're Ms. Mary Alexander over there in the red. So I'm going to sing a special song to you. Happy birthday to you. Happy birthday to you. Happy birthday. Happy birthday to you. Happy birthday to you. Happy birthday. Thank you, Ms. Mary. Thank you, Ms. Mary. We appreciate you. We appreciate all of our doorkeepers. Thank you for the work you all do for us. That completes our afternoon orders. We have some announcements this time. We have a whole slew of private resolutions. Ms. Clerk, will you read a caption to a group of privileged resolutions? Honoring the life and memory of Kenneth K. Mickens. Honoring the life and memory of Audrey Lean Clinton Fisher. Honoring the life and memory of Lester Bill Allen. Honoring the life and memory of Pastor Wallace B. Herring Senior. Honoring the life and memory of Mr. Francis Mollin-Yall. Recognizing commending the International We Love You Foundation. Congratulations, commending Kisha J. Porter for receiving the 2025 Yellow Rose Nickety Randall Service Leadership Award. Recognizing commending the Rose Nickety Beard debutant club on insisting. Cotillion. Recognizing April 20, 2025 is Minority Health Month in Courage and Collestor All Screening. Recognizing commending the Atlanta Institute. Recognizing commending Reverend Nisharal Harris King on the occasion of her 20th pastoral anniversary. Congratulations, the Hardaway Hawks, varsity girls, basketball team for winning the 2025 G.S.A. Class of 2020. G.S.A. Class 2A girls, varsity basketball state championship. Recognizing commending. Coach Keith Maloof upon his retirement. Recognizing commending. Tony Leigh. Recognizing and commending Reverend John H. Herring. Commending Sarah Mallett for being named Bib Kowies Teacher of the Year for 2024. Commending Peacom Georgia and Peacom South Georgia. Majority Hall for being named of Monroe County's Teacher of the Year for 2024. Recognizing and commending Franklin Bailey. Commending Adrian Gates in recognizing March 20, 2025 is trailblazing women in Georgia day. Commending Coco Brown. Congratulations, the Fanon County ladies are a rebel basketball team for winning the 2025 G.S.A. Class A. 2001 State Basketball Championship. Commending Janice Colbert in recognizing March 20, 2025 is trailblazing women in Georgia day. Commending Sabrina Walters in recognizing March 2025 is trailblazing women J. Recognizing commending Carol Renee Jones. Recognizing commending. Mr. Daniel Kiptoe-Bargoria on his outstanding public service. Recognizing commending Mr. Hammond Abduh Wahaw on his outstanding public service. Commending Rebecca Gordon. Commending Me Asia Simone. Commending Shera Durand. Recognizing commending DJ on the occasion of District 58 day. Commending Amy Luciani. Commending Minesha Clark. Commending Dora D. Whitley. Commending Jamil E. McKenzie. Commending Georgia Community Service Board in recognizing February 16, 2025 is community service board stay at the state capital. Commending Latoya Shamba. Recognizing commending the Sue Schoelser workers association of Georgia for its expertise in commending Tandy Mackay. Recognizing Tiff Nicole. And recognizing commending Lola Al-Loco-Yu. And for other purposes I complete the reading with privilege resolutions. I'm going to read the book. Is there any objection to adopting the privileged resolutions? Hearing none the resolutions are adopted. Members before everyone gets out of here because we have some announcements. I know you all have some other business attend to you but tomorrow on March to 19th we have two members to have birthdays. And for the community byola Davis and Rift and Dory Carter. This year's I miss here's Rift and Davis on my right. Rift and Cardinal Liv. Happy birthday ladies. Early birthday tomorrow. All right we have some announcements. Rift and Park Cannon. Rift and Cannon is recognized for announcement. Thank you Mr. Speaker, Georgia House Democratic Caucus members. We are taking our annual caucus photo upon adjournment on the South Wing stairs. So in just a few minutes please come to the South Wing stairs for our annual caucus photo. Thank you Mr. Speaker. Chairman Parsons. Recognize for announcement. Thank you Speaker. Energy utilities and telecommunications will meet three o'clock upon adjournment. So here in a few minutes. Thank you. Room 403 of the Capitol. Chairman Corbett. Recognize for announcement. Thank you Mr. Speaker. Tomorrow at 12 o'clock the rule caucus will meet in the Ag Building. Lunch will be served. Thank you. Chairman Williams no Williams recognized for announcement. Thank you Mr. Speaker. Tomorrow we have a Bank's in banking meeting at 10 a.m. and 506 C.L.O.B. We have one bill that we need to pass out but tomorrow morning at 10 a.m. 506 and C.L.O.B. Bank's in banking. Thank you. Tomorrow is a work day right? Absolutely we will get paid so let's get some work done. Chairman Hagen recognized for chair Lady Hagen recognized for announcement. Thank you Mr. Speaker. Members you should have in your house email accounts a survey from NCSL. They have asked me to remind you to please fill that out if you can. It surely take you a few minutes and it will help them customize their programming so they can better service. Thank you. Chairman Parish. Let's see where the rules chairman's got up. Y'all best give the rules chairman your attention. Thank you Mr. Speaker. Ladies and gentlemen remind you the rules committee will meet at 430 or upon a adjournment of the leverage subcommittee in room 341. Thank you. Chair Lady Cooper recognized for announcement. Thank you Mr. Speaker. With members of the public health committee as soon as we adjourn go to 606 we have a very important committee meeting this afternoon and I need you to be there and to have a forum so we can get started. Thank you very much. 606 as soon as we adjourn. Thank you Mr. Speaker. Mr. Speaker. Mr. Speaker. Mr. Speaker. Chairman Gunther is recognized for announcement. Thank you Mr. Speaker. Judiciary will meet in 132 upon a adjournment today and then tomorrow morning we meet at 2 o'clock again in 132. Thank you. Chairman Irwin recognized for announcement. Thank you Mr. Speaker. House Education Committee for Committee will meet at 3 o'clock in room 506 today. 3 o'clock 506. Thank you. Chair Lady Belinger recognized for announcement. Thank you Mr. Speaker. Your judiciary juvenile committee will meet tomorrow at 11 o'clock in room 406 in the CLOB. Thank you. Chairman Dickie recognized for announcement. Thank you Mr. Speaker. I can call to a consumer affairs committee will meet in the morning. CLAB 8 o'clock in the morning we got five bills we need to look at so you can be there. Thank you. Chair Lady Lynn Smith recognized for announcement. Thank you Mr. Speaker. Good afternoon everyone. I've had several questions from you about the George outdoor stewardship act and what it can do, how it applies, what changes are going on. So we're having at 8 o'clock 30 morning in room 606 CLOB we're going to have an interactive meeting. So any members welcome to come and we'll see if we can answer your questions. Thank you. Chairman Brad Thomas recognized for announcement. Thank you Mr. Speaker. The governmental affairs state and local government subcommittee will be meeting upon a German in the CLOB room 415. Immediately thereafter the elections subcommittee will meet. Thank you. Lots of meetings tomorrow. Hope everyone got their instructions. That completes our announcements. Members if you have a page. Many of you have already down here but if you have a page be sure to join us down front for page photos. Majority leaders recognize for a motion. Thank you Mr. Speaker. I move this house standing recess until 5 o'clock PM then stand adjourned until 10 a.m. on Thursday March 20th 2025. On the motion of the majority leader that this house stands in recess until 5 p.m. today and which time we will adjourn until Thursday March to 20th 2025 at 10 a.m. All those in favor of the majority leaders motion will say aye. All those opposed will say no. The nose having no eyes have it. The eyes have it this house will stand in recess until 5 p.m. and then be adjourned.",
  "updated_at": "2026-02-13T14:35:49.216606+00:00"
}