{
  "video_id": "p6QOp_RuPXo",
  "url": "https://youtu.be/p6QOp_RuPXo",
  "title": "Georgia House - Day 14 (2026-02-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 14,
  "video_date": "2026-02-10",
  "duration_minutes": 80,
  "summary": "Here is a summary of the Georgia House session transcript from 2026-02-10:\n\n**Overview**: This session focused on the introduction of several new bills, covering a range of topics from government operations to education and insurance. There were no recorded votes, but the session featured a prayer by a guest chaplain and routine procedural matters.\n\n**Key Actions**:\n- **HB 1244**: Bill to amend the fish code of Georgia relating to state employees' insurance\n\n**Bills Introduced (First Reading)**:\n- HB 1288: Bill to amend the fish code of Georgia relating to state employees' insurance\n- HB 1289: Bill to amend the code relating to surface mining\n- HB 1290: Bill to amend code section related to sales tax exemptions  \n- HB 1291: Bill to amend code section related to sales tax exemptions\n- HB 1292: Bill to amend title 20 relating to education\n- HB 1293: Bill to amend title 50 relating to state government\n- HB 1294: Bill to amend code section relating to abandoned mobile homes\n- HB 1295: Bill to amend the Quality Basic Education Act\n- HB 1296: Bill to amend provisions for wills and trust administration\n- HB 1297: Bill to amend chapter 32 of title 33 relating to property insurance\n- HB 1298: Bill to amend provisions related to real estate transactions\n\n**Notable Moments**:\n- The session opened with a prayer by guest chaplain Reverend Dr. Joseph Evans, who spoke about defending democracy and the rights of Georgia citizens.\n- The House recognized Representative Manor and expressed support for her.\n\n**Votes**: No recorded votes.\n\n**Attendance**: Quorum present, no notes on attendance issues.\n\n**Adjournment**: The session adjourned without a specified date for the next meeting.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou live and to be able to smile, to be able to say, hallelujah, amen.\nMy pastor is Reverend Dr. Joseph Evans at Friendship Baptist Church.\nI'm going to give you a brief history of him.\nHe's the Dean of Morehouse School of Religion.\nan associate professor at their interdenominational\nTheological Center also in the AUC Center.\nHe's formerly the Mount Carmel Baptist Church pastor\nin Washington, D.C.\nHe was a four sport letterman in high school.\nHe played football at West Virginia Tech.\nHe's also a Kappa Alpha Sai.\nHe's an Army officer.\nHe jumped for the Army.\nHe has a master of divinity and systemic theology\nat Ph.D. in preaching.\nHe's done several publications.\nHis last one is the polished king,\nliving words of Martin Luther King.\nHe also has the honor of being the Morehouse College,\nMartin Luther King, Jr., College of Preachers.\nHis wife is Miss lovely Patricia Lewis Evans.\nHe has two children, Gabriel, who is in New Orleans\nand his son Matthew works for the New York Knicks\nand he has three grandchildren.\nIt was important for me to bring my pastor up here.\nAs we all know that this is a difficult place to be in\nand if you have a pastor that can pray with you\nat my church, the pastors are very personable.\nSo I call my pastors nearly every day\ncan say can you please pray with me and so without further ado, I'd like to introduce\nMr. Reverend Dr. Pastor Evans.\nThank you so much.\nMr. Speaker, Majority and Minority Leaders to the members of this esteem and the Gus\nbody. It's a privilege responsibility to share common prayer with you today. My\nprayer, how prayer, is for the welfare of the citizens of Georgia. Now I define\nwelfare as our defense of democracy and its obligations and rights. In short\nhand if our laws don't fit the welfare of my mama, it may need reform. And I want to thank you so\nvery much. Misha, Mena, let this house know that I support you and I want y'all to treat her right.\nI have evidence that you need improvement.\nThe only thing worse than a Baptist lawyer is a Baptist preacher who has you in his sights.\nMake certain that you do not mistreat.\nRepresentative Manor, I support and love her.\nNow with that, let us go to God in prayer of all who stand. Thank you.\nOh God,\nwe ask now that your presence\nbe felt and known\nin this place\nand we pray\nthat your spirit fill this\nchamber and transform it into a sanctuary. The sanctuary where truth will be\ndefended with civility and sophistication and with passion. We brave\nreach member here that represents the great state of Georgia which is the\ndemocratic space or place in the universe. The whole world is watching Georgia.\nI have faith and confidence in the people of this chamber to do that which I have described\nas defending democracy. Our rights and privileges as citizens include our voting, our ability to go\nto the poles without any hindrance, regardless of party, that is minuscule, it does not matter.\nWhat matters is we have the rights to do, to vote as our conscience permits us, leads us.\nNow we ask these things to keep us for the majority of this day.\nDo not let my words fall on deaf ears as I take my seat, but let them probe our hearts\nas we make decisions for the citizens of the state of Georgia.\nNow with these words, we ask it in God's name and for His sake, amen.\nThank you, Mr. Speaker.\nYou may do the pledge of the United States of America and to the Republic for which it stands.\nOne nation under God, indivisible, with liberty and justice for all.\nThank you, sir. Thank you very, very much.\nDoorkeepers will unlock the doors.\nmembers may greet the chaplain in the south any room. Chair recognizes Chairman Hogan\nthe chair of the committee on information and audits.\nThank you, Mr. Speaker. Your committee on information and\naudits has read the journal of the previous legislative day and\nfound it to be correct. And furthermore, Mr. Speaker,\nit's not whether you get knocked down is whether you get up\nVince Lombardi.\nHe didn't like seeing that other team get up either.\nChairman Hogan, the chair of the committee on information and knowledge reports that the journal the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nChair, here's none, and the journal is confirmed. The clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, on the 59th Ms. Holling, we establishes the order of business\nduring the first part of the period unanimous good-sense introduction\nbills and resolutions first reading and reference of House bills and\nresolutions second reading of bills and resolutions reports of standing\ncommittees third reading and passage of uncontested local bills and\nresolutions first reading and reference of Senate bills and resolutions\nmorning orders. Is there any objection to the adoption of the resolution\nestablishing the order of business for the day. The chair here's none in the\nresolution is adopted. First reading of bills and resolutions, a clerk will\nread. House Bill 1288 by resident Taylor, the hundred and 73rd Williams, the\nhundred and 45th Bentley, the hundred and 39th. Episodial 13th Collins, the\n68th and others. Bill B. Todd, on active men chapter 19 and title 47th, fish\ncode of Georgia, Antietta, relaying state employees, insurance insurance. House\nBill 1289 by resident Taylor, the hundred and 73rd. Stephen's the hundred and\n64th, P-3 of the 166.\nHogan to the 179th buttoner and 137th and others.\nBill being titled an act to amend part three of Article II,\nchapter four, title 12,\nthe official go to Georgia annotated,\nrelating to surface mining.\nNatural resources and environment.\nHospital 1290 by Russell Corbett of the 174th.\nLehood of the 175th per cheddar,\nthe 176 Watson learned to 72nd.\nRoads of the 120th,\nBill be titled an act to amend Code Section 4883.\nThe official go to Georgia annotated,\nrelating exemptions from state, sales and use taxes.\nWays and means.\nHospital 1291 by Rosam Smith, 133rd Williams on 48th,\nwheat hour, 119th Williams in the 115th,\nfire the 118th and others.\nBill B. Todd, an act of men code section 4883.\nThe fish go to Georgia,\nannotated relating exemptions from sales and use taxes.\nWays and means.\nHospital 1292 by Rosam Jaspers,\nthe 11th Mathis of the 144th,\nIrwin of the 28th England of the 160th,\nBerkel with 155th, Bill B. Toddl and Acto Menn,\ntitle 20 of the fiscal to Georgia annotator,\nrelating to education.\nEducation.\n1293, Vibration of Limb of the 99th,\none of the 89th, Bird of the 20th,\nPark of the 101st, Bill B. Toddl and Acto Menn,\nchapter one in title 50,\nthe fiscal to Georgia annotator,\nrelating to general provisions of state government.\nGovernmental affairs.\nHouse Bill 1294, Vibration of Corp.\nto the 144th, Rose of the 120th,\nLuricae, 169th, La Hood of the 175th, Ridley of the 6th.\nBill B. Todd, an act to amend Code Section 44-7.\n113 in the fish code of Georgia annotated, relating to government\nagent to assess abandoned mobile homes.\nJudiciary House Bill 1295, I wrote some corbord of the 174th\nor one of the 28th, weighted the 9th,\nDubneck of the 29th.\nBill B. Todd, an act to amend Part 6R at the 6th, Chapter 2,\nentitled 20, the fish code of Georgia annotated, relating\nemployment under the Quality Basic Education Act.\nEducation House Bill 1296 by Rose of Canada to the 102nd,\nBill B. Todd, an act to amend Article 1 of Chapter 1 of Title 53,\nthe Fiscal Code of Georgia and Tate are relating in general to general provisions\nfor Will's trusted administration of the State House Bill 1297 by Representative\nGamble, the 15th fry, the 118th wheat hour, the 119th,\nWashburn, the 111st bar, the 103rd and others,\nBill B. Todd and Act to amend Chapter 32 of Title 33, the Fiscal Code of\nGeorgia and Tate are relating to property insurance.\nInsurance Hospital 1298 by Res of Gamble the 15th May the act the 73rd green in the 151st Williams\n145th C-Ball the 34th will be titled an act to amend part eight of article eight chapter four\nwith title 44 that fish go to Georgia annotated ruling the leans of hospice\nJudiciary Hospital 1299 by Reps. Lever to the 33rd\nwill be titled an act to provide for the judge the probate court of Albert County\nEntregovable in the coordination House of Resolution 756, by representatives, representatives\nof the level of the 33rd, Stevens the 164th, Bentley the 139th, Fry the 118th, Blackburn\nand the 146th and others of resolution proposing an amendment to the Constitution.\nWhy is it named Senate Bill 370 by Senator Couser to the 46th, Hofstettler to the 52nd\npaying to the 54th, Jones the 22nd, parent of the 42nd and others will be\ntied to an act to amend chapter 7 and title 48 of the physical to Georgia\nannotated relating income taxes.\nWays and means Senate Bill 406 by Senator Hickman the 4th will be\ntied to an act to amend and act reconstituting a board of education\nof Effingham County.\nIntric governmental coordination Senate Bill 407 by Senator Hickman of the 4th\nwill be tied to amend and act creating a board of commissioners of Effingham County.\nIntergovernmental Coordination Senate Bill 409 by Senator Payne 54th and Bill B. Todd and\nActing Menon actor Revising Restate the Law relating to the Whitfield County Board of\nIt. Intergovernmental Coordination Senate Bill 410 by Senator Payne 54th and\nOff-Statler 52nd Bill B. Todd and Acting Menon act to create a new Board of Education\nfor Gordon County. Intergovernmental Coordination Senate Bill 411 by Senator Anitavarte\n31st Bill B. Todd and Acting Menon act to provide for the election of members of the Board\nof Education to Harrelson County.\nThe Intergovernmental Accordination Senate Bill 412 by Senator Andrew Varte of the 31st\nBill B. Todd O'Neill, an act to amend and act to amend and act to re-create and establish\nthe Board of Commissioners of Long County.\nAncord 415 by senator o\ngren some of the 12 nawet\nbrought to the elections\nDistrict column four sixteen\nwe've no\nrecord and triple medallic\n13th\ncountryaining boarding\nSenate Bill 418 by Senator Harper, the 7th of the Bill, be taught in act to amend and act creating the Court of Commissioners and Roads and Revenues of Bairn County.\nThe Intergovernmental Court in Senate Bill 422 by Senator Goodman of the 8th of the Bill, be taught in act to amend and supersede the laws pertaining the governing authority allowance county.\nIntergovernmental Coordination.\nSenate Bill 423 by Senator Goodman of the Eighth Ability Title and Act to amend and act provided for the numbers and members of the Election of Members of the Board of Education Allounds County.\nIntergovernmental Coordination.\nSenate Bill 424 by Senator Goodman of the Eighth Ability Title and Act to amend and act creating the Board of Commissioners of Brooks County.\nURE\nSubtre ironic\nIt should be\nNo\nLord\nIs the\nWill\nDo not\nAnd\nmade\nfavor\nthe\ncouncil\nand\nthe\nsections\nby\nnoodle\nnd\nNo\nI\nmean\nI\nmean\nt\nth\nfor\nthe\nCollect\n.\nThis\nitem\nthe eighth of Bill B. Todd and Act to amend and act creating Board of Commissioners to\nClitch County.\nIntergovernmental coordination.\nBill 429 by Senator Goodman the eighth of Bill B. Todd and Act to amend and act to\nprovide for the reapportionment of the Board of Education of Brooks County.\nIntergovernmental coordination.\nSenate Bill 432 by Senator Burns the 23rd of Bill B. Todd and Act to amend and act for\nthe election creation of Board of Commissioners to scrub and count.\nIntergovernmental coordination.\n433 by senator burns the 23rd of bill be taught on act of men and act providing for the election to members the Board of Education's Scriven County\nEnter governmental coordination before 34 by senator burns the 23rd of bill be taught on act of men and act providing for the Board of Commissioners of Warren County\nIntergovernmental Coordination Senate Bill 436 by Senate of Kennedy 18th look as the 26 Jones the 25th will be taught on act of men and act providing for the restructuring of the city of make it\nIntergovernmental Coordination Senate Bill 437 by Senator Alverson 56 beats the 21st\ncompatriot to 32nd brass and 28th Bill Vittado and active men and act creating board\ncommissioners in Fulton County.\nGovernor Fires Senate Bill 446 by Senator Burns the 23rd Bill Vittado and active men and\nact reconstituting the Board of Education to Warren County.\nIntergovernmental Coordination Senate Bill 447 by Senator Burns the 23rd Bill Vittado\nand active men and act creating board of commissioners to Alaska County.\nIntergovernmental coordination.\nSenate Bill 450 by Senator Strickland,\n17th Anderson, the 43rd,\nBill B. Todd and Acto Men,\nand act to reestablish supported commissioners\nin Newton County.\nIntergovernmental coordination.\nSenate Bill 451 by Senator Strickland,\n17th Anderson, the 43rd,\nBill B. Todd and Acto Men,\nand act to provide it for the Board of Education\nin Newton County.\nIntergovernmental coordination.\nThat completes First Readers.\nSecond reading of Bills and Resolutions,\nthe Clarkville Read.\nHouse Bill 1225 by resident Gillier in the 160 second voting,\nthe 62nd Bruce, the 64th of Bill relating\nthe general provisions relative to law enforcement officers\nand agencies.\nHouse Bill 1226 by resident of work eyes to the 157th\nbill to amend and act creating board of commissioners\nof Evans County.\nHouse Bill 1227 by resident of work eyes to the 157th\nbill to amend and act providing for the composition\nof the board of education for Evans County.\nHouse Bill 1228 by resident of camp\n131st to build to amend and act to creating the Board of Commissioners in Lamar County.\nHouse Bill 1229, my resident of Camp 131st to build to amend and act creating the Board of Commissioners and\nRoads and Revenues for the County of Pike.\nHouse Bill 1230, my reps of Camp 131st to build to amend and act to provide for\nthe election of members in the Lamar County Board of Education.\nHouse Bill 1231, my resident of Camp 131st,\nHagen 156, airheart of the 36th and Mithiac, the 73rd of Bill relating the Barbers and Cowsmetologists.\nHospital 1232 by the rest of the part of the 5th, Ridley the 6th, Prince the 127th, Smith the 133rd and\nCorporate of the 174th of Bill relating the vehicles with false or secret compartments in registration,\nlicensing and motor vehicles.\nHospital 1233 by the rest of the roads, the 120th of the Ricky the 169th.\nCorbett owns 74th, a bill relating to the general provisions, the Department of Natural Resources.\nHouse Bill 1234 by resident of Valendra, the 23rd, Hill of the Third, Lumpson of the 12th,\nGunther of the Eighth, and Cantrell of the 22nd, a bill relating to the right attorney in dependency proceedings.\nHouse Bill 1271 by resident of Perchetta, the 176th, Corbett of the 174th,\nAccordingly, the sixth sense of the 180th and\nscogas of the 14th of Bill relating to property.\nHouse Bill 1272 by residents of Smith, the 18th green,\nand the 151st January, so on 32nd,\nWashburn of the 141st, Hogan of the 179th,\nof Bill relating to solid waste management.\nHouse Bill 1273 by residents of Wilson of the 8th,\n80th, Bill relating to public assistance,\nHouse Bill 1274 by residents of Carson,\nthe 46th, Walensky, the 74th.\nin the 104th, Couch in the 50th, Cooper in the 43rd,\nand others, to build relating the general provisions\nor relevant state government.\nHouse Bill 1275, I represent a rich in the 97th lever\nto the 33rd, all over the 82nd,\nof building relating the municipal courts.\nHouse Bill 1276, by resident of Hawkers in the 27th,\nBen of the 94th, House in the 70th, England in the 11th,\n16th, parish in the 158th, and others,\nof building relating the department of community health.\nHouse Bill 1277, I represent Saints of the 180th,\nPitch and son of 61st, P3, the 166th,\nper tread on 176th,\nlumps into the 12th and others,\na bill relating the county special purpose,\nlocal option sales tax,\nNW 1278, so Bentley the 138th, 139th,\nStevens 1164, Spyler 135th,\nbill relating the exemptions for sales and use tax.\nNW 1279, by resident of Gamble of 15,\nScott goes to the 14th,\ngo to the 19th, Kelly of the 16th and Stevens,\n164th Bill, relating the dangerous drugs,\nHouse Bill 1280 by reps on the limit of the 99th,\nF-104th and Jones the 25th,\nBill relating the municipal taxation.\nHouse Bill 1280, one by reps of buckner, 137th,\nall over the 82nd row of show of the 48th,\nwelcome to the 81st,\nbribe the 118th and others,\nBill relating the disclosure of dissemination\nof criminal records to private persons and businesses.\nHouse Bill 1280, two by reps on the billiard\nand the 160 second,\nBruce the 61st prints the 127th and else the 125th of bill relating to educational programs and elementary and secondary education.\nHouse Bill 1283 by resident, Doug was 78th, fire the 118th, Williams the 148th, Hogan the 179th, Evans the 57th and others of bill relating to miscellaneous provisions on the quality basic education that House Bill 1284 by resident Jackson the 128th of bill to amend and act creating the board of commissioners of Washington County.\nHouseful 1285 by resident Smiley 135 Smith and 134th, who believe the 136 Buckner 137 Smith\nand 133rd, a bill to amend and act creating the Skogi County School District Houseful 1286\nby resident of Jackson 128th, a bill to amend and act to reconstitute the Washington County\nBoard of Education Houseful 1287 by resident of Camp 131st, a bill to amend and act creating\nthe board of commissioners or roads and revenues of Upson County and Senate bill 257 by\nSenator Anderson the 43rd parent of the 42nd challenge the 22nd Butler the 55th\nof Jackson the 41st bill relating the Georgia crime information center Senate bill 326 by\nsenators and an of RTA the 31st Watson for a strickland 17 to 30th hatched in the 50th\nand others, Bill relating the state flag,\nsee them and others, Senna Bill,\n338 by Senator Berkley-Levelth of Stetler,\nthe 52nd Watson and 1st,\nCropatric of 32nd,\nTillery, the 19th and others,\nBill relating the medical assistance generally.\nSenna Bill, 342 by Senator Cropatric of 32nd,\nWatson, the 1st, of Stetler,\nthe 52nd, Berkley, 11th Jackson,\nthe 41st and others,\nBill relating the insurance,\nSenate Bill 363 by Senator Tillery, the 19th,\nbrass the 28th, most of the 53rd,\nhatchet of the 50th,\ncouncil of the 46th and others of bill relating\nthe Fair Business Practices Act of 1975.\nThat completes second readers.\nReport, so standing committees, the clerk will read.\nRepresentative Terry, 116, District Chairman of the Committee on Appropriations submitted\nthe following report.\nAnd to speak to your committee on appropriations, this had under consideration the following\nbills of the House instruct to meet the report, same back to the House, the following\nrecommendation, House Bill 910, do pass by committee substitute, respectfully submitted\nRepresentative Terry England, 116 District Chairman.\nRepresentative Hawkins, the 27th District Chairman of Committee on Budget and Fiscal Affairs\nOversight submitted the following report.\nWe speak your Committee on Budget and Fiscal Affairs Oversight as had on consideration\nthe following bill of the House, and instruct me to report the same back to the House,\nthe following recommendation, the House bill, 2008 to pass by substitute, respectfully\nsubmitted, Representative Hawkins, the 27th District Chairman.\nRepresentative Darlene Taylor, 173rd District Chairman of the Committee on Government and Affairs submitted the following report.\nTo speak, your Committee on Government and Affairs is on the consideration following bills and resolutions to the House and Senate.\nThis instructing me to report the same back to the House and the following recommendations.\nHouse Bill 1028, Dupasse, House Bill 1154, Dupasse, House Bill 1182, Dupasse, House of Resolution 630, Dupasse by Committee Substitute, the Senate Bill 369, Dupasse.\npass, respectfully submitted.\nRepresentative Darlene Taylor, 173rd District Chairman.\nRepresentative Sharon Cooper, the 43rd District Chairman of the Committee on Health, Health\nHealth and Human Services submitted the following report.\nWe'll speak to your committee on Health and Human Services as head of consideration to\nfollowing bills and resolutions in the House.\nWe'll instruct a meeting report the same back to the House of the following recommendations.\nHouse Bill 918, do pass by substitute.\nHouse Bill 1192, do pass by substitute, House Bill 1086, do pass, House Resolution 629, do pass, House Bill 963, do pass, House Bill 1092, do pass, respectfully submitted, Representative Sharon Cooper, the 43rd District Chairman, Representative Martin of the 49th District Chairman of the Committee on Higher Education, submitted the following report.\nto speak your committee on higher education,\ndone on consideration, following bill to the House.\nDistraught committee reports,\nsame back to the House, following recommendations.\nHouse bill one, do pass by committee substitute,\nrespectfully submitted,\nrepresented, Mark, with 49th district chairman.\nRepresentative Eddie Lumpson,\nthe 12th district chairman of the committee\nand House Insurance, submitted the following report\nto speak your committee on insurance.\nHas done on consideration the following bills\nof the House and Senate.\nThis is Dr. Meadey report,\nthe same back to the House,\nit's following recommendation.\nHouse Bill 969, do pass, House Bill 1021, do pass,\nHouse Bill 1059, do pass, House Bill 101195,\ndo pass, House Bill 1222, do pass,\nSenate Bill 330, do pass, respectfully submitted,\nRepresentative Eddie Lomston, the 12th District,\nChairman.\nWe're set up, Jan Takersley, the 160th District Chairman\nof the Committee on Intergovernal and Coordination Local,\nsubmitted the following report.\nMr. Speaker, committee on Intergovernmental\nCoordination Local, has set up a consideration\nthe following bills of the House\nand its Carla meeting report the same back\nto the House and the following recommendations,\nHospital 1201, new pass,\nHospital 1202,\ndu pass,\nhospital 1203,\ndu pass,\nhospital 1204,\nDu pass,\na hospital 1205,\nDu pass,\nhospital 1206,\nDu pass,\na hospital 1207,\nDu pass,\na hospital 1208,\nDu pass,\na lossable 1209,\nDu pass,\na hospital 12010,\nDu pass,\nhospital 1201,\nDu pass,\n12-13 new pass, hospital 12-14 new pass,\nhospital 12-36 new pass, hospital 12-37 new pass,\nhospital 12-38 new pass, hospital 12-39 new pass,\nhospital 12-40, new pass, hospital 12-41 new pass,\nhospital 12-42 new pass, hospital 12-43,\nnew pass, hospital 12-46, new pass,\nhospital 12-47 new pass, medical 12-49 new pass,\nhospital 12-51 new pass, hospital 12-52 new pass,\nwhich is rightfully submitted.\nRepresentative Jan Taker,\nso he's 160th district chairman.\nRepresentative James Perchad,\n176th district chairman of committee\non judiciary non-civil submitted the following report.\nTo speak to your committee on judiciary non-civil,\nis that in the consideration the following bills\nin the House and the Senate\nhas instructed me to report the same back in the House\nto the following recommendations.\nHouse will 1134 do pass,\nSenate bill 226 do pass by committee substitute\nrespectfully submitted, James Pritchett of the 176th District Chairman.\nPerhaps an advance Smith of the 133rd District Chairman of the Committee on Natural Resources and\nEnvironment submitted the following report, to speak to your Committee on Natural Resources and\nEnvironment and the consideration of the following bills in the House and\ninstruct committee reports saying back to the House, following recommendations.\nHouse Bill 893, do pass by committee substitute, respectfully submitted.\nRepresentative Van Smith, the 133rd District Chairman.\nRepresentative Matthews, the 73rd District Chairman\nof the Committee on State Planning and Community Affairs\nsubmitted the following report.\nMr. Speaker, committee on State Planning and Community Affairs\nis in a consideration of the following bills of the House\nand instruct the meeting of reports\nsaying back to the House of the following recommendation.\nHouse Bill 725, Duke Pass, House Bill 1131, Duke Pass,\nwhich is respectfully submitted,\nRepresentative Matthew Hack and 73rd District Chairman.\nRepresentative Gerald Green, 150 first district chairman\nof Committee on State Properties submitted\nto following report and a speaker committee\non state properties, extenent consideration\nof following bills and resolutions of the House,\ninstructor meeting report, same back the House\nto following recommendations.\nHouse for Resolution 595, do pass by committee substitute.\nHouse for Resolution 664, do pass by committee substitute.\nHouse of Resolution 163, Duke Pass, House of the 1010,\nDuke Pass, respectfully submitted and represented\nGerald Green, the 151st District Chair.\nThat completes the reading of the Report to Standing Committees.\nYou\nYou\nYou\nYou\nYou\nYou\nAll right, we're going on now to the local calendar, going on to the local calendar, third\nreading and passage of uncontested local bills, House will come to order.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded\nvote.\nHearing none, it is so ordered.\nThe clerk will read the local calendar.\nHouse Bill 1201, members of Duke's 154th Baker County, House Bill 1202, members of Duke's\n154th Baker County, House Bill 1203, members of Perkle 155th, Tiff County, House Bill\n1204 by riffs and dukes of the 154th Dardy County.\nHospital 1205 by riffs and a saints of the 180th Camden County.\nHospital 1206 by riffs and a Benton in the 31st city of Jefferson.\nHospital 1207 by riffs and a percol 1505th Tiff County.\nHospital 1208 by riffs and a Roads and 120th Green County.\nHospital 1209 by riffs and a Roads and 120th Green County.\nHospital 12010 by riffs and a bottom of the 72nd Fayette County.\nHospital of 1211 by ribs and a Frazier to 126 Burke County.\nHospital 1212 by ribs and a Frazier to 126 Burke County.\nHospital 1213 by ribs and a Chocus of 138th Marion County.\nHospital 1214 by ribs and a Scott of the 76 Clayton County.\nHospital 1236 by ribs and a Perkyl 155th Irwin County.\nHospital 1237 by ribs and a Perkyl 155th coffee county.\nHospital 1238 by ribs and a Williams, 148th Wilcox County.\nhospital 1239 by Robson Williams, 145th Baldwin County,\nhospital 1240 by Robson, Meeks 1178th Appling County,\nhospital 1241 by Robson, Meeks 1178th Wayne County,\nhospital 1242 by Robson, Robson 120th Putnam County,\nhospital 1243 by Robson, Jones the 25th for Scythe County,\nhospital 1246 by Robson, Jones the 25th for Scythe County,\nhospital 1247 by Robson, Saints the 180th Camden County,\nHouse will 1249 by reps of green and 151st Quitman County.\nHouse will 1251 by reps of parish and 158th of manual county.\nHouse will 1252 by reps of loveston of the 12th Chitugu County.\nHouse will 1254 by reps of chokus and 138th Marion County.\nHouse will 1255 by reps of chokus and the 138th Shly County.\nHouse will 1257 by reps of chokus and 138th Shly County.\nHospital, 1258 by Representative Taylor,\n173d Grady County.\nHospital, 1259 minutes sends forelson,\nbyoupragentle 176weille county.\nHospital, 1260 by reps of Duke's and 154thlırdity county.\nHospital, 1261 by reps of green and 150 forrest terrible county.\nHospital, 1262 by reps of Duke's and 154th Miller county.\nHouse, 1263 by reps of Duke's and 155 allegar.\nHospital, 1265 by reps of Bernard,\n177 Clayton County, hospital 1266 by ribs of green and 150 first, Randolph County,\nhospital 1267 by Representative Green and the 150 first, Randolph County,\nhospital 1268 by ribs of green and 150 first, Terrell County, hospital 1269 by ribs of\nMeeks, the 178th Appling County, hospital 1270 by Representative Birchett of the 176\nThe Chair here is none, the report of the committee is agreed to shall these bills now pass all those in favor of the past.\nIs there any objection to the previous question being ordered on the local calendar?\nChair here is none, the previous question is ordered, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills?\nthe report of the committee is agreed to.\nShall these bills now pass all those in favor of the passage\nof the bills on the local calendar?\nWill vote aye?\nThose opposed will vote no, and the clerk will unlock\nthe machines.\nWhat purpose does representative Mary Francis Williams rise?\nThank you, Mr. Speaker, parliamentary inquiry.\nChair, inquiry.\nIs it not true that I wish as a member of the Cobb delegation\nthat our delegation had the same option\nto have our bills introduced as local bills\ninstead of going through the general bill process.\nIf the lady so states.\nThank you, Mr. Speaker.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of the bills on the local calendar.\nThe eyes are 147.\nThe nays are 10.\nThese bills having received the requisite constitutional majority are therefore passed.\nWhat purpose does Chairman Tancersley rise?\nMr. Speaker, I rise to make a motion.\nState your motion.\nmove, we immediately transmit the local calendar to the Senate.\nChairman Tankersley has moved that the bills that we just passed on the local calendar\nbe immediately transmitted to the other chamber of this general assembly.\nIs there any objection?\nIs there any objection that's here, here's none, and it is so ordered.\nOkay, we're going on now to morning\norders.\nThe chair is going to ask that members\nof the House please take your seats\nand be respectful to the members\nin the well.\nWe're going to, let's say one minute\neach for the morning orders today.\nChair recognizes for a morning order\nrepresentatives Roba Show representative\nMcClarin, Speaker-proteem Jones, and Chairman Martin for a morning order.\nThere, see who she is.\nI'm sorry everyone the city of Roswell lost one of their own on February 3rd Lieutenant\nJoe Ruff of the Roswell Police Department was a dedicated husband, father, son, brother,\nand friend to many, and he would be surely missed.\nJoe was survived by his wife, Jennifer, his four children, Alexis, Ariana, Landon, and\nLiam, and two grandchildren.\nJoe was a graduate of Roswell High School\nand decided from an early age\nthat he wanted to follow in his grandfather\nand his great-grandfather's shoes in law enforcement.\nHe began his law enforcement career\nat the tender age of 17,\nbeing part of the Roswell Police Explorers Youth Program.\nAnd then at the age of 21,\nhe was sworn in as a police officer for Roswell.\nHe served first as a detention officer,\nthen he was a street patrol officer.\nHe next became a detective in our criminal investigation unit.\nAnd then he assisted in multiple cases across the state\nand also in cases with the FBI and the DEA.\nHe was most recently promoted to the status of Lieutenant.\nAs you can see, Joe knew in his heart\nthat service to our Roswell community was his calling.\nHe was the definition of a servant leader in our community.\nHe gave his all to our community,\nbut was also known for his easy smile,\nhis infectious laugh,\nand his love of the legendary rock band Pink Floyd,\nwhich was played at his services yesterday.\nLieutenant Ruff now watches over his family\nand the entire city of Roswell from above\nand we are better for it.\nPlease join us in a moment of silence\nto honor Lieutenant Ruff.\nThank you, Mr. Speaker.\nChair recognizes Representative Hagen\nfor a morning order.\nThank you, Mr. Speaker.\nIt is an honor\nand a privilege to serve here.\nAnd I know you all feel exactly the same way.\nBut we also do sacrifice things back home when we're here.\nAnd like birthdays, a family member.\nSo today is my son Henry's 18th birthday.\nAnd it's the only birthday I've ever missed.\nHope there'll be a few more in the coming years.\nBut I just wanted to wish him a happy birthday.\nHe's a wonderful young man.\nWe love him so much.\nI was so proud of him.\nHe just made Eagle Scout a couple of weeks ago.\nSo I feel like his future is bright.\nHe better be registered to vote right now.\nThat's where he should be.\nBut thank you for just, let me get up and wish my son Henry\na happy eight to birthday today.\nThank you Mr. Speaker, today I rise for a black history moment.\nMiss Amanda Dixon was a biracial socialite in Georgia who became known as one of the\nwealthiest African American women of the 19th century.\nShe was born in Sparta, Georgia, Hancock County.\nAt her father's death in 1885, Amanda Dixon inherited his estate.\nHer quite relatives chalised the wheel, but Amanda ultimately won a successful ruling\nin the case.\nHer estate included 17,000 acres of land in Hancock and Washington counties in Georgia.\nAmanda died on June 11th, 1893.\nThank you, Ms. Speaker, I yield the will.\nChair recognizes Chairman Cooper for a morning order.\nSorry, Mr. Speaker.\nLadies and gentlemen of the House,\ntoday is recognized by the governor,\nis Georgia dental hygienist day.\nAnd the proclamation, it's our appreciation\nfor what they do for us and the citizens of our state.\nAnd you notice you've got a nice gift from them\non your desk, dental hygiene is so extremely important.\nOne example, and you never think about it,\nif pregnant women would gargle\nwith a non-alcoholic mouthwash twice a day,\nthere is evidence to show that it is one of the things\nthat helps premature deliveries.\nSo dental hygiene is so important,\nand our dental hygienists do so much for our state,\nand not only working in dental offices,\nbut doing a great deal of pro bono work\nwith our most needy citizens, especially our children.\nSo if you see a dental hygienist out today,\nanywhere in the halls, please tell them, thank you.\nThank you, Mr. Speaker.\nChair recognizes Chairman Jasper's for a morning order.\nThank you, Mr. Speaker.\nFirst, just about thank those of y'all who went and met with your 4-8 years yesterday.\nThere are 500 of them here at the depot.\nSecondly, it's a month.\nWe've got to get your paperwork in, your letters of non-opposition or whatever it is called\nand the fancy word, to get your road naming done.\nWe only have five of them right now.\nAnd I know a number of y'all have asked me about it.\nThis is the road map to getting it done.\nPlease drop by my desk.\nEvery day in our office is fabulous\nabout helping you do that, getting the letters,\ngetting everything done, your notification.\nBut we've got to have it to be able to move it.\nSo we need it done by March the 9th,\nbecause time is moving just about a month from now.\nThank you, Mr. Speaker.\nChair recognizes representative Nelson\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI bring you a moment in black history today.\nThe Lucy Crappelaine in Museum is the only African-American\nmuseum in the central Savannah River area.\nThe small house museum was the former home of Miss Lucy\ncraft lady who founded the first school for black boys and girls in Augusta, Georgia.\nMs. Laney dedicated her life to provide educational opportunities for black youth in the Augusta\narea.\nShe was the founder of the Haines Norman Industrial Institute, which was located on the\npresent site of the Lucicie Laney Comprehensive High School, the Haines Normal Industrial\nInstitute.\nShe started the first kindergarten for black children in Augusta and founded the Lamar School\nof nursing for black women. The lucid-laden high school, Laney Walker Boulevard, and the\nLaney Walker Museum have all been named in Ms. Laney's honor, and I am a graduate of\nthe lucid-laden high school. Thank you and I yield the wealth.\nChair recognizes representative Weigh-Dower for a morning order.\nThank you, Mr. Speaker.\nColleys today is Casa Day at the Capitol.\nyear over 2,700 costs carrying compassion volunteers, advocated for 10,000 children in\nour state's legal custody, providing each child with an impartial advocacy that nurtured\nhope, sought solutions, and protected their best interests.\nCasa volunteers play a critical role in ensuring children who experience abuse and ornical\nact have opportunities to reach their full potential with the support of permanent connections\nto family.\nWe recognize Casa volunteers for giving their time, commend Georgia Casa, and local\ncosts organizations for maximizing resources and support\nthrough increased community involvement and awareness,\nlocal and state advocacy efforts,\nand more coordinated, compassionate response\nto child victims and families and crisis.\nToday we welcome a small group of costs of advocates\nto the Capitol who come to shed some light\non the critical issues facing children and foster care.\nI hope if you see them around,\nyou get a chance to visit with them,\nand certainly thank them for their service\nto George's most vulnerable children.\nThank you, Mr. Speaker.\nWe yield the well.\nChair recognizes Chairman Carpenter\nand Representative Cantrell for a morning order.\nAll right, folks, thank you, Mr. Speaker.\nToday is new American celebration day at the Capitol.\nIt's the ninth annual celebration\nwhere folks downstairs will be getting\ntheir citizenship today.\nIt's a great day for these folks\nas they pursue the American dream\nand add a lot of value to our communities.\nI come from a district that has 23 different nationalities\nin it and I can tell you from firsthand experience\nwhat value they bring to our community.\nThank you, Speaker, and I yield the well.\nChair recognizes representative Scofield\nfor a morning order.\nWait a second.\nRepresentative Sclaughill.\nShe's going to wait.\nAll right, we're going on now to the rules calendar.\nGoing on to the rules calendar, if you have a bill on the rules calendar, be prepared\nto present it.\nWe'll go read the caption to House Bill 1049.\nHouse Bill 1049, one representable hood of the 175th\nand others to be totalled and act to amend\nchapter 27 at the final 43, the fish go to Georgia\nand Tate, relating nursing home administrators,\nso as to revise the composition of state board\nof nursing home administrators.\nThis bill that we serve the committee on\nhealth and human services that committee recommends\nthat this bill do pass.\nChair recognizes Chairman LaHood to present the bill.\nThank you, Mr. Speaker and members of the House.\nHouse Bill 1049 adds two members to the State Board of Long-Term Care Facility Administrators.\nExpanding the board's membership will take the total number from 9 to 11 board members.\nWhat this does is pretty simple, it just allows the governor to appoint members that will\nbroaden the representation of long-term care providers to cover all sizes and geographic\nlocations.\nI would appreciate your favourable consideration, and Mr. Speaker, if there are no questions\nI will yield the will.\nYou have questions if you care to yield.\nI will take one question.\nrecognize as representative Bentley to your left for a question.\nThank you, Mr. Speaker. There's a gentleman you. Yes. Is it not true that what I'm\nabout to say is I see you. Is it not true that what I'm about to say is not a\nquestion but more so a comment just for awareness purposes. I believe that to\nbe true.\nAnd my comment is that although I am going to support this bill to allow at more members\nto the nursing home administration board, we're in the funeral industry just want to make\ncertain that nursing homes across the state are aware that it's very important that they\nare very mindful of when they make those very sad calls to families when someone passes\naway and the family give them the name of a mortuary to call that they are very mindful\nof making sure they call the right mortuary because that creates a lot of problems for\ntheir families going forward when the wrong funeral home is contacted.\nIs that not true, Mr. Representative Lehu?\nI believe that to be true and I believe that would be a great best practice for providers\nto do that.\nThank you.\nThank you.\nMr. Speaker, I yield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines\nHave all members voted\nhave all members voted if so the clerk will lock the machines on the passage of House Bill 1049\nthe eyes are 159 the nasor 1 this bill having received the requisite constitutional majority is\nis therefore passed.\nClerk will read the caption to House Bill 412.\nHouse Bill 412 by Representative Dempsey\nof the 13th and others to be entitled back to amend\nTitle 43, the official go to Georgia Antietta\nrelating to professions and businesses.\nSo as to provide for the licensure of individuals\nin the practice of applied behavior analysis,\nthis bill I refer to the committee on regulated industries.\nThat committee recommends that this bill do pass by committee substitute.\nChair recognizes Chairman Dempsey to present the bill.\nThank you, Mr. Speaker.\nGood morning, friends, here in the House.\nToday, I bring you an important measure as we all continue to deal with the issues\nconfronted by behavioral health in our communities and with people you love.\nThis is something that can greatly help.\nHouse bill 412.\nI want to direct you to the piece of paper on your desk\nfrom Marcus Autism Center,\na trusted source and resource within our state.\nIt breaks down very specifically what a behavioral\nanalyst does and how important it is.\nThe practice of applied behavioral analysis\nis a distinct profession requiring\ndistinct training and competencies.\nIt treats autism, geriatric patients,\ntraumatic brain injuries, developmental disabilities a word.\nI should be able to say better than that after all of this time.\nBut it deals with those measures.\nThis is a consumer protection and public safety measure,\nwhich also allows for Medicaid billing.\nAs an increasing number of private for-profit providers\nare moving into Georgia and establishing businesses.\nThis will protect not only the person who is being served,\nbut the parent or loved one who is making sure\nthose services are appropriate to make sure\nthat they are licensed, credentialed,\nthey have studied, passed the appropriate exams,\ntake regular certification steps to do that.\nIt allows for an assistant behavior\nand an analyst as well.\nAnd if you, just an example of this, and this is one that I think of so much, and it does\ngo back, because I know it's confusing when you start talking about these measures.\nSomeone who has autism, a young child, I remember the first time I visited Marcus, I watched\nsomeone working with a child who was not able to eat.\nThey had a feeding tube, that sensory deprivation that exists for many people who have brain\ndifferences. That behavioral analyst works in a positive way, reinforcing step after\nstep, but with great patience. This one was particularly teaching the parent as well.\nAt the same time, how you can introduce and keep working and keep working, and eventually\na child who has never eaten may take a long time, but will be able to do that. It is a\nThe slow, arduous, very sensitive process, and we need to treat it that way.\nThis measure went through Gork, it was introduced last year, it was approved by Gork, it was\nalso approved in committee, and I hope that you will support the licensing, the development\nof the board, which also will create for penalties for those who come into our state and are\nare not certified and the limited reciprocity that will allow for temporary licenses.\nIf there are any questions, Mr. Speaker, I will take them.\nIf not, I will yield the wealth.\nYou have a number of questions if you care to yield.\nI will.\nChair recognizes representative Wolenski.\nDo you are left for a question?\nThank you, Speaker.\nDoes the gentle lady yield?\nI do.\nIs it not true that I thank you for carrying this bill and the creation of a certification\nfor behavior analysis is very much needed.\nAnd we'll definitely make it safer\nfor individuals who use this services in their home.\nThe gentleman knows of what he speaks.\nThank you.\nThank you.\nYou further you?\nI do.\nChair recognizes representative Al Williams\nto your left for a question.\nThank you for speaking with the lady.\nYou.\nI certainly will.\nIs it not true that I support this bill?\nAnd the only question I have, and I don't expect you to answer,\nthey haven't read the whole bill,\nbut the qualifications, what are they to,\nthere are a lot of unqualified counselors around.\nThere are, and you know, and I will say this too,\nhaving ABA therapy does not mean that you might not\nalso need other therapies.\nSomeone might need speech, they might need occupational,\nas well, but they are specifically listed in the bill,\nthe training, the education, the testing,\nand it is in compliance with the national rating\nof this as well, the national certification.\nWell, the general lady, for the guild.\nI will.\nIt's not true that my niece and Goddaughter is artistic,\nand I think this is a great build\nto make sure everybody talks,\nknows what they're talking about.\nThank you so much.\nIt has saved many a young life and made life better\nfor those who are in their senior twilight years as well.\nThank you, Mr. Speaker.\nI will yield the well and ask for your favourable consideration.\nIs there any objection to the previous question being ordered?\nThe Chair, here's none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute\nto Chair, here's none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill.\nThe chair here's none the report of the committee has agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machine.\nI have all members voted, I have all members voted.\nSo the clerk will lock the machine.\nOn the passage of House Bill 412, the eyes are 158.\nThe nays are three.\nThis bill having received the requisite constitutional\nmajority is therefore passed.\nClerk will read the caption.\nThe House Bill 430.\nHouse Bill 430, Governor of the Senate,\nApollo 32 to be titled back to amend chapter 26\nTitle 43, the Fisher-Coda, Georgia, annotated relating to nurses,\nso as to provide for a licensure of advanced practice registered nurses.\nThis bill then referred to the Committee on Regulated Industries.\nThat committee recommends that this bill do pass by Committee Substitute.\nChair recognizes Chairman Allen Powell to present the bill.\nThank you, Mr. Speaker and the ladies and gentlemen of the House to bring you this morning\nHouse Bill 430.\nPretty simple bill, ladies and gentlemen, that allows for the state nursing board to do\nspecific licensure for APRNs.\nRight now, currently the licensing board, the nurses licensing board, authorizes LPNs\nand registered nurses.\nThis takes it a step forward to allow those that have credentials that are considered\nto be APRians and those other nurses that fall within that guideline to be specifically\nlicensed as an APRian.\nGeorgia has about 19,000 APRians as I understand it and we're only one of 11 states that does\nnot allow for specific licensure for those nurses.\nthat I think speaks well because probably one of the unsung heroes that we have in this\nhealthcare delivery system are the nurses or as somebody all may have heard me say over\nthe years they're the ones who keep the doctors from killing us.\nBut because of the lack, because of the shortage of medical practitioners, these APR answer\ncritical just as the PAs are in this day and time. Except for you, Doc. This bill also\nhas one other issue to it. This would allow APRNs and physicians assistance to issue the\nhandicap placards for those people to the Department of Revenue for them to sign off on that\nfor those who are eligible to have a handicap placard. Mr. Speaker, that's pretty well\nwhat it does and I think this would do honor to all of those able-bodied men and women\nacross this state that serve as the nurses and the advanced practice registered nurses\nacross this state.\nI'll be glad to stand for questions and if not, I don't know if you have one question.\nYou care to yield?\nI will yield for one question.\nChair recognizes representative Maynard to your right for a question.\nThank you, Mr. Chair.\nChairman Powell is not sure that physical therapists get a doctorate degree and they\ntoo should be allowed to give persons with disabilities and a handicapped ticket.\nWell, I don't have an opinion on that, but if the latest state so, then it'd be the will\nof the body in here, and God knows what to send it to do.\nMr. Speaker, I would certainly not sure he knows what they'll do either.\nMr. Speaker, I would certainly appreciate your favorable consideration,\nshow honor to those men and women who practice medicine as APR-Ns,\nand I'll be certain to yield the will.\nChair, have another member that wish to be heard.\nChair recognizes Chairman Nicks to speak to the bill.\nThank you, Mr. Speaker.\nI'll be very brief.\nI can't pass up an opportunity to share some love\nwith our nurses as you know my daughter\nis a nurse practitioner.\nAnd I wanted to just point out the people\nwe're talking about here.\nWe're talking about, when we talk about\nthe advanced practice registered nurses,\nwe're talking about certified nurse midwives,\nCertified Nurse Specialist in Psychiatric and Mental Health,\nCertified Registered Nurse Anethasist.\nThese are highly trained and well-qualified people.\nOne thing to think about quite often,\nthe first person that sees someone who's\ncoming into the health care system as a nurse,\nwe need these good people there.\nThey're a critical component of our health care system.\nThey work in a team, as was mentioned earlier, with the doctors.\nI don't know that they keep them from killing people,\nbut they are part of that critical team.\nDr. Newton and I have talked about that a number of times.\nAnd they feel that need that we need.\nThey can be there when the doctor's not there.\nAnd I just wanted to come and say I support that.\nAnd any way that we can encourage and give positive\nrecognition to these very dedicated professionals,\nI really want to do it.\nThey carry a lot of load in that health care system, and I hope that we will continue\nto give them the professional recognition that they deserve.\nAnd Mr. Speaker, with that I'll yield the well, thank you.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered?\nThe chair here is not in the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to shall this bill now pass.\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of House Bill 430.\nThe eyes are 162, the nasor zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nClerk will read the caption to a group of privileged resolutions.\nHonoring the life and memory of Tamara Natalie Madden.\nHonoring the life and memory of Ernest Clyde Charles.\nin the life and memory of Dr. Arthur Linton,\nA.L. Freeland, honoring the life and memory\nof Bobby C. Smith, Jr.\nRecognizing February 26, 2022 as a day of remembrance.\nRecognizing commending, Tom O'Rourke,\ncommending Jennifer Henley-Moral High School's 2021-2022\nteacher of the year, and recognizing\ncommending Chairman Don Hogan on his outstanding\npublic service, and for other purposes that completes the reading of Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions?\nThe chair here is known and the resolutions are adopted.\nNo purpose, this representative dryer rise.\nThe commotion, Mr. Speaker.\nState your motion.\nI'd like to move that HB 1244 be moved from intergovernmental coordination to government affairs.\nBoth chairs have consented.\nRepresentative Dryer has moved that House Bill 1244 be recommitted from the\nIntergovernmental Accordination Committee to the Governmental Affairs Committee,\nthe clerk will read the caption. House Bill 1244 by Representative Dryer the\n59th and others to be titled an act to amend the act creating the Board of\ncommissioners of Fulton County on the\ngentleman's motion that House Bill 1244 be\nrecommitted from the intergovernmental\ncoordination committee to the\ngovernmental affairs committee is their\nobjection is their objection the chair\nhere's none and it is so ordered House\nbill 961 will be postponed until the next legislative day.\nAll right, we're going on now to announcements.\nGoing on to announcements. If you have signed up for an announcement,\nMake your way to the front of the chamber.\nChair recognizes the chairman of the Game Fish and Parks Committee.\nIt was one day more passed another year over.\nChairman Trey Rhodes.\nThanks for that reminder, Mr. Speaker.\nToday at 2 o'clock, Game Fish and Parks\nto make it in 406 across the street in CLOB, two o'clock.\nThanks.\nChair recognizes representative McClain\nfor a morning order.\nThank you, Mr. Speaker.\nThe working family caucus will meet up on the German\nand your meals will be in room 307.\nSo look forward to seeing you.\n307 upon the German.\nThank you, Mr. Speaker.\nThank you, Mr. Chair.\nChair recognizes Chairman Todd Jones for an announcement.\nGood morning, everybody.\nI just want to remind you that the mental health caucus will meet today,\nroom 341.\nWe have an expert in insurance parity.\nWe also have for Scythe County Sheriff's Department here,\nwho has done a co-responder model.\nAnd they're going to tell us a little bit about it.\nIt will be lunch served, but I want to do a shout out to Ashley Newton, not in room 341.\nThank you so much.\nChair recognizes chairman of Stration for an announcement.\nThank you, Mr. Speaker.\nThe Gunter subcommittee of Judiciary will meet at 1.30 today, followed by the full Judiciary Committee meeting at 2 o'clock.\n1.30 for subcommittee, 2 o'clock for full committee, both in room 132.\nThank you, Mr. Speaker.\nChair recognizes Chairman Dickey for an announcement.\nI commence speaker, members of the Agriculture Consumer Affairs Committee.\nWe will be having our committee meeting today in room 341 at 1 o'clock.\nThank you.\nChair recognizes representative Drenner for an announcement.\nThank you, Mr. Speaker.\nCan the members of the Decav County House delegation meet immediately upon adjournment in the anti-room right there for a brief meeting?\nThank you.\nChair recognizes representative Gullet for an announcement.\nThank you, Mr. Speaker.\nSubcommittee for cityhood will be meeting today, 230 room 606 in the CLOB.\nThank you so much.\nChair has an announcement.\nChair has an announcement, the messenger up here at the podium, Betsy Thoreau, who has\na cell phone that was found in the ladies' restroom.\nI did not find it, okay?\nLet's just be clear on that.\nAnd if you've lost a cell phone in the ladies' restroom, you need to see Betsy on that.\nAll right, we have another group of local bills today.\nAnd it's a large stack.\nIt's tendered by both members of both parties.\nIf there is no objection, we will have the clerk a sign.\nwill suspend, temporarily suspend the rules of the House, have the clerk assign each of\nthe bills to the Intergovernmental Coordination Committee, as we've done two or three occasions\nthis week. Is there objection? Is there objection that Chair here is known and it is now so ordered?\nAll right. We have a birthday today. Listen up. Let's all wish a very, very happy birthday\nto Representative Yasmine Neal. That completes our announcements that Chair recognizes the majority\nLeader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move that this\nhouse stand adjourned until tomorrow, Friday, February the 11th, 2022 at 10 a.m. 10 a.m.\nThe majority leader has moved that this house be adjourned until Friday, February 11 at 10\nall those in favor of the motion will say aye. All those opposed will say no. The\neyes have it and this house will be adjourned until Friday, February 11th at 10 a.m.\n",
  "updated_at": "2026-02-12T15:19:55.742528+00:00"
}