{
  "video_id": "p79UgW1keU0",
  "url": "https://www.youtube.com/watch?v=p79UgW1keU0",
  "title": "3/22/23- Senate Committee on Agriculture & Consumer Affairs",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 78,
  "summary": "Here is a summary of the key points from the Georgia Senate Committee on Agriculture & Consumer Affairs session on 3/22/23:\n\n**Overview**:\nThe session focused on updates from the Georgia Environmental Protection Division (EPD) regarding the permitting moratorium on agricultural water withdrawals in the Lower Flint River Basin. The EPD also discussed a project to convert surface water withdrawals to deeper groundwater sources in the basin.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- The EPD representative, Cliff Lewis, provided an overview of the permitting moratorium implemented in 2012 to assess water resources in the Lower Flint River Basin. This was done to protect existing water users and evaluate potential impacts.\n- Lewis discussed the $49.8 million \"Agricultural Water Source Conversion for Streamflow Resilience\" project, funded by the American Rescue Plan Act. This project aims to convert surface water withdrawals to deeper groundwater sources during drought periods to better protect surface waters.\n\n**Votes**:\nNone recorded.\n\n**Attendance**:\nNo explicit quorum notes.\n\n**Adjournment**:\nThe transcript does not provide information on when the session was adjourned or when the next session will be.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nAnd the records, if she wouldn't mind,\nwouldn't mind saying prayer for us are you putting them six okay all right let us\npray dear God thank you for letting us all be here today Lord I pray that you\nwill use use us to do your work for the people of Georgia God be with our\nfarmers and our producers Lord I know that we've had some serious weather issues\nthat have affected our states crops and I pray that you be with those farmers and\nand those families, God, and let them understand\nthat it's your plan, not ours.\nThank you for the work we do in this committee,\nand thank you for the people I had the privilege\nof just observing with, your name, I pray, amen.\nThank you, man.\nAll righty.\nWell, today we have our friends from the George EP there,\ngonna come here, and I think sort of allow our committee\nto hear some of the same testimony\nthat you all provided to the House Agricultural Committee.\nSo, Mr. Cliff, I think you're going to...\nCliff, it's just for Rachel here.\nDo you mind telling her your full name\nand what you do at EPD?\nI'm sorry, say it.\nYes.\nCliff Lewis with Georgia Environmental Protection Division,\nspecifically the Agricultural Water\nwith Draw Permitting Program Manager.\nAppreciate the opportunity to talk with the committee today.\nWanted to go over some of the things that I spoke with,\nspoke about in the House Committee, as you said,\nMr. Chairman, and that gets into the permitting moratorium\nthat we currently have on in the Flint Basin,\nwith regard to some of the surface water uses\nand some of the flood and groundwater\nuses in that basin, and I believe some of the ARPA, the American\nNebraska Recovery Plan project that we're doing, and obviously\nwe'll take any questions at any point.\nWhat the agricultural permitting program does for George\nEPD is it permits water withdrawals for farm uses.\nAnything over 100,000 gallons per day, or a pump size of\nof 70 gallons per minute would require a permit\nthat typically comes down to farmers and golf courses\nfor our program.\nAnd in July 30th of 2012, we had a suspension,\nthen Director Judd Turner implemented a suspension\non agricultural water withdrawal permits\nand portions of the lower flint and the Chattahoochi River Basins.\nSpecifically, as of that July 30th, 2012 date,\nDPD no longer considered accepting any applications for ag water withdrawal permits in that lower flint\nBasin it affected applications for new permits for withdrawals from the Florida aquifer and for surface waters\nIn the area known as we commonly referred to as sub area four\nThat's the affected region where surfacing groundwater interaction\nHas been modeled extensively and shown to be\nEssentially the same water given their close proximity to one another\nBut the applications for new withdrawals from the Florida\nand aquifer are not accepted.\nApplications for existing permit modifications\nthat would increase either the pump capacity\non that permit or the irrigated acreage\nthat was allowed under that permit also has not been accepted\nsince that time.\nApplications for permit modifications\nthat would increase pump capacity\nor irrigated acreage in spring creek, itchway,\nnotchway creek and the kitchen boonimucleic creek subbasins of the Flint River Basin were\naffected as well as the applications for new permits in those three subbasins of the\nFlint as well. Permitting in other parts of the Flint Basin\nChattahoochubation has continued since that that moratorium and also unrestricted aquifers\nsuch as a deeper aquifer has been made available to those that want to use water in that\nbasin if that aquifer was available at that location. The reason for that\nmoratorium is because the water resources in that basin that are affected by\nthe suspension is such a significant source of water for irrigation. The farm\ngate value of that region is the largest in the state. It's our bread\nbaskets for as agriculture goes, but continued increase in water with\ndraws over time as shown that maybe there's some concern\nin some areas, whether it be for some species or for\nlow flows in some of the rivers and streams in some of our\ndownstream stream neighbors.\nProtecting existing users is something that\nthe EPD is statutorily bound to do.\nAnd so any existing user in an area that is being looked\nthat for additional water withdrawals has to be considered\nand is considered in all of our models.\nSo if you have a permit in that area,\nYou have certainty in that your irrigated acreage and your pump capacity and your investments\nare protected.\nIs that something that we've had to take a look at?\nSo it wasn't just a matter of what's coming into the system and say, what do we have in\nthe system and how do we manage that and then how does that connect to what we might have\nin the future.\nBut suspending the consideration of those permit applications in the area has really allowed\nthe EPD to take in a lot of new information, a lot of data over the years since that implementation\nand update the tools that we use in the management of natural water resources in those basins.\nAnd we continually assess the water resources in those basins and in that region to evaluate\nthe potential for impacts.\nSo that was the reason for the moratorium in the beginning and it was essentially just\nto make sure that that being such an important area for Georgia and an important area for\nthe water resources and for the needs of those that were already permitted we needed time\nto take a look at.\nWhat was out there, how it was impacting the natural resources in that region and what\nsteps we might need to take as far as data that we need or information that we might need\nto consider.\nThat's what's been happening since that moratorium has been implemented in July 2012.\nWe are still under that moratorium.\nWhen we get applications, we do not take applications for a Florida aquifer withdrawal or service.\nWe do talk to that applicant about any potential for other water resources.\nWe're pretty successful at doing that, although the costs have increased dramatically to move\nto deeper aquifers, and the Florida aquifer is the more shallow than where our alternatives\nare now, but we do have alternatives for those who want to get into the system to continue\nto get into for now.\nNext thing I'll talk about is the Agricultural Water Source Conversion for Streamflow Resilience\nproject. That project is a partnership with the Georgia EPD, the Georgia Water\nPlanning and Policy Center and the Golden Triangle Resource Conservation and\nDevelopment Council and the goal of this project is to increase agricultural\nwater supply reliability and better protect the surface waters during during\ndrought periods. How this is going to happen is we're going to convert surface\nwater withdrawals in that lower flint basin to deep groundwater sources,\nessentially taking the users off of surface water in the worst of times or in\nthe dryness of times and having them move to more reliable and less impactful on\nstream flows and have them move to groundwater. This is a $49.8 million\naward by the American Rescue Plan Act 2021 and imitations were sent out to\nparticipants who were offered to, who had existing surface water permits in the subbasins\nof the lower flint and offered to have a call share program, 90% of a deep will installed\nfor them if they would agree to conditions on their surface water permits to be modified\nto only to use to switch off of those surface water permits and move to groundwater use during\ntimes of drought. The existing surface water withdrawal permits are modified so that\nthose drought conditions take effect, those drought conditions, they would be notified\nof when those were to take place and notified when those newly permitted groundwater sources\nin the deeper aquifers are to be used instead of the surface water sources.\nand then install 242 deep groundwater wells\nat the site of the surface water withdrawals.\nCan we do that or not?\nI mean, when we proposed this,\nthe prices of things were not what they were today,\nand that was the number that we projected,\nso we're still trying to move forward towards\nputting in as many as we can,\nbut the costs have increased since this plan was\nquite developed.\nIt's a five year implementation timeframe on this project.\nWe've got a project advisory board that was selected by the Water Planning and Policy\nCenter and vetted by EPD.\nThe project area for this is the lower Flint Basin and specifically in that 2012 suspension\narea that I mentioned went into effect in July 2012, 2012.\nAgain, no new or increased surface water use and no increased use or new uses in the\nFlorida and aquifer. The initial focus of this has been implementing that in the itchway,\nnotchway creek, subbasin of the lower flant specifically because of water planning and\npolicy center had done so much work there, not always at a ripe area geographically and\nhydrogeologically, but they had already done a lot of work in that where their mapping\nhad basically given us a leg up on the information that we had there and we were able to leverage\nthat information with better use of the funds and a better project.\nIn that project area there's 370 new Clavern wells and the Clavern aquifer is not a restricted\naquifer, it's a deep rock for the Florida aquifer.\nThe Florida is more shallow and it is typically more productive.\nIt is all limits.\nThe Clavern aquifer is something that new applicants currently do have the opportunity to put\nin. As I said, it does cost a more to get these wells, but it is not, it is an option for\ncurrent users in the Flint Basin. There's going to be 16 monitoring wells installed. Those\nmonitoring wells are going to collect hydrologic information as well as water chemistry information,\nand all of that data is going to assist us in better understanding and managing the water\nresources in that basin as well as to aquifer withdrawal capacities that exist and how that\nplays into the regional water capacities, you know, outside of that basin. We also, you\nknow, we share that aquifer with Florida and Alabama, and that's not just confined to\nthat area, so it's spread out, and we all have drinks in that. We all have straws in\nthat drink, but we need time to better understand how that plays, how that localize impact,\nand it spreads out, and what type of regional impacts it may have. Monitoring equipment\nis going to be installed in those monitoring wells and those, you know, that work is soon\nto begin the contractors are being put together and information being put together for them\nto go out and begin that as we speak. We definitely need more information on the deeper\naquifers in that project area. Like I said, they're more expensive to drill to the Clavern\naquifer, and the yield is not as much as it would be in the Florida.\nBut we do have limited data in the project area.\nSo it's very difficult sometimes when whether a well-driller calls or an applicant to put\nsomething in calls that, hey, I want to put in some well and grow blue berries or whatever\nyou want to grow.\nAnd they say, how much water can I get there?\nWell, we don't know.\nAnd we can't promise you anything other than the fact that yields probably spend a lot\nof money getting your answer. And that's about the best we can do until we get more data.\nAnd that data is going to come from this project and it's going to come from those monitoring\nwells in that area. Geology and aquifer characteristics by a team of University of Georgia\nprofessors working with us. They're improving the workforce readiness for our project\nand supporting student training on some of this stuff. And we have undergraduate ground\nwater technicians working on some of this stuff as well as some graduate ground water\nprofessionals working on as well.\nSo it's not just an EPD working on that.\nWe have some really broad perspectives and some very, very hydrologically inclined experts\nworking on this project.\nThe long-term monitoring of hydrologic effects of reducing surface water withdrawals during\ndroughts is what we're trying to do.\nthose targeted outcomes of this project include 50 cubic feet per second or more flow benefit\nduring drought.\nAnd I want to talk about a flow benefit for just a second because you may hear that turn\nfrom your constituents.\nWe hear it from those we want to, you know, we talk about it with those that won't\nknow withdrawals, but something that we're, you know, looking at in this system is what\ntype of flow benefits we get from different management activities and by flow benefits\nI just simply mean how much flow, how much water can we keep in the stream, how much can\nwe keep in for the critters, how much can we keep in for the flow of that hydrologic system,\nhow much flow do we keep in there for all of the users, and how do we continue to protect\nthose that currently already have a permit to use.\nAgain, getting improved data on those deep aquifers, we're going to have two augmentation systems\noperating in spring creek. We currently have one that was damaged some time ago by Hurricane\nMichael and that was put into wet the muscles during drop areas. We're going to have two.\nThe one that was existing was damaged during Hurricane Michael. This project is going to get that\nback up and running and get it operational as well as get another well put in so that it can dump\ninto the creek to ensure species protection.\nHabitat Conservation Plan is another goal of this project.\nThe Habitat Conservation is something\nthat EPD's providing technical support\non to the Water Policy Center.\nAnd we believe that through the Habitat Conservation Plan\nthat the future permitting Florida\nNoggle for Surface Waters in the Flint Basins,\nthe habitat conservation plan may offer a good opportunity for vehicle for the state to\nin the future have some potential to open up some of those areas that may be restricted\nnow. Doing an updated survey on freshwater mussels in that region and having improved\ndemand management like conservation easements and suspension initiatives and incentives\nexcuse me is something that's being looked at as well. Source water conversion I talked\nabout, you know, converting some of these surface water sources to ground water.\nAnd that being a cost share program.\nBut that source conversion will decrease the adverse impacts on stream flows\nand during periods of drought.\nIt's going to provide farmers with more reliable sources of water.\nAnd it's going to leave water into the rivers and streams for downstream users\nin aquatic ecosystems, recreation opportunities, and other water quality protection.\nIt's also going to improve the resilience of the regional economy, the potential shocks\nfrom the drought and the decrease in its exposure to conflict and the litigation that we\nhave faced in the past, which is important to have favorite outcomes and a lot of those\nfavorite outcomes in that litigation due to the management activities that the state\nhad implemented.\nThey're going to be more metering or use metering under this project and ensure that the proper\nuse of these sources are used at different times, that being whether it's the normal periods\nof climate or drought periods to make sure that these users are in compliance and make\nsure that the existing users are protected and their infrastructure is not impacted by\nany of these changes in any of these source swaps.\nWe're going to have data that's supported for future analysis of resource utilization\nand sustainability and also moving towards telemetry meters.\nRight now we use micrometer propeller meters and what that means is they have an opportunity\nto break and get damaged and get sediment in them and all kinds of stuff goes through them.\nBut at the end of the day it means that I've got to send somebody out there to walk up\nto the meter and actually look at it and look at the number.\nThe telemetry is going to be much more efficient, it's going to save us from having to send\npeople out to these things and all these sites and running around and actually be able\nto read it just through a data download.\nYou can do a data download and not have to send,\nyou know, physical presence on people's land\nlike we have to do now.\nSo just moving into better technology\nand that'll help us with compliance\nand understanding compliance better\nand also be able to help us to have a better understanding\nof form operations on some of these forms\nthat are using this telemetry and work with these land owners\nUm, to meet their needs and their questions.\nMr. Chairman, that's all I have prepared.\nDo you have anyone has questions?\nYes, sir.\nUh, Senator Watson, what number are you?\nOkay, we got a lot in that.\nWe got two of them a lot in that here.\nUh, Senator, go ahead.\nThank you, Mr. Chairman.\nThank you for being here. Cliff, appreciate all the work you are doing and I know we've\ngot a lot going on down there but we've I guess also not had a lot going on. I know the\nmoratorium has been in existence now for almost 11 years and I know 11 years ago it was\ntold that we would evaluate it annually. Is that still done? When is it evaluated and\nAnd if it's evaluated, where's the information on that?\nSo the original announcement and intent was to have an annual November review of our\ninformation.\nI think that our technology, our information, better resources that we have has really\nincreased what we know over the last ten years.\nWe've had a major influx of information, our modeling tools are pretty amazing.\nWe have incredible experts that are doing these things.\nAnd to say that we evaluate every November, we wouldn't be doing it just as we do.\nWe evaluate it probably, you know, I know you can't geologically evaluate something every\nmonth, but we look at this information constantly and we talk about it constantly and we talk\nabout what are we doing right, what are we not doing, what do we need to pay attention\nto and I certainly wish we do it best we can and we could probably do a lot of\nthings better I'm sure we never have enough time and people and all that like\neverybody else to do exactly what like we want to do it but that's how we we\nput our heads together all the time internal try to do the best we can with\nspeaking to stakeholders increasing those discussions talking with people who\nmay want to put an application but like I said we can't take an application\nbecause of the moratorium. What is it that you need? What is it you trying to do? Are there\nopportunities to redesign systems or look at new operational efficiencies that maybe we're not\nlooking at? So that's kind of what we're trying to move into is to talk to some new people about,\nhey, what are some new things that maybe what do we miss? Is anything we need to look at?\nBut we're continuously looking at that even though the formal announcement back in July 30th,\nthe 2012 on the implementation that moratorium said it was in November. But that information\nrest in a number of different places. I have, you know, some with our ag permitting program and\nwe work with our hydrologic unit who has information on the models. We have our metering program\nand our hydrologic unit that also has information on metered water use. So, in the watershed\nprotection branch of the division would be where all of that information would be held.\nOkay. Well, I know you've got a lot of extra help behind you, but I mean, what,\nWhat did we say we were going to evaluate it and what are I mean I just you know we've got\nfarmers down there that have waited patiently technology has changed there are a lot more\nefficient and we're still just sitting on a moratorium. We've you know heard rumors of\npossibility of opening things up and some areas for different reasons and then that all of a sudden\ndisappeared and now we've all said and got a bunch of money so obviously some\nthings are starting to happen again but you know we've got farmers that have\nwhales that may not be permitted have acres that may not be registered or set\nup or in the database and they just want to be compliant. Everybody knows\nthey're irrigating and they've been irrigating for 11 years. We just want\neverybody, we need to be collecting that data. I mean, it just makes sense. But we won't\nlet them come into compliance. We still won't let anybody drill. And we're sending out letters\nto them from the APD, telling them that they need to get in compliance. They don't know\nhow to get in compliance. Some of them can't get into compliance. And it may not be their\nfault. And it's like, but we all have new technology. Everybody's been talking about\nBut what does it truly mean when we're going to reevaluate the moratorium?\nI think one of the things that we, in one of the things that we've been doing is we've\nexperienced an explosion in that technology with regard to GPS systems and GIS, geographic\ninformation systems and satellite imagery.\nIt's allowing us to see what's going on.\nIt's allowing those that users and permit holders to submit information to us faster.\nSo that's where it all begins is in those locations and that's where everything that we do\nstarts.\nSo when we re-evaluate the moratorium, we start looking at just how surface water and\ngroundwater are connected to one another in that basin and that changes based on the\nyear, whether it's drought year or whether it's not.\nBut for the information that we've had and collected over the past decade, I think it's\nscientifically proven that water is basically the same water once you get into those lower\nflint basins and if you take from over here it can impact the surface flows, if you take\nfrom the groundwater here, if you take from the surface water it's certainly a one-to-one\nimpact and I think that one of the things that we have done really well over the last\ndecade during this moratorium period is improve the modeling and improve the data and\nSo what that is telling us is in the areas that are their new areas,\none of the things we're looking at is are there new areas that maybe that there are capacities\nthat could be tapped in the future.\nSo that's something that APD has been looking at.\nAnd some of the modeling results have been positive with the potential to look at other areas\nthat may have capacities in the Flint Basin to continue to permit.\nAnd that said, it's more to it than just the hydrology of it, and that being there being\nsome sensitive, you know, for federal endangered muscles in that region, most of our permits\nare from that region.\nSo that region has a hot spot, and it's very important for us, from a hydrologic standpoint,\nfrom a far, very distant point, and it's also important to the existing users that we\nhave to protect and our downstream neighbors that we have to protect and also the critters.\nSo there's a lot of moving parts, a lot of variables that have to be looked at and that's\npretty much what we've been doing past 10 years.\nSo I'd say those modeling results are really, really good because a few years ago we didn't\nhave that positivity that we have now and it's not that we were negative about it, just\nwe didn't have the data.\nWe've gotten a lot better over the last 10 years.\nAll right, Senator, if you don't mind, Senator Sam's life has been blank and censures was I'm I'm going to\nOkay, well if you don't if you don't mind Senator Eccles's life's been flashing for a while to Senator Eccles\nThank you, so I I farm in Northeast Georgia, so I don't have these problems fortunately\nBut so I'm listening to you say that you know you're collecting data. We've\nsaid a moratorium. I don't know because I'm new here. What was the\ncriteria to establish this moratorium? How are we reporting to that? And then\nalso what is the criteria to lift the moratorium so that we can you know\nmake a plan and move forward? Not just continued to collect data because\nBecause that is great, but what are we doing with the data we're collecting?\nYes, so what generated that, the moratorium was certainly the evidence that streams are\ngoing dry and they have going dry, but we've seen them start going dryer longer and\nthey're going dryer faster and stay in dryer longer in that region.\nSo the models have shown us what that has looked like and what that trend has been over\nthe past few years, and what that showed is there's potential for adverse impacts with\nthe irrigation that is out there, and just really needed to take a look at how we manage\nit, and that came in the form of Flint River Basin when we had an original moratorium in\n1999 to 2006, that was originally lifted with a 2007 Flint River Basin plan, which took\nall this stuff to a similar situation. What I'm talking about right now, that we collected\nover those decades, or that decade of proximate decade during the moratorium, put all that\ninto the plan and decided, hey, these are the management practices that we need to implement\nmoving forward. And one of the things we did with this moratorium was any application that\nwas submitted before the implementation date was still processed. So all of those are\nstill, there's still a few that are still going through that process. So there were still\npeople that came online, came into the system after that.\nThey were people that had applied for it beforehand, but that was really just the adverse impacts\nfor the potential for adverse impacts in the lower Flint Basin.\nBecause that surface water and groundwater is so close together and so tightly connected,\nwe just needed a better understanding of how the withdrawals that we currently have in\nany potential future withdrawals may impact that.\nSo that was the genesis of that, you know, the idea of how do we come out of this?\nI think that we believe that through the work we're doing the partnership with the Water\nPolicy Center, having to have conservation plan and working through that may offer us\na future of being able to open up or consider potential withdrawals in that basin in a different\nway than we have now.\nSo that's what we believe is part of the solution for sure.\ndefinitely just better models continue to talk about what our practices are\ncurrently and if we can improve those that would be the future for us. Senator\nSims?\nthe privilege that you have to be mindful of, I don't know,\nespecially a little bit.\nDownscrains hold from our farmers and upscrains hold\nthe blitz, but the red water flows downscrains too.\nSo there are a lot of uses, but there is as well\na taking from the area of farm.\nThis is a square year from water close to 12 years.\ndata collecting, their analysis, those kinds of things.\nBut we are 80 billion dollar industry.\nAg is an 80 billion dollar industry.\nAnd once you put those very stringent stipulations\non our ag community, then tell me what we're going to do.\nHow will you report or propose for our ag industry\nto be productive and thrive, if they have a clear bit of warrant for it and there is no,\nis there any, any plans in sight for us to save and these individuals that are represented\nin the act and reveal that we are going to be recognized what their situations are right now.\nWhat can I say on my phone in public schools?\nCertainly, one of the things I mentioned is EPD's statutory directs to protect existing\nusers of that $80 billion, $80 billion is something that we have to protect and something\nthat we have to use our management activities and our policies that we use to protect\nthat.\nSo, that's one thing is we want to protect that $80 billion, so there's that.\npreserve that. But we also want to continue to grow for sure. We want to make sure that\nour growth is measured in a way that does not jeopardize those that are producing and\ndo have those permits that are producing that $80 billion. So one of our primary directives\nis to protect those that it currently exist. And part of that protection comes at just\nbeing very measured in everything that we do from this point forward. Certainly the sensitivities\nof that basin with the species, they're the four protective muscles, and the subject\nof bi and potentially in past tri-state litigation causes us to move very measured.\nAnd it's simply to protect those that are currently in the system and protect that\nfarm gate value.\nSenator Sims, I will move on to Senator Watson.\nHis was blinking next.\nGo ahead, Senator Watson.\nWell, I just wanted to follow up where I left off and kind of ask.\nI mean, what is the data I have to show to decide whether we need to stay in a\nstay in a moratorium or let the moratorium or maybe let everybody become compliant\nthat's not compliant or you know something of that measure what is it where does it\ngot to be to make that decision and who makes that decision well well one of the things\nthat I mentioned earlier was flow benefit and that's something that is going to be\ngetting to Senator Eccles point you know what's the criteria in the future we're\nlooking at flow benefit so when you talk about putting extra straws in there or\nof the straws that are in there, all of that will be in the context of what the flow\nbenefit of that system is and what those models do show. So, you know, so that's what I\nwould say, you know, that's what it needs to show is that whatever happens in the future\nwhether it's additional permits in this area or this pocket or wherever that is, that\nit doesn't have an adverse impact on the flow benefit because in the event that that\nhappens it's going to open us up not just to internal potential farmer uncertainty in\nthe infrastructure and investments they've made because their neighbors are getting new\nwells potentially impacted them but also our downstream neighbors that we have to consider\nas well but flow benefit is something that we've you know currently holding as a high priority\nis something we're looking at in terms of what what happens in the future well and I mean but\nBut again, for the ones that aren't in compliance, if we've been checking the data and the data\nhas not moved a whole lot and it's staying normal or within whatever this range is that\nwe're supposed to be measuring off of, why don't we just bring everybody in to compliance\nand start collecting the data, the real data and get our acres matched up with what we're\nsupposed to be in and just bring everybody into the fold?\nWell, you hit a good point earlier when you talked about the different, I guess, scenarios\nthat the past 20, 25 years that farmers have had to get water use permits have gone through\nand that has changed over time. What you had to apply for or maybe the application looked\ndifferent or what you'd be required to do. But one thing that I've seen in the last 20 years is\nit's not a blanket, it's not a blanket non-compliance issue as to put it in the terms that you talked\nabout. It's a case by case scenario almost every time. There are nuances to everybody who\nis not in compliance. Some didn't know. Some knew. And there's a whole kinds of things,\nbut it's not something that can happen fast, and it takes a long time to work through\neach of those cases. And one of the things we're doing right now is taking a step back\nand working through each of those cases on one-on-one, more reaching out to those that like\nyou mentioned those that got the letters to help people understand what compliance\nis, what it means, how to know what it is.\nAnd in some cases, we're going to find some solutions to help people get into compliance.\nThere will be some that there, you know, that won't be easy choices to make by, you know,\nthe growers, the producers, or by EPD, for sure.\nIf you don't mind Senator Watson, I want to ask a question real quick.\nAnd so where I live at in farm, you know, is from about east, so we don't have any water\nproblems over there.\nIn fact, we got too much water most of the time.\nBut my question is, you know, the aquifer that we're talking about, the farmers just\nacross the state line in Alabama and in Florida, they're still drilling wheels every day,\nright?\nAnd so I don't want you to think, I'm not trying to beat up on y'all, I just\nsincerely would like to know. I mean, if we're pumping out the same\npollen, basically, and the farmers in Alabama and Florida are still able to\ndrill wells, but our farmers aren't, what do you say to that? That's one of\nthings that I mean if we were all on the same boat together and everybody all the\nfarmers weren't but I feel like the farmers and the other two states were pumping\nout the pond and our our farmers aren't able to. Mr. Chairman I think what\nseparates us is two things number one we're upstream of Florida and that\nmatters in federal law your upstream has a has a federal obligation to protect\nyour downstream neighbor number one. Number two, we got those four federally endangered\nmuscles over in that Flint Basin, and they're not over there, you know, where the guys\nare poking holes in Alabama or Florida that I know about. We do know about them in the\nFlint Basin, but the fact that they're there draws a lot of attention, Mr. Chairman,\nand it requires a lot of, you know, a lot of paying attention to on our part to make\nsure that we're, you know, following the right protocol and move forward and talking\nto the right people just to make sure that we preserve the infrastructure of those that\nalready have those permits in that area.\nSenator Burns-Lightsman, he's been waiting patiently.\nI'm patient, Mr. Chairman, thank you.\nThank you for being here.\nAppreciate the input.\nAppreciate the work you did.\nI want to come back to something maybe that Senator Watson keeps harping on and that's\nnot quite well.\nHow many are you in a little what area you're in but let's just let's just take what we've got about we got about 500\nAbout 500 active cases\nMostly located in\nThe majority of those will be located in that river basin area\nSo that Southwest Georgia it is but not all of those we're talking about some of those are cases where you know\nMaybe they're just not a meter on matter fat as a lot of those is just the meter where they're permitted\nBut the meter is not currently something like that\nor maybe they hadn't turned in all the information.\nThere's a good load of those, too, but the hard ones,\nSenator Burns, are the ones that your permits\nwere 100 acres and you're irrigating 200 acres,\nand we don't have any extra acres to give,\nor we're not taking applications to modify acres.\nThere's those, and then there's those that after 2012,\nyou've got those that did put in that we can see\nby that imagery as Senator Watson mentioned,\neven pumping forever, we can see that.\nWe can also see the ones that put it in, you know, in 2013 when they came in in 2012\nand asked good to have it, and we said no, and they put that in anyway.\nSo we got those two, we got them, it's not, it's not one category, it's a broad category,\nas well, you know, what I meant to get at is it just a case-by-case basis that ever happened\nto go through things and they take a while.\nAnd I appreciate that, but I would say to Senator Watson's point, we need to document\nthat is saying is effectively, so at least we have that data as a part of the utilization\ndata set. I want to shift over to East Georgia, South East Georgia, which is where I'm a\nfarm and I'm a pillar. I'm not a real farmer. I want you to know these guys are real farmers.\nMy grandfather was a farmer, but he had two mules, so it was a bit different about them.\nBut I have Burke County, which is one of the largest producing cotton peanut counties in the state,\nIn Scriven County, in Bullock County, and a host of others, a manual county, and down\nthe Savannah River, the Yogichi, the Ultima Hall, and we draw water from the Othlerian\naquifer.\nAnd we poke holes down there, and we irrigate crops.\nBut we're also experiencing some significant growth from an industrial perspective and from\na residential perspective.\nHow does that fit into EBD-EPD's water management claim?\nWell, with regard to agriculture,\nEPD doesn't have the authority to consider a residential neighborhood whenever you apply\nfor an ag well.\nSo that's not something we do have.\nWe notice where some of those are and from a common sense perspective, we might take\na look and see how that's impacted, but that can't, you know, that's not necessarily\na factor in the decision to give you what you're asking for for ag purposes.\nSo my concern is long-time generational agricultural producers in South East Bullock County are likely\nwill be impacted by the industrial growth in that region.\nHow do we protect them?\nHow do we ensure that they can continue to farm and that the water supply will continue\nto support their operation?\nI'll try that one, I'll go back and talk to those guys.\nI'm Rick Don, I'm the director of EPD.\nI keep up here to talk to try to address some of Senator Watson's concerns, but particularly\non East Georgia, there's a little different concern on the coast and that deals with salt\nwater intrusion.\nSalt water intrusion?\nIn the amount of groundwater pumping and I think the future of, you know, to accommodate\nthe growth in the future water use and the coastal region of Georgia is going to be more\nuse of surface water.\nSurface water.\nYes, sir.\nThere's not a lake.\nThis is Savannah River, right?\nThe south of Augusta, Georgia, and that Savannah comes down and we've got two or three lakes\nabove.\nSo there's very limited surface water south east Georgia, right?\nWe've got a lot of ocean out there, but it's not only surface.\nIn particular, meaning particularly not so much the farming needs because again, the\nis not a huge use out there, but the municipal industrial growth in that area.\nAnd by the way, we certainly support that industrial growth and that residential road,\nnot only in my region, but also across our state, but it does impact our agricultural\nindustry substantially.\nAbsolutely, and again, the concern there is the groundwater pumping, what it does to the saltwater plume.\nhad his issues with saltwater intrusion related to pumping in Georgia so the\nfuture there for for growth is going to be getting surface water towards\nyes sir and as a mass vision I think that's a great idea I just need more\nsurface to fish correct they if y'all don't mind Senator I'm gonna Senator\nSam's light has been blinking for a while. Senator Sam's.\nThat's currently the only one that's under Niagara cultural moratorium. Yes, man.\nI think one of the biggest differences in the way to answer that is the fact that municipal\nindustrial withdrawals put back about 80% of whatever they withdraw and agricultural withdrawals\nare considered 100% consumptive.\nTherefore, it's arguable, I don't know if we put 99% back,\nor if we put 45% back, something may go back,\nbut the studies have not been done to show that.\nSo that's an area of some information gap.\nExactly what is the percentage that is put back into the system?\nAnd until that's known, the models that are used\nwould use 100% talking with ag experts in the region of the flint though, and you're from\nthere too. You know the hottest times of the year, you know what it's like down there\nand water is not available a lot of time. Surface water is not available a lot of time.\nSo the idea that agricultural water use is 100% consumptive, you know, in a lot of these\nthese ag experts minds is that it's pretty close, if I can say that.\nYeah, now it seems that the doctor has been doing veering the moratorium on what they\nare there answers to this, that can help us create a more sustainable way of a lack of\nreduction.\nAbsolutely.\nThe increase in something we work with is just increasing low pressure on the systems\nthat are out there, considering new technologies such as variable rate irrigation to turn water\nare awful non-cropped areas, looking at certain drought conditions that allow use under certain\nconditions, but CC irrigation under other conditions, that's another practice.\nBut in some cases, when you don't have anything, that might be better than nothing.\nIf you don't have a permit and you asked for a certain, let's say, rate or a certain amount\nof acres, maybe we can't give you that, but we might give you something, it may not be\neverything you ask for, but some of those practices might be that we, you know,\nworking with that individual is, hey, we can't give it to you. We can't give you\nthat 1,000 gallon per minute well here. It's the only way you can move it over\nhere because we think you could be all right here. And so just working with\npeople in placement as well as size and some of the design. And unfortunately, in\nsome of those cases, we're just in very sensitive areas with the muscles and\nalso in areas where the surface and groundwater is basically the same water.\nis the same water. So just various types of conservation conditions that we could do potentially\nseasonality uses of permitted water use or just things that we're looking at technology.\nI want to point these to the water for next few years\nthat I was going to get some sense of that.\nAnd I'm knowledgeable of some of the vinyl and other things.\nBut we have a few more photos that you did not plan to use.\nIt's actually some areas of the lower flantist\nSo, Senator Sims, if I could kind of combine this into some of the angles at what's in\nwas getting, when he was asking about the moratorium and we've been patiently waiting\nfor the moratorium and we're supposed to review every year and what do we do and things\nlike that.\nI wanted to come up and just kind of emphasize the point, particularly for the last\nfive years where we've been very limited on what we can do with the moratorium due to\nthe tri-state water wars litigation.\nWe certainly didn't want to modify the moratorium while we were undergoing that litigation.\nWe litigation, that particular case has been largely resolved in our favor and of course\nThe first thing we ask is, in what ways can we responsibly modify the moratorium?\nAre there areas, you clip talked about, you know, the groundwater surface water interaction\nof their areas that are currently covered by the moratorium where, you know, additional\nwithdrawals mean I have such an impact on surface water flows.\nAnd looking at that, again, the whole subarea for is kind of a blanket, no new groundwater\nThey're all from the Florida and aquifer, no new surface waters and again looking at\nthere's ways we can responsibly modify that at the edges to allow additional withdraws.\nAnd we've looked at that very carefully and I think what we've decided as a policy\nmanager is to hold back on modifying the moratorium at this point to allow the exploration\nof habitat conservation plans, incidental take permits, explore that process that that's\nsomething we want to pursue. And if that's something we want to pursue, we want to\nalign those two processes together. So, Senator, I was trying to respond to some\nof your questions about, you know, we're patiently waiting and that's kind of\nwhere we are right now. Does that make sense? Okay. Yeah, that's a harder question. Right.\nWhat difference does it make at this point and why don't we fill it out so that we have\nthis accurate information so that somebody tries to do something later on.\nWe have the accurate data and we're telling the truth.\nRight now, we're not telling the truth.\nWe're telling them false information because we don't have all the data.\nAnd you know, Cliff's sending letters and having to deal with them on an individual basis.\nAnd I know there's instances where they can work some of it out, but there's some of them\nand they just can't and it's not their fault.\nThey bought a piece of property that they didn't know.\nThey weren't told, you know,\nand the Army of Farmers changed\nand everybody's trying to be more efficient\nand the equipment's more efficient.\nAnd obviously we've been collecting the data just,\nyou know, and we get, we get the calls\nwith these people with these letters, you know,\nfrom the farmers, from the oil drillers, from everybody,\nand we have nothing to tell them.\nThey said, we're gonna wait on somebody one day,\nmaybe in their lifetime to reevaluate this\nwhen that's what everybody said 11 years ago.\nAnd I guess to go ahead, you clips, Mitch,\nyou didn't, you mentioned it.\nDoes Habitat Conservation Plan?\nI don't know anything about it.\nAnd I'm a farmer in Southwest Georgia,\nand I've been a legislator for 10 years,\nand I don't know anything about it.\nYou can't even find it.\nYou can't even Google it and find anything on it.\nCliff, you want to talk about the HCP,\nand I think we've got some of our folks.\nYeah, love to learn about it.\nI mean, it's and it's why are we waiting till now why didn't we go down this road right\nafter we went into the moratorium.\nHello, my name is Agna Trishjinskiem, the Chief of the Watershed Protection Branch and\nI'll give you maybe a little bit of history about the Habitat Conservation Plan if that's\nokay.\nSo this is a conversation that has actually started many years ago.\nIt's been bubbling off and on, and so there's been a lot more conversation about it.\nSome points in time, a little bit less than others.\nThis is something that folks have been thinking about pretty much since the Fish and Wildlife\nService back in 1998 identified those four endangered mussels and one threatened mussel species,\nbut it really kicked off after EPD developed the Flint River Basin Plan.\nThis was the plan that Cliff mentioned, finalized in 2006.\nOne of the comments that we received from the Fish and Wildlife Service at that time was\nthat if we implemented the plan as written,\nit would basically be considered,\nor it could be considered a violation\nof the Endangered Species Act.\nBasically, we could be having an incidental taking.\nThis means that we would somehow harm\nor in other ways negatively affect\none of those threatened and endangered species.\nSo when you're in that kind of situation,\nyou can either modify what you are doing\nin a fairly significant way,\nor you can work through a process\ncalled an incidental take permit.\nThis is one of the components of the Endangered Species Act.\nAn incidental take permit says you could be doing\notherwise lawful activities that may result\nin some taking of an endangered species,\nbut you're gonna also do whatever you can\nto minimize or mitigate for that impact.\nAnd the way that you describe how you minimize\nand mitigate is through the development\nof a habitat conservation plan that basically outlines\nall of the strategy, all of the funding,\nall of the folks are responsible.\nAnd then you do some monitoring, fish and wildlife does some monitoring,\nand they confirm, you know, are you really doing something beneficial for these species?\nAnd the habit, so the Habitat Conservation Plan first kind of came on the radar\nin that documented way back in 2006.\nWe received additional comments from fish and wildlife as we went\nthrough the regional water planning process back in 2008.\nWe received letters back in 2010.\nWe received letters.\nSo this has been something that's been kind of simmering on the within our horizon,\nI guess, for a while.\nBut these kinds of plans are challenging to make.\nWe have one successful one in Georgia\nfor the Red Cockated Woodpecker that is held by WRD,\nWildlife Resources Division.\nThere is also an attempt to have one up in the Kusa Basin\nto help protect some of the starters that are up there.\nBut due to a lack of an established funding mechanism,\nlack of ability to get all of the plan components together,\nthat actually fell apart.\nSo it takes years to develop these types of plans.\nThe Habitat Conservation Plan, there's nothing right now developed for it, but it is a component\nof the ARPA project that Cliff described earlier, because as we're going through everything\nand looking at what we've got, it looks like a viable option for us to develop an effective\npermitting strategy that would address the concerns that you're mentioning.\nSo it would allow us to address liability, both for the farmers themselves as well as\nfor the state of Georgia.\nIf we were to open up permitting right now,\nthere's some concern, of course,\nthat we could be subject to litigation\nor some other legal liability risk\nthat we are performing that taking.\nIt also allows us to build a more robust HTTP\nto maintain that moratorium that might be secondary.\nBut another thing is that it does allow us\nto bring in all of these tools, right?\nCliff was explaining the very complicated\nseries of decisions and series of tools\nwe have available to manage agricultural water withdrawal\npermitting in the Flint River Basin.\nAnd the HCP allows us to take all of that together, put it\nunder one big umbrella, and say, we're\nnot going to have this piecemeal approach.\nWe're going to have something comprehensive, something clear,\nsomething that we have a lot of stakeholder buy-in for,\nto really move this forward.\nBecause the farmers in that region\nhave been subject to a whole lot.\nThere were no permits until 1998.\nSorry, 1988.\nThen in 1999, there was the first moratorium that\nwas put in place until 2006.\nThen we issued permits in compliance\nof the 2006 Flint River Basin Plan that lasted until the moratorium that was enacted in 2012.\nSo there's a lot of back and forth. We want to make sure that we have regulatory certainty.\nWe also want to be really sure and really clear about where we have capacity within our water\nresources. Can I ask a question? So Senator Sims District, you have a farmer that owns land\nand Quipman County, George, he can't drill a whale right across the border and you follow\nthat farmer can drill a whale, they're pumping the same water.\nThat's what I can't wrap my mind around.\nI know that we're talking about downstream, but we're talking about east and west here.\nThis is it in North and South.\nYou know what I'm saying?\nYes, sir.\nWhat do we say to these farmers?\nbecause that's the one thing I would say,\nand I want you all to understand\nthat especially these senators to the right of me\nare under a tremendous amount of pressure\nfrom their farmers down there.\nAnd, you know, so, you know,\nthey, this is a big issue for them.\nAnd so, do you understand where,\nunderstand what you're saying about being downstream,\nbut this isn't downstream?\nNo, and I understand, I believe I understand the question.\nAnd I think that you've hit on something that Director Dunn touched on and that, you\nknow, was what we're exploring because there are places, especially as you start moving\nout to the fringe of sub-area four, where we see that the groundwater and the surface\nwater just isn't as closely connected.\nSo there are some places where if you put in another well, we're not going to see a lot\nof effect on the surface water flows.\nBut we want to be able to really understand that hydrology and kind of put that all together\nthat we are establishing a very clear permitting process.\nSo we do think that there are areas, I don't know, I can't speak specifically to equipment,\nbut I know that there are areas within sub-area 4 where there may be some additional capacity\nwithout necessarily hurting those muscles.\nBut that's something that we want to look at and evaluate with all of the tools that\nare our disposal.\nI know that's not necessarily a tomorrow answer, but we do recognize that there is that\nvariability.\nThank you.\nSenator Watson.\nSo I've not heard about an HCP until recent.\nSo if we wouldn't have got the ARPA funds, we'd be talking about HCP.\nAnd then on top of that, we just want a Supreme Court case.\nAnd now we're basically going to say that farmers are taking a species,\nthey're admitting to taking a species after we just told the whole world\nWe're not doing anything wrong.\nI just don't understand that concept.\nYeah, and I think one thing to clear fun,\nI apologize by Ms. Spoker, was not particularly clear\nwith the incidental take permit.\nYou're not necessarily admitting to a taking.\nWhat you are doing is you're protecting yourself\nin case someone were to make that allegation\nor in case they're happened to be a taking.\nSo that it's more of a protective thing\nthan it is an admission of any sort of guilt\nor anything like that.\nAnd I'm so sorry, I forgot the very first part of the company.\nThe money, yes sir.\nWe're all the sudden got some money, so now we're talking HCP,\nand we're whatever that is, and we're moving forward with it,\nand we don't even know how long that take.\nHow long does it take?\nSo are we talking another two years,\nanother five years before we can even answer these farmers?\nAbsolutely, so, and if I forget one of the questions,\nplease remind me, but the money was a big part\nbecause those deeper wells are going\nbe very helpful in terms of protecting flows and creating additional, yeah, basically\ncreating additional flow being really protective of the muscles.\nThat was a big thing, and that helped move things along much more quickly, but that conversation\nabout the HCP was something that had been generally discussed for longer than that.\nSo I don't know that the ARPA funds necessarily resulted in a change in process, but the ARPA\nfunds I think certainly made available more options and on a quicker time frame, because\nyour second point, we don't want folks waiting another decade before they can do anything.\nI understand that there are real challenges that are faced by constituents in both of\nthe districts and so we want to be responsive. The big thing is we want to move quickly\nbut we don't want to hurry, we don't want to mess this up. So typically the development\nof an HCP can take anywhere from about 18 months to, I would say, 24 months, 27 or so.\nWe would be looking at having submitted something to you as fish and wildlife as that is, you\nknow, sort of the direction that we go.\nIn that general timeframe, fish and wildlife tends to take six to 18 months to approve.\nThere are ongoing discussions to see, is there anything in this process that we can speed\nup?\nIs there something that we can do concurrent with fish and wildlife review or things we\ncan do on the front end?\nBecause we certainly understand that there is a level of urgency there.\nSo why is this not, is this not have to be in statute or passed to the legislature?\nThe incidental vehicle?\nThe general concept of HCP and making that decision for the farmers of the state of Georgia.\nThat was not the process that was completed with the 2000 HCP for the Red Cockade Woodpecker.\nSo my interesting is that that is not the standard process.\nWe do understand that this affects a lot of stakeholders and that is why this is a very\nstakeholder driven process with a lot of conversations, a lot of folks at the table because EPD would\nnot be in the best position to make decisions for farmers, we are in a good position to make\ndecisions with farmers.\nI didn't know about it.\nSenator Samson, did you have?\nOh, hold on.\nSam, Sam, hold on just a minute.\nI'm sorry.\nNo, I got to send it to Watson.\nYou go ahead.\nthe compliance. What was, we've been collecting the data. We know what it is. They're pumping.\nThey're going to keep pumping. Why can't we at least bring everybody into compliance?\nYeah, it's, it's, it's an extremely hard issue. You know, I don't want to set up a regime\nwhere the best way for you to be able to irrigate your field is just to go out and do it.\nand then EPD will excuse and bring it in.\nSo we had to find a way, I think, responsibly,\nin a way that works.\nAnd again, as Cliff mentioned, a lot of this\nis on the ground, are there other permits\nthat we can, that you may possess, that we can modify,\nmaybe take some acres off over here to allow things like that?\nIt's just a very tough issue.\nJust to say, that's okay, everyone, come on in.\nSenator Watson,\nJudd Turner is in the audience.\nMr. Turner, would you mind\nI understand you were the director when the moratorium was issued.\nWould you mind coming forward or do you have anything that you would like to share?\nThank you, Mr. Chairman.\nYes, sir, it's been a good discussion and I appreciate Senator Watts and your questions\nand yours, Mr. Chairman.\nWe give, I'll just say a couple of things about how we, where we were when I was director,\nwhich I took that job on January 1, 2012, and we did this moratorium again in the summer,\nand it was the second year of what would be a historic drought for Southwest Georgia.\nI mean, we talk about 1954 as the drought of record for one year, but if you look at\nthe back-to-back nature of 11 and 12, we consider that the drought of record.\nI was, I'm from Albany originally and have family over in Arlington and in in in Calhoun County\nand I know my dad was driving down Highway 62 and called me in that office over there and\nsaid, Hey, I just drove over itchway notchway Creek and I've never seen it that low and\nI went down the hall and talked to one of our guys and said, Hey, what's the gauge at\nMillford show?\nThis is the winner, right?\nit in the summer and it was four CFS flow. And the drought of record 1954 before we had\na lot of irrigation, it was 120 CFS. Now we're in the middle of litigation with Florida,\nbut I want to make this point really clear, if George's, and this gets to your question\nMr. Chairman, if Georgia's state lines went all the way to the Mississippi River and all\nthe way to Gulf of Mexico, we should still be doing a habitat conservation plan and\nwe should have still said time out on new wells to get our hands around this because\nthe four CFS at Milford should scare, I understand there are federal muscles at issue, but that\nThat should be a challenge and a problem for all active farms in the region.\nThat's not a secure source of water, and we got a lot of surface water irrigation guys.\nAnd so that's how it started.\nAnd yes, it's taken a long time, and I don't have all the metrics about how to get there.\nI do think this, though, about the Habitat Conservation Plan, Senator.\nWe did do two versions of a planning grant from Fish and Wildlife for Habitat Conservation\nPlanning in about 2012 and 2013 where we were looking at feasibility and a lot of the\nother things were going on and we were coming out of the drought and we got some good muscle\ndata during that point and so we were thinking about that.\nAnd it's easy to go on Fish and Wildlife's website and sort of look at a Habitat Conservation\nplan in a vacuum and think well wait a minute how does this work with what we're trying\nto do and how would the moratorium work but I see it and in full disclosure I'm working\nwith the water center on this project really my role is if we get around to a habitat conservation\nplan we put something together and we're going to present it to fish and wildlife that's\ngoing to be a lot of the work I do but um center you ask about well wait a minute when\nAnd at what point do we cross a line where this body should be way and in a water policy?\nI mean, my answer to that is it kind of depends on what's in the plan.\nThere are habitat conservation plans that are quite small that are approved by Fish and\nWildlife where two landowners get together at a very, at just two of them and decide to\ndo something voluntary and it helps a critter population and Fish and Wildlife approves\nit.\nYou know, that's not what we're talking about here.\nWhat we think we have the potential to do here.\nAnd again, what the federal money did with ARPA\nis it let the state do something.\nWe've been talking about no and we needed to do\nback to Cliff's point about stream flow benefits\nor flow benefits.\nWe've kind of known one of the best things we could do\nis do this source switching during a drought\ndrought from the surface water to groundwater.\nAnd so, to defend EPD for a second, the ability to adjust the moratorium, not just in a\nvery limited way based on the data we have now, but in a much more comprehensive way when\nwe consider not just can we afford to put two more straws in this acreage right here.\nBut if we're moving these guys down, getting that benefit from stream flow, if we're looking\nAnd these other management practices, if we're revitalizing the Flint River Drought Protection\nAct so it works and folks can voluntarily suspend irrigation during droughts in the auction\nfunction and is working when all of that's in a plan and I can't tell you, there's no\nplan in the drawer or anybody's hiding.\nYou've got to go through the stakeholder process that Anya just talked about.\nBut in that process, if that, there could be ten different plans we could all have on\nthe table.\nAnd they all aren't equal.\nI mean, some of them are going to cost more, some of them are going to have more benefit\nin the river.\nBut for the folks who have been working on this for a long time, and really the way the\nHabitat Conservation Plan got re-kicked off, because we've talked about it all these years,\nbut the lady, I'll put President McCall on the spot when he was Chairman McCall and\nChairman Wilkinson in the Senate they in 2017 so we're in the middle of the\nlitigate into the litigation where they had a joint ag committee meeting in\nPerry and all the directors but one were invited and we all talked about this\nissue we had this conversation in 2017 and the takeaway was we really ought to\nget back on this HCP because it's the vehicle to look at all this stuff so\nthat when we open back up to the extent we can, we know we can't just say remember 4CFS in 2012.\nIf we have another 2012, 4CFS at Milford, that's what's going to happen without adding new irrigation.\nSo the problem is how do we get to add some new but also protect the sustainability of what we got\nand protect these critters because they present a risk. So back to the point about what's\nAlabama and Florida doing, if their critters get in the way they could have trouble, but\nright now they don't have that problem that we have.\nSo that's why we got to kind of do this if we're smart.\nAt the same time, if we do it under the umbrella of this HCP, open stakeholder process is going\nto take us a while to model all this stuff, but the bricks are laying around in the yard.\nWe got more data for an HCP than probably any state in the country.\nSo I'm real bullish that this is going to work, but if there's something that changes that\nneeds to be implemented that requires a change in law or policy, it would require coming\nback here.\nSo it kind of depends, answer your questions or kind of depends.\nBut I know this HCP cannot be fully understood.\nAnd when I was director, I, EPD was, you know, WRD had that planning grant in 2012,\nso my cousins inside the DNR family really were the grant recipients, and EPD was\nprecip, you know, participating as the regulatory authority for AG.\nBut now we've got, because of the RPR grant, we just have this opportunity, but to answer\nyour question, if we didn't have the RPR money, there'd be several of us still saying based\non 2017. This is this is what we need to do. And I think Farm Bureau who've been\nreal educated on this and these guys can I don't want to speak for them but I'll\ntee it up. I mean they have a policy that really has looked at this and said it\nwithin the moratorium we ought to we ought to look at the moratorium adjustment\nwe ought to do it inside an HCP. And Mr. President I don't want to speak for you\nbut I think that's accurate on the way you're.\nI don't want to see another one.\nYes, sir.\nSo, Mr. Chairman, thanks for the recognition,\nbut I've blathered on, but any questions or anything,\nI'm happy to try to answer.\nAny member of the committee on this?\nSenator Watson?\nSo if it's such a great plan, why were we not asking\nfor the money earlier?\nWe kind of did not from the state money\nbecause we did have, we just took the time to,\nI mean, the tri-state litigation\nwas, calls us to pause a lot of work.\nBut we immediately were trying to work on\na habitat conservation planning\nthrough the Fish and Wildlife starting last year,\nthe minute that we could.\nAnd then the ARPA money was there\nand that was really a governor's office conversation\nthat kind of came along.\nSo why is there not more education about this subject home?\nY'all's Water Policy website or EPD's website?\nI think that is it.\nYour other website or somebody's website?\nWell, I think where people can be.\nYes, sir.\nI understand what's going on.\nI think that is a great takeaway.\nI mean, I think I won't speak for EPD,\nbut on the Water Policy side, the Georgia Fit website\nreally talks more about the art of funding to move folks down.\nAnd I think we need to move up some of the ACP.\nI think that needs to happen.\nEPD can talk about it.\nTalk about it.\nYou get something up there.\nSenator.\nAnd then Farm Bureau, I do think you guys have got a fair bit of material on HCP.\nI mean, it may not be front page of your site, but we all can, I think, take that advice\nthat we really need to elevate that publicly available information, for sure.\nAny other questions from members of the committee, I know that I was getting late thank you all for coming today.\nThank you for taking time to talk with us.\nI've certainly learned a lot, had a lot of discussion.\nI will say this though, and obviously, you know, I'm a farmer and not a water specialist, but a geologist.\nBut I would say this, the way things stand today, I would\nsure hate to know that my granddaddy bought his farm in\nequipment county, Georgia, and instead of buying it right\nacross the line, and you follow Alabama in terms of\nproperty values and what it means for being able to\nutilize the resources under the ground.\nThat's one of the things that I, having a hard time\nwrapping my brain around, but I do appreciate what\nwhat you do and I appreciate that I certainly don't understand what all you do.\nBut I do think that to Senator Watson's point, I think it would be very helpful to them\nand they're a job that they do in representing their constituency to get some more information\nout of these folks so that they can see that maybe y'all are going to land this plane\nat some point, honestly, because I can tell you, I don't even represent their district\nbut just as serving as a chairman of this committee\nand being a farmer myself, the amount of text\nand phone calls that you get from folks in that part\nof the world, and I'm sure you all deal\nwith that, you're sales.\nBut a popular guy down there.\nSo we do appreciate it.\nI know we've taken an hour and 15 minutes of your time.\nThank you for coming in.\nWe appreciate it.\nAnd wait a minute, we have, we have all Jasper.\nGo ahead, Senator Hatchett.\nThis is the first time I've had a former law professor testify\nin front of a committee that I'm on.\nHe taught me water law at UGA.\nYeah, we should talk more about this, shouldn't we?\nWell, I will tell you, I am not an attorney,\nbut I did watch a lot of Matt lot when I was growing up.\nBut thank y'all for being here.\nI appreciate your time with that.\nThis meeting is adjourned.\n",
  "updated_at": "2026-02-12T03:11:16.423211+00:00"
}