{
  "video_id": "pH60UVae4Og",
  "url": "https://www.youtube.com/watch?v=pH60UVae4Og",
  "title": "Crossover Day 2025 | How a Bill Becomes a Law",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 2025,
  "video_date": null,
  "duration_minutes": 1,
  "summary": "Overview: The transcript does not contain any substantive legislative actions or notable moments. It appears to be a generic placeholder text without any specific details about a Georgia legislative session.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments: None detected.\n\nVotes: None detected.\n\nAttendance: No quorum notes provided.\n\nAdjournment: No adjournment time or next session date mentioned.",
  "transcript": "So long, long journey to the capital city, it's a long, long wheat while I'm sitting in\nYou're merely, but I know I'll be a lost someday, it's now, in the morning.\nAll Senators who have bills and resolutions introduced, please bring them to the Secretary's\nDeaths.\nFirst reading and references the Senate Bill's Secretary Read the Caption.\nSenate before, by Senator Bolesal, the 27th and the others.\nHi, I'm President, Senate Bill 54, right?\nI'm not going to have public comment.\nSo I'm in favor of the bill as amended.\nSecretary of Rear Reports is standing committee.\nTo send it with the final recommendation,\nsome bill 102, do pass.\nAnd on eight instructions.\nAll right, Senate bill 124, covered it.\nWe covered it.\nThese recommends this bill to pass.\nIt's like we submitted it to a Watson chairman.\nLike the taxpayers pay.\nIt's not good for us.\nAnd as far as y'all are in hurry, I'm in hurry.\nBut when I was a young man,\nI indicated in committee in response to my question that\nWe have no questions.\nAll the passes of the bill, yeas are 56, and yeas are 0.\nThis bill hammered a C-Rex with constitution majority is their 4-pads.\nWoo!\nWoo!\nCome in.\n",
  "updated_at": "2026-02-12T18:55:05.606454+00:00"
}