{
  "video_id": "PHhO62yduPk",
  "url": "https://www.youtube.com/watch?v=PHhO62yduPk",
  "title": "Sen. Jones & Sen McLaurin Press Conference on Free Speech | 9/25/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 19,
  "summary": "Here is a structured markdown summary of the Georgia Senate Jones & McLaurin press conference on free speech from September 25, 2025:\n\n**Overview**\nSenators Jones and McLaurin, along with advocacy groups, condemned the Trump administration's ongoing attacks on free speech and the lack of action from Senate Republicans to defend the First Amendment. They highlighted specific cases of viewpoint discrimination, media censorship, and the targeting of activists and dissenting voices.\n\n**Key Actions**\nNo specific bills were mentioned.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Sen. Jones detailed how the Trump administration has \"weaponized the FCC\" against media outlets, sued law firms over clients they represent, and restricted discussion of topics like slavery.\n- CAIR representative Asuka Mahmoud described activists being \"abducted\" and detained by ICE for speaking out against the \"Palestinian genocide.\"\n- Sen. McLaurin contrasted the Biden administration's voluntary requests to social media companies to the Trump FCC's threats to force ABC affiliates to \"take action\" against Jimmy Kimmel for his free speech remarks.\n- McLaurin expressed optimism that the American people value free speech and will not \"take this repression by the Trump administration lying down.\"\n\n**Votes**\nNo votes mentioned.\n\n**Attendance**\nNo quorum notes.\n\n**Adjournment**\nNo adjournment details provided.",
  "transcript": "I want to thank everybody for coming as we attempt to bring your attention to the\nactions regarding the First Amendment by President Trump and a lack of action\nquite frankly of our Senate Republican colleagues and the blatant effort to\ndestroy freedom of speech in this nation. Although the FCC attack on Jimmy\nKimmel has brought to light many of these efforts in a more mainstream manner,\nwe have to kind of put these efforts into its proper contacts. It actually\nIt started when the administration reopened complaints against major networks involving\nthe 2024 and 2020 election.\nBut the former FCC heads who actually dismissed those complaints said that this was an opportunity\nunfortunately to weaponize the FCC against the First Amendment.\nAnd that's why she dismissed them.\nBut that's exactly why they were re-broad open as to use the FCC as a weaponization project\nagainst the First Amendment.\nBut it continued when President Trump actually brought suits against law firms, actually told\nlaw firms that they would be punished for who they actually had been suing or what causes\nthey had actually undertaken.\nIt actually continued, of course, with the defunding of the corporate corporation for public\nbroadcasting.\nIt also continued, but the fact that we now basically cannot discuss one of America's\noriginal sense, slavery within the United States.\nWe continue, of course, when we have students who have been picked up and imprisoned for\nnothing more than exercising their freedom of speech.\nAll of these things have been built up to what we came with far as Jimmy Kimmel's concern.\nSo although that is the mainstream kind of thing that took place as far as bringing President\nTrump's assault on First Amendment really to the forefront for many Americans, this assault\nhas been going on fully and forthrightly since he has been re-elected.\nSo the Senate Democratic Caucus, partners with groups around the state, around the nation\nquite frankly, to stand against this blatant tyrannical power grab by the administration,\nand stand also against the silence and capitulation by the Republican Party in general, but specifically\nby the state Republican Party of Georgia.\nAnd with this understanding of solidarity, and we're now turning the microphone over\nto Asuka Mahmoud, who will also discuss these particular issues.\nIt's Mahmoud.\nGood morning.\nGood morning.\nMy name is Asuka Mahmoud and I represent the Georgia Chapter of the Council on American Islamic Relations.\nSince assuming office in January 2025, President Trump and his admin have launched a dangerous and unprecedented attack\non our right to free speech.\nAnd in just the past nine months, we have seen a dramatic increase in viewpoint discrimination,\nmedia censorship, and attacks on groups and individuals that the U.S. government disagrees\nwith.\nIn March 2025, two activists that spoke out against the Palestinian genocide were abducted\nby unidentified ICE officers under the Trump admins' directives.\nWhile Mahmoud Khalil and Rumezao's torque have since been released, several other anti-genocide\nactivists and other activists and immigrants remain detained simply because of their\nstances on Palestine or immigration status.\nThis is a glaring example of the Trump Admin's wide-ranging attacks on free speech and clear\nviewpoint discrimination.\nThe arrests of these activists are one link in the chain of suppression of society wide\nfree speech.\nThe Trump Admin has barred media outlets from the White House, handed over social media\nchannels to favored owners, so information can be manipulated, forced media personalities\noff air for their views, weaponized our immigration system to target dissent, and threatened\nto use the IRS to shut down organizations that strengthen our communities.\nAs an American Muslim, I remind Americans that minority groups are the canary in the\ncoal mine, that our collective silence when Palestine activists were being targeted is\nwhat led us to this moment and we can protect free speech for all Americans only if we stick\nto our values and protect the right to free speech for all Americans and causes.\nI hope that my words today are not just seen as an alarm bell for the growing fascism\nthis admin is ushering in but also as a call to action for all of us to stand together\nand protect each other in our neighbors so that history remembers us as united against\nrepression and fascism and not divided\nalong political lines.\nThank you.\nGood morning, everybody.\nMy name is Josh McLaren.\nI serve in the state Senate and proud to stand\nwith Senate Democrats today to talk about\nthe importance of protecting free speech in this country.\nMy colleagues have ably summed up the main situation,\nbut I want to be very clear about contrast.\nyou're probably gonna hear from the administration\nor the GOP that, well, government censorship\nhappened under Biden, or they'll claim\nthat both sides are doing this.\nLet's be very clear about the contrast\nbetween what we've seen over the last few years\nand what we're seeing now.\nIn the last few years, there were a couple incidents,\nthis discussion of cancel culture,\nwhere people brought their dollars\nor voted with their feet to support entities\nand businesses that align with their values.\nWhen the private sector engages in free speech\nor disassociation based on values,\nthat's not government repression.\nWhen voters and consumers make choices\nabout who they want to support,\nthat's not government repression.\nNeither was when the Biden administration\nsimply requested or asked social media companies\nto take down COVID misinformation\nin the pursuit of the public good.\nYou'll hear conservatives cite to that example\nas all the other side did repression as well.\nThose were requests.\nThey were voluntary requests\nthat the Biden administration did.\nAnd contrast that with what we're seeing now.\nBrendan Carr, the chairman of the FCC,\nwent on a podcast the Wednesday after the Monday\nwhen Jimmy Kimmel first made remarks.\nAnd on that podcast on a Wednesday,\nBrendan Carr said, we can either do this the easy way\nor we can do this the hard way.\nAnd basically said explicitly that the ABC affiliates\nunder his regulation needed to take, quote, action on Kimmel.\nHe said his name.\nWithin hours of that podcast, that Wednesday,\nnext star and other ABC affiliates\nhad refused to air Kimmel, and then ABC globally\nfollowed suit by suspending him for some period of time.\nNow we've seen that ABC has reversed\nthe Kimmel suspension at the top level.\nThat's tremendous news for democracy.\nJimmy Kimmel got record ratings in the millions\nwhen he made his speech, defending free speech,\nand he got those ratings even though\na large number of affiliates had continued to cancel\nhis show and i think that just goes to show\nthe american people\nvalue free speech\nthe american people want\nvoices like him all to be able to keep speaking out even if not everybody\nagrees\nwith every word that jimmy kimmel says\nand i'm tremendously\nuh... given optimism by this i have a lot of optimism uh... that i take from this\nbecause\nwhat it means is at the end of the day we still have a robust culture free speech\nin this country\namericans are not going to take\nthis repression by the Trump administration lying down.\nAnd we here at the Senate Democrats and our allies here\nin Georgia, we stand with all protectors and defenders\nof free speech, and we will do everything\nin our power at the state government level\nto ensure that people still have the right\nto speak, to express themselves, and to be heard.\nWhat is really troubling to echo our leaders' comments\nis that Senate Republicans have continued to fall in line\nbehind Donald Trump and all of his authoritarian whims.\nAnd it's telling that even people like Brendan Carr,\njust a few years ago, were espousing the importance\nof free speech before now turning their backs on it\nand following the whims of Donald Trump wherever he may go.\nSo we hope, but we haven't seen much evidence of it yet,\nthat Senate Republicans here in Georgia will stand up,\nwill show some courage during one of the darkest moments\nfor free speech in this country's history\nand stand up to the authoritarian influences of Trump.\nBut we're not going to hold our breath\nbecause thus far, through their legislation\nand through their actions and words,\nthe Senate Republicans have continued to tow the line\nto try to be as mega as possible\nand do whatever it is that Trump wants\nbased on his ego.\nThank you for your time.\nGood morning.\nI'm Nan Orock, a member of the Senate Democratic Caucus.\nI represent the households in Senate District 36 across Atlanta in the Tri-Cities area around\nthe airport.\nI'm happy to raise my voice alongside my fellow speakers here standing up for free speech\nand headlining the fact that we hear silence from Republicans on this question, silence\nhere under the gold dome, silence across our city and state, and silence in the highest\nreaches of federal government in Washington, our congressional delegation from Georgia,\nthe GOP congressional delegation standing silent in the wake of this odious attack on free\nspeech that we as a nation have witnessed.\nAnd I will say to you following the remarks that have already been delivered that a whole\nnew section of Americans woke up this week when they realized, wait a minute, that guy\nin the White House is going to say who I can watch on TV,\nand what committee I can tune in for late night humor\nbefore I go to bed.\nAnd that's why you saw across this country\na whole new level of pushback against this administration\nand against this effort to stifle free speech.\nWe're going to see more of that as more Americans take note.\nOh, this is going to impact my life, my day-to-day activities,\nand who I care to listen to, and who I care to life at,\nand who I care to vote for.\nThat, to me, is a lesson that's going to play out.\nAnd we will all stand witness to it\nas the movement against the repressive Trump regime,\nwhich is absolutely taking the fascist pathway.\nThe resistance to that is growing by the hour.\nThank you so much.\nGood afternoon, everybody.\nMy name is Bentley Huggins.\nI use they-them pronouns\nand I'm the Georgia State Director\nof the Human Rights Campaign.\nWe are the country's largest LGBTQ plus civil rights organization.\nToday, I join you with my colleagues to stand in full support of the First Amendment\nand in full support of free speech.\nRight now, LGBTQ plus people across the country, especially trans people, are under attack.\nour lives, our families, our friends, our communities,\nour being threatened just because of who we are,\njust because of what we say,\nand just because of how we wanna live.\nPeople across the country see us in a lot of different ways.\nBut what I want you to know is that we are your friends,\nwe are neighbors, we're people with families, we have pets,\nWe have community gardens, we work in restaurants,\nwe live down the street from you,\nwe're just like everybody else.\nAnd the decision to cancel Jimmy Kimmel's show\nand bring it back is frightening.\nThe fact that the president feels like he can silence\nor censor someone just because he doesn't like\nhow they report on what he says,\nor the fact that he feels like he can control\nwhat is a pinnacle of the American society, free speech.\nThat should wake up everyone.\nThat should shock your conscience\nand to believing that we are in the reality that we sit in.\nThat free speech is under attack.\nThat everyday people are being used as scapegoats\nrather than being seen as the human beings for who we are.\nSo I thank you for coming today\nand I beg you to please support queer people,\nsupport LGBTQ plus Georgians and support free speech.\nThank you.\nThank you so much and with that we'll be glad to open up for any questions.\nAnd let me also bring one thing to everyone's attention, this is a reminder.\nWe actually do have a free speech bill, an anti-free speech bill that exists right now.\nThat's of course the DEI bill that's pending in the House to pass the Senate that says\ncolleges can lose funding if they basically have solidarity towards certain groups.\nAnd we already know that Republicans have already stated that they are against speech.\nLet's don't forget that.\nRemember we battled that bill all night almost in the state Senate and Republicans voted\nfor that bill.\nIt is now sitting in the Georgia House as far as colleges could actually lose funding\nas far as DEI's concern.\nSo we already know kind of like we're Republican stand on the issue of free speech.\nAnd so I did want to kind of bring that out to everyone's attention as a reminder that\nthat bill is sitting there.\nSo when we start talking about what position that we're going to have in Georgia as far as\nfree speech is concerned that bill needs to be defeated and so that's actually\nnow in the Republican led House of Representatives we'll see what they do\nwith it we know how Democrats stand we voted against it we know how\nRepublicans in the Senate stood they voted for it was now found out how\nRepublicans in the House stand for free speech without open up for any\nquestions but I know you do have one off topic which is perfectly fine\nThe fact that the pathways has been extended, we have a, what we've been describing so far\nwith how many months now we are into this administration, failed administration, supporting\nthe failed policy quite frankly.\nThat's basically the way you should look at it.\nhas become woefully and adequately improved and be woefully\nand adequately as far as ensuring Georgia's.\nWe still have over 400,000 Georgians\nthat would not be insured because we refuse\nto do Medicaid expansion.\nTo what we're basically looking at, as I said,\nfailed president supporting and failed policy.\nSo it's no real surprise there to continue promoting\nthese particular policies that will not work for Georgia's.\nAnd so on one level, we were glad that a few people\nthat get coverage through that is great,\nbut on this more substantive level, quite frankly,\nit is woefully and adequate.\nWe've been saying that for years,\nand I will repeat that again.\nFail presidency actually represented a failed policy.\nYeah, what happened?\nAbsolutely, yeah.\nI'll just add briefly, there was recent reporting\nthat the pathways program is costing more\nin administrative costs than the actual amount of dollars\nthat is being doled out for care.\nSo when you look at the historic cost ratios of programs\nlike the Social Security Administration, for example,\nhistorically, gives out its benefits\nfor less than a dollar overhead out of 100 bucks.\nThis is a woeful comparison where you have even more on overhead than the actual cost\nof care itself.\nI mean, that's a totally remarkable stat that everybody should hear about.\nAnd I think that it's telling that these are not unconnected conversations.\nI'm going to make the argument that's not off topic because a lot of the drama that's\nhappening at the federal level with this, these attacks on free speech, these culture\nwars, we just, there's breaking news that the DOJ is now pushing to investigate the\nSoros Foundation, which essentially is taking orders from Trump and Vance, who have identified\nSoros and Ford as enemies.\nThat type of culture war is meant to distract from policy failures.\nIt sounds like a talking point, but truly think about the air time that gets sucked up\non these culture wars and these attacks on basic constitutional rights.\nMeanwhile, hundreds of thousands of Georgians don't have health care, and the lackluster\nprogram that Brian Kemp has put together and swore to everybody would be just as good\nas Medicaid expansion is spending more on overhead than on people.\nSo I beg to differ, I appreciate the respect of saying off topic, but these are all one\nconversation, which is that we have failures in government at the state and federal level\nthat would be authoritarian leaders are trying to cover over with shock and awe to attack\ntheir political enemies.\nwith that. Any other further questions? Absolutely. Come forward.\nThank you, Leader Jones. Let us not forget that on the federal level, as we speak,\nObamacare covered 20 million additional people with health insurance and access to health care.\nExtending that beyond its present time has been canceled out with the GOP in Congress\nin the House blocking that money.\nSo we will see devastation, devastation on every side to our health care systems across\nacross the country and to the health of our folks here in Georgia and around the country.\nAnd two hospitals announced down in Evans, Georgia and up in North Georgia, teetering on\nthe brink will not be able to survive the cuts that are coming from the GOP's federal\naction.\nAll of this run at flowing downhill from a Trump administration that is showing us loud\nand clear, anti-free speech, anti-health care, anti-hospitals, and the list goes on.\nSo America was waking up, Georgia is waking up.\nAnd with that I want to thank everyone for coming out.\nThank you so much.\nThank you.\n",
  "updated_at": "2026-02-12T18:39:58.913582+00:00"
}