{
  "video_id": "PlLsDdnxG9E",
  "url": "https://www.youtube.com/watch?v=PlLsDdnxG9E",
  "title": "House Afternoon Session For Day 28 of the 2025 Legislative Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 263,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House Afternoon Session transcript:\n\n# Georgia House Afternoon Session - Day 28, 2025 Legislative Session\n\n## Overview\nThe session focused on discussing and debating Senate Bill 1, known as the \"Riley Gaines Act\", which aims to maintain fairness in female athletics by eliminating the potential for male advantage. There was extensive discussion of the bill's provisions and comparison to a previously passed House bill on the same topic.\n\n## Key Actions\n**SB 1**: Riley Gaines Act - Maintains fairness in female athletics by eliminating potential for male advantage and protecting female spaces during sporting events.\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Extensive debate and questioning of the bill sponsor, Rep. Bonner, on the need for the legislation and comparisons to previous House bill.\n- Recognition of the work by various legislators, including Sen. Dolezal and Lt. Gov. Jones, in crafting the bill.\n- Speaker Burns praised for leadership on providing a level playing field for female athletes.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nTranscript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you House will come to order. We have fall up on some business that we started this morning. Chairman Hatchett is recognized for a motion. Thank you Mr. Speaker. I move that this House insists on its position and appoint a conference committee through House Bill 68. Thank you, sir. Mr. Clerk, will you read the caption? House Bill 68 to be taught on act to make and provide appropriations for the state fiscal year beginning July 1st, 2025 and ending June 30th, 2026. His objection, hearing none, the House has insisted on its position to House Bill 68. I'm going to appoint a committee on conference now. They will be representative Jones of the 42nd, the pro-tem of this House, representative illustration of the 104th, the leader of this House, majority leader and of course Chairman Hatchett with the 155th House District as a committee of conference on House Bill 68. We have insisted. Members, a local calendar, the supplemental local calendar is headed to your desk right now. We will take it up before we move on to other legislation.\n\nOkay members. We're going to move on to the rules calendar. We're going to move on to the rules calendar. We're going to move on to the rules calendar. We're going to move on to the rules calendar. Okay. If you have some extra conversations I hope you will be willing to take them to the any room if they're that important so you can hear each other. We're going to have order in here. Members will deserve to be heard on this important piece of legislation. Representative Bonner is recognized to speak to SB1. Thank you Mr. Speaker. I'll exorbitize today to present Senate Bill 1. Senate Bill 1 represents years of work by members of this house and the Senate. Intense scrutiny by Senate's study committee led by Senator Dolezal and hours of testimony and debate in both chambers. It is a narrowly tailored common sense bill that achieves the goal of maintaining fairness and female athletics by eliminating the potential for male advantage and protects female spaces during sporting events. Senate Bill 1 incorporates many of the provisions of House Bill 267 we passed just a few weeks ago. And Mr. Speaker I will keep my presentation brief by highlighting just a few of the similarities and differences. First Senate Bill 1 incorporates the naming convention we adopted with the title of the Riley Gaines Act. In fact we entertained briefly changing the name to the Gavin Newsom Act following the governor of California's recent support of keeping biological males out of girls sports. The bill includes a more comprehensive definition of sleeping quarters found on lines 86 or 89. And then Senate Bill 1 removes the language regarding birth certificates but maintains the language we adopted regarding medical record reviews and standards school medical procedures. Additionally Senate Bill 1 incorporates the House caviar's regarding those authorized to be in the locker rooms, restrooms and changing areas. In House Bill 267 we established the Professional Standards Commission as the first line arbiter of complaints and investigations. Senate Bill 1 relies instead on an existing complaint standard currently in use today and includes a number of appellate deadlines. The private cause of action remains the same for both bills. The most significant difference in the bill is that Senate Bill 1 does not include any of the code or vision language found in House Bill 267 and represents a bill solely focused on female athletics. Colleagues the bill before us today provides an opportunity to provide a level playing field and ensure fair competition for female athletes in Georgia. With that Mr. Speaker that is the bill and I would be happy to stand for any questions. Gentlemen has a couple of questions and then we have speakers on the bill. I will recognize Ripley Remind to your left up of the Senator Al for question. Thank you Mr. Speaker it is a gentleman yield. I do. Thank you. So we have been talking a lot about this issue over the past duration of the session. How many trans athletes are there in the state of Georgia? I do not have that information. Got it. And do you further yield? I do. Thank you. So we have talked a lot about certain athletes particularly those that have come down to lobby on bills like this. For my understanding that athlete did in fact tie with her trans counterpart because there are frankly very few trans athletes and they are not very great. They are great for their division but not necessarily better than their counterparts. So when we talk about protecting girls sports why was there not more of a focus on things like athletic facilities making sure they have equitable access to coaches and things like that? Well that is certainly an issue that I am concerned with and look forward to working with you in the future on a bill that addresses just that. Do you yield for one more question? No. Okay. Thank you Mr. Speaker. Jim, I have a couple other questions. Representative Rice to your left. I have a question. Thank you Mr. Speaker. Does the gentleman want yield? I do. Is it not true that preserving distinct male and female sports teams this bill protects the opportunities, scholarships and the safety of female student athletes across Georgia? Absolutely. Thank you for the question and I think this bill directly speaks to the title non protections that were so hard fought. Gentlemen, do you yield for another question representative Fry? Yes. So your left up front is recognized for a question. Gentlemen recognized. Thank you Mr. Speaker. Is it gentleman yield? To my friend I do. Thank you my friend. This isn't an antagonist question but isn't it true that Riley gains came in fifth place. Fifth place was defeated by four other women and she was upset she didn't get a participation trophy by time for fifth. Isn't that true? I won't dispute the I know that she won some other competitions. I do know that she may have placed in a different in fifth as you say but here's how I would address that though is that this is not a one for one. So it's not as if a biological male that wins a competition against a biological female. It's not a one for one swap. So that biological male knocking one female out of a top spot in fact shifts everybody down and pushes many many females down the line out of those out of competition for metals for titles and things like that. So. Reps any Corbett to your right? Is recognize request. Thank you Mr. Speaker. It's gentleman yield. I do. Is it not true that women's sports are not a backup option for mediocre male athletes? I would completely agree. Thank you for the question. I'll stand for one more Mr. Speaker. Okay. I'll see now you have you have a couple more. Representative bullets and his light on light on so I'll go by that. Representative golet is recognized for a question. Thank you Jim and yield. I do. Isn't it true that this bill just really reinforces that female athletes have a fair and safe athletic environment to play in? Absolutely. All we're looking for is simply a level playing field. A female athlete steps on the playing field that there is no advantage other than fair and clean competition. So with that Mr. Speaker I was certainly yielded well. I encourage my colleagues the yes vote. I would also Mr. Speaker just take a moment to thank all those that have had a part in this. This has been a multi year effort by a number of house members and senators. I'd like to thank Senator Dolezal, Lieutenant Governor Jones, Chairman Chris Irwin and his committee for helping guide this. And then lastly you speaker burns for your leadership on this issue and providing a level playing field for female athletes in Georgia. And with that I'd ask your favorable consideration. Gentlemen, yielded well. Okay, here's our posture. We have a number of folks that are interested in speaking to the bill. We have chairs, time and minority report as well. So I'm going to give up to 40 minutes to those opposed and those in favor of the bill that will be allocated. The speakers will allocate their time up to 40 minutes and we will begin our discussion on those opposed to SB1 by recognizing representative Lopton. Do you have the lady in your well, your attention to representative Karen Lopton has recognized to speak to the bill. Thank you, Mr. Speaker. Come on folks, so I have to come down and speak about this again. Okay, you don't want to hear it. I don't want to have to say it, but here we go. I've been called upon. This is my job. I sit on the education committee where SB1 came through, where the comparable HB bill came through. I've heard people speak to it. I've heard people speak against it. And I, especially in this last committee meeting, I've really noticed something very distinct about who was speaking for and who was speaking against SB1. Now, if this is such common sense, if this is so needed, if this is a shield for girls in sports, you'd think that there'd be lots of coaches, lots of schools that run sports programs, lots of athletes coming up, storming the castle and saying, oh my gosh, we need this now. And instead, the people who spoke to the bill were athletes who are currently competing with and against transgender athletes. We had clergy speak against SB1. We had parents of transgender children speak against SB1. Not a single coach, not a single athletic organization, not a one, zero, which, incidentally, is the amount of transgender students competing in K through 12 sports in Georgia, zero. So, who spoke in favor of it? Two right wing organizations. The faith in, oh gosh, the faith in freedom coalition and frontline. What the heck do they have to do with women sports? This is why the last time I got up here, I dragged y'all about the Bible. Because if the only people you've got to speak to this bill are religious rights, and one of them categorized as a hate group by the Southern Poverty Law Center, if that's the best you can bring, don't think we're accomplishing safety in women's sports. But we're accomplishing is a right wing political theological agenda being woven into our code and letting transgender people know that they are sinful, wrong, and not welcome in Georgia. Now, it's true that Riley Gaines, who this bill is named after, spoke for this bill, the only athlete that we heard speak to the bill by the by. Now, this bill is SB one, SB one, we know that to get to that number, number one in a session, in a legislative session, when we're dropping legislation, you got to be purposeful to be number one, you got to be purposeful and on the ball. And there, when the opportunity opens for us to drop legislation, SB one, priority. What is HB one? HB one is a democratic bill called the Pediatric Safe Storage Act. That's what we rushed to this house. That's what we brought, a desire to protect our students, a desire to protect young people from making a tragic mistake that harms them or others. That's what Democrats brought you. This is SB one. SB one, the Senate's first priority is a problem that does not exist, because you must get your message out that trans people are not. Welcome here. We get it. Trust me, they get it. Okay, my daughter has many friends that are transgender. She's a gentle soul. She drives, she kind of draws these people to her. And one of them shook my hand the night I won this seat the first time and said, thank you. I'm glad that you won. I know you'll stand up for people like me. Another friend of hers was relaxing at our house one night. She came, she's a tenant, my daughter's a Kennesaw stage, came home with some friends. And this was after last session's big trans hoopla. And she said, I feel like my state doesn't want me to live. And I said, well, they sure are not supporting you. So, one, the NCAA has changed its policy on transgender athletes. The IOC has rules in place that deal with transgender athletes. The Georgia High School Association has rules that deal with transgender athletes. I question why we must double down and triple down. They have not asked us for this. Now, 16 female athletes in the NCAA signed on with Riley, with Riley, gains, thank you, with Riley gains for her lawsuit against NCAA. Okay, 16. In response to that lawsuit, over 400 NCAA professional Olympic Paralympic athletes, over 400 signed an open letter to the NCAA saying, please just leave trans folks alone. We'd really rather you focus on something else when it comes to inequity in women's sports. Like perhaps the fact that 21% of women and 11% of young men say they have been sexually abused, sexually abused during sports when they were young. Now, that's a fire alarm. Okay, that's a problem when 21% 1 in 5 women are being sexually assaulted while they play sport. It's not trans athletes that are doing that to them. So I am actually proud to stand against SB 1. I would ask that if you want to govern by the Bible, I mean go all the way. Go all the way to love your neighbor as yourself. If you want to govern by the Constitution, fair and equal treatment before the law is our goal. What's our goal? What's our goal? Thank you, Mr. Speaker, I yield the well. The lady is yielded the will. Reps. Jasmine Clark is recognized. Speak to the bill. Reps. Clark. Thank you, Mr. Speaker. Colleagues, today I rise to ask you to vote no on this bill because this bill does not make our children safer. This bill is a license to harass, to bully, and to harm. And if you don't believe me, let me tell you the story of Amy Tom. So who is 22 years old when this happened? Amy sports a pixie cut. I don't know if any of you all in here have a pixie cut. It's a short haircut. She was followed into the bathroom at her job by a man yelling expletives at her telling her that she doesn't belong and that she's disgusting. And you know why he did that? It's because he thought she was trans. She is not trans. She assisted gendered. She just didn't happen to look girly enough for him. And he felt like that gave him the right to harass her. This is the type of harassment that we would be inviting into our schools. Let me tell you the story about Jessica Rush. Jessica Rush was accosted in a restroom at the Baylor Medical Center at a hospital because she was dressed in basketball shorts and a t-shirt. The man admitted multiple times that he thought she was a boy because she was quote dressed like a man. So a person can't go to the hospital to visit their loved ones dressed in a t-shirt and basketball shorts without being harassed because they don't look girly enough. Do you have to wear a dress in order to not be harassed? Kaleia Morton. She was approached in a restroom in Arizona by police, by police officers. And let me be clear, male police officers. After a store employee assumed that she was trans. So two male officers came into the women's restroom, shined a flashlight into the stall where she was sitting down urinating. Shined a flashlight in there and demanded that she come out of the restroom. When she came out, she literally had to lift up her shirt and expose her breast, expose her breast to prove that she was a woman because someone assumed she was trans and felt like that was a woman. And felt like that was license for them to send the police after her. Do we want girls in our schools having to expose their bras or their breasts to school resource officers to prove that they are girls? And I keep hearing how this bill is supposed to create an even playing field. But I want to introduce you all to Macbags who did not ask for this spotlight but it came upon him. He is a trans boy. And because of a similar law that passed in Texas, Mac who begged to compete against boys because he is a boy, Mac was told that he had to compete with the weight class and the sex that was assigned on his birth certificate. And so Macbag did not know what Mac had to do. That's Macbag right there. They made Mac compete against girls. And he won. He won fair and square. Mac had been transitioning. Yes, he was taking testosterone. But what happened in this instance was the bill that we are asking for today. And Macbag did not know what Macbag did. Mac was actually made parents even more upset because now they are like why is this boy competing against my little girl. And they said it's because it's the law. That's what this bill is doing. This is not quote even the playing field. It's a license to harass, to bully, and to harm. Also this bill and similar bills like it completely leave out individuals in our society that are intersex. And because nothing that you will learn at the end of this session, you will learn that intersex people do exist. And sometimes people have ambiguous genitalia. And sometimes that means that when they are born, their parents get to choose. We're going to decide that she's a girl. We're going to decide that he's a boy. And they have no idea what that individual will grow up to decide or feel like when they get older because they have a mixture of both. And bills like this completely erase them off the planet. I'm actually not sure. And I have not been able to get a solid or straight answer from anyone as to what sport a intersex individual actually gets to play. Do they get to play with girls? Do they get to play with boys? It's so unclear. No one has been able to answer it for me. So how do I tell my constituents that are parents of intersex individuals or people who have genetic sex disorders? How do I tell them where they fit? Because according to this law, they don't exist. And that is just not right. So unlike many in this chamber, I am a parent. And not only am I a parent, I'm a parent of an athlete. She plays basketball. She runs track. She's played soccer. She's played volleyball. She is an athlete by all means of imagination. And she's great. And so I asked her. I said, baby girl, how do you feel about this war on girl sports? Because it's the talk of the town down at the Capitol. But since you're playing in sports, I would love to hear your thoughts on it. And she looked at me, confused. And she said, mom, what are you talking about? And I said, you know, the war on girl sports, the one where y'all are so worried about the trans athletes, you know, bumping you out of contention or. And she said, mom, no one, no one is talking about that. Y'all are talking about that. We are not talking about that in the locker room. And so we have created a bill that is a license to harass a license to bully a license to harm. And these actual athletes do not want this. They did not ask for this. And I think that that is a problem. I think that if you truly care about all of your constituents, then you would ask them, you would actually ask the people that would be most impacted by this bill. And the ones that are most impacted are saying, we do not want this. So I'm going to leave you all with this. If you would like to see trans boys competing against cisgender girls, which this bill will do, then you will probably go ahead and hit the green button. If you are okay with police officers making your daughter or your friend's daughter, your niece, your little cousin, expose their breasts to prove they are a girl, then you will push green on this button. But if you actually care about your constituents and you understand that laws like this do not actually make anyone safer and it's just a license to harm a license to bully and a license to harass, then you will vote no on SB one. Thank you, Mr. Speaker. I yield the well. The lady has yielded the well. Representative Eric Bale is recognized to speak to the bill. Representative Bale. Thank you, Mr. Speaker, for being a knowledge. Today, colleagues, I rise in the opposition of SB one, the so-called Rally Games Act, because it is not to govern by truth, but it's political clout. I stand here as a heterosexual, cisgendered man, who sister didn't fit the mode of what some call or some say is a woman. She grew up wearing sneakers instead of heels, playing basketball with the boys instead of jumping rope with the girls. And guess what? She is still a woman. Still is a child of God. And still, fearfully and wonderfully made, Psalms 139 verses 14 says, I praise you for I am fearfully and wonderfully made. Wonderful, or your works. My soul knows it very well. But like this bill, that is not affirmed the truth. This doesn't uplift anyone, but this bill, laws like this, says a message to some of our kids that they do not belong, that some kids deserve the same opportunities, that some kids deserve to be punished for just existing. When some of these kids are the very kids that have been victims of traumatic past, both previously and now. And for what? Why are we doing this? For political points, headlines, the next position we want to run for, a distraction. Let me talk facts. So let's talk about it. The Georgia High School Association already prohibits transgender athletes from competing in sports outside their biological sex. So what would this bill do? The NCAA has already made it clear that the rules of eligibility, and right now it is very, and right now at this very moment, there is no transgender athlete competing in Georgia's public schools. So if this is about fairness or not, if it's about protecting our children and protecting our students or not, if it's not about addressing the real issues, then what is it really about? This bill solves no problems because no problem exists. Let me repeat, this bill solves no problem because no problem. So what does this bill do? What does SB1 actually do? Invites costly unlimited lawsuits against our schools. A student can be sued, a student can't sue a school for anticipated horror for something that hasn't even happened. Schools can be sued for emotional distress with no clear limits. And for what? Yet just weeks ago, we stood here holding that tort reform was our number one priority. That was to protect businesses from excessive lost pursuits.\n\nfor protecting businesses from litigation, which was good policy, then why is exposing schools to litigation acceptable? So I ask, why do corporations get protection, but not public schools? Why are public schools left holding their handbag? And for what about protecting women's sports? Let's be real. This bill does not protect female athletes. It endangers them. If it were to, we would be talking about equal funding, better facilities, more scholarships, but we're not. Because here's the truth. Meant sports receive more resources, more funding, and more attention than women sports today. That's the real inequities in athletics, but instead of addressing that, we are debating manufactured crisis, one that does not help women at all, when it does not protect girls at all. This bill isn't about fairness, it's about fear. But instead of solving the real issue, we're spending more time on political stunts. Georgia's family sits us up here to solve real problems. Problems such as affordable healthcare, affordable housing, school safety, economic opportunity, but we're here dealing with women's sports. Instead, this bill is about distraction. This bill is nothing more, this bill is nothing more to improve our schools, our community, our economy, only in safety. It's about furthering political pundits. It will drain money from our classrooms and put us in the courtroom. It will send a message that's already heard today that vulnerable kids are not welcome, that vulnerable kids in Georgia are unwelcome. And to what point, to the point of division that advise us instead of brings us together? And for what, to make life harder on children? Is this what we're doing? As a man of faith, as a brother to a woman who is different, but no less worthy, and as a legislator, who is sick of oath to serve all people of Georgia, I cannot stand by and support this bill. Matthew 25, verse 40 says, truly, I tell you, what you do for one of the least of these brothers and sisters of mine, you did for me. Let's be judged by how we treat the least of thee, not by how we play political politics, how we play politics. And I refuse to stay here and watch children become political, become collateral damage in a political game. Because my faith teaches me something different. My country tells me something different. My sister's life, her strength, her resilience, her worth, has taught me something different. So let us, let's ask ourselves, when the history book looks back at this moment, how will we be judged? Will we be judged by the legislature, their further victimized victims, or will we be the ones that ended poverty in Georgia? Will we be the ones that solve homelessness, or will we be the ones known to play politics? So let's say, let's do the right thing. It's our time to do the right thing. But we have to vote no, and we have to vote no now. For just for clarity, Vanderbilt has done a study, this show that 83% of LGBTQIA individuals have suffered some type of drama, whether it's been physical or sexual abuse. And here we have a bill that further victimizes victims. With that, Mr. Speaker, urge this body to vote no, and I'll yield the well. Thank you. The gentleman, as you are the well, Representative Cannon has recognized, speak to the bill. Representative Cannon. Thank you, Mr. Speaker. Thank you members for your attention. Today is transgender day of visibility. It is an annual day where transgender individuals around the United States stand up proudly in their bold identities as daring to say, I don't feel right in this body. But if I can get access to mental health care and physical health care, if I can have support from social communities and community organizations that I will feel better. So instead of celebrating trans day of visibility, today we are literally erasing transgender Georgians. I am speechless. But instead, I'm going to take this 15 minutes and I'm going to speak to you all about the importance of the transgender community and some of the truth as to what this bill does. First, I want to ask each of you, have any of you ever been present for a gender or sex ambiguous birth? Have you ever been in the room when that has happened? Well, I have. And as one of our members spoke to what happens? What happens is families in that moment get to choose how they will socialize their child until their genitalia has developed enough. And within that time period, within those next two years, they can go to medical professionals and figure out what is best for their child. They don't come to the state constitution and say, well, what's legal and what sport is my kid going to play and base it off of that? We have reports here that show that transgender discrimination claims have already cost Georgia taxpayers $4.1 million. That figure includes $2.1 million to settle those claims and another two middle and legal fees. I have placed this on your desk because I think it's really important that we talk about this is such a big issue. So let's go over the cases that we thought were so great. Ms. Carrey Scott, a staff attorney in the state court system said after a long process of self-reflection, she realized about two and a half years ago that she needed to transition to align with her identity as a transgender woman. Her surgery was covered by her state health benefits plan. It has been a wonderful thing that's happened in my life. That surgery was incredible for my well-being. I was in a lot of pain emotionally and now I'm not in pain. In 2015, a transgender inmate said she was refused adequate care and sue the Department of Corrections. The Department agreed to use qualified medical and mental health professionals to evaluate inmates with possible gender dysphoria. A diagnosis used to identify distress calls when a person's gender identity differs from the sex listed on their birth certificate. In 2021, two transgender women sued the state when they were denied gender affirming surgeries under Georgia's Medicaid Health Insurance Program. The State Department of Community Health settled the case a year later agreeing to amend its policy to pay for gender affirming care through Medicaid. In 2019, a UGA employee won a settlement that requires the state's university system to cover medically necessary expenses, including gender confirmation surgeries. In 2023, three transgender men reached a settlement that requires the state health benefits plan to pay for gender dysphoria treatment. I understand what this piece of policy does here. I know that there's some level of misleading that is trying to happen to say, oh, but it's not 267. It actually does have some of those provisions from 267 in it. And so either way, we are looking at millions and millions of dollars in lawsuits. Now let's talk about hate crimes. We spent our time years ago working on hate crimes legislation. It was so important that we spent that entire session working on that bill back and forth until it passed. Well, in states with these restrictive laws, the number of hate crimes on K through 12 campuses has more than quadrupled. At the same time, calls to LGBTQ youth crisis hotlines have exploded. The number of anti-LGBTQ school hate crimes serious enough to be reported to local police more than double nationwide between 2015 and 19 and again between 2021 and 2022. Calls of spite to the Trevor project, which provides support to LGBTQ youth aimed at suicide prevention and crisis intervention. In the fiscal year of 2022, the group fielded about 230,000 crisis contacts. The following year, it was more than 500,000. Similarly, the rainbow youth project in 2022 had a thousand hotline calls and in 2023 had 1400. The rainbow youth project saw a crash of calls from Oklahoma, specifically rising from 321 in January to nearly 1100 in February, the week following next Benedict's death. In 2021 and 2022, the most recent years for which data was available, the average more than double to 232 hate crimes at schools. So, hate crimes. We used to care about that issue. We used to try to create an agency that could actually look at these hate crimes and now we're trying to find more ways. Let's talk about verifying sex, sex verification testing. So, what is sex verification testing? It is outdated and pseudo-scientific ideas about sex that disproportionately impact women whose bodies do not conform to narrow gender stereotypes. How do they do this? One, physical examinations, inspections of an athlete's genitals, often degrading and invasive. Two, chromosomal testing. Lab tests that examine an athlete's DNA to determine whether they have XX or XY chromosomes. Three, hormone testing. Blood or urine tests to measure testosterone levels. Despite the fact that this type of test is scientifically flawed and fails to account for genetic diversity as I close, inclusive of pelvic ultrasounds or MRIs. Imaging tests to determine an athlete's reproductive anatomy which could be used to exclude intersex women from competition. I ask that you vote against this bill. I have a lot more to say on it, but on Trans Day of Visibility, if you can't just let transgender people live alone, please take a walk. Thank you, Mr. Speaker. Thank you, Representative Cannon. That concludes our speakers there. We'll be ready for the Minority Report in Chairs Time. Is there any objection to the previous question being ordered? Here in under previous questions ordered. We have up to 20 minutes for the Minority Report and then up to 20 minutes for the Chairs Time. We're Park is recognized to speak to the bill up to 20 minutes. I guess you'll allocate those. Yes, sir. Thank you, sir. Gentlemen's recognized. Thank you, Mr. Speaker. Good morning, colleagues. Unfortunately, we are here debating another divisive culture war issue that will do nothing to support Georgia students and do everything to harm the people. The harm, vulnerable Georgia children here in this state. And so I ask all members on both sides of the aisle to either vote no or to walk on SB one. Now, the author of the bill said that this piece of legislation went through an enormous amount of scrutiny over multiple years. Well, y'all, look it up. There's not a single transgender athlete in our public schools. This bill accomplishes absolutely nothing with respect to fairness. And of course, this really isn't about fairness, is it? This is about discrimination. I have to ask myself so often why is the majority party so intent to discriminate against transgender children in the state of Georgia so intent to discriminate against vulnerable children? Do members of the majority party not recognize that these sorts of pieces of legislation drive children to commit suicide? As demonstrated by multiple studies on these pieces of legislation. Do members of the majority party not recognize that this will drive harassment and bullying of the most vulnerable children in our schools? Is there no concern from members of the majority party about the least among us? We stood today for a bird. A bird. While we are passing legislation to harm Georgia's children. Now, as the author again mentioned earlier in his remarks, we could have called this a Gavin Newsom act. Yet another reminder that this is a political culture war issue that will cause harm to Georgia's most vulnerable students. And so again, last point I will make on this is throughout this legislative session, how much time and effort did we spend on tort reform? How much time and effort did the majority party spend bullying and twisting arms to make it harder for injured Georgia and victims of sexual assault to hold those accountable for causing them harm? And yet at the same time we open up all of our schools to litigation, to frivolous lawsuits. That's the majority party. What incentive do you have other than this manufactured culture war in which you'll have scared your voters into harming a vulnerable community as to actually living up to the dictates of your faith that clearly mean nothing as demonstrated by your actions? And so I'm sick and tired of being sick and tired of children in this state being used as political pawns, which is what this bill does. This is unacceptable. And so again, I urge members to vote no or to walk on this nonsense issue that will cause so much more harm to the most vulnerable among us than I would have. And so if you're not eligible among us, then I actually do anything a benefit to Georgia students. Thank you, Mr. Speaker. You're the well. Gentlemen, you're the well, you're the well representative Wilkerson is recognized to speak to the bill representative Wilkerson. Thank you, Mr. Speaker. Today I come to pose Senate bill one. The education committee does a really good job, typically of vetting bills. And in this case, we did fix some things. The official draft of 267, which is very similar to this, would have banned coaches from even going in the locker room at halftime to talk to the young ladies. It took about five of us to convince the author that this was bad, but once front line agreed that it was an okay change, they made the change. And so let me tell you what I'm here as. I'm here as a father, a coach, a Christian, a husband, like many of you. And we are representative of the people and is also of our experiences. And so there are a lot of times experiences. You may not know what it means to be a coach of young women. I do. And I can tell you no young ladies I work with and have coached. I think this is an important bill. What I will say is up there is I'm assuming is going to be one of the methods of verifying a child sex because the initial bill said we use birth certificate. The Riley Gay is one of the internet and said that we can't do that. So we took the birth certificate out right there is the form and you can't really see it very good. But if you go to the next slide, it asks you a bunch of questions. So what I'm going to ask you to do is I know people looking to vote no. I know people will vote yes. Those that do vote yes. I ask when it goes to the Senate. You fix this one. This one part lines 136 says that nothing in this section shall be construed to authorize a covered entity or an athletic association to verify or confirm a student sex through visual inspection. And then it goes on to say we can rely on medical records. But as you see, you don't have it on the medical records or other standard medical procedures to verify a student sex. So let's say we're going to the championship game. My 12 year old competes my 13 year old competes in high school. She's at halftime someone challenges her and said that is a male. That is a male. We need to verify who's going to go in the locker room. There is no protections for children in this bill to say that an adult has to be present when they physically inspect the child. There is no protection in this bill at all. So you're going to send a child that wants to compete. And I'm asking for the Larry Nasser amendment right now. And when I say Larry Nasser amendment, that means that there was the coach of the Olympic team. Actually, it was a doctor. He was a doctor. He went 20 years of using children because these 13 year olds wanted to compete in the Olympics and they thought that it was okay for a man to put them in a position that they had no opportunity to fight back because they wanted to compete. We are going to do this to children every day. There are kids on the field that they think they're unfair. They're going to be in the state championship and you're going to look at the other child and you're going to say that is a boy. And then what's going to happen at the halftime the coach is going to go in there and look at my child. I wish someone would come home and say my child, my daughter had some coach looking at them. It's going to be a fight. Now many of you may have agreed with me. That's going to be a challenge. So what I'm asking you to do is when this goes to the Senate, I don't care how you vote. Don't put children in the position where they have to say no to a grown man. Think about that. Don't put your young daughters in a position where they have to stand up to a man that is bigger, that is taller, that is stronger, that has more authority over they do because they want to play a sport that they love. They're not concerned about a transgender athlete. They're concerned about someone touching them, someone attacking them because they have the power to do it. There are many other examples. You have male wrestlers who couldn't stand up to a wrestling coach. So you telling me, I ask, as this bill moves, take it to the Senate, let them amend it, send it back, you all agree, you passed the bill, we do what's already in law, which bands, people from feeding the sex that is not the one they're born with. That is all that I ask. Anybody that's ever sat in the Education Committee knows that whether I like a bill, whether I dislike a bill, I'm going to try to do what's best for our children. And that's what I'm doing right now is this is a dangerous bill. It's not just a bad bill, it's a dangerous bill because we're going to put young ladies at risk. And with that, a yearly will miss speaker. Gentlemen has yielded the will. Representative Drenner has recognized, speak to the bill. Representative Drenner. Oh, man, do I see baby Jesus down here? That's perfect. Thank you, Mr. Speaker. I had two separate speeches prepared today. And so I'm going to go back and forth between the two of them. So I rise today in strong opposition to Senate bill one. A bill that claims to protect fairness and safety, but instead singles out transgendered kids for discrimination. Let's be clear. This is not about fairness. This is not about safety. This is about politics. Across the country, we've seen a wave of legislation, just like Senate bill one, bills that use trans kids as political skate goats to distract from real issues like underfunded schools, gun violence, and the lack of mental health resources. And this is a manufactured crisis designed not to solve a real problem, but to create division and fear. We've seen this playbook before. The same arguments were used against racial integration in schools against women competing in sports and against same sex marriage. Now transgendered youth are the largest or the latest target. We must reject this attempt to turn children into a political battleground and instead focus on real solutions that support all students. So let's take a moment to examine the real effects of this bill by addressing the arguments its supporters have put forth. Number one, supporters of SB one claim it's about protecting women's sports. But where's the evidence of a crisis? Transgendered athletes make up a tiny fraction of participants. National and state organizations already have fear competition policies in place. If fairness were really the goal would be talking about unequal pay and funding for women athletics disparities and scholarships and coaching opportunities, the real threats to women in sports like sexual harassment and abuse. SB one does nothing to address these problems. Instead it targets a small group of students to score political points. Now no one on my side has taken a moment to talk about Riley Gaines. And I would like to do that. Riley Gaines publicly has shared her experience against Leah Thomas. And I want to say clearly to Riley I empathize with your frustration. And competing at the highest level is a huge accomplishment and it's understandable that you would be upset and that you felt that the playing field was not level. And if I was your mother I would have been mad too. But you know what? We fixed that. We fixed that. The Georgia High School Association fixed that. This bill athletic association. However, one race, one event does not justify legislation that impacts thousands of children. Her experience, your experience, Riley I listen to you. And when you said, woke liberal agenda. I had to stop. I don't know what woke me. It's like I didn't know what. Oh, gee, man. I woke every morning. So I was confused about that expression. Your experience is being used to create fear and justify policies that are going to hurt lots of other people, including transgender kids who are trying to find their place in this world. And Gaines's story is valid, but it's being politicized and it does not represent the larger issue. We cannot craft a policy based on isolated cases, especially when the cost is banning an entire group of kids from participating in sports. We need to focus on solutions that support all athletes, not just those who fit a specific narrative. This bill doesn't solve the fairness. This bill doesn't solve the fairness issues in women's sports. It's about creating fear and dividing us further. Another argument that we've heard is that allowing transgender students to use appropriate facilities, threatens privacy or safety. But the facts do not support this claim. There is no evidence that transgender students using the restroom or locker room that aligns with their gender identity leads to increase in harm. Schools already have the flexibility to make accommodations for all students without this government overreach. Let's not forget. Women were once told they couldn't share locker rooms with black athletes. They were once told that allowing them into sports would ruin athletics. These same scare tactics are being used again just with new targets. SB1 doesn't protect privacy. It creates a culture of fear and exclusion. Proponents of this bill say that biology alone should determine sports participation. But this argument is overly simplistic and selectively applied. We don't ban cisgender female athletes who naturally have higher testosterone levels. We don't exclude students with genetic advantages like height, wingspan or lung capacity. We allow student athletes of different sizes, strengths and abilities to compete every day. Sports are about skill, training and discipline. Not just biology. This bill cherry picks science to justify discrimination while ignoring the complexity of human biology. Title IX was meant to expand opportunities for women not to exclude transgender girls. If we truly want to protect women sports, we should be fighting for equal pay, ensuring equal funding for women's programs and protecting athletes from harassment and abuse. SB1 does none of these things because it's not about women sports. It's about creating a political wedge issue. Some people argue that polls show public support for banning trans kids from sports or locker rooms. But we must remember, public opinion wants opposed racial integration in schools and sports. Public opinion wants opposed women from playing contacts for sports. Public opinion used to say women couldn't even vote. Just as is not determined by polling numbers. Laws should be based on fairness, evidence and equality. Not fear or political trends. SB1 does none of those things. Instead, it manufactures a problem, creates division, it makes...\n\ntransgender students less safe. In conclusion, let's call this bill what it is, a political distraction, a manufactured culture war, a harmful policy that makes life harder for transgender kids. It's not about fairness, it's not about safety. This is really about using children as pawns in a political game. I urge you to vote no on SB one. Let's focus on real solutions for fairness, privacy, and safety, not government and mandated discrimination. Thank you, Mr. Speaker. I yield the well. Thank you. The lady is yielded the well. Now we'll have up to 20 minutes for chair's time. We'll recognize the chairman of the committee, and we'll see if it can be an education committee chairman. Irwin has recognized the speak to SB one. Thank you, Mr. Speaker and colleagues. I rise today in strong support of the Raleigh Games Act in 2025. And measure rooted in the fundamental beliefs that fairness, safety, and integrity in school and collegiate sports must be preserved for all student athletes across Georgia. The bill affirms that athletic competition should be based on clear biological standards, ensuring that female athletes who have historically fought for equal opportunity or not denied the right to compete on a leveling playing field. The Raleigh Games Act requires our public in participating private schools as well as post-secondary institutions to designate sports teams as male, female, or co-ed. Based solely on biological sex, it prohibits males from competing in female sports, thereby protecting the competitive balance and physical safety that women sports depend upon. At the same time, it provides for limited exceptions where no female team is available and ensures co-ed teams remain accessible to all students. This legislation does not target individuals. It targets inequities. It safeguards the decades of progress made in women's athletics by reaffirming the state's interests in promoting equal opportunity and preventing unfair advantages. The bill also respects privacy by ensuring that shared facilities used during competitions, such as locker rooms, restaurants, and sleeping quarters, are designated and used according to biological sex, while still often reasonable accommodations for all students. The Raleigh Games Act includes a robust enforcement and grievance mechanism. Students who are deprived of opportunities or face retaliation have a clear path to seek redress. This is not just a policy of protection, is a decoration of fairness, safety, and transparency in Georgia sports. Colleagues, this bill speaks to the heart of athletic integrity. It is about ensuring that every child, regardless of gender, has a chance to compete safely and fairly, and that the hard one victories for female athletes are not erased. I urge your favorable consideration of the Raleigh Games Act. Let us stand for fairness. Let us stand for safety. Let us stand for opportunity. Mr. Speaker, I'm going to yield the remaining of the chairman's time to the gentleman that is carrying the bill if he would allow me. That's the chairman's right. Still has time on his 20 minutes. These are really questions time to chairman Bonner. Very good to be bonner. Thank you, Mr. Speaker. Colleagues, we have heard some outrageous claims from this bill. Personal attacks, perversions of scripture, mistruths, and just flat out lies. So let me boil down the issue. Biological males have an inherent physiological advantage, allowing that advantage on the field places females at risk. Let me highlight this with a personal story. Two years ago, my daughter's high school, she shared a class with a boy pretending to be a girl. My daughters, he believed that my daughter's friend misgendered him. And so after class, that boy pretending to be a girl jumped my daughter's friend, put her on the ground and beat her mercilessly, without mercy, time and time again. The female teacher couldn't even pull this boy off of her. It took four individuals to pull this boy off of my daughter's friend as he pounded her head, time and time again. So don't tell me there is no advantage for a biological male on an athletic field. A yesboat provides the necessary protections for my daughter and thousands of other female athletes in Georgia. As for walking on this boat, I don't know about your constituents, but mine sent me here to know where I stand. I'm asking each of you to stand with me in the overwhelming majority of Georgians that support keeping biological males out of girls' sports and vote yes. Thank you, Mr. Speaker. I yield the well. The gentleman is yielded the well. That completes all those speaking in favor, the presentation, those in favor of and those against. It's about our report and the chairman's time. Mr. Clerk, will you ring the bell? Make sure our members understand we are ready to vote. Is there any objection to the previous question being ordered? Excuse me, adopting the committee's substitute. Hearing none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? Yes. As I rightly so, please take the time to assume whether legal and beefing and nor sell the trade? members voted. All members voted? If so, Mr. Clerk, will you lock the machine? All the past just Senate Bill 1, the yeas are 100, the nays are 64, the Bill Harenstree, the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 170, 170? Senate Bill 1, 70 by Senator Jackson, the 41st and others may be titled an act to amend chapter 12, the title 50, the fiscal to Georgia, and it intended relating to commissions and other agencies. So to create the Georgia Interagency Council for the homeless, this bill haven't been referred to the Committee on Governmental Affairs. That committee recommends that this bill do pass by Committee Substitute. Who are representative, Angie Osteen is recognized to present the bill, Representative Osteen. Thank you, Mr. Speaker. This is Senate Bill 1, 70. What this bill does, you've already passed it unanimously, 173 to nothing. This bill is an emergency preparedness bill. It will allow us to establish a grant for rural hospitals that were affected by the storm, to be able to gain the money that they need to get generators to increase our capacities for generators in the hospitals, and this will give them improvements that will position our state to withstand future disasters. I'll stand for questions. Lady has a question. Representative Park Cannon, to your left, has recognized for a question. Do you want to speak? Do you have a question? Yes, sir. You're assigned up to speak. Yes, sir. A question. Okay, ladies, recognize for a question. Thank you, Mr. Speaker. Do you? I do. Awesome. So with this grant program, how long will this grant program run? How is the funding coming and how will it be reported to the General Assembly? So we do have a fiscal note on that. It is going to be overseen by the by Gima and Homeland Security, and it will last as long as there are appropriations for it. Okay, so further inquiry there is a fiscal note to the amount of. To the amount of who are not sure of this is it's that because we don't think I don't think that. Do members have a copy of that on our desk? No, we have a fiscal note if we need it. Is that fair, Chair? Okay. I've already asked a question. I'm not trying to ask a question again, but I think it's just that. I think it's just that. I think it's your preparation. I think it would be the answer to that. Correct. Thank you, Mr. Speaker. Subject to appropriations. Okay, and then the final question I had already asked you before, which is how will this be reported back to the General Assembly? I don't see any language here on how it will be reported back to the General Assembly. I have no idea. When the funds are exhausted, then that will be the end of the program. Lady Hasner for the questions. Thank you, Mr. Speaker. I ask for your final question. Excuse me. Representative Rice to your left. Is recognize for a question. Thank you, Mr. Speaker. Does the General Lady yield? I do. Is it not true that by prioritizing hospitals lacking any existing backup power, this bill strategically directs resources to the greatest area of need? Absolutely. Thank you so much for saying that. If you had been where I had, and you saw fire department with a bucket brigade flushing toilets and bringing up water for nurses to wash their hands, you'd understand why we need it. Thank you so much. Representative Buckner to your left about midway back is recognize for a question. Does the General Lady yield? I do. I'm very familiar with your bill and how important it is and very supportive of it. I also have people back home that are interested in the homeless council. And I'm having trouble finding where that is in the bill now. I'm not sure. This is a substitute. It was stripped and put this in there. That's the only thing that I can tell you. Yes, ma'am. I think that's the case. Thank you. What's your deal? The illustration has one last question. Final question. Yes, sir. Thank you, Mr. Speaker. It was General Lady yield. I do, to my friend. Ma'am, is it not true that this legislation is the exact same text as House Bill 262, I believe. Correct. That we previously passed 173 as zero. And that no fiscal notes necessary because it's subject to appropriation or other grant this to be received. And obviously the general assembly would be able to follow that because appropriation would be necessary for this critical measure to provide generators at rural hospitals, which we saw were so very critical after Hurricane Helene. I appreciate you saying that, Mr. Later. Better than I could have. Thank you so much. I'll yield the will. Ladies, yield the will. Representative Park Cannon has recognized to speak to the bill. Representative Cannon. Thank you, Mr. Speaker. I'm here to speak in favor of this measure because we can have questions on the bill and we can still support it. The first thing that I just want to be really clear on is the practice of us dangling legislation one way or the other. And then saying the hurricane word we have to do this because of the hurricane. We have to do this because the hurricane because of the tornado because of the storm. Many of us are better policymakers than that. Many of us have spent time getting national research on a number of issues. And so it's interesting again to see a really great bill. The original information in 170 be completely stripped out. And now we're rushing to the finish line on backup generators for hospitals. So I'm here to speak in support of really both of the pieces of legislation and wanted to just remind folks why 170 was so important before the big scary word came in. To which we've been told a fiscal note is not necessary because it's subject to appropriation. I think there are many of us who would say that we have bills that will be subject to appropriation and we are mandated to have a fiscal note to even get a hearing. And then even out of hearing when we have that fiscal note, it's we're told it's too much or it's too little. So I just wish we would be more transparent with how much this will be. But for the original bill, which would have recognized that housing is a fundamental human right. And would have united important stakeholders like government organizations and service providers, housing specialists and advocates to create an all encompassing long term solution to homelessness in our state. We must acknowledge that in 2024, about 12,000 individuals on any night are homeless. 52% of the homeless population consider themselves unsheltered. Many they don't have anything to sleep under. There has been a 4.4% increase in homelessness from 2020 to 2022. And African Americans make up 21% of Georgia's population, but 58% of the homeless population. It's important that we work together as fearless, caring leadership to put resources towards them. I hope that we will see this bill in its original version. Please consider voting for it as it is today. Thank you, Mr. Speaker. I yield the well. The ladies, you are the will. That concludes our conversation so far on SB 170. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Chair, here's none. Committee substitute is adopted. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill. Hearing none, the report of the committee is agreed to. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted for what purpose is represented. I'll rise. I'm sorry, I missed you earlier. Parliamentary inquiry. State jingwari. Isn't it true that by OSHA standards, all hospitals have to have emergency generators already? I'm sure the lady is very knowledgeable about health care. For what purpose is represented Martin rise? Oral military inquiry. Is there any true Mr. Speaker to the last speaker's comments on fiscal notes? Isn't it true that fiscal notes are necessary when we're passing laws that have a statutory requirement on this body that we don't then look at or not subject to appropriations or cause us to have a mandate of a spending process to either reduce revenue or a spending process? Those require fiscal notes and by its very definition, is it true that Mr. Speaker went in the bill that says subject to appropriations? That brings it back before this body and that is why fiscal notes are not required as the speaker communicated. No, the gentleman knows what he speaks for what purpose does referencing Sam Park rise? Parliamentary inquiry. State jingwari, sir. Mr. Speaker, is it not true that while I greatly support the underlying legislation, I do not support the fact that we have stripped the Senate Democratic Whips legislation regarding homelessness and that both pieces of legislation could have otherwise moved forward but it is not? I'm sure the gentleman firmly believes what he speaks. The next time the process is difficult. Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of Senate Bill 170, the Yays are 165, the Nays are 3. This bill, honestly, the records are constitutional majority. It's therefore passed. Mr. Clerk, will you read the caption to Senate Bill 82? Senate Bill 82 by Senator Dixon, the 45th and others to be entitled back to a men article 31 of chapter 2 entitled 20, the fiscal to Georgia annotated the Charter Schools Act of 1998, so it's an act of the local Charter Schools Authorization and Support Act of 2025. This bill ever further, the Committee on Education, that committee recommends this bill do pass by Committee substitute. Chairman Scott Hilton has recognized to present Senate Bill 82. Representative Hilton. Thank you, Mr. Speaker. I rise this afternoon to present Senate Bill 82, which is a common sense compromise bill that passed the Senate with strong bipartisan support, including a majority of both Republicans and Democrats voting yes. Senate Bill 82 addresses the state's Charter School Access issue by incentivizing local school districts to approve more Charter Schools and holding districts accountable if they repeatedly deny high quality Charter Petitions. In Georgia, how we approve local Charter Schools is at a balance with how most Charters are approved in most every other state, with new approvals resting almost entirely with the state rather than the local system. In this way, Georgia is an outlier. Nationally, 90% of Charter Schools are authorized locally and 10% are approved at the state level. Georgia is basically the inverse of these figures. In the past five years alone, only one Charter School was approved by a local school district in Georgia. During that same period, the State Charter School Commission approved over 30 schools, most of which were initially denied locally. So what is the result of this broken process of the nation's 10 most popular states, Georgia ranks dead last in Charter School Access. Nationally, 7% of K through 12 students attend at Charter School compared to 3.5 or half of that number of K-12 students in Georgia. In developing Senate Bill 82, we partnered closely with the Department of Education, Georgia Schools who are attending association, the Georgia School Board Association, and I'm grateful for their input and support on this legislation. I'll walk you briefly through the bill itself. On Section 3, we provide more transparency by requiring the local boards to provide disclosure around why the denial, the rationale of the denial, and that has to be provided within 20 business days. We then provide district accountability. So for districts between 10,000 and 60,000 students, if a district denies two or more Charter Schools that are subsequently approved by the State, the local district is not eligible to renew its flexibility contract. This changes to three or more for schools serving over 60,000 students. Section 4 of the bill provides an incentive to school systems who approve Charters, locally approved Charters of 250,000 annually for three years of the $750,000. Section 5 provides state support for locals who are seeking to approve a locally approved Charter School. There is a minority report on Senate Bill 82, and my wife typically tells me not to read those as they're bad for my health, but I do want to address some of the points raised in the report. First and foremost, let me dispel a common misconception as it relates to Charter Schools. Charter Schools are public schools. Let me repeat that Charter Schools are public schools. The only difference is that they receive less funding, typically perform at higher rates and have higher accountability. The second sentence of the minor report praises exactly what this bill aims to achieve. Local school districts best understand the needs of their students and their communities. We believe this to be wholeheartedly true, which is why Senate Bill 82 puts in place incentives to encourage more local approvals. Financial charter schools are responsible for the capital outlay for new school. In fact, all charter school systems, schools in a system, have a funding holdback of 3% to pay for new schools. Just three years ago, this body passed a bill which creates additional dedicated funding weight for all students enrolled in local charters, so the districts are pulling more money from the state to offset costs. In this bill, school systems can receive $750,000 in additional funding when approving a new school. The data is crystal clear. Among the state authorized Charter Schools, 85% of those schools outperforms surrounding schools in their area in academic mastery or growth on Georgia milestone assessments. There's going to be a lot of talk about local control. But let me emphasize this. Local control doesn't start with the local school system. It starts with the parents. Parents are the ultimate measure of local control, and the parents have clearly spoken. Georgia has over 21,000 students on a wait list to agenda a Georgia charter school. Please join me in voting yes on this common sense bipartisan measure. Thank you, Miss Speaker. I'll yield for questions. The gentleman has a number of questions and we have speakers. I'm going to recognize representatives from Representative, let's see, you got a, Ramon. I guess yes, I had a question last five or ten minutes. Ramon is recognized for a question. Thank you, Mr. Speaker. I can't do Parliamentary inquiry, so I got to make myself a do around here. But does the gentleman yield? So you had mentioned that this bill has some bipartisan support, but what do you say that part of the reason that we are a bicameral state is to allow for more vetting of bills. So sometimes when one body doesn't catch some things, it is our job to unfortunately fix those problems. I don't know if that's a question, but would you agree with that sentiment? I agree that the House generally does a fantastic job improving Senate bills, correct? Yes, sir. Mr. Chairman, you'll represent the Kelly to your left. It's recognized for a question. Speaker, with the gentleman yield? Yes, sir. Representative, isn't it true that you mentioned a 21,000 children on the wait list now, but isn't that drastically up in recent years where it was just 14,000 just a few years ago? So we're seeing dramatic increases in children wanting to come in the charter system. So what is it? For me standing here in this well, again, my ultimate measure of local control is the parents and the parents have spoken with their feet, and they are saying we believe in trust in charter schools. We like that as an option for our children. And my posture is we need to give those parents and those families that choice. And so absolutely let's open the doors. Let's not keep it closed to 21,000 students in our state. Representative, right now to your left is recognized for a question. Thank you, Mr. Speaker, with the gentleman yield. Yes, is it not true that when a student goes to a charter school, the money that is at the current public school goes with them? The money stays within the local system. Yes, it goes to that charter school with the student, correct? Money follows a student. Yes. Can I ask you another question? Sure. Okay. So is it not true that charter schools fail because of lack of funding? Is that not true? Well, charter schools like any schools fail for a number of reasons funding being one of them. The beauty of a charter school, unlike a traditional public school, is that a charter school is failing. We close it. It has the ultimate accountability measure that really a traditional public school does not have. Can I ask you one more question? One more, yes, ma'am. Okay. I'm from Detroit. And charter schools came into Detroit and they destroyed the entire Detroit public schools. That's why we live in the great state of Georgia. Mr. Speaker, I know where the gentleman has another question. If you'll take one more to kind of, yes, sir, one more. And that's, I'm referring to talents to your right down to Sir Iles. I can ask for a question. Does gentleman yield? It's my fellow education committee member, yes, sir. Is it not, too? I ran a charter school for approximately 10 years of run sick Georgia. Very successful school because the teacher and staff, we got a prepred school funding from local and state funding and actually federal funding as well. That school is still doing well, turning out students who are going to help us with this workforce development problem that we have in the state of Georgia. So charter schools are effective if it's run effectively. You're exactly right. Charter schools are public schools who turn out the brightest minds in our state. And with that, Mr. Speaker, I ask your favorable consideration on Senate Bill 82 and I yield the well. Thank you. General, as you're the well, we have three speakers on the bill. I'm going to limit you all to five minutes each up to five minutes each. Representative Lisa Campbell has recognized to speak to the bill. Then representative Beckles and representative Williams. Ladies recognized. Would you have the lady, it's a lady will spend just for a minute. Thank you, Mr. Speaker. proceed. Today, my colleagues, I rise in opposition, strong opposition to SB 82, a bill that is in direct opposition to the original intention of charter schools. This bill erodes local control in school boards across our state and most importantly will further defund our public schools. This bill uses financial incentives. I'm not sure I've seen this before in our public schools. It's akin to other types of financial deals that are unworthy of this body. Sometimes called payoffs or kickbacks for local school boards to approve charter schools. It's a punitive bill that penalizes elected school board members that deny petitions that are later approved by the state and it imposes new oversight and report.\n\nstarting obligations on local districts. Remember this later when these same sponsors talk about rolling back and getting rid of and necessary rules. Yes, charter schools historically have been an option in our public school system, but this bill is about allowing private schools organizers who want to introduce religious, private curriculum into our public school system and use our public tax dollars. This new charter school initiative is not the old charter schools that you may be familiar with. The bottom line, this is yet another bill that undermines local control of our public school systems. If threatens and pressures school boards to approve charter school applications against their best judgment, these are elected officials who have been asked to look at charter schools applying and are denying them for very legitimate reasons. This bill takes their elected responsibility away completely. And not only does it usurp their elected responsibilities but it pressures them to approve charter school applications and lays the groundwork for increased privatization of all of our public schools. This is cloaked in a ton of language about innovation and choice, but this bill ties funding and flexibility to the expansion of state-preferred charter options and threatens consequences for school districts who choose differently based on the needs in their school district. I can tell you about a charter school in our district. It was denied at the local level but approved at the state level. I can tell you about this charter school that trains its teachers and its curriculum comes from Project 1776. What we now know to be Project 2025, it is publicly known and our public tax dollars are going to support these schools. This particular organization is called Hillsdale and they are on record with a very strategic approach to take legislators like ours and essentially trick them into talking about choice for parents. But I want to set the record straight. With these private, extreme, far-right religious organizations are doing is not right. We should not fall into this trap of seeing the name of a bill labeled one thing but in actuality, in reality, stripping our tax dollars from our public school systems. In addition to the federal cuts, dismantling of our federal Department of Education, the gross expansion of our voucher bill that now allows two-thirds of our students in Georgia to opt out of public education do not act like you support public schools and say yes to this bill. This bill is just one more way to demonize our local teachers to defund our public schools and ultimately dismantle our public schools. This bill creates a lot of local control. It's charter expansion by coercion. It's backdoor privatization. And it fosters unfunded mandates and bureaucratic burdens. Ultimately, it undermines public school cohesion and planning. This bill has been framed as providing school choice but once again, it does nothing to address the proven and underlying causes of academic struggle. Poverty. We've spent zero minutes in this chamber talking about the ways to actually help our children. I urge you all to vote no for this destructive bill. Thank you and I yield the well. The lady has yielded the well. Repelantity Beckles has recognized to speak to the bill. Repelantity Beckles. Thank you, Mr. Speaker. Colleagues, I rise today with concerns about Senate Bill 82. This bill undermines local control of our schools. It threatens to punish boys revoking their charter system. And it denies charter petitions later approved by the state. The financial impact is troubling. This bill commits 250,000 per year for three years for each new charter school. That's $750,000 per school. With our existing schools already struggling for funding, teacher pay and building repairs, can we afford this additional expense? This bill even admits insufficient money. Saying grass will be reduced if funds run short. Let's be clear what's happening here. We are bribing our school districts to approve charter schools while threatening penalties. Imagine a school board that reviews a charter petition and finds legitimate problems with it. Under this bill, they must either approve, despite their concerns, our risk penalties. Is that how we want decisions about our schools, our children's education? This bill also creates unnecessary paperwork. School boards must provide detailed written statements within 20 days. When denied a petition, this creates more administrative work for already overloaded school systems. My most concern is how this bill treats charter schools differently than traditional public schools. While we demand strict accountability for our public schools, this bill focuses on only creating more charter schools without giving equal attention to their quality. I, for one, believe in innovation and choice in education. However, the real choice comes from community needs, not state pressure. This bill represents a dangerous shift from local control towards the state overriding local decisions. I urge you to vote against Senate Bill 82 and instead work on real reforms that respect local governance while improving education for all of Georgia's students. Thank you, Mr. Speaker. I yield the well. The lady is yielded the well representative. All Williams has recognized to speak the bill. Representative Williams. Thank you, Mr. Speaker. I rise in opposition to SB 82, but for a little different reasons. It's not all bad. There are a lot of good points in this bill. Some of you were remembered several years ago I was talking about a bill and I described, I said, no matter what you do with a scope, if you're spread with Chanel number five when it wears off, it's still a scope. This is a scope. And scouts have good use too. They keep warming down and you can make a camp out of it. But it's still a scope. And local control, and I came to this, these August halls in 1975, Lieutenant Governor, the Holy Grail was local control. That was the Holy Grail. Now, I don't know whether it was in the anti-Smith or who, but somebody stole the Grail. It's no longer a big thing. And we talk about the distinguished gentleman sponsored this bill, whom I have great respect for, talks about the people of saying this come on folk. If you listen to the people in here, we'd have voted on gaming. 82% of the folks had let us vote. But of course, who are they, but voters, who you will go home and lay another con game on, because you decided they didn't know anything. Now, all of a sudden, for the love of the voter, we're going to save you again. Your saving is very painful. I went through a terrible episode a couple of weeks. I had an upper respiratory infection and thanked Dr. Newton for saving my life, because they're cured like they killed me, the antibiotics were awful. This cure will kill public education eventually. And that's the real purpose, because when local control was in place and local control was the local control we wanted, it was fine. But as demographics changed, local control became a bad word. You take money out of public education when some teachers are having to buy supplies to help the children, because they don't have the money. The school system does not supply what they need. They go in their pockets. But you've got money to build another charter school. And there are several very successful charter schools in Georgia that were set up by locals. A lot of success was. It's worked. Most of you in here, products of public schools, now all of a sudden, is demonic. Nothing wrong with public schools. Something wrong is how we treat them. But don't let this go get out the cage, because you can't put it back in. One thing about a skunk, he squirts everywhere he goes, and you know he's been there, and we have about to turn him loose on public education again. Let's don't do that. Let's don't do it. This is, and it also, you remember back in the day when Muhammad Ali beat George Foreman, he beat him with the rope of dough. He pretended to be being hit, and he just ducked and did the rope of dough. This is a rope of dough. A rope of dough. This is a pretend to help you. But I don't plan on helping you. I'm planning on building some schools, where Pukin Boo Booz, neighbors ain't gonna look the same in the very near future. Don't do this to public education. It's an assault on public education. And please call it what it is. Don't give it a fancy name. Say this is a, we don't like public education bill. Call it that. Because that's what it's all about. It's not about anything else. Let's fund public education. And then we can stop bragging one day if we concentrate on public education about being the best state to do business and say we're the best state to do business and the best state to get an education in. Let's do it like that. I talked a little longer than I wanted to, but I know the speaker wanted to hear what I had to say. With that, Mrs. Speaker, I yield the well. I'm glad you're feeling better. I'm glad you're feeling better. Is there any objection to the previous question being ordered? Here none. The previous question is ordered. We now have a minority report for up to 20 minutes and the chairman's time for up to 20 minutes. I'm going to recognize with Sam Park for the first comment. Will Park, you're going to manage to help everyone manage your time, sir? Thank you very much. Will Park is recognized. Yes, sir. Hold it. Suspended just for a minute, gentlemen. If any conversations need to go into the any rooms, that would be the appropriate thing to do. Will Park, you recognize to speak to SB 82. Thank you, Mr. Speaker. I rise in opposition to SB 82. I know there have been strong comments against this piece of legislation. But for the most part, I'm open to the idea of publicly funded charter schools, especially if they're able to provide innovative quality programming provided that they are formed with the approval of local boards of education because they're under the governance of those local school boards. So let me just highlight some concerns with SB 82, which I do appreciate has been improved. But I think these are concerns also shared with others, including possibly the Georgia School Board Association. So let's begin. First, on lines 104 to 142. These lines provide for a punishment of loss of a district's flexibility contract. For school districts with 10,000 students and above. This currently applies to 38 districts using the October 24 count. This punishment not only usurps local control of those constitutionally elected local school boards, but it also does not encourage collaboration between a local charter petitioner and the district. There is a fundamental difference between a state charter and a local charter. A state charter is an individual standalone entity. A local charter is part of the school system and the Georgia Constitution empowers school boards to be in control, which this legislation undermines. Local school boards approve or deny a charter for various reasons. Common considerations include that a local charter must be academically successful and physically sound. A local charter must fit in with the school district's mission strategic plan and goals. There must be a high level of trust in the management and operations of the local charter. And that a local charter should otherwise fulfill unique needs. That's the first concern. Second, on lines 155 to 174. These lines provide for a $250,000 incentive for three years on August 1. This is subject to appropriations by the legislature and can be reduced proportionally. So the incentive grants are not guaranteed, which makes budget planning challenging for local districts. So while there is a carrot, if you want to call it a carrot in here, it is much smaller than the stick, especially when the incentive grants are not otherwise given. And so again, I appreciate the intent of the bill, but I do not think that the bill is yet perfect. I think a lot of work still has to happen in order to ensure that we are respecting the Georgia State Constitution with respect to local control of locally approved charter schools as opposed to forcing local school districts to accept these charter schools. By threatening local school boards, by removing their flexibility, which certainly does also have financial implications. So for all those reasons, I encourage members to vote no to Senate Bill 82 with the understanding that the bill is not yet perfect. Hopefully we can come back around sometime before the end of the biennium to continue the work to really ensure that this is a bipartisan piece of legislation and really takes into consideration, especially the impact on local school districts. So with all of that said, Mr. Speaker, I will now yield a portion of my time to representative Jasmine Clark and then Karen Lutton for the remainder of the minority board. Thank you, Mr. Speaker. You're the loan. Thank you, Mr. Chair. Thank you, Mr. Chair. Thank you, Mr. Speaker. Thank you, colleagues. So today I rise with some strong concerns about SB 82. And I know it has been mentioned a couple of times, but I really want to hone in on lines 148 through 165 of this bill. And I specifically want to hone in on lines 159 through 162. In the event that available appropriations are not sufficient to cover the total amount of such incentive grants provided for in this subsection, the amount of each such grant shall be reduced proportionally providing incentive grants and equal amounts to each such local bill. So I want to hone in on some of these grants, such local board of education. In other words, we are making promises that we may not be able to keep. And I think that that is bad policy. It costs millions of dollars, some estimate, about $4 million to start a new charter school. And I think that is a very small fraction of that initial start-up cost. Even if we were able to keep our promise, we are basically saying we will give you about 750K of millions of dollars. The problem is we have written a way to back out of that promise. We are telling them you have to do this and we'll give you money to do it, but if we don't have enough money, you may not get to. This is kind of like offering a reward and then when you go and say, all right, I'm ready to receive the reward that you said you're going to give me. You say, well, my bank account is empty, so can't give it to you now. That's a problem. And again, that is bad policy. And that is why I'm asking you all to vote no on this bill. If we are going to threaten people with penalties for not approving these charters, then we at least need to promise them that we're going to keep our end of the bargain. Thank you, Mr. Speaker, I yield the well. I'm sorry, I didn't see you right down the, my bad. Ladies recognized. It's all right, Mr. Speaker. Thank you. We need to get an apple box down here or something. A colleague's I rise today in opposition to SB 82 because I think that SB 82 seeks to undermine the authority of our local elected school boards. I'm very fortunate to know many of the commissioners on our Decad Board of School Board. And they work too hard to get elected and work too hard to try to make great decisions for our kids for their decisions about what's best for Decad County Schools to be overridden by the state. Especially with the language and attitudes, I think builds can have attitudes as my previous colleague spoke, that these carrots that we're offering are not guaranteed. And although you look at the dollar amount and you think, hey, what school wouldn't take $250,000 a year for three years? Like, come on guys, wouldn't you do it? The money in lines 166 to 170, the money clearly says, this should just be spent by local school boards to get more charter schools. You know, you can hire an admin, you can get some role, you know, get some better evaluators, but it all has to be spent making and sustaining more charter schools. It's not like you get money for an innovative writing program or something like that, that's not the way this bill is written. And what you're taking away from them is some of the ways that our public schools try to be, try to meet specialized needs and try to be innovative, which is those waivers, those local waivers. They say, hey, we get at state, you need us to do this, but actually we have some different needs in our district. We use this money for this. That's a great way that public schools can be flexible, but you want to threaten to take that away if they don't give you the charter schools that the state wants. The state can make charter schools. If the state would like charter schools, the state can get charter schools. But I trust my local district to understand, especially the budget in my school district, to understand whether that can be the best answer for us. Call me stupid, but I just trust the people that I elected, that we trust to run our public schools. Now, over 30, this is just a real rough estimate. I counted, you know, going through the legislative website. I counted just about over 30, principally democratic bills relating to state education, public education. We're trying to cover everything from school safety. We're trying to cover feeding kids at school. We're talking about revamping the QBE based on what was suggested in 2015 after a big state committee. We're talking about appropriating money for more mental health providers. We're talking about, we heard a bill here about innovative writing programs. We passed it through here. Those are over 30 principally democratic bills that attend to the needs of our public schools. Are we hearing any of them right now? No, we're talking about siphoning off more money from public schools to give them to charters. Now, our education subcommittee, our education committee, I'm really I'm proud of the work that we did under the leadership of our chair. When he called us into order for the first very first committee meeting, he said that we have two primary goals. One is safety and one is literacy. And boy, we have been attacking literacy. We have come up with some great ideas and we're making a push. We're throwing our legislative weight behind changes to literacy to make a difference in every public school in Georgia. I feel like, well, this bill doesn't have anything to do with safety. It doesn't have anything to do with literacy. What I feel like we could do is that if we put our legislative might to making Georgia's public schools second to none, we could do that if we put our mind to it. It would be difficult. Yes, we're not scared of hard work. Instead of siphoning off a couple, couple of kids here, couple of kids here giving them more money per student, more less students per teacher. Boy, if we only we could make our public schools the Xanadu that some charter schools claim to be. Now, I have a great charter actually in my district. It's called the Path Academy. It serves mostly Latino kids with Spanish-speaking parents. They have a wonderful atmosphere. They're great. They're not meeting their academic standards. So they are being held to an accountability. They are having some issues. But what we need more than threats and more, what's the word I'm searching for? I'm more, the layer of bureaucracy at our public schools. I'm interested in trying to take a burden off of our public schools so that they can be free to do what else we're asking them to, like change their literacy and do many other important things in the classroom for millions and millions of kids. I'm proud of the bills that my fellow Democrats have dropped. And you know, some of them have been bipartisan. But this bill, hold on. Yeah, we should be making it easier for our local school districts to focus on the special needs that they have for their students. If we can get them the care and the training and the schooling that they need, where they live, even better. And we can do that. We have the tools to do that. We have not the will yet, but I hope that we can develop that. This legislation is primarily about focusing, forcing a specific political agenda onto local communities, once, as another gentleman said, our local communities aren't doing what the state wants them to do. Regardless of the voters wishes, it's SB 82 fails to address the larger, more pressing issues in Georgia, Georgia's public education system. Our public schools need increased investments in teachers, infrastructure, and student support services. They need smaller class sizes. They need competitive salaries to attract and retain high quality educators. They need adequate resources for students with special needs. Instead of focusing on these critical issues, SB 82 diverts attention and funding away from some of those very beneficial policies at the benefit of a few and the expense of the majority. I talk with my hands a whole lot. Additionally, this bill forces local school districts to stretch their already limited budgets even further. So when a new charter school is approved, it doesn't just receive funding. It siphons money away from the local public school that's there. It weakens the ability of our traditional public schools to serve their all of their students effectively creating inequities that hurt the communities that we claim to support. Now, public schools are subject to rigorous oversight, transparency requirements, and state standards that ensure students receive a high quality education. Charter schools on the other hand can sometimes operate with less oversight. And again, they are not governed by people that the people living in that district have elected. They've elected somebody to stand up and make decisions for them. That's their local school board. So SB 82 to me is not about choice. It's about coercion. It pressures local boards into decisions that may not align with their students best interests. It forces them into difficult financial situations, while while burdening them with new mandates to drain time and resources. This is not responsible policymaking. This is a blatant attempt to override our local control in favor of an approach dictated top down by the state. Colleagues, I urge you to consider the consequences of this bill by passing SB 82. We're sending a message that we don't trust our local school boards. Right? They've been elected, but no, no, no, no, no. Daddy knows best. The state's coming in and going to tell you what you need to do with your money and with your students. We are sending a message that we prioritize political pressure over the actual needs of our students. We're telling communities that their voices don't matter. If their voices are their votes, their votes are not mattering because we just want to toss aside the folks that are sitting and making decisions at the local level. This is not how we build a strong.\n\nSustainable public education system. Let's reject SB 82. Let's stand up for the right of local districts to make their own decisions. We may not always agree with them, but they're the ones who have been elected to stand in that place and make that decisions, make those decisions. Let us support policies that are truly going to empower our educators and administrators and families and perhaps lessen the burden on them instead of constantly adding on. I met with some folks from the education from the Georgia Department of Education and asked them, you know, kind of a very simple question, what can we start doing to take things off the plates of teachers in public schools? What can we do? And we had a very productive talk. They shared me some lovely websites, some really great websites, that the state has has created to provide resources for teachers, but then they told me that, oh, it's the locals that are really overburdening your the schools with all of this regulation. It's really the local districts that are doing this. This, I mean, come on, this is the state saying, no, no, no, no, we're going to pile on more. We continue to ask for blood from a stone and we're not going to get it. Instead of allowing our public schools to kind of die on the vine, as I said before, we have so much power here to change the narrative and to change the way we approach public school for our students. We have the power to do that instead of cherry picking that we want a couple out for special over here and a couple that are special over here. Why don't we try to give the best of our resources to every single school? Every single public school? No, okay, nobody's interested. Thank you, thank you. I appreciate that shout out. A gentleman from the 49th spoke the other day. Thank you so much. To another education bill and urged us to look at our state's QBE formula in total to prep ourselves to work towards the review and reworking of a very complicated QBE formula. I cannot agree more with the gentleman from the 49th. If things are getting tough in our public education space, we're the ones who have the power to fix it. We can review our QBE. We can do the hard work of finding the support for each and every one of our public schools instead of rescuing a few. I mean schools are not, they're not businesses. It's not serial. You go into a serial aisle, you got 150 choices for serial. How many choices do we need? Now I understand that we have some great charter schools as I said, one of them is in my district. But please vote no on 82. Let's find a way to support all of our local public schools. Thank you. Mr. Speaker, I love those choices on the serial aisle. I'm going to tell you that now. That completes all those that were speaking to the minority report. Now we'll hear the chairs time. I don't see the chairs. So I'm going to recognize a vice chair of the committee on education to speak to the bill. Representative Rice. Thank you Mr. Speaker. I would like to wave the entirety of my time to speak or pro-tim Jones at this time. Thank you. The vice chair has waved the chair's time and given all the allocated time to the pro-tim of this house, Representative Jan Jones. Representative Jones is recognized. Well thank you Mr. Speaker. I don't need 20 minutes. I'm the lucky penchheader for the chairman who is negotiating feverishly to get us a school safety bill with the Senate. And so he asked me a few minutes ago if I would just come up and say a few words. I just want to say that for the 20 or so years that I've been here, we've been talking about charter schools and particularly locally approved charter schools. And in that time very little progress has been made. The first charter school bill was initiated by former Democrat Representative Kathy Ash. And since that time we've seen some progress particularly in areas like the City of Atlanta. There's some very they're locally approved charter schools doing great work around the state but it's very few. What this bill does is simply it's a very modest proposal to encourage local school boards to provide more public school options to students. And it's so that we can have more public charter schools employing public school teachers that are included in the state retirement pant teachers retirement plan, state health benefit plan and teaching public school students. In the last 10 years of all these efforts to encourage public authorization by local school boards, guess how many they've approved in 10 years. Three. Three. The state on the other hand has approved 56 in that time period. Some of you are here when your voters approve the state charter school amendment. It passed by 58% around this state. The county that approved it at the highest percent in the entire state was Clayton County is 71%. Why? Because parents and students which I haven't heard a lot of today up here in the well, mostly heard about systems, districts, school boards. I think I could probably count on two fingers the number of times I heard students and parents which is what this is aimed at. We've approved them at the state level parents around the state, grandparents around the state approved the state charter school amendment because they don't care about your construct. They want public school choices. They want to attend public schools with public school teachers utilizing state and local dollars. I heard a lot about vouchers, religious schools, privatization, none of that is in this bill. All public charter schools have a non-profit board and there is no private in the nonprofit board. I heard about vouchers. The bill has nothing to do about vouchers and let me just make a correction. Two-thirds of our state cannot utilize vouchers because there's 1.7 million students and vouchers can only be utilized by 21,000 students per the bill we passed last year. Backdoor privatization is a non-issue. These are public charter schools. Public dollars remain in public schools whether they're public charter schools or traditional schools. I've heard over the 20 years I've been here that folks are open to the idea. I heard that open to the idea of public charter schools as long as they're under the governance of public school boards. Then you ought to be for this bill because this bill encourages local authorization. We got a lot of state authorization going on. We're kind of full up there. What we need are locally approved charter schools. You know open to the idea usually when I hear that it doesn't mean supportive. I'll just say that but I read the minority report. I don't know where the 2 million 4 million comes from. I'll just say this when you have a locally approved charter school the property tax dollars that are raised for the students that live in that school district stay there and they follow the child to the charter school. They earn QBE. When the state authorizes a public charter school and that might be where the misunderstanding came about with the dollars the states on the hook for both sides the equation. We pay for the local share and equivalent and we pay for QBE. Well it's just not sustainable, more replicable around the state to keep offering the options that your constituents, your students and your parents want to have them all approved at the state level. It just isn't because that's not how public education is generally funded in the state. It's a partnership about 10% comes from the feds 40% from the locals and 50% from the state. So we collectively want to encourage more public charter schools. We need to figure out away and this is a very modest proposal to do that to encourage more locally approved but in 10 years three have been approved. There are over 20,000 students on the waiting list for those few that exist now. Imagine how many would be on how many more can't get on a wait list because there's no charter school to get on the wait list for. It's kind of like pre-K when I hear about the wait list for pre-K it's irrelevant. If there's no class there waiting to get on a wait list for I don't know how many would want to be in public pre-K. Well the same is true for public charter schools and I encourage you to vote for this guy. I do have to address several folks mentioned that the money isn't guaranteed. You know one legislature cannot legally bind a future legislature. The only way is to put an appropriation in a tax credit or tax deduction and until you repeal that the recipient is do that tax credit or tax deduction. Anything we pass on this floor saying we're going to do this loan grant program we're going to do that grant program we're going to do these modest incentives to local school districts to approve local schools is always subject to appropriation. That's not being an Indian Geber that's how the state constitution works. So do keep that in mind on future issues that it's nothing different than everything we pass whether it's a loan program for public school teachers or for fallen heroes it's always due to appropriations. Some of you are here during the great recession we had to cut back and cut back and make cutbacks and again that's why we have we cannot bind a future legislature. So I encourage you to vote for students and parents who are begging for more options. This is not vouchers if you didn't like vouchers and you're for public schools and public education only this should be appealing to you and if you like local control and you want more locally approved charter schools you should like this bill because it is a very modest proposal with very minor I guess you could say penalties or inducements to encourage public charter schools and with that Mr. Speaker I do ask that you vote for this bill and I do yield the well thank you. Lady has you to the will that completes the chairman's time and that completes our comments on the bill is there any objection to adopting the committee substitute here in under committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill here in under board the committee's agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine end of Congress? We will have the chairman read it down the floor. Have all members voted. All members voted if so. Mr. Clerk, will you lock the machine? On the past of Senate Bill 82, the yeas are 107, the nays are 62. This bill hasn't received the requisite constitutional majority. Is therefore passed. Members, we're going to pause from the rules, calendar and take up a motion or two and then take up some agrees just agrees so we can get some of these issues moving forward. For what purpose does Wilbur Chett rise? Make a motion? Stage a motion. High motion that we recommit Senate Bill 125, vector rules. Mr. Clerk, will you read the caption of Senate Bill 125? Senate Bill 125, Senator Walker, the 20th and others may be titled an act to amend chapter 15, titled 43, the fiscal to Georgia annotated relating to professional engineers and land surveys. On the gentleman's motion, SB 125, be recommitted to rules committee as objection. Here he none of this ordered. Representative Lynn Smith, chair, committee, Lynn Smith, the draconis for a motion. Thank you, Mr. Speaker and members of the House. Good afternoon. I make a motion that we agree to House Bill 208 as amended by the Senate. That's agreed to the Senate. So, right, chair lady? Mr. Clerk, will you read the caption? House Bill 208 by reps and I'm Smith, the 7th and others to be titled an act to amend code section 40 to 86, the fiscal to Georgia annotated relating to license plates promoting or supporting certain agencies. Representative Lynn Smith is recognized to explain the Senate's substitute. Thank you, Mr. Speaker. This is in your folder number three. I've agreed to disagree. Essentially, the bill is, well, I'll just put it to you this way, Merry Christmas. There are going to be a lot of people who are happy that their organizations can promote what they do in the state of Georgia to go over it briefly. There are two free license plates for veterans who are totally disabled or not totally disabled but disabled. The Shepherd Center, the Georgia Veterans Service Foundation, the Southern University of Alumni, Delta Sigma Theta sorority, the Alumni of Alabama State University. And then what originally started from here was state parks and historic sites of division and the black mass population. Each person to qualify for the right to do this has to meet certain standards established under the DOR. Mr. Speaker? That's your explanation to Lady Yul- you don't have any questions. Are you the way? Thank you, Mr. Speaker. Thank you. Ladies, you're the well. All in the ladies' motion that the House agreed to the Senate substitute, the House bill 208208. All those in favor will vote. Yes, those opposed. We'll vote. No, and Mr. Clerk, were you in a lot of machines? All members voted. All members voted if so. Clerk will lock the machine. All in. All in. House bill 28, the House has agreed to the Senate substitute 164 to 0. The House has agreed to the Senate substitute, the House bill 208. Representative McDonald is recognized for a motion. Representative McDonald. Representative McDonald. Senator, we have a motion. Let's get that one on that microphone's on. Sir, okay. Thank you. There we go. Miss Speaker, ladies and gentlemen, I'd recommend that we accept the Senate substitute to the House bill 113. Thank you, sir. Mr. Clerk, were you reading the caption? Representative McDonald with 26 to be entitled back to a men's title 50 the fiscal to Georgia and to a relating state government So it's a prohibit the state or its agencies from purchasing goods from certain foreign countries are related entities McDonald is recognized to present the Senate substitute to House Bill 113 represent the McDonald Thank you miss speaker This is House Bill 113 this dealt with Companies that are owned by foreign adversaries the only thing that changed in this bill was online 35 and 40 they just changed the 15 CFR to section 7.4 that was the only change that they made General has a question to you for a question from the minority to hugely is recognized for a question Thank you, Mr. Speaker does the gentleman yield yes, ma'am I see online 33 we've changed from The government of Russia to a foreign country of concern Can you talk about Where we going with this The what we've been using was our foreign adversaries they they struck the government of Russia that's that was struck in the original bill so Who who will this affect in terms of agencies and entities? Who are we affecting here? It does not affect the general assembly it affects with anybody that buys their their equipment through Department of administrative services the Georgia Technology Authority will create the list going off what our federal government gives us as far an adversaries and that they will work give that to DOS it is available to the public but They're but DOS will be the purchasing power for the state of Georgia Well the gentleman you have to one other question. Yes, can you give me an example of an entity that we're trying not to do business with Any entity that is buying Listed under a foreign adversary group that's given to us by the federal government. So you don't have an example example of a company. Yes Lexmark Some of the companies that are made in China Thank you The questions out yellow whale misspeak there's one more question Sure, remember the miller is recognized for a question. Thank you, mr. Speaker does the gentleman yield yes is Not the country of Russia a foreign adversary why would we strike? Because we're doing not killing out any countries because Florida's being sued for that right now So we're just going off the list that we're Using that the federal government's getting called foreign adversaries and they're they determine who those people are because of foreign adversary could be an adversary now but could be a foe a friend Ten years later. Do you happen to know whether or not Russia is currently considered to be a foreign adversary? It is on that list. Yes, ma'am Gentlemen, please Gentlemen's yield to the well all the gentlemen's motion of the house agreed to the Senate substitute to house bill 113 all those in favor will vote yes those opposed will vote no one mr. Clerk were you in a lot of machines? Yeah Have all members voted Have all members voted All members voted this so the clerk will lot the machine on the gentlemen most gentlemen's motion the days 146 and nays are 18 and the house is agreed to the Senate substitute to house bill 113 Representative Kelly is recognized for a motion Thank you miss Thank you miss speaker. I move that the house agreed to the Senate substitute to house bill 196 Mr. Clerk were you read the caption House bill 196 by representative Kelly the 16th me title an act to amend part one of article one of chapter 18 to title 45 The fifth go to Georgia annotated relating to state employees health insurance plans Representative Kelly is recognized to explain the Senate substitute to house bill 196 Gentlemen recognized thank you to speaker colleagues if you'll remember house bill 196 was a measure that was brought forth to help our Independent pharmacies keep their doors open we heard many stories from all across our state about the problems with the Price fixing and the schemes put forth by our pbms There's some small changes made in the Senate at the request of the Department of Community Health And but the underlying goal is still the same. I think this measure accomplishes it well I'll ask you your favoral consideration, but I'll be glad to answer your questions gentlemen. Has no questions Thank you ask your favoral consideration. I yield the well All the gentleman's motion that the house agreed to the Senate substitute To house bill 196 all those in favoral vote. Yes, all those opposed will vote no And mr. Clerk will you unlock the machines Have all members voted All members voted if so Mr. Clerk will you lock the machines The only gentleman's motion the yeas are 166 the nays or zero and the house has agreed to the Senate substitute the house bill 196 Are represented Corbett? Chairman Corbett is recognized for a motion Thank you mr. Bigger. I make a motion this house agree to the Senate Senate substitute of house bill 351 I 351 sorry Mr. Clerk will you read the caption house bill 351 by represent a corporate of the 174th to be a talent act to amend part one of our two chapter 8 A total 12 of the fish go to Georgia annotator relating the general provisions regarding solid waste management Chairman Corbett is recognized to explain the Senate amendment to house bill 351 represent your Corbett Famous speaker. Yes, I want to change that the Senate made was the effective date and they changed the effective date the January 1 2026 That's the only change in the bill. I appreciate your support Yeah Gentlemen has no questions as you're the well On the gentleman's motion the house agreed to the Senate amendment to house bill 351 all those in favor vote Yes, opposed will vote no and mr. Clerk will you unlock the machines? Oh Have all members voted all members voted if so mr. Clerk we lock the machines On the gentleman's motion the yeas are 163 and nays are zero and the house has agreed to the Senate amendment to house bill 351 Reps. He baller does recognize for a motion represent he baller Thank you mr. Speaker. I move that this house agree to the Senate substitute to house bill 307 Mr. Clerk will you read the caption the house bill 307 House bill 307 my represent baller to the 147 the others to be titled act to amend part three of article 6 chapter 2 title 20 The official code of Georgia annotated really educational programs under the quality basic education act We're representative ballot is recognized to explain these in its substitute to house bill 307 ladies recognized Thank you All that the Senate substitute does it reiterates that three queuing will not be used as a primary means of instruction It pushes out the sunset date for the literacy council because they have more work to do and it adjusts their Compensation so that their travel expenses\n\nCan be taken care of and they can afford to stay in a hotel when they need to Those are the changes and I'll take questions lady ask her questions. Thank you. I yield the well The ladies yielded the well the good bill All the ladies motion that the House agreed to the Senate substitute to House bill 307 All those in favor will vote yes those opposed will vote no into clerk mr. Clerk. Were you in a locked the machines? Have all members voted all members voted this so mr. Clerk were you locked the machines? On the ladies motion the yeas are 167th and nays or zero the House was agreed to the Senate Substitute to House bill 307 Representative Kelly is recognized for a motion Thank you miss speaker. I move that the House agreed to the Senate substitute the House bill 199 mr. Clerk were you read the caption House of 199 members and Kelly the 16th and others to be titled an act to amend chapter 5 or title 15 The fish coated Georgia and said everything the administration of courts of record generally And represented Kelly is recognized to explain the Senate substitute to House bill 199 General was recognized. Thank you mr. Speaker colleagues if you'll remember House bill 199 passed this body unanimously It deals with the personally identifiable information of our judges across our state and what the Senate changes It was a small clerical cleanup that they wanted to make and they made that and that's the only change with made nothing Substitute I'd be glad to answer any questions gentlemen have to ask your questions. Thank you You're the well and ask your favorable consideration all the gentleman's motion the House agreed to the Senate substitute to House bill 199 all those in favor will vote yes all those opposed will vote no and mr. Clerk were you in lock the machines Have all members voted all members voted And we have a if so mr. Clerk were you locked the machines On the gentleman's motion the yeas are 164 the nays or zero the House has agreed to this and its substitute to House bill 199 Rept. Jason Ridley is recognized for a motion House agree to the Senate substitute amended by the House on House bill 55 We're going to agree to the Senate amendments to House bill 551 as amended by the House is that correct Senate subject got you. That's a clerk. Will you read the caption? House will 551 by Rose and a ridley the six and others to be titled and act to men title 40 the fiscal to Georgia and Attended related motor vehicles traffic social five for conditions procedures and limitations for issuance of a temporary operating permit For reprised you really is recognized to explain the Senate amendments and the House of members To House bill 551 the gentleman's recognize Colleagues if you look there's a substitute on your bill House substitute what we're done in this the Senate first of all They added a little booting language in there to put some guardrails on our booters that we've been having issue with but the House amendment Is on lines 348 to 355 And what that does is deal a little carve out for some of our bigger dealers like Carvana and those kind of folks that sell so this right here just says instead of 250 Square foot if you sell over 500 cards a year that that will work and the next part is Own lines 407 through 418 and what that does is allow the booters to be able to monitor the loss But still all the underlying stuff is in there for as the signage No, no chair and profits with the landowners Um, and that's all the bill does I'll stand for any questions gentleman has no questions. Thank you. Is there any objections to the adoption of the House amendment? Here in none the House amendment is adopted on the gentleman's motion that the House agree to the Senate of the amendments to House bill 551 is amended by the House all those in favor will vote yes those opposed will vote no and mr. Clerk will you unlock the machines? You Have all members voted all members voted If so mr. Clerk will you lock the machines? On the gentleman's motion the yeas are one hundred sixty two the nays are three and the House has agreed to the Senate's Amendments to House bill 551 as amended by the House Will barchette is recognized for a motion Thank you mr. Speaker I make a motion that we accept the Senate substitute to Senate bill 69 agree scar agree Let me let me try that again. I make a motion that we agree to the Senate amended to House To the House substitute of Senate bill 69 Mr. Clerk Excellent Mr. Clerk will you read the caption? Senate bill 69 by senator Kennedy 18 to be titled next to a men title seven an article five a chapter 11 to title nine of the Physical to Georgia and it's either related banking and finance deposition's in discovery under the Georgia civil practice act We're Barchette is recognized to explain the Senate amendment amendment to the House substitute to Senate bill 69 Thank you colleagues. I'm asking that we agree to this substitute as amended on the Senate floor and what this does It doesn't change anything substantive in the Senate bill 69 it changes the Effective date in Senate bill 68 if you recall there were several procedural provisions in Senate bill 68 and several several Evidentiary provisions in 68 of which Section six and seven premises and collateral source were their effective date didn't apply to cases that were already Undertaken what we're doing with this amendment in Senate bill 69 is also making the other evidentiary provision of 68 the seat belts not apply Retroactively to cases that are already Being considered and that's what the amendment does and I'll stand for a question Gentlemen has no questions. Thank you mr. Bigger gentleman's you to the will only generals motion that the House agree to the Senate Amendment to the House substitute to Senate bill 69 all those in favor will But yes all those opposed will vote nowhere mr. Clerk will you unlock the machines Have all members voted all Members voted this so mr. Clerk will you lock the machines on the gentleman's motion the yeas are 120 days are 42 And this House has agreed to the Senate amendment to the House House substitute to Senate bill 69 The Representative whole person or is recognized for a motion Thank you mr. Speaker I move the House agree to the Senate substitute HB 268 Mr. Clerk will you read the caption You Before I recognize ripply the person or This is our school safety bill And it has several pages to it Senator that's past it And I'm gonna let the Reps. Singer explain those changes just a minute But we are printing the bills so it can be on the members desk so you can see exactly what those changes are So we're gonna ask the uh recognize the representative to withdraw his motion representative person or mr. Speaker I will draw my motion That will be temporary as soon as we have it on the members desk so you all would be Have full acknowledgement of the bill we will we'll come back to that You We're gonna move on to a supplemental local calendar should be on your desk. I'm gonna recognize To your lady Beth camp for a motion If what purposes she rise to make a motion Stage a motion mr. Speaker I'd like to remove House bill 851 and House bill 852 in the local calendar and remit it to the intergovernmental coordination committee Thank you mr. Clerk will you read the caption house bill 851 by representative gains of the 120th Athens Clark County House bill 852 by substitute by representative greens of the 120th Athens Clark County Own the latest motion in house bill 851 and house bill 852 be recommitted to the of intergovernmental coordination committee Is their objection? Hearing none it is so ordered You Own your supplemental calendar local calendar third reading in passage of uncontested the local bills If there is no objection We will vote on the local calendar as a whole with recorded vote without house bill 851 and 852 on that calendar Hearing none of this awarded mr. Clerk will you read the local calendar? House bill 756 by substitute by representative jackson of the 165th Chatham County Is there any objections to the previous question being ordered on the local calendar Here in none the previous question is ordered is there any objection to a green to the report of the committee Which was favorable to the passage of the passage of the bill Chair here's none the board the committee has agreed to shout these Excuse me shout this bill now passed all then favor the passage of the bill on the local calendar were vote yes All those foods will vote no and mr. Clerk were you in luck the machine Have all members voted All Members voted on the local calendar All members voted if so mr. Clerk were you locked the machines All in the past to the supplemental local calendar. Yes, or 167 the nays are zero This bill having received a request a constitutional majority is therefore passed Thank you members For your attention mr. Clerk were you read the caption to senate bill 151 back onto the rules calendar members Back onto the rules calendar senate bill 151 151 Senate bill 151 by senator beach and 21st and others to be tiled and act to create the joint a development authority of north Fulton municipalities this bill emperors of the committee on an integral of coordination that committee recommends this bill do pass by committee substitute Pro-TM Jan Jones is recognized To speak to senate bill 151 Representative Jones well, thank you mr. Speaker mr. Speaker this bill It's completely different from the bill that came over from the senate I took that bill out and constructed something regarding the fulton county development authority That the county is neutral on all of the north fulton mayors support it and I Worked also with the fulton county development authority the the legislation only affects fulton county Those of you who've been around have seen we've done a number of bills like this over the years particularly since 2005 when The city the county started municipalizing and is now Completely municipalized with the exception. I believe of Charlie Brown airport They did not want to go into a city and they are the only unincorporated area In the county What bill does is it allows the six north fulton cities By resolution to opt out of the fulton county development authorities ability to offer property tax incentives I narrowed the bill up it took it back to committee a second time to Corporate some language from the fulton county Development Authority chairman To make it more palatable to them What's happened is we have two legacy cities in north fulton who have their own development authority and They do not necessarily want to compete with another development authority I did not include the other nine cities in fulton county because I I don't represent them and I Some of them have expressed interest in similar legislation next year And I would support that But I wanted to leave that up to the legislators who Um, I didn't know what all nine cities would want and I wanted to leave that up to them to make um The best decision for them The reason it's general law and not local law is because Development authority is contained in general law so to make a change like this to allow cities to opt out It had to be general law I had a similar bill a number of years ago that separated the city of Atlanta from the rest of fulton county because the city of Atlanta wanted to Increase their marta sales tax by 50 percent or 50 percent And so it made it work better for the entire county to allow them to do that Independent of the rest of fulton county and the rest of fulton county had a higher percentage for a t-splot Which seemed to be more Desired by the cities in south fulton and in north fulton I did delay the implementation until January 2026 to allow the fulton county development authority to work with the different cities I have no reason to believe the cities will or will not opt out But I'll leave that to their decision-making. I will say this it is Currently and in the future if a city opts out of the fulton county development authority and they choose later to opt back in They would have that right. I didn't need to specifically mention that in the bill because a current city council cannot Obligate A future city council on a decision such as that with this I'd be happy to take any questions And The lady has no questions. Well, thank you and with that I would appreciate your favorable vote on this bill. Thank you Ladies you're the well. We have a couple of folks who want to speak to repost I'm going to ask them to hold it to five minutes or less if you will And so we have two speakers of first where we represented park cannon has recognized to speak to Senate bill 151 Representative cannon Give the lady your attention please Thank you mr. Speaker. Thank you members. I rise today in opposition to this legislation Sitting as the chair of the fulton county delegation We have had over 10 meetings this legislative session to which we have discussed measures that have impacted or could have impact Unfulton county and have requested that the stakeholders come before us and let us know On our last meeting we actually had this bill Senate bill 151 on our bad legislation list and we're pretty surprised to See it sitting here today Because of the concerns that we have had that ultimately the parties involved were approached and told I'm doing something and you either get along with it or You don't and then came back around to our delegation and said well, you know folks are actually okay with it And so again, this is that Local bill should have been a local bill impacts all 15 cities in fulton county and Fulton County has not been asked now I will say that the fulton county external affairs department is neutral on this bill But that's only because they don't have a meeting until Wednesday to which they can look at this new version of this legislation You know This is like you have a bucket We tell somebody you have a bucket everybody can put something in the bucket and then you say you know what I've decided I'm taking this bucket away But I'm going to give a few cups and if you want to put some things in those cups Good for you if you don't well then just too bad delaying the implementation date again It's not something that is to the benefit of these Cities that used to have a bucket and now might be able to opt in or out of a cup I asked that you vote in opposition to this bill. There's more work to be done and respectfully the power players the individuals impacted by this they should be asked how they feel about it Thank you mr. Speaker I y'all Ladies you're to the well We had one more speaker, but she weighs We have one speaker in favor and I'm going to recognize chairman martin speaking favor the bill up to The longer than five minutes of the most sir Thank you mr. Speaker. Let me just speak if I can to send about 151 and then let me Do this because people come to the well and they say things because they say things I guess they think they're true This is a general bill This affects general law therefore it's a general bill It's a general bill That's all there is about that and what this bill does is it allows the cities in north fulton and as the pro-tem spoke It could allow the cities in south fulton if they choose to next year It allows them to have the say as to what development authority can work in their city Doesn't keep them from working with the full county development authority Doesn't stop them From doing it at all does not stop them from working with that They can opt by resolution to not allow them to do it and then later they can opt back to allow them to do it again So we hear a lot about local control and taking things away from people This takes nothing away from any city in north fulton It takes nothing away from the fulton county development authority That The cities want to have happen So I would just stand here before you today. This is a general law It comes forward to us for our vote because it affects Development authority language In the general code section and the cities in north fulton support this Because it gives them local control within their municipal bounds and I asked members But let's don't make this a partisan issue. This is a local control issue For the people in north fulton this year and as the sponsor of the bill said should the folks in south fulton want to do this next year I stand with them and would support them and doing so. I hope you will support the members In north fulton and by that I mean the city members in north fulton in passage of senate bill 151 I yield well You In general as you were to the will that completes our discussion on senate bill 151 Is there any objection to the previous question being ordered hearing none the previous questions ordered is there any objection to Adopt in the committee substitute Hearing none the committee substitute is adopted is there any objection to a green to the report of the committee which was favorable To the passage of the bill Hearing none the report the committee to shall this bill now pass all those in favor of the passage the bill will vote yes All those opposed will vote no i'm mr. Clerk will you unlock the machine Have all members voted All members voted for what purpose does representative Derek Jackson Ross No, no, I have the question for the in ways He weighs all members voted if so mr. Clerk will you lock the machine All in the passage of senate bill 151 the yeas are 101 the nays are 63 This bill hammers in the requisite constitutional majority is therefore passed Mr. Clerk will you read the caption to senate bill 212 212 212 Senate bill 212 by senator still of the 48th and others to be entitled an act to amend part 14 of article six chapter two We titled 20 of the fiscal to Georgia antenna relating to other educational programs under the quality basic education act So mr. prohibit the disclosure of public student directory information to public political candidates campaign committees political action committees This bill ever further committee on education that committee recommends this bill do pass by committee substitute You Chairman Todd Jones is recognized to present senate bill 212 Thank you mr. Speaker Members I come to you with the house substitute of senate bill 212 We have spoken about two different bills today have spoke about student safety Making sure that we are protecting the sanctity of the child and 212 I think speaks to that completely Because frankly I was surprised that FERPA or current law did not already cover this because this is effectively the contact data of a student Senate bill 212 does two important things the first thing it does is it prohibits a school district from basically transferring that child's Information to a campaign a candidate or a pack The second thing it does is that under the cloak of I'll say legitimacy We have seen Organizations go into k-12 Institutions we're talking about k-12 have gone in under the auspices of Effectively going in for registration to vote Getting that data and transferring it to a campaign or a pack We We must protect our children we must protect that data this bill does those two things It does something else that's very important and I want to say thank you to the minority party They added in an exception In section one that ensures That we can for legitimate reasons with the permission of the school of course Which I think many of us go into k-12 institutions we can go there to basically have a registration to vote We can go there to ensure that they are signing up for their selective service We can go there for a town hall again with the approval of the principal or the appropriate person within the school That's found within lines 42 to 55 I appreciate the thoughtfulness of not just a majority party but also minority party on this because we're talking about data We're talking about data of minors and we must at all times put a protective shield over these individuals to ensure that their information is not getting out especially for nefarious purposes We talk all the time about is there a problem There is in 2024 this exact issue occurred in the winnett Fulton and Forsyth County schools We had instances of a campaign doing an ORR For public records to the school of ninth through 12th graders For those who do not know going into ninth you can still be 13 years old 14 years old Trying to attain that data through a public records request A campaign also went into high schools in those same three school districts Acting as if they were there to register to vote help these individuals who are 17 to register to vote when in fact It was there are they were there to collect the data of these minors to transfer\n\nto a candidate's database and potentially into a pack. I ask each of you to consider that during the debate over the last couple of bills, we spoke a lot about student safety. We talked about making sure that our children are protected. This in fact is a common sense piece of legislation that ensures that the good actors are in fact good actors and those bad actors, we are throwing over them a shield to say no, we're going to protect our minors and make sure that their data stays with them. Mr. Speaker, that's the completion of my summary and I'll yield for any questions. Gentlemen has a couple of questions. Representative Jasmine Clark, to your left, it's recognized for a question. Thank you, Mr. Seeker, does it gentlemen, you? Yes, Representative. I wanna call your attention to line 92 and 93. It speaks to having candidates quote solicit individuals under 18 to fraudulently organize an event. What do you mean by that? Like, can you expound on how someone would fraudulently organize an event? Yes, Representative Clark, it goes to my last example. We know that a campaign went into, for instance, Forsyth County schools under the auspices of a registration to vote when in fact the data of the minors was taken in by that campaign and then transferred into a candidate's database. So what we wanted to be able to do in 92 through part of me, 100 was to ensure that we wanted to object to overtly any type of fraudulent activities that would occur in the K through 12 space, especially as it retains to those individuals data. Does it gentlemen, Father Yeild? Yes, Representative. So I understand what you mean. We wanna make sure to protect our students. I also have a student in high school and I definitely want her to be protected. I guess what I'm concerned about is how are we defining which events are fraudulent or which ones are not? And how do we make sure that this doesn't stop groups from coming in and doing voter registration drives in our high schools which I think is very important? Yes, Representative and again, that's why I called out the minority party and we appreciate the partnership and creating this bill lines 42 through 55 speak through exactly what you're asking on the latter part of your question which is if you go to lines 42 through 45, you will see that we want what you just said in terms of registration to vote. 46 through 47 talks about selective service and then what 48 through 55 does is effectively say that you're a testing and writing that you are here for a legitimate purpose. You have informed the school of that legitimate purpose and you have committed to not and I wanna be clear, actively not, transfer to a candidate, a PAC or a campaign. So, gentlemen, for a tiny question. I'm sorry. Yes, and I'll try to do a tiny answer. Yes, thank you. Okay. So, a lot of times when they do the voter registration, they, some groups use like an app to do it. Would this prevent them from being able to use those apps for that purpose? Again, I would say would not prevent the app as long as they attest to and follow what hopefully will be a statue that they are not transferring that data to the campaign, the candidate or to the PAC. Thank you. You're welcome. Those tiny questions and answers are listening to more questions, I can tell you that. So, let's see, how about representing Dubing, Chairman Dubing? You got something to add to this? Thank you, Mr. Chair. I'm sorry. Well, the gentleman yield. Yes, sir. Mr. Chairman, is it not true that by prohibiting the disclosure of this student data that we are taking further steps to control and protect their individualized personal data so that that's not released to the general public as well. I think the chairman is exactly correct. That's one of the aims of this bill is to ensure that that miner's data remains the responsibility of the miner and of course the parent are the guardians. So, thank you very much for the question. Thank you, Mr. Chairman. Great, Bill. Gentlemen, has numerous other questions that we have about five or six seven speakers that make it bring some clarity to this deal. But I'll give you another question to recognize one if you'd like. No, Mr. Speaker, given the number of questions, pardon me, the number of speakers and the time of the day, I'm gonna go ahead and yield the well and ask for your farewell consideration. Thank you, good job, gentlemen. It's yielded the well. Let's see, we have about five speakers that are opposed to Senate Bill 212. We're gonna give you four minutes, a max, absolute max of five minutes each. Hope y'all can hold with the four minutes or less. That would be awful, awesome, not awful, awesome. You know what I'm meant. So, we're gonna recognize Representative Barry and Representative Barnes, your own deck. Representative Barry has recognized, the gentleman's recognized, up to five minutes. Thank you, Mr. Speaker. I rise to an opposition to Senate Bill 212 because it is no secret that I'm the youngest person in the chamber. The media has hailed long about how I and the gentleman from the 42nd are the first Gen Z representatives. Because of that, I am someone who has lived through the very struggles this bill seeks to deepen. My background is different from a lot of you. I'm someone who has organized, who has marched and who has fought for the voices of this bill that seeks to silence. I don't use silence lightly because there are some bills that we have passed this session with hopefully unintentional harms, but SB212 doesn't try to mask it. It is about power, it is about fear, it is about silencing a generation that is standing up and demanding change. This bill is a direct attack on the rights of young people of black and brown students, of first time voters, and I will not stand by while those in power attempt to script them of their voice, their vote and their future. I'm a teacher, but allow me to give you a history lesson. The day is May 3rd, 1963. Children, as youngest five and six years old, to those 16, 17, 18, walked out of school to march the streets to demand freedom and opportunity. They didn't march on to military territory. They marched on their own streets. Streets were they worshiped, streets were they played, streets where they spent time and money. And what happened on this day, on these streets? An authoritarian wanted to silence them and their fight for freedom released dogs and water hoses on children. Over 1,000 children arrested that day. Some of you in this chamber probably remember that day, those images. That only happened because Dr. King understood the benefit and the power of the young voice. He reached out to young people because he understood their hunger. Had SB212 been an effect then, he would have been in jail. A moment that changed history and the courses nation, as we know it, would have never happened if this bill had been effect. I've seen the hearings and read the bill thoroughly and through and through. There are so many lies behind this bill. SB212 does not protect students. It protects politicians who are terrified of the power of young voters hold. This legislator has no power problem with schools handing student data over to military recruiters. No problem with corporations using student data and information to sell them credit cards and loans or to predatory products. But the moment, the moment the same information is used that can help a student register to vote, suddenly we need privacy protections. This bill is not about privacy. It's about stopping students from organizing, mobilizing, and turning out to vote in record numbers just as they have before and as they will again. So we've seen the thing before. Every time young people, especially young black and brown voters turn out in record numbers, the rules suddenly change. And every time the justification is the same. Some vague ill-defined fraudulent event that no one can quite explain. But somehow demands urgent legislative action. Let's be real. What exactly is this fraudulent event? When did it happen? Who was responsible? Where's the proof? You would think that if something so serious actually occurred, we'd be getting specific details and names and dates and evidence. But instead, we get this legislative equivalent to the trust me, bro. In the spirit of March madness, it's like someone claiming they lost the basketball game because of bad calls without pointing to a single replay. If you can't tell us what actually happened, maybe, just maybe, it didn't. And yet here we are again debating a bill that claims to address a problem that does not exist. SBT-12 takes real tangible steps to limit civic engagement based on an imaginary threat. It makes it harder for student-led organizations to connect with their elected officials. The same officials they may have soon have the power to replace. It restricts access to voter registration efforts based on nothing more than a whispered rumor of wrongdoing. So ask my colleagues, are we really going to write laws based on ghost stories? Are we really going to continue to act like democracy is under attack just because some people don't like who's participating in it? Because we keep moving in direction. We won't just be solving a problem that doesn't exist. We'll be creating a real run. A government that legislates based on myths instead of facts is far more dangerous to democracy than any so-called fraudulent event could ever be. With that, Mr. Speaker, I yield the well. Gentlemen, as yielded the well, the chair recognizes representative Barnes to speak to the bill. Thank you, Madam Speaker. I stand in opposition to SBT-12 while I support some of it. There are some problems in the bill that I feel like we need to address. While the intent on SBT-12 may be to protect student information and prevent inappropriate political activity, its unintended consequences could limit civic engagement for these youth, create legal confusion, burden schools, and reduce opportunities for some students, and especially those in under-resourced communities. While SBT-12 is presented as a measure to protect student privacy and uphold election integrity, it raises several concerns and potential disadvantages for some students. One major issue is that it may discourage voter engagement. It may discourage our young voters from voting. It's hard to get them to the polls as it is and with some type of loophole that it could discourage them all the way around. By requiring individuals who help students register to vote or sign up for the selected service to sign written waivers and comply with new rules, this could also deter these young individuals from wanting to vote. This is especially troubling giving that young people already face barriers to civic engagement as we are making it hard for them to protest on campus. They already have barriers, so we are actually implementing more barriers. This bill prohibitions on sharing student directory information with political entities could also restrict important forms of political speech, so we could be shutting these children's speech down as well. It is not distinguished between partisan campaigns and educational outreach efforts, so if the military was coming into the schools to try to recruit these students, that's okay, and their information is okay to be shared in that aspect, but not this aspect. It doesn't distinguish between those two. It could unintentionally prevent students from receiving information about issues that directly impact their lives, so we could be shutting down the ability for them to gain information on other issues. Such as school funding and voting rights or public safety, this raises the risk that schools become more isolated from the broader civic landscape. Additionally, all my other colleagues were saying that fraudulent organizing and event, an unauthorized person is not clearly defined, so I feel like we need to define those more clearly as well. And SB212 could have disproportionate impact on students and marginalized communities who school serving low income rule or minority students often rely on external organizations for civic education and outreach, so this could put a barrier on that as well. By restricting these partnerships, the bill could reduce access to these critical resources for these marginalized communities. Student data is routinely shared with third party vendors for educational technical companies, for military recruiters, as I said earlier, yet this legislation does not include measures to regulate that or protect against those forms of data sharing. While I know we're tired of listening to all of us speak, I just want to reiterate that this does not protect students from as much as we think it does. It actually puts a barrier and a burden on our students. So I hope that we rethink this and put this back to do some more work on this SB212. Thank you, Madam Speaker, I yield the well. The lady has yielded the well. The chair recognizes Representative Adinia to speak to the bill. Thank you, Madam Speaker, for term. Members, I rise in opposition to this bill. I always ask, why is the author writing the bill? What is the purpose of the bill? Who does the bill serve? While the stated goal of SB212 is to protect student and voter privacy, the bill's broad restrictions and vague language may have unintended consequences that limit civic engagement, confuse implementation, and chill legitimate nonpartisan activity in schools. Overreach that could limit nonpartisan civic education. The bill could have chilling effect on legitimate nonpartisan voter registration efforts in schools. While school staff are exempted outside civic groups, like the League of Women Voters or Student Lead Democracy Clubs, may avoid engagement for fair or violating ambiguous provisions. Written at the stations for simply helping students register to vote could discourage volunteers for participating altogether. vague and broad definitions risk misinterpretation. The terms political organization acting on behalf of an fraudulent league organized are not clearly defined and could be subject to political misuse or over enforcement. Unclear language may lead to unequal application dependent on political views or affiliations of those involved. Suppresses are youth political engagement. This will prohibit minors from organizing campaign related events, even voluntary, even voluntarily, may suppress civic interests and political learning at a formative age. Students often engage in political activity as part of classes of all clubs. This law could penalize or silence their inactive. Their initiative. Potentially undermines trust in schools. By placing criminal penalties and burdensome rules around activities like voter registration, the bill may lead schools to overcorrect and restrict all political activity even when allowed. How many of you have been asked by one of your local high schools political clubs to attend one of their meetings? Parents and students may lose trust in the school environment that are perceived as politically silenced over silence or overly policed. FERPA already gives families the right up out of direct-tree information disclosures. This bill may duplicate or conflict with federal law creating administrative confusion for schools. Weaponized in election law enforcement by adding harsh penalties for new, subjective offenses like fraudulent school events, organizations, the bill opens the door to politically motivated prosecutions, especially targeting the youth activists or marginalized communities. So why? To be frank, this piece of legislation was born from a desire for retribution. What? What does this bill do? It does cause confusion. It's still very vague and we still have to work on the language. And who does it not serve? It does not serve our students. It does not serve our parents and it does not serve our constituents. And for that, I ask you and I urge you to vote no one this bill. Madam Speaker, pro-term, I yield the well. Thank you. The gentleman has yielded the well. The chair recognizes representative Sanchez to speak to the bill. Thank you, Madam Chair. I rise here to oppose SB 12 not because I don't believe we must protect students data. I firmly believe we have to protect students data and I think there are some great parts in this bill that do that. The main issue is of course in section three lines 92, through 100, where a campaign pack organization can't organize an event with a student under the 18 fraudulently. What does that mean exactly? It's not defined in this bill. What I'm worried about is that fraudulent term being used to chill and silence the first of amendment rights of our students. At a time where students in this country are being disappeared for excess, I think those first amendment rights as well. We talk about how it's great when students gets to the degree engaged that we need more young people getting involved. Why aren't the youth getting involved? We keep talking on both sides of the aisle how to get young voters engaged in public service and politics and how to get them to vote. And then Gen Z becomes the most politically active youth generation since the baby boomer generation. And now suddenly the majority of parties like hey, whoa there, not like that. Is it because the youth are demanding gun control, swift action against climate change, affordable housing, free public education, a living wage. Is it because of that? They all like those things? Again, I want to reiterate, if section three was removed from this bill, I would support this measure, but that is as it stands, we cannot chill and silence the voices of anyone in this state including our students. Our children will be attacked by this bill with their first amendment rights being attacked. When I represent my constituents, I don't only represent just those who can vote. Yes, I have over 30,000 registered voters in my district, but I have nearly 60,000 constituents, many of them, students and children under 18. Their thoughts, their opinions, and their civic engagement matters, just as much as their parents. And there are many students in your district as well who deserve representation and deserve a have a voice, just like anyone else. We have pages in high school students come to these halls, we applaud them for their civic engagement, but now we want to limit that engagement, their first amendment rights. We want to punish them if they engage in a way we don't like. What kind of democracy are we creating with the passage of SB212 as it is currently? So I urge my colleagues to vote no on SB212 because we cannot silence voices just because you disagree with them. Let's continue to be a democracy. Thank you, Madam Chair, as you will dwell. Gentlemen, as you'll do the well, the chair recognizes representative Howard to speak to the bell. He waves. Is there any objection to the previous question being ordered? The chair here is non-the previous question is ordered. There is a minority report, the chair recognizes representative Wilkinson to speak to the minority report. Thank you, Madam Speaker. Today I rise to oppose Senate Bill 212. And I think we can all agree that we want to protect our children's information. My issue comes on lines 42. So in committee we talked about the crazy idea of a legislator being a parent of a public school student, a legislator being a parent of a public school student, which I was. Under this bill, you can't separate David Wilkerson parent, David Wilkerson PTA parent from David Wilkerson legislator. Those are all connected. David Wilkerson campaign is not David Wilkerson Patterson's residence. They're not different people. So under this bill, if I come in for a career day, which is not open to the public, just so you know, in public schools, career days are not open to the public. It is a meeting in the classroom. And if I say, by the way, make sure you register to vote, make sure you register to select a service. I have to sign a form as a parent slash legislator under this bill. And that's what this says. So the reality is that the people that are doing the right thing are continuing to do the right thing. And you will have some people, some local heads that will go out there and try to get information they shouldn't be getting. But this bill is going to cause a lot of issues. I just hope, and I have one request of the majority party, one request. When we passed the divisive concepts bill a few years ago, it only applied when it attacked Republicans. I said, many emails about divisive concepts attacking this last election, a Democratic candidate, and it went on unheard ears, both within the hallway and within the hallway. So please make sure that if we pass a bill, make sure we apply to everybody fairly. And in this case, that means as a legislator, if you ever venture inside of a school, and you ever tell anybody to register, or you'll be at an event where they can come and participate and get involved in their civic duties, that you make sure you sign in a test that you are not, well, you sign in a test that you're doing that. And I would like to see that we're going to do that, put on the ethics website. So anytime anybody does it, we publicly disclose that we're doing it. Because right now, this bill is going to penalize those of us that have chosen to be in public schools, because it doesn't, in fact, private schools might have stated, those that have chosen to be in public schools are going to impact us. And I just ask that we treat everybody the same way, and we want our students to be engaged. But if we could take a look at those lines, fix it. I would appreciate it. Otherwise, for now, I would say, please vote no on this bill. And with that, Mr. Speaker, I yield the well. Chair recognizes representative Evans to speak to the bill. Thank you, Madam Speaker. Good afternoon, colleagues. I'm going to add my voice to the chorus here against Senate Bill 212. Not because I want our students' information to be out there, Willie Nellie, that I think we should all be able to get it and talk to them, like it seems like some people think, no, that's not what I think. I don't think that's what anybody in here thinks. I think that's able to happen now. I think there's federal law that protects our students' information. And reference was made to the ghost situation during the last campaign. And I think that's exactly what it is. I don't think anybody's information got out there. Or at least no one's shown me that. But if you want to protect student information, that's fine. You want to have an extra law that does exactly what federal law already does. I guess that's fine. My concern comes in Section 3, which starts on technically online, 87. My concern comes in online 92. And this is where we have this language that says, no candidate campaign committee or political action committee and on and on, shall solicit any individual under 18 years old to fraudulently organize an event on the property of any local school system and on and on and on. You can skip down to the last section on lines 99 to 100. Let's just go together here as if we're reading in church to make sure we're clear. Section 3, line 92. No candidate campaign committee or political action committee shall solicit any individual under 18 years to fraudulently organize an event on the property of a local school system, skip down to line 99. When such a event is otherwise prohibited by law or policy of the local school system or an individual school thereof. So what this means is you can't fraudulently induce a student to participate in an event that they are already prohibited from holding. Let me say that one more time. This law says a candidate cannot solicit a student to engage in an event at a school that the student already cannot participate in. Not just that the candidate can't participate in, but that the school can't participate in. So why are we doing this? It also only prohibits soliciting someone under 18 to participate in these events that they're not that they're already not allowed to participate in. So I guess you could solicit a teacher in the public school all day every day to participate in an event that the teacher's not allowed to participate in on school grounds. Why? Why is that okay? Why are we doing this? Maybe somebody has an agenda here. Maybe they want to use this for something else. Okay, let's pretend like this even is a problem for a second. We can't fraudulently induce someone to participate in an event that they already can't do, which means that would never be held at the school. Unless we just assume that every teacher, every principal, every school board, everybody is asleep and is letting this student participate in an event that they are already not allowed to do. And someone solicited them to do it. We've made this unlawful. Let's just pretend like all that happens. Then what? What are we going to do? What are we going to do to this person who's fraudulently induce someone to do something that they were never allowed to do? And never would do. It's never happened. It really is a ghost event. Since there's no real effect if somebody does this thing that is never going to happen, federal law already protects the data. The only thing I'm trying to just apply commonsense logic to this bill, the only thing I can think of is that we're trying to chill the young people. We're either doing that or we're giving somebody campaign fodder for an anticipated opponent. It's one of those things. And I would submit, ladies and gentlemen, that we have much better things to do down here. It's very exciting to get a bill that says relating to educational programs under the quality basic education actually saying, maybe we're going to actually address the quality basic education funding formula that hasn't been rewritten since Joe Frank Harris was governor.\n\nin the 1980s when I was about two. No, what we're doing here is we are either giving campaign fodder to someone and or we're chilling young people. And you know, I have two thoughts about this. I think it's already hard enough to get students to engage in politics because let's be honest y'all, we are not the cool kids in here. We're just not. It's not the coolest thing to do in high school to be involved in politics. So it's already hard enough for that reason. But even with all that being said, we probably have young people participating in politics at higher rate as I've seen. Why do we want to pour cold water on that? And I think that goes on both sides. I mean, I think all of us in here probably had to answer questions that we'd rather not answer because young people are paying attention. So is this to protect us from having to answer the questions that come out of the mouth of babes? Maybe. And why do we want to discourage this will also chill us in this room from going out and talking to students and engaging with them for fear that we're going to be questioned about whether we are trying to fraudulently induce them into an event that they're not allowed to hold. And then when a student is holding an event that they are allowed to hold, maybe somebody thinks it's an event that they're not allowed to hold and then they're going to get questioned. Who puts you up to this missy or little mister? I don't want people coming to me because I'm talking to students and trying to engage them in the process and I don't want people scaring our children. And I appreciate that Representative Wilkerson and I were able to come up here and speak with some of our younger members that were lined up here. It makes me feel useful. But this is how I got my start was with young Democrats. And I know some of you on here got your start with young Republicans. I never, I never even crossed my mind that somebody would think somebody was putting me up to it. And I would like to think that it never crossed the minds of those candidates that I got to engage in, that somebody was coming over to them and thinking that they were trying to get me involved in something that I wasn't supposed to be involved in. That just invites a whole layer of inquiry and interrogation in a process that we should be encouraging. So it's very disappointing that we've had to take up so much time to talk about a bill that really does nothing, stops nothing. And even if we pretend like it stops something, we don't do anything about it in this bill. What? So what? If a person violates what we put out in line 92, nothing is going to happen. So in summary, this bill does nothing. If it does anything, it chills participation in political process, which is something that I would hope this deliberative body would not want to be for. And so I hope you will join me in denying campaign fodder, denying the chilling of political participation by our young people and vote no on this bill. Thank you, I yield the well. Chair recognizes Chairman Erwin for the Chairman's time. Thank you, Madam Speaker. And colleagues, let me begin by saying that there's been an attack on student data going on for quite a while. And it is imperative that we protect that data for our students. There's also colleagues a tack on their time within the classroom for learning. And we must take action to defend our students' time to be engaged in the learning and what we're requiring to them. And it just seems like we keep loading that plate up with more and more distractions, but requiring more and more of their time. So colleagues, the passage of Senate Bill 212 is not just about attending statues, or excuse me, amending statues is about affirming our dedication to the well-being and privacy of Georgia students. Let's come together to support this essential measure, reinforce the walls that protect our educational spaces and unwanted political intrusion. So Madam Speaker, what I'd like to do to somebody who's been much more engaged in this process and understanding what this bill really does, I would like to turn over the remaining of the time, Chairman's time to Chairman Jones. Gentlemen, as yielded the well, and the chair recognizes Chairman Jones to speak to the bill. Thank you, Madam Speaker. We have debated this for some time, but I thought it was important to come back in and just clear up a couple of things. I think first and foremost, there's been a lot talked about assembly, speech, engagement, and I can't tell you how much I agree with all three of those things when it comes to younger voters. When it comes to younger individuals who will become voters, we want to get them engaged into the process. This bill does nothing to their First Amendment right around speech, around assembly. Matter of fact, there's a lot of things that we go to where we're not collecting data. As a matter of fact, I would argue, 90, 95% of the political activities we go to have nothing to do with collecting data. All this is saying is if you collect the data, if you do it under the auspices of, for instance, voter registration, then use it for voter registration. What happens if that 17 and a half year older thinks that he or she has already registered because they registered at the school, and instead of doing the right thing in registering that person, that fraudulent entity literally just took the data and moved it over to a campaign, to a candidate or to a PAC. Second, there has been a question inside of the well around why is this needed? Around why is this needed? We can provide data to provide you information and backup that this occurred in Gwinnett, Fulton, and Forsyth. The first, the fourth, and the fifth largest school district in our state. Let's have that conversation. Third, there was a comment made from the well regarding if fraudulent was defined, I can assure you fraud is defined in the OCGA. 23-2-51. Take a look at that definition and then apply it to lines 92 through 100, and hopefully that will help you turn from a note to a yes. And then finally, a comment was made in the well regarding FERPA, the federal law around student data and student data privacy. I was actually shocked that FERPA does not cover this exact situation when someone fraudulently goes into a K through 12 entity and tries to lure miners in terms of their data. Before I close up, I want to again reiterate number one. Under no way, shape or form is this a first amendment discussion? In my mind, the waters have been muddied when we talk about the idea that this is in fact discouraging these young individuals from doing what is their constitutional right. As a matter of fact, I'll be the first one with a bullhorn telling them, get together, have that conversation. Be passionate about the things that you believe in. Campaign, persuade, do the things that we do in here, but with your colleagues. Just don't do it when you're taking their data and giving it to someone they shouldn't be giving it to. Because you know why? It can be used for the wrong reason. Thank you very much, Madam Speaker. I yield the well. The gentleman has yielded the well for what purpose does Representative Cannon rise? Well, I had a question. I mean, we're in limbo right now. May I still ask the question? Parliamentary inquiry. Parliamentary inquiry, please. Certainly. Is it not true that there has been no lawsuit spoken to in the well regarding the misuse of student data nor what the Board of Education has said, which now will have to weigh in on this measure? I'm sure the lady believes that to be true. Is there any objection to adopting the committee substitute? Chair, here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. All members voted. Have all members voted? If so, the clerk will lock the machine on the past of the bill. The yeas for 98, the nays for 66, the bill having received the requisite constitutional majority is therefore passed. For what purpose does Representative Miller rise? Parliamentary inquiry. Statue inquiry. Madam Speaker, is it not true that if this alleged fraudulent activity had occurred that it should be reported to the ethics office and investigated? The lady is a learned attorney and I'm sure she believes that to be true. Thank you. On the passage of the bill, it passed. Thank you. Members, you have some more additional information on your desk now but we're going to take up some agrees. Representative Sains for a motion. Thank you, Mr. Speaker. I'd motion to agree to the Senate substitute as amended to House Bill 266. Mr. Clerk, will you read the caption? Bill 266 by Representative Sains, the 180th being titled an act to amend Article 2, Chapter 7, and Title 48, the fiscal to Georgia and the Tate relating the impositionary computation exemptions and credits for state income tax. Representative Sains has recognized to explain the substitute and the House amendment. Thank you, Mr. Speaker. I know the hour is late. The price of one green button I'm presenting to you two great pieces of legislation. The first section of the House substitute goes back and modifies the military term and income credit that were the military retirement income deduction. It modifies it from 17,500 which is in place right now to a total of 65,000. We previously had a ladder increase. It simply goes to the final destination of $65,000. Again, only for the military retirement income. Then starting online, 24, we are taking what you previously seen in House Bill 330, which favorably reported out of the Ways and Means Committee. It allows for more flexibility for the law enforcement foundations. Two very important things. It allows for one foundation to see to benefit multiple agencies right now. We're limited to one and as well as allows for more flexibility in what those foundations can do in terms of supporting that local public safety agency that it supports. Mr. Speaker, if there are no questions, I'll yield the well. Gentlemen, has no questions. He's yielded the well. Thank you. Is there any objection to adoption of the House amendment to the Senate substitute here in the House amendment is adopted? On the General's motion that the House agreed to the Senate substitute to House Bill 266 as amended by the House, all those in favor will vote yes. Those opposed will vote no. Mr. Clerk, will you unlock the machines? Have all members voted for what purpose does the rep's name print arise? Make a motion. State it. Pursuit the House rule 133 acts to be excused from this vote. Gentlemen, has that right? The record was so indicate. All members voted. If so, Mr. Clerk, will you lock the machines? On the General's motion, the A's are 1964, the A's are 0, and the House has agreed to the Senate substitute to House Bill 266 as amended by the House. I think members now have on your desk House Bill 268. House Bill 268 as amended by the Senate, and we will agree to accept it as amended by the Senate. I think everyone has that. Now, someone recognize, represent the person for a motion, represent the person. Thank you, Mr. Speaker. I move the House agreed to the Senate substitute to HB 268. Mr. Clerk, will you read the caption? House Bill 268 by Representative Persinger, the 119th to be entitled, act to amend chapter 2, title 20, the Fiscal Code of Georgia, and the Title Related Assembly. Elementary and secondary education, so as to provide for the safety, health, and well-being of students and school communities. Representative Persinger is recognized to explain the Senate substitute. Thank you, Mr. Speaker. I know the hours late, so I'll be brief and just go over the changes that were made. Senate substitute incorporates SB 17, known as Ricky and Alissa's Law, and its entirety that will require all public schools to implement a mobile panic alert system. Much like the one used at Apple I, she that we know saved countless lives and prevented as much a much larger tragedy. This will also require each school to be curitigial mapping dated to be shared with the state and local agencies that respond to emergencies at school systems. The amended 268 also requires GMA and Homeland Security to establish a statewide alert system to report and monitor incidents of safety threats made against schools. It will also require schools to adopt threat assessment plans, providing a structured, disciplinary process to identify, assess, and mitigate potential threats to schools while supporting the safety and well-being of students and school personnel. Bill also creates a qualified student advocacy specialist position who's required to coordinate mental health services for students in crisis, and it also creates the grants to fund those positions. Because after what we witnessed at Apple I, this House committed to champion legislation to bolster school security, mandate stronger communications between our schools and provide critical mental health resources to our students. That's exactly what House Bill 268 will accomplish and ask for your favor. Consideration is bill. Gentlemen, has a couple of questions. Yes, sir. Phil Yeild. Yes, sir. Representative Roberts to your left has recognized for a question. Thank you, Mr. Speaker. Mr. General McNeill. I do. I'm all for all of these security measures. I just am curious on the, was it a listless law, the mapping that is required to be implemented by, I think it was July of 2026. Is there funding in the budget for that or the school systems? I have no idea what they cost. I just wonder if we're imposing an unfunded mandate on the schools with quick turnaround time. Most of the mapping is already required in the school safety plans we did, I believe, in 23. Okay. So it's just in addition to. Okay. Thank you. Gentlemen, you go for another question. I do. We're going to be in it. To your left has recognized for a question. Thank you, with the gentleman Yeild. I do. You mentioned a mental health personnel. Is that per each school or for the school district? I wasn't, I couldn't find it in the bill. So it was originally in our bill as a behavioral health coordinator and that's going to be allocated based on population. I believe it's 18,000, update 18,000 get one that we would fund through grants of 18,000 to 36,000 would have two and over 36,000 students would get up to three that would be funded by the grants that we put in the budget. If they want to have more, they could have more. They'd set the fund in themselves. That's the same thing. Correct. Thank you. Gentlemen Yeild, for another question. Yes, Mr. Speaker. Reps of the barns to your left has recognized for a question. Thank you, Mr. Speaker, Mr. Jinnemann Yeild. I will. As far as the school safety devices, are they to be placed per classroom like the alert system? That is the alert system that we use here at the Capitol. So same thing as the alert bathroom. So are we trying to place those in each classroom? That's what I'm asking. Which alert system you speak? You tell me about the list of law or the one that GEMA is responsible for? I guess the GEMA's law that we're going to implement and put in each classroom. Are we putting these alert systems in each classroom or just in the school? That's information sharing to make sure that if there is a credible threat to a school system that all agencies are involved in that communication, that was part of the lacking at Appalachian. So the other system that you are explaining is the actual device? The device in a list of law is the panic alert badge, just like we have here. Okay. And they will go to each teacher or something like that or student. Correct. Most systems are using that. I think if I'm not mistaken, we have about 80 percent. Maybe a little less than that compliance. All right. Gentlemen, you hear from another question? One more. Reps. The button or to your left has recognized for a question. Does the gentleman yield? I will. There was a great deal of conversation after what happened in Winder and Appalachian school. And one of the things that they were talking about is that the student had only been there very briefly and that the records from the previous school that may have given an indication of a potential problem had not arrived. So when it talks about procedures to meet the requirements and students' education records in a timely manner, is timely mannered identified or...? Within five days. Okay. Thank you very much. Gentlemen, you hear from one more question. One more. Reps. Did you send shares? Is recognized for a question. Thank you, Mr. Speaker. This is gentleman yield. No, will. So the G3 databases are moved from this bill that we passed from the House or... The three databases are moved to correct. Okay. It feels further yield. Yes. But the bill still includes disciplinary records following students if they have a disciplinary record, from school to school correct. Correct. That's currently in a student's record now and follows a student now just not... There's not anything codified as to the time frame. So we're codifying that a student's record, which currently exists, must be transferred within five days. Great. Thank you. Speaker, I yield the well. Gentlemen has answered questions presented the bill and in you or the well, all the gentlemen's motion to the House agreed to the Senate substitute to House Bill 268. All those in favor will vote yes. All those opposed will vote no. Mr. Clerk, will you unlock the machines? All members voted. All members voted. If so, Mr. Clerk, will you lock the machines? On the gentleman's motion, the yeas are 154 and nays are 12 and this House has agreed to the Senate substitute to House Bill 268, the School Safety Bill. Congratulations, Representative Persinger.",
  "updated_at": "2026-02-13T13:26:42.488733+00:00"
}