{
  "video_id": "PLO5uN7tx48",
  "url": "https://www.youtube.com/watch?v=PLO5uN7tx48",
  "title": "1/11/2024 Senate Committee on Regulated Industries and Utilities",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 15,
  "summary": "Here is a summary of the Georgia Senate Committee on Regulated Industries and Utilities session from January 11, 2024:\n\n**Overview**\nThis was a light session focusing on two non-controversial bills that had previously passed committee and the rules committee but did not get a final vote last session. The committee also discussed adding another bill to the agenda.\n\n**Key Actions**\n**HB 455**: Allows healthcare professionals like physicians to seek confidential counseling for issues like burnout without fear of jeopardizing their medical licenses.\n**SB 205**: Allows individuals to renew lapsed professional licenses.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The committee chair joked about the \"privilege\" of serving on this committee.\n- There was some discussion about whether the confidentiality provisions in HB 455 would impact continuing education requirements for licensed professionals.\n\n**Votes**\n- HB 455 passed the committee unanimously.\n- SB 205 passed the committee unanimously.\n\n**Attendance**\nA quorum was present, though one senator abstained from the final vote on SB 205.\n\n**Adjournment**\nThe committee adjourned. The next session was not specified.",
  "transcript": "You\nYou\nThe meeting to order, our second meeting of the year, good to have everybody here today.\nI've got two bills on our agenda, yes, and whatever else Senator Albers may have.\nI was just wondering as soon as we got a kind of a light load and we can get things right\nand the four if we might be able to full Senate bill 163\nto help our small brewers and loosen up those alcohol\nlicenses and put that on here today as well.\nWell, we didn't have enough fun on Tuesday.\nYou want to lie down next to everybody's here today.\nI guess we will have our affected lobbyists will come.\nDo you see Casey or Mark here today?\nMust not be.\nAll right, well, I'll move that to the bottom list.\nBut we will begin with a couple of easier things\nbefore we dismantle the three-tier system.\nwithout having to go through the rules committee.\nThat will be fun.\nI have just a couple of here for us.\nAnd these are both bills that passed out of committee last year\nand passed out a rules committee.\nAnd we're put on the rules calendar for day 40.\nAnd they just didn't get reached.\nThere was no decision made, not to call them up.\nIt was just a timing element.\nI don't believe either a controversial, but we will plan to take action on these today if there's the will of the committee to do so\nsince there\nBills that we've already dealt with the result of that is that they will be the committee report would be read tomorrow\nAnd I would anticipate that they'll be on the calendar the Monday after\nOur budget week if that's what you gentlemen won't if you do not let's at least discuss them today\nSo that we're in a posture where we could act on these quickly on the Tuesday following the the budget break\nSenator Lucas so glad you could join us today\nOh, we do have an alcohol obvious that suddenly has appeared here. All right. You better call your friends\nSo we will call House Bill 455, Representative John LaHood.\nIf you'll take that microphone, we'll light you up there and on the podium.\nJust give us a brief overview.\nIt's just a very few pages and tell us, remind us what you had before it's last year.\nYes, sir.\nWell, thank you, Mr. Chairman and committee for having me back.\nAnd I presented this bill fairly late in the session last year.\nIt did pass to committee unanimously, a non-controversial.\nBut this is basically creates a safe haven for physicians and other credentialed health\ncare workers to go seek services such as counseling to come about burnout and career fatigue,\nwhich is a documented, you know, known problem.\nSo in this era, when we're battling tough workforce,\ncrisis, health care is not immune to that.\nAnd what we want to do is create a safe place\nand encourage physicians and other health care workers\nto go seek help and stay in the game instead\nof silently suffering and compromising their ability\nto render good services.\nSo is there something that blocks that now,\nor how does this make that a safe place\nor an easier for the confidentiality?\nGive us a, if you could direct me to what we do here,\njust that they don't have to report.\nCorrect.\nSo the counselor, for example,\nthat would be seeing the physician\nis not required to report to the licensing board\nunless they see a reasonable,\nUnless there's a probable cause for them to think this would put any of their patients\nin at risk.\nSo it encourages healthcare professionals to seek help without fear of it jeopardizing\ntheir licensing or their reputation.\nCorrect.\nI like that.\nAre there questions from the committee?\nI'll send it again.\nYou number three, I believe.\nThank you, Mr. Chairman.\nI appreciate you, Bill, I kind of curious, I don't know how the medical profession does\ntheir licensing, but does this same board, is that the board that would require continuing\neducation or anything like that, and does this exempt them from any continuing education\nthat they may be moving forward with or requirements in that regard?\nBut not exempt them from any continuing ad.\nLet's see, online, 18, it defines what licensing board means,\nand it lists the Georgia Board of Nursing,\nGeorgia Composite Medical Board, State Board of Pharmacy.\nThose are the professions that would be covered.\nBut no, it does not exempt them from any continuing ad.\nOK, thank you.\nDoes that answer your question?\nYeah, I just, you know, I know if we look at other professions\nyou know each one of them has a board and sometimes they have to have a you\nknow reporting on different things whether they're continuing ads up to date\nand things there so I just want to make sure that we're not not it's mainly for\nhealth care. Good question and no I don't say we just compromises or reduces the\nrequirement for read for to keep their license at all this just keeps helps to\nkeep them, like I said, in the game and removes that fear of, you know, putting their license\nin jeopardy because they're basically seeking help for career fatigue or burnout.\nThank you.\nOkay.\nMr. Chairman, if you're ready, I'll be glad to make a move.\nLet's see if anybody else has a question first, but I'll be ready pretty quickly.\nAnybody else have questions for the author of the bill?\nAll right, then I will recognize you.\nSenator again, if you have a motion.\nMr. Chairman, I do pass LC3393999 House Bill 5455.\nWe have a second from Senator Rett.\nIs there any discussion on the do pass motion?\nThen I'll watch the pleasure of the members of the board.\nWe're going to be a board today, I'll raise your hand.\nWe were yesterday or the other day at work, I thought I'd give it a whirl.\nI do, Madam Leader.\nWhat should we call ourselves today?\nYou have a privilege.\nA privilege committee.\nIt is very much a privilege to be on this one.\nOkay, all in favor, raise your hand please\nand let's raise them enough for our counters\nto keep count and name, look at that,\nit appears to be unanimous.\nThank you so much for doing this\nto help your folks with their burnout\nso they'll be refreshed and healthy mentally\nand physically to take care of the patients.\nWell, thank you for your consideration\nand we do need a sponsor.\nSenator Alberts has agreed to sponsor in the Senate.\nAll right.\nThank you.\nThank you.\nI was wondering if we could get confidential treatment, that might be good for us all, I like that.\nAll right, my sweet mate has arrived from his afternoon nap, we are ready to go.\nI started to slam that door on the way out of the sweet, make sure we got you up.\nbut all right Senate bill now 205 Senator Rick Williams again we have a bill\nthat passed our committee last year passed out of rules committee and went to\nthe rules calendar but did not get reached for action so it was recommitted to\nus on Monday and this has no changes whatsoever from last year and it's only\ntwo pages so I'm gonna turn it over to you Senator if you'll explain what you\nYeah, thank you, Mr. Chairman.\nThis is a very simple bill, like Mr. Chairman stated,\nit passed through last year unanimous.\nThis is just allowing someone who's inadvertently\nlet their license lapse to renew them.\nAnd no changes, same bill this from last year.\nI think it'll see 36, 5, 4, 9, 6, is that correct?\nThat is what we're working off of.\nEverybody has that in their folders.\nOkay, great, thank you, sir.\nBut I'll be glad to answer any questions.\nAre there any questions for Senator Williams?\nAll right, now's the appropriate time\non recognizing Senator Alvers for a motion.\nThank you, Mr. Chairman, moved you past Senate Bill 205.\nThey'll see 35, 54, 96, 36.\nThat'll see 36.\n96.\n36.\nI thought you said that'll see 35.\n35 54 96 oh 36 I'm sorry there you got to pay attention details all right\nI'm telling what you might have just put move to put on the floor there second\nall right we have a second from senator again is there any discussion all right\nall in favor of passage of the motion do pass Senate bill 205 LC 36 5 4 9 6\nraise your hand please. And any opposed? Any abstaining? You vote? You're going to\nabstain there, Luke. Is that was that a yay or a nay? That's a yay. And it is unanimous.\nWe have had people sneak out here and avoid votes, but it's rare that once\nand it's bold enough to sit in the seat and just not vote.\nCouple of, thank you very much, Mr. Chairman.\nI thank you.\nSenator, do you have, you're gonna carry that yourself\non presume, right?\nYes, sir.\nI'll carry it to the floor, thank you.\nI believe it'll be Monday week, but we'll see.\nI'll be the follow-up.\nAll right.\nI'll fund aside that from Senator Albers and myself early.\nWe are pretty formal in this committee and it's really just in a interest of fairness\nto the members of the legislature, the lobbyists that are representing their clients in the\ngeneral public.\nThere's a rare exception but almost always we only take up bills on the agenda and we\nWe try our very best to publish it at least 24 hours before our meetings.\nOur meetings are scheduled, they're pre-set, the Secretary of the Senate has us down\non Tuesdays at 4 o'clock and Thursdays at 2 o'clock.\nI try to do the more complicated issues on Tuesdays because nobody meets after us in\nthis room.\nAnd if we have to run over, you know, to as late as 6 o'clock, we'll do that.\nWe are tightly bound on Thursdays from two to three.\nIn fact, Senator Albers' Committee meets at three today.\nPublic safety might even be in this same room, is it?\nOkay.\nSo we're never able to go longer.\nIt would be an extremely rare thing for a bill to be considered in this committee that\nyou didn't have adequate notice of.\nWe also send in on show and we'll retry very best if there is a committee sub to make\ncopies available and have them in my office 432 for somebody to pick up as soon as\nthey're ready for us and we note on the agenda that it is a committee sub so\nthere are changes and just so you'll know the procedures and if you're ever\nwondering and there won't be just a whole full of rumors on what's going on\nthat's how we play the game here we do have a rule that committee\nsub need to be presented to the chair 24 hours in advance of a meeting that\nthat sounds better on paper sometimes\nand then when we get later in the session\nand things are flying, it's a little difficult.\nBut if it's significant change,\nwe're not gonna stick something in front of us\nthat we haven't had time to review and question\nand come up with proposed amendments.\nIf there's small changes, I encourage members\njust to bring them as an amendment to the meeting.\nSo you're not guaranteed that won't be changes made\non a bill that we're considering,\nbut if it's a significant revamped\nthat requires a committee substitute,\nwe try our very best to let you have notice in advance\nso you can digest those changes\nand be prepared to speak to them\nor ask us questions about those.\nSo we were teasing when we said\nwe're about to dismantle the three tier system.\nIf there are other suggestions on how we can better run\nthis committee for our constituents,\nlet us know we'll do what we can.\nI was disappointed when we got the pre-noticed to you\nabout our committee dinner.\nThat's gonna be Tuesday, January 23rd,\nwhen Lo and behold the venue,\nwhich is the 57th Fighter Group,\ntold us they were hosting the trivia night\nthat night and we were no longer invited.\nBut they are able to do it on Wednesday,\nis it February 7th?\nAnybody got a problem with that date?\nnot, you know, save that date now. We have quite a few people have already asked to help\nus sponsor it. We love you. We got room for many more if you'd like to. We had a great\ntime last year, good food and actually had a DJ on the dance floor later and had a lot\nof good com, Rodry laughed about some of our stories of the various bills that have come\nthrough this committee and love to have your participation again this year. Anything\nfurther from committee members, would you like to announce before we adjourn?\nAll right, thanks so much for being here, meeting adjourned.\n",
  "updated_at": "2026-02-12T19:55:50.957947+00:00"
}