{
  "video_id": "pMKLBB-KsWw",
  "url": "https://www.youtube.com/watch?v=pMKLBB-KsWw",
  "title": "Sen. Wicks Press Conference on National Guard Deployments | 9-8-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Here is a structured summary of the key points from the Georgia Sen. Wicks press conference on National Guard deployments:\n\n**Overview**\nThis press conference focused on the concerning issue of potential federal deployment of the National Guard in Georgia, which Sen. Wicks and other legislators condemned as unconstitutional and a threat to democracy. The speakers strongly opposed using the military against American citizens.\n\n**Notable Moments**\n- Sen. Wicks, a retired Army officer, passionately argued that the National Guard uniform should \"never be used to intimidate or divide\" and that its purpose is to \"protect and serve,\" not be misused against the people.\n- Rep. Bell compared the current situation to the dystopian FX series \"American Horror Story\" and urged the National Guard to \"come not with rifles but with rations\" to help the poor and suffering, not oppress them.\n- Rep. Jackson, another veteran, warned that using the National Guard for domestic law enforcement would violate the Posse Comitatus Act and disrespect the distinct roles of the military and law enforcement.\n\n**Opposition to Guard Deployments**\nThe legislators strongly condemned any potential federal deployment of the National Guard in Georgia, calling it unconstitutional, dangerous, and a violation of states' rights under the 10th Amendment. They called on the Governor and all Georgians to resist this \"federal overreach.\"\n\n**Conclusion**\nThe speakers passionately defended the principles of democracy, freedom, and the Constitution, urging resistance against any actions that would \"trample on the dignity of free men and women.\" They declared that \"this is not Nazi Germany\" and that Georgia must remain a \"beacon of democracy.\"",
  "transcript": "Good afternoon. Thank you for being here. I'm Senator Kenya Wix District 34. As\na retired Army officer with 30 years of service to this nation and now as a\nGeorgia Senator, I feel deeply responsible to speak on the issues that strikes\nour core of our democracy and the values we all share. In light of the recent\ndeployment of the Georgia National Guard, let me be clear. Not only is this\nThis misguiding is unconstitutional, dangerous and inconsistent with the very oath that every\nservice member has sworn to uphold.\nIt dishonors the service, undermines the Constitution, and erodes the trust that binds our communities\ntogether.\nI have served this country for 30 to 3 decades.\nI wore the uniform because I believed in the promise,\nthe promise of liberty, of opportunity for all.\nI have seen the weight of the sacrifices\nthat has made by the soldiers and the families.\nThe uniform should be never used to intimidate or divide.\nIt should be used to only protect and serve.\nLet me end with this.\nThe strength of the American has never come\nfrom turning the soldiers against our people.\nIt comes from defending the Constitution,\nprotecting freedoms, standing for what's right,\neven when it's difficult.\nI will continue to oppose the efforts\nof misusing the National Guard.\nAnd I urge my fellow colleagues, the fellow citizens,\nto do the same.\nOur democracy demands it, the value commands it,\nand our people deserve it.\nThank you.\nI will be followed by a representative Eric Bell.\nThank you, Senator.\nToday seems surreal.\nIt feels like we're living in a movie, or the seventh season of FX's American Horror\nStory, The Colt, where the fear and the manipulation tears communities apart, centering around\nthe cult terrorizing residents after Donald Trump wins the 2016 presidential election.\nBut this is not fiction, this is an ironic hour.\nI'm coming to you not just as a legislator, but as a son of Georgia, as a veteran who\nhas pledged his life to defend this nation as a believer in the dignity of every human soul.\nThe threat to before us is not just on foreign shores, but from within, with the reckless\ndeployments of the National Guard against its fellow American citizens.\nMake no mistake, this is not about public safety, is the erosion of American freedom and\nthe sovereignty, is a portrayal to the very people who stand to fit the bill, you, the\nThe tax payers already in California, the courts have ruled against the unlawful deployment\nin DC awaits a new lawsuit and now let's just see what happens in New Orleans, the\ntide of justice is turning and Georgia must stand on the right side of history.\nIf the National Guard indeed is to be deployed across cities in America, let us dare to dream\nthat perhaps they will come not with rifles but with rations.\nLet them come not to enforce\nLordeering, but to feed the thousands of Americans crushed beneath the weight of poverty and denied economic mobility.\nIf the guard is coming, maybe they can build homes for the thousands who suffer from mental illness and are forced to scavenge our cities and\nSurvive under bridges and in encampments on the outskirts. Maybe just maybe the guard will stand at the schools and\nNot intimidate our children, but prevent the senseless\nmassacres that are committed every day by oddly a person connected to the\nconservatism or MAGA. With the soldiers stand against citizens it's not that\none neighborhood suffers our very democracy is torn apart. Now let the alarm\nring. The garks are coming. The oligarchs are coming and at this point they are\nhere. They whisper poison to our communities and actually poison our food.\nsetting black against brown, yellow against white, and the red against the blue,\nthe destitute against the poor, the poor against the middle class and the middle class\neven against themselves while they laugh to the banks. Let's be clear, members of\nthe armed forces are not only bound by conscience but by law. Under the uniform code\n92 of the military justice service members are bound to a bound to duty to\ndebate, lawful orders, but also bound to refuse unlawful ones.\nThe Newman Burke Principles affirmed that just following orders is no defense against crimes\nagainst humanity.\nThe Department of Justice requires the U.S. forces comply to the rules of law and must\nrefuse parties to the patient and unlawful acts.\nTo turn American troops against American citizens are violation against principle and law.\nno service membership he compelled to participate in such.\nRepublicans, Republican leadership,\nGeorgians of every walk of life, faith, veterans,\nand active duty and law enforcement,\nremember you're oath to the Constitution and to the people.\nNot to capitalism, not to the false promises\nof a authoritarian regime, but to freedom.\nRemember, resistance is the American way.\nThe revolution was fought, not to exchange\none set of masters for another.\nBut to ensure that no king, no tyrant, no dictator\ncan trample on the dignity of free men and women.\nGovernor Kent, I will work with you.\nI will work with every Georgia Republican\nwith the conscience to resist this federal overreach.\nRemember, your back and your knee\ncannot bend unless you bend it to fascism, racism,\nauthoritarianism, sexism, disguised as patriotism\nand religion.\nstop the deployment.\nThis is not Nazi Germany, nor Stalin, Russia.\nThis is supposed to be America.\nThe land of the free, the home of the brave,\nand right now freedom is looking a little thin.\nThis is Georgia, where we want to prided ourselves\non fierce independence, states, rights, local control,\nnot federal servitude.\nIf we refuse to bow to tyranny now,\nthen let's stand together and ensure\nGeorgia remains a beacon of democracy\nin the age of rising darkness.\nHistory of swatching, our children,\nour grandchildren are listening.\nLet us not falter nor be hood, wink,\nlet us stray or bamboozle.\nDC today, Chicago and New Orleans tomorrow,\nAtlanta Nix, let us stand together,\nshoulder to shoulder, and declare one nation\nunder God, indivisible with liberty and justice for all.\nGod bless America, God bless the USA.\nI will now bring you to Representative Derek Jackson.\nI stand before you, alongside my colleagues, fellow military veterans to address a matter\nof profound constitutional and moral importance.\nWe are witnessing a troubling overreach of federal power, one that threatens the very foundation\nof the Republic and most importantly the safety and well-being of our citizens of our state.\nThe federal government potential deployment of National Guard in our streets, with or without\nthe will of our state government, constitutes a direct violation of the principles to\nhave long governed the relationship between the federal government and the states.\nThe Apostle Committatus Act of 1878 is not a mere suggestion, it is a law that prohibits\nthe use of federal armed forces as a domestic police force.\nThis is not about being anti-military.\nOnce again, I remind you that we are military veterans.\nThis is about respecting the sacred and distinct roles of our soldiers and our law enforcement\nofficers.\nOur National Guard members are citizens first and soldier second, trained to defend our\nnation from foreign threats.\nTheir training is not for crowd control or domestic law enforcement and placing them in the\nposition will portray their trust and put both them and our communities at risk.\nThe governor of this state asks Commander-in-Chief of the Georgia National Guard has a solemn duty\nand an explicit authority under the 10th Amendment of the United States Constitution to oppose\nthe federal intrusion.\nThe 10th Amendment states, and let me be absolutely clear, the powers not delegated to the United\nStates by the Constitution nor prohibited by it to the states are reserved to the states\nrespectively or to the people. Public safety and law enforcement are unequivocally reserved\nto the states. When the federal government attempts to supersede the governor's authority,\nit is a flagrant violation of this bedrock principle of federalism. The people of Georgia\nshould be outraged and deeply disappointed that our governor, Governor Kim, is not exercising\nhis commander-in-chief responsibilities according to his oath he took for this office.\nHis primary responsibility is to the citizens of this state, not to the political agenda\nof a federal government such as Project 2025.\nGovernor Kim has the constitutional power to refuse this federal request.\nIt started off with 75 now as 300 brave men and women going to deploy.\nOnce he has failed to do so, he is betraying his oath and the trust placed in him by the\npeople that he was elected to serve.\nLet's be absolutely clear about the pretext for the use of the National Guard deployments.\nThis justification for such a drastic measure is often an unproven, manufactured crisis,\nfictional, deceptive, if you will.\nWe are told that our cities are out of control, the crime is rampant.\nHowever, let us examine the facts, specifically in our state's capital.\nAs Atlanta shares the similar profile to Los Angeles, Chicago, Baltimore, all are large\ncities with a black mayor.\nLet me be clear, Atlanta is not a city on the brink of collapse.\nIn fact, the crime rates are moving in the right direction.\nAccording to data from City of Atlanta and other sources,\nViolent Crime in Atlanta has significantly,\nsignificantly gone down in recent years.\nPoint number one, Violent Crime overall was down\nfor the third, straight year in 2024,\nhitting a new historic low since 2009.\nHomicides in Atlanta have gone down substantially decline.\nOne report says 25% decrease in homicide in 2024 with another stating mid-year of this\nyear 30% drop compared to previous year.\nProperty crime also a significant reduction.\nOne report states that the property crime down in Atlanta is 13% this year thus far.\nreport states the property crime is down prior to pre-pandemic levels. The\ntrending is going in the right direction with right leadership. Again, let me\nbe clear to the folks in the White House. Atlanta is not a city and Georgia is\nnot a state that requires military occupation. Our local law enforcement is\nmore than capable of providing public safety. They are trained for that. National Guard\nare not trained for that. The current trends continue to approve year over year. To use\na National Guard in this context is to manufacture a problem where one does not exist and\nit escalates the situation that already improving. The current misuse of the National Guard\nacross the United States is a dangerous path we are on.\nIt is an attack on our constitutional structure,\na disregard for the sacrifices of our brave men\nand women in uniform, a failure of leadership\nat the highest level at the federal and state government.\nAs a candidate for governor,\nthe people of Georgia deserves better.\nWe deserve a governor who will stand up and fight\nfor the sovereignty of our state and the safety\nof our citizens, not one who will apply or simply acquiesce to the federal\noverreach. We must demand that our elected leaders honor their oaths and\nprotect the constitutional boundaries that have kept our nation free. And with\nthat, we open up to questions.\nAnd do you have any other questions for the speaker?\nWhenever the National Guard or any military force\nis set on American soil, it's a pseudo-active war.\nAnd we are not at war times.\nSo not only do I believe it's unlawful,\nit's unconstitutional.\nAnd it's a slap in the very face of American sovereignty\nin which our founding fathers set out\nto preserve many years ago, both before me and your ancestors,\nprobably set foot in this very land.\nAnd it's our solemn swear as a constitutional officer\nat this state of Georgia to defend that.\nSo before they're even leave the grounds of Georgia,\nbring the troops home, let them stay here with their families,\nwhere they can stay safe, and let's continue to make Georgia.\nOr once it was, the number one place to do business.\nBut let's continue to make Georgia\nand the United States the number one place to live.\nAnd I will add, I mean, right now,\nthey ford deploy these national guards in Washington, D.C.\nWhat are they doing?\nThey're picking up trash.\nThey mowing lawn.\nThat is not mission critical.\nThat is not part of the mission for National Guard.\nWhen we deploy the brave men and women,\nit is not for a beautification of landscaping.\nSo it is an abuse of power.\nIt is unlawful for them to do what they're doing\nbased on the results that we're seeing.\nOur National Guard, our brave men and women\nare actually doing.\nI can't read Governor Kim's mind, but what I will say is this.\nAs I stated in my prepared notes, he is in violation of the 10th Amendment, and the only\nreason why he is curry in favor with this current administration is strictly political.\nas he knows that this goes against the mission of the National Guard.\nHe knows this goes against the scope and scale.\nI mean, it's going to cost an average of $1.1 million a day.\nAnd so here we are.\nWe are Governor Kim already said to all the state agencies,\nwe're going to freeze your money, but yet you are going to deploy National Guard.\nWho's going to pay that bill?\nUs, taxpayers.\nAnd so he is current in favor with this White House,\nand unfortunately, it is an abandonment\nto what he should be doing,\nand that is being a command and chief for Georgia.\nHere I have a political daughter,\nand I'm gonna remember to stay in that\nas a top student for a top-of-the-line student\nand as a chief, check out the bottom of the room\nSo the government cannot predict what's going to happen in Georgia.\nWe're in a hurricane season, for example.\nAnd so if we have a devastated hurricane to come through and hit the rural parts of Georgia\nas it has been in the last few years, we need the National Guard to be here already,\nbeing ready to be deployed if need be.\n300 men and women that he already turned over to the federal government.\nHe has no control over their operations.\nOnce he turned it over to President Trump until the President Trump released those 300,\nhe can't get them back.\nAnd so again, that's the reason why I'm saying the scoping scale of operation, he's not\ntaken into consideration of the needs of Georgian, especially while we're still, as an example,\nwe're still in hurricane season.\nAny other questions?\nThank you very much.\n",
  "updated_at": "2026-02-12T18:41:59.227407+00:00"
}