{
  "video_id": "PoSle1ZiYxo",
  "url": "https://youtu.be/PoSle1ZiYxo?t=352",
  "title": "Georgia House - Day 22 (2026-02-24)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-02-24",
  "duration_minutes": 168,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 22 (2026-02-24) session:\n\n## Overview\nThe session featured a prayer by the chaplain, Father Theodore, who encouraged legislators to take time for spiritual reflection and discernment during the legislative session. The House also recognized the passing of a member of the House family, doorkeeper Mr. Shepherd Green.\n\n## Key Actions\n**HB 124**: No details provided\n**HB 352**: No details provided\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Prayer and remarks by Father Theodore, the chaplain, encouraging legislators to make time for spiritual reflection and discernment during the legislative session.\n- Recognition of the passing of doorkeeper Mr. Shepherd Green.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe transcript indicates that the Speaker called for all members to come to the floor multiple times, suggesting a quorum was present.\n\n## Adjournment\nThe transcript does not include details on when the session adjourned or the next scheduled session.",
  "transcript": "All members will please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members please come to the floor. All members voted. All members voted. If so, Mr. Clerk, where you locked the machines. Door keepers please close the doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by the chaplain, which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 151st House District representing Mike Chokus, Rep. Chokus. Thank you, Mr. Speaker. Thank you, Mr. Speaker, for our talk earlier this morning and the prayer for the people that needed some support from our house. In particular, Terry England, Patty Stinson and Mr. Green. So, I don't enjoy that. But today, it is indeed an honor and a privilege for me to introduce my priest, Father Theodore. He's the church that we attend, the parish we attend is Holy Cross, Greek Orthodox Church in Macon. And give you a little bit about Father Theodore. He's patient. He's got me as part of the congregations, has to be very, very patient. But he started off in the weather industry and worked with the Federal Aviation Administration in Denver and in Atlanta Heart's Field, giving updates and meet-tars to our pilots. And then that led him to the priesthood and around about course after he met his lovely wife, Stacey. He did a seminary work in Boston at the Holy Cross, Greek Orthodox School of Theology. And then was ordained in 2015, spent some time in Charlotte for about three years and then came down here in 2018 at the Holy Cross Greek Orthodox Church in Macon. I mentioned earlier his wife, Stacey, but he also has two sons, Yachim and Basil. Yachim is six and Basil is four, so he has a handful at his house. I would like to welcome Father Theodore to our community here at this house. Thank you. Thank you. Good morning, everybody. Or as we say in Greek, kadimatta, you say, I'm chocolate cookie. It's a joy to return here to the state house to be the pastor of the day and I think the honorable speaker for the opportunity. It's been an honor to serve in this capacity a few times in the past and in the past it has revolved around the date of March 25th. Now this date is significant for Greek Orthodox Christians for a twofold reason. Not only is this nine months before Christmas an announcement that the Virgin Mary would give birth to the Savior, but also the day that the people of Greece announced their independence from the oppression of the Ottoman Empire in 1821. Independence, which by the way was very much inspired by the democratic ideals of our own American revolution and also of course ancient Greece as well. Although it's not March 25th, this is also a significant moment in the calendar year. For both Orthodox Christians and many Christians of other Christian traditions, we're about to begin the period of Lent. Now if you're not familiar with Lent, this is a 40 day period which culminates on the day of Easter or as we say in our Orthodox Christian tradition, Baska, the day on which we commemorate the resurrection of our Lord and Savior Jesus Christ. Now different Christian traditions have different approaches to Lent. You might hear of somebody saying something about giving up something for Lent. I'm going to give up chocolate or I'm going to give up TV or things like that. Now in our Orthodox Christian Lent in tradition, we certainly give up something as we as one Christian body altogether fast rather vigorously. However, the intent is not necessarily on giving up something but the ascetic practice of making space, of making space for things that are good and fruitful. Now this concept of 40 days shouldn't be unfamiliar to you all as I suppose as I understand that the legislative session lasts for 40 days, is that correct? I'm sure it sometimes feels like a marathon and that there might not be time necessarily for extra things in the midst of that. However, I would encourage you in the midst of this session to do something which might seem perhaps a little bit paradoxical by adding something to your plates. Now maybe you do this already and if you do, that's beautiful. That's beautiful. And if not, please accept my humble encouragement. I mentioned the concept of asceticism a moment ago. The word asceticism in English comes from the Greek word askeesis, askeesis meaning to train or to exercise. In the midst of your legislative session, I'm sure that it's vitally important to be training or exercising your hearts and minds to discern what is best for you and for your constituents. This isn't just a theoretical exercise but something tangible. I would encourage you to spend five or ten minutes each day as an ascetic practice, an ascetic practice engaging with something that will sharpen that discernment. For people of the Christian faith like myself, this certainly means spending time with holy scripture, with the Bible. For example, reading, praying, a few of the Psalms each day can be a wonderful and sharpening practice. For others it might mean a different holy text, a meaningful book or even something like poetry. It's a necessity that we spend this sacred time reading, dwelling upon the words of truth, sharpening our discernment, whether it be in the midst of the legislative process or in the midst of all of the realities of day-to-day life. Just as we need to exercise our bodies for physical health, which I definitely need to do that, we need the ascetic exercise, the ascetic exercise of dwelling upon truth, truth, day-to-day for mental and spiritual health. I pray that you all have a good continuation of your legislative session, and for those brothers and sisters in Christ who are about to embark on the journey of Great Lent, I wish you, as we say in Greek, Galie Saracosti, a good 40 days. This time, let us join together in prayer if you would stand. Let us pray to the Lord, Lord have mercy. Eternal God and Father, ruler of the entire universe, enthroned on the presently in the minds and hearts of your faithful servants everywhere, we recognize your presence among us, and it treat you to remain in our midst as we come together this day. We offer our heartfelt prayers for these legislators of the Georgia House of Representatives, and ask you our benevolent and all-knowing master to guide these men and women according to your will, bestowing your ineffable wisdom upon them, and showing them to be loyal and productive workers of good, upholding and promoting all the virtues of a moral and ethical life in God. Inspire them to be merciful and just, to be lovers of virtue and to improve the lives of the people of this beautiful state of Georgia. We pray to you to watch over them and us strengthening us all both in times of hardship and joy, making us worthy to witness the light of your countenance and live by the truth that is you, for you are most holy and blessed, along with your co-eternal son, Jesus Christ, and your all-holy good and life-creating spirit, now and forever, into the ages of ages. Amen. I pledge allegiance to the five of the United States of America and to the Republic, for which it stands one nation, under God, indivisible, with liberty and injustice for all. Good job. Thank you very much. Members, if you will, I remain standing just for a moment before I thank Father Theodore for his message. Doorkeepers, you can keep the doors closed for just a moment. We lost a member of this house family last night, one of our doorkeepers, Mr. Shepherd Green, who worked up in the gallery, and we appreciate his service to the house. He had been ill for a little while, and he passed in his sleep last night. But our thoughts and prayers go out to his family, and certainly very grateful for his service to this house and to this state, and just very thankful for him as an individual. Let's have a moment of silence for Mr. Green and his family, and wish them and give them an extended hour condolences to them. Amen. Thank you members. Thank you, Father Theodore. We appreciate that message, appreciate you being with us. Again, doorkeepers, you may open the doors. Members, you may join Father Theodore in their south any room, and have a photo and greet him. And thank you for his service. Members, our doctor of the day is brought to us by Ripley Sheren Cooper, Dr. Brett Cannon. I'm sorry, Dr. Brett Cannon is downstairs in the aid room. If you need Dr. Cannon, certainly call on me. We appreciate him being here. Chairman Hilton has recognized that chair of the Committee on Information and Audits. General is recognized. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. Thank you, sir. Chairman Hilton, the chair of the Committee on Information and Audits report that the journal of the previous legislative day has been read and found to be correct. Is there any objection to to dispense with the reading of the journal? Chair, here's none. The reading the journal is dispensed with. Is there any objection to to the confirmation of the journal? Here he none. The journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Mr. Clerk. Representative, the 100th, fourth, moves, follow me, establishes the order of business, certain or first part of the period unanimous consent. Introduction to bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Supplemental. Is there any objection to the adoption of the resolution establishing the order of business for the day? Here none. The resolution is adopted. First reading the bills and resolutions, the clerk will read. House will 566 by the represent of Hong on the 100th, Jones on the 25th, Carpenter on the 4th, Friday, the 120 second, Gunner on the 8th and others. It will be titled on active men, chapter 1, and title 10 of the official go to Georgia and it's either linked selling and other trade practices. For creative arts and entertainment. House Bill 567 by the represent of Dempsey, the 13th hatchet of the 150th Hawkins on the 27th, Buckner on the 137th, Taylor on the 173rd. It will be titled on active men, article 2, chapter 11, title 43, the official go to Georgia annotated relating the licenses for the practice and dentistry. Health House Bill 568 by represent of Skoggins on the 14th, Gamble on the 15th. It will be titled on active authorizing governing authority of the city of Uihara. It will be an excise tax pursuant to subsection B of Code Section 48, 1351. Thank you. Andrew governmental coordination House Bill 569 by represent of Howard on the 71st and work hires are the 157th. It will be titled on active men, chapter 8, and title 34 of the official go to Georgia and it's either linked employment security. The industry in labor House Bill 570 by represent of corporate of the 174th, per chair to the 176th, redly the 6th and roads to the 124th. It will be titled on active men, title 36 and 50, the official go to Georgia and it's either linked employment and state government. Natural resources and environment House Bill 571 by represent of Hawkins on the 27th, Jasper's on the 11th, M.C. on the 13th, Jackson on the 128th, and Silcox on the 53rd, and others. It will be titled on active men, chapter 34, title 43, the official go to Georgia and it's either related to physicians, assistants, and others. Hale House Bill 572 by represent of cursing over the 119th, Gaines on the 120th, administration of the 104th, Bill B. Todd on active men, and then it will provide a new charter for the town of Braselton. Enter governmental coordination House Bill 573 by represent of Stevens, the 164th, Saints of the 180th, and Hawkins of the 27th, Bill B. Todd on active men, chapter 21a, title 33, the official go to Georgia and it's an attended related to Medi-Kent. Related to Medi-Kent, care, management, organizations. Public aid community help House Bill 574 by represent of Stevens, the 164th, and 179th, Hitchins on the 61st, P.T. of the 166th, Gilear to 162nd, and others. Bill B. Todd on active men, code section 34, 9, 2, the official go to Georgia, annotated related to applicability, workers compensation. Industry and labor House Bill 575 by represent of McCallum, the 30th, chasper, the 11th, Apollo, the 33rd, McDonald, the 3rd, the 26th, and Hagan in the 156th. Bill B. Todd on active men, title 32, the official go to Georgia, annotated related to highways, bridges, and ferries. Transportation House Bill 577 by represent of Gaines on the 120th, Ridley the 6th, DEMPSY, the 13th, Stevens on the 64th, Williams on the 68th, and others. Bill B. Todd on active men, title 48, the official go to Georgia, annotated related to revenue and taxation. Ways and means. 578 by represent of Chokis, the 151st, Green on the 150th, Gaines on the 72nd, Smith on the 18th, Mathis on the 133rd, and others. Bill B. Todd on active men, part 4, Guard of C2, chapter 5, a title 46, the official go to Georgia, annotated relating the emergency telephone number 9-1-1. Energy utilities and telecommunications. House Bill 579 by represent of Reeves, the 999th hatchet of the 150th, Wheat Hour, 120 first prints, the 130th, Fleming and the 114th, the others. Bill B. Todd on active men, title 43, the official go to Georgia, annotated relating professions and businesses. Appropriations. House Bill 580 by represent of Barnes of the 86. Jackson, the 68th, runner of the 85th, Glaze on the 67th, the La Lalle, the 59th and others. Bill B. Todd on active men, part 2, Article 6, chapter 2, title 20, the official go to Georgia, annotated relating the competencies and core curriculum. Education. House Bill 581 by represent of Hagen on the 156th, Wheat Hour, 120 first, Canon on the 172nd, Neil on the 79th, Smith on the 18th, the bill be title, an active men, title 3 of the official go to Georgia, annotated relating to alcoholic beverages. Regulated industries. House Bill 582 by represent of Gunner of the A3, the 99th, Neil with the 40th, Holling on the 103rd, Smith, the 18th and others. Bill B. Todd on active men, title 1617 and 24, the official go to Georgia, annotated relating to crimes and offenses. Judiciary non-civil. House Bill 583 by represent of Glaze, the 67th, Hagen on the 61st, bottom of the 73rd, Canon on the 172nd, Newt Nolan on the 27th. Bill B. Todd on active men, Code Section 42, 85.1, the official go to Georgia, annotated relating to license plates for certain veterans. Motor vehicles. House Bill 584 by represent of Petrie, the 166th, M.C., the 13th, Taylor on the 73rds. Stevens on the 64th, Lehuda on the 75th and others. Bill B. Todd on active men, title 2631 and 37th, the official go to Georgia, annotated relating to food, drugs and cosmetics. Public and community hailed. House Bill 585 by represent of Jones, the 47th, Jones, the 25th, Martin on the 49th, Thomas on the 21st and Gaines on the 120th. Bill B. Todd on active men, title 33 and 40, the official go to Georgia, annotated relating to insurance and motor vehicles and traffic. Motor vehicles. Motor vehicles. House Bill 586 by represent of Williams, the 112th, Blackburn, the 146th, Williams on the 48th.\n\nHatch it at 150 fifth, frustration 104th and others. Bill B. Toddl and Acto Men are at 3H, Chapter 6 of Toddl, 4080. The fifth is go to Georgia, and Tanya relayed an intangible recording tax. The wave and means. House 587, my reps of gamble 15th and scogons. The 14th Bill B. Toddl and Acto Men and Acto reincorporate the city of Cardiff'sville and the Cardiop County of Bartow. Enter of governmental coordination. House 588, my reps of dinner. The 85th canon and the 58th Iowa. The 50th park of the 107th. Bill B. Toddl and Acto Men are at 4H, Chapter 24 of Toddl, 33. The fish go to Georgia and Tanya relayed the general provisions regarding insurance. Hilt. House 589, my reps of dinner. The 85th canon and the 58th Iowa. The 50th park of the 107th. Bill B. Toddl and Acto Men are at 7H, Chapter 4, Toddl, 49. The fish go to Georgia and Tanya relating and medical assistance generally. Public and community health. House 590, my reps of the 4 to the 170th, per cheddar of the 176th, corporate of the 174th McDonald, the 30th, 26th, weed hour of the 121st and others. Bill B. Toddl and Acto Men, Toddl, 43, the fish go to Georgia and Tanya relating professions and businesses. Irregulated industries. House 591, my reps of dinner. The 8th and way to the 9th of Bill B. Toddl and Act authorized the municipal court of the city of Cleveland to charge a technology fee. Enter governmental coordination. House 592, my reps of dinner. The 8th and way to the 9th of Bill B. Toddl and Acto provide a new charter for the city of Cleveland. Enter governmental coordination. House of resolution 347, my reps of Cox of 29th, Jasper's the 11th, Lays of the 67th. Douglas of the 78th canon, the 170th second and others. Resolution urging all Georgia high schools to establish flag football programs. Special rules. Senate Bill 10 by Senator Goodman, the 8th, Strickland, the 42nd, Watson, the 11th, Summers of 13th, Kennedy, the 18th. Bill B. Toddl and Acto Men, Code Section 15, 6, 2. The fish go to Georgia and Tanya relating the number of judges in superior courts. You do, Sherry. Senate Bill 12 by Senator again to the 47th. Robertson, the 29th, Summers of 13, Dixon, the 45th, Still of the 48th and others. Bill B. Toddl and Acto Men, Article 4, Chapter 18, the total 50, the fish go to Georgia and Tanya relating inspection of public records. Garber Middle Affairs. Senate Bill 68 by Senator Kennedy, the 18th, Gouge, the 51st, Robertson, the 29th, and Adivarta, the 31st, Walker, the 20th, and others. Bill B. Toddl, Acto Men, Tidal's 9th, 1340, and 51 of the fish go to Georgia and Tanya relating the civil practice, contracts, and motor vehicles. Rules. Senate Bill 161 by Senator Hustyle, the 52nd and Paine of the 54th. Bill B. Toddl, Acto, provided a homestead exception from Gordon County School District, ad Valar of taxes. The Andrew governmental coordination. That completes first readers. Yes, ma'am. The second reading of the bills and resolutions, the clerk will read. House Bill 538 by Rep. Chocus of the 150 first. A bill to authorize the assessment and collect the agenda of a technology fee by the Prebate Court of Shlay County. House Bill 539 by Rep. Reves of the 99th, Estration of the 104th, Clark of the 108th, Adinia of the 110th, the Coyote of the 102nd, and others. A bill to amend an act to provide a homestead exemption of $4,000 from all school district ad Valar of taxation, except for the retire upon a de-dendinist, which will apply to the homestead of each resident of Gwyneth County School District, House Bill 535, the Coyote of the 90th, and the Coyote of the 90th. House Bill 540 by Rep. Reves of the 99th, Martinez of the 111th, Estration of the 104th, Clark of the 108th, Adinia of the 110th, and others. A bill to amend an act to provide an additional homestead exemption from Gwyneth County, School District Ad Valar of taxes, House Bill 541 by Rep. Dempsey of the 13th, Cooper of the 45th, Taylor of the 173rd, Prince of the 130 Second, Hawkins of the 27th, a bill relating to definitions regarding tuition, equalization grants at private colleges and universities, by Rep. Dempsey of the 56th, Griffin of the 149th, Carter of the 93rd, Ramona of the 97th, Clark of the 108th, a bill relating to promised scholarship accounts, House Bill 543, by Rep. Dempsey of the 56th, McQueen of the 61st, Bell of the 75th, Dawson of the 65th, Airing of the 145th, a bill relating to general provisions, relative to education. House Bill 544, by Rep. Dempsey of the 56th, Miller of the 60th, second part of the 107th, Hugh of the 141st, Friday of the 122nd, and others, a bill relating to student direct free information, registering to vote with selective service, and pledge of allegiance, House Bill 545, by Rep. Dempsey of the 60th, a bill relating to procedure for preparation and filing of transcripts of evidence or in proceedings where a palant does he needs matter to be omitted from the record and appeal extensions of time for completion of transcript. House Bill 546, by Rep. Dempsey of the 81st, part of the 20th, Dundhown of the 31st, Scottens of the 14th, Gamble of the 15th and others, a bill relating to miscellaneous provisions under the Equality Basic Education Act. House Bill 547, by Rep. Dempsey of the 172nd, Dickie of the 134th, corporate of the 174th, the ex of the 178th, headless to the 72nd, and others, a bill relating to preferential assessment for bona fide conservation use property and bona fide residential transitional property. House Bill 548, by Rep. Dempsey of the 154th, the RTO of the 150th, second, Chokes of the 101st, Samson of the 153rd, a bill to amend and act creating the Albany, Dordey County, Interschool, Intercity Authority. House Bill 549, by Rep. Dempsey of the 34th, Dundhown of the 26th, McCollan of the 30th, and the 12th Hitchens of the 161st and others, a bill relating to reimbursing, outraining expenses by subsequent employer, peace officer, collection procedure, required documentation. House Bill 550, by Rep. Dempsey of the 75th, Sains of the 180th, Townsend of the 179th, Wilkinson of the 38th, Stenson of the 150th, a bill relating to requirements for participating schools, responsibilities of education saving authority, prohibited requirements, and agency not established. House Bill 551, by Rep. Remedely of the 6th, corporate of the 174th, Jasper's of the 11th, Mathes of the 133rd, Jones of the 25th, a bill relating to motor vehicles, and traffic, House Bill 552, by Rep. Cahand of the 81st, Bird of the 20th, and Trand of the 80th, a bill relating to definitions relative to the juvenile code. House Bill 553, by Rep. Stenson of the 150th, a bill to authorize the assessment collection of a technology fee by the prior, or of Taylor County, House Bill 554, by Rep. Stenson of the 179th, Jones of the 25th, or when the 32nd, Ballard of the 147th, plays with the 67th, and others, a bill relating to the health of students. House Bill 555, by Rep. McCallum of the 30th, mom to head of the 17th, college of the 19th, the Australian of the 104th, Friday of the 122nd, and others, a bill relating to regulations, specialized land transactions. House Bill 556, by Rep. St. of the 28th, Williams of the 148th, McDonald of the 26th, Gunnjard of the 8th, Pile of the 33rd, a bill relating to operation of watercraft identification, and operation by minors. House Bill 557, by Rep. St. of the 27th, Cox of the 28th, Clark of the 100th, done to the 31st, McCallum of the 30th, and others, a bill relating to the number of judges, of Superior Courts, House Bill 558, by Rep. St. of the 120th, Demstee of the 13th, Newton of the 127th, the bill relating to vocational technical and adult education. House Bill 556, one by Rep. St. of the 173rd, Stevens of the 164th, St. of the 180th, Green of the 154th, Buckner of the 137th, another to bill, the Lane 2, Surface Mining, House Bill 562, by Rep. St. of the 173rd, Stevens of the 164th, St. of the 180th, Green of the 154th, Buckner of the 137th, another to bill, Surface Mining, House Bill 563, by Rep. St. of the 94th, the 33rd, Corb. 174th, you believe the 141st, the 143rd, another to bill relating to prestige license plates and specialized plates for certain persons in vehicles, House Bill 564, by Rep. St. of the 56th, ladies of the 67th, Crawford of the 89th, slantess of the 117th, St. of the 42nd, a bill relating to health of students, House Bill 565, by Rep. St. of the 179th, Franklin of the 160th, Leopard of the 133rd, Camp of the 135th, a bill relating to income tax, imposition rate, computation, exemptions and credits, House Bill 576, by Rep. St. of Williams of the 168th, Smith of the 18th, Lums of the 12th, Jackson of the 128th, you believe the 141st, a bill relating to the Fair Business, Ms. Practice's Act of 1975, House Resolution 328, by Rep. St. of the 77th, Scott of the 76th, and Flornaly of the 74th, the resolution recognizing Chief Jeffrey E. Turner and dedicating a road in his honor, Senate Bill 96, by Senator Eccles of the 49th, hatchet of the 50th, House Debt of the 52nd, Paine of the 54th, Robert's of the 29th, and others, a bill to amend various titles of the OCGA, Senate Bill 98, by Senator Calder of the 46th, Strickland of the 42nd, again of the 47th, Watson of the 1st, Karpatric of the 32nd, a bill relating to Guardian Award, Senate Bill 102, by Senator Robert's of the 29th, Paine of the 54th, House Debt of the 52nd, Williams of the 25th, Albers of the 56th, and others, a bill relating to gambling. Senate Bill 138, by Senator Dixon of the 45th, still of the 48th, Calder of the 46th, that's the 37th, and the number of RTA of the 31st, a bill relating to the incorporation and municipal corporations, Senate Resolution 23, by Senator Calder of the 46th, due to the 51st Kennedy of the 18th, Albers of the 56th, each of the 21st and others, a resolution applying to the United States Congress to call a convention on our article five of the Constitution of the United States, limited to proposing amendment to the Constitution, to set a number of terms, that a person may be elected to the United States House of Representatives, and to set a limit on the number of terms, that a person may be elected as a member of the United States Senate, three second readers. Reports of standing committees, Mr. Client, will you read? Representative Carpenter of the Fourth District, Chairman of the Committee on Creative Arts and Entertainment submitted the following report, Mr. Speaker, Committee on Creative Arts and Entertainment, has had an urge consideration, following bill of the House, as the St. John Domingue Reports same back to the House, the following recommendation, House of 475, due pass, respectfully submitted, Representative Carpenter, the Fourth District, Chairman. Representative Chris Irwin, the 32nd District Chairman of the Committee on Education, submitted the following report, Ms. Speaker, Committee on Education, it's had a nerd's consideration, the following bill of the House, as the St. John Domingue Reports same back to the House, the following recommendation, House of 267, due pass by substitute, respectfully submitted, Representative Chris Irwin, the 30 second district chairman. That completes the reading of the reports and standing committees. Members, I'll ask you to come back to your seats. House come to order. We're ready for morning orders. Morning orders. Members, will please take your seats. House will come to order. Members, please take your seats. While you're coming to your seats, we have a treat today. Up in the gallery, as a lady who's done a marvelous job of bringing up a young man, he's done a great career, played a little football, and as a distinguished member of this house, that's Miss Betty Cates. Miss Betty stand up. That's the mother of Demetrius Douglas, representative Douglas. Miss Betty Cates, good to have you in the house. You do a good job with him. He's a good man. He's a good man. Did you ever have to whip him when he was little? Yes, you did. Can you still do it? I'm going to have to call on you from time to time to get you to do it again. Good to have you with us. I recognize Ripney C. Ball and leader of the administration for our first morning order. Give the gentleman in the well, your attention, please, and some other folks. Gentlemen will suspend just for a moment on the make sure. Members of your give, the gentleman in the well, your attention. Gentlemen's recognized. Thank you, Mr. Speaker, ladies and gentlemen, esteemed colleagues. We rise today with my colleagues from the East Coast to honor the memory of Amal Aubrey, a young man with a bright future whose life was tragically stolen from him on February 23, 2020. Amal was out for a run in a neighborhood much like the ones that we live in today, a normal activity that should have never placed him in harm's way. What happened to him was a heartbreaking reminder of the work we must continue to do to confront hate and insure justice. Today we are privileged to have with us in the gallery members of the Amal Aubrey Foundation, along with a remarkable woman whose courage has illuminated a path forward in the wake of unimaginable loss, Miss Walnut Cooper Jones, Amal's mother. Miss Cooper Jones, your strength and resilience are extraordinary. You have turned grief into a movement for change creating the Amal Aubrey Foundation to promote racial justice, foster youth empowerment and build stronger and safer communities. Your work reminds us that even in the face of tragedy hope can rise. You've transferred Amal's legacy into a call to action, one that compels us to reflect, to grow and to do better for those we serve. Amal's story is not just his story. It is a story that echoes the hopes, fears and struggles of so many. It is a call to all of us in this chamber to reaffirm our commitment to building a society where justice is not just a word but a reality for every individual, regardless of race, background or circumstance. While he has let us honor Amal Aubrey, not just with our words but with our actions, may his memory inspire us to continue pushing for a world where every person can run freely, live boldly and dream without fear. Miss Cooper Jones, thank you for reminding us of what courage looks like and today we stand with you. In honor of Amal's life, his legacy and the profound message in his story that he has left with us all. Mr. Speaker, my good friend from Liberty County would like to say a few words. Thank you. A few things in our lifetime with a big Georgia like the murder of Abod Aubrey. But most memorable is how you, his mother, picked up the mantle and made sure that this nation knew what happened. I was privileged in my first term in this house to represent the area that you all lived in. So we shall never forget and this state showed a great amount of courage and character and integrity in signing the hate crime bill because of the murder of Abod Aubrey. Thank you, Miss Speaker. Thank you, members. Thank you, Mr. Speaker. I yield the well. Thank you, members. Miss Jones, thank you for your courage and what the work you're doing. Thank you for that and thank you for being here with us today. We most appreciate it. It's important and I appreciate you being here. Thank you, members. Representative Jasmine Clark. Representative Clark has recognized for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Today I have the honor and privilege of welcoming to the people's house and help for healthcare professionals incorporated. This nurse led organization was started as a means to make sure that we had good mental health support and health equity initiatives for healthcare professionals, especially during the pandemic and beyond. Since its inception, health for healthcare professionals has positively impacted over 22,000 healthcare professionals and first responders across 20 counties in this wonderful state. They have delivered essential support through programs such as Frontline Care and Recovery Care Program, the Crossroads Education Program and the Youth Med Mentorship Program. Today and the gallery we have with us, Michelle Yan McKinsey and others from healthcare professionals. If you all could stand, you're here. Oh, there they are. Over there. Thank you so much for being here. Thank you so much for your commitment to healthcare professionals. Thank you for all that you do. Please meet me downstairs in the anti-room for a picture. Thank you, Mr. Speaker. Thank you. Thanks all of our healthcare professionals. We appreciate what you all do for us. Representative El Ayer, Representative Reese and Representative Crawford. I thank you guys. Have some guests in the gallery. If you all would convene down front. Gentlemen has the will. Thank you, Mr. Speaker. Good morning, colleagues. It is my great privilege to recognize Mr. Richard B. Sagers of Atlanta, Georgia and his extended family who are with us today up in the gallery. Mr. Sagers served our nation in the United States Army's 11th Airborne Division, but is best known for being the first black over the road truck driver, breaking through the racial barriers that once kept black drivers from long haul trucking jobs. He took this case all the way up to the Supreme Court in one. Today is especially significant because it marks the 32nd anniversary of Mr. Sagers passing as we reflect on his life and legacy. We are honored to have with us or to recognize, believe his wife, Ms. Betty Sagers, now 91 years strong. She cannot be with us for health reasons, but we wanted to give her a special shout out. And she stood by his side throughout his fight for justice. We also recognize his daughter, Veronica Peoples, and my good friend and his grandson, Keith Sagers, along with other grandchildren and great grandchildren who carry on his remarkable legacy. So Sagers family, could you please stand and be recognized? We have a wonderful resolution commemorating and recognizing his achievements. Welcome to the Peoples' House. Thank you, Mr. Speaker. I yield the well. Thank you for being with us and the Peoples' House. A great story. I'm glad to learn about it. Thanks for being here. Represented honer and representative Tarvan. Y'all are recognized for a morning order to give the gentleman the well. Thank you. Thank you, Mr. Speaker. Today we welcome to the Peoples' Chamber, Ringled High School Tiger Guard drill team. Please stand. Each representative has gyms in their district, and from mine comes this nationally recognized team with over 50 trophies and championships, specifically Commander Pearl, who has won an astounding five national titles. Today, I ask the House to rise in recognition of this team who has brought pride to Ringled and to our great state. Thank you. Absolutely. Five national titles. That's impressive. Thank you all for making that trip down and thanks for your dedication. Thanks for recognizing them. Good to have you all in the Peoples' House. Representative Cummins. Here she comes. Representative Smith, your own day. Representative Terry Cummins is recognized for a morning order. Any members of the Maybelton delegation here are Cobb delegation. Maybelton are Cobb delegations. Join the lady in the well. In honor of her. I like to welcome this morning students from Peoples' High School. Please stand. And students from South Cobb High School, will you please stand if you're here. Also have Michael Owens, the mayor of Maybelton here in the House. And I'd like to welcome you all to the Peoples' House. Speaker I yield the well. And thanks Pebble Brook and South Cobb for being here. Hope you have a good day at your state capital. And you have some great members. Appreciate y'all taking time out of your business schedules. Representative Smith is recognized for a morning order. Representative Smith. Thank you, Mr. Speaker. Appreciate that. Well, I talk about him a few minutes. I'm going to ask a young man from Harris County, Joey Gibbs, if he would stand up. He's up here in the gallery. Ladies and gentlemen, Joey and students like him. They're the future of the state of Georgia. And I am tickled to death that he was able to come with his family today and be with us. He's been participating in skills USA for the past four years. He's a senior. He knocks it out of the ballpark. He's been, I've seen it with my own eyes at the Trade Center in Columbus, Georgia. His plumbing skills are unbelievable. His dad and his mom's with him. I'm going to ask his family to stand up too. But he's followed in his dad's footsteps and been plumbing since he was 14 years old. And he is the future. He's been offered a number of job offers just from these skills USA programs. And he is an outstanding young man from Harris County, Georgia. So I'd like to ask you to recognize Joey today and thank him for what he does for our state. Thank you, Miss Speaker. Are you well? Let's see. She's here with Ron Stevens and some friends from Savannah. Yeah, several friends from Savannah. And from the delegation, you go to Jordan there. There she is. There comes some more. Anyone else from the delegation? Mr. Chairman, hold it for a minute. Just pause for a minute. You've got all your support behind you now. Don't you? Yes, sir. All right. Gentlemen, recognize. Thank you, Miss Speaker. Ladies and gentlemen, the House. Today we're honoring the Savannah Country Day School target team. Just six years ago in 2019, they were formed. And in the short time, this COED team is led by Coach Eric Hoss and his amazing coaches. And let's not forget Janine that really pulls things together. Has a track record of success. Well, the team in the middle school athlete, six and eighth grade, and the varsity teams night through the 12th. The team has some of the most accomplished shotgun shooters, not only in the state, but in the country. Sentence andception, the Savannah Country Day varsity team, has produced the 22, 2022 individual state champion, a two-time individual female Georgia state champion, an individual Georgia state champion runner up in 24, two varsity state championship titles, in 2022 and recently in 24, and two high school national championship team runner-ups, two national championship team runner-ups. Ladies and gentlemen, at 2022, excuse me, the 2024 Georgia state championships of the Savannah Country Day School competed against over 600 athletes, 49 high schools. This year, the team led by Captain Chase Berger, Dan Bradley, and Miles Carson was at an amazing accomplishment for both the high school and the middle school state championships. Two recognitions, if you will. If you're on that state championship team in 24, would you recognize these folks in the gallery from Savannah, Georgia? They're the best in the state. Stand up. Thank you. And if you were on the national championships, would you please stand up. There's ten of you up there. Give these guys a hand. Thank you, Mr. Speaker. Thank you, Mr. Chairman. Not just state, if I heard you correctly, but national championships. Congratulations, Savannah Country Day has got a proud heritage. And we appreciate y'all taking time to come join us. And congratulations. Keep doing what you're doing. You're doing it right. No doubt about that. Congratulations again. Chairman Hitchens, you are recognized for a morning order. Give the gentleman the well, your attention, please. Thank you very much, Mr. Speaker. And some friends from Millageville and the district. Colleagues, today I'm honored to have a young group of students with us to attend Georgia, to attend Georgia Military College. Estabrics October 14, 1879, by the Georgia General Assembly. It's been in effect ever since. They have several different types of programs, but K through 12 students. They have a junior college, which 80% of the students are either first generation students or have low income. And third program is they have a PIP school for the military academies. 95% of the people that graduate from their PIP school go to West Point, the Naval Academy, the Air Force Academy, or the Coast Guard Academy. Let's welcome the group from Georgia Military College. I think they're over in the Senate, but they're very easily identifiable. If you see them out in the hallways, say hello to them. Thank you, Mr. Chairman. We have a great group here. We will excuse them for being in the Senate this morning. But we appreciate them being here and we have a photo with them this morning. You have one more? Thank you, Mr. Speaker. I just want to also tell you how much we support Georgia Military College. I retired from the Army 34 years ago and immediately became a strong supporter of GMC. Matter of fact, I served on the Board of Trustees there because the mayor of Milliersville is automatically on the Board of Trustees. And this morning the students were here and cadets along with the President at a reception downstairs. So thank you all for your support. Thank you.\n\na lot of traffic on the floor. Those of you who need to take the off ramp, go to the annual room please. We have some an important recognition. So members, please take your seats. We have some very, very accomplished Georgians on the floor. So if you, this south any room, either go out the door or come to your seats, whatever your pleasure is. But let's just do it right now. South any room door. We have a very accomplished Georgian who's involved in some of the most important work that I'm done with. And we're blessed to have him take up this mantle. He's doing a fabulous job of making sure our future and the future of our Georgians are bright. I invite Chairman Irwin to come up. Mr. Clerk, will you read the caption to House Resolution 180? House resolution 180 by Representative Irwin of the 32nd ballot of the 147th way to the 9th part of the 5th, Chocas the 151st and others. A resolution recognizing and commanding Georgia Reed's coach Malcolm Mitchell. Mr. Chairman, you're recognized to talk about a pretty special young man. Mr. Chairman. Thank you, Mr. Speaker and colleagues. I'm proud to introduce someone to you that most of you, I believe, know I'm sure that you are aware with House Bill 538, the movement that we have been doing in this state to increase the literacy rate of our young people and making a difference to help them to achieve their dreams in life. We know the importance of the foundation of reading and the difference it'll make in your life. And yes, Mr. Speaker, I agree with you. Some of the most important things we do this session will be continuing to help our students learn to read. We have this gentleman with us, it's not only a Super Bowl champion, but a fellow University of Georgia graduate with me that I am very proud of of his efforts within this entire country for changing the literacy rates of young people. And then if I've seen the numbers correctly, 17 countries that they share the magic foundation that Malcolm Mitchell has begun has changed lives of these children. So without any needed introduction, y'all please help me welcome Malcolm Mitchell here to our chamber. Thank you. That's appropriate. There are so many people that I need to think because all of you have been tremendously supportive. I do want to read off a few names because it is important to me to make sure that I recognize still have been extremely supportive. So I'll start with speaker Burns. Thank you. Mrs. Dale Burns. Thank you. Chairman Chris Irwin. Thank you. Representative Bethany Ballard. Thank you. And standing right beside you is a friend. Those are the few people who love New England that lives in Georgia. Representative Carmen Rice. Thank you all. And thank you to all of you who have shown your support. As you have learned, my name is Malcolm Mitchell. I was born and raised in Valdosta, Georgia. And I grew up under the premise that football was the most important thing in the world. But I've learned through my experience and statistical evidence that reading is the most self empowering tool a person could possess. And that's why we set out to make sure that our communities are strong readers. So they will grow up and be strong leaders and productive members in this amazing society that we're working to create. Now the latest 2024 name scores show that only 30% of our third graders are reading at or above proficiency levels, which means 70% are not reading at proficiency levels, which means we still have a lot of work to do. But I know we can accomplish that together. I'm very thankful that the Georgia Council on Literacy and Chairman Scott Johnson, where are you? There you go. We're willing to allow me to be the Georgia Reads coach, which means I get an opportunity to go out into our communities and hopefully motivate, inspire and encourage the new generation of readers. I hope that all of you will join me tomorrow on February 25th at noon for Georgia Reads Day. We had over 130,000 students across Georgia participated in a program to motivate them to read. And we will be awarding the top readers tomorrow from Wayne's Burrow, Albany, Kingsland and Chadahoochi County. We will also be recognizing the community award winners for the Georgia Reads Awards. If you are free, I think you will be very inspired by seeing the children, loving and engaging in something that's meaningful. Thank you for your time this morning. I will leave you with this. Let's not get tired of doing good. To all of the partners, to all the supporters, we appreciate you. Let's all keep reading. Thank you. Welcome. Mr. Mitchell, you know we all have opportunities in life and you've had some great opportunities and you've made a difference and your athletic career made a difference. But what you're doing for reading and for literacy is changing Georgia, changing our country and as I just heard, it's going to change the world as well. Thank you for empowering our youth and what you're doing. This house stands behind you not only as a body but in our communities. So call on us. We're there for you and we want to be a partner. Thank you for everything you're doing. Thank you. I'm at any room at this time. Members. Members, Malcolm says he has a few minutes. If you're joining in the South any room and thanking for what his efforts and also you have a photo with him. We'll let you do that as well. I'm not sure what you'll charge you but because he is in the fundraising mode doing good work. So if you want to join Malcolm in the South any room, that'd be appropriate. We're ready to move on to the rules calendar. Mr. Clerk, will you read the caption to House Bill 287-287? House Bill 287 by Representative Rhodes, the 124th and others to be entitled to enact a men code section 12 to the fiscal to George annotated relating environmental protection division, environmental advisory council duties to the council and members and director. This bill that would refer to the committee of game fishing parks. That committee recommends this bill do pass. General who serves as a chairman of game fishing parks, Chairman Rhodes is recognized to present House Bill 287. Thank you, Mr. Speaker. Ladies and gentlemen, we have before House Bill 287, this is our agency bill and it does four things. The one thing it does it updates the year from 24 to 25 and it codifies our rules and rigs that were set forth by DNR Board last year. We changed our definition on our courtesy hunting license on our disabled courtesy hunting license. This language only allowed non-residents to qualify for courtesy fishing license if they were paralyzed or disabled veteran. This new language allows all paralyzed and all disabled residents and non-residents and expands opportunities from not only fishing but also hunting. We had to go back and redefine our youth category. We had different species that had different age brackets. So our youth category is now under 16. And the last thing we did in this bill is we're trying to help our shellfish industry down on the coast. We modified our license structure there instead of individual licenses. Now our master harvesters can go in and buy a license for up to $10 for $200 and an unlimited license for $400. So Mr. Speaker, that's the bill. If there are any questions, I'll try to answer them. Chairman, I was standing with a five time national champion right there. Much more important than me, Mr. Speaker. I guarantee you this is pretty important bill as well. You have no questions. Thank you. I ask you all's green vote. Is there any objection to the previous question being ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report of the committee is agreed to. Shout out. This bill now passed all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all been voted. What purpose is representing heft and arise? Good morning, Mr. Speaker. Parliamentary inquiry. Mr. State January. Isn't not true that I am supporting this bill because it not only offers to extend benefits, but it maintains the integrity of the benefits that we currently afford to Georgia veterans in the state, sir. I think the ladies read the bill and I like her positive attitude working on good legislation. Thank you. You're exactly correct. Thank you, sir. Have all members voted. So, Mr. Clerk, will you lock the machine? On the passage of House Bill 287, the Yays are 171. The Nays is zero. This bill has received. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 182? 182? House Bill 182, by Representative Lomston and the 12th and others to be entitled to amend chapter 25 in Title 33, the official go to Georgia and instead of relating the life insurance to its superhibit, a policy of group life insurance from excluding or restricting liability for certain deaths occurring while an individual is on active duty. This bill ever referred to the Committee on Insurance, that committee recommends this bill do pass. Representative Lomston is recognized to present the bill. Mr. Speaker, members of the House, I bring to you a House Bill 182. This is a Department of Insurance bill that deals with group life insurance as it pertains to members of our armed forces. Every life insurance policy contains exclusions. An exclusion is defined. It's a defined cause of death that is not covered by the terms of the policy and is clearly stated in the language of the policy. In most policies, the term active war is most often used to define this exclusion. However, in a group life policy, the term active duty is used. Now, a person can be on active duty and not be in a war zone. In fact, only about 5% of our military actually see combat. So the purpose and language of this bill is to make it clear that simply being on active duty in and of itself is not a valid reason to deny a claim. Mr. Speaker, fellow House members, that's the bill. I would appreciate your favorable consideration. Gentlemen, this have a question if you do. I do. Chairman Bonner, to your right, has a question. Gentlemen's recognized. Thank you, Mr. gentlemen. I do. Thank you for bringing the bill. Is it not true that ensuring consistent life insurance coverage for service members can provide peace of mind for both them and their family members during times of service? The gentleman knows what it speaks. Thank you for the bill. Gentlemen, has a further question. Thank you. I yield the will. Mr. Chairman, thank you for bringing this bill. Is there an objection to the previous question being ordered? Here in the previous questions ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in the report, the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? We all vote yes. All those opposed? Yes. Thank you. Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is represented, Chaz Cannon-Rise? All in favor of the bill? Mr. Speaker, is it not true that Georgia has a long standing commitment to supporting our service members and their families? And H.P.1-82 upholds that tradition? Gentlemen, those who have already speaks. Have all members now voted? All members voted. If so, Mr. Clerk, will you lock the machine? I'll hold the passage of House Bill 182, the Yays are 171. The Nays are 0. This bill haven't received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to House Bill 124-124? House Bill 124 by Representative Skoggins, the 14th and others to be entitled to amend Article 1 of Chapter 24, Title 33 and Article 1 of Chapter 18 and Title 45 of the official go to Georgia and Tate of Religne to General Provisions relative insurance, the state employees, health plan and post-employment health benefit fund. This bill I referred to the committee on insurance, that committee recommends a disbile do pass. Chairman Skoggins is recognized to present the bill. The gentleman is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, I hope you looked at the handout we put on all the desks today about pans and pandas. This is House Bill 124. The only thing this bill does is require health coverage for children with pans and pandas. To explain a little bit about the bill, I didn't know if the gentleman's a spend. This is my granddaughter. She was a beautiful young lady. My granddaughter started getting sick about two years ago. And we couldn't figure out what was wrong with her. In every two weeks, she would get sick with either a stomach bug, COVID, anything like that. She would get sick and we couldn't figure it out. She would come home with a fever, with no reason. And then she would have periods where she would just throw up constantly. And we couldn't figure out what was causing it. But we finally got her diagnosed with Pants disease. It's tough. It's really is. It's tough to see your grandkids suffer. And so as we dug into this issue, we found out that insurance didn't cover this. And so that's the reason for this bill today. And what pans does in pandas is is brought on, pandas is brought on by a strip throat. I don't know if y'all know that. But most kids get stripped through it two or three times a year. And this is what brings on pandas. Pants can be brought on by other different sicknesses like COVID, the flu, and other bacterial or virus infections. And so as we progressed through this diagnosis with CELA, we understood that an immune system gets weakened. And that is why the antibodies in our system start fighting this bacteria of strip throat. And sometimes these antibodies start fighting against good antibodies, not just the antibodies. I mean, the virus from strip throat or the flu. They start fighting against each other and they start hitting on healthy cells. And most of these cells come from the brain which involve movement, thought feelings. And my granddaughter developed a tick. And I don't know if you know what a tick is, but a tick is a involuntary twitching of your body or movement from calls from pans or pandas. And she picked up this tick and that's when we really started figuring out why it was wrong weather. And it's a serious disease that insurance had not been recognizing, but the American Academy of Pediatrics has now recognized pans and pandas as a sickness. And what I'm hoping for is to be able to get this bill moving out of the house, get it over to the Senate and get it on the desk for the governor. So these kids and not just the kids, but the families that are having to pay out a pocket for this sickness. And it's very expensive. And the other thing I want to mention is 12 other states have the same or the same or similar laws. And 17 other states, as we speak, have local legislation that are in the process of going through their states now. So they'll be 29 states that are recognizing pans and pandas. And I would appreciate your vote and your consideration. Thank you very much. Gentlemen, you have four questions. Yes, sir. Right up the center, Chairman Hawkins has recognized four questions. Does it, gentlemen, you? Yes, sir. Isn't it true that this disease has come to under such scrutiny that the show up right now has clinical trials to try to help these children? The gentleman knows what he speaks. And he's been lumest and is recognized for a question to your right at the center on the right. Does the gentleman yield? Yes, sir. Is it not true that by passing House Bill 124, we're ensuring that families dealing with these medical conditions receive the support and coverage they need without unnecessary hurdles? Yes, sir. That is true. And thank you for your help with the bill. Gentlemen from the coast representing we in this year left has a question. Gentlemen's recognized. So does your yield? Yes, sir. My question is how is your granddaughter now? She's better. Thank God. All right. Thank you for that question, Representative. Gentlemen, has no further questions. We do have some speakers on the bill. Mr. Chairman. Thank you, Mr. Speaker, Yiloweth. Chairman, is Yiloweth the bill? We have several folks who'd like to speak. I want to ask you to probably take up to ten minutes for your comments. And you're comments on the bill. So I'm going to recognize Representative Owl right now. Representative Doc Owl is recognized and speak to the bill. Thank you, Mr. Speaker. I rise to speak in support of HB 124. This is a good bill. In medicine there are certain conditions that we refer to as orphan diseases, meaning they affect a small number of patients and therefore often go neglected. Due to their small patient populations, there are limited financial incentives for research and development for diseases like this. Orphan diseases also face difficulty in diagnosis and treatment. They encounter lack of access to specialized care and patients and families often feel isolated. Today in the Georgia House we have a chance to stand with them and to show these families that they are not alone. I appreciate Chairman Skoggins for bringing this bill and appreciate his personal connection with the community. I'll be proud to vote yes on this bill and I hope you all join me. Thank you, Mr. Speaker. I yield the well. The lady is yielded the well. The chair recognizes Representative Bennett to speak on the bill. Thank you Madam Chair. I would like to thank Chairman Mitchell Skoggins for bringing this bill to the floor. We have a wise man in this chamber who says a story seldom told is soon forgotten. I am honored and humbled to stand in support of this bill. I'd like to also recognize that in 2019 this bill first came to the House and I was happy to sponsor that and since then it's been a hard fought fight. And so today I am happy to be a part of a House of Representatives that will support and pass this PANs and PANs this bill to provide support to over 14,000 Georgia citizens and their families. It is a hard, hard disease. Once these diagnosis, if diagnosis early a lot of the signs can be eliminated. I want to ask this House to stand in support with me of this bill. It will be a great bill and a great support as Representative Owes said. 14,000 families may not seem much. But to those families who it is impacted, it is a lot and it requires a lifetime of support. Madam Speaker, I ask this House will vote in favor of House Bill 124. We will continue to be able to support the children and the families who need support in the state of Georgia. Thank you Madam Speaker. I yield the well. Ladies yielded the well. The chair recognizes Representative Clark to speak to the bill. Thank you Madam Chair. I just want to come in support of House Bill 124. I didn't realize what PAN was until last year, one of my best friends. His daughter came down with it and it has just wrecked her family. She was a beautiful young girl and they didn't know what was going on. They went to all these doctors and tried to figure it out and eventually found out it was PAN does. So I realized Representative Skoggins had dropped this bill last year and called him. I was like, what can I do to help? I was excited he was on it last year and it kind of hits you. Sometimes you don't realize some legislation coming through here until it affects you personally and then watching my best friend his daughter go through this. So please everyone support this, families need it for their kids and it's detrimental. Specifically if it's not caught early, it can have so many side effects down the road. So please support House Bill 124. Thank you. I yield the well Madam Chair. Madam President, the gentleman is yielded the well. The chair recognizes Chairman Lomston to speak to the bill. Madam Speaker, members of the House, I rise today in support of House Bill 124, a measure that ensures children diagnosed with a pediatric autoimmune neuropsychotic disorder receive the medical care they need. Children's and pens are conditions that can appear suddenly bringing with them neuropsychiatric symptoms such as anxiety, obsessive compulsive behavior and ticks that can significantly impact a child's daily life. Imagine a child who just days ago was thriving, excelling in school, playing with friends only to wake up one morning experiencing symptoms that turned their life upside down. So these children and their families every day can be a challenge and every moment can be filled with uncertainty. House Bill 124 makes an essential step in ensuring these families are not left to navigate the situation alone. It mandates insurance coverage for the diagnosis and treatment of pandas and pens ensuring that affected children have access to medical interventions based on nationally recognized clinical guidelines. House Bill ensures that financial constraints do not stand between a child and their necessary treatments. Let us be clear, no family should have to fight their insurance provider while they are already working to support their child's health. This legislation opposes our commitment to ensuring that Georgia's children receive the care they need when they need it without necessarily financial hardships, unnecessary financial hardships. Colleagues, we have an opportunity today to make a meaningful difference in the lives of Georgia's families. By passing House Bill 124, we provide support to those dealing with these conditions and reaffirm our commitment to a health care system that prioritizes the well-being of all our citizens. I urge you to support for this critical measure. Thank you. Gentlemen, as you yielded the well, for what purpose does Representative Tarvan?\n\nHe waves. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members now voted? If so, Mr. Clerk, will you lock the machine? All in the passage of House Bill 124, the A's are 173, the A's are 0. This bill have received the requisite. Cost of the majority is therefore passed. Members, I'd like for you to recognize a former member of this House who represented Calvary. And that area where Chairman Lynn Smith represents now, but one of the most noteworthy things that he just told me is he and Dean Gerald Green came in as freshmen. He looks a lot better you Gerald. I can just tell you that now. And there's her. So we want to welcome back to this House. Former State Representative Nioh Shepherd. Thank you for being back here. Mr. Clerk, will you read a caption to House Bill 352-352? House Bill 352, by Representative Seaball, 34th and others to be entitled back to amend Code Section 49-4-159.4. The Fish go to Georgia and Attenta relating the coverage for continuous glue-coast monitors. So as revised coverage criteria include Medicaid recipients with just A's known diabetes. This bill I refer to the committee on public and community health committee recommends that this bill do pass by committee substitute. Representative Seaball is recognized to present the bill. Members, please give your attention to the gentleman in the will. Representative Seaball. Thank you, Mr. Speakers. Remember the house today I rise to present House Bill 352. A simple but significant amendment to a bill where unanimously passed last year thanks to the work of my good friend, Representative Danny Mathis, and it was signed in law by Governor Kim. But as you all know, words matter when you're writing policy. And the amendment in House Bill 352 ensures that Medicaid will cover continuous glue-coast monitors for pregnant women diagnosed with gestational diabetes if their physician prescribes it. Gestational diabetes is not just a temporary condition that presents serious health risk for both mother and baby. The managing blood sugar levels with precision is critical to preventing complications such as preterm birth, high birth weights, and the future development of type 2 diabetes continues. Glute-coast monitor provides real-time data that helps expecting mothers maintain stable glucose cost levels, reducing the risk of emergency interventions and costly complications. So the language of this amendment is clear and consistent with the original law. It's simply ensures that Medicaid covers this essential tool to CGM when prescribed by a doctor, removing a potential unintended gapping coverage. It upholds the intent of our original actions and our commitment to protecting maternal and infant health in Georgia. I urge your favorable consideration, Mr. Speaker, I'm happy to answer any questions. You have a couple of questions. Representative Richardson, I believe you're right down the center, has a question. General's record asked for a question. Will the gentleman you? I do. Is it not true that HB352 will address Georgia's mortality mortality crisis by providing expected mothers, regastational diabetes, the necessary tools to monitor and manage their conditions, reducing the risk of life-threatening complications? Thank you, Representative. The gentleman knows of what he speaks. Gentlemen, you, another question. Representative Reese to your left and the back has a question. Representative Reese is recognized. Thank you, Mr. Speaker. Does the gentleman you? I do. Isn't it true that glucose monitoring systems have proven to be very helpful in the area of healthcare of monitoring diabetes and by adding this additional group here, we're making sure that more Georgians, particularly pregnant women, are covered as it relates to the monitoring of glucose? It certainly does. I personally wear a CGM monitor, monitoring my diabetes and I can tell you it's significantly changed my life and I know it's going to help these mothers that get gestational diabetes from becoming pregnant. It's also going to save their children potentially from becoming diabetic, so I think in the long term, it's going to save the state money. Representative Mathis has recognized it to your right up the sorrel. Thank you, Mr. Speaker. Does the gentleman you? I do. Representative Smith, is it not true that the bill reflects our commitment to enhancing paternal healthcare and support and help the pregnancies throughout our state? Certainly does. Representative Mathis, I appreciate you bringing this important legislation last year to get it started. Thank you. Thank you. Representative Beckles has recognized to your left for a question. Thank you, Mr. Speaker. Does the gentleman you? I do. Is it true that constituents with prediabetic conditions could also benefit from this bill if offered? I believe that. I believe any diabetic could benefit from a CGM monitor. Would you do for another question, sir? I do. Would you not agree that prevention is better than cure and that given our prediabetic constituents would also decrease medical costs and increase life expectancy? I believe the general lady knows of what she speaks. Thank you, Mr. Speaker. Thank you, sir. Thank you, Mr. Speaker. I think I will yield the well. The gentleman is yielding the way. He had a couple more questions, but I certainly his part. Representative Seaboy has yielded the well. Is any objections to the previous question being ordered? Here in the previous questions ordered, is any objection to adopting the committee's substitute? Here in the committee's substitute is adopted. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in the report, the committee has agreed to. This bill now pass all in favor of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All member? I'll wait on you. Take your time. Mr. Clerk, will you lock the machine? On the passage of House Bill 352, the yeas are 169, the nays are two. This bill, Henry C. The rec was a constitutional majority, is therefore passed. Mr. Clerk, will you read a caption to Senate bill 78, 78? House Bill, I beg your pardon. Sometimes I get carried away working with those folks over there. I'm attempting to. Mr. Clerk, will you read a caption to House Bill 78, 78? House Bill 78, our representative Franklin of the 160s and others, to be entitled to an act to amend Article 7 of Chapter 20 and Title 47 of the Fisher go to George Anitated the Public Retirement Systems Investment Authority Lawsows to raise the limit. For the total percentage of funds that the employees retirement system of Georgia may invest. Mr. Bill, I'm referring to the Committee on Retirement. That committee recommends a disbilled do pass by Committee substitute. The gentleman from Bullock County, Vice Chair of the Retirement Committee, Representative Franklin, is recognized to present the bill. The gentleman is recognized. Thank you, Mr. Speaker, colleagues. Mr. Speaker, I am afraid I may be in danger of wasting your time on this bill because you see this is the third time that I was stood in this well to champion the retirement systems in Georgia. This bill is going through this house twice. It's going through the Senate and went to the Senate floor twice and it died there basically because it just ran out of time. But it's a shame because this is a super important bill for Georgia. It's a super important bill for our retirement systems and I want to see it go through again. There's only three ways to get money into our retirement systems and that's through the retirement employees, the state put money in it and the return on investments. And the easiest and most less painful ways return on investments and this bill just does this staff. So what it does is it increases the employment retirement system alternative investments from five to 10% and it increases the firefighters pension fund alternative investments from 10 to 15 to 20%. And what it basically is allowed them to do is have the freedom to diversify their portfolio to increase their their portfolio to be able to bring more money into their systems. It's a bill that was requested by these retirement systems and I please ask your favor will consideration to get this through to the finish goal. I'll answer any questions you need to be. You have a couple of representatives Jenkins to your right has recognized for a question. Do you yield? I do. Is it not true that increasing the cap on the retirement system employees retirement system of Georgia will provide greater flexibility to pursue higher yield investments while maintaining prudent risk management. It absolutely will. Thank you. Thank you. To your left representative Jasmine Clark has a question. Thank you, Mr. Speaker. Does it generally yield? Yes, so how susceptible are these alternative investments to things like recession? To the recession? Well, there were to be a recession. Well, that's one reason why they wanted to increase them because what this does is diversify their portfolio to be able to hedge for those issues like that. The alternative investments were yielding a lot more than traditional investments in the past and this allows them to make that game. Does it generally further yield? I do. For these alternative investments, is it mostly in real estate and that type of investment or do you have any idea like exactly what these funds are investing in? Yeah, it's mainly in private equities is where it is. Thank you. Jim, what has a question to your right from representing Mac Jackson? Gentlemen, is recognized. Thank you, Mr. Speaker. Does it generally yield? I do. How soon can we expect to see returns on these investments? That question I do not know. I have no idea when we would see them. It's basically, you know, they have the, they don't have to invest this much into it. They can invest 1%, 2%, but I don't know when the return is. But if we were to pass this bill in the very beginning, we would already see these returns, which is a shame. Does that mean I would be getting a raise this year? Let's see. I hope so. Gentlemen, has several other questions for yields. You have a question from the chairman from which this committee, this bill came chairman Carson, the gentleman's recognize up there. Senator Owl. Thank you, Representative Fredrickhead. Does the gentleman yield? I yield. Representative Frank, well thank you again for bringing this bill on behalf of ERS and our state retirees. I did not true that about half of the pension investments are in equities, another half are in fixed income, and that allowing more investments into alternative investments, which are in private equity, just as you said. Is that not allowing higher returns of 2-3 times, where we are able to see another investments and get us closer to issuing state coal as to our hardworking, state retirees? Is that not true? The gentleman knows what he speaks, absolutely true. Is it further yield? I do. I just want to thank you again for bringing this investment, which is requested by the agencies to provide more sound investing to our pension portfolios. Thank you. Gentlemen, has additional questions? I'll take one more, Mr. Speaker. Representative Sains, to your left, has a question. Gentlemen, recognize. Does the gentleman yield? I do. Is it not true that good things are worth repeating, even though some are hard of hearing? Yes, sir, it is. Absolutely. Is further yield? I do. Is it not true that that good thing that we're talking about right now is ensuring that our hardworking firefighters and our public servants rank among the most efficient throughout this nation have a better quality of life is worth doing? Absolutely. Thank you. Thank you. Thank you for your question. With that, Mr. Speaker, I yield the will. Gentlemen, I appreciate your efforts. This house is very much supported, the E.R.S. over the years, and I think we'll do the same thing again this year. So we appreciate your efforts and what this bill gives our opportunity to make sure our great E.R.S. retirees hopefully get a colon real soon. Thank you for your work. And you know, I tried to put Senate bill on it, so the encourage them to pass it over there to begin with. Good luck. Thanks for your bill. Is there any objection to the previous question being ordered? Here in the previous question is ordered. Is there objection to adopting the Committee's substitute? Here in the Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the past to the bill? Here in the report of the committee is agreed to. This bill now passed. All in favor of the past to the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted for what purposes representative Richardson rise? Our follow-up secretary. Mr. Speaker, is it not true that HP 78 does not mandate additional investments but simply expands the range of options available to pension fund managers? I know that gentlemen, those are what he speaks. For what purpose does ripped him to lease a gamble rise? Thank you, Mr. Chairman, Parliamentary Encurities. State your inquiry. that in addition to possibly achieving higher results, that investing in private equity is considered to be high risk due to factors like lack of liquidity, limited transparency in private companies, high leverage used by funds, and the potential for significant losses if the underlying company's underperform? I'm sure the lady believes that on investments, but we have a great team that makes investments for Georgia, and they have a good track record. For what purpose does Chairman Yurda rise? Parliament to inquiry? State to inquiry. Mr. Speaker, is it not true that ensuring the financial stability of our public retirement system is essential for the well-being of Georgia's public servants? I'm sure the gentleman believes in what he states, have all members now voted, all members voted if so, the clerk will lock the machine. On the passage of House Bill 78, the A's are 161, the A's are 9, this bill hadn't received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 232? House Bill 232, by members of the stillcocks, the 53rd and others to be entitled back to amend chapter 24A, it's out of 43. The official go to Georgia and attend a relating massage therapy practice that was to enter into an interstate compact, not as the interstate massage compact. This bill I've referred to the committee on regulated industries, that committee recommends a dispelled do pass. Representative Stillcocks is recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I come to you today with House Bill 232. House Bill 232 would make Georgia another state in an interstate compact for licensed massage therapist. This bill, if passed, would increase public access to massage therapy services by providing for a multi-state licensing pathway, enhance our state's ability to prevent human trafficking and licensing fraud, support relocating military, families and their spouses, and increase our ability to protect the public's health and safety. Notably, this bill does increase the number of hours required for licensing to 625 hours, which puts us in step with our neighboring states. And so with that, if there are no questions, I would yield the well. The lady has a question. Lady Yield. Yes. Representative Jones to your left. Lisa Jones has a question. Ladies, recommend. Thank you, Speaker. Do you yield? Yes. How are we verifying the reciprocity agreements? And will they currently be maintained in each state? IE, are we making sure that credentials are in tandem with our state requirements? For an example, continue education? And if you have a subcommittee that will be overseeing these matters, I would like to be considered as a part of that team. Yes. This does, of course, provide for an interstate compact, which they would have a board for all of the licensees of the member states. And so all of the requirements for that would be the same for all those member states. And it would raise our requirements in Georgia to be 625 hours of training to receive a license to put us in step with our neighbor states. Let me play the yield for another question. Sure. Chairman Powell to your right. As a question. Chairman Powell's recognize. Well, the good lady yield. I do. Is it not true that to create this interstate compact, seven states have to do what we're doing right now? Yes, sir. It did not further true that not only will this open up the door for reciprocity, with military spouses and the such, but we give greater professionalism to that profession. Yes, sir. I thank you for the question. Thank you. The lady has no further questions. Then I yield the well. Thank you, Mr. Speaker. The lady's yielded the will. We do have a member signed up to speak in favor of representing Sandra Scott is recognized. Representative Scott, I'll give you up to 10 minutes. The lady is recognized. Are you going to take less now? Sure. I will. Thank you. Good morning, colleagues. Today, I stand before you with immense pride and gratitude. As I support House Bill 232, the interstate massage compact act. For years, I have dedicated my time and energy to developing this bill driven by the conviction that United Iowa State and the United States will pay the way for safer, more professional massage practices across our border. This legislation is not merely a policy. It is a reflection of our shared commitment to excellence in health care and professional practice. I want to express my heartfelt appreciation to all my colleagues for your unwavering support and collaborative spirit throughout this journey. I want to thank the dedication has been essential in bringing this vision to life, ensuring that we provide better protection for both practitioners and the community's day service. Together, we are taking a significant step forward in harmonizing our practices and setting a benchmark for excellent nationwide. Thank you for standing with me and I urge you to join the passing of this important bill for the betterment of our constituents and our professions communities. Thank you, Mr. Speaker and I yield the way. Ladies, yield the world. Thank you, Representative Scott. I know you've worked on this and appreciate that. Certainly do. That completes our comments and support of House Bill 232. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's another board of committee. I disagree to you, shall this bill now pass? All in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 232, the yeas are 165. The nays are 5 this bill. Having received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill? Oh, this is on your supplemental calendar. Members, this is on your supplemental calendar. House Bill 153, 153. House Bill 153 by Representative Camp, 135th to be entitled to amend Code Section 488. 3.2 of the EFCH Code of Georgia, Annette Eureling, and the sales and use tax exemptions for manufacturing equipment, industrial materials, packing supply, and energy. This bill I've referred to the Committee on Ways and Means that Committee recommends this bill do pass. Representative Beth Camp is recognized to present the bill. Chair Lady Camp. Thank you, Mr. Speaker. This bill, House Bill 153, is here today because in our manufacturing equipment tax exemption, the Department of Revenue decided that they interpreted maybe that the rate of mixed concrete transport, I'm sorry, I'm all tumbled up today. The rate of mixed concrete transport equipment was not included in that exemption. So a few years ago, it was put into code. This bill codifies an extension of that till June 30th, 2031. And I'm open for any questions. You have a couple of questions represented Kelly to your left. I'll ask a question. Thank you, Mr. Speaker, with the General I'd yield. I will. Chair Lady Camp, is it not true that the maintenance and replacement parts that are covered in this credit, giving them that credit is essential to us. And the concrete industry in Georgia. Thank you very much, Representative Kelly. And yes, you are correct on that. It's essential because as you will know, if concrete is not continuously moving, then it is a hard and product and it's no longer available to pour to build all the great things in our state. So thank you for that question. Chair Wrenblatt, by the way, the Suner Owl has a question. Lady, will you yield? It's Lady Yow. I do. This is consistent with our tax structure in Georgia whereby we don't tax business inputs. Yes, thank you very much for that, Chairman Blackman. We do not tax inputs because Georgia is the number one state to do business. And we certainly want to give everyone an opportunity to grow their business in our state. So thank you for that question. Lady has no further questions. Thank you, Mr. Speaker. I yield the well. Ladies, you're a consideration. Thank you, ma'am. The ladies yielded the well. Is there any objection to the previous question being ordered? Here in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report, the committee has agreed to shout this bill now passed. All in favor of the passage of the bill. Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? I will. Have all members voted? You still got it, Representative Williams. I see that little job there. Have all members voted? For what purpose is representative? No Williams rise. Parliamentary inquiry. Station inquiry. Mr. Speaker, is it not true that extending this tax exemption will provide critical support for the construction industry as they work to rebuild South Georgia after Helene? Is there any insight for somebody who must have given you that note? Good question. I certainly know that gentleman certainly agrees. I agree with him. And certainly knows what he speaks. Have all members voted? I'll members voted. If so, Mr. Clerk, will you lock the machine? All in the passage of House Bill 153, the yeas are 168. The nay-\n\nThe bill and receive the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 136136? House Bill 136 by the Reps. Newton, 127th and others to be entitled to amend Chapter 7 to Title 48 is Bishop go to Georgia and Tated Related in Income Taxes. To expand the tax credit for contributions to foster child support organizations and to allow such organizations to include qualified expenditures. This bill I refer to the Committee on Ways and Means that Committee recommends that this bill do pass by Committee substitute. Chairman Newton is recognized to present the bill. Thank you Mr. Speaker and colleagues. House Bill 136 is a bill that takes care of some of the most challenged Georgians. Those are our foster children who through no fault of their own they've ended up in foster care. We have over 10,000 individuals in Georgia in that program. And it's a wonderful program and some caring people taking care of that, some great people in defects. House Bill 136 is an update and a strengthening of that important program because it takes out a group that have often been left behind. The other ones that the age out of the foster care program once they turn 18 they may not have even finished high school yet because they've been in several different homes and several different districts but they're left out of our program. The Fostering Success Act of 2022 was an important first step on this was to get money that could be done as a tax credit by individuals or businesses to help organizations that reach out and help these children. I will these former foster children. So that this is building on House Bill 424 a couple of years ago House Bill 136 allows a tax credit to individuals in business and it can be used for tuition, books, things like that for either college or vocational school or even an apprenticeship. It also helps them with something we all help our children with it just because they turn 18 the parental support doesn't stop that can be things like food, housing, other basic needs like transportation, health care, dental care, things like that. An important part of this bill in House Bill 136 is that it also encourages mentorship. That's something that really kind of money can't buy does allow $100 a month in expenses for some of these mentors but those are the individuals who give that advice on pell grants and things they might be eligible for Medicaid, other things. So this is an important program it can establish that both individuals and businesses including insurance companies can donate a portion of their tax obligation to these organizations that reach out to these kids. There are some important safeguards in the bill. It's a very tight on the amount of can be used for overhead no more than 10% what that means over 90% of the money being donated through this tax credit has to go for the direct benefit of the of the former foster child. So you can meet some of these youth that have had this program in his first year make a difference you'll see why we're trying to expand it from 20 million a year to 30 million a maximum 30 million a year. It's a program these are kids that often end up 97% in poverty 37% end up homeless but if we can help them with the mentorship and these charitable organizations that can reach out to them and we can help fund them with some tax credit money. I think this can make a difference that we can all be proud of. I hope you'll vote yes on House bill 136. Mr. Speaker I'm glad to answer any questions. Gentlemen has a couple of questions representing the silk cocks is recognized right at the center aisle. Does the gentleman yield certainly. Is it not true that this legislation represents a strategic investment in preventive services that can lead to long term benefits for our whole state? Absolutely the lady definitely knows what she speaks. Many of these children will end up if they if they're not for mentorship and this help they can end up in the prison system unexpected or early pregnancies certainly before they desired. There's a lot of challenges poverty and homelessness that I've already mentioned that the state would have an obligation to help with so I think that we can get a good return on the investment when businesses and individuals make this charitable contribution. Thank you. Thank you for bringing this bill chairman. Thank you. Representative Kelly to your left is recognized for a question. Thank you to Speaker with the chairman yield certainly chairman. Isn't it true that what we're doing in this legislation is allowing for these organizations who are currently operating and helping serve our foster kids to include qualified expenditures for the wrap around and mentorship services for these that are when I consider some of the most vulnerable members of our society. Absolutely right that wrap around and the mentorship program is a key part of this bill and a key part of it. Thank you for the question. I appreciate your efforts on this and those organizations that are performing these for George and thank you. Thank you. Mr. Speaker we're all here for a season and when we can help there's a work this body is done in 2018 on adoption and trying to take care of some children that are in challenge situations. This foster care program is a great program and we have some wonderful individuals. I hope you'll vote with me on up on continuing the program for fostering success. Thank you Mr. Speaker. I yield the well. Good bill. Thank you for bringing it. Is there any objection to the previous question being ordered? Here in none the previous questions ordered. Is there objection to adopting the committee's substitute? Here in none the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the past year of the bill? Here in none the report of the committee is agreed to. This bill now passed all in favor of the past year of the bill. Will vote yes. All those opposed. Will vote no. And Mr. Clerk will you unlock the machine? Yes. Yes. Yes. Yes. Yes. Have all members voted? Yes. Have all members voted. What purpose has represented Cox rise? Parliamentary inquiry. Is it not true that we have seen this type of program locally where we are up in the Versailles area in North Fulton that has really helped move these foster kids forward to give them an opportunity and that by passing this legislation will give these very individuals hope. I know the gentleman knows what he's speaking. I hear that's a great program. I appreciate that. And for what purpose is Rimsim Derek Jackson rise? He waves. All members voted. All members voted. Mr. Clerk will you lock the machine on the passage of House Bill 136. The yeas are 170. The nays are two. This bill has received the requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to House Bill 164. 164. House of 164 of our version of meek. 178th and others be tiled back to amend Article 2 of Chapter 6 in Title 32 of the Fist Go to Georgia and Intenta to relay the dimensions of weights of vehicles and loads. So as they will repeal automatic repeal provisions relating to an allowable variance this bill haven't referred to the Committee on Transportation. That committee recommends this bill do pass. Representative Meeks has recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I bring to you today House Bill 164. Many of you that were here two years ago remember the debate we had on raising truck weights. The only thing that this bill does is it removes the sunset provision and makes it permanent law. Appreciate the opportunity to work on the speech of legislation which will continue to help forstards as we continue clean up for Hurricane Helene. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Mr. Speaker, for the forestry industry industry. Mr. Speaker, for that I yield the will and ask for a favourable consideration unless there are any questions. General Yeo, to your right, Chairman Jasper has a question. Mr. Chairman Yeo. Yes, sir, Mr. Chairman. Thank you, Chairman Meeks. I appreciate your diligence in working on this issue that affects rural Georgia especially our largest employer in the state agriculture. And this is not true that you feel that this bill will support rural Georgia especially aftermath of Hurricane Helene. Yes, sir. That is correct, Mr. Chairman. Thank you. Mr. Chairman, certainly appreciate your diligence in helping with this bill and the efforts of DOT and others who have worked to talk with us and work with us through this issue. General Yeo, to your right, Mr. Speaker. Are you on the well and ask for your favourable consideration? General Yeo, to the well. It is any objection to the previous question being ordered. Here, in the previous questions ordered, is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? Here, in the report, the committee is agreed to. This bill now pass all in favour of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. For what purpose is represented? Chas Cannon-Rise. Parliamentary inquiry, Mr. Speaker. Stech inquiry. Mr. Speaker, is it not true that House Bill 164 will help rural Georgia's recover from Hurricane Helene? I think that is the case. Appreciate the representatives' interest. Have all members voted if so, the clerk will lock the machine. On the passage of House Bill 164, the Yees are 164. The Nays are a nine. This bill, Henry C. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption to the House Bill 3434? House Bill 34 by Revs. Senator Washburn, 144th, being titled an act to amend chapter 143. The Fishcoated Georgia annotated relating the general provisions regarding professions and businesses. So it was established on behalf of professional licensing boards under the jurisdiction of the office of the Secretary of State of continuing education tracking solution. This bill, I'm for the committee on regulated industries. That committee recommends a disbilled due pass by committee substitute. The gentleman from the House Bill down in Bip County, Representative Washburn is recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, House I rise to present House Bill 34, which seeks to establish a system for monitoring of licensing renewal with online applications. This bill is a good bill. It will enhance efficiency with the Secretary of State's office in terms of licensing renewal. It'll result in improved compliance because it should be easier to track what is needed in continuing education and to be able to track the compliance with those requirements. It should save money because of reduced paperwork, etc. And it should protect the public more because of the enhanced licensing renewal process. I ask for your favorable consideration of this bill. It should be noted that this bill passed a House last session and got over to the Senate and did not get called over there. So it's a good bill. I urge you to vote favorably on it and I will yield for any questions, Mr. Speaker. To your left, Representative Jasmine Clark has recognized for a question. Thank you, Mr. Speaker. Does my friend yield? Yes, ma'am. I do. So I noticed online 29 that this bill gives the, it looks like it gives the Secretary of State's office up to January of next year to have this system in place and ready to begin, I guess, approving or not approving licenses. Does that mean that they have already started the process of bidding and finding parties that can, or third party agencies that can actually do this because it seems like a short timeline. Truthfully, don't know that they have started that process. I would assume they have not started until this bill passes. But thank you for the question. Do you further yield? I do. Any worry that this timeline might be a bit tight. I think it's a good bill. I think it is, it is very reasonable what we're trying to do. But is there a concern that we're going to be scrambling back here next session having to push this deadline back a little bit because the Secretary of State's office was not able to meet this deadline. And now technically according to the law, we are not able to renew licenses from professional licensing boards. Thank you for the question. I have been in contact with the Secretary of State's office and I assume that they are fully aware of the timeline and that they're confident they can get it implemented. But thank you for the question. Perfect. Thank you. Gentlemen has a little question to your right. Chairman Powell has recognized for a question. Well, the chairman yield. I mean with the speaker yield. I will yield to the chairman. If I would like to, I'm sorry. I ask you a question. Is it not true that this state, all of the professional and business licensing to the biggest degree unless they're free standing, or is that over to Secretary of State's office? I'm sorry, I can quite catch it. Is it not true that most of the businesses in a state, their licenses unless they're free standing boards resided to Secretary of State's office? That is true. Is it not true that this is a problem that has persisted for years for various and Sunday reasons, but it needs to be upgraded? That is also true. Mr. Chairman. Further question. Is it not also true that they made an attempt with the company a few years ago to upgrade their licensing system? Because of that, they've been deeper in the quagmire. That is also true in the stream. Is it not further true that by sending this message by law that when they start upgrading that system and doing the fixes that it will actually bring them in line to what some of the free standing boards do to make it consumer friendly to the licensees so they can see how many C&Es they have, how many are left? And what it takes to renew their business licenses, professional licenses. That is exactly true, Mr. Chairman. Thank you for those questions. This will enhance our licensing renewal process, which will serve the state of Georgia well. Thank you for the bill. Thank you, Mr. Chairman. Gentlemen, has there further questions? Thank you, Mr. Speaker. I yield the well and ask for your favorable consideration on this bill. Gentlemen, is yield the well. I like it when you guys are working together. That sounded good. That's a good bill. Is there any objections to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. This bill now passed, all in favor of the passage of the bill. Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? We've got to get that clerk some finger exercises there to speed up his pay. Have all members voted? All members voted. If so, will the clerk lock the machine? On the passage of Senate House Bill, I'll misty it again. House Bill 34, the yeas are 171. The nays are two. This bill, haven't received a requisite constitutional majority, is therefore passed. I'm going to allow the chairman of transportation to explain something on this resolution. Mr. Clerk, will you read the caption to Senate Resolution 7? Senate Resolution 7, dedicating certain portions of the highway system. This resolution, the committee on transportation, the committee, and the committee that's been passed by substitute. Members may not be specifically mentioned, is that right? Mr. Chairman? But I want to ask you, as we honor some folks in our state and our history, with road naming, I want to ask this house, this body, will you please stand while the chairman presents? This road naming resolution. Mr. Chairman. Well, thank you, Speaker. If you look in the back of your book, there's a very long bill, Senate Resolution 7. It's 33 pages long. These are important. These were done last year. They honored Georgians in your community that have led your community, have passed away in your community that we honored. And this bill just got crossed over the very end. We just didn't get it done. But if you take a moment, if you want to look and see some heartfelt, incredible stories, take a minute and look at the last of your book. It's always amazing to see that. GDOT was very beneficial this past year. This bill didn't get through. We had people had promised and made desires to get these signs up. GDOT, when it had made the signs without the resolution, the governor's office supported us in that. Because we want to recognize these folks. And there were a couple of them. People talked to me as we went through toward the end of this year that the people, they put the signs up and then that recipient passed away. And what a meaningful thing that was that you saw by Chairman Larmick Donalds was one of those. So it's real good for that. Hope you'll join me now in voting green on getting this through and getting these codified. Thank you Mr. Speaker. Thank you, Mr. Chairman. Thank you members. You may be seated. Is there any objection to the previous question being ordered? Here you know, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here you know, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? Here you know, the report of the committee has agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution? We'll vote yes. All those opposed? We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. All members now voted. If so, the clerk will lock the machine. All the adopters are sent at resolution 7. The yeas are 174. The nays are zero. This resolution haven't received a requisite. Constitutional majority is therefore adopted. Members, that completes our rules calendar. House resolution is set. That completes our rules calendar. House resolution 32 will be postponed to the next legislative date. We have a couple of motions. We have just one motion. For what purposes represent DIPC rise? The motion to temporarily suspend the rules and allow a bill to be introduced, read the first time, and referred to committee. Mr. Clerk, will you read the caption? Unnumbered House bill by Representative Demsie of the 13th, Mathieu of the 82nd, Jones of the 25th, all of the 84th, Cooper of the 45th, the belts be entitled, and act to amend Article 1 of Chapter 2 of Title 37, Official Code of George Annotated, Related to General Provisions regarding the administration of mental health disabilities, Addicted Diseases, and other disability services. The motion to amend the rules and allow a bill to be introduced, read the first time, and refer to the committee. The motion to amend the rules and allow a bill to be introduced, read the first time, and refer to the next legislative date. A resolution recognizing February 27th, 2025 is George Areports Association Day, recognizing and committing William Wright on his outstanding public service, recognizing and commending Mike Coleman, recognizing Fire Chief Eddie Robinson, the 2024 Georgia Fire Chief of the Year, recognizing and committing the University of Georgia Block and RIDLE Club on the occasion of its 50th Great Southam San Pete rodeo, recognizing and committing Minister Dara Calary on his outstanding public service, recognizing and committing the 2020 25th Georgia single parent legacy builders, recognizing and committing small business advocates, the organizations, and recognizing March 5th, 2025 a small business advocacy day, recommending and congratulating Mr. Dunhu, a Benjamin Bannaker high school on being named Teacher of the Year, recognizing and committing Reverend Dr. Michael Wayne Sherman senior on the occasion of his 10th pastoral anniversary, congratulating and committing the Lamar County School System, congratulating and committing the Charlton County Board of Education. Recognizing and committing a beauty P ball, congratulating and committing duly county schools, congratulating and committing the Block Child Development Institute, congratulating Rice Augusta recipients of Georgia Reeds Community Award, congratulating and committing the Ben Hill County School District, congratulating and committing Mary at a city schools, congratulating and committing Cobb Collaborative, congratulating and committing William Wright or Dalton, recognizing and committing James and Patricia Grant upon the retirement, congratulating and committing Reed Source and Purpose Bill Schools of Atlanta and for other purposes that completes the reading of the Privilege Resolutions. Is there any objection to adopting the Privilege Resolutions here in none the resolution is adopted? Remove on to afternoon orders. I'm not going to cut you off, but I'll ask you to be finding the end of your afternoon order if you will. The representative I didn't sign you is recognized he was most patient on Friday and agreed to hold over it. Let me get your attention first. Thank you speaker. Thank you. Thank you representative. Appreciate your comments. Representative Holly is recognized. Here he is for an afternoon order. I guess some friends coming with you. Members, if you will rise, please. Thank you, Mr. Speaker. I wanted to recognize the life that was lost in our local community in the manner of a young man. The Zaire McQueen was a student at Eagles Landing High School, a 16-year-old who was very passionate about wrestling. He was very passionate about wrestling. He was very passionate about wrestling. He was very passionate about wrestling. He was very passionate about wrestling. He was very passionate about wrestling. He was very passionate about wrestling. I'm sorry for the family's loss but what a wonderful contribution. Thank you, members. Representative Griffin. Representative Floyd Griffin from Baldwin County is recognized for an afternoon order.\n\nThank you, Mr. Speaker. As we began the last week of Black History Week, I rise to celebrate the powerful legacy of Black women. Women whose strength, resiliency, and vision has driven progress across generations and industries, from science and education to civil rights and technology. Black women have often been the backbone of innovation, transforming societies without receiving the recognition they deserve. We stand with a minute here. Well, I'm missing a page here. I don't know if I can go from the hard here, but among those pioneers is Kathleen Coleman, Johnson, a mathematician whose brilliance propelled the United States into the space age. Breaking through racism and sexism, Johnson became a key figure at NASA. When John Glenn's historical 1962 office of flight, he stated that I will go if Mr. Johnson, give me the right to go. And that happened. Innovation flourished through diversity, perspective, and progress. Accelerating when we invest in equality by supporting affirmative actions and DEI, we honor the material blazes like Kathleen Johnson and open doors for future generations. Let us commit to advancing policies that promote justice and opportunity, ensuring that these legacies continue to shape a brighter, more inclusive tomorrow. We salute Katherine Johnson for her legacy in moving the space program forward. I will yell. Thank you. Representative Martinez, you're recognized for an afternoon order. Thank you, Mr. Speaker. I rise here today to celebrate Black History Month, Mr. Speaker. colleagues, when I was a young man and I came to this country as a young Hispanic kid, we were very limited on the channels that we had on our TV. But I do remember looking forward to Saturday, Channel 34, Seoul train, Mr. Speaker and colleagues, Seoul train. Well, I tell you what, Seoul train started in 1971. 35 years and it went all the way to 2006. They had a lot of artists in Seoul train. I remember that. Some of them were Gladys Knight in the Piz, Stevie Wonder, Al Green, Marvin Gaye, Little Richard, Barry White, the love unlimited, Donna Summers, hot stuff. And my favorite colleagues, my favorite, my all-time favorite, Lou Rawls, Delayed Ru Rawls. Mr. Speaker, I could never feel the shoes of the late Lou Rawls, but I could tell you one thing. I could honor him, Mr. Speaker and colleagues. You never find as long as I live. You're someone who loves you. Tender like I do. We're going to love my loving. Thank you, Mr. Speaker. I year the well. Well, representing McClain when they got hot, she stepped away. Well, I don't know what that was about, but hey, a star is born. There's no doubt about that. Wow. Representative Jasper's, I think this is not quite as dramatic I hope, but this is still a good one. You're going to tell us about 4-H. Chairman Jasper's recognized for an afternoon order. I'm glad we don't have to sing. Thank you, Speaker. Tomorrow is 4-H day of the Capitol, and unfortunately we'll all be here in all meetings, but you know, we don't get to come to the Capitol and hear to our Chamber and speak to us. And that's unfortunate, because hundreds of young people are going to be here tomorrow from all over the state. I hope they make contact with you so that you can meet with them. They have a great picture at the stairs over here, a giant meeting over in the depot. If you want to hear from their state president, you've got a little QR code here where you can hear from him. He would have normally been up here speaking. The gentleman is from Toombs County. Think you'd love it? That's right, that's how you can. But also, well, there was some cheese straws on your desk, and my wife's back, Mrs. Jasper's is looking at me right now going, you ate my cheese straws. They're wonderful. You need to try them from Rock Eagle. And also lastly, Mr. Speaker, if you look at the 4-H Board of Directors and look at the places and the young people who are represented in this great, very diverse from all across our state, 4-H, it trains young people to be leaders. And I was very proud to be part of that program for nearly 30 years. But thank you, Mr. Speaker. I hope to see you tomorrow. 4-H day, good group of young people. Representative Reeves has recognized for an afternoon order. Thank you, Mr. Speaker. Next members, I invite you to the Council for Municipal Court Judges. Breakfast in the morning is 930-1030 in room 230 here in the Capitol. With it being at 930, that could be breakfast, second breakfast brunch. But come see your municipal court judges. Please drive the speed limit to stay out of their court and come appreciate them. We've got 537 cities in Georgia. A lot of them have good municipal court judges. Thank you. I yield the well. Representative Stofi, you have some folks who've set very patiently in the gallery. So I'm glad you're going to recognize them. Thank you, Mr. Speaker. Today I rise, members of the House, to welcome the United for Respect Workers, their warehouse workers that are here advocating for safe workplaces. Immediately following, we'll be down in the South Wing for press conference on warehouse workers protection act. Thank you, Mr. Speaker. You'll do well. Good to have you all at the state Capitol. Thank you, Representative Stofi, and members. Representative Stofi, you're welcome. Representative Stofi is recognized for an afternoon order. Give the lady in the wheel. Your attention, please. Thank you, Mr. Speaker. Today I rise to honor the life of an 11-year-old girl who tragically took her own life. Her name is Jocelyn Rojo-Karonsa. Her dear mother, Marabella Karonsa, set of her sweet daughter's passing. I lost a little piece of me. Jocelyn was a little girl who loved to dance and told her mother she dreamed of one day becoming a cheerleader. She had complained that her six-grade classmates threatened her to call ice and leave her parentless. We are reminded that in the Book of Proverbs, chapter 18, verse 21, it reads, the tongue has the power of life and death, and those who love it will eat its fruit. When children hear their parents so loosely and callously refer to as criminals and aliens, it does hurt. It hurts when I know that even my daughter and my young son could face the same bullying. Jocelyn could have very well been my child. She could have been your friend's children. A friend to your children. Today colleagues, I ask that we shape policies that uplift all people. To the children of immigrants, you are Georgia. You belong here. Let me say that again. To it is Georgia, and to partner says, thank you, Mr. Speaker. I yielded well. And lady, as you are the well, that completes our afternoon orders. I want to remind you, if you have a page today, join us when we adjourn down front for some page photos. We are moving on to announcements now. Chairman Corbett, recognize for announcement. Representative Tran, your own deck. Thank you, Mr. Speaker. The Motor Vehicles Committee will meet at 8 o'clock in the morning, room 606, CLOB. Thank you, Mr. Speaker. Representative Tran is recognized for announcement. Thank you, Mr. Speaker. The cab delegation, we have our lunch meeting today. As soon as we adjourn out of here, again, the cab delegation, we have our lunch meeting today with the cab board of commissioners. Thank you, Mr. Speaker. Chairman Chokas, recognize for announcement. Thank you, Mr. Speaker. Good afternoon. The Small Business Development Committee will be meeting tomorrow morning, Tuesday morning, February 25th at 8.30am, 8.30am, room 506. We have a bill to present, and then we have the Restaurant Association. Thank you, Mr. Speaker. Representative Gamble is recognized for announcement. Thank you, Mr. Speaker. Tomorrow morning at 7am, the fellowship will meet. We are going to have an abbreviated morning because we are going to break about 7.40 for members that want to go to the citizen impact breakfast over at the twin towers. Tomorrow morning at 7am, the fellowship will meet. Representative Holly is recognized for announcement. Thank you, Mr. Speaker. Members, please remember tomorrow, Black voters matter day will actually be at the capital. So the Black voters matter fund will be here. So if you could please meet them and be able to hear their priorities would be well appreciated. They will be at room 216 from 11am to 1pm. So thank you. Leader of the station has an announcement. Thank you, Mr. Speaker. There will be a committee chairman's lunch in room 403 upon adjournment. Chair Lady Cooper, recognized for announcement. Thank you, Mr. Speaker, community and public health will be meeting at 1 o'clock and room 606 of the L.O.B. 606 and the L.O.B. Thank you. Chairman Gunther, recognized for announcement. Thank you, Mr. Speaker. The Judiciary Committee will meet this afternoon at 1.30pm. We have five bills to take up. And we will also meet tomorrow morning at 10 o'clock, I believe. And we have eight bills to take up then. Thank you. Keep working. Chairman Dickie is recognized for that. Thank you, Mr. Speaker. There are of course some of the affairs committee will meet in the morning at 9 o'clock. We have several bills 606, C.L.O.B. 9 o'clock tomorrow. Chairman Lumpstons has an announcement. Mr. Speaker, members of the House, there will be a full House insurance committee meeting tomorrow 1 p.m. C.L.O.B. 406. Thank you. Representative D. Wilkerson, recognized for announcement. Thank you, Mr. Speaker. The COVL legislative delegation will meet in room 216 upon adjournment. We will hear from the COVL school system as well as meet students from South Cobb and Beburet Kay School. Thank you. Representative D. Irwin Carter, recognized for announcement. Thank you, Mr. Speaker. So if you are on campus tomorrow, here at Capitol Dune tomorrow, the American Heart Association is hosting their Heart Healthy Lunch tomorrow from 11.30 to 1 in Capitol 125. Thank you. Chairman Stevens, recognized for announcement. Thank you, Mr. Speaker. The Economic Development and Tourism Committee, the bus will leave tomorrow for the Kia Plant for 2.0.30 a.m. 9.30 a.m. Kia. Chairman Powell, chairman Ellen Powell, recognized for announcement. The numbers are regulated. The industry will meet at 2 o'clock this afternoon and at 10 o'clock in the morning. So I would recommend it if the members of the Reg Industries don't be on that bus. Chairman Jasper is recognized for announcement. Well, this one's a little different. Transportation will not meet tomorrow because of all of what you heard. We're going to meet on Thursday at our normal time with three bills. Also, members, if you have a road naming, we need those newspaper ads and Abbie Days looking for them. If you don't make it by this next week, we'll add you to the second bill, which will be done towards signing the data. Thank you, Mr. Speaker. Don't take a chance. Get them in. Right, Mr. Chairman? That completes our announcements. We remind you, page photos, lots of committees meeting in Ported Business. This house is 10 in 2. Hey, that's good. I didn't see that. Good pages. It's just a reminder. A lot of great pages here today. A lot of good committee meetings today and tomorrow. Everyone wanted to be on their favorite committee. So if your committee's meeting, you need to be there and be present. I think that completes our work for today. Majority leader of this house is recognized for our motion, Chairman, illustration. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Wednesday, February 26th, 2025. On the motion of the majority leader of this house stands adjourned until 10 a.m. Wednesday, February 26th, 2025. All those in favor will say aye. All those opposed, no. It was a little closer, but I clearly have it. This house stands adjourned until 10 a.m. Wednesday, February 26th. Thank you, members.",
  "updated_at": "2026-02-13T02:10:52.908962+00:00"
}