{
  "video_id": "PWpzW7BtvLA",
  "url": "https://youtu.be/PWpzW7BtvLA",
  "title": "Georgia House - Day 28 (2026-03-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 28,
  "video_date": "2026-03-08",
  "duration_minutes": 200,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript provided:\n\n## Overview\nThe session was focused on passing several resolutions to compensate individuals who were wrongfully convicted and imprisoned. There was also discussion around the upcoming State of the Judiciary address by the Chief Justice.\n\n## Key Actions\n**HR 25**: Resolution to compensate Mark Jason Jones for wrongful conviction\n**HR 26**: Resolution to compensate Kenneth Eric Gardner for wrongful conviction \n**HR 29**: Resolution to compensate Mr. Jakeyth Ben Ray Robinson, Sr. for wrongful conviction\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The House recognized and commended various individuals and groups, including high school sports teams, law enforcement, and community leaders.\n- There was discussion around scheduling the State of the Judiciary address by the Chief Justice.\n\n## Votes\n- HR 25 (compensating Mark Jason Jones) passed 149-9\n- HR 26 (compensating Kenneth Eric Gardner) passed 150-12\n- HR 29 (compensating Mr. Jakeyth Ben Ray Robinson, Sr.) was recommended for adoption\n\n## Attendance\nNo explicit notes on quorum.\n\n## Adjournment\nThe transcript does not include the time of adjournment or the date of the next scheduled session.",
  "transcript": "you you you house will come back to order house will come back to order we are coming back to order to do business car ordering the mail The House is back in order. The clerk will read the caption to a group of privilege resolutions. Monitoring the life and memory of Dr. Paul L. Walker. Recognizing Commending Gilbert Young. Recognizing Commending Capital Thorn L. King. Recognizing the positive impact of African nations on state of Georgia and acknowledging the importance of diplomatic technological and trade relations. We're actually leading the Warner, Robin's high school football team for winning the Warner Robin City Championship through region one 5A championship and the GHSA 5A State Championship. recognizing March 7 through 13 2021 as National Groundwater Awareness Week in Georgia. Commending the Georgia Craft Brewer's Guild in recognizing March 6, 2021 as Georgia Beard Day. Recognizing commending Ruby Foster. Recognizing commending Captain Edward Holman-Hyte-Hawpon as a Dukshin into the Georgia Military Veterans Hall of Fame. Congratulations the Kings, Way Christian School boys basketball team for winning the 2021 GCAA State Championship. Commending and congratulating Sheriff J. Tyson Stevens. Recognizing commending Judge Kathy Stevens-Palmer on our outstanding public service. Recognizing and commending Dwight U-Banks. Congratulating and commending Yalanda Fredrickson receiving the 2021 Yellow Rose Nikki T. Randall Servant Leader Award and commending and congratulating Brookhaven Police Chief Gary Yandura as Georgia's 2020-2021 outstanding police chief of the year and for other purposes that completes the reading of the privilege resolutions. Chair recognizes the majority leader for a resolution. Is there any objection to adopting the privilege resolutions? The chair here's none the resolutions are adopted. Now the chair recognizes the majority leader for a resolution. Thank you Mr. Speaker. Colleagues, as is our tradition we've had the state of the state with the governor governor. Now we will hear from Chief Justice Milton. He will be in the chamber for I believe will be his last presentation on the state of the judiciary that will be next Tuesday March 16th at 11 a.m. right here. So it should be exciting as it always is to hear about about the the judiciary and the state of the judiciary. They've had an interesting year and we'll be glad here from Miss Speaker. That's what the resolution does and a little more. So we thank you and now to ask for your favorable consideration. On the resolution to set a date for the state of judiciary and to invite the chief justice and the chief judge and whoever else they're going to bring is their objection. Is their objection a chair here's none in the resolution is adopted. Mark, I'll read the caption to House resolution 25 House resolution 25 of verses Stevens the 164th a resolution compensating Mark Jason Jones and for other purposes this resolution ever and referred to the committee on appropriations that committee recommends that this resolution be adopted. Chair recognizes representative Mallow to present the resolution. Thank you, Mr. Speaker. Colleagues, this is resolution number two and the series of the three gentlemen that were wrongfully convicted of murder. This resolution passed hours favorably last year and I ask for your favorable consideration to pass this resolution this morning. If there are no questions Mr. Speaker, I yield the well. You had no questions. Is there any objection to the previous question being ordered? The chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution the chair here's none the report of the committee is agreed to shall this resolution now be adopted. All those in favor of the adoption of the resolution will vote will vote aye those opposed will vote no in the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machine on the adoption of house resolution 25 the eyes are 149 the nays or nine this resolution having received the requisite constitutional majority is therefore adopted clerk agreed the caption to house resolution 26 house resolution 26 by represent Stevens the 164th compensating Kenneth Eric Gardner this resolution ever and forwarded to the committee on appropriations that committee recommends that this resolution be adopted. Chair recognizes representative Mallow to present the resolution. Thank you Mr. Speaker colleagues of the house this is the last resolution for a trio that had been wrongfully convicted of murder this resolution passed this house last session and hopefully we can pass this last resolution for this other gentleman so they'd be compensated for the 25 years that they spent in prison wrongfully convicted of murder with that Mr. Speaker I yield the well if there are no questions there are no questions is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which is favorable to the adoption of the resolution the chair here's none the report of the committee is agreed to shall this resolution now be adopted all those in favor of the adoption of the resolution will vote aye those opposed will vote no and the clerk will unlock the machine have all members voted have all members voted if so the clerk will lock the machine on the passage of house resolution 26 the eyes are 150 the nasa 12 this resolution having received the requisite constitutional majority is there for past clerk will read the caption to house resolution 29 house resolution 29 over so he'll leave the 136 resolution compensating Mr. Jakeyth Ben Ray Robinson senior this resolution haven't been assigned to the committee on app haven't been assigned to the committee on appropriations that committee recommends a disresolution be adopted chair recognizes representative Hugley to present the resolution thank you mr. Speaker ladies and gentlemen of the house I bring to your attention house resolution 29 on behalf of mr. Jakeet Robinson who seeks compensation for wrongful conviction this measure was passed by this house last year as house resolution 18 and it went the way of many of the bills after covid came into play we depend on our justice system to keep us safe it protects our families our home our businesses in our communities and in the pursuit of fairness the justice system is governed by rules of procedure to protect us as citizens so that each of us are treated fairly in our judicial proceedings when those rules are not followed we all lose to keep Robinson spent 20 years behind bars and when he was released in 2014 the court of appeals decided that the trial court had arid by overruling the defendant's objection to the state's attempt to approve armed robbery via party to a crime theory because the issue was barred for re litigation under double jeopardy based on the acquittal of mr. Robinson under the theory in the first trial in which the jury determined that Robinson was not a party to the crimes so basically you have a gentleman who was the victim of double jeopardy and then he filed his appeal and that appeal was lost for some 10 years and there was no explanation for why the case was never documented and so the appeal court reversed it and in its reversal it it managed everyone involved that we have to do better and we have to make sure that everyone's rights are protected with that mr. Speaker there are no questions I'll yield the will and ask for everyone's favorable consideration the House resolution 29 you have a question if you care to yield I'll be happy to chair recognizes representative or chairman percol to your right for a question with a representative yield for question I yield is it not true that court testimony which was never refuted implicated the individual named in this compensation resolution as the getaway driver and the armor car robbery that killed 22 year army veteran John Hamilton in 1995 actually what happened is that there were no witnesses there was no evidence against them he was implicated but in our system we have to be proven guilty and there was nothing to indicate that he was guilty of these crimes will the lady yield for one more question I yield thank you so I looked at the transcripts and is it not true that there was no refutation that's his word of his guilt or innocence it actually was I don't know how to say it that he got off on a technicality with double jeopardy is that not true well I would submit to you that if you were in prison for 20 years and and and try double jeopardy means that one court has found you not guilty under under under the rules of our criminal procedure and then then you're tried again so that's why the law does not allow for double jeopardy because it is unfair so you know I understand and I appreciate you Mr. Chairman because you were the chairman that reviewed this and came up with the amount in your committee and you've done very very good job and due diligence but when we are wrong when we the state of Georgia is wrong we have an opportunity and an obligation to say I'm sorry you can't give a man 20 years of his life back but we can try and help him reveal the remnants of a broken life and that's simply what we're asking you to do here today with that Mr. Speaker I yield the well and ask for your favorable consideration of HR 29. The lady is yielded the well as there any objection to the previous question being ordered the chair here's none the previous question is ordered as there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution the chair here's none the report of the committee is agreed to shall this resolution now be adopted all those in favor of the adoption of the resolution will vote aye those opposed to vote no and the clerk will unlock the machines what purpose does chairman house to rise parliamentary inquiry is it not true that this file that we had sent off of this case to the court of appeals late on the court of appeals office for 10 years and nobody knows what happened to it and 10 years to wait to hear cases a little long even in South Georgia thank you I'm sure there was a parliamentary inquiry in there somewhere yeah if you stay so I do believe it have all members voted have all members voted if so the clerk will lock the machine on the passage of house resolution 29 the eyes are 133 the nasa 29 this resolution having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 517 House of sorts 517 of course in the 46 me total neck to amend chapter 2 a total 20 fiscal Georgia and Tate relating the student scholarship organizations so survived for the inclusion of earned interest in the calculation of minimum revenue obligations for scholarships intuition this bill ever signed the committee on education that committee recommends the disbilled do pass by committee by committee sub chair recognizes chairman Carson to present the bill thank you mr. Speaker this is house bill 517 everyone's familiar probably with the tax credit scholarship program that we have the Georgia Department of Auditoring accounts did this report right here issued in January of this year and it noted a number of areas and I'll just read the headline additional measures needed to improve transparency and accountability what we've done in house bill 517 is incorporate a number of those recommendations and make it look and feel a lot a little bit more like the rural hospital program one thing is that interest from scholarship funds must be a hundred percent spent on scholarships there's certain audit requirements regarding the audit must be done in regard to a general accepted auditing standards fund management student eligibility school qualification and there's specific timelines not in the statute earlier there's specific timelines in which an audit must be done in which an audit also must be posted on the department of revenue website the D.O.R. is specifically authorized to post the SSO audits on their website again this is all about disclosure and transparency and again making it look and feel like the rural hospital credit program the SSO shall submit a form 990 that's obviously the it's a public form IRS form to identify how much salaries are within regard to these students scholarship organizations we just want more sunlight and more transparency and it sets the tax credit limits just like the rural hospital credit program but again it does not affect the overall program of a hundred million it stays the same no increases in that to whatsoever so this is a just to make it the this program look and feel a lot more like the rural hospital program with transparency and disclosure with that Mr. Speaker I'll take a question if there's no questions I will yield the well you have a question if you care to yield yes or I will chair recognizes the minority caucus will representative representative Wilkerson to your left for a question thank you mr. Speaker can you tell me what what LC number you're working off of I just want to make sure we're working off the same one yes so that's a good point to the minority will I'm working on the rural substitute it should be LC 05 02 s I does the gentleman further you know yes this a question I don't know if anybody has that that was a version of the bill adopted in rules and what that did I'll just tell you the difference between what a version you may have is this removes any references to increasing the hundred million dollar cap yes and I and extending that I think it was a good change because it puts it back to what the audit was but I wanted to make sure that I have the final you have another question if you care to yield yes sir board nine zero five zero two S representative Wilkerson had you finished questioning okay yeah John Jim Carson the I will yield for one more question sir chair recognizes representative Mary Francis Williams in the gallery to your right or a question oh does the chairman you yes ma'am so I'm I have a totally different LC number and I I pulled it out of the book in the back and the the LC number that I've got is 490492 S and it has a section a part two that in lines 176 to 179 almost doubles the education tax credit for single individuals and married couples is that or is that I mean I so I don't I feel like I don't know what's in in the bill that we're voting on right you are correct this increases the amounts of individual limits based on taxpayer status but so for example a married filing joint is a $2500 limit this goes to the $5,000 limit per the rural hospital credit program and an individual single individual on line 177 of my version goes from a thousand to 2500 like the rural hospital but the overall program stays the same at one hundred million will the gentleman further you yes ma'am so you're not increasing the total amount but you're you're doubling close to doubling the tax credit and I know you keep comparing it to the rural hospital tax credit but this is this is a tax credit for profits for funds that go to private schools not public hospitals is that correct that's correct it but we're getting to operate both of them similarly all right my so one further question I just am curious do I or do I not have the LC number that you are working off of I am working on LC 490502 s rule substitute so mr. Speaker is it not somewhat unusual to ask us to vote on a bill when we don't have it in front of us the clerk's office tells me that the most recent sub will be on top not behind I also understand there are there are subs out in the hall or is that supplemental calendars supplemental calendars are in the hall or I have the supplemental calendar and I did not see any rule substitutes for any bills when I walked in at two o'clock now it's not the subs are in your book on top of the bill the most recent one on top is the one we're working from we mr. Speaker we just don't have it are we good to go are we good to go yes sir okay chair recognizes representative Williams to continue your questioning are you finished yes sir I'm finished all right okay do you further yield I'll yield for one more question I know the hours getting late sir for recognizes representative carpenter to your right for a question does the gentleman you yes sir is it not true a vote yes vote on this bill will promote transparency and listen to what the auditors are telling us we need to do to improve this program for all Jordans absolutely and incorporate those recommendations in the statute thank you mr. Speaker and I will yield the well and ask for your favorable consideration is there any objection to the previous question being ordered the chair hears none the previous question is ordered is there any objection to withdrawing the Committee substitute the chair hears none the committee substitutes is withdrawn is there any objection to adopting the substitute offered by the committee on rules the chair hears none the rules committee substitute is adopted is there any objection to agreeing to the report to the committee which was favorable to the passage of the bill the chair hears none the report of the committee has agreed to shall this bill now pass all those in the bill will vote aye those opposed to vote no in the clerk will unlock the machines. have all members voted have all members voted. If so the clerk will lock the machines on the passage of House Bill 517. The eyes are 98 the nays are 71 this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption we're own now picking up some bills off the supplemental rules calendar. The clerk will read the caption to House Bill 617. House Bill 617, Reverend, I'm Martin the 49th being titled an act to amend chapter 3, you title 20 of the official code of Georgia annotated relating post-secondary education. So is to provide that student athletes participating in intercollegiate and athletic programs at post-secondary educational institutions may receive compensation. This bill ever referred to the committee on higher ed that committee recommends a disbilled do pass by committee substitute. Chair recognizes chairman Martin to present the bill. Thank you, Mr. Speaker. Members, I come to you today and I want to thank my coach bothersome to bill chairman Rhodes, chairman Fleming Dean of the House, Calvin Smirie for helping us. There exists a situation around college sports where young student athletes are seeking to be compensated for their name, image and likeness. That is certainly certainly something that's going to be done nationwide. This bill today seeks to put in Georgia code that when that happens, our Georgia student athletes in public or private institutions will be treated fairly and will have a seat at the table. Mr. Speaker, it's as simple as that. It has an education requirement that universities provide these young athletes assistance with finances. It puts finances in doing that and it puts in place protections for them. Mr. Speaker, this just puts our athletes in a place where they have a seat at the table and when that comes together nationally with the intercollegiate sports groups that they will be treated fairly. There are no questions. I'll yield a well and ask the House's favorable consideration so that our student athletes and women can be treated fairly. Do you have a question if you care to yield? I'll take one since I did it quickly. Well, maybe he wasn't at the lady who was a cheerleader. The chair recognizes representative Reeves to your left for a question.\n\nDoes gentleman yield? A pause for effect, yes sir. Isn't it true that I was very against this bill when I had the misunderstanding that it did not apply to mascots, but once I saw the light and learned that mascots are protected, I am the biggest cheerleader of this bill. I'm sure you are and we're all buzzing about your support. Mr. Speaker, if there's nothing further, I'll ask the question. Thank you. Any objection to the previous question being ordered, the chair here is none, the previous question is ordered. Is there any objection to adopting the committee substitute, the chair here is none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill, the chair here is none, the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. All those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 617. The eyes are 171, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 290. House Bill 290, by represent, Sustsler, 35th and others to be titled an act to amend article on chapter 7 of Title 31 of the official code of Georgia annotated, related to regulation of hospitals and related institutions. So is to prohibit hospitals and nursing homes from instituting any policy during a declared public health emergency that limits patients' abilities to be visited. This bill haven't referred to the committee on human relations and aging. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Ed Sustsler to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, it is an honor to bring before you today House Bill 290. This is a proposition that touches 11 million Jordans. It's a proposition that has been developed through the course of about 10 or 11 revisions of the last several weeks. We began this process very early in this legislative session and we come to you today on cross-sever day with a bill that has been refined with input from hospitals, long-term care providers, members of this body, members of the public. And individual health care providers who work for many of the same facilities and entities that are standing the hall and opposition to this bill. One of the things that bullies our efforts today is the number of licensed physicians and nurses who work for the very organizations that are opposed to this bill in the hallway urging us to pass the bill that's before you today. I bring the LC-3383, Mr. 8736 ERS, after a rigorous and arduous process with Chairman Petrie, the House Human Relations and Aging Committee, and a number of members, some of whom you'll hear from today. As we start this debate, I want to make very clear to everybody. And I know there's a lot of debate and a lot of things that are said in this room. I want everyone to listen to this one thing. The House Bill 290 does absolutely nothing to affect visitation in our hospitals and long-term care facilities. This bill is not about visitation. In fact, this bill very clearly gives the absolute power to hospitals and long-term care facilities to set their visitation policies. It gives the absolute control to hospitals and long-term care facilities to set whatever visitation policy they would want. What House Bill 290 does, however, it addresses the issue of legal representatives, those core number one single family members who are next to Ken who have the legal authority to speak on behalf of patients and alongside of patients to make sure patients' rights are recognized. This is not a visitation bill. And those who are watching this around the state of Georgia, I hope I don't disappoint people. This does nothing to enhance the ability of sending school members to come and bring pound cakes to the hospital or to a long-term care setting. So everything you're going to hear from anyone who speaks today about this bill, about visitation and taking powers of visitation away and changing this, it's just factually wrong. It's just factually wrong. This bill does nothing to address visitation that says explicitly that the visitation powers are retained solely by the hospital and the long-term care facilities. What House Bill 290 does, however, in an essential way, in a way that only this legislature can address is address the legal status of next-of-can representatives, legal representatives as they're called in the bill, and the second tier, what we call essential caregivers, who participate in the provision of care in a long-term care setting. There are three categories this bill speaks to. It speaks to legal representatives. One family member, next-of-can, that speaks for you if you're incapacitated or if you want to have someone at your bedside to help make a decision, legal representative, this bill gives you the right as a patient. It's not about visitors, it's about patients' rights. It gives the patient the right to have their next-of-can at their bedside to help them make critical decisions in the delivery of care. One thing this made this debate difficult, both in committee and in the public conversation, is a number of the false premises. The ideas are thrown out there. They're just not really even applicable to this. One of the key premises that's been false in this is that somehow this bill seeks to undermine control of care. Friends, I will tell you, the legal representative, the next-of-can family member who is empowered under our current Georgia law to make these decisions is recognized throughout our federal regulations. In fact, right here in 43 CFR, 482, this is the CMS regulations, our federal guidelines. The federal guidelines say the patient's representative, as allowed by state law, has the right to participate in the development and implementation of the care plan at a minimum the right to participate in the development and implementation of inpatient and outtrip basement treatment and care. This bill's not about visitors. What's frustrated to me is candidly disappointed, me, is that the organizations in hallways in this capital are expected to be held to a high standard. There's a letter that was put on in the offices of our members as recently as Friday. Email Sinatus, recently as Friday, the date back to February 24 in terms of the version of the bill they're talking about. There are demonstrable, there's 16 factual mistakes in this letter relative to the bill that's in front of you today. I'm not talking to you about five versions ago or six versions ago. I'm talking to you about LC338736ERS. What this does, Mr. Speaker, again, it's very clear. It creates this three tier of individuals. The legal next-of-the-fckin representative has the right under HB290 to have no less than one hour of contact, even under emergency circumstances. The hospital setting and our long-term care setting, because they're essential to the delivery of care. My son works in one of these regulated facilities. He's a 22-year-old young man working his way through college, making $15 an hour delivering meals to people in a regulated care setting. He has access to people's rooms. He comes in with a mask. He puts the appropriate PPE on. But the idea that he has special access, because he's a W2 employee of a hospital or a long-term care facility, is a false premise. Because Dr. Tamer Lane, who's an attending physician in Columbus, Georgia, who sees between four and six COVID patients per week in a hospital acute care setting, was told that even though she visits the same wards day in, day out, weekend, week out, she couldn't have contact with her own father, 74-year-old man in a hospital setting in Columbus, Georgia. She was turned away. No, you can't see him. But I'm an attending physician. I practice here in this hospital. I'm here all the time. Why can't I go upstairs and see him? I'd say, no, no, no. You can't go see him on a familial basis. The idea that people who are critical to care can't see people who need assistance in making decisions is nonsense. But you have a $15 per hour person like my son can roll the meal in to this person's room. But a family member, a key decision maker, who's an attending physician in the same hospital, has been turned away again and again and again and again, shows the nonsense, shows the incongruity of our current state of the law. What House Bill 296 today is simply to recognize that although there's a need to spend a lot more time than one hour a day in making core medical decisions, this bill simply says this. The key decision maker, who under federal regulation is recognized as being essential to the delivery of care, is guaranteed at least one hour per day. Not on the terms they would set, but on the terms that it's singularly set by the hospital of the long-term care facility. In HV290, the hospital of long-term care facility has the absolute power to decide the time, the manner, the place, and the conditions in which that person would actually have contact. If the facility says you have to have a COVID test, a PCR test, you have to take your temperature every day for seven days, then have your temperature taken before you walk in, you have to have a mask, you have to have a shield, you have to have total body garments on, all those are conditions that a hospital of their own discretion can set. To have one hour a day access to help make decisions for this family member, all of those are given in the four corners of this bill to the hospital and long-term care facility without limitation. You are very, very clear in this bill. That's not an ECH responsibility, that's not a legislative responsibility, it's not a family responsibility, it is the sole authority of the hospital of long-term care facility to determine the time, manner, place, and conditions that they set. Because this conditions change every time, we know those providers understand the settings, whether it's in an ICU, whether it's in a special outpatient pavilion ward or anything in between, or a long-term care setting. They know their settings, let them decide for themselves the context in which this important contact can be made. But we, the legislature, as directed by federal regulation, we decide, as provided by state law, the state's determine the role of this legal representative, this next of kin family member. That's what HB290 does for instance, but it does. People ask lots of questions about what about this and what about that? Thank you. I appreciate all the members that have come to us over the last three to four weeks we've been working on this, because this bill has been amended in so many times and worked on so many times from feedback from hospitals, from members, from physicians, people that have come to us from the long-term care setting, and what about this? How would we accommodate this? Friends, I accepted three amendments, as friendly amendments in committee, as we work through this process. I'd like to thank Chairman Petri and his House Human Relations and Aging Committee. We had three hearings on this, intentionally. This has not been rushed through the process. It's such an important issue. We have deliberately walked through every single piece of this bill, taking feedback from members of both parties, taking members from all entities out there, and landed in a place we've found this balance. I'd love to talk through every piece of this bill. I don't know that folks have the patience for me to do that, but I will talk about a couple high points that have not addressed yet. We talk about this issue of one hour access per day. That one hour access per day is subject to two further limitations that were brought to us as this process is this bill's move of the process. Limitation number one, this one hour of access for this key legal decision maker to have access to a person in a hospital setting is limited to stays of longer than 12 hours. If someone comes falling in ambulance into the hospital at two o'clock in the afternoon, they wouldn't be given access until 2 a.m. next morning. Twelve hours of time to make sure that all conditions are in place, the dust is settled before you ever have access, or the patient would have access to their key family decision maker. Why? We want to give a difference to the facility. Furthermore, brought to us by hospitals through one of our medical professionals yet another accommodation we've made in this bill is the detending physicians based upon medical necessity, not a rule of the hospital with a long-term care facility, but based on medical necessity, the attending physician can postpone access to this critical decision maker, the legal representative by 48 hours, two days, no matter how serious the circumstance is, in operating rooms, the attending physicians can say, representative, wait 48 hours. In transplant wards, representative, wait 48 hours. In isolation settings where somebody is immunocompromised, wait 48 hours, all of these have been firewalls that are potentially put in place in the four corners of the bill that is before you today to accommodate every circumstance one could bring to reasonably limit or constrain access of the key legal decision maker, that core family member who makes decisions with and for the patient to accommodate all the concerns you've heard, all those things are in the four corners of House Bill 290, Mr. Speaker. Additionally, and I know we're limited on time today, the issue of essential caregivers, the second tier person. Essential caregivers are defined as family members who are sitters, they're often used in a long-term care setting to actually help make sure folks are taking their medications, they monitor patients where the ratios of professional staff to patients are a little bit lower. These caregivers, subject to gubernatorial emergency, have access for two hours per day, subject to the limitations set by the facility. Once again, we give our long-term care providers all the power to decide time, manner of place. If you want to have grandma rolled out to a special meeting room where that can happen, they have the power to do that. It's completely in the discretion of the long-term care facility. We give broad discretion to our healthcare professionals. But the one thing we cannot compromise is this idea that there's some level of access. That's what we do in HB290, Mr. Speaker. As I wrap up, as I conclude my remarks today, and I know that we'll have some other speakers, I'm disheartened that there's a minority report, but you'll hear some other perspectives. But no matter what you hear, I want you to remember this, we've taken all this feedback. We've taken all this input from hospitals, from long-term care providers, and from members. We've boiled this down to the core essentials. And lastly, there's a claim that there's new rights of action. The idea that there's rights of action in this bill that could further expose the long-term care facilities just simply factually falls. I'm saddened that I've seen it in a letter from an organization. Any right of action beyond the patient themselves was pulled out in committee in the committee process. It's just simply factually not true. And furthermore, we've provided the kinds of protections in this setting that we have currently under our coronavirus legal environment. This gross negligence standard for anything that could come out of this against a hospital or a long-term care provider is provided long-term. It will go on continually in the context of these visitation policies. So we provide broad protections to our hospitals and our long-term care facilities. And lastly, Mr. Speaker, this idea of federal funding. There is more than 800 pages of center for Medicare services regulations that we've poured through and drafted in this bill. 42 CFR 42, 82, 13, 43, 10. We work through the entire body of regulation. We work through the interpretive guidance. And I've got publications for folks that want to see these things. It's crystal clear. States and states alone establish the full body of what a legal representative does, what the measure of their authority is. Because CMS recognizes we regulate medical and nursing practice. We regulate facilities such as hospitals and long-term care facilities. And we regulate civil law. The status of delegated authority to representatives of any kind is established at the state level. And the regulations are crystal clear. It's our province to establish that. We're not running from it. We're answering it. And this bill is woven into the fabric of our current federal regulations to assure that nothing is going to happen that could jeopardize the funding of our hospitals and long-term care facilities. And Mr. Speaker, in conclusion, I will say if there's any further doubt, we've heard the term built in suspenders. I appreciate Chairman Petrie work with us. We added a further provision in Chairman Petrie's committee. That the provisions of this article shall be construed to comply with the requirements of the federal CMS to obtain funding for patients, residents, hospitals, and long-term care facilities that any adjustments that need to be made to this will be made in the context of compliance of obtaining full funding with our healthcare facilities. A third layer of defense to make sure there's no unintended consequences of this vitally important bill. Mr. Speaker, before I yield them while I sort of remind folks, this has a human face on it. This is not a bill that was just developed, however, based on the human faces we see. I tell folks, this has been kind of a nerdy bill. This is a bill that's been based on details and gutting through detail after detail after detail after detail to put the provisions in place to make this workable in practice. What's been disheartening has been just the seeming unwillingness to recognize time and time again the accommodations we've made to get the bill to this point, Mr. Speaker. But I would like to thank the members that participated in that arduous and I think ultimately fruitful process. But as we think about the importance of patients, my 82-year-old father-in-law laying in the Winett Medical Center last April with a heart attack, his legal representative just lived a couple of miles away. She's a 35-year-old recently retired at county schoolteacher, his daughter Natalie, my sister-in-law, who was turned to wet the door again and again and again and again. I'm sorry you simply can't come in. Mr. Jim's going to have to withstand this himself. He's going to face these decisions of bypass surgery, of stints, whatever it was going to be for his critical cardiac case all alone. And the fact that this 35-year-old Winett County schoolteacher would be willing to put on PPE, masks, go through testing, follow the same procedures that hospital employees, doctors and nurses would follow just to have one little bit of access per day to her dad to help him make decisions after his critical heart attack was a threshold for me. As I thought about this and thought, how can we as a state give ourselves permission to say it's okay? To say it's okay that people are left alone to make decisions by themselves. That a 19-year-old young man or woman by themselves in the hospital have to make decisions that affect the rest of their lives without a mom or a dad able to come in and help them make that decision. They're left alone. Or worse, yet, they're left to look through their iPhone. Look through their iPhone, their family members as they die and facilities that we regulate as a state. Mr. Speaker, HB290 is a very light touch. HB290 simply requires a very, very, very simple thing. It does nothing with representation. Anything you hear—sorry, it does nothing with visitation. Anything you hear today about visitors doesn't apply because hospitals and long-term care facilities in this bill have absolute control to control their visitation policies. But what this bill vitally does is there's legal representatives that one family member who makes decisions for and alongside of their loved one, it guarantees them one hour per day access to help them make these critical life-changing decisions, not as a visitor, but as a core decision-maker in the care team of 11 million Georgians. Mr. Speaker, I appreciate the opportunity to bring this before this body. And I would ask every member's support and vote on House Bill 290. We have other members who wish to be heard on the issue under the rule passed by the Rules Committee debate. We'll be limited to 30 minutes each side. Chair recognizes to speak to the bill representative Beesmore. If you give me a moment, Mr. Chair, I mean, Mr. Speaker, I'm sorry, I have to wipe the mic down. Underline conditions. Thank you. So thank you, Mr. Speaker and colleagues. If you heard in human relations and aging that HB 290 was entitled the right to visit act, which eventually morphed into the patient and resident representative and visitation act, I heard my colleagues say it's not about visitation, but if you look on page 2 of the bill, line 18, it says this act shall be known and maybe cited as the patient and resident representative and visitation act throughout the bill. On line 49, visitors. So if you go to line 152 and 53, it talks about visitors. So I don't know if it was an oversight or if we're being misled. It says visitors. There was a very robust discussion and many heartfelt testimonies. We can all agree this is a feel good tug at your heartstrings bill. I cannot imagine one of my loved ones in the hospital nursing home a long-term care facility during a pandemic and not being able to visit them. However, I do trust the medical professionals when they warn that in order to keep our loved ones and other safe, healthy and alive, we will have to endure some precautions. The reason visitations were restricted was due to the pandemic that has now claimed as of yesterday's numbers 15,598 of our loved ones in Georgia. I choose to trust the science and medical professionals since this is their area expertise. So it appears this bill will require hospitals and nursing homes to allow visitors in forensic units, psych units, isolation units that are designed for highly contagious diseases like Ebola or tuberculosis. These facilities are different as different as they are usually placed to three people in the same room. If that's the case, each person is allowed to have one visitor. There are now at least four and at the most six people congregated in a confined space, a recipe for disaster. Who will be responsible at that point? Who will monitor the commings and goings of these visitors, contact tracing, whether or not they've been exposed to someone with COVID-19, or determine if they are asymptomatic? After hospitals have experienced a severe shortage in workforce during this pandemic, how will they be able to manage all the requirements outlined in HB290? If visitors refuse to wear a mask, as some of them did when they came to testify, get tested or divulge the results. Will the staff be responsible to ensure everyone adheres to the mandates? We know this is challenging here. Why exasperate the situation, hospitals find themselves in by forcing nurses to not only care for patients, but to also monitor visitors and now their length of state? Why is it necessary to codify this process? Instead, let's allow the healthcare community to come up with processes that will protect patients, visitors, and staff. They've proven to be quite capable of doing such up until this point. So if a hospital nursing home, a long care facility restricts visitation, maybe because there was a medical emergency, there was a breakout of some sort, that then will allow the patient's visitor or representative, even though they're not privy of the reason they were restricted, to follow more soot against the facility. The staff will then have to be taken away from their job, which is caring for their patients and your loved ones to deal with.\n\nThe frivolous lawsuit that could potentially send an already financially fragile facility over the edge. Georgia does not need another hospital closure. Since people are currently receiving the vaccination and the end of the pandemic is on the horizon, in addition to the fact the author of the bill stated to me that if we were not in a pandemic, he would not have introduced this bill, which further proves there is no need to codify this process. If this bill passes, it will remain as law well after the purpose of the bill. Therefore, let's continue to adhere to the precautions the medical professionals have put in place to keep all of us safe, healthy, and alive. Will you believe the science? Do no harm and vote no for HB290. Thank you, Mr. Speaker. I yield the bill. Chair recognizes Representative Roger Bruce to speak to the bill. Thank you, Mr. Speaker. First, let me be clear, I'm not against people visiting their loved ones in these medical facilities. I totally understand the value of people interacting with their relatives while in the process of recovering from these illnesses. However, I also understand that people who are already sick are more likely to have serious symptoms or to die from this virus. I totally understand the emotional need of face-to-face contact and the clinical tests that show how human contact helps the healing process. Understandably, this is one of those issues that is right for some and very wrong for others. One size does not fit all. If your car were to break down, you would not call a doctor or a medical professional or a legislator to fix your car. You would call an auto mechanic. If you had to leak at your house, you would not call a doctor or a medical professional or a legislator to fix your pipes. You would call a plumber. My point is that while we all want to do something to help, there are others that are educated and experienced in dealing with this issue. They are called doctors and medical professionals. They are not called legislators. I looked at the bio of the author of this bill. One of the statements in his bio is that I, and I quote, that he is against, that he is forced, he is a constitutionally limited government. He is for constitutionally limited government. Clearly, this legislation is inconsistent with that principle. This legislation gets into the day-to-day operation of a medical facility and does not take into consideration the specific needs, that exist now and what may occur in the future. I truly believe that the author's intentions were sincere and based on wanting to help. But the unintended consequences of taking away the local management's ability to look at what is going on in their facility and to be able to put policies and procedures in place that meet those needs is a serious mistake. Whether you are for or against visitation, we should all be against taking the decision-making process away from people who are given the education, who have the education and the experience to make these decisions. We have to think about the medical and scientific facts of what is going on and we have to take into consideration the needs and the ability to take care of patients, doctors, nurses, staff, and the general public. I ask you to vote no on this legislation and return it to the professionals as to speak our ULL. To recognize this representative Mitchell to speak to the bill. Thank you, Mr. Speaker. I rise in opposition to HB290 not because I disagree with the original premise, which is that physical contact is important to mental health and that we need a restructuring of policies. But because we need a better version of this bill, we need policies better in line with science and medicine. The first call I received as a legislator about visitation of an essential caregiver as termed in HB290 in a long term care facility was from an 80-year-old constituent whose mother was 104. They were both vaccinated and she wanted to know why she could not visit. It was February this year and our cases in Guinnette were still above 10% PCR positive, which prevented the majority of families from entering facilities except for compassionate care visits. As I stand here today, the state of Georgia has a 5.8% PCR positive test rate, which means most long-term care facilities are very close to the threshold of being qualified as in low transmission areas for the first time in months, dramatically changing the ability of facilities and hospitals to allow visitation whether they have a representative, caregivers, or families. I since received over 100 emails about HB290. Almost all of the authors believe that this legislation will bring a substantive change to visitation policy during the epidemic. I wish that were true. We do need change. We know the impact of absent caregiver visitation on the health of individuals and care and on their loved ones who are so concerned about them. We know that grandparents, mothers, fathers, and children are the concept and the essential element of a caregiving program. How we go about initiating policy change matters. We have not had this level of pandemic in 100 years. Hopefully we have another 100 until we see it's equivalent. But our public health policies are not designed for one specific epidemic and we cannot in sconce in rigid state code the options that specific lawmakers believe are adequate for this epidemic for all future epidemics because they cannot by definition serve a different environment. And the changes HB290 seeks to make are primarily going to impact non-epidemic times when circumstances are dramatically different. We need to instead respond to the situation at hand in the way that best protects Georgians. Looking at local guidelines and CMS guidelines, there's no question we need revisions during the epidemic. There were no policy changes for vaccinated individuals because when these policies were written there was no science behind vaccination impact. Indeed there was no improved vaccine. We're not in that moment right now. We need to see changes both at CMS and the level of the governor's executive order to support caregivers and visitations. This is what I tell every person I have this conversation with. And these are the places we need to advocate for change. HB290 as it went into rules does not significantly acknowledge infection control as an essential element to keeping Georgians safe. Well I'm sorry. Sorry I've lost my place. At an individual and a population level it prevents any hospital and any long-term care facility from implementing entry controls to protect staff and designated representative from highly infectious individuals when necessary whether that people be people with drug resistant bacterial infections or viral infections. It does not acknowledge that hospitals can actually reach the maximum capacity of staff and that prepping and supervising a daily designated legal representative to come to keep everyone safe requires health care workers to take time away from patient and resident needs. It does not acknowledge that during an outbreak inside a facility preventative measures may need to include contact restrictions just like a home quarantine does. We need this policy discussion to involve and be driven by the departments of public health as well as the Department of Community Health working with policymakers and advocates. If we were going to enshrine in policy specific guidance for legal representatives or designated caregivers we need it to be possible in the context of the system the federal requirements and we need the state to commit to funding required to implement it and underfunded an unexecutable mandate leaves patients residents families and facilities all extremely frustrated and unable to move forward. An alternative bill HB 649 is a good place for that discussion to start. I think that effort should be collaborative and ongoing to revise policy because the problems that are heightened in the pandemic are just that they're heightened but not created. We need to do better at all the time and we need to build sustainable policies. The why we'll be voting no on HB 290 I sincerely hope we continue to push for much needed changes in visitation policies in this epidemic. No matter the designated title of those non-patients or resident individuals. Thank you very much and I yield the well. Okay that completes those who wish to speak in opposition. Now we go for 30 minutes to those who wish to speak for the measure. Chair recognizes representative Patty Bentley to speak to the bill. Thank you Mr. Speaker. I rise this afternoon colleagues to share my support of House Bill 290 but before I get further into my remarks I want to thank each of you for all acts of kindness and love shown to my family doing my husband sickness since December 27th. I'm eternally grateful to each of you for all acts of kindness and I greatly appreciate your prayers and I ask that you continue to pray for the entire Bentley family. But I especially want to thank my leader James Verily for being on the phone with me that horrible night in December when that ambulance broke down on the interstate 16 on our way to Savannah so I thank you so very much for keeping me come because I was quite hysterical that evening and also thanks to our hospital friends out in the hallways that are watching I thank you too for your support. But again as I stated I'm here to speak in support of the bill that said hand right now which is House Bill 290 because a few weeks ago have voted against a bill because it was stated repeatedly that it did nothing for the people for the people for the people and I believe House Bill 290 is a piece of legislation for the people and I ask each of you for your favorable consideration for a bill that will help the people across the state. Let's do what we can colleagues for the sick and shut in. The hospital that my husband is currently in down in Savannah presently allows one visitor per day up to four hours. But the nursing home that he most likely will be transferred to will not allow any visitors any day and he can't speak and he can't feel and that word is me all day long knowing that my husband may be in a facility that I can't go in to see him and he can't speak nor feel. You know there's an old gospel song that says if it ain't been no rain in your life wait a while. If it ain't been no rain in your life wait a while and I know some of our new members are probably saying what you're talking about represented to Bentley what you're talking about strawberry queen that's not proper English it ain't been no rain yes sir yes ma'am you're right that it's not proper English but guess what it's true and how I know it's true my friends because the Bible says the Bible says the Bible says in the book of Job man born of a woman is a few days in full of trouble it didn't say if you are a state representative you are a zip neither did it say if you was a state senator you are a zip it says man man born of woman is a few days in full of trouble and you know there's another gospel song that says I'm so glad that trouble don't last our ways and so to the people across this state we are going through a troubled time right now but just hold on help is on its way it may not be house built to 90 but I certainly hope that it is it hope that it's something that will open the doors for us to be there with our loved ones so to all of the founders across this state as I stated we are going through a storm right now but let's keep in mind that trouble don't last our ways I I am so glad that trouble don't last our ways and with that Mr. Speaker I yield the well thank you lady has yielded the well chair recognizes chairman Newton to speak to the bill thank you mr. Speaker and colleagues I've so many of us have all the different professions I have mine happens to be the last 30 years I've been in a hospital setting that's where I go every day when I work professionally I work with a tremendous team who over this past year when somebody can't breathe due to covid they've been walking toward that room not the other way which is what we'd all like to do I work elbow to elbow with some nurses PAs nurse practitioners who are just incredible professionals they're working today taking care of Georgians and emergency departments across this area but I really want to thank number one something that's been mentioned to similar to the strawberry queen we have people across Georgia watching this watching what we do here on their behalf and they feel just as passionately about their loved one maybe it's a child maybe it's a spouse maybe it's a parent who's in dire need of some help that we can help provide I do appreciate also the the author of the bill who went through multiple revisions since I do look at this haven't worked all my life in a hospital I look at this very definitely from a hospital's perspective I've been on the medical staff we've been on executive boards we work and anything that would threaten our hospitals I was very adamant that we needed to look more carefully find a different way out find a lighter touch get to the right federal regulation so that we were sure we were not endangering that and that's what I want to just say a note of thank you to the bill author for being willing to hear episode after episode legitimate concern brought up in the bill changed you mentioned I don't know how many revisions but we've had multiple revisions because of some of the stuff that's aunt has been mentioned today I'm reluctant to substitute our knowledge here in Atlanta for subject matter experts like the ones I might have worked with at a hospital I'm real reluctant to do that but like I mentioned the people watching across the state there are people whose lives have been upended by some things that were missing some opportunities that were there that are in federal regulation regarding a representative a support person and then there is visitor mentioned as an earlier representative mentioned visitor is mentioned in the bill that was put in there actually because it's the template that the hospitals requested they wanted to be required to to post their policy and to come up with a with a kind of an appeal process so that was actually where language from a hospital was added to it but what we did a little bit more in addition to having visitor language in there it was very clear from the same language in the federal register that addresses visitation policies that there are support people that's different it's a different essential caregiver it's sometimes called and then as you did more study you realized there's this other small very small category called the legal representative or representative of a patient it's the same reason a parent can go in a child's room it's not because it's perfectly safe to have an extra person in the room it's not it's not perfectly safe to have parents coming in and out so they come up with reasonable safety standards to make sure that that child a minor child can have a parent or someone with them that's their legal representative to help them make decisions if you've ever seen a patient who's gotten some challenging information but just like a child even when we're adults we like to think we're self-reliant and independent and strong decision makers but that's when we're healthy that's when we feel the way we do here now running up and down marble steps walking around on our own when people are sick you start to feel a little bit more like a child a little more dependent on other people maybe you can't breathe even get across the room if you've ever seen when a loved one who cares only for that patient for no one else in the hospital but when they can come in a decision maker can come in to the room with a patient and I as a doctor or a team of caregivers can give kind of the information that we found so far and what our plan is going to be but when you see that that trusted individual step into the room with the patient and maybe they get grabbed two glove hands and they and you can see the anxiety melt off a patient's face you realize same way the federal register and and CMS recognize how important visitors are but this representative is far above that and that's appreciate the way this bill has been crafted for the lightest touch possible I mean if you told many parents they could only go an hour a day with their child who was the other 23 hours by themselves you might have a problem but this was considered to be the lightest touch possible for adult patients who who would request it they don't have to request it but if they did request it they could have a legal representative there with them to assist them in making those decisions to to absorbing the information when they're sick or can't breathe or in pain or sedated to have somebody they trust there to listen to the information to help them process it to know that that person cares only about them you can see we can make a difference we can make a difference in the lives of people that are watching we can make a difference if if something comes up again once again the last thing the safety protocols are designed by the hospital if it's a if the safety protocol is a knee replacement the concern might be here for the safety protocols that she would require of a kidney specialist to come into the room mentioned tuberculosis I go into rooms all the time with tuberculosis but I take the appropriate precautions if it was a flu season deadly flu season it might be here if it was COVID or Ebola the requirements might be way up here the hospital gets to decide that that's another thing I think the author made in a revision to recognize that we're not going to specify the safety protocols we're going to let the subject matter experts specify them but what we're not going to do is leave Georgians patients sitting in a bed unable to fully comprehend unable to have an advocate there with them a legal representative we can do better than that the hospitals can do better than that I hope we'll pass this bill and and bring that relief to people thank you mr. Speaker chair recognizes chairman body rich to speak to the bill thank you mr. Speaker I come today to give a personal perspective but before I do I feel compelled to correct some misstatements this bill very clearly provides that hospitals and long-term care facilities beginning on line 85 shall not be prevented from imposing reasonable safety requirements relating to the in-person physical contact there's nothing that this bill this bill does not prevent that and this bill is not written for COVID only this bill is written in response to the best efforts that we made to respond to the pandemic and we've learned from it this bill was written so that we never again due to people what we have done over this last year Sunday afternoon last February I unexpectedly became very sick an urgent care nurse practitioner concluded that I had had a false negative flu test and sent me home with tamma flu and instructions to alternate ibuprofen and acetaminophen but shortly after midnight I was in trouble and my husband took me to the emergency room the ER started IV fluids and medication and began testing in the beginning the nurses weren't in the room with me the whole time they were in and out but my husband was there with me I was not alone he went for blankets when I started to shiver I had a fever of 103 104 and he turned me on to my side when I got sick so I wouldn't choke he gave me ice chips for my lips I was in a lot of pain and breathing was becoming difficult over and over he would adjust and readjust the stretcher and shift my body so that I could get into a position that I could breathe my blood pressure dropped dangerously low as did my blood oxygen level and my heart rate sky skyrocketed the nurses were in the room with me constantly now there was more than one there were a few they were pushing medications and doing different things but nothing that they were doing was making me any better I was getting worse my whole body started to shake violently I couldn't breathe and I started to panic I could see that the doctors and the nurses were not going to be able to help me the only thing that gave me any comfort was having my husband there with me holding my hand and looking me in the eye to calm me down when he was told how sick I was he called my mother who lives out of town now in the middle of the night and she booked a flight to Atlanta the next morning within hours and I have a memory from that next morning and I see you of opening my eyes very briefly and seeing my mother smiling at me Dr. Newton is right very very childlike the joy that I felt the childlike joy at seeing my mother's face was indescribable I still I couldn't talk and I couldn't even hold my eyes open very long but I did manage I think to curl my lips into a little bit of a smile so that my mother could see that I knew she was there and that I was happy that she was there I know that I have a pain free beautiful eternal life after this one and I am so happy to tell you that my faith truly gave me a supernatural peace about what awaited me on the other side I am not and I was not afraid of death of what came after the transition from this earth but I was and I still am terrified of the process of dying because what I experienced was frightening and painful first and foremost I wanted the doctors to make me better but when I saw that they couldn't which obviously we see now that a week later they did but I believed that they were not going to make me better the only thing that I wanted then was to not be alone that is all I wanted when the doctor told my husband and me that they were taking me to ICU I couldn't talk much and it took me a while to get the words out because I didn't have very much breath but I did manage to ask my husband to please not leave me I knew I did not want to die among strangers I felt an intense grief and sadness over decisions that I had made that I thought were going to leave my children without a mother I really believed in that moment that I was not ever going to see my children again and before I lost consciousness I told my husband specific things that I wanted to tell each of our children I don't even remember it now but he told me about it in the weeks after I came home we pieced together a lot of what I didn't remember and when I felt strong enough I asked him what I had told him to tell each of the children and he told me their messages people have things that they need to say things need to be said what kind of society denies this how many people have died over this last year needing to say things to their loved ones but were denied the opportunity how many people have suffered physically and emotionally alone wanting a loved one by their side to comfort them is there really anything more important than that we all can imagine how terrible we would feel to be separated from a loved one who is sick or dying and sadly many of us now know what that feels like it's happened countless times over the last year and we heard testimony after testimony after testimony at the public hearings on this bill of people who did just that I come here to tell you all today what it's like to be on the other side what it's like to be the one who was sick or dying and possibly alone like Dr. Newton said I was in a weakened state physically and emotionally the last earthly desire that I had was the cum-\n\nof being with someone I loved and who loved me, I'm independent and I'm a rather strong-willed person. And that was my heart's strongest and last desire. Think about the elderly, those with dementia, adults with diminished mental capacity, intellectual disabilities. How terrified and confused must they be if this is how I felt? I think of Mistabra Malone, a lady that I've met through this process. She has a daughter who's 43 now. When she was a young child in elementary school, she had a brain tumor. She was a normal healthy child. She had surgery and now it has left her daughter with the mental capacity of a six-year-old. This lady hasn't seen her daughter in a year. Her daughter, her 43-year-old daughter, cries and asks her mother who used to take her to the mall and visit with her daily. Why she didn't come for her birth day? Why she didn't come for Christmas? Think about how much people like Mistabra Malone's daughter need a loved one by their side. It's inhumane and contrary to a civilized society to deny anyone the comfort of love in their last months, weeks, days, or even hours on this earth. That's what we've been doing for the last year. Our state has seen fit to allow compassion visits. When one finally reaches the last hours of life, when they've become totally unconscious and incapacitated, when they have no idea that their loved one is even there, when they can't say those things that they need to say to their loved ones, that's when we let them in, that's when we decide it's safe enough that they can put on PPE and go in and visit. If it is safe enough, then it is safe enough before that. There are things that can be done. We can make this work. We're smart. We're determined. We have family members who've been begging to be led in, to be offered to test, to put on PPE, even who've been vaccinated and they've been denied access to their loved ones. Meanwhile, the employees carrying in the lunch trays and empty in the trash are allowed in the rooms all day long. Even when 70% of them have refused to be vaccinated, that's wrong. That is wrong. There are reasonable protections that we can put into place to balance the public health needs with basic, decent humanity and their in-house bill 290 already don't let anybody tell you that they're not there. I helped write it. They are there. Nothing should stand in the way of you're doing what you can to make this happen. Thank you, Mr. Speaker. I yield the well. Chair recognizes representative LaHood to speak to the bill. Thank you, Mr. Speaker. In members of the house, we're here talking about the patient and resident representation and visitation act. And I wanted to say the title because I wanted to point out the words patient and resident are both mentioned in the title. And the reason both of those words are in the title is because there is a difference between a patient and a resident. You see, a resident has taken up resident somewhere and referring to the long-term care settings. Because that's what my experience is. As a matter of fact, I grew up within walk and distance of a 142 bed, it sits at living community that was owned and operated by my grandparents and my parents. And so from the time I could walk, I was running up and down the halls and playing hide and go seek and spending time, lots of time every day with people who were the age of my great-grandparents. And as I grew older, you know, the generation of people being served in our, in our, it's to live in community where my grandparents age. And today a lot of them are friends with my parents and their generation. So the gap's closing. But I say all that to say that it's been a similar time with an older generation, I know for a fact that as a person grows older, their priorities change. And what's important to someone when they're 80 or 90 or 98 years old is different than what was important to them in their 21 or 30 or 40 or 50. You see, it's the scarcity of something that makes it valuable. And I can think of a lot of different examples. But one is freshen my mind from this morning. It was in the hall outside the rules committee this morning. The hallway was as packed as it's been all session with people outside the rules committee, because time is getting scarce. People wanted their last shot at getting their bill through rules. Well, when you're 80 or 90 or older, statistically, your time is limited. It's getting more scarce. And time with family and loved ones becomes much more meaningful when your time is running low. When you're in your last years, months, days, or moments of life. This bill allows health care providers to set reasonable safety protocol around the legal representatives, essential caregivers and visitors. I know for a fact that the quality of care goes up when a representative or advocate of the resident or patient is allowed to be present. But that's just a fact. This is about more than keeping people alive. It's about giving them a reason to live. Avoiding death is not the same as living life. I believe there's worse things than done, and that's being kept alive with no purpose. And so I'm speaking on behalf of the long-term care residents in this state who have been next week a year living with visitation restrictions. This bill goes a long way to make sure that that doesn't happen again. And I acknowledge that there's good reason that the restrictions have been in place. But I also know that the cure can't be worse than the disease. So that's why I'm asking you to please vote yes on this bill. Thank you. I yield the well. Chair recognizes representative Gilligan. Two minutes are left on those in favor of the bill's time. Thank you, Mr. Speaker. And I had some notes, but with two minutes, I'll just talk very quickly. Everybody who has already spoken to this bill and to this important matter. This is a matter of the heart. On more than one occasion and for more than one person, I have been the legal representative in the room. Making decisions for yourself is hard. Making decisions for someone you love. You can't measure the difficulty. I know what it is when a patient is coming out of anesthesia. And the doctor is talking with the patient. And an hour or two later, that patient has talked to me and said, when is the doctor coming by? I'd like to know what's going on. That's why you need that legal representative. And I'll end with one other thing because I know our time is short. And I'll echo what my colleague just before me was talking about. About being alive. And the difference in being alive and living. Thank you. Because you see, being alive is just existing. It's eating, it's sleeping, it's doing those things that you have to do just to stay alive. But living are those moments that take your breath away. Living is what we need to be doing. We need to be striving. And I'm asking all of you here to consider the living and helping them to live their best, full and complete lives. Please, I urge you to support House Bill 290. And thank you, Mr. Speaker. I yield the well. Lady, is yielded the well? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report under the rules of the House. 20 minutes are allocated to speak to the minority report. The chair recognizes representative Roba Show. Thank you, Mr. Speaker. I believe everyone in this chamber wants to do what's right for the citizens of Georgia. If only life would make those an easy decision. Unfortunately, that does not always happen. This past year has shown us that life is not simple. And that decisions made in this chamber need to take into account a future that no one can know. No one could have known the extent of this pandemic in Georgia. Over 800,000 infected. Over 15,000 dead. No one could have known the world that would require such drastic changes in our lives to stop the spread of this virus. One of the most important lessons we have learned is that no one can know exactly what the next public health emergency is going to be. Or how best to deal with it. This is why we need to rely on science. As many of you know, I lost my father in January. What you may not know is that he had three hospitalizations in the six months prior to his death. Like many in this state, I know what it's like to sit in a parking lot while your loved ones in an emergency room. And communicating with the doctor and the nurses via phone. Making medical decisions because I am his legal representative. But I also knew that the staff were doing what was in their expert medical opinion was best for my father and for the other patients in that facility. They were following the science. The other two hospitalizations were later, and I was able to sit at his bedside for a limited amount of time with appropriate protective gear. And going through specific testing as additional scientific evidence had allowed the medical experts to devise a way for me to be with my father. I walked through crowded ER hallways filled with beds against the walls with patients and many of them. Why? Because our ERs are overcrowded. And that is the best way they can provide care to the many number of Georgians who are still needing that care. These teams of dedicated care providers are doing everything they can to keep people alive. Day in and day out. Some of you may have heard me talk about an immediate family member of mine who works as a physician assistant here in Atlanta. She has for the past year worked in a COVID ICU unit here in Atlanta. And she has described many of the obstacles she and her team members work through each and every day to provide the best care they can. They have sacrificed so much and have worked in conditions that no one can truly understand unless you have been there. She works 13 hours shifts, always putting the patient in the patient's family first. All of these amazing angels, she would love to have families with their loved ones. But she has also been in the trenches when she is having to take care of multiple patients that are on ventilators, on complex drug regimens. And in intricate care plans, in an ICU room that was built for one patient, but because of the overflow of our facilities, have two or three in them. Every time she has to enter a room to take care of a patient, she changes her gloves, she changes her outer protective gear, she changes her protective face shield, she changes her face mask, and she actually changes her foot coverings. When she leaves the room, she removes all of this gear, and she repeats this process before she enters every patient room. She repeats this process over and over again and again for 13 hours. HB290 would now also require her to monitor the time a patient representative is in the room with these patients. Is that realistic? HB290 is well meaning attempt to try to write this crazy year we have been through. But when we pass legislation, we must think about what the future could hold. In this pandemic, over 25,000 long-term care residents have contracted the virus. Over 4,000 of those residents have died. When you compare this to the general population, the numbers and the sciences overwhelming. 10% of the general public contracted the disease, and 1.8% of the general public who contracted COVID died. In the long-term care facilities, 21% of the residents there contracted this disease, and 17% of those residents died. That's 10 times more of our most vulnerable citizens who have contracted and died from this terrible disease than the general public. Sciences shown us that infection control in these facilities had to be increased to contain this killer virus. With the introduction of the vaccine and better infection control procedures, we are seeing success in the reduction of these infections in these settings. Science should be used to allow family visitations moving forward. I've heard many under the Gold Dome praise Governor Kim for following the science in his decisions regarding the public health emergencies orders that have been in effect since April of last year. Many tout this as a reason why George is doing so well this past year in our businesses and unemployment and other aspects. What I cannot understand is why is it okay to follow science when it comes to opening businesses, but according to HB290, not when it comes to taking care of the health of Georgians. No one denies that family involvement in health care is the gold standard that those of us in the field have always strived for. I have worked in health care and public health for over 40 years and I have always welcomed involvement from family and loved ones when in my professional opinion, it would not have been a possibility of harm to my patients or to my staff. Science has always driven my patient care decisions. This bill in this body cannot know what the next public health emergency might be. Could it be a disease more like Ebola, which can be transmitted by contact through a simple abrasion on your skin or a virus transmitted through some other mechanism. We just don't know. This bill contemplates that a person in a transplant unit or a severely immunocompromised condition will suddenly be in a better clinical situation within 48 hours. That is not how medicine or science works. We all want families to be together in difficult times. We all want our elderly citizens to have their loved ones close to their side during their remaining years. We all want what is best for all Georgians. I believe we should leave decisions regarding science and health to those who are best qualified to make them, the scientists and public health professionals, not to the politicians. HB290 dictates rules without taking into account what science in this virus has taught us. We cannot know the future, what the future will be, and how we will have to adjust our lives to deal with whatever comes next. There are other measures that have been proposed that I believe are better solutions to this pressing issue. And I hope that those are given fair consideration as we move forward in this great unknown we call life. For these reasons I urge you to vote no to HB290. Thank you, Mr. Speaker. I yield the well. The lady is yielded the well. The chair recognizes representative Allen to speak to the bill. Thank you, Madam Speaker. So let me start off by acknowledging how serious of an issue this is and that's very difficult to solve. And I know that firsthand because of the line of work that I'm in and working with hospital systems in every corner of this country. There have been many administrators who I've set on the phone with in tears over this issue. So this is a very, very important issue and one that I thought so important that I also drafted an option to be looked at because having that access is extremely, extremely important. There are times when loved ones in their most dire times need that access as representative Rich and others have talked about that it's extremely important. I alone with others in this chamber have been personally impacted by what is going on with the lack of visitation. Back in September I was dropped off at the emergency room at a hospital here in Atlanta. My wife waved to me from the car because it wouldn't even let her get out of the car let alone come to the door. It would be six days later until I was able to lay eyes outside of FaceTime on someone I love and trusted. This as I said is a very, very serious issue. Now I want to be clear that no one, not one nurse, not one staff member, not one administrator, not one technician took the light in keeping a family member away from someone they love that was on a gurney or in a bed inside of a hospital. Those family members are a critical part of the care team and provide relief, insight and support to the staff. If you talk to a nurse no one is more happy to have a family member at that bedside than a nurse because it released them from going to get the ice chips from helping them to the restroom, helping them shave. We understand that these family members are a very, very critical part of the care team and something has to be done. The question is, is this bill the right way to do it? Now I want to separate hospitals from long term care facilities because if this bill were just about long term care facilities, I would likely be okay voting yes, but it's not. This bill forces hospitals and physicians to go against the vital tenet of their practice, first do no harm. And instead says first listen to the state. This bill requires that a hospital in the face of a medical emergency ignore CMS CDC guidance and even executive order. Now we've heard the conversation about it gives the hospital reasonable restrictions to be placed. Now it has a cause of action which says if I the loved one don't think what you're doing is reasonable, I'll see you in court. Tying up a situation where we're wanting access but instead getting access to the courtroom. So the as the bill states the policy also must be posted on the website but in a medical crisis the average person is not looking for nor knows to ask to see the policies of a hospital. The reason for the complex classification system that the author talked about is this was the only way to get around, you know, the CMS guidance by finding a provision in the rule that gives states the ability the flexibility to have this designation of a legal representative. But I think we're drastically stretching the privileges the designation gives to such legal representation. And I don't forget that we have been living through an unprecedented time with a virus that has been raging out of control and the care facilities all wanted all they wanted to do was protect its operation and trust and though and protect those entrusted in its care. Once again first do no harm. So I want to thank the nurses doctors housekeepers technicians and said earlier all of the care staff for what you've done over the last year. And it was not your desire to keep people out. I believe this bill is a bad way of showing that you are the heroes that we put yard signs out in front of all these hospitals for. We know that these policies were put in place to keep patients safe but most importantly to keep you safe and this bill basically erodes that protection for the group who proudly wears the badge of essential worker. Just think of what would have happened if there was a major outbreak at a hospital and staff was sent home in quarantine at a rate that put the operation in jeopardy. This actually happened early in the pandemic in a hospital in New York City. If you recall in the Bronx they were sending people away from the hospital that were already in care because of the inability to find staff that could come in. But for the health of the staff there is no one to care for the patient. Once again first do no harm. Hospitals must be entrusted to do what is best to maintain operations. Well they are not helpful to the communities the patients or the families that they serve. Now to the families and those that have been pushing for access. I hear you. We all hear you. And we all have a heavy heart for what you have gone through. And I think everyone in this chamber is committed to getting something done to make sure this never happens again but this legislation we have before us is not the solution you have been promised. And it will likely not withstand the scrutiny of challenge. We have an opportunity to get this right. I have worked on legislation with members of both parties that is implementable. The hospitals agree. The families that I have talked to agree. And it would give everyone families just like mine and others that have spoken. The assurance that the next time something like this happens we will not be shut out. Now we are going to vote here in a minute and many will vote yes. But many of those yes votes will not be because they feel that this is the best bill. They feel this is the only option that they were given the opportunity to vote on. And with that I yield the well. Gentlemen is yielded the well. The chair recognizes chairman Petri for the chairman's time. Thank you Madam Speaker. I appreciate the opportunity to be here today. My friends to address this very important issue. But I'm going to emphasize something real quick that needs to be said and that is this. This is a bad guy is here. No one is responsible for all that we have suffered with over the past year. And indeed our hospitals, our nursing homes, our assisted living facilities, our personal care homes and our community living arrangements, all of the facilities that are touched by this measure are heroes. And for everyone in this room that is on our committee you've heard me say that at every meeting. What this bill about is more about what have we learned during the course of a pandemic? What have we learned? If we don't learn from these experiences shame on us. Now as the chairman of this committee I want to make sure that everyone here is aware of something. I want you to first know that we put right at six hours of testimony, debate and discussion into just this bill. I want you to be aware that we had close to ten iterations of this measure as we listened to everybody's opinion on every side, every facility, all of their concerns. And of course yes to many, many, many Georgians who have suffered. This bill according to the Department of Community Health that we met with at length as well. I need to make sure everybody hears this does not in any way according to the Department of Community Health, which licenses these facilities, does not in any way jeopardize any licensure. Licensure or any reimbursement. And indeed we used federal language from their statutes and guidance throughout the bill. The whole focus on the patient representative came straight out of federal language. Well now let me tell you all real briefly how I see this bill through two different lenses. First as the son of a man who died during COVID killed by a drunk driver by the way at 8 a.m. but I digress. And I saw the suffering that he lived through as he lingered for three weeks. The suffering that my father lived through and my siblings. That's my first lens. But I've got a more important lens for this bill. I have been a long-term care provider in the state of Georgia my entire career. I have dedicated my life 30 years to serving and caring for the weakest of the weak. The frail.\n\nthe elderly, the disabled, children with developmental disabilities, children with autism. This is the passion that fuels my entire existence. It's who I am. And I want to tell you about this bill from that lens because that I think is so important. When you've been a long-term care provider as long as I have, you deal with a whole lot of folks while they're suffering. And you deal with a whole lot of folks at life's end. And let me tell you what I have learned as a long-term care provider as my other colleagues know so well as representable hood knows quite well. My friends, I cannot tell you the power of family. I cannot tell you the power, the healing power of family. It is crucial. It is crucial. And I'm going to ask you all a question. I want you to imagine, if you will, being a developmentally disabled child, or a child with autism, or a senior with dementia, or Alzheimer's. And I want you to imagine being in any of these facilities we've described with no one, with no one, with no one to touch you, to hold your hand and you don't understand. And you're confused and you're lonely and you're afraid. Now, when you're a long-term care provider, that's what you know. And I'm telling you, that's what Georgians are suffering with across this state today. Some of them languishing and skilled nursing facilities for almost a year, without being able to touch the human being in their life that they most love and care for. My friends, I'm going to simplify this for you now, because there's somebody very special that needs to speak to this bill. But I'm going to simplify this. This is real simple. Here's the deal, 30,000 foot view of this bill. Georgians are suffering immeasurably. Okay? Number one, number two, pretty simple. If we can have, we in the long-term care world and others, if we can have a myriad of staff coming and going into these facilities, not just doctors and nurses and therapists, but aides and caregivers and housekeepers and people emptying trash cans and mopping floors, if all of those people can come in and out, three shifts a day, all day long, every day. Why can't that one legal representative come in for one hour a day, one hour a day? That person that they need to make decisions, that person that they need to help them understand what they're living through and what their health care providers are saying, why can't we do that? When all of these others come and go, that is the way you simplify this bill. That is what this bill does, and I'm going to ask you to support it today. And Mr. Speaker, Madam Speaker, I'm going to yield the balance of my time to the Speaker of this house, Speaker Rauston. Chair recognizes Speaker Rauston to speak to the bill. Thank you very much, Madam Speaker. I didn't plan to come down here today. I didn't write anything. I really was just going to let this get debated, but you know it really kind of occurred to me that sometimes you just got to do what's right. You know, you got to give voice to those that may not give us campaign contributions, that may not be powerful, but they're Georgians. And when this rides over, I want to be able to say that there was a time that I did that. And that's why I'm down here. I'm down here, first of all, to give great credit to the author of this bill. One who I've worked with for many, many years, we don't always agree. He's stubborn. He's detailed oriented beyond the point of driving me crazy sometimes, but he has worked ferociously on this bill. And anybody that says this bill does it kind of account for all of the science and all of the policy considerations and all of the health considerations just haven't read the bill or haven't seen the work that the author has done. That's one reason I'm here to say that. He's been joined by Chairman Rich, by Chairman Petrie, by Majority Whip Kelly and so many others in working on a great bill. But I'm here to speak for some others. I'm here to speak for a young husband who called me last summer and said, can you help me get in to see my wife at a hospital because she's dying? Well, it sounded easy enough and I found out I thought of all people. Maybe I could do that. I couldn't do that. He said goodbye on FaceTime. I'm here for a friend of mine who saved goodbye to his brother through a hospital window while he and his family stood on a hell of pad outside because they couldn't say goodbye in person. And I'm here to speak for a daughter whose conversations I have heard who tries to explain to Mama why she can't come see her. And then five minutes later have to explain again why she can't come see her. And I've seen Mama deteriorate because Mama's been alone and those phone calls to the daughter are getting less frequent. That's why I'm here. I'm here for the people in Georgia. You know, I've been a little bit struck today by some of those that have taken certain positions on this bill because they talk a lot of times about we got to stand up for the people. We got to stand up against the special interest group and stand for the people. Well, that's ringing a little hollow today with me. It's ringing a little hollow. Because let me tell you, I know there's people in the hall out there and they're friends of mine. They're dear, dear friends of mine. But you know, there's another group of people that are waiting on this bill too and they're not standing in front of a monitor in the hallway of this capital. But they're back in your hometown and they're waiting and they're watching. They want to see what you're going to do on this bill. And those are the ones that I choose to stand with today. I hope, I don't know what this house is going to do. I hope that you will send a message. Send a message that's so loud that it gets across the hall over there. So that they know that this matters to us because it matters to Georgians. But more important than them, send a message to the people who's pleased and hurt and heartbreak. We're trying to touch in some way. And it's for all those reasons that I ask you to vote yes on this bill. I yield the well, Madam Chair. The gentleman has yielded the well. Is there any objection to adopting the Committee's substitute? The Chair here is none. The Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose does representative Cannon rise? Parliamentary inquiry. Statue inquiry. Is it not true that this bill strips the powers of the governor and that it will be litigated in court? The members of this House will have an opportunity to vote at that right now. For what purpose does representative Holly rise? The Parliamentary inquiry. Statue inquiry. Isn't it true? Well, rather, isn't it unfortunate that when I just spoke to my mother who had to sit there as my sister died on that hospital bed when we knew that this state did not give the Affordable Care Act money that would allow for her to live is really something seeing the tears and the pain that people have expressed because we don't want to say goodbye to our family members. But I wonder when our state will have the capacity in the heart to put the money there and make it available so that people don't have to die on the hospital bed. Fortunately, that when I spoke to my mother and she told me as much as she wouldn't want to be there for my sister, she realized that if it was going to put her life and others in danger because we're in a pandemic that this is something that we have to give to the doctors and make sure that they have the right to say what's right. The chair greaves for your mother but the measure you discussed is not what we're voting on. We're going to move on and vote. We've had a debate nice and long and the chair will recognize no more parliamentary commentary. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 113. The nays were 57. The bill having received the requisite constitutional majority is therefore passed. All right. We're on the rules calendar. The clerk will read the caption to House Bill 255. House Bill 255, our任. The call will come. The 81st being titled back to amend chapter 24, title 15. The district will draw Janet Tated relating the sexual assault protocol. So it's to require certain certifications to be filed. This bill that referred to the committee on judiciary non-civil that committee recommends this bill do pass by committee substitute. Chair recognizes representative Holcomb to present the bill. Thank you, Mr. Speaker. As mentioned, today is International Women's Day and it's also my sister's birthday. So I want to wish her a happy birthday. She was born in Valdosta when my parents lived there when my father was in the Air Force some time ago. The bill that I am bringing before you today is House Bill 255. And this bill builds upon important work that this state has undergone for the last half decade or so to improve the state's response to sexual assault. In 2016, you may recall that we worked to end the backlog of sexual assault kits since then we have funded the testing of sexual assault kits. This is led to the identification of serial rapists and it has also led to prosecutions of previously unsolved crimes. In 2019, we worked to extend the preservation of the time that we preserve evidence in this legislation which was developed by the State Expert Committee. On sexual assault provides a few more measures that will move the state forward. The first thing that it does in section two is that it sets forth a certification for the sexual assault protocol and all jurisdictions. Not all jurisdictions have been complying with this provision of the law which has been the law for some time. So this is to remedy that. The second section is to update the code to reflect cases where the victim does not want to immediately report the case. And then the meat of the bill is to implement a sexual assault tracking system. This would give a survivor the ability to track the status of evidence from the time of evidence collection all the way through to prosecution. It would be a very strong step forward in the state's overall response. And then the final section of the bill would be to increase coordination on the violent criminal apprehension program which are the most serious and heinous criminal offenses that take place. So with that, I'd be happy to answer any questions if there are any. You do not have any questions. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 255. The eyes are 174. The nasors zero this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 653. House Bill 653 by Representative Jasper of the 11th to be entitled an act to amend Code Section 2645. The fiscal to Georgia and to every lane the definitions relative to the Georgia pharmacy practice act. So as it revives the definition of pharmacy care this bill I'm referring to the committee on health and human services that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Jasper to present the bill. Thank you Mr. Speaker. Mr. Speaker and members I bring you the House Committee Substitute House Bill 653. Members all hands have been on deck helping with our communities deal with COVID-19. This bill will simply allow for our pharmacists to continue to offer testing for COVID-19 in serology that's antibody testing and the interpretation of the results for 12 months after the ending of the public health emergency is ended by the Secretary of Health and Human Services. Mr. Speaker that's all it does big glad to answer any questions. You have no questions. Thank you. You're the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 653. The eyes are 170. The nasa zero this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 231. House Bill 231, members, will begin to engage the 117th and others to be entitled to amend Article 7, Chapter 5, Title 16, and Article 1, Chapter 13, Title 19. The fish go to Georgia, annotated relating the stalking and granting of relief by Superior Courts. Ms. Bill, I refer to the committee on Judiciary Non-Scivilic Committee recommends that this bill do pass by committee substitute. Chair recognizes representative Gaines to present the bill. Thank you, Mr. Speaker. I'm proud to bring before you this afternoon House Bill 231, legislation and market significance step forward in our efforts against domestic violence in Georgia. Over the last several months we work with advocates and in particular I want to thank Chairman Mandy Ballinger and Representative B. Wynn for their work on this legislation. I also want to thank Chairman James Barchett and the Judiciary Non-Scivil Committee for their hard work in getting the language right in this bill and its unanimous passage out of committee. Georgia is one of only three states it does not extend civil protections to victims of dating violence. Our current law denies access to potentially life-saving relief for some of the most at-risk victims of relationship violence including those who are pregnant teens and young adults and dating relationships. Young women ages 16 to 24 experience the highest rates of abuse, a most triple the national average. This legislation would extend safety to victims who experience abuse by dating partner by creating dating protective orders under Georgia law. Our current law is insufficient for victims. Working with Chairman Barchett and the committee we fine tune the language creating a new section outside the family violence protective order specifically for dating violence. Temporary protective orders are tools for victim seeking safety from abuse and are also an effective mechanism for abuser accountability. This bill will ensure that those in dating relationships and potentially some of the most vulnerable in our state have access to this life-saving relief. States who are actively including dating partners and their protections under temporary protective orders have seen an 11% reduction on the total rate of intimate partner homicide. 47 other states already ensure victims of dating violence are covered in their laws and I'm proud that with this with this body support today will be one step closer to joining them. Mr. Speaker I'd be happy to answer any questions if there are any. You have a question if you care to yield. Be happy to. Chair recognizes representative Kenan to your left for a question. Thank you Mr. Speaker do you yield. I do. How would this bill affect those in the LGBTQ community? Well this legislation would impact any victim of dating violence either we fall under the language in the bill. No further questions. Thank you Mr. Speaker I yield the well and ask for this body's favorable consideration. Chair recognizes representative Wynn to speak to the bill. Thank you Mr. Speaker. I just want to take a moment today to thank representative gains and chair Ballinger for working on this issue as well as members of the judiciary committee and the many advocates who helped us bring this bill forward. And I think it is important just to talk about how this legislation will save the lives of Jordans. In the past year since the pandemic has began, Georgia has seen a 79% increase in domestic violence. Domestic violence is an issue that impacts all communities and it transcends age, race, gender, geography, political party and economic means. But what we do know is that it does disproportionately impact women and girls and that it is a cycle if not broken will become deadly. Georgia actually ranks number 10 in terms of women who are killed by men and the majority of these cases are connected to domestic violence. I was startled and alarmed to learn that 49% of victims who began their relationship with the person who eventually killed them were between the ages of 12 and 24. So with this temporary protective order in place, victims can seek immediate relief. They won't have to wait until additional incidents of violence or escalation before receiving protection. With this temporary protection order in place, the court can also order the abuser to seek counseling or to participate in educational programs offered by the state because we know that abusers do not simply stop abusing. So this is about intervention and breaking the cycle for both persons involved. And if we pass this, it will save the lives of Georgia. Thank you. I yield the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair, here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 231 will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 231. The eyes are 174. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 579. House Bill 579, my name is Evola, and the 82nd to be entitled back to amend chapter 75 of Title 36. The fish go to Georgia and they're relating to war on terrorism, local assistance, so it's to change the short title to the public safety and judicial facilities act. Ms. Bill, I refer to the committee on governmental affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Oliver to present the bill. Thank you, Mr. Speaker. House Bill 579 is a general bill that allows all counties to create an authority for the purpose of doing renovations or constructions of public safety or courts. Only DeCab County has used this, so it's really application of a referendum that was imposed by DeCab in 2007 is the only county that's had that burden. I think it's prevented other counties from being able to use this act. And I ask for your favoral consideration to remove the requirement of the referendum from the Public Safety and Judicial Facilities Act. Water authorities, housing authorities, hospital authorities don't have referendums. It was totally an anomaly in this case historically. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. The Chair. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 579. The eyes are 169. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 258. House Bill 258, Mr. Stainst, the 180th and others to be entitled to amend Chapter 6 of Title 16, the Bishop of Georgia annotated relating the sexual offenses so as to provide a response to state versus Williams decided February 10, 2020. This bill ember for the Committee of Judiciary Non-Sid will let committee recommends that this bill do pass by committee substitute. Chair recognizes representative Sains to present the bill. Thank you, Mr. Speaker. This bill is relatively simple. It is a response to state V Williams 2020 which had it to where a step-grandfather almost got a way with a sexual battery to his four year old step-granddaughter because the Supreme Court dictated that. In the cases of sexual battery and aggravated sexual battery, the defense to prosecution of an individual being a victim being under 16 must be codified to be utilized. So this fixes that by putting in statute that when a alleged victim is under the age of 16 and such actions are for a sexual nature that a consent of the victim cannot be used as a defense to prosecution. With that, I'll yield for questions if there are any. If you yield for questions. One question, Mr. Speaker. Chair recognizes representative McLaren up in the gap.\n\nAll right to your left. Thank you, Mr. Speaker. Will the gentleman yield? Yes. It's good to see your representative. Is it not true that this bill passed out of committee with bipartisan support because it balances the need to prevent proving consent in those cases with having a definition of a statute that ensures that parents and other caretakers and people dealing with small children innocently don't get swept up in the statute? Gentlemen, does what he speaks very well. It's a very balanced and measured approach. We take what? We take sexual batteries. A major element of that crime is the consent itself to take that away. There were some fears that would make it easier to charge. So this is a very balanced bill for those specific circumstances where that should clearly not be applicable. With that, Mr. Speaker, I'll yield the well. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? The chair here's done. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's done. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's done. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. They will be ye refugee. Now, they went. Okay. If we, with checks that will flash with a 4 a30 store and it permits. If the act the longer will die, have all members voted. If so, the clerk will lock the machines on the passage of House Bill 258, the eyes are 173. The nasor zero, this bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 479. House Bill 479, where the ribs are in the reach of 34th and others to be titled an act to amend title 17, the fish go to Georgia and itated relating to criminal procedure, so it provides certain arrest powers. This bill ever referred to the committee on judiciary, that committee recommends it to this bill do pass by committee substitute. Chair recognizes representative Reeves to present the bill. Thank you, Mr. Speaker, colleagues. It's worth repeating, I said this in committee, but having the opportunity to become involved with this legislation after the work that chairman of strays should have done to set it up was really like being a brave relief pitcher and being called in the game after Greg Maddox had pitched a perfect game. And it's on very privileged and I'm very thankful for the work that my friend Chairman Chuck Gaffstrace has brought us on this very important issue. And Mr. Speaker, I just want to talk a little bit about about history and about this room. I love coming in this room. It's an incredible privilege, it's an honor, it's a rare honor, not a lot of Georgians get the chance to do what we get to do. And it's crazy, it's crazy as this room is while we're in here doing our business. If you come in here early enough or if you stay late enough, you can be the only person in this room and you can sit here all by yourself. And it's a very quiet place and I love doing that and I've done that for the last seven years on multiple occasions. I love looking at the ceiling. The wood, I love the history of these desks. If you've never heard it, you should ask Chairman Matt dollar about these desks. He knows more about the history of these desks than maybe anything else he knows. So it's actually, it's, I love the way it smells in here, the wood. Keith Williams, the speaker's lawyer, he's got a picture in his office. In a non-COVID year, I sit over here in a first row in the corner and he's got a picture in his office from my desk, facing this way, of this room from the year 1895. And it looks almost the same as it does right now. About a year ago, I saw that picture and had him send it to me and the picture really kind of made me reflect. And what it made me reflect on was if these walls could talk, if these walls could talk, if the walls of the Capitol in Millageville from 1907 to 1967, and the other building in Atlanta from 1968 until 1889 when this building was erected, if those walls could talk, what would they say? There's been a lot of really great things, a lot of good things that have happened in this room, and we celebrate those things. There's also been some not-so-great things that have happened in this room. And one of the greatest opportunities that we have, that anybody that gets his chance and just this little sliver of history to come into this room and have access and to be able to voice a vote on an issue. One of the greatest opportunities, and frankly, one of the greatest obligations that we have, is to correct some of the wrong things that happened in this room. And I think that that's an opportunity that we have before us right now. You know, I don't take for granted one bit of this experience. If the Georgia General Assembly is a pie chart, then 2021 is just a little tiny piece of pie and that big pie that makes up the history of this state and everything that's been done legislating in Georgia. And so here we are. The way that it has worked out is that everybody in this room right now is a part of this 2021 session and we've got the opportunity to do something that's important. Mr. Speaker, I have thought a lot this legislative session about the concept of legacy. And I'm not going to talk much longer, but I've thought a lot about legacy. I wanted to, about eight years ago, in February, a little bit more than eight years ago, was when I decided that I was going to run to be a part of this body. When I was a high school junior at North Cobb High School, Miss Linda Morrison was my teacher and she inspired me and desired to do this. And that's something that I'd worked really hard for. Eight years ago decided to do that. And so when I decided that I was going to run for this position, I didn't even know my wife yet. I hadn't met her. I met her later that summer and our entire year of dating was campaigning. So I came in, I won and I came into this thing with all these ambitions and all of these thoughts about what it means to leave a legacy, leave a legacy in this room to leave a legacy in my community to try to do some good things in Georgia and really try to make Georgia a better place. That was my idea of what this concept of legacy meant. And I got to tell you all something. Something happened, as I said, I married my wife. My wife came with a five-year-old. My stepson Charlie is 12 now, but he was five years old. And so by the time I came into this room, I had a five-year-old stepson. And then my son Albert the hurricane came within my first year of being in this body. Albert was born. And I say this to say this is very important, is that something happened to me simultaneously, as I got to experience this in what I thought was going to be my important legacy. What I realized is that what the important legacy is is your family and your children. My boys, Albert and Charlie are my legacy. It's not what we do in here, but it's the people that love us and the people that we love. And those two boys is what my legacy is. And I learned that. And I've learned that every day for the last seven years. And I say all that to talk about a mod arbery. One of the things that I've had the opportunity to do in carrying this legislation is to spend some time on the telephone with Miss Wanda Cooper Jones. That's a mod's mother. And I've talked to her a few times, I've texted with her a bunch. She's gracious. She's so thankful for what we're doing. She handles herself with incredible dignity. Her son is gone in a senseless violence that the whole world had the opportunity to see. She has pain and she has hurt. But she is thankful for what we are doing here. But her ability, I talked about my legacy that I want to leave my boys. Her ability to leave that legacy in a mod and watch a mod's legacy was taken from her. And a mod's father Marcus Arbery has said he does not want his son's death to be in vain. And I'm going to tell you all something a mod's death is not in vain. Let's say it again, a mod's death is not in vain because we're going to bring change. We are bringing change. A mod in his life and his legacy is going to be that agent of change. And in this general assembly in 2021, every single one of us have the opportunity to take part in a mod's legacy. And we owe that to his mother. We owe that to his father and all of his family and friends in love with him. And we owe it to a mod. And so I'm asking everybody in this room, I want us all to rise to the occasion. And let's rewrite a law from history. But let's also rewrite future history in Georgia. Mr. Speaker, I will yield for any questions. You have some questions if you yield. I will. Chair recognizes the chairman, the Judiciary Committee Chairman, of Stration to your left. Thank you, Mr. Speaker, gentlemen, yield. I do. To the administration floor, Lear, isn't it true that all 50 states have some form of a citizen's arrest law on the books? And by passing this bill here today, and if it's ultimately enacted, Georgia would be the first state in the country to repeal the citizens arrest law. That's absolutely right. And it's incumbent on Georgia that we do that in light of what happened in our state in the last February. Isn't it true, Representative, that building on the great work that this state did passing the hate crimes law in 2020, we could send a message nationally that Georgia is too great to hate. Thanks to this legislation, the bipartisan effort and the leadership of Governor Kimp and bringing this issue this year. The gentleman knows what he speaks. I'll continue to yield, Mr. Speaker. Chair recognizes a representative canon to your left for a question. Thank you, Mr. Speaker. Do you yield? I do. Has there been consideration to naming this the Amon Aubrey Act since we all know it's very clear? That has not happened, but I have absolutely no reservations and concerns about, as this bill carries on to the other body of making that a part of this. And I think that that's actually a fantastic idea. I'll continue to yield, Mr. Speaker. Chair recognizes representative Dukes in room 341. With the gentleman yield. I do. First of all, I want to thank you for bringing this legislation. Is it not true that these laws will pass probably 100 years or so ago? 158 years ago. And it's not true that this is one of those attempts that we're driving for in this nation and in this state to write grievous wrongs that have been perpetuated against the Amon Aubrey's of the world. Not just Amon Aubrey. I researched this issue on my own and I know that it is a fact that there were decades of lynchings that took place in Georgia where this law was used as part of that justification. I want to thank the gentleman for bringing this bill. Thank you. Mr. Speaker, I'll continue to yield. You have no further questions. Thank you, Mr. Speaker. Let's get this done, y'all. We have a number of members who wish to be heard on the measure. Chair recognizes the dean of this house. Dean Smiley to speak to the bill. Mr. Speaker and ladies and gentlemen of the house. You know, last year we passed the hate crime bill. I thought about it and I said this was such a historic occasion and I'll know forget. I remember calling Rubzan to our Williams. I know he's going to speak and I was on my way to Brunswick and at the last minute I decided not to go then I went to bed. Then I woke up the next morning with Almond Arbery on my mind and I got up and during that time we were in the heat of COVID and I knew my colleague, Rubzan to Carolyn Hugley, I had talked to and she was going to join and I called her and I decided to drive to Brunswick and he sort of transitioned me in a way that when you're in a car and you're driving and you're alone and you're talking and you're thinking and I thought about what we were doing as a relates to the hate crime bill and doing that call like call maybe eight members of this house on the way and one arm was or your phrase, or the phrase and she was in the process of having Almond Arbery's mother that day in Wingsboro and I called the speaker. I told him about my conversation and we were working on the hate crime bill and our call represented Chuck Estration and I say you know we get this behind us. We ought to repeal citizens arrest and it's not my idea of others that have talked about that for years and so I went there and I visited and I met the family and in the heat of COVID I got back in my car and I drove back to Columbus and I made up my mind at that juncture that citizens arrest or to be the next thing we tackle and as a member of the conference committee on the hate crime bill there was not a meeting that we didn't talk about citizens arrest repeal and hate crime was a very very emotional issue for me and I literally broke down at our press conference after the passing of the bill. I was very emotional because George had moved a dark cloud from over his state and here we are fast forward now and I want to thank the Governor's floor leader and I want to thank him during the intro my talk to Representative Estration a couple of times and I said we ought to do something about citizens arrest. His lingered too long, too much has happened, too many people have died and now it's a time for us to move the cloud again on the citizens arrest and I promised Auburn's mother that the Lord willing we get back to Atlanta in 2021 that there's going to be a group that's going to come together to pass citizens arrest and I come today to ask you to vote yes on House Bill 479. I will say this that day in Brunswick was a turning point for me. Brunswick is a great city and I kind of felt the change in the air, they are and so I the bill itself a lot of people have worked on it and have worked out I think some of the issues that were intertwined in the legislation but I just come today with a heavy heart asking you to vote yes now is the time it's not now when now is the time now is the time for us to act. Mr. Speaker, ladies and gentlemen, the House I thank you for allowing me to come and to say a few words and to thank the gentleman again and all those that have worked on this legislation on House Bill 479. So again now is the time and with that Mr. Speaker I will yield the will. Chair recognizes representative Frazier to speak to the bill. Thank you Mr. Speaker. Mr. Speaker, Ms. Juan Nacupa and your family I know you are watching. This is a rose from you from my mother to a mother. Less than three weeks ago on February 23rd which was on a Tuesday we had a discussion about the procession I got in my car and I drove back to Augusta to be a part of a Mont Arbery's vigil that they were having at his gravesite. We gathered among hundreds of citizens at the gravesite of a Mont Arbery to both celebrate his short life of 25 years and to grieve his loss on this one year anniversary of the senseless and brutal murder that took his life. And while I stood in awe at the love and the support that was demonstrated during the vigil I was shaken to the core by the deep cry of his mother, Wonder Cooper Jones. Representative Reeves stated how calm she was when he talked to her how she was so self-preserved but on this day on the anniversary of his death Ms. Wonder Cooper gave a cry out that I will never ever forget. She repeated that was my baby. She repeated he was my baby and she said it about 15 times falling to the ground. That pain uttered those those words she said broke everybody down at that gravesite. It's the kind of pain that no mother should ever have to endure. It's the kind of pain that comes from losing one of your most treasured gifts, your child. Over the past year I have had the honor of working directly with Ms. Cooper and my aspiration and respect for her have grown tremendously. She has the strength of a titan. I tell you her strength and courage and her persistence have been a driving force and ensuring that her son's death receives the attention that it deserves and that his killers ultimately brought to justice. Her resilience and perseverance serve as a testament to depths of a mother's love for her child. I recently read an article about the deep fear that black mothers carried raising their children in America. Black mothers interviewed this story said that they realized that all mothers worry about their children. As mothers we want our children to have the best when they're happy we're happy when they're sad we are we feel their pain. As mothers we hope our children choose good friends we hope that they apply themselves in school and become successful and responsible citizens. We hope they stay away from drugs and alcohol and that they avoid unnecessary dangers. But the uniqueness of challenges for black mothers is that we have this extra layer of fear, this gripping reality of the dangers our children face because we know that while there are babies to someone else they might seem to be a threat. It's an anxiety that black mothers live with every day. Unfortunately passed along to our children because we want them to stay safe as possible. There is nothing more sobering than having that talk with your children. I have two adult daughters we've had the talk and I still talk to them although they are up in age. No I'm not referencing the talk about dating or talk about college plans on your career goals. I'm referring to the uncomfortable conversation that black mothers have with their children informing them that regardless of how amazing they are how incredibly brilliant they are or how kind and loving they may be they may also be feared. They may seem as a threat subsequently harmed because they are viewed that way and although it is not right and although it is not fair to them it is reality in which we live. It is no secret that a mob was failed. It is no secret that his life was cut short at the young age of 25 because someone saw him as a threat and thought they could take his life and hide behind a law and while we have been seen that progress over the past years with arrest and indictments of his shooters today we are presented with an opportunity to address an overhaul the outdated law that has been used to unfairly target black and brown men and women in the state of Georgia. We have an opportunity to ensure that this law originally pinned back in 19th century is no longer misused and abused by those with racially motivated ill intentions. We have an opportunity to honor a mob's legacy by shifting the narrative and making a declaration that the state of Georgia is committed to the jest and fair treatment of each and every one of its citizens. So let's give Ms. Wanda Cooper a degree of peace for a lifetime of sorrow that she will suffer. I ask you to support House Bill 479 and show the world who is watching right now that Georgia will not tolerate racial profiling. Thank you Mr. Speaker, I yield the will. Chair recognizes representative Al Williams to speak to the bill. Thank you Mr. Speaker. In a corner of this state is some of the most beautiful real estate in America. I am fortunate to have been born.\n\nin that corner on the coast of Georgia. It's one of the most beautiful areas in that beautiful area. It's found in a golden house, the beautiful, swimming waters of Glen County. It's always been just below the surface and there were problems. As a youngster in 1964, I remember marching with Reverend JC Hope in Brunswick, then just to get the right tea to hamburger, then I can remember giants, some of whom were my mentors, who worked to bring about racial justice and understanding. My predecessor, Reverend E.C. Tillman, spent his life doing that. Gentlemen, we all adhere this flow of session. Mac, spent his life coaching it, working in education as a board member of Seattle Incorporation. When I first came as an employee of the Lieutenant Governor's Elmer in 1975 to this beautiful dome, it was impossible to have a bill like this, come to the floor and be debated. 479 wasn't even in the making. As a matter of fact, we were at the point where the United States Supreme Court had to seat a duly elected representative. So while there's much room for growth, so much good has happened. In my first term, I represented the area that they lived in and where he was murdered. That was the first area I represented. When I came this morning in 2003, and it's unfortunate that I know one of the gentlemen that is incarcerated for his murder. He worked with one of my sons. He worked in Liberty County, though he lived in Brunswick. Well, the time has come. You see, no wrong ever reaches a point where it can't be made right. And this is the time. To be a shining example, at the coast of Georgia, it's not just one of the most beautiful places in the world that entertains some of the great figures of the world. And in my freshman year, I worked on a committee down there for the G8. What an experience. Leaders from all over the world. The coister, when the premier stops in all the world. But it's not good enough for state to be. The best state to do business in. For it cries out for that state. From Washington State to the tip of Miami. From the Alleghenies of New York to the flatlands of Texas. Folks should say, Georgia is one of the best places to live. Living. A board oboe would not be able to live. It's beautiful life and a beautiful course of Georgia. But as I said, some weeks ago, all things work together for good. And his death has created good. 479 is the good that comes out of his death. As sad as it is. And how it looks like there is no light. All of his death comes this day. The opportunity to say to America. That this is not the Georgia of old. This is not the Georgia. Where a slave ship stopped in the sound of a jack of iron came around to St. Simon. And Nebo, Ebo, warians from Africa, unloaded and revoked and ran away. And when they were almost caught, they drowned themselves in the river there in St. Simon's, rather than be slaves. And when they were on a dark, silent evening on those coasts, you can hear the wailing of the Ebo's souls. Where the new Georgia, they all met and created equal and women. And Aubrey, and God for your spirit. Thank you, and Mother, thank you as Father. For once again, all things have worked together for good. I urge you to vote for good for Georgia, by supporting House Bill 479. Mr. Speaker, you will. Chair recognizes Chairman Don Hogan to speak to the bill. Thank you, Mr. Speaker. House Bill 479. I'm the second son of the bill. This tragedy happened. Our community couldn't believe that it happened. Down in St.lla Shores, which is a great community in the south end of Dend County. Aubrey, a man, a job that rode every day. He lived across the road. He had on his jogging shoes, and his jogging outfit, and he was not doing anything wrong, but just jogging down the road, as far as I know. These three individuals loaded with a shotgun and a pistol in the back of the first truck, and the fellow taking the picture with his camera, a cell phone, and the second truck. The other two men have been charged with murder, which they should be, because that was a heinous crime that was committed against a young man, who was a citizen in my community. It's been very upsetting. Many sleepless nights were worried about the family. It happened in my community. My community is still very upset about it. We had individuals that demonstrated we didn't have any writing. We had the people coming in the support in the community. Sheriff Neil Jump was very effective, and making sure everybody got to demonstrate and do what they needed to do in the celebration of a Mont-Albrecht's life. Right after this happened, I got in touch with Representative Carl Giljard, and he and I talked about the citizens of the rest of the law. I'd like to thank Chairman Chuck Abstration for doing what he did on the bill, because he worked very hard on it, and then Chairman Rhee is for what he's done on it. I think this is the right thing to do. It's supported by the community in Glen County. We've had some fine people down there that live in the island and in Glen County. I've lived there 52 years, and it's one of the most wonderful places that you can have a family and that you can enjoy what we have in coastal Georgia. I just would appreciate you supporting this bill, and you're voting for it. It's the right thing to do. It's an old bill that's outdated. We have no need for it. The people that were trying to... I assume they were trying to rest a lot, but they were not policemen. They were individuals. And people who were just individuals, I don't think they understand the law, and they don't have what it takes to go out and try to arrest somebody as a citizen's arrest. I think it's the wrong thing to try to do. It's an outdated bill, and we don't need it. And I'd appreciate you voting for this legislation, because I think it's very meaningful to me. I'm still very upset about this situation, and it's something that we'll never get over. When you lose a child, that's the worst thing that I think can happen to a family. So please vote for this bill. I thank you very much, Mr. Speaker, and I yield the oil. I recognize this representative Bowdie to speak to the bill. Thank you, Mr. Speaker. I rise today in support of HB479. I rise today to make history with this noble chamber by the passage of HB479. The current citizens of rest Statue of Georgia needs to be repealed. Mr. Ramada-Bri, it's the case that brings us here today, debating HB479 on the floor of the Georgia House of Representatives. Mr. Monardi-Lieter, today we have the opportunity to repeal a law that was passed through in the Civil Rights Era. No Georgia citizen should be permitted and allowed to pursue, chase, and attempt to make a citizen's arrest like the series of events that led to the death of Amard Aubrey. On February 23rd, 2020, Amard Aubrey was just living his life. He was taking a run through a coastal residential neighborhood where his mother lived in Glenn County. I read that Amard Aubrey, who was a former standout football player in high school, liked to take runs. He liked to take the runs to clear his mind. Many of us in this noble chamber may sometimes just need to take a break. Step back and clear our minds at the alone day. Similar to the long day we're going to have today. You may want to take a morning workout to clear your mind. You may want to take an afternoon walk to clear your mind. You may want to just read a book at the alone day of work to clear your mind. But Amard Aubrey liked to run to clear his mind. Now, on February 23rd, 2020, Amard Aubrey's peaceful run was disrupted. And Mr. Amard Aubrey ultimately ended that run when his life was lost by the barrel of a shotgun. Those two shotgun blasts to the chest of Amard Aubrey was the end result of two men who jumped in their trucks to take the law in their own hands. This, after the father and this father's son, Duwo, called 911, not once Dean, but twice to report that they thought a crime was being committed by Mr. Aubrey in their neighborhood. The man told the 911 operator that it was a black man in shorts in a white t-shirt running through my neighborhood. Mr. Amard Aubrey had committed no crimes as the man made the 911 call. Now, it was later discovered when they directly spoke to the property owner that his home, sorry, was not the subject of any burglaries. No property was ever stolen from his property. No property was damaged on his property. So why? Why was Amard Aubrey shot and killed on February 23rd, 2020? It was because two men that chased Mr. Aubrey felt empowered by the citizens of the rest that you here in the state of Georgia. And what went through Amard Aubrey's mind at the being chased for four minutes, but not one, but two trucks, one truck in front of him, blocking his pathway, and one truck behind him, blocking his retreat. All of them being in those trucks were home. Amard Aubrey was trapped, where could he go? Ultimately, Amard Aubrey was shot twice and stumbled to the ground. Amard Aubrey was 25 years old. Yesterday I was thinking about what would I say when I came to the well? How could I describe his last moments on Earth in preparation to support this bill, HB 479? And then I thought about my college days at Vodolster State University in the late 90s. I enjoyed my time at Vodolster. I loved living in South Georgia. Other than family trips out of state, that was my first time being outside the metro area. I met friends and classmates from Thomasville, Nashville, Wakecross, Makin, Adel, Reins, and Maltre, Georgia, just the name of few. During my summer semester of my junior year at VSU, I wanted to take up my life as a runner to stay in shape, to enjoy the beautiful residential neighborhood outside of my apartment complex. I did that to clear my mind at the long days in class. Then it hit me. I was a black man running with a white t-shirt and a whiteerecht fromise, super whiteness, college shortage, Baltimore's, repeat until neighborhood in my 20s!? And at that moment I realized I could have been a Mah отд Archway before I峌decek, better to stay in shape. Again, my وأ previous question being ordered. The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 479 will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members in the gallery made it back and voted? Have all members now voted? If so, the clerk will lock the machine. On the passage of House Bill 479, the eyes are 173. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes the chairman of the House Rules Committee for an announcement. The chair is advised that there is dinner downstairs. We're going to break for dinner until 7 p.m. 7 p.m.",
  "updated_at": "2026-02-13T10:43:22.169444+00:00"
}