{
  "video_id": "PXevDzhFYCs",
  "url": "https://www.youtube.com/watch?v=PXevDzhFYCs",
  "title": "Senator Harrell | GCDD Press Conference | 02/07/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 33,
  "summary": "Here is a structured summary of the Georgia Senator Harrell | GCDD Press Conference | 02/07/2024 session:\n\n**Overview:** This press conference focused on important legislative priorities for supporting Georgians with intellectual and developmental disabilities (IDD). Key topics included passing a bill to create an IDD Innovation Commission, fully funding a service provider rate study, and ending the waitlist for Medicaid home and community-based services waivers.\n\n**Key Actions:**\n**SB 198:** Establishes an IDD Innovation Commission to develop solutions for long-term challenges faced by Georgians with IDD.\n\n**Bills Introduced (First Reading):** None mentioned.\n\n**Notable Moments:**\n- Senator Harrell provided historical context on the 25-year Supreme Court ruling and 16-year settlement agreement to support IDD community living.\n- Advocates, including self-advocate Dorothy Harris and provider Diane Willis, spoke passionately about the need for the legislation and increased funding.\n\n**Votes:** SB 198 passed the Senate Health and Human Services Committee unanimously.\n\n**Attendance:** No legislators were specifically noted as being present.\n\n**Adjournment:** No formal adjournment noted, this was a press conference.",
  "transcript": "Good morning everyone and welcome to Wages and Waivers Day. It's always great to see you\nhere at the Capitol. It's so important that you make the effort to get here and I know\nit's hard to get here. Here's why it's important to be here today. It's been nearly 25 years\nsince the Supreme Court homestead decision,\nwhich said that people with disabilities\nhave a right to state funded services\nto live and thrive in their communities,\nrather than being forced to live in institutions.\nAnd it's been nearly 16 years since our state entered\ninto a settlement agreement with a Department of Justice\nand committed to giving Georgians with intellectual and developmental disabilities the support they need to live in their own homes and lead productive lives.\nSince then, it's been a long, slow road and truly to truly give this community what it needs to thrive.\nI first became involved in this issue when I served in the house,\nfighting to end the waiting list for Medicaid waivers,\nand when I came back to the Senate 14 years later,\nthe Medicaid home and community-based services waiting list\nwas still there and was longer.\nI always tell my constituents that when they want something\ndone in this building, you've got to be loud.\nWe've made some progress in Georgia with IDD issues in recent years because this community\nhas shown up and been loud and because you've been loud, we increased funding for waivers\nfrom approximately 100 per year to 500.\nWe passed Senate Bill 610 to make sure Georgia did reimbursement rate studies every four\nyears so that wages for our service providers kept pace with the markets.\nSenator John Albers and I co-sponsored a Senate study committee on Georgians with intellectual\nand developmental disabilities and we heard from hundreds of advocates, parents, caregivers,\nexperts and service providers all over Georgia about what we need for our\nstates. Thanks to the study committee, we now have a road map to finally deliver\non the promise that Georgia made 16 years ago to build on a comprehensive\nnetwork of community supports. We know what to do.\nSo we all have to get the work done.\nIt's a simple, three-step process.\nOne, we need to pass Senate Bill 198,\na Georgians with intellectual and developmental disabilities,\nInnovation Commission.\nYes.\nYes.\nYes.\nYes.\nYes.\nThis is modeled on the successful Behavioral Health Commission,\nmade up of experts and advocates that will roll out their sleeves and work on updated\nsolutions to the long-term challenges of Georgians with IDD and the challenges they face.\nThey'll tackle issues like supportive employment, housing, manage care, and more.\nThe commission will help more people with IDD gain independence and help them contribute\nto their communities.\nSenate Bill 198 passed the Senate Health and Human Services Committee last week.\nNow we need to get it to the Senate floor and through the House.\nNumber two, we must fully fund the Service Provider Rate Study\nin the FY2425 budget.\nWe have been losing ground with our talented case givers.\nWe're losing them to other paying jobs, better paying jobs\nin the marketplace.\nSo even if we wanted to end the Medicaid waiting list today,\nwe wouldn't be able to keep up with the demand.\nD.B.H. D.D., Commissioner Tenor-Capt, Kevin Tanner estimates that this rate study could\nincrease our provider rates by as much as 40%.\nThese service providers give so much of themselves.\nWe need to take care of our caregivers.\nYay!\nYay!\nYay!\nYay!\nYay!\nYay!\nYay!\nFinally, number three.\nWe need to end the waiting list for now in comp waivers once and for all.\nThat is now within sites.\nThanks to the work of Commissioner Tanner, the Department of Behavioral Health and Developmental\nDisabilities and the support of my colleagues, this is now a very real reality.\nThis is a work that we still have left to do, and this is why we need to keep showing\nup and why we have to be loud.\nDo we have any legislators here this morning?\nI don't see any.\nOkay.\nI now want to introduce members of this community who are going to speak about why getting\nthis work done is so important. So first, we have Dorothy Harris.\nHello. My name is Dorothy Harris. I'm the official torch. I'm a state and\nIt's aerial, self-advocate with the United for Change.\nWe are a grassroots network of self-advocates or calls the state.\nWe support people with international development and disability.\nI am passionate about self-advocacy and have been a part of people first of Fitzgerald\nchapter for over 20 years and a member of the Georgia Council of Development\nto Disability. Today, I would like to talk about how important it's in the bill\n198 for South advocate. It's important because there has to be a group of\nother students who learn and listen and better understand what we need so that we\ncould grow as a contribute citizen in our community. A commission will give us a\nplace and a government official to discuss our hopes and dreams and issues like\ntransportation, marriage penalty, wear employment affordable housing so we\ndon't have to live with four people if we don't want to. We need to be at the table because\nwe are registered voters and we vote in our voices count. It's also important that the\ngovernor provides the funding that is needed for our direct support professional or DSPs.\nDSP is the person that's been the most time with us\ndoing our daily activities and support our teams.\nWe need the DSP to make a little bit of wage\njust like anyone that worked at McDonald's in Burger King.\nWe have relationship with our DSP and we trust them and listen and know that our label\nor IDDD is do not make us in the finals.\nThey listen, we all have gifts just like you.\nThe self-advocation for the United from Change\nare guaranteed to know their status better.\nSo we can be seen that's our responsibility as advocates.\nWe will continue and advocate and rise up and speak out.\nThank you all.\nThank you, Dorothy. Well said.\nNext, we have Diane Willis, founder of the Service Provider's Association for Developmental Disabilities\nwho has been a tremendous partner in this work.\nThank you.\nThank you.\nWe all have a little bit of time, right?\nGood morning, everybody, and thank you for the opportunity to share with you,\nkind of reinforce what our Senators Harold mentioned to you,\nwhich is we really must pass Senate Bill 198.\nWe operate in an antiquated system and a highly complex,\nsomewhat inefficient system.\nIt is very challenging for families and individuals to navigate,\nand we surely can do better.\nSo, to that end, we need passage of SB 198 in order to assure we move IDD services into\nthe 21st century.\nThe next thing I want to point out is we must, we must pass the rate models and the funding.\nWe are super grateful to the governor for taking the bold step and putting it in his budget,\nwhich since I'm an old dog and been here forever, I can tell you has never, ever happened before.\nSo this is a milestone step and a critical one in order for us to provide supports and\nhigher caregivers, direct support professionals, to do the important work and\nsupport individuals. This is the rates where the first time there's been a\ncomprehensive study of the funding of this system since, believe it or not,\n1990. We can do better. So we must pass the budget. And finally I want to talk\nabout the waiting list. Again, as Senator Harrell mentioned, this has gone on\nentirely too long. Individuals are waiting for supports and services that are\nso vital to avert crisis to support people in a way that they should be supported in their\nlocal communities with their families. It occurred to me last night when I was preparing\nto be here that telling a family to wait for IDD support services to wait for a waiver\nis like telling a hungry family to wait for food stamps.\nThis is sustenance.\nThese services keep families together and avert crisis,\nand we have to stop making people wait.\nThere's no reason to do this.\nSo, all that said, I appreciate the opportunity\nto share a provider's point of view, and thank you,\nand let's get this done.\nThank you Diane, everybody on those steps. I know it's hard to stand there. Keep it up.\nI've been on those steps a number of times.\nThank you. Next up we have a Kaiser, a parent advocate from Johns Creek.\nGood morning. My name is Tais Kaiser. I am a mom from John's Creek and I have raised\nthree beautiful sons. My oldest son Isaiah is 22 and has autism. Intellectual disability\nand he struggles with a mental illness.\nI am here on behalf of him and for unlock Georgia,\na broad-based coalition whose mission is to expand\nand enhance home and community-based services\nto fully support Georgians with intellectual disabilities.\nMy son, Isaiah, has many daily struggles.\nHe's challenged what daily living skills.\nHe needs support to dress himself appropriately.\nHe doesn't grasp the concept of time, money.\nHis reading level is at a kindergarten level.\nIsaiah needs help with the simplest things, like pouring milk.\nHe needs long-term support for the rest of his life.\nI am one of the parents that is here advocating\nto get my child on the now-encompassed.\nI applied four times and I was denied four times.\nThe last resort was to sue the Department of Behavioral Health.\nAfter spending $60,000 in expenses, I won.\nWoo!\nWoo!\nAfter years of fighting, Isaiah was finally deemed eligible for the now-income waiver services.\nIt was emotionally, financially draining for me and my family, and that was just to\nget my son a spot on the list.\nTechnically, we do not have the waiver.\nFor families in my situation, this is a fight that they can't afford.\nFamilies with autistic children are reaching out for help.\nThey need and deserve only to be met with a system that is working against them.\nI will never, ever stop fighting for this community.\nToday I'm here to support the three key advocacy initiatives for the season.\nwhich is the 2400 spots for the now in comp waivers we want a reduction at\nleast a reduction on this list eliminating the current list has 7,000 people\nwaiting my son being one of those individuals higher wages for direct\nsupporting professionals advocate supporting the addition which it comes to be\nabout 79 million from the Department of Behavior Health's budget for the 2025 fiscal year\nto implement, that was implemented on the IDD rate study services.\nThird, the passage of the Senate bill 198 that was established an IDD commission establishing\nwould create a forum for comprehensive discussions aimed at better supporting individuals with\nITD, critical issues, including Medicaid, waivers,\nemployment, opportunities, housing, accessible health care,\nit's in need of attention.\nBy fostering a dialogue in collaborating,\nthe commission wouldn't hence an understanding\nof the unique supports and need required\nfor individuals to thrive in their communities.\nI want to improve the current system,\nand I'm here to help.\nThank you for the opportunity to speak today.\nWe have a legislator who has come and I'd like him to say a few words representative\nLong Tran.\nThank you Senator Herald.\nGood morning.\nMy name is Long Tran.\nState Representative of House District 80 and it's an honor to be here this morning.\nAs we continue to talk about how great the state of Georgia is being the number one state\nto do business and trying to become the number one state to live, we have to become the\nbest state, the leading state in which we have no waiting list for our family struggling\nwith IDD.\nThere's no reason why we can't achieve that while being the number one state to do business\nand we have to pass Senate Bill 198.\nAnd so thank you for being here this morning,\ncontinue to advocate for your families.\nThank you.\nThank you.\nThank you.\nThank you, Representative Tran.\nAnd to those of you on the steps,\nwe'll take a few questions and you can move, OK?\nWe would like to take any questions.\nAnd if my experts can come up and join me\nso that the person who has the expertise\nthe issue can respond. Questions? Okay, I guess we made, oh, okay.\nOkay, the question is that the Commissioner of DBHDD has come up with a plan for serving\n900 people getting them off the waiting list each year.\nThe commissioner has, I'll let other people address this too, but the commissioner has been\nvery friendly to all of the recommendations that were made for the study committee and\nhas, in fact, been working on a number of those items even without a commission.\nAnd one of the things he has worked so hard on is improving processes within the department.\nSo I think that is very, 900 is very doable.\nI personally think we could do more than that.\nOh, thank you so much.\nHey, thank you for the question.\nI'm Darcy Robb with the Georgia Council\non Developmental Disabilities.\nI agree.\nWe really appreciate our partnership\nwith Commissioner Tanner and his team.\nAnd I am confident we are moving the system\nin the right direction.\nWe're gonna continue to move it.\nBut frankly, GCDD stands 900 a year.\nwe need to do more, the wait list has hovered between 6,000 and 8,000 for over a decade.\nGCDD put together a chart that shows both the new waivers and the attrition and we've\nbeen treading water on the waiting list for at least 12 years now.\nThe other piece of the waiting list that I need to point out, two pieces, number one, Georgia\nhas a very high bar for qualifying for a now or comp waiver.\nIn many other states, including our neighboring state Tennessee, more folks are eligible for\nwaiver support than they are here in Georgia.\nSo Georgia has a high bar.\nThe other thing I think it's important to note, not everyone eligible for a waiver is\non the waiting list.\nAnd one of the ways we know that is that when people are abandoned in emergency rooms,\nwhich is happening to individuals with developmental disabilities, it is a crisis and that's something\nCommissioner Tanner and his team have been working on, but when those folks are\nabandoned in emergency rooms they fall into three groups. One group is people who\nhave a waiver and have had a crisis. One group is people on the waiting list, the\nthird group is people not even known to the state of Georgia. So we want to\nend the waiting list full stop.\nIn Senate Bill 198, the commission is, it's planned for the commission to meet for five years.\nI think it would be reasonable to make a goal of ending the waiting list in that five years.\nYes.\nOkay, the question is, what are the wages for our Dex service providers?\nWhat are they making now?\nWhat do they need to make?\nAnd how much do we need to bulk up the workforce, and I'm going to have Diane Willis answer that\nquestion.\nThanks for the question, because it's super important.\nThe most recent data that we have is that Georgia exceeds the national average in the turnover\nrate of direct support professionals, as we call them DSPs.\nOur turnover rate statewide average is about 43%.\nWe don't have the most current data that is 22 data, that we should have the new information\nvery shortly, actually.\nI think that the information is that the average range is around $13.\nThe waivers without this rate model fund wages at $10.63.\nSo that's the reimbursement, that's what's built into the funding.\nThe new weights will bring that wage to $16.70 and again we are so\nvery grateful for that positive change. However, I will tell you, that's like a\ndown payment. Wages need to be at $18 to $20 an hour in order for us in order\nfor us to recruit and retain high caliber staff in these positions.\norganizations continually churn people for that first year or so because it's\nsuch a challenging and difficult job but so very important and valued. We can do\nbetter. So rate models passing that will be one part and then we're due thanks\nto Senator Harrell to have another rate study in two years and we need to\naddress wages again we can't I don't want to hear that well we already gave you\nmoney this is the first money really since 1990 so there you have it other\nother questions?\nYes.\nOkay.\nOkay, yeah, because I'd like to look at this.\nSo the observation was that the wait time\non the waiting list is like four years\nand what are we gonna do to reduce that wait time?\nThat's why we're having this advocacy today\nbecause it's going to take both funding more waivers\neach year and increasing wages\nso that we can get rid of both waiting lists,\none for waivers and the ones for services. So that's why we're here today and\nthat's why we're developing this commission to keep track of this issue to\nmake sure we're moving forward on those goals. That will reduce the weight.\nAny other questions? Yes?\nOkay, so the observation is that we have a lot of doctors here today.\nAnd so the question is, what can you all do to help us serve people with developmental\ndisabilities in their communities would anyone like to speak thank you thank\nyou for your support yes\nwould you like to speak don't know about the way this but we are committed to\nmental health we are working with Kevin Tanner you'll hear a little bit more\nabout this, but we are very committed to reaching out to our patients in Georgia, addressing\nthese mental health issues, starting with our young all the way up, you'll see more\nand more of us activity out there.\nSo thank you.\nOkay, so the question is how do we address the workforce needs for the direct service\nproviders in the rural areas of the state. Again, it's a wage issue. It's simply a wage\nissue. If we had adequate wages, the recruitment of people, even in rural areas, would be far\nmuch increased. I don't think even when you have a thinner population, that if you have\na wage that's commensurate with the work and the value of the work. I don't think that\nrecruitment is as much of a challenge. Make sense?\nAlso one of the recommendations from the study committee was to take steps to professionalize\ndirect service workers careers through maybe some sort of certification process.\nI should have mentioned as well to give some credit to the Department of Behavioral\nHealth because they are piloting a credentialing pathways so that direct support professionals\ncan receive a credential at a one, two, three level, which would then add income.\nSo you'd start at a base rate, and then if you got credentialed, you'd go up in a credential\ntwo, three, and so forth.\nThey are using ARPA funds to fund three projects throughout the state.\nOne of them is through UGA.\nOne is with the Department of Labor, and one is with United Cerebral Policy.\nSo that also demonstrates their commitment to this wage issue.\nThey want to build a credentialing process into the rates.\nSo that is huge progress and very meaningful.\nOkay, I had a question from behind me about the commission and the question was, who is\ngoing to be appointed by the commission, what type of people, and by whom.\nSenate Bill 198 spells out exactly the kind of experts and consumers who need to be brought\ninto the commission.\nThe appointments will be made by the Lieutenant Governor, the Governor, and the Speaker of\nthe House.\nAnd specifically, it was asked, how do we ensure that people of color are appointed to\nthat commission and I would say we're going to have to be allowed again and as we as a community\nthink about who needs to be on that commission we're going to need to think about diversity of\nexperience being represented and make recommendations to those three elected officials to make sure they\nare in the appointments are inclusive. So again it's part of being loud. Any other questions?\nThe question is, do I have a sense for when the bill will get a vote in the chamber?\nI will say it passed unanimously out of health and human services.\nThis is a very good sign.\nI will be going to rules today to ask the rules committee to move on the bill and bring\nit to the house floor so I'm hopeful that might happen before crossover day.\nelse. I see another legislator here. Representative Viola Davis would you like to say hello? Okay let's just\nrecognize that she is here supporting us. And I see another representative would you like to come\nup and say a word? Hello everyone I'm Representative Teddy Reese from Columbus Georgia and I have some of my\nconstituents here today? This is a worthy cause I just implore you to continue\nto fight, continue to stay in the fight, stay strong, and this is where it gets\ndone. You have to show up. If you're not here being an advocate for yourself and\nI'm sure Rep Davis would agree with this, then your issues will not be heard. So\nthis is a very important step we're glad to have you here today. Talk to as\nmany leaders as you possibly can and make sure they understand what's\nwhat's important and what you're passionate about.\nThank you so much.\nThank you, Representative Reese.\nI know these people on the steps are getting tired of standing.\nAny other questions?\nOkay, thank you all for coming.\nAnd a special thanks to the Georgia Council on developmental disabilities\nfor their partnership and for organizing the wages and waivers advocacy day.\nThank you everyone and go be loud.\n",
  "updated_at": "2026-02-12T19:34:34.618858+00:00"
}