{
  "video_id": "Q7TAHThNnEk",
  "url": "https://youtu.be/Q7TAHThNnEk?t=2409",
  "title": "Georgia House - Day 35 (2026-03-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-25",
  "duration_minutes": 208,
  "summary": "Here is a summary of the key points from the Georgia House session transcript for 2026-03-25:\n\n**Overview:** This session featured several notable introductions, prayers, and procedural matters, but did not appear to include any significant legislative actions.\n\n**Key Actions:** None.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:** \n- The session opened with a scripture reading and prayer led by Father Theodore Ermer, a Greek Orthodox priest. \n- Father Ermer's prayer focused on the themes of trust vs. doubt, and the importance of dialogue and seeing the humanity in one another, especially in the context of government.\n- He also noted that March 25th is a dual holiday in Greece commemorating the Annunciation and Greek independence.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum was present, as all members were instructed to report to the chamber.\n\n**Adjournment:** The transcript does not explicitly state when the session adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you all members will please report to the house chamber the house chamber take up position and be ready to work we are going to have the morning roll call all members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines you you you you All members voted, all members vote. loaded. If so, the clerk will lock the machines on the doorkeepers will please close the doors and keep them closed. Well, good morning. Welcome to Friday. It's also day 35. Getting down into the short roads now. We will begin our day with scripture reading in prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 138th House District Chairman Mike Chokus. Chairman Chokus. Thank you, Mr. Speaker. Today it's my pleasure to have my pastor, my priest, Father Theodore Ermer here. He's from, he's a native of Pittsburgh. He lived in Colorado for a time before he moved to Georgia to continue his undergraduate studies in meteorology and history education, which he completed at Kennesaw State College. Go. He's a 2015 graduate of the Holy Cross Greek Orthodox School of Theology in Brookline, Massachusetts and was ordained to the Holy Priesthood in March of 2015. He served as assistant pastor and priest at Holy Trinity Greek Orthodox Cathedral in Charlotte and in June of 18 he was assigned by the Metropolitan of Atlanta to serve as the pastor and priest of Holy Cross Greek Orthodox Church in Macon, where I'm a member. Father Theodore enjoys Dutch culture, soccer, studying languages and traveling. He is accompanied by his beautiful wife, Stacey. They've been married since January of 2010 and they are blessed with two sons, three and a half year old, Joachim and 18 month old, Basil. And for, you pilots out there, you may have talked with Father Theodore while he was at Kennesaw when you call Debbie X Brief for your weather. And one of the other things I'm going to add is that Father Theodore thinks of me of his special member of the congregation because I'm his job security. Thank you very much. Father Theodore. Thank you. Good morning. First and foremost, I must thank the speaker of this assembly, Mr. Rolsten and Representative Mr. Chokis for the great honor of having been once again invited here as the chaplain of the day. And as a pastor and priest of the Greek Orthodox Church, this is a very, very special day to address you all. Today, March 25th is a dual holiday in Greece for Greek Americans, for Orthodox Christians, really all Christians because ecclesiastically, today is the commemoration of the annunciation, the day where the archangel Gabriel announced to the Virgin Mary that she would give birth to the Christ. If you do the quick math, it's actually somehow nine months until Christmas already. Can't believe that. As for the other of the dual holidays, today is also the 200-in-first anniversary of Greek independence from the Ottoman Empire. I'll see you a lot of blue today, including Representative Chokis and the speaker as we're blue for us today too as well. So thank you for that. While it's an honor to be with you on this auspicious day, I also have another honor that it's going to be taking place this coming week, which is going to shape a little bit of what I'm sharing with you today. Next weekend, I'm going to be facilitating a Lenten retreat for middle and high school students from all around the Greek Orthodox metropolis of Atlanta. And the theme of this retreat is going to be focused on the concept of doubt, a most important theme for our youth. Indeed, this is a theme that's very important in the realm of religion. And this theme of doubt is also very applicable to our society as well. That is something that feels quite real to us these days, with the unrest and warfare in the world internationally, with the unease in society through the midst of the pandemic, and what sometimes feels like a general unease about society and the future for a whole host of reasons, it's really easy to fall into the snare of doubt. Too often doubt can feel like it overshadows the opposite of that. Trust. As I mentioned earlier, this is a dual celebration today on March 25th. The battle of doubt versus trust is very relevant to both of these celebrations. The doubt of a young Jewish girl who encounters an angel speaking to her that she'll give birth to the Messiah. The doubt of a subjected Greek people under the yoke of the Ottoman for four Ottomans for 400 years. In both cases, doubt could have prevailed. Mary could have said to the angel, no, this is preposterous. The young Greek fighters, instead of saying, Zito al-As long live Greece, they could have said, going home thinking, we'll never have a chance and given up. Instead, they trusted in God, they trusted in what they believed, and they trusted in the ones closest to them. Trust is an essential theme for the functioning of our American society. Think about it, we trust that when we go to the ATM, we can withdraw money from the bank. We have something there that got willing, which we put our trust in that. We trust that our legal system will acquit those innocent and hold accountable those guilty. And we should especially trust our fellow citizens, with whom we associate with at our places of work, day to day as we work towards a common goal. One of the most important prerequisites of trust is that of dialogue. A recent Orthodox Christian monastic pointed out the following. When we talk to our fellow men and women, they tell us about their troubles. We will listen to them carefully, we'll listen to them carefully if we have love for them. We will have compassion for their suffering and pain for we or God's creatures, we are a manifestation of the love of God. I believe that these words speak an eternal truth. If we truly dialogue with one another, if we truly listen to our brother and sister, we acknowledge them as God's creation and we humanize them. No longer are they simply a political position, someone who we might have put in so-and-so, so-called box, or my opposition, but a human being whom I have the potential, the potential to trust and to love. In a setting like this, I am certain that trust is an absolute necessity for the strong functioning of government, but that trust doesn't start in a vacuum, it starts with dialogue with another human being created in God's image and likeness. That person sitting next to you was created good, was created very good, in fact, and it's a beautiful challenge that you all have, that we all have, to dialogue through the differences that arise in governmental context and to facilitate that trust in one another and our governmental institutions in our beautiful American democracy. I ask that you pray for our youth that I encounter this next weekend that they may become people of love and of trust, and I pray that all of us grow in that love and trust of one another and most importantly, that love and trust of our God. I would ask that we join together in prayer at this time. Let us bow our heads to the Lord, Lord I'm mercy. Eternal, God and Father, on this day we celebrate and honor the trust of the Virgin Mary and the trust of a subjected Greek people. Help us to trust in you and see your image in each and every one of us and to trust in our institutions, our society, and in our American land. Bless those gathered here who give of themselves to serve our state and continue to guide them with your wisdom from above. To you, O Lord, belong all the glory, honor, and worship to the Father and to the Son and to the Holy Spirit, now and forever and to the ages of ages. Amen. I pledge allegiance to the flag of the United States of America and to the republic for which change, the nation, the God, the indivisible, with liberty and justice for all. Thank you. You members may greet the chaplain in the south any room. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, this question is for the majority leader and that ask him, do you know how weird it is being the same age as old people? And this came from Chairman Corbett. If you offended Chairman Hogan in some way, Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. The chair here is none and the resolution is adopted. The clerk will read the caption to a group of privileged resolutions. The chair here is none and the resolution is adopted. The clerk here is none and the resolution is adopted. Is there any objection to adopting the privileged resolutions that chair here is none and the resolutions are adopted? First reading of bills and resolutions, the clerk will read. Public safety and homeland security. Senate Bill 628, Senator Albers, 56, beach to the 21st of Building, Todd and Active, Man the NAC, incorporating the City of Milton, Fulton, and... The Intergovernmental Coordination. Senate Bill 629, by Senator Albers, 56, and beach to the 21st of Building, Todd and Active, Man the NAC, incorporating the City of Milton, Fulton, and... The Intergovernmental Coordination. Senate Bill 630, by Senator Albers, 56, and beach to the 21st of Building, Todd and Active, Man the NAC, incorporating the City of Milton, Fulton, and... The Intergovernmental Coordination. Senate Bill 631, by Senator Cowsick, 46, and the end of the 47th of Building, Todd and Active, Man the NAC, to grant the Resonance and Clark County and Clark County School District. The Intergovernmental Coordination. That completes first reading. Second reading of bills and resolutions, the Clark will read. House Bill 1587, by Representative Sains of the 180th, and Corbiter of the 174th, the Bill to amend and act to create the Camden County Public Service Authority. House Bill 1588, by Representative Thomas of the 21st, the Bill to amend and act to create a new charter for the City of Holly Springs. House Bill 1589, by Representative Thomas of the 21st, the Bill to amend and act to create a new charter for the City of Holly Springs. House Bill 1590, by Representative Sains of the 180th, and Corbiter of the 174th, the Bill to repeal and act to creating the Camden County Space Port Authority. House Bill 1591, by Representative Stevens of the 164th, catcher of the 150th, night of the 130th, the Bill relating to definitions relating to... ...record here, influenced and corrupt organizations. House Bill 1592, by Representative Lodge of the 167th, the Bill to create the Long County Building and Public Facilities Authority. House Bill 1593, by Representative Crow of the 110th, and Holmes of the 129th, the Bill to amend and act to provide a new charter for the City of Jackson. House Bill 1594, by Representative Mallow of the 163rd, Gellier to the 160th, Jackson of the 165th, Hitchens of the 161st, the Bill to amend and act, governing the school system of the City of Savannah and Chinom County. House Bill 1595, by Representative Bonner of the 172nd, Matthew Echiff of the 173rd, raise more of the 63rd, Sigurd to be bill to amend and act to create the state court of Fayette County. House Bill 1596, by Representative Bonner of the 172nd, Matthew eckiff of the 173rd, by Representative Bonner of the 173rd, Sigurd to be bill to amend and act to create the state court of Fayette County. House Bill 1597 by reps and a challenger of the 23rd Cantal of the 22nd. By order of the 20th Thomas of the 21st Carson of the 46th, a bill to provide a new charter for the city of Canton. House Bill 1598 by reps and a burns of 159th, the bill to provide a new charter for the city of Guitan. House Bill House Resolution 1050 by reps and a Smith of the Seventh England of the 16th Richard of the 97th Park of the 150th Green of the 150th. First, a resolution recognizing and memorating the outstanding advancements in water conservation that have been made by Atlantium Metro Region in all Georgians, urging continued addition.\n\nThis is for water conservation, three second readers. Reports are standing committees, the clerk will read. Professor Dubin, the 29th District Chairman of Community and Education, submit as a following report. We'll speak to your committee on education, senate and consideration. Following bills and resolutions to the House and Senate. Destruct committee report, same back to the House. The following recommendation, senate bill 588, to pass by committee substitute. Senate bill 575, to pass. House resolution 881, to pass by committee substitute, respectfully submitted. Representative Dubin, the 29th District Chairman. The Senate, Darlin Taylor, on 73rd District Chairman of the Committee on Governmental Affairs, submit as the following report. We'll speak to your committee on Governmental Affairs and so on, consideration. The following bills and the senate, instruct immediate report, same back to the House. The following recommendations, senate bill 152, to pass. Senate bill 534, to pass by committee substitute. Senate bill 562, to pass. Respectfully submitted. Representative Darlin Taylor, on 73rd District Chairman. Representative Steven Sinks, on the 180th District Vice Chairman of the Committee on Governmental Affairs, submit as the following report. We'll speak to your committee on Governmental Affairs. Senator, on the consideration. Following bills and resolutions to the House and senate. The instruct immediate report, same back to the House. The following recommendations, House resolution 1042, to pass by committee substitute. Senate bill 337, to pass by committee substitute. Respectfully submitted. Representative Steven Sinks, on the 180th District Vice Chairman. Representative Sharon Cooper, the 43rd District Chairman of the Committee on Health and Human Services, submit as the following report. Senator Speaker, on the committee on Health and Human Services, as that, on the consideration. Following bills and resolutions to the House and the senate. The instruct immediate report, same back to the House. The following recommendations, senate bill 496, to pass by committee substitute. Senate bill 573, to pass. House resolution 998, to pass. Respectfully submitted. Representative Sharon Cooper, the 43rd District Chairman. Representative Martin, the 49th District Chairman. Committee on Higher Education, submit as the following report. The Supreme Committee on Higher Education, senate and consideration. The following bills and the senate. The instruct immediate report, same back to the Senate. The following recommendations. Senate bill 333, to pass by committee substitute. Senate bill 397, to pass. Respectfully submitted. Representative Martin, the 49th District Chairman. Representative Bill Warkhies, the 157th District Chairman. Committee on Industry and Labor, submit as the following report. The Supreme Committee on Industry and Labor, as the under its consideration. Following bills and resolutions to the House and the senate. The instruct immediate report, same back to the House. The following recommendations. House resolution 1024, to pass. Senate bill 605, to pass. Respectfully submitted. Representative Bill Warkhies, the 157th District Chairman. Representative Jan Taker, the 160th District Chairman of Committee. Intergovernmental coordination, local submitted the following report. The speaker, your committee on intergovernmental coordination, locals out of consideration. The following bills and the House and the senate. The instruct immediate report, same back to the House. The following recommendations. House bill 1550, to pass. House bill 1570, to pass. House bill 1578, to pass. House bill 1585, to pass. Senate bill 612, to pass by substitute. House bill 1556, to pass. Respectfully submitted. Representative Jan Taker, the 160th District Chairman. Representative James Parchett, the 176th District Chairman of Committee. And Judiciary, not civil submitted. The following report, for speaking, committee on Judiciary, not civil, senate and consideration. The following bill, the senate. Instruct immediate report, same back to the House. The following recommendations. Assembly 474, to pass. Respectfully submitted. Representative James Parchett, chairman. Representative John Corbin, the 174th District Chairman of Committee on Motor Vehicles. Submit it to following report. Speak your committee on Motor Vehicles. Submit it to consideration. The following bill is the senate. Instruct immediate report, same back to the House. The following recommendations. Senate bill 510, to pass by committee substitute. Senate bill 556, to pass by committee substitute. Respectfully submitted. Representative John Corbin, the 174th District Chairman. Representative Lynn Smith, the 177th District Chairman of Committee on Natural Resources and Environment. Submit it to following report. The Supreme Court of Committee on Natural Resources and Environment is in a consideration following resolutions of the House. Instruct immediate report, the same back to the House. The following recommendations. House resolution 1025, to pass. House resolution 1050, to pass. Respectfully submitted. Representative Lynn Smith, the 177th District Chairman. Representative James Collins, the 178th District Chairman of Committee on Public Safety and Homeland Security. Submit it to following report. Speaking of committee on Public Safety and Homeland Security, Senate on consideration. The following bill is the senate. Instruct immediate report, same back to the House. The following recommendations. Senate bill 339, to pass by committee substitute. Senate bill 183, to pass by committee substitute. Senate bill 259, to pass by committee substitute. Senate bill 319, to pass by committee substitute. Senate bill 404, to pass by committee substitute. Respectfully submitted. Representative Jay Collins, the 168th District Chairman. Representative Matthews, the 73rd District Chairman of Committee on State Planning and Community Affairs. Submit it to following report. The speaker committee on State Planning and Community Affairs. Senate on consideration. The following bill of the senate. Instruct immediate report, same back to the House. The following recommendations. Senate bill 108, to pass by committee substitute. Respectfully submitted. Representative Matthews, the 73rd District Chairman. Representative Gerald Green, the 151st District Chairman of Committee on State Properties. Submit it to following report. The speaker committee on State Properties. The under consideration. The following bill of the senate. Instruct immediate report, same back to the House. The following recommendations. Senate bill 279, to pass. Respectfully submitted. Representative Gerald Green, the 151st District Chairman. Representative Rick Jasper, the 11th District Chairman. Committee on Transportation. Submit it to following report. The speaker committee on Transportation. Instruct it to its consideration. The following bills and resolutions. The House and the senate. Instruct immediate report, the same back to the House. Submit it to following recommendations. House resolution 999, to pass by committee substitute. Senate bill 558, to pass by committee substitute. Senate bill 586, to pass. Senate resolution 463, to pass. Respectfully submitted. Representative Rick Jasper, the 11th District. Representative Shaw Blackman, the 146th District Chairman. Committee on ways of means. Submit it to following report. The speaker committee on ways of means. As that under its consideration. The following bills and the senate. Instruct immediate report, same back to the House. The following recommendations. Senate bill 370, to pass by committee substitute. Senate bill 330, to pass by committee substitute. Respectfully submitted. Representative Shaw Blackman, the 116th District. Chairman. That completes the reading of the reports. The standing committees. All right, we're going on now to the local calendar. We're going to the local calendar third reading and passage of uncontested local bills. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds withdrawal call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. The clerk will read the local calendar. House Bill 1550, motion of Stevens, 164th Brian County. House Bill 1570, motion of abstraction 104th Quenette County. House Bill 1578, motion of roads 120th, Wolf G. Judicial Circuit. House Bill 1585, motion of can trail of the 22nd Cherokee County. Senate bill 612, house substitute by Senator Jones of the 10th, city of Stockbridge. House Bill 1556, motion of martin of 49th, full in county. Is there any objection to the previous question being ordered on the local calendar? The chair here is none of the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye? Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of the bills on the local calendar, the eyes are 153. The knees are two. These bills having received the requisite constitutional majority are therefore passed what purposes chairman tankerously rise. Mr. Speaker, I rise to make motion. State your motion. I move we immediately transfer the local calendar to the Senate. Chair, maintain your motion. Is move that the local calendar just adopted by this House be immediately transmitted to the Senate? Is there objection? Is there objection to chair here is none and it is so ordered? Okay, we're going on now to morning orders. And before we begin, let me sort of tell you where we are. By rule, a total of 10 minutes by number of people signed up 13. So I'm going to I'm going to try this this session. It's kind of fun. Ben, she's got a lot going on up here today. So we're not going to give you a per member time. Let's we're going to see who will take care of their neighbor. Okay. And if some of you who have signed up don't get reached, don't look at us. Look down here. Chair recognizes chairman Lynn Smith for a morning order. Thank you, Mr. Speaker. And to the members of the House, I'm being joined by the Cowardy County delegation. This marks the beginning of the first anniversary of the tornado that hit Cowardy County, heard County and moved on to other parts of the state. We have a video prepared for us by the Forestry Commission. The city, Newden was known as is known as the City of Homes, but also the City of Trees. So please join with us in this wonderful moment of hope. In County, we just tornado warning an effect until 1215. It's hard to still believe that the tornado is actually going to hit. A matter of damage to Homes and also to our tree canopy was just catastrophic. It is a lot different from any thing I've ever seen. In one night, a midnight tornado took away over 100 years of trees that I could our community. We worked on the public rights of the way in the city and we helped to assess the damage on those trees. What would be qualifying for FEMA reimbursement to help the city float those costs? So not in my lifetime, but in the lifetime of children and our grandchildren, they'll see another tree canopy emerge over the city of Newden. It will look like it did before the storm. But then that gives people hope. Thank you for standing with us. Chair recognizes the members of the Greek caucus representing it. I'm sorry, Chairman Abstration and Chairman Chokas for a morning order. Thank you, Mr. Speaker. Good morning. Today marks the 201st anniversary of Greece's Independence. On March 25, 1821, as you heard earlier, Greece declared its independence from the oppressive Ottoman Muslim Turkish Empire, greatly outnumbered with limited resources but a love of country and democracy, the people of Greece endured years of struggle and hardship to overcome the enslavement of the Turkish Empire. The people of Greece were inspired by the American Revolution and have been strong allies of the United States in every major conflict. As a matter of fact, the first victories of the Second World War were by the Greek armed forces against the army of Mussolini. Winston Churchill once said heroes fight like the Greeks. And light of the struggles of our Ukrainian Orthodox Christian brothers, it is fitting to recognize that the relationship between the United States and Greece is stronger than ever. Thank you, Mr. Speaker. And I've got, oh, you got to say something. I want to, Greece is the birthplace of democracy, cultural and great influences for the entire Western civilization. So we appreciate everyone recognizing Greek Independence Day today. Thank you. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Chair recognizes Chairman Hogan for a morning order. Thank you, Mr. Speaker. And today is the memory of a great friend that I had that died in Vietnam. James Emory Jones, he was an Army master's sergeant from Al-Apaul and a member of the elite military assistant command, Vietnam Studies, an observations group, a black operations unit in Vietnam. And he was killed in a secret attempt to buy and try to wire a tap North Vietnamese communications in Leo's. He was killed in October 3, 1966. And I still miss him very much. So thank you. And moment of silence for Jimmy. Thank you very much. Chair recognizes Dean Sumyrie for a morning order. I only have a minute in the six of seconds in it. So let me be fast. Let's speak. I want to thank everybody for last night. It was a great evening. And I'm deeply honored to be giving the event of that nature. And I thank them. The members of the committee was Nick Rando, Representative Carolyn Huevlin, Danlic of Thompson, Shalamon Parham, Trip Martin, and Antoine Lane. And I got to thank Speaker Raustner for his kind remarks. Very, very meaningful to me. Thank the Columbus delegation is entire to all of them where they are. Leader Belvalley, leader Burns, thank you all for your participation. Representative McLean and Representative Gloria Frazier and Representative Kim Alexander, thank you all for the award. Representative Al Williams, thank you for always being supportive of me. I was in the Bill and Mitchell chairman. Thank you very, very much. My office, Stath shale Jackson in Atlanta and Robert Branskham in Columbus. Betsy, thank you to message your for the nice video and all the pictures that I had not seen in years. And thank you for ribs in Huevlin for being the MC and keeping. I know I talked too much last night and I recognize too many people. But I just can't help myself. But it was a great, great evening. And I'll be very honest with you. I'm going to say much more about this on my farewell speech on Sineadine. But speak of Ross in your comments on TVN, what you said last night. I can't tell you how much I appreciate our friendship and what it means to me over the years. With different sides of the aisle, but we have a civility with each other and I'm deeply deeply honored. And last I want to thank all the sponsors, Representative Huevlin, the sponsors, where the one was the Coca-Cola company. And then he says, Mr. Coca-Cola bottle, I'm just deeply honored. And now, I can't tell this is my reminds and right now I can't. I am As Amber De Bl Keeping Got The Alboutheure. that box is in no pleasure. A few events have I been to where there was that kind of mix, both parties, people from all over the state. It was you. Chair recognizes representative gravely for a morning order. Ladies and gentlemen, it is a special day when Chairman Cooper is reliving her softball dreams. Today I want to recognize a very special organization to me. Y'all know my passion for coaching and coaching the EC Bullets Fast Pitch softball team. Today we honor, if you look up on the screen there, Coach Greg Schnudy grew up in Indiana with a love for baseball and received an athletic scholarship to play baseball at Florida State University. He started coaching softball and Birmingham Alabama and moved Atlanta in 1991. Coach Schnudy formed EC Bullets Fast Pitch softball organization in 1996, putting the peach state on the map as a top state for college recruits in one of the fastest growing sports in the nation, a woman's sport. Coach Schnudy is recognized as one of the most influential coaches in club Fast Pitch softball for having built one of the strongest programs in the nation, EC Bullets Fast Pitch. Spanning 11 states now to include Alabama, Delaware, Florida, Georgia, Mississippi, New Jersey, New York, North Carolina, South Carolina, Tennessee, and Virginia, and when they compete nationwide tournaments. Coach Schnudy is a remarkable man and a dedicated father of three daughters and one son, Kim Kelly, Brandy, and Brock, all of whom participated in Division I collegiate athletics. He is a grandfather to nine grandchildren. The EC Bullets Fast Pitch organization has established and maintained a proud tradition of excellence and success by developing competitive softball players with equal emphasis on character and performance. Ladies and gentlemen, they have sent over 500 young ladies who play in the Bullets softball program on the two college on scholarships, some even competing on NCAA softball programs, the phenomenal performance of this organization is clear indication of its outstanding athletic ability, dedication, hard work, unity of purpose and spirit. Ladies and gentlemen, I'm so excited today to recognize Coach Greg Schnudy, the EC Bullets Fast Pitch program, and today Friday, March 25th is EC Bullets Day in Georgia. I'm going to turn it over to Representative Weed Hour for a special comment. Before you begin, Representative, I hope you can get this in in 27 seconds. I do. Greg Schnudy is my father-in-law and I'm very blessed to be able to call him a friend, not just of my father-in-law. Congratulations. Go, East Cod Bullets! That's all we have time for. All right. That completes our morning orders. We have a special order and the chair is going to ask every member of this house to take your seat and seize conversation. Every member will be seated. Chair recognizes Chairman Randy Nicks for a special order. Thank you, Mr. Chairman, to my friends and my colleagues. I come up here this morning, not as your ethics chairman. I don't think anybody's in trouble yet, so some of you can breathe a sigh of relief. I'm not here to talk about gambling, so some of you others can breathe a sigh of relief. I'm here today to tell you how much it means to me to serve in this house and to thank some people for helping me along the way. I want to start by reading some words from Shakespeare. Has anybody here ever read Macbeth or at least read the Cliff Notes? There's a little passage there and this passage dramatizes the damaging physical and psychological effects of political ambition on those who seek power. This is a speech by Macbeth towards the end of his life when it was all over. Listen to this. Tomorrow and tomorrow creeps in this petty pace from day to day to the last syllable of recorded time. Out, out, brief candle, life's but a walking shadow, a poor player that struts and frets his hour upon the stage and then is heard no more. Now I don't know why I thought about that, but when I decided to come up here somehow that image of strutting and fretting across the state and being no more is kind of interesting. And I want to use that to just tell you this, don't take yourself too seriously up here. They told me when I first got elected that everybody loves you, they want to get your contact information, they come see you, they call you, but as soon as you tell them you're not going to run anymore, you can feel your phone start vibrating as they take you out of their contacts and minds are already vibrating. You know it has been a tremendous honor to serve with you individually and with those many who have come before during these past 16 years. And I want you to know that those 16 years passed really, really fast. Seems like I turned around twice and it was 10 years and I told my wife and she's here by the way, there's Debbie over here, my better half. I'm going to talk about her in just a minute. But it seems like I just got here and it was 10 years and I said, Deb, I think I'll run one more time. The next thing I know is 12 years and I said, Deb, I'm going to run one more time. And then it's 14 years and I said, Deb, I'm going to run one more time. As I approach 16, she said, you got to come up with something more creative than that if you're going to run again. And I couldn't think of anything so I think it's time for me to go. I'm going to say thanks to a lot of people today and I'm going to mention just a few names because I don't want to leave people out there several that I've got to mention but I want to go through this quickly and mention some people and just give them my thanks. First of all, I need to thank the people in House District 69 who sent me up here eight times. It's been the thrill of my life, the honor of my life to serve and I thank them. The second person and I've got to thank my sweet and lovely wife who I just introduced to you. This lady has put up with me and with a lot for a long time. Come the middle of April, it will be 52 years since we had our first date. I was a senior in high school and she was in the 10th grade. Since that time for the next five years, we dated each other just pretty much exclusively and come May, May the 17th, we will celebrate our 47th anniversary. Now there's an old saying that a good woman is behind any good man and I will have to say that is doubly true here. She has been my accountability partner and here's the reason I never, ever, ever wanted to do anything that would disappoint her or embarrass her. She has made me infinitely better than I could have ever been without her. While I don't think I've disappointed, she's never told me I know I have nearly scared to death quite a few times though. With some of the impulsive decisions I've made, especially some things like changing jobs and moving and I'm going to give you a quick little scenario, whether you know it or not, women like stability. They don't like for you to come home and say, honey, I'm going to do this or I'm going to do that or we're fixing to move and I've done that to her quite a number of times. For instance, when I was in the National Guard, I had to finish my six years and was ready to get out. I come home one day and say, hey honey, guess what? They offered me the chance to go to flight training in California to re-up again. We're fixing to move to California. I had a good job at the bank, a good career going. Send them a letter and say, I'm out of here. Here we go. When I got back from that, I got back going in business. I was in the brokerage business doing quite well, probably made more money than I know I made more money than I've ever made before. Somewhere along the line I decided I'm going to quit this and I'm going to start my own business. I'm going to tell you what she said about that. But I'm going to tell you this, she was absolutely right because it was the most expensive education I ever got. And then in 1993, I said, hey damn, let's move to Georgia. We should live it over in Slap Out Alabas. Let's move to Georgia. I got an opportunity to go to Athens, Georgia. We loaded it up, we moved. 1994 said, Deb, this ain't going too well. And I've got an opportunity now in LaGrange, Georgia. So we're going to move. Here we are. And then in 2006, my predecessor Jeff Brown made the announcement. He was not going to run again, but he didn't make that announcement until Thursday of the week before qualification. Nobody thought he was going to run, so nobody's going to run against him. So I go home and said, hey Deb, guess what? I'm going to run for the Georgia House of Representatives. She looked at me like, have you lost your mind? Well let me give you the rest of the story now, the why I love this woman so much. When I did that, the bank I was working for, I was a city executive for pretty good sized bank in LaGrange. They told me, you're going to have to...\n\nAfter resign, we're not going to give you the time off that it takes to be in the legislature. So Deb was willing to sacrifice. She went back to school. She got her masters in education leadership and improved her credentials to the point that she could up her income to kind of help make up for some of the income that I lost because actually since that time, I have not actually had a full time job. If you want to talk about sacrifice, it has been a sacrifice. But this lady over here took up the slack to let me serve here for 16 years. She has not been here very much because she had to stay home and work. So that's why you haven't seen as much of her. I would have liked you. She has truly been the wind beneath my wings. My greatest achievement in life was to be her husband. And I love you, dear. I love you. But don't relax just because I'm getting out of here. I still don't know what I'm going to be when I grow up. Let me continue with some thank yous. I want to thank the speaker staff. They have been so helpful. They have done so much to help me. I want to thank House leadership. And I'm talking about the majority and the minority side of House leadership. I know that leadership is difficult. It's extremely difficult. When I first got elected, the saying was it's a shame that the only people who know how to run state and federal government are either cutting hair or driving taxi cabs. Now let's fast forward to today. Now we have social media and we have a bunch of cave people. You know what cave people are? That's citizens against virtually everything. We got a bunch of cave people who can magically become epidemiologists overnight. They flocked 10th grade biology but they can tell you everything you need to know about a virus. And if you know those people, the next day they can be constitutional scholars. They can tell you all about Article 5 conventions and those kind of things. And then before you know it, they're experts in election law. Man, they can see you all this stuff. It's just amazing. And now, those same people are experts in mental health and insurance. Wow. That's interesting, isn't it? But you know, since they have no positive agenda of their own, they love to spread outlandish conspiracy theories and outright lies to try and destroy the good and noble work that you leaders are doing here. And I want to thank you for holding strong. You hold this house together. And I want to thank every one of you. And I'm not talking about just our leaders right here, but I'm talking about our committee chairman. And I'm talking about the chair, late men and women throughout this house and what you do. Thank you for what you do. I want to thank the administrative assistants I've had. Those people have been great now. Chairman Martin and I go through about two years. I don't know what he does to them, but they don't seem to stay around very long. But the ones that I've had, I want you to know they have been smart, talented and dedicated people and I appreciate them. Legislative Council, we've got a great group in legislative council. I've got to mention one name here. I've got to mention Jeff Leneer. Jeff Leneer knows ethics backwards, forward sideways. I have called him so many times on so many issues. He's always answered and always had the answer for me. And I really appreciate Jeff. I want to thank our clerk and his staff. You know, I've been able to be here under two great, great, great clerks. Robbie Rivers and Bill Riley. I don't think there's any that are better in the world and their staff. I don't think there could be anywhere better in the world. They have done so good. Now, they... Here's how I'm going to put it. They keep it all between the ditches as we go down the road. The House Budget and Research Office. I'm amazed at what all they can get done, both on the budget and all the research, the papers they give us, they help us with those expert things we need. The GSP officers that do the security here. And a group that I want to stop and mention really specifically that I love our doorkeepers. You know... The smiles and the handshakes and the encouragement that I get from those people. That you get to. That just indicates to me how much they love this house. And you know what? They love you too. I guarantee you they do. I've got to mention something to you. Some of you have seen my tie. You'll see this smiley face tie that I've got on. Some of you know the story. Back a number of years ago we had a gentleman who always worked that door by the name of Glenn Hartley. Glenn was just a fantastic gentleman. I loved Glenn the death. He loved to wear these wild ties. You'd come in and have his loony tomb town. He'd have all the cartoon characters to test Manian devil and all that. Well I came in one day and he had a tie with his smiley faces. I told him, Glenn man, I just love that tie. Well the next morning, guess what? He handed me this tie. And every year, at least once or twice, he'd say, hey, Reptid, how about wearing your tie tomorrow so we can get a picture made? And not only that, but as you know, those of you who were here, Mr Hartley passed away several years ago. And we actually had a memorial service for him here. And I wore this tie that day to honor him and to speak on his behalf. So I want you to listen to this, especially the new people and young people, sometimes the small things are the big things. In 16 years, I'll probably remember this tie longer than most anything else. No disrespect to anybody, but I'll probably remember that longer. That's just so great. I actually want to say thank you to some of the people in the hall. You know, lobbyists get a bad rap sometime. We've got some great people out there that have helped me tremendously because they are experts in so many different things that I don't know. And I want to thank them. And finally, that last but certainly not least, I want to thank Speaker David Roaston. I consider David Roaston to be a dear personal friend. And it has been a double honor to serve as his ethics chair. Now, I'm going to tell you this. I was very surprised when he asked me to take this chairmanship because he didn't know it because he never let me tell him. But when I went in, I wanted to ask for higher education. But he never let me ask. He said, we've got something we've been talking about. And we think you're the person that we need to chair this particular committee. And I said, what is it? He said ethics. I didn't even know what the ethics chairman did. But I will tell you that I found that to be a great honor to be asked to chair this committee. I want to tell you this. When I get called to the Speaker's office, I know that it's not the chit chat and drink a cup of coffee. When I get called to the Speaker's office, you can pretty much bet that the proverbial stuff has hit the proverbial fan. And if you don't understand proverbial stuff, represent the valed Williams will explain it to you when we get through. But through all of this, we have developed a unique relationship. I'm going to tell you that I have gone to the office been called in there and I have prayed with our Speaker. When we lost one of our dear members, he called me in that morning and he said, I think we need to pray. And I think when we did, I'll never forget that. Also, we have agonized over some disturbing issues that have arisen in this house. We've done that many times. But what I'll always remember is he always believed in me. And when difficult decisions had to be made, he fully trusted my judgment. And he never questioned me. And more than that, I know that he always had my back. Mr. Speaker, I want to thank you so much and I want you to know that I will always cherish the relationship that we have. And finally, I want to kind of close up with a couple of things. I started off with Shakespeare, right? All of you know a little bit about Shakespeare. I want to kind of close out with some biny tape. That great South Georgia philosopher and pastor. My first year, well, biny tape comes just about every year as our chapter another day. And I believe it was my very first year, biny tape came. I didn't know it was or anything. And he got up there and boy, he just started off telling us how important we were. You are some of the most important people in the world, what you do. You are just so special. You're elected to be here and it's just you're just so important. And then he stopped for a minute and he looked at us and he pointed us and said, but I want to tell you something. The only thing that's going to matter is what they say about you when they eat in the potato salad. Now for you who may not know what that means, my funeral home directors and pastors will know you eat the potato salad after the funeral at the final gathering of family and friends. Now I want you to know I have been worried about that for 16 years now. And I want to ask you if any of you, my friends, get to come and eat my potato salad, would you please say something good about me? If you would do that, would you just raise your hand? Oh, I feel so much better. I've been worried about that for 16 years now. I can leave here happy. I think it's going to be all right. On February 26th, I read a little devotional and I really want to close with this. I want you to know that I'm calling every one of you my friend today, my friends. The title of this devotion was God be with you, which is also the title of a hymn. This is a devotional book that takes hymns and brings it out. It has one simple verse of scripture, Romans 1620, it says, the grace of our Lord Jesus be with you in these four lines. It is my joy in life to find at every turning of the road, the strong arms of a comrade kind to help me onward with my load. And since I have no goal to give and love alone can make amends, my daily prayer while I live, God, make me worthy of my friends. Thank you, Mr. Speaker, I yield the will. Thank you. I know people want to say hello to Chairman Nicks. We're going to suspend for about five minutes if you want a great he and Ms. Nicks. Thank you. Oh, thank you. Well, I out thank you so much. Oh, yeah, that's how. Thank you. Thank you. I love you, brother. Hey. All the time I was thinking of you, you know what I mean? Yeah. Hey. I'm not going to have a fight. Yeah. Thank you. Oh, there's one of my favorite, favorite, favorite, favorite. Thank you. Thank you, Major. Hey. Thank you. Thank you. Oh, thank you. Thank you. Thank you. Hey. Thank you, sir. Thank you. Happy to be a part of our family. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Okay, let's complete our greetings of Chairman Nick's. All right. Let's complete our greetings because we're going on now to the rules calendar. Starting on to the rules calendar. Clark will read the caption to Senate Bill 226. Senate Bill 226 by Senator Antony Parte, 31st. Well, it's the 53rd, middle of the 49th, and others are being titled back to amend Part 3 of Article 3 of Chapter 12 of Title 16. If this goes to George Anatetti relating the sales, or distribution of harmful.\n\nMaterial to minors so survived the provisions of goat section 16 12 103 show be applicable to libraries operated by schools I spill them for the committee on judiciary not civil that committee recommends that this bill do pass by committee substitute Chair recognizes chairman bershiet to present the bill Thank you, mr. Speaker. Thank you colleagues happy Friday I come to you with Senate bill 226 and To simply put this Senate bill 226 put some guidelines on timing when Material is challenged in a school if a parent or guardian goes to a school and challenges material That it deems to be obscene or or not or harmful to children then the What Senate bill 226 does is put some timing on when these Reviews have to be complete and determinations have to be made. There's two processes First the parent would appeal to the school itself and What Senate bill 226 does and says is that the principal or his designee shall be The one to make the determination as to whether or not this these materials are obscene and should not be seen by these minors It's important to know that Senate bill 226 Says designee currently many of most all of our schools are required to have a process But the problem that we're trying to address is that there's no timing requirement So we want due process for engagement for these parents to say that if this if they deemed They these children shouldn't be seeing this then we need a time frame for when these determinations are made So first of all the designee can be a panel much like any of the processes. They're already included the designee For example in my county our panel is made up of media specialists teachers and vice principals So that designee can be that panel Secondly if the principal or designee does not Rule that the material is harmful to children the parent has an appeals process to the board and The board then has final determination on whether or not this material is harmful to children and Frankly, this is this is a bill that it makes common sense practical sense to me if if parents do not want young children reading Some very degrading type material then this is a parent engagement process and due process for those parents to Be able to challenge these materials and with that mr. Speaker I will take questions It's a beautiful day outside Is that a motion to adjourn? I would I would make that motion mr. Speaker if I were allowed You have a question if you You are you To recognize this Representative Jasmine Park to your left for a question Thank you mr. Speaker does a gentleman yield I do so in this process the principal or their designee Has a week to respond and ten days to make a decision? What if that principal or their designee gets 40 or 50 Separate complaints from separate parents of students within that school That's a very good question. Thank you for asking that there's a provision in here that allows for The designee or the principal to settle on a time frame that is reasonable to the challenger and the the principal or designee Does the gentleman further you certainly so in this In this allowance for them to agree upon a time frame Are they going to have to agree upon a time frame for each of the 40 or 50 separate Complenance that come to them what if someone comes on Monday ten people come on Tuesday 20 people come on Wednesday is he going to he or she or the designee if that's a panel going to have to To basically make agreements with each of these individuals In a in in order to come up with a timeframe because I'm just thinking about the workload here that we're putting on our Administrators in our school that already have a lot going on. I'm sensitive to that issue and I appreciate the question I think that is The answer to your question is yes each and each individual challenger they would have to agree to a time frame outside of the provisions of this bill but I don't necessarily agree with I guess the underlying provision of that that scenario I don't believe that this is going to Ensure that there are going to be 40 or 50 challenges of material because I think as my colleagues will Testify to there are these these are these challenges are already being had We're trying to just put some reasonable time frames on them I don't think this is going to instigate just a surge in challenges respectively, I would disagree after seeing some things on the internet I think they're people poised and waiting for this bill to pass and this bill in this current format does not have any Guard rails to protect our principles or their designees from this potential For there to be an onslaught of These requests for reviews and so I would say if we're going to create guard rails in my opinion There should be guard rails as well for who and how many of these can come at one time. Thank you very much very good. Thank you Miss speaker I believe we have plenty of time To engage in this conversation, so I'm gonna yield the well gentlemen as yielded the well Chair will remain members that the rules committee has imposed a one-hour time limit on debate That will be allocated 30 minutes to each side That does not include the presentation It will begin now Chair recognizes to speak to the bill representative McLaureen Thank you, Mr. Speaker Good to see everybody this Friday This is not the worst bill y'all could pass it could be worse Whisper our colleagues to each other as they finger wag for the opposition Why are you opposing a bill that could be so much worse this bill started a lot worse Let's talk about the way this bill started bill started as a criminal bill That's why it went to judiciary non-civil and came out of chairman's chairman for chess committee It started out as a misdemeanor for librarians media texts Who failed to scrub the entire universe of knowledge of all potentially offensive things and There were other provisions in this bill. They were kind of crazy Like you would have to post the full text of a challenged material on the school board website Copyright alarm For four whole years Which is the length of a school board term? Imagine that So this bill was originally a criminal law bill that was designed to go straight to the school board and try to blow it up Right, but it's been tapered back right the committee process the level heads of this house have tapered this bill Back But where did it come from? The energy of this bill can best be summed up by the first speaker First witness who came to judiciary non-civil To testify and support of this bill when it was a criminal bill The first words out of her mouth almost were there's no criminal penalties to nobody's going to jail moving on she flipped the page she was wrong The group that had sent her there To testify in support of legislation that is not unique to Georgia But is a nationwide attempt as other bills have been this session to intimidate teachers to intimidate principles Into complying with the wishes of single parents one parent at a time To allow individual parents to override What schools have been entrusted with for decades? Y'all think public schools would be created now if they weren't already created in this climate Do you think we would have public schools? We're moving in a direction of tearing at the threads of that public trust and as the chairman who I really appreciate during his special order I mean it incredibly moving words today as he aptly put it We now have cave people Who believe that they are the experts that they should be in control on every conceivable issue and those people Do not need to be empowered They need to be blocked They need to be stood up to because they are behaving like bullies and They're going into publicly shared spaces schools institutions of all kinds elections Etc. And they're demanding that their individual view be privileged over the will of the group That's where this bill comes from and the reason that you know that is you have to ask yourself what the problem is The only reference to the actual policy problem that the chairman made when he made his presentation was that there's very degrading type material What is very degrading type material and why are our schools not already dealing with it appropriately? Yes, we already have these processes. Yes, you can make a complaint. Yes, they're it's subject to administrative review So then the question is why do we need these time frames? Why do we need to build in this special opportunity for Apparent to go to the school board and make their case and then for the school board have to publish the title of the material that they keep in their curriculum for a 12-month period why? The reason is because you all are not willing to stop the crazy There's there's a certain amount of it you're willing to do there's a measure of it you're willing to do and I want to acknowledge that in all honesty and full fairness And I think that during a special order when you get congratulated for standing up somewhat to the crazy it's not zero Right, there's some amount of you go to the town hall and Somebody says well gosh darn it you know that those machines were hacked in the election was stolen I'm sure just guessing that some of you probably say Well, you know, I don't know about evidence specifically of that But we're very concerned about security and we're very you know, so you give them a little bit of rope right because that's easier than just saying Y'all have no idea what you're talking about you being fed lies by Eric Erickson You're reading the wrong website. Don't believe everything you read on Facebook You could do that But you'd start losing elections See, they won't do that So instead you give them SB226 one of my favorite speeches this session was representative Collins On transparency in schools. She told you all we did transparency over zoom for two years We don't need more transparency, right? Where's the policy problem? The truth is when we were given manila folders of the potential materials They were cherry picked they were isolated and at the very back of the folder Was information about gender identity and trans people right the first witness I spoke about is a member of a national organization that has an anti-trans Agenda There's something lurking in this and the other speakers will talk about this But there's something that's dangerous that's beneath the surface of this bill That you're facilitating you're given a little bit of rope to given a little bit of air to and you're gonna tell yourselves today that it's harmless But what happens two years from now four years from now When that little seed grows and the disease festers What happens is you get what's happening outside of a Senate subcommittee for HB 1013 This chambers landmark mental health legislation that everybody should be justifiably proud of my goodness I'll go to your town halls in rural counties and defend you and you don't want that I know But I would defend you to your constituents so vigorously for voting for a good bill and yet we have what discussion of the World Health Organization and pedophiles That's what we're talking about And we in this chamber would like to believe well SB226 has nothing to do with that. It's this small bite. We're just giving them a little bit and they'll go away And it's fine. No, what you're doing is you're enabling You're enabling a spirit that is corrosive to public trust and corrosive to democracy People like to talk about how there's a difference between a democracy and a republic. We hear that a lot That's rhetoric, right? Notwithstanding the broad definition of democracy You all like to claim that a republic is what we are well if that's true What does that mean? It means that your custodians who don't just enact the will of the people who don't just bend immobility or people who stand in the gap and Say you're misinformed on this and I'm sorry and you can vote me out if you disagree with me But you just don't have the perspective here that you need That takes courage it might take career and encourage but it's courage nonetheless I'll get out of the well what matters here is what's in your heart? What matters is what's in these teachers hearts these administrators hearts? We know they want to do the right thing Do we know that about the parents that we're enabling the individuals who will come out of the woodwork to cause as much noise as possible Because they feel that it's their God-given right to disrupt public institutions Last thing I'll say about this that first witness who didn't know what the bill said Who stood for the bill and it's very first since since she's now a candidate for state house in this state? I hope you enjoy having her as a colleague. Let's speak right yield the well Chair recognizes representative Kendrick to speak to the bill Thank you, Mrs. Speaker You know you guys are in trouble when I come to the well because I'm never up here But today I rise to humbly ask that you vote against SB 226 I won't take long because my message is pretty simple You see ladies and gentlemen SB 226 is a solution looking for a problem I ask several times in public and private for answer to this very simple question Why are we creating new legislation and we already have rules to deal with media procedures for what is termed offensive books And I have not heard more than a handful of examples where the process has not worked in a timely manner I would like to point your attention to the board and hopefully you can read that I know it's a little blurry, but I'll read it to you the pertinent parts This comes from the Georgia Board of Education and it is rule 160 dash 4 dash 4 dash 0.01 dealing with media programs and it says requirements each local board of education shall Adopt a media policy that one provides for the establishment of a media committee at the system level and at each school Number two requires development of procedures for the school system and for selecting materials locally Handling requests for reconsideration of materials considering gifts of instructional materials Using non-school owned materials and complying with copyright law and if you see at the very end here There is actually a cult section That is OCGA 20 dash 2 dash 167 and about three other cult sections So as you can see there is no problem that needs to be solved It's already solved Not only by statue already, but by a Georgia board of education When this bill came to judiciary nonsense will be heard I cannot tell you How many school systems emailed me with a copy of their media policy that's in full effect right now That engages parents teachers and other community stakeholders to do exactly what this bill is seeking to do From Pauling County to Gwinnett to South Georgia all these school systems have procedures already in place And the people that actually teach and actually will be on the hook under this bill like media personnel and principles are Scratching their heads as to why we're considering this and I'm scratching my head with them Of all the actual problems in this state that we have to consider Like the hundreds of thousands of uninsured Georgians because we want to spend Medicaid Nursing and health care shortages of crumbling infrastructures Infrastructure system that thankfully will be fixed by president Biden. Oh, and this thing called a pandemic We are debating right now about a problem that literally doesn't even exist because it's already been solved Now I'm not naive. I know this bill is part of a whole scheme to introduce a lot of bills that are solutions looking for a problem this year They're made up figments of imagination by some members of the majority party But hopefully you will see that I'm showing you literally in black and white That this bill literally is a solution on the prowl for a problem that we do not have Not one person who supports this bill has been able to provide me with overwhelming evidence that this is actually an issue And that we should be spending our time and energy on it and that is not already covered by existing law and procedures So if you truly want to show that you believe in small government vote no to this duplicate of effort But if you want to just score some political points for made-up prices then go ahead and vote for it So to sum it up number one SB 226 doesn't have any proof that obscene materials is actually a problem that Isn't already being solved and even if it is we already have statute and laws in place to deal with it Those of you interested in history may know that the great Stoic said that one of the our greatest tendencies as humans Is to imagine things that are not reality and that we as humans have to try every day to overcome that fear of things that don't exist Today is your day to do that by voting no against SB 226 And I will end with this Most of us in here are small business owners myself included and you know that as a business owner in order to be successful You have to come up with a product or service that actually solves a problem Colleagues SB 226 is a mouse trap, but there are no mice It's a solution looking for a problem And I humbly ask that you vote no against SB 226 Thank you, mr. Speaker. I yield the will Chair recognizes representative dryer to speak to the bill Thank you mr. Speaker I know that I often come to the well and I forcefully speak to values that that I feel are being threatened And maybe even at times I have some anger and I show some anger up here As a human our natural and first response to being threatened is anger Because we're scared And it's also easier to handle anger Then to handle fear Or handle being sad or disturbed And I'm going to do my very best today to put aside that anger And tell you why this bill scares me and why this bill hurts and and why this bill makes me sad We already have book banning in Georgia Just last month A local county banned six books Through the regular process including a book by Tony Morrison But this bill here is going to make it harder for administrators To refuse to ban books It's going to be harder for them to stand up To folks that don't have the best interest of the school or are simply scared So scared they're trying to stop ideas in our schools And it not only will this bill make it harder but if if an administrator refuses to ban a book They have to post that on a website for 12 months I came into this session thinking Our school boards, our teachers, our administrators are under attack We need to do something to make it better on them And this bill does the exact opposite People are scared in our society and it's because we are changing It is because we are becoming much more diverse There are a lot more cultures present at the table And we are getting a better understanding of what other people have gone through That weren't in our shoes And people that are scared Are coming out With anger and trying to Prevent those ideas from being in our high school Ideas that are important I want to tell you one of the most important books to me Growing up was Beloved by Tony Morrison Tony Morrison Was just banned in the local county last month here in Georgia Just about 30 minutes away Beloved is one of the books that is often targeted around the country to be banned I don't want to tell you about the dedication of that book The dedication to the book beloved by Tony Morrison simply says 60 million and more So it says 60 million and more Is talking about the number of people that died During or as a result of the African slave trade Tony Morrison Call something in her book Rememory Because It shows how the effects of slavery things that happen to people in Georgia permeate Future generations and affect what is happening with future generations I Heard something that troubled me earlier this session someone said In relation to another bill and committee That Their north Georgia Irish Ancestors lived in about the same conditions as a south Georgia slave Okay We have to have books like beloved Because I think people need to understand Of how different things were under slavery and I'm starting to get angry because it breaks my heart When you have to read stories About the back that your kid could be sold away when they turn 10 years old A significant other could be violated and you could have you could do nothing about it And if you said anything Could be strapped down and a lump of coal placed on your back We got to look that in the eye Man that is hurtful that is horrifying and that happened in Georgia To hundreds of thousands of people And Tony Morrison was right that legacy That legacy still lives with us today We haven't apologized for that legacy as a body We have to look at an eye it hurts It hurts But we will be better if we can do that We can't turn away because we're scared or something's uncomfortable We have to look at it and we have to sit with it And we have to let People that look like me in high school struggle and grow so that they can be better human beings And this bill puts us on the wrong path And I hope that some of us can just say let's Let's sit this one out So that maybe our state can be a little better and maybe we can be a little better than we were Thank you, Mr Speaker Chair recognizes representative when to speak to the bill Thank you Thank you, Mr Speaker In his novel Fahrenheit 451 Ray Brabary says you don't have to burn books to destroy a culture Just get people to stop reading them I've been an avid reader all my life I spent many hours of my childhood escaping through books and I imagine this is true for many other students and our public school system Because books are and have always been a meaningful way to escape To seek comfort to find understanding And to learn about the experiences of other people and most importantly to learn about ourselves This is even more true for students who do feel marginalized black and brown students LGBTQ students and other vulnerable students who are seeking answers about their differences in their places in our society So it's not surprising that this national movement to ban books overwhelmingly targets books That are authored by people of color and or address topics that are relevant to race gender identity religion or the Holocaust And what's even more cynical about this bill is it's actually not about students It's not about educators or librarians. It's not even about the majority of parents It's about a political agenda Which some of you have already talked about and it is a national coordinated well-funded movement push by a fringe fringe conservative groups That do not reflect the majority of Americans And it is happening all over our country And in response schools are preemptively pulling books out of their libraries Because they are scared So here's the question at hand who gets to decide what is considered obscene or harmful Throughout our history the courts can't even agree on it They have struggled to define what is considered obscene what is considered harmful to children And no doubt the application of this law will be arbitrary It will create a chilling effect on our school system And it will mobilize a base of voters who want to use this as a means to remove any book they find to be offensive We recently received an email from a Georgian who sent us a list of books that she would like to be banned from our public schools Among the list the hate you give the blue SI the kite runner And she listed her reasons systemic racism pro LGBTQ pro me to movement Racism in the justice system pro islamic I brought one of the books she listed the hate you give This is about a book A 16 year old girl who witnesses the death of her childhood friend at the hands of law enforcement I don't think I need to tell any of you in this chamber why this book is relevant\n\nto a Georgia student. But I question, why do the people behind this movement believe this book is harmful to minors? And I think the answer can be found on page 443. The author says, it would be easy to quit if this was just about me. Calil that night in that cop. It's about way more than that though. It's about seven, Sakani, Kenya, Devante. Then she goes on. It's also about Oscar, Iyana, Trevon, Rakyia, Michael, Eric, Tamir, Azale, Sandra, Freddie, Alton, Solondo. And it is even about that little boy in 1955 who nobody recognized at first. Emmett. And the messed up part, there are so many more. Yet I think it will change one day. How? I don't know. When? I definitely don't know. Why? Because there will always be someone ready to fight. And maybe it's my turn. Others are fighting too, even in the garden, where sometimes it feels like there's not a lot worth fighting for. People are realizing and shouting and marching and demanding. They're not forgetting. And I think that's the most important part. Calil, I'll never forget. I'll never give up. I'll never be quiet. I promise. And this bill is exactly about that. Asking us to be quiet, finding a way to silence the voices that so desperately need to be heard. And it is a bill that is being pushed by a small minority. Because book bans, they're very unpopular. Over 80% of Americans oppose book bans. And there's a reason why they're unpopular. They're essential to free speech, free thought, crucial tenants of a new American democracy. And they challenge us to be better people and they enable students to find the understanding to seek the comfort that they so desperately need. Mr. Speaker, I yield the well. We have other members that wish to be heard on the bill. The bill, clock starts back over. The chair recognizes representative Sains to speak to the bill. Thank you, Mr. Speaker. To me, a good bill is one where you hear more about what a bill isn't than what a bill is. A few moments ago, we were put on the House chamber screens. What the procedure that currently is in place for Georgia parents to take up issues with their school systems, a procedure that had to be put on display for us because no member of this institution realized what it was. So if we don't know what the procedure currently is, why do we expect the parents of our youth to? That is not a solution looking for a problem. What this bill is, what this bill defines harm to minors is lacking in serious literary, artistic, political, or scientific value to minors. The books that were displayed here today, unless you think otherwise, wouldn't meet that definition. I would come to you and say maybe we should clear the books of the filth that may be in that library and the youth might be more liable to pick up Fahrenheit 451. My dear friends, I've been honored to serve as a deputy sheriff at where I taught champs instruction to fifth and middle school students. In that situation, we talked about many delicate conversations that apply to peer pressure, drug use, and the harms of that come along with it. Nothing in this bill, not one piece of it, would prevent those serious conversations from taking place. What it does do is give the parents of Georgia a consistent standard. I'm honored to have Naval submarine kings bay in my district where we define in our school system a churn rate, a churn rate where a student, how many students were in at the beginning of the year and how many students were in at the end of the year. The difference of that is how many have come in and come out. Those individuals who face going from school to school and already a multitude of hardships shouldn't have to wonder what the process is to be involved in their parents' education, their students' education. So I'll leave you with this. Where have some members of this chamber's confidence gone because the confidence isn't in on the parents of our Georgia youth? The confidence isn't in the students that consume and go to our public schools because I have confidence in this process that instills and empowers our parents to ensure that their kids are leading a high quality education in a safe environment. Thank you Mr. Speaker, I yield the well. Chair recognizes Chairman Setslor to speak to the bill. Ladies and gentlemen, the House, I rise today candidly in disappointment. I don't like to mention party names in this place but this is not my parents' democratic party. The presentation I heard and the arrogance I've heard. I'm talking to Georgians and I'm talking to our members of our body here. The premise that's been laid out, I want to explore the words of our speakers that came before us. I want to unpack what they said. They stand before Georgians opposing the proposition that what this bill does is right. What this bill does in plain terms that allows parents of school kids, if they don't like material that their kids are being shown or being offered to go to the principal and complain about it, it gives them that right. The second thing it does, if they don't like the principal's decision, it allows them to make an appeal to the Board of Education. And if they don't like that decision, it doesn't matter. The Board of Education decides there's no overriding, there's no burning of books by anybody. And what it simply says is those things that have been complained about by parents are disclosed in title. It doesn't list an entire book, it doesn't list page after page after page. This bill simply allows parents to say and give them guarantees in law if they don't like what their kids are being shown in school they can complain to the principal and make an appeal to the school board. That's what this bill does. So if there are 10,000 moms watching their dads watching in Georgia, I want you to understand what's been proposed by this, but this is not the party of my parents that's opposing this bill. Friends, what was said before us, I think she'd insult Georgians. The word said by one of our members and we don't mention members names here. The first speaker on this bill said it allows individual parents or the effort was, this effort behind this bill they falsely proclaimed was to allow individual parents to override the powers of the school board. That's false. All it simply says, all this bill does is give the rights of parents to be heard. Should parents not be heard? Should the arrogance, should the arrogance that I heard during the debate of this bill over the last couple years, the arrogance that parents shouldn't even be able to complain about this or even know the titles that are being shown in their kids school? Do we as a general assembly? Do we as a general assembly believe that the titles that are in kids schools that have been complained about and raised as questions shouldn't be shown and exposed to the public? Opposition to this bill, opposition to this bill suggests that the public shouldn't know the titles that have been complained about on content in their school systems. Parents absolutely have a right to know what those titles are and parents absolutely have a right as this guarantees to be shown in the school library or in a means defined by the school board to look at the material their kids are being shown. I was part of this debate and as I look at the George and C. Wart Part of this debate I want you to understand that people came to me and said parents don't need to see this. Everyone in the public doesn't need to see what's being shown to our kids. What agenda is in place that leads to the members that spoke before us today that says all this content shouldn't be available to the public? All this content shouldn't be available for parents to see because they might complain about it. Parents have an absolute right to see what their kids are being taught. If we as government leaders are providing content fund of our tax dollars and put in front of first graders, sixth graders, 12th graders and mom and dad can't see it. What who can see it? Who's in what kind of oversight do we have? If mom can't see it, who can? Why do we oppose the proposition, the simple proposition, the balanced moderate proposition in this bill that if parents don't like the content that the kids are being shown they ought to be able to complain to the principal about it and that there's an appealable school board. That's what's in this bill. Nothing more, nothing less. All this nonsense. I mean, I'm disappointed in this chamber, the nonsense that's referring to this is some kind of cave manager that they want to block. And again, the words were said, the cave people need to be blocked. They're demanding that their views should be recognized over others. That's false. This simply provides a process for their views can be heard. That's it. The speakers opposed this bill said earlier on, they were cheer picking isolated circumstances that there's this disease that somehow festering that we're allowing to fester and they're enabling this spirit, this corrosive to the public trust. Friends, what's corrosive to this republic is the idea that the elites, whoever they are, whoever they're employed can determine what 1.6 million school kids can can see and be shown without their parents knowing about it or without the public having any access to it. That's what opposition to this bill proposes. It is breathtaking. And if you're an in-between voter out there that's just a member of the public that doesn't really affiliate with one party or the other, I want you to hear the clear distinction today. Not in my words, but in the words of those who opposed this simple bill that simply gives transparency to parents. There's this, words were said by one of our previous speakers that members of the public believe they have some god-given right to quote disrupt public institutions. The god-given right here, folks, is the right for parents to direct and have some input in the education in the upbringing of their kids. Parents in my district can't write $20,000 checks to pull their kids out of the school and put them in a private school of their choice. Parents in my district work their tails off 50 hours a week to keep the lights on and they depend on our public schools to educate their kids. If the stifling arrogance that parents can't complain about content that's being presented to kids, to a principal, and having appealed to the school boards not okay for this other party, what on earth do you believe? Mr. Speaker, I'm going to wrap up shortly, but there's a couple other things that were addressed that need to be said. The idea that these are made up figments of our imagination. Friends, I'd love to be able to read to you, or I'd love to expose to you some of the content that's in our public schools. You know, I won't do it. I won't do it because the language our high school kids are being exposed to and most every high school in Metro, Atlanta can't be read from this well. I would not demean this house. To stand in front of George, in front of all you guys and read the words that every single high school kid in the virtually in the metro area can read on titles inside their libraries funded by us, funded by our tax dollars. The F word after F word after F word after F word after F word, describing violent rape in a way that's not even really probative to history. We agree that the stories of slavery and the awful history of our past need to be told. Thank you for that. Thank you that we tell those stories. But these fiction novels that are just these dystopian, it's just dystopian filth. I can't read before Georgians because it's that bad. But our tax dollars are putting them before kids and this minority party has the arrogance to suggest parents should be able to raise their hand and have an appeal to the principal to adjudicate that. Mr. Speaker, this is not about book banning. This is not about book burning. This is about the public trust. The idea that school leaders are scared. The only thing that anyone should be scared of is that they have an agenda to hide that they don't want parents to see what their kids are reading and the public to know about it. There is a political agenda here and I'll conclude Mr. Speaker by saying that political agenda has nothing to do with conservatives that simply want transparency. I wish every single book on every single shelf in the public schools of Georgia could be seen by every single citizen that wants it. The facts are the opponents to this bill don't want that. The opponents of this bill want to have an elite that's determined whether it's through some special degree or some special appointed position to have sole access, not just to make the decisions. They are the decision makers. We're not taking those decisions from school people. We want them to make the decisions but we go in the shelf. What we simply want through SB226 is that for the parents and the public who have access to see it. Opposition to SB226 is the proposition that neither parents nor the public should see it. And with that Mr. Speaker, I urge your favorable vote on SB226. Chair recognizes the Speaker Pro Tem of the House. Speaker Pro Tem Jones to speak to the bill. Well thank you Mr. Speaker. I once again I wasn't planning to speak until I listened to all the rhetoric and I just wanted to point out a few things. I heard this. We have people who believe they are experts and that's where this is coming from. Well you know who most of these experts are their parents and how dare they have an opinion. How dare they be given a time frame to rely on to be heard. How dare they receive or apply when they object to materials. How dare their elected officials have to make a decision on something that affects their children. I guess that makes them experts. What matters is what's in administrators hearts and teachers hearts, not parents hearts who want to disrupt our public institutions. I heard that. Parents hearts. I don't know that I've heard a more pointed and offensive slap at parents in my 20 years of sitting in this chamber. Public institutions exist for the benefit of the people they serve. I call them customers. Institutions don't exist for the benefit of themselves or frankly their employees. The employees exist to serve the customers and that's our constituents. To be frank, I might personally lightly edit the process timeline in the bill and that might occur during this legislative process. But what I appreciate in the bill is that it provides a definitive process with a beginning and a required decision by the people that these parents elect. I heard this. This bill scares me and saddens me because administrators will feel pressure from those who don't have their best interests at heart. The legislation leaves decision making at the local level. Let me just say that again. The parents actually aren't given the final decision making in this bill. They're really just given a process, transparency and someone has to make a decision. Those who are elected or they've meant well including the administrators. Wow, that's really not something that should scare anyone because they have that decision making ability now and we're not giving it to those experts that scare us parents. It doesn't remove any particular material from the shelves including the book Beloved. Local boards of education reflecting their local communities will make those final decisions on materials. I expect that the city of Decatur School System, those elected officials will make different decisions and do now then say Brantley County School Board and they'll continue to and don't we think that locally elected officials should reflect their decisions should reflect the local communities that they represent not what you want but what the people who elect them want. Let's see what did I hear. It's not about students and I'm but about a political agenda. You know I've learned that's what you say when you can't debate the merits of the words on the paper in the bill but rather you want to scare your own voters in devote. The legislation once again just lays out a process when a parent wants materials reconsidered as to whether they are age appropriate and again it'll be different decisions in the city of Atlanta than it might be in West Georgia and it should be and if you don't like it there's the local public library and there's your own books at home. It requires transparency. Why are you or anyone afraid of transparency? Oh my gosh they might have to post a link to a material that parents object to because the locally elected officials decided, you know we heard you but we don't agree with you we're going to leave it. Is it maybe because you might be ashamed of you you think they might be ashamed of their decision? I mean if you're proud of your decision you think it ought to be in the schools. Post it I wouldn't have a problem with all the materials that are provided in a library being being put on the website. I mean it's their children not yours. I heard the phrases bookbans bookburning incendiary phrases that are designed to obfuscate from the real intent and effect of the legislation and here's what it is. Parents views matter. Parents should and must have a role in their children's education. I hear from the other party frequently that you know we need to give a day off for parents so they can volunteer in their schools. You know what? Parents really don't want to just help out with cookie sales. They really don't. They don't want to only sell wrapping paper. They actually want to have a voice in their own children's education. Please don't try to channel them into what you think are socially acceptable roles. They want to have a meaningful role in their own children's education and I honor that that will be reflected differently in different areas of the state. This bill is not anti-LGBQT. It's not anti-women. It's not anti-holicost. I mean that's kind of clever to say that it might be in the headlines in the A.J.C. But that has nothing to do with the bill. Additionally, local elected control should be respected and it's embedded in the legislation read the bill. It absolutely leaves the final decision-making with the local school board. In closing, the legislation gives parents a voice. Meaningful input and a process for their objections to materials to be followed. In the end, school boards make the final decision and parents receive transparency. I encourage you to vote for the bill. I think it's a good and meaningful step towards giving parents a more meaningful role in their children's education. And with that, Mr. Speaker, I yield the well. Is there any objection to the previous question being ordered? The chair here is none of the previous question is ordered. We're now into the minority report and the chairman's time in Byrul that is 20 minutes each to be allocated as the member see fit. Chair recognizes the minority caucus whip represented to Wilkerson for the minority report. Thank you, Mr. Speaker. I was actually not going to come up today, but I had a few questions and I listened to the passion of debate on both sides and I think I have the connection here. If you look at the bill, because we said we didn't want to talk about the bill, so let's talk about the bill for a second, it amends code section, I guess 20-2-324.6. The internet. And then as Representative Kendrick pointed out, you actually talk about books in 160-4-4-01. I think the disconnect is there already is a process in place for parents to get that input because as a parent, the biggest input we had was not going to our school board, was not going to our teachers, it was going to Mike's child's bedroom. It was going to the kitchen table, we actually looked at the material that we were talking about, that they were studying. If you're relying on the schools to educate your children alone and you only want to go to the school boards, then I think we need to have another discussion. But I think the big disconnect that I'm hearing is the fact that some of us just didn't read the code section that actually applies to. If you had read 160-4-4-01, it's already in law. What we're asking for. What's not in law, though, is if you turn to line 43 and 44, where you have 10 days to resolve that complaint, unless it's mutually agreed upon the parent and the guardian, basically if a parent does not want to give concession for whatever's happening in that school district, it's not going to be mutually agreed upon. So I think that's one of the issues that I think people have with the bill. The other piece we talk about for 12 months, I'm not sure what the intent of is putting a book on there for 12 months. If the school's made a decision and the parents went up the change of the school board and it's elevated all the way up, why do we need to put those books on there for 12 months unless it's just to continue to round people up for the next few months and continue to do that. So I think as far as the bill, that's where I just, I have confusion, I'm voting no, and I would say if we want to amend 160-4-4-01, we start with that. We put the bill in Education Committee, this shouldn't be a judiciary bill, as far as I'm concerned, and then we restart and look at how we make the bill better. If the goal is parental input, then I would say put it with the professionals. I've seen that a lot this session where we're putting bills with masks and education and putting vaccines over here, and the bills are just, we're talking about things that probably the expertise is not there. So I would ask us to go back, look at what representative Kendrick put up there, 160-4-4-01, and see if we can start with that as a starting point versus a code section that doesn't I didn't apply to books, and I yield well. Chair recognizes a representative Matthew Wilson to speak to the minority report. Thank you, Mr. Speaker. Colleagues, since I'm leaving the chamber, I think it's safe for me to admit this, but there's a particular phrase that's really started to grate on my ears, louder and louder every time I hear it. And you know what I'm talking about. I'm sure it grates on your ears too. This bill is a solution in search of a problem. I'm going to get in a little bit of trouble with my friends for saying this, so let me explain myself. I don't mean to say that it's contrived. Almost all the time it's right on the money, but almost all of the time is a lot of times this session. It's a dead horse. We beat so much in this well that it's basically a bottle of glue. So yes, I think it applied pretty well here too, but I'm not going to say it. What I will say is that this problem we've created to solve is evidence of something far more pernicious and pervasive than we're willing to admit. Now just hear me out because I do have a great deal of respect for my friend from Wakeross, though I often question his choice of Nickwear. I do think we can all agree. We don't want our students to have access to pornography in schools. And if I recall correctly, I think we already passed a bill on that. This session, one that I supported. In fact, we've passed a number of similar bills this year, all creating this right for a parent to object. Conceptually, I do think it's a great thing to create more ways for parents to get involved with their kids' education. I know when I was teaching sixth grade, I really would have loved if some of my parents would have taken more advantage of the ways that already exist to get involved. What we're doing here, though, is fostering a kind of adversarial relationship between parents and educators that this bill and those before it this session codify. This process for parents to object to materials and turn our schools administrators into judges and jurors keeps coming up. It seems like the majority is trying yet again to ride that line of pleasing the loudest and\n\nInchreous voices by giving them yet another field to fight on. And just hoping nothing truly harmful comes from it. That's the thing though, it's a really dangerous game that you're playing. But Representative Wilson, think of the children. It's another phrase. It's been one of the most worn out, canned political lines under this gold dome for decades. And here we are again, think of the children. I'm not saying that we don't care about the children. I'm saying that it doesn't take a rocket scientist to draw the line from the anger over school closures during the days before the COVID vaccine. To the political opportunism we've seen at work this session. And the dangerous parts of the path we've taken are the places where we've normalized the fantastical. I don't know if you've forgotten, but one of the majority parties members of Congress representing our state right now rose to fame and prominence by posting about how Nancy Pelosi and Hillary Clinton were running a child prostitution ring. And I'm not laying that at anyone's feet here in this chamber. But she's about to go on stage tomorrow, an hour from here, just before our former president. We have taken the clearly deranged and made it mainstream. And I don't know if you've had the energy after our long session days. This past week or two to watch some of the highlights of the US Senate Judiciary Committee's hearings on the nomination of Katanjee Brown-Jackson, who God willing will be the first black woman ever to sit on the Supreme Court. She is one of the most qualified nominees ever put forward to serve. And she's had to sit and listen to the same people who voted not to certify the 2020 election, insinuate in the most ideologically bankrupt ways imaginable. That she's a secret enabler of child pornographers. It's outrageous. So someone needs to state the obvious here. None of what we do here is happening in a vacuum. We're here considering bills that on their face purport to further our shared goals in public education, but that in actuality pour fuel on this narrative that our kids are under attack. And some are willing to take it a step further and name who's doing the attacking, the radical left, the national mainstream media, or our president. I think I have been called a groomer enough times on social media and in emails this year to share some authority here. I have heard a number of members in this chamber, a number of people who support this legislation say, we've got to address what's going on across the country without actually defining what they're talking about. And we've heard some anecdotes shared, but if we're going to govern off anecdote, let me tell you about how many people in this state have died sitting inside or waiting for an ambulance after their local hospital closed because we still won't fully expand Medicaid. Most of the time when people use the phrase, we got to do something about what's going on across the country. They leave it for the listener to infer what they're talking about. And that's by design, you know, is to try to please the same folks who we've seen in the halls this week clamoring about how the even-handed mental health reform bill that the speakerist championed is a World Health Organization takeover of American democracy. Give me a break. My colleague represented McLaren mentioned this at the beginning of the debate, but I'll put a finer point on this. Where does the buck stop in the Republican Party? You cannot white knuckle the political highway for much longer. Let me be clear. Every day I come down here and I think about what I can do to make things better for every student, for every educator, and every Georgian. It does not require that you squeeze every last drop of power out of the loony bin. I support efforts to keep age inappropriate materials out of our classrooms. I support that. That's why I voted for your bill, aiming to do that earlier this session. But this is part of something entirely separate. And I cannot contribute to this narrative that if left unchecked will completely tear this country apart. Colleagues, I ask you, if you have any decency left, stop making our school kids, our students, your favorite political football, and oppose this measure. Mr. Speaker, I'll yield for a question. You do not have any questions. Thank you. I yield the well. Gentlemen, as yielded the well, Chair recognizes to speak to the minority report, Representative Bowdie. You have eight minutes remaining. Thank you, Mr. Speaker. So we're here again. We're here again with another bill that injects conservative ideology into K through 12 public education. SB 226 is an attack on a society that is beginning to talk about diversity and inclusion. SB 226 is another class rule six citizenship bill that will put even more pressure on our school principals and teachers. SB 1084, the size of a divisive concepts bill would pass this house earlier this month by two votes was the first classroom citizenship bill. Now, these classroom citizenship bills are not a new development in Georgia as you have heard. And as you research, book banning bills and the divisive concept bills are starting to become the national norm with over 36 other states passing these type of bills within the last year. So I look at SB 226 and HB 10804 as a package deal. This is a package deal from Alec and other conservative think tanks out of Washington DC manufacturing. So an issue and a problem so Republicans can have something to fight for in champion doing an election year. But my question would be why not fight to a span Medicaid to provide affordable healthcare for over 600,000 judges and to create jobs in Georgia. Why not fight for raising the state minimum wage in Georgia from $5.15 so we're not tied for the lowest minimum wage with the state of Wyoming. Why not fight to a span economic development initiatives and solutions for rural Georgia instead of creating another blue ribbon committed to make recommendations. That's what the majority party has been doing for the last 18 years. And when one Republicans figure out how to provide broadband internet to rural Georgia. Oh, I forgot we got a study committee for that too. So why not address the real problems facing everyday Georgia's because that takes hard work. It takes innovation. It takes thinking outside the box to fix the problem. It's easy to rather the savers a year for the mountain top what the problem is or if that's a problem. But it's also just as easy to create a problem instead of fixing the real problems. The classroom six-year package has opposition from the Georgia Association of Educators. It has opposition from pretty much every civil rights organization. And it has opposition from some progressive mind and manned parents in the state as well. This past year many of these parents here in Georgia across the country watch their schools become better turf over mass mandates, vaccines, and inclusive education. Local conflict wars or cultural wars. But some of these political scientists and historians state that these bookbabs resemble censorship campaigns that could strike at the very core and heart of democracy. Classical censorship bills leads entire communities without having an opportunity to be involved in the conversation on public 12. K through 12 education. Censorship bills like this leads teachers having to tiptoe around discussion so LGBTQ plus people in our state. Black people in our state. Lytto people in our state. Jewish people in our state. Asian people in our state. Native American people in our state and women. So these classroom citizenship bills also affects our AP courses in our state. AP teachers were sent a reminder of programed principles that they must adhere to. If instructions is sent sir the college board says students can end up losing AP credit. Now saw for SB 226 affecting high school students and their AP courses I have another huge problem with this bill. It puts all the pressure on one person to make the determination what is in bounds and out of bounds as far as being obscene. It puts it all on one individual a person who is not elected to make that decision. So I ask you why why are we here again why are we dealing with another Alec two for one package deal. Because this is what the majority party wants to take up. So I want to talk a little bit about HB 1084 before I sit down because this is just not another political bill. The passage of HB 1084 was personal for me. I was born and raised right here in Atlanta Georgia which is the birthplace of Dr. Martin Luther King Jr. So as an APS elementary school student I enjoy going to the King Center every year for I annual trip to the King Center. I enjoy my teachers showing me eyes on the prize documentary on the real to real film projector. I love when my teachers had me in my classmate to read books about the March and Washington and I have a dream speech. So I love and respect and cherish the legacy of Reverend Dr. Martin Luther King. Now there's an article that I read last November from the insider and that was a complaint. First complaint filed in Tennessee on this new citizenship law which basically was looking to ban a book teaching Dr. Martin Luther King Jr. The 11th place complaint filed by the Williamson County Branch of the conservative parent school moms for liberty. And that's that Dr. Martin Luther King Jr. and the March on Washington was a set of lessons promoting anti-American, anti-white, anti-Mexican teachings at the school district in South Nashville. The conservative group moms for liberty filed the complaint on June the 30 of 2021. A day before the law was set to go into place in the state of Tennessee. So I asked my Republican colleagues here in this caucus, in this chamber who voted yes to HB 1084. Please don't say you're a mind Reverend Dr. Martin Luther King Jr. in your speeches and interviews. Please don't say you respect this position on civil rights. Please don't say from the well of the house next February doing black history month that Dr. Reverend Martin Luther King is a great citizen when you failed to protect this legacy. When you voted yes to HB 1084. So a lot of my Republican colleagues are probably a little uncomfortable right now and some probably do not care at all. However, some topics that get people fired up in this state more than the Georgia Bulldogs is the legacy of Dr. Martin Luther King Jr. So I can see the headline after this bill at HB 1084 passes, Georgia Republicans banned MLK Bulls for K through 12 schools in Georgia. Mr. Speaker, I yield well at this time. Okay, that was good timing. All right, we're going on now to the chairman's time. That's 20 minutes by rule. The chair recognizes chairman, the members should to speak to the chairman's report. Thank you, Mr. Speaker. Colleagues, I regret that the first bill of the day has turned out like it has, but here we are. Well, I'm going to line by line through this bill and talk about what the bill does. And talk about what the bill does not do. But in a broader statement, it appears to me that opponents of the bill have been arguing that it's not a good policy to have parents involved in determining what their children are to see at school, which is a tax payer funded. Political subdivision, which blows my mind that that's actually the argument being made. We do not want our parents to have due process. We do not want our parents to make a decision as to what they see and hear in school. And I was thinking about reading one of these passages when I came up here to talk. And I'm not going to do that. But it is clear in this bill two things. One, obscenity or obscene language is not protected speech. It's not protected speech. Nowhere, the Supreme Court has dictated that. The reason this bill was in my committee was because this is a legal standard. And we have used that legal standard for what obscenity is. In this measure and it's determined by the locals. Ultimately, this retains local control. It was pointed out that we have laws in place that require this process. But like we have done time and time again, both parties, that is a very ambiguous law. It says you must have a process, but it doesn't say what the process is. So this is merely clarifying the time frames when you can challenge and when you must have rendered a decision. That is it. That's what it's doing. It's clarifying the law. And one of my colleagues left the well saying that in a very ominous voice and that testifier is now running for state office or house, I guess house seat. Well, it appears to me that many of the speakers in the well today are running for state wide office. Because we talked a lot about things outside of this bill. So colleagues, I certainly appreciate this debate, but the day is long already. And we have many measures to take up. I will not bore you with my comments. I would appreciate an affirmative vote on this bill. Thank you very much for the time and Mr. Speaker, I yield the well. Gentlemen, as yielded the well, is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. What purpose does representative Buckner rise? Parliamentary inquiry. All throughout this conversation, there's been a lot of talk about local control. But I have tried to find out from others if it's about local control and the system that's in place now is working for a school system. It appears that this preempts that system that's in place now, that they will have to adopt whatever we pass here now. They will not really have local control. Is that not true, Mr. Speaker? If the lady so states, I'm sure she believes that to be true. All right, we're going to go ahead and vote it. Have all members voted? Have all members voted? I'm advised by three people that the member was here voted and then quickly left. Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 226. The eyes are 97. The nasor 61. This bill having received the requisite constitutional majority is therefore passed. What purpose does chairman Berkshire rise? To make a motion. State your motion. Make a motion that we immediately transmit to the governor's office for signature. See, I can't recognize you for that motion. Thank you. So, what purpose does Representative Wilson rise? Make a motion. State your motion. Mr. Speaker, I move that we reconsider. Representative Wilson has moved that the House's action be reconsidered. That will be put on the calendar for the next legislative day and taken up at that time. Okay, clerk will read the caption to Senate Bill 543. Senate Bill 543, Senator Halpern, 39th parent of 42nd Jones, the 10th Jordan of the 6th, Drickland of the 17th to be entitled back to amend chapter 4, title 51 of the fiscal to Georgia and until the relating to wrongful death, still survive that apparent whose determined to be responsible for the homicide of his or her child should have no right over recovery against the value of the child's life, this bill I'm referring to the committee on judiciary. That committee recommends that this bill do pass. Chair recognizes chairman Rich to present the bill. This House will come to order. We're still taking up the rules calendar. Lady May proceed. Thank you, Mr. Speaker. I will be brief. Ladies and gentlemen, I bring to you Senate Bill 543. This bill clarifies an ambiguity in our code making it clear that a parent who kills his or her child cannot recover or pursue a claim for the wrongful death of that child. Title 19, our domestic relations code, provides that a parent has the right to recover for the death of his or her child. Our torts code, title 51 also provides that the right to recover for the death of a child is provided for in title 19, the code that I just previously referenced. Our probate code, which is found in title 53, contains what we call the slayer statute, which provides that a person who kills another person cannot inherit from the victims of state. So this bill, Senate Bill 543, revises titles 51 and 53 to clarify that the slayer statute limits and prevents the title 19 right of a parent to recover for his or her child's death where that parent has killed the child. Clarifying our code in this way will save future grieving parents from having to litigate this issue against a parent who has killed their child. And with that, Mr. Speaker, I will yield for any questions. Yes, I do. Chair recognizes Chairman Eftration to your left for a question. Well, the lady yield. I will. Madam, isn't it true that this is necessary because there are horrific circumstances where potentially a parent is actually what in common law we call the slayer statute. And that because of ambiguity in the law, that either that parent or in the case of a murder suicide, that parent's family that committed the murder could potentially be able to recover from that horrific crime. Yes, that is correct. And isn't it because of that this legislation is needed and I thank the chairwoman for carrying this important bill. Yes, it is. Thank you. You're welcome. Do you further yield? No, Mr. Speaker. I will yield the well and I just request your favorable consideration. Thank you. Ladies and gentlemen, as you yielded the well, we have another member who wishes to be heard on the bill. The chair recognizes the dean of this house, Dean Smiley, to speak to the bill. Mr. Speaker, ladies and gentlemen, the house. I just want to come and first of all, thank you chair chair lady, Rich for this bill. This is to me one of the probably most important bills I'm going to vote on this session. I'm going to ask you to please vote yes. I've experienced this situation where there has been a murder and a suicide in a family. And I'm just going to ask you to vote yes. This is a tough situation and I've talked to the family yesterday and I told them that I was going to feel worried and they text me this morning and thank me. And this is always life is so precious and I want to thank chairwoman Rich and Senator Halpert and Representative Estration and others who have worked on this. Sometimes we have vote on legislation that has tremendous effect upon families and the fund people that we represent and this is one that touches me and touches those that are around me and this is a tough situation but I think this is something that we can all be proud of and be happy with and with that as a speaker I appreciate this opportunity and the members of this house and at this time I will use the will. Thank you. Thank you Dean Smirri, it's not all the ones that not always the ones that make the news that matter. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of Senate Bill 543. The eyes are 156. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. This house will be in recess for lunch until 2.30 p.m.",
  "updated_at": "2026-02-13T22:57:39.603387+00:00"
}