{
  "video_id": "q9Y3YDWb1ec",
  "url": "https://www.youtube.com/watch?v=q9Y3YDWb1ec",
  "title": "Rules Day 38 of the 2025 Legislative PM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 3,
  "summary": "# Georgia Rules Day 38 of the 2025 Legislative PM Session\n\n## Overview\nThe session focused on passing several bills with little substantive debate or notable moments. The main action was a substitute amendment to SB 298 that expanded legislative immunity and privilege.\n\n## Key Actions\n**SB 162**: Amended to clarify anesthesiologist supervision requirements\n**SB 298**: Substitute amendment added legislative immunity and privilege provisions\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Chairman Levitt explained the substitute amendment to SB 298, expanding legislative immunity and privilege\n\n## Votes\nNo recorded votes detected\n\n## Attendance\nQuorum was present, no attendance issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified.",
  "transcript": "questions. Okay, do I hear a motion have a motion in second is in opposition. Okay, it's on Senate bill 130 have a move in second. Any opposition? It's on. Okay, on your desk, you'll have a\nto Senate Bill 162, LC-339816S.\nGo on a call on Chair Lady Cooper to explain that to us.\nThank you, Mr. Chairman.\nOn page five, about halfway down,\non line 110, that, as I said,\nthe anesthesiologist assistants\nwould be under the direct supervision\nof duly licensed physician.\nAnd that's not they are under the supervision and it should have been an anesthesiologist and we changed that one word.\nOkay. You've heard that change. Any questions? Okay. On Senate Bill 162 by Substitute, is there a motion?\nNo, no.\nHave a motion and a second any opposition? It's on. Okay. Senate Bill 191.\nmove in second any opposition it's on Senate bill 199 moved in seconded any\nopposition it's on Senate bill 201 moved in seconded any opposition it's on Senate\nbill 213 moved in seconded any opposition it's on Senate bill 241 moved in\nseconded any opposition it's on Senate bill 293 moved in seconded any\nopposition? It's on. Okay, on your desk you should have a copy of Senate Bill 298,\nRule Substitute, LC481601S, and that's Chairman Levitt to explain that. So,\ntoo. Thank you, Mr. Chairman. This is an amendment to or change to the Senate\nuntil $298, it came through the Judiciary Committee\nand this is a bill basically that would have allowed\nfor a direct appeal on, well out for a direct appeal\non cases where sovereign immunity had been pled\nand the court had ruled it did not apply.\nAnd so the local jurisdiction or the state\nor whoever was asserting sovereign immunity\nwould have a direct appeal.\nWe added in committee legislative immunity.\nAnd then we also took an extra added legislative privilege.\nSo the committee, the rule sub, adds legislative privilege\nand pulls all that into a separate section\nto make it clear that that particular right of appeal\napplies in civil and criminal cases\nand does not have to be, well, it has to be exercised\nwithin than 30 days of any judgment or a ruling.\nyou're not limited just one if it's legislated privilege or\nimmunity because that could arise multiple times in a case\nin the course of discovery and that's what I'm saying.\nSo that's the substitute, Mr. Jim.\nOK, you've heard the explanation or any questions.\nOK, don't see any questions.\nIs there a motion?\nNo.\nIt's been moved and seconded.\nAny opposition?\nIt's on.\nThat sets our counter.\nThat should keep us busy for a while this afternoon.\nThank you all.\nThank you very much.\n",
  "updated_at": "2026-02-12T17:23:24.774437+00:00"
}