{
  "video_id": "QAZ5esDi6Kk",
  "url": "https://youtu.be/QAZ5esDi6Kk",
  "title": "Georgia House - Day 34 (2026-03-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 34,
  "video_date": "2026-03-17",
  "duration_minutes": 79,
  "summary": "Here is a summary of the Georgia House - Day 34 (2026-03-17) session:\n\n**Overview**:\nThe session began with a somber acknowledgment of the recent senseless violence that claimed the lives of 8 people, most of whom were Asian-American. The House took time to remember the victims and offer prayers for their families and friends. The rest of the session focused on routine legislative business.\n\n**Key Actions**:\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\nThe session opened with the House Chaplain, Pastor Billy Smith, delivering a message on the importance of attitude. He used personal anecdotes and biblical references to emphasize how one's attitude can impact their life and relationships.\n\n**Votes**:\nNo recorded votes took place.\n\n**Attendance**:\nA quorum was present, as all members reported to their seats and voted to signify their presence.\n\n**Adjournment**:\nThe session adjourned. No information was provided on the date of the next session.",
  "transcript": "They are convening, having arrived, all members of the House will please report to their assigned\nseats.\nAll members of this House will please report to their seats, the clerk will ring the bell.\nYou\nAll right, we're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber\nand the clerk will unlock the machines.\nAll members voted have all members voted\nIf so the clerk will lock the machines\nDoorkeepers will please close the doors and keep them closed\nI usually begin by wishing you a good morning, and we'll do that, so good morning.\nBut I know this morning that I share with you the outrage and the shock and grief over\nthe senseless violence which claimed the lives, yes to afternoon, of eight people, most\nto whom were Asian-American.\nAs a society, we cannot tolerate this lawlessness.\nOnly evil can walk into a small business and wantonly gun down innocent people.\nThere will be plenty of opportunity to determine motive and all the circumstances surrounding\nthese hideous crimes. Our justice system will work. But today is a day to remember. It's\na day to remember the lives of eight people to mourn their loss and to lift up their family\nand friends in prayer. May God bless and comfort them during this most difficult time. Thank\nThank you very much.\nWe will begin our day now with Scripture reading and prayer by the chaplain, after which we\nwill pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 131st House District\nRepresentative Beth Kemp, Representative Kemp.\nGood morning.\nThank you, Mr. Speaker and members of the House.\nPastor Billy Smith is a friend to everyone.\nHe is one of the most humble people that I know.\nWhen I asked Pastor Billy if he would come and speak with us\nand send me his bio, he simply sent me three sentences.\nLike I said, he is very humble.\nPainting on the wall of the massive entry space\nat the new church building, it was just finished last summer,\nis the phrase saved people, serve people.\nAnd it commands attention.\nPastor Billion, his team, and the members truly\nlived by this message.\nI came to know Pastor Billy because I\nwas a volunteer in the backpack program, which\nChristchapel orchestrates, it's a multi-faceted outreach program, and they help kids who\nhave food insecurity. Kids who don't have food on the weekends, and these volunteers\ncome and they love and we pack this food, they bring it to the schools, and very discreetly\nis this food given out via teachers and school buses. During the pandemic, Christchapel\ncovertly delivered many roles of toilet paper. Maybe not because people needed\nthe toilet paper, but as a way to show that they were being thought of.\nPastor Billy and his team wanted to share the good news even during the pandemic.\nSo one Sunday morning I received a text from a dear friend saying if you want\nto come to church come to the field across from the school. And when I got there\nI was shocked. There were hundreds of cars. Everyone had their windows down and they had every speaker they possibly could\nso everyone would have an opportunity to hear the good news of the gospel.\nChrist Chapel loves people and encourages community building by serving others as Christ showed through his example\nBoth spiritually and temporally. The scripture comes to mind, Matthew 7-20.\nwherefore, by their fruit, ye shall know them. Billy Smith does not have to tell\nothers about his church. He simply shows them. Billion his wife Tina started\nChristchafel Community Church in Zebulin in 2003. Christchafel has about 2,000\npeople attending in services. His family consists of his wife Tina, of course,\nand four beautiful children, Cole, Laney, Max and Ruby, and at this time I would\nto introduce Pastor Billy Smith.\nI almost had to hug my representative\nto make it to the podium there.\nHey, good morning everybody.\nIt's great to see you.\nThanks for the leadership\nfor allowing me to be here today\nand for my representative for the invitation.\nI'm a stickler for rules,\nsays five minutes. You can go ahead and start your clock. I'll be done on time.\nI was just asked by my church to make sure I took an offering up before I left. I said, I don't think.\nI don't think that's going to happen up there. Be careful if you want to be asked back, right?\nBut there is an old proverb. He who is short-winded shall be heard again.\nAnd that works for us on the weekends around our place.\nSeveral weeks ago I was upstairs at our house and I was given my two youngest\nchildren the what-for. They're 11 and 9. If you have kids at age you know that\nthey compete. Everything's a competition from who can dress the quickest, who\ncan eat the fastest, who can get the car in the car, you know first, then I was\njust talking to them about their attitude. They'd really been at each other and\nI told them some of these things that I think are important. I said hey you're\nattitude can make or break you. And your attitude can heal or hurt you. It'll make you friends or to make you enemies.\nYour attitude can make you happy or miserable. It can make you a success or failure. And when I got done talking to him, I felt really good about myself.\nI'm like, that's a good, bad moment. Until I went to descend the stairs back to the main floor of our house and I was overly convicted about talking to my kids about their attitude when mine had been pretty sorry lately.\nThere's a story of an old grandfather who was having a couple of his grandkids over\none weekend and he was going to take a nap.\nThey had been out playing but they came in and they found some Lynn Burger cheese.\nI don't know if you know about that but it stinks.\nAnd while he was napping they put it on his mustache and when he woke up he just kind\nof jolted and said, man this bedroom stinks.\nHe walked out into the hallway and slammed the door and then declared that the hallway\nstunk as well.\nWent into the parlor of the living room and said the living room stinks.\nWent outside to the porch and took a big breath thinking he would get a clean breath of\nair and then declared the whole world stinks.\nBut it didn't.\nThe grandfather stunk.\nHe had to own that.\nAnd often when it comes to my attitude, I'm pointing to people around me and I'm really\nthe problem.\nThere's some things about attitude today that I want to share with you just briefly that\nI think are important in our office every now and then somebody will come in in the morning\nThey'll have a rough day maybe a rough commute or maybe they had an argument with a spouse\nBefore they got there and and they say these words I just got up on the wrong side of the\nBed I love it when they say that because I'm always prepared. I want you to go home\nI want you to undress get in the bed\nroll over, get up on the right side of the bed, read, dress, and come back to work\nbecause we want to work with the attitude of Christ with all that we do at our\nchurch. Just three things quickly. Number one, your attitude reveals the real\nyou. I don't like that. I don't always like the way I respond, but that's what's in\nmy heart. Proverbs says this in the 23rd chapter, for a man thinks in his\nhard. So he is. My heart exposes my attitude. There was a guy in education, a teacher who was\ndoing an illustration for his class and he brought in a Mason jar, a canning jar for\ny'all who are in rural areas like I am. And he filled it up with water and he left the lid\njust loose on it. He walked into the classroom and he began to shake it violently and he said,\ndoes anybody know why does this water come out of this jar and one of the\nstudents raised her hand and said yes because you didn't tighten the lid and\nhe said you're right another student said it's because you're shaking it\nteach if you would just quit shaking it it would stop spilling out another\nkid said no it's science you know it's gravity you shaking the can and and\nwhen you shake it it rises and what rises falls it's just coming out and he said\nwell all of you are right there's a bigger picture water is coming out of the\nbecause water is what's in the jar.\nAnd unfortunately, when we're shaken in life,\nthe real attitude and the real heart is exposed\nduring those difficult seasons of our life.\nWhen we are shaken, what comes out of us is who we really are.\nThere was a man working on a project at his house one day\nand he had a bunch of people watching.\nThey were admiring his work and he was hammering away\nand he hit his thumbnail.\nI don't know if anybody's ever done that before,\nbut he hit his thumbnail and he kind of danced around\nand he kept saying, Jesus, Jesus, Jesus, Jesus, Jesus.\nAnd I don't know that it would have been the first thought\nthat came to my mind, but that was what he was saying.\nAnd somebody asked him,\nhe said, why do you keep saying that?\nHe said, because that's what's in me.\nWhat's in us during difficult times\nis exposed on the outside of us.\nNumber two, attitude determines the success and failure\nof every relationship we have.\nWhether that's with our wives or husbands or spouses\nor kids or friends or coworkers,\nall of those relationships are either strengthened\nstrengthen or they're weakened by good or bad attitudes.\nAnd the Old Testament in the book of Numbers,\nthere's a guy named Moses, maybe you remember him,\nwho went up on the mountain, got the 10 commandments,\ncame back down, then the Israelites\nout of Egyptian captivity,\npretty important Old Testament guy.\nBut he had some family members\nwho had a really bad attitude, Miriam and Aaron.\nNow, their excuse for the attitude was\nthat he had married outside of their tribe,\nbut that was just their excuse.\nThey were really jealous that Moses had been given permission\nGod to lead. See, the leaves on the tree were, hey, you married outside of the\ntribe, but the root was jealousy. Here's what I'm trying to say today. Is there\nfamily relationships, our work relationships? All of those are determined where\nthey're going to be good, bad, poor, or healthy based off, based off our attitudes.\nThe third and final thing is this. Attitude is always our choice. Nobody controls\nour health and our emotions, but us. It's always our choice. Often you'll\nhear people say, I just had a bad day. Well, those circumstances don't determine\nyour attitude. We do. I love a guy one time who was asked the question about his\ncollege career, about his academics. They said, were you in the top half of the\nclass? And he said, no, I'm sorry to say I wasn't in the top half of the class,\nbut I'm happy to announce that I was in the part of the class that made the\ntop half possible. Right? There's summa cum laude and then there's thank you\nlotto. Has anybody with me this morning? Right? Just thankful I got out. But his\nattitude was this, you know what? I didn't finish in the top half, but I did\nfinish. There was a holocaust survivor named Dr. Victor Franco. Endured the\nunimaginable. When he got to the concentration camp, they took his clothes\naway from him. They took his watch. They took his wedding ban that his wife had given him on his\nwedding day and they tried to take his dignity. But what they couldn't take was his attitude.\nHe says he survived not because he was stronger than everybody else but because he had an attitude\nthat reflected joy, hope, and positivity. One last thing and then we're going to pray together.\nEvery morning, across this nation, two birds leave looking for a meal.\nOne's a vulture, and he's looking for things that are dead and rotten and things that smell.\nAnd guess what? He finds it.\nBut over the same deserts in our country every day, hummingbirds also leave looking for a meal.\nThey're looking for something that's sweet and something that's fresh and something that's good and wholesome.\nthem. And guess what? They find it. And I think today when it comes to my attitude and yours,\nit sounds like a, this sounds like a kids church sermon doesn't it? But the more I talk about\nattitude, the more I realize it isn't for kids. It's for grown folks like me. I'm just asking you\ntoday to evaluate throughout the day how you treat people, how you honor people, how you love\nand care for people. Today is the anniversary of my dad passing away. He passed away one year,\nwhen you're a go-to-day, have his towel in his honor.\nI wanted to do that today.\nOne thing my dad left me, we weren't rich,\nwe were just rural middle-class family,\nbut he taught me you get up every day.\nYou treat people fair, you treat people right,\nand you determine your own attitude.\nI'm just asking you to do the same today.\nLet's reflect the attitude, the heart, and the mind of Christ.\nThank you so much for an opportunity today.\nWill you battle and let's pray?\nFather, today, thank you for this house and what it represents.\nWe have an incredible nation and a great state, and I'm so proud of what's happened here\nover the course of the last year during a very difficult season.\nMaybe our country's most difficult.\nMan, but the hardship and the perseverance has done nothing but make us stronger and make\nus better.\nI pray for every house member who's here today.\nI pray for their families and their homes.\nI pray that you bless them and you keep them safe.\nAnd I pray those things in Christ's name.\nAnd we all say together, amen.\nWe're going to do the pledge.\nAllegedly, we just feel the flag of the United States of America\nand due to the Republic for which\nAnd one nation under God, indivisible, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of a previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, a cup of Irish blesses for you today.\nMay the good Lord take a liking to you, but not too soon.\nIf you're lucky enough to be Irish, you're lucky enough.\nWords to live by.\nChairman Hogan, the Chair of the Committee on Information and Audits reports that the\nThe journal, the previous legislative day, has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Brown's on a 59, who's following me establishes the order of business during the first\npart of the period unanimous consents, introduction of bills and resolutions, first reading in reference\nof House bills and resolutions, second reading of bills and resolutions, reports of standing\ncommittees, first reading and reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day? The chair here is none and the resolution is adopted. First reading of\nbills and resolutions, a clerk will read.\nHouse Bill 761 by Robson, a car to this 92nd Kendrick of the 93rd, Davis of the 87th,\nDrenner of the 85th Taylor of the 91st and others, Bill Beton and act to amend the act,\nprovide a new charter for the city of life.\nIntergovernmental coordination.\nHouse Bill 762 by Robson, Maynard of the 56th, Thomas of the 65th, Evans of the 57th,\nRobs of the 52nd, more of the 95th and others, Bill Beton and act to create the Fulton\nTechnology and Energy Enhancement Authority.\nIntergovernmental coordination.\ncentral 763 by wraps of hill, the third and\ncentral atmosphere, 17th qualifying act,\ncement in a creating the office commissioner\nof ratusa country medical coordination to 764 by wraps and\npill, the third and lows act authним the board\nor they excites over development and other powers.\nThe intervention lacking coordination,\nfestival 7655.\nKey set the third and 70 and a bill, to create the\ndiscuss county public facilities\nmr gober mental coordination hosted\nspeed 766 by wraps and the good handwriting,\nof the second bill be ton of knack to authorize Catoosa County Georgia\nGovernmental Coordination House bill 767 by rips of year to the 150 second\nof bill be ton of knack to amend the knack to the authorize the\nmagistrate court of Lee County charge of law for governmental coordination\nHouse bill 768 by rips and Apollo 32nd of bill be ton of knack to amend the\nknack to provide a new charter for the city of Royce the\nintergovernmental coordination House bill 770 by rips and a broth of the 7th\nof bill be ton of knack to authorize the assessment and collection of\na technology feed by the magistrate court of Gilmer can\nIntergovernmental Coordinations Bill 771 by Representative Thomas 39th Wilkerson in the 38th\nAllen in the 40th and Ella with the 42nd Williams in the 37th and others Wilmington and\nact to men and act brought a new charter for the City of Allstale.\nIntergovernmental Coordinations Bill 772 by Rose in a park in the 101st Clark in the\n100th and 8th Kendrick in the 93rd we're into the 96th McLeod of the 105th and others\nWilmington and act to reconstitute and reestablish the Board of Registrations and Elections\nfor Gwyneth County Church.\nThe Intergovernmental Coordination.\nHouseples, 773 by Robson of Park on the 101st,\nClark on the 108th, Kendrick on the 93rd,\nMarin on the 96th, McLeod on the 105th,\nand others, Wilby Todd on the act to amend the act\nto provide for a Gwyneth County Board\nof Registration and Electroordination.\nHouseples, 392 by Robson of Singleton on the 71st,\nKirby on the 114th, and Williamson on the 115th,\nResolution Honour in the Lives of Master Sergeant Mark\nAllen and Sergeant Mike Stokeley\nand dedicating the road there.\nTransportation.\nHouse Resolution 393 by Representative Smith of the 18th and Kelly the 16th.\nResolution honoring the life of Mr. Bradley Scott.\nBrad Vines and dedicating a road in his memory.\nTransportation.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse of the 755 by Representative Meeks of the 178th, the bill to amend and act to create\na board of elections and registration of Pierce County.\nHouse bill 756 by Representative Meeks of the 178th, the bill to reconstitute and reestablish the Board of Elections and Registration of Pierce County.\nHouse bill 757 by Representative Wynn of the 89th, Holland of the 54th, Canada of the 58th, Mets of the 55th, Dryer of the 59th and others, the bill to amend the Atlanta Urban Enterprise Zone Act.\nHouse bill 758 by Representative Davis of the 87th, Scott of the 76th, Maclough of the 105th, McScoffield of the 68th, the bill relating to inspection of public records, House bill 759 by Representative Petrie of the 166th.\nBill to authorize the governing authority of the town of Thunderbolts, Levy and X-I's tax, House Bill 760 by Rep. Park of 101st Clark of 108, the Kendrick of the 93rd and brand of the 96th, the McLeod of the 105th and others, a Bill to amend and act creating a board of commissioners of Gwinnett County, House Bill 769 by Rep. Matthew Eck of the 73rd and Knight of the 130th, a Bill to amend and act to provide a board of elections for Spalding County, Senate Bill 21 by Senator Jones of the 10th Butler,\n35th Anderson of the 43rd to build to amend and act to incorporate the city of stone crest into cab county\nSenate bill 287 by Senator Payne of the 54th Anderson of the 24th to amend and act providing a new charter for the city of\nEton Senate bill 290 by Senator Teckman of the 4th\na bill to amend and act providing for the compensation of the Board of Education of Evans County 3 Second Readers\nReports of standing committees the clerk will read\nRepresentative Robert Dickey, the 140th District Chairman of the Committee on Agriculture and Consumer Affairs submitted the following report and speak to your committee on Agriculture and Consumer Affairs.\nSo, on consideration of following bills of the Senate, to instruct the media report the same back to the House of the following recommendations.\nSenate Bill 49 do pass, Senate Bill 195 do pass, Senate Bill 247 do pass, Senate Bill 262 do pass.\nRespectfully submitted, Senator Robert Dickey, the 140th district chairman.\nRepresentative Matt Dupnick of the 29th district chairman of the Committee on Education submitted the following report.\nThe speaker committee on education, Senate on consideration, the following bill, the Senate, and\ninstructive me to report same back to the House of the following recommendations.\nSenate Bill 159 do pass by substitute.\nrespectfully submitted, Representative Matt Dupnick of the 29th District Chairman.\nRepresentative Cooper, the 43rd District Chairman of the Committee on Health and Human Services submitted the following report.\nTo speak to the Committee on Health and Human Services, his head on the consideration of\nfollowing bills of the Senate, which is a struck committee report to send back the vows following recommendations.\nSenate Bill 46 duPASS, Senate Bill 164 duPASS, Senate Bill 256 duPASS, respectfully submitted.\nRepresentative Sharon Cooper, the 43rd District Chairman.\nRepresentative Lomston, the 12th District Chairman on Committee on Insurance Submitted the following\nreport, to speak to your committee on insurance as I don't consideration to following bills\nin the Senate.\nThe District Committee reports the same back to the House of the following recommendations.\nSenate Bill Lady, do pass by committee substitute.\nSenate Bill Lady, do pass by committee substitute, respectfully submitted.\nRepresentative Eddie Lomston, the 12th District Chairman.\nRepresentative John Corber, the 174th District Chairman on Committee on Motor Vehicles,\nsubmitted the following report.\nWe speak to your committee on motor vehicles,\nas set on the considerations following bills of the Senate.\nIt's just struck to me to report the same back\nto the House filing recommendations,\nSenate Bill 165 to pass by committee substitute,\nSenate Bill 225 to pass by committee substitute,\nrespectfully submitted,\nRepresentative John Corbett of the 174th District,\nChairman.\nRepresentative Allen Powell of the 32nd District\nChairman on the committee on regulated industries,\nsubmitted the following report,\nand speak to your committee on regulated industries,\nSenate on the consideration to following bills of the Senate.\nThis is struck to me to report the same back of House following recommendations.\nSenate Bill 27, new pass, Senate Bill 114, new pass, Senate Bill 145, new pass, Senate Bill 219, new pass,\nrespectfully submitted.\nRepresentative Alan Pyle, the 32nd District, chairman.\nThat completes the reading of the Reports of Standing Committees.\nthis house will come to order. House will come to order. We are about to go on\nto morning orders and we've got a number of people that have signed up so not\neverybody's going to be reached today. If you have signed up and you're in the\ngallery or in 341 you need to be making your way on over just in case you are\nreached. But before, before we have morning orders, the chair wants to recognize our newest\nHouse member, Representative Angela Moore from the 90th House District. Welcome to the\nGeorgia House.\nGoing on now to morning orders, Chair recognizes for a morning order.\nIf you have no interest in the morning orders, that's fine, but just step outside in case\nthere are people in here that wish to hear them.\nrecognizes for a morning order, Chairman Mandy Ballinger.\nThank you, Mr. Speaker.\nYesterday, on March 16th, a violent disturbed man perpetrated a heinous series of murders,\nkilling six Asian women and two whites.\nAs a former victim advocate, my heart goes out to the victims of this senseless act.\nMy job at the time was used to be to assist victims of crime like this.\nI am intimately familiar with a sense of staggering loss and long road to recovery, as family\nand friends of the lost face.\nBut I have confidence that Georgia's prosecutors will hold this man accountable for these heinous\nacts.\nassisted by the tools given to them by the General Assembly,\nsuch as the hate law we passed last year.\nLet us have a moment of silence to remember the victims.\nThank you.\nChair recognizes representative Charlise Bird\nfor a morning order representative bird.\nGood morning. I stand here to bring light to the tragic events that occurred\nyesterday evening. It is heart-wrenching to think of the families of those\nmany of whom were women were killed and injured at the shooting that happened\nat the Asian-owned run business in Cherokee County, my own district.\nThis is a horrific event and I am thankful to the Sheriff's Office\noffice who quickly identified and apprehended the suspect. I too live not far from these tragic\nevents that happened. First and foremost, I am an American, but I proudly recognize my Chinese\nheritage and my culture every day. My dad, a full-blooded Chinese, married my mother who is Irish\nEnglish in New Orleans, Louisiana, in 1949. Something very unheard of in those days.\nAnd in fact, it was called a mixed marriage. In fact, the Chinese population was\nrelatively small because of the Chinese Exclusion Act signed by the president\nauthor in 1882 and was not repealed until 1943. I really didn't think much about being Chinese\nuntil my siblings and I started elementary school. We didn't look like everyone else. Our skin\ncolor was different with dark, slanted eyes. At recess, the boys most cruel by pretending to\nshoot us with machine guns, that's what we heard on most days at recess hurtful\nyes painful yes scars yes we too suffered by the people who are ignorant and\nfilled with hate obviously kids back then heard discussions at home about World\nWar II and the horrible Japanese people, thus the beginnings of prejudice right in your\nown home with your own family.\nI certainly, my parents taught me to embrace our differences, stand strong and never let\nanyone get the best of you.\nI was also reminded this morning of words in our Bible study,\nsticks and stones may break my bones,\nbut words will never harm me.\nBevin Jean, my parents, taught us Jesus\nloves the little ones, red, yellow, black, and white.\nMy prayers go out to the family of the victims,\nAnd I hope they get the justice they deserve.\nPlease join me for a moment of silence\nfor all of these victims for the senseless crimes\ncommitted last evening.\nMr. Speaker, I will yield the well.\nChair recognizes representative Noel Williams\nfor a morning order.\nThank you, Mr. Speaker.\nI rise today wanting to, of course, say how sick\nand we all were to what happened yesterday afternoon\nand in the evening.\nAnd I just wanted to commend my sheriff in Crisp County\nand the Georgia State Patrol of Eggs at 101.\nBy doing the duty that lies nearest, they protect us.\nAt 3 o'clock this morning, my sheriff had a phone call.\nThey apprehended the subject on I-75 this morning.\nAnd I just want to say to you all how proud we are of our law enforcement, our Georgia State Patrol.\nThere does not a day goes by that we do not need to thank them.\nAnd we are certainly certainly sickened by what happened yesterday.\nAnd may God hold them in the palm of His hands.\nThank you.\nto recognize his representative will wade for a morning order.\nGood morning. I rise today to pay honor to my father.\nHe passed on Thursday night but right now he's he's he's in heaven and to those\nreps that are from the Sumter County area and the making city of making and\nthen myself being in Dawson County that was the history that my dad and his\nlegacy had in this state his family settled in Sumter County in the 1700s but\nBut today I rise to tell you that I'm thankful for the man that taught me to feed love and\nstarve hate.\nHe showed students who lived in homes in my community that still had dirt floors in the\n70s and 80s that they could do anything that they put their mind to.\nHe was an educator.\nRoy Wade was the tallest man in Dawsonville.\nat six foot nine in his heyday, every child looked at him as a giant, but he was gentle.\nMy message is for you today, especially given the events of yesterday, ring true and what\nmy dad taught me.\nAnd I want to share it with you and remind every one of us of the message that he taught\nmyself and my brother and every student that ever had his fifth grade in my class.\ninto this. Good Lord made all of us in his image and what he made is beautiful. And I\nlook to each of you, each of you are beautiful because you are what God has made. Do your\nbest. Feed love, star of hate. Thank you. Let us pause for a memory of my father. Thank\nThank you.\nChair recognizes Chairman Petri and the Chatham County delegation for a morning order.\nYou, Mr. Speaker, we rise today to wish everyone a happy St. Patrick's Day.\nThis is the second time in history since 1824 that we have not had a St. Patrick's Day\nparade in Savannah, but the people of Irish heritage will always celebrate our patron\nSt. Patrick who brought Christianity to the people of Ireland.\nI also want to make a special thank you and recognition of the honorable Don Hogan who as I understand it was there with St. Patrick as he drove the snakes out of Ireland.\nThank you, Mr. Speaker.\nChair recognizes representative win for a morning order.\nFifty seconds remaining.\nThank you, Mr. Speaker.\nI'm here today to talk about the horrific and violent tragedy that took the lives of eight people at three different Asian businesses in Cherokee in Atlanta.\nOf those eight victims, six were Asian-American women.\nWe don't know the details of the shooting or the motives of the shooting, but we do know in the last year that hate crimes against Asian Americans have increased by 150%.\nAnd of those hate crimes, 68% of them are directed towards Asian-American women.\nThis is a result of xenophobic rhetoric.\nThe labeling of the COVID-19 virus has been longing to or as the fault of China and other\nAsian people.\nSo today, I want to remind us that there has been this history in this country of excluding\nAAPIs, including an exclusion act directed towards an entire continent, the incarceration\nof Japanese-American, the violence against Chinese real workers, and we have been taught\nas Asian-Americans to keep our heads down because our parents believed it was safer for us.\nBut what's happened is that we are now invisible, and when things happen to us, people don't\nspeak up until a tragedy like this one occurs.\nIt is invisibility that hasn't shielded us from hate crimes, xenophobia, or gender-based\nviolence.\nAnd we saw all of these intersections happening yesterday.\nIn the next few days, our priority is getting resources in support to victims of the families\nand respect their needs and their confidentiality.\nAnd we know there is a lot of fear in the Asian American community right now, and we're\nworking together to support the greater community as a whole.\nAnd my ask of this chamber is to stop and call out any xenophobic rhetoric to condemn hate\nagainst any community and to keep these victims and families in your thoughts and prayers.\nThank you, Mr. Speaker.\nI yield the well.\nTime for morning orders, as expired.\nWe are going on now to the rules calendar, going on to the rules calendar.\nPlurker read the caption to House Bill 703.\nHouse Bill 703, members of the math, is the 144th being taught on that to provide the future\nElections for the office of probate judge of blackly county shall be nonpartisan elections\nThis bill I'm refer to the committee on inter-gobble coordination that committee recommends that this bill do pass\nChair recognizes representative mathis to present the bill. Thank you speaker\nMembers of the house. I bring to you house bill 703\nIt's a nonpartisan bill for the probate judge of blackly county just to provide a nonpartisan election\nThe probate judge of that county solicited me to bring this bill.\nWe have a sole commissioner in that county.\nHe fully is in favor of this.\nMr. Speaker, I would ask that they would give us a good yes vote and at this time I will\nyield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered?\nThe chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass\nAll those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines\nhave all members voted what purpose does the majority caucus whip representative Kelly rise mr\nMr. Speaker, parliamentary inquiry.\nState your inquiry.\nMr. Speaker, isn't it true that the judicial canons\nthat all judges are required to follow make clear\nthat they're not supposed to interject any party biases\nwhen making their determinations and thus,\nthis is aligning the canons that they swear to with,\nwith what they're doing.\nThat is my understanding.\nWhat purpose does the minority caucus\nwill representative Wilkerson rise?\nParliamentate inquiry.\nState your inquiry.\nIs it not true that there is no disagreement on that?\nThat this could easily be fixed by making every judge,\nmagistrate, and probate court judge across the state,\nnonpartisan, we could do that in one quick billing.\nBe done.\nI'm sure the gentleman believes that to be accurate.\nWe're not going to debate this any further.\nHave all members voted?\nHave all members voted?\nhave all members now voted if so the clerk will lock the machines on the\npassage of House Bill 703 the eyes are 105 the nays are 64 this bill\nhaving received the requisite constitutional majority is there for past\nclerk will read the caption to House Bill 704\nHouse Bill 704 by members of the Mathes of the 144th B.\nTallahnack to provide the future elections for the Office of Chief\nJudge of the Mastery Court of Blackly County shall be nonpartisan\nelections.\nMs. Bill them for the Committee on Intergoble Coordination.\nThat committee recommends that this bill do pass.\nChair recognizes representative Mathes to present the bill.\nThank you, Mr. Speaker.\nAgain, members of the House.\nI bring to you House Bill 704.\nIt's to provide for a nonpartisan election\nfor the Belectic County Chief Magistrate,\nChief Magistrate and Belectic County approach me with this.\nOur sole commissioner is fully behind this.\nI would appreciate your yes vote.\nMr. Speaker, I yield a well.\nGentlemen, as yielded the well,\nis there any objection to the previous question being ordered?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report\nthe committee which was favorable to the passage of the bill. The chair here is\nnone the report of the committee is agreed to shall this bill now pass all those\nin favor of the passage of the bill will vote aye those opposed will vote no\nand the clerk will unlock the machines\nhave all members voted have all members voted if so the clerk will lock the\nmachines on the passage of House Bill 704 the eyes are one hundred and three the\nnasor 68 this bill having received the requisite constitutional majority is\nis therefore passed.\nClerk will read the caption to Senate Bill 43.\nSenate Bill 43, Senator Brass, the 28th.\nMulles, the 53rd Miller, the 49th Albers, the 56th,\nJane of the 47th and others,\nthe Natal and Act to amend Code Section 33, 6, 4,\nthe Fisherhood of Georgia Annotated Group,\nrelating to the enumeration of unfair methods of competition\nand unfair or deceptive acts or practices and penalty.\nthis bill ever refer to the committee on insurance, that committee recommends that\nthis bill do pass by committee substitute.\nChair recognizes representative Gamble to present the bill.\nThank you Mr. Speaker.\nMembers, I rise today to ask for your support on Senate Bill 43.\nThis is a bill that the optometrists and the ophthalmologists see eye to eye on, which\nas you know is somewhat of a rarity.\nSenate Bill 43 prohibits insurers from requiring optometrists and ophthalmologists from being\nmandated to give discounts on non-covered materials or services.\nFor example, many vision plans mandate that doctors provide a discount on a second pair\nof glasses when the second pair is not covered by the vision plan.\nThis bill would outlaw the mandate, but doctors of optometry can still choose to offer\nthe discount at their own discretion.\nThis is modeled after similar legislation that was passed in 2011 for non-covered dental\nservices.\nAnd in short, Senate Bill 43 would give greater flexibility for businesses to choose\nhow they offer these discounts to their customers.\nSo with that, Mr. Speaker, I would ask for the body's favorable consideration Senate\nBill 43, and I'm happy to stand for any questions.\nYou have no questions.\nThank you.\nIs there any objection to the previous question being ordered?\nThe chair here is none the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to shall this bill now pass.\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nwhat purpose does the minority\nleader rise yeah pursuant to\nHouse rule 133 asked to be\nexcused from this vote.\nGentlemen has that right in the\njournal will so reflect have all\nmembers voted have all members\nvoted if so the clerk will lock\nthe machines. On the passage of\nSenate Bill 43, the eyes are 152\nthe nays are 17. This bill having\nreceived the requisite constitutional\nmajority is therefore passed.\nClerk will read the caption to Senate\nBill 88. Senate Bill 88 by Senator\nGoodman and the H. Action. The second tip is\nthe 37th Sims of the 12 Burns, the\n23rd and others. The title of an\nact to men chapter 2, title 20.\nIf it's going to Georgia annotate it really in the elementary and secondary education.\nSo it's to provide that the Georgia teacher of the year shall be invited to serve as an advisor\nex officio to the state board of education as bill have inferred the committee on education.\nThat committee recommends that this bill do pass.\nChair recognizes representative Lorickia to present the bill.\nThank you, Mr. Speaker.\ncolleagues I rise to present Senate Bill 88, and like many of you, I'm sure you have\na teacher that had a tremendous impact on your life.\nAnd for me, that teacher was my sister with being a public educator for almost 40 years\nand she still teaches school today, and she was born to be a mother and an educator.\nAnd you've heard the story of Representative Will Wade's dad, a giant of a man at six\nbut nine and teaching fifth grade math and I needed a man like that teaching me\nmath because I was struggled a little bit but with the help of this legislature\nsince day one governor camp has championed education and specifically in the\narea of recruiting and retaining our teachers and that's what this bill does\nthis bill has six parts and first this bill would allow the Georgia teacher of\nthe year to serve as an advisor and ex officio member of the state board of\neducation. Next Senate Bill 88 supports and enhances a pathway for our veterans to become\nalternatively certified teachers. This bill would also utilize an excess of observational\nresources for new teachers or teachers who need a little extra observation. Some of those\nhigh performing teachers that have had a history and long record of being a quality educator\ndon't need to be observed as much and they can use those resources for new teachers or\nteachers that need a little bit of help. It also improves differentiated instruction and\nreading instruction for future teachers, especially new teachers, with those at-risk\nstudents, some that may have learning disabilities or even for advanced students. And finally\nthis takes this enhances historically black colleges and universities role in teacher\npreparation and programs to make sure that the teachers that are standing in front of\nthe classroom are representative of what the communities look like where they're leading\nthese children. So Mr. Speaker, this bill speaks for itself. If there are no questions,\nI would ask for your favorable consideration. You do not have any questions. Thank you,\nMr. Speaker. I'd appreciate your favorable consideration.\nIs there any objection to the previous question being ordered? The chair hears none. The previous\nquestion is ordered. Is there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill.\nThe chair here's none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor\nof the passage of the bill?\nWe'll vote aye.\nThose opposed will vote no.\nAnd the clerk will unlock the machine.\nhave all members voted, have all members voted, if so, the clerk will lock the machine on\nthe passage of Senate Bill 88.\nThe eyes are 171, the nays are one.\nThis bill having received the requisite constitutional majority\nis therefore passed.\nClerk will read the caption to Senate Bill 182.\nSetable 182 by Senator Robertson of the 29th Albers of the 56\nPayne of the 54th Harper, the 7th Anderson of the 24th.\nWe title an act to amend chapter 60,\nTitle 36, the official go to Georgia Annotary,\nrelating the general provisions applicable to counties,\nand municipal corporations,\nso as to find the term,\nBens Detection System,\nthis bill I refer to the committee on government affairs,\nthat committee recommends a dis bill, do pass.\nChair recognizes representative Gullet to present the bill.\nThank you, Mr. Speaker.\nSB 182 is identical language to House Bill 130,\nwhich we passed a couple weeks ago.\nAs you may remember, this bill brings uniformity to the permitting process for battery-powered alarm security fences are designated as non-residential.\nThis bill allows businesses to protect their assets and property in a timely manner.\nGMA and ACCG have been involved with the legislation and are good with the legislation as written.\nMembers, I ask for your favorable consideration of the bill.\nAnd Mr. Speaker, I yield the well.\nThe gentleman has yielded the well, is there any objection to the previous question being\nordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to shall this bill now pass all those in favor of\nthe passage of the bill will vote aye those opposed to vote no and the clerk will unlock\nthe machines. What purpose does representative al Williams rise? Parliamentary inquiry.\nState your inquiry. Is it not true? It's a speaker that the champion of low-voltage\nrepresentative Hawkins had nothing to do with this bill. If the gentleman so states I will\naccept his comments there have all members voted all members what purpose\nis representative Bayes Moore rise thank you mr. Speaker\ncomment your inquiry is it not true that this bill will you serve local\ncontrol I think that's just a matter that each member is going to have to\ndecide for themselves all right one more parliamentary inquiry if that's what it\nis to what purpose is represented or chairman he's Clark rise parliamentary\ninquiry isn't it true the earlier we had some bills dealing with local control\ndeciding on how to do their elections and some of the people that are voting\nnow voted no then because they wanted a statewide mandate dictating to the\nlocal's how to run their governments.\nI'm sure the gentleman believes that to be true.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the passage of Senate Bill 182.\nThe eyes are 100 and three, the nays are 70.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe'll read the cap to the Senate bill 140, Senate bill 140.\nSenate bill 140 by Senator Mulles, the 53rd hatch of the 50th miller of the 49th harvest\nin the 15th walker of the 20th and others, be tunneled act to men, Chapter 3, Title 50,\nthe fiscal of the Jordan Annettate, everything in the state flag, seal in other symbols, so\nThose are provided replacement of the monument and honor of the honorable Zell Brian Miller\nupon the capital of grounds, the state capital building.\nMs. Bill Evans referred to the Committee on State Properties, that committee recommends\nthat this bill do pass.\nChair recognizes Speaker Ralston to present the bill.\nThank you, Madame Speaker.\nIt is my honor to bring before you today Senate Bill 140, sponsored by the Senate Rules\nChairman.\nThis measure enjoys a long bipartisan list of co-sponsors, including the President,\nProTIM, and the Minority Leader in the Senate.\nIt was unanimously passed by our colleagues in the State Senate.\nBill 140 would erect a statue or other monument on our capital grounds in memory of our 79th\nGovernor and former United States Senator, Zell Brian Miller.\nZell Miller has been called the Governor who gave Georgia Hope more than 1.9 million students\nhave been able to attend college through Georgia's Hope Scholarship Program.\nmore than 1.6 million four-year-olds have attended Georgia's pre-kindergarten program.\nIn total, the Georgia lottery has generated some $23 billion in funds for education in\nour state.\nZell Miller had a vision of a state where your opportunities were only limited by your\nwillingness to work for them.\nHe was a man who, both as an elected official in the United States Marine, was guided\nby resolute moral compass and an unyielding belief in the value of hard work and the power\nof education to change lives.\nFor those of us fortunate enough to have known him, Governor Miller had the heart of a line,\nAnd at the same time, the stubbornness of a mountain mule.\nBut in the mountains at Zell, and I call home, there are fewer traits, more praiseworthy,\nthan having the courage of your convictions, and having a good independent street to stick\nby them regardless.\nHe's the only individual, and probably the only individual who could have, he noted both\nthe Democratic and Republican National Conventions. And when I attended his funeral in 2018, along\nwith Dean Smiley, we saw him eulogized by three count of one, two, three former presidents\nof the United States from both political parties. In the last three or four years of his life,\nI made a point of visiting with him two or three times a year at his home.\nNot because he needed company, he had plenty of that, but because to be with him made\nme better, and I learned so much during those visits.\nIn the man from Young Harris, Georgia got a leader who stood above partisan politics and\nyet enjoyed as much as anybody, the give and take of the battle.\nAnd Zell Miller, Georgia, got a leader who looked down that dusty dirt road he often talked\nabout that ran through young Harris.\nAnd he saw that as a road to a brighter future for this state and particularly its children\nand a road that could take you all over the world.\nMadam Speaker, it is for these reasons and many more that I ask every member of this\nHouse to join with me in honoring a favorite son of our state, Governor and United States\nSenator, Zell Bryan Miller, and I ask for your favorable consideration on Senate Bill\n140. I know others want to speak to the measure and I yield the will.\nThe gentleman has yielded the well. The chair recognizes Representative Williams to speak\nto the bell.\nThank you Madam Speaker.\nThere are many in here that knew Governor Miller with the exception of probably the speaker\nbecause of his age.\nFew knew him longer than I did.\nI made him in 1972 on the floor of the Democratic National Convention when he was executive\ndirector of the party.\nThat was a volatile convention.\nThat was the very first convention that the governor did not pick delegates to the convention.\nAnd it was a tight rope to walk, the jail miller walked brilliantly.\nWe formed a friendship.\nA few years later he came and asked me to help him run for Lieutenant Governor, which\nI willingly did.\nThe pay was fantastic and occasional Coca-Cola in May, but Hamburg on a good day.\nBut he was, when he was elected, he did what had never been done before.\nHe made the Lieutenant Governor's office look like Georgia.\nI was the first African-American session aide to lieutenant governor in Georgia.\nIn that first session, I met a young guy who had a huge afro, a long car, and he walked\nin replaced Moses, I was Dean Smarrick, and then that group of us, he hired two African\nAmericans, administrative assistants, Elizabeth Martin, and Lillian Lewis, the widow of John\nLewis. He was a mountain populist, and I knew nothing about mountain populists until I got\nto know him. Yes, he was dubbing as a mule. But I was used as a sacrificial lamb a couple\nof times. When he was really hot and he and the speaker were a speaker murphy where\nat each at arms, he'd send me to take the message to the speaker. I think he knew I was the\nmost expendable person in the office.\nI'd go over, he'd give me this rip-raring message,\nnot written out, I had to repeat what he said and he'd say,\nyou tell him just like I said it.\nAnd I'd walk in and when I'd tell the speaker to speak\nand look at me and said, I know he didn't say it like that.\nAnd he'd said, see God of his mouth,\nbut you tell him just what I said when I got back.\nHe'd ask me what he said, not water it down.\nHe said, hell will you if you're a liar.\nBut he had a heart of gold, but he was a liar.\nIn his later years, many of you, particularly Democrats,\nwho remember only him speaking at the Republican National\nConvention in some of the candidates he supported.\nBut I remember the zeal miller that created an atmosphere that makes it possible in many\nways that this capital looks like it looks today.\nHe had a genuine love for people, and one of my most treasured items is the wedding gift\nhe gave to Olivia and I 43 years ago, this coming decently, but above all else.\nHe had one of the strongest wives I've ever known in my life, and that was Shirley Miller.\nNow you talk about a lady, she was strong.\nAnd because this state has always been like that, it didn't pay cost to law officers and\nespecially legislators, what they were worth, hand-hand.\nIt was a very low pay for Lieutenant Governor's.\nBut he was available.\ntime ever heard a country song was in his office and I didn't know what the\nworld that was he was playing and I said what is that he had a love for\ncountry music like you wouldn't believe I'm not going to ever forget him I know\nvery few people more deserving of a statue at this Capitol in Zell Brian Miller\nBut a giant of a man, or a dear friend, or my misforever, I urge you to vote yes to this\nresolution.\nThe fan, Madam Speaker, I yield the well.\nThe gentleman has yielded the well.\nThe chair recognizes Representative Smari to speak to the well.\nSpeak to the bell.\nHow you doing?\nThank you Madam Speaker, it's a pleasure for me to come today and speak on Senate Bill\n140, Zebra and Miller, and I want to say first that I talk with Shirley Miller maybe two\nor three times a year and his grandson, Brian, and have a relationship with the Miller's\nAnd one of the biggest honors I've ever received,\nI think you received it in 2018,\nthe Turtle on the Fence Pose award.\nAnd I received it in 2019,\nwith the Zell Miller Foundation.\nAnd I really got to know Zell Miller\nat the early, early time.\nI met him in 1975.\nIn fact, that gentleman right there, from the 168th district, set up the meeting.\nHe was a staffer at that time, Lieutenant Governor Miller.\nAnd I went to CM and we've had a relationship and a friendship since that time.\nAnd he's been said that he's been stubborn and we had a great, great relationship, Governor\nMiller.\nAnd sometimes we had some very, very spirited comments.\nHe was, that would be on the mile side.\nBut he is, in my opinion, one of the most consequential\ngovernors in the history of our state.\nAnd if you've never heard it, I think you ought to listen\nto his 1993 state of the state of dress.\nis one of the most courageous, timeless,\nand prophetic messages.\nI've listened to it maybe six or seven times.\nAnd in that speech, he talks about leadership.\nAnd he talks about the state in the fall of moving state.\nAnd he talked about, for the first time,\nchanging the Georgia state flag, which was very courageous.\nI could almost call him his election,\na one by 30-some thousand votes at that time.\nAnd after he won, he called us in one day\nand said, you know what?\nHe said, Georgia needs hope.\nAnd he came up with the Hope Scholarship Program.\nThat was not the first time I heard the word hope and lottery.\nGuy named John White, state representative down\nand all being a representative.\nWe just remember, talked us about a lottery.\nAnd, but Zeal talked about it.\nGov.\nAnd Moe talked about the lottery.\nAnd he said, what we ought to do is\ndesignated money for the future of our state,\nand invested in the intellectual capital\nof the young people in our state.\nWe keep our best and our brightest in our state.\nAnd so, Zell Miller, in his book written by Richard Hyatt,\nthe governor who gave Georgia hope,\nas one of the best reads I've read,\nand it talks about his entire life.\nAnd so I want to come this morning and say, in 1991,\nI remember I was on the committee.\nThat time, how you it was called\na University System of Georgia Committee.\nAnd I went on later to chair that committee.\nAfter Dubos Portal was, at that time,\none of his flow leaders, and he handled the legislation\nin hope, and I think Representative Joe Green\nrepresented Butch Parish, and represented Mary Margaret Oliver, and\nrepresentative Ellen Powell, I think, with the members that were here in\n19, in that time, I might have missed somebody I apologize, but\nthose are the ones I can remember that we're here when we passed, when we\nhad the committee, the bill in the committee, and the University System of\nGeorgia, and I went with ZL when he bought the first lottery ticket on\na great moment for the state of Georgia and the rest is history.\nSo, Mr. Speaker, I'm honored and delighted to come.\nAnd to give recognition to a giant of a man,\na man who gave a lot to this state,\na man who was historic in his governorship\nand remember going to the state senate,\ngoing to lieutenant governor for 16 years,\nyears going to governor for eight years and going to the U.S. Senate for six years.\nHe just was a tremendous governor and a tremendous person and I enjoyed it, rolled out together\nto his, you know, and having a conversation about Zell Miller.\nSo Mr. Speaker, this is very timely and very appropriate that we erect a statue in the\nhonor of a giant of a man, an individual who gave much for this state, and you've heard\nme say this a 100 times, you make your living by what you get, what you make your life\nby what you give, as the another made his life by giving, but that we all be very, very\nthankful.\nSo I'm asking everyone if you would please vote in favor of Senate Bill 140 so that we\ncan move on, get this done, and have the ceremony, and get this family over here, and salute\nto an individual that gave much of his state, and gave much to Georgia, and much to this\nnation.\nWith that, Madam Speaker, I will yield the well.\nThank you.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nChair, here's none. The report of the committee has agreed to. Shall this bill now pass?\nAll in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine.\nhave all members voted have all members voted if so the clerk will lock the\nmachine on the passage of the bill the yeas were 172 the nays were one the\nbill having received the requisite constitutional majority is therefore passed\nThank you.\nMark will read the caption to a group of privilege resolution, honoring the life and memory\nof Woody Jean Neal Persons, honoring the life and memory of Thomas Anderson Andy Roach.\nRecognizing Woodette County District 4 Commissioner Marlene Fosk,\nrecognizing commending the Honorable Colonel Dr. Sam Verneira Jr.\nHonoring the Scott's Miracle Grow Company for its most generous donation for\nface shields to Georgia hospitals across the state,\nrecognizing commending represented Georgia and a T-Sync field,\nI'm recognizing congratulating Dr. Ivan H. Allen\nand for all the purposes at the police\nthrough reading the Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions?\nThe chair here is known and the resolutions are adopted.\nOkay, we're about to go on to announcements.\nBut before we do,\nchair has been advised\nthat today is the 59th wedding anniversary\nRepresentative Holmes, and her distinguished husband, Paul. Congratulations.\nOkay, if you signed up for an announcement, please be ready to go. Chair recognizes\nRepresentative Gilliard for an announcement.\nChair recognizes Chairman Petri for an announcement.\nThank you, Mr. Speaker. I'm Phil and Emperor Petri, Chairman Petri. We will have a human relations and aging committee at 2 o'clock today in room 341, human relations and aging 241 at 2 o'clock.\nChair recognizes Chairman Watson for an announcement.\nThank you Mr. Speaker, rule caucus will meet at 12 o'clock. We've got Brian Hudson as our host and he's bringing some CVS folks and some pharmaceutical folks to talk about that and look forward to seeing you there. Thank you, 12 o'clock.\nChair recognizes representative gullet for an announcement.\nThank you Mr. Speaker just an announcement for government affairs to o'clock today 406 CLAB 406 CLAB government affairs\nChair recognizes chairman jasper's for an announcement\nThank you Mr. Speaker transportation members will be meeting at two o'clock today\nWe look forward to seeing you looking at their senate bills. Thank you chair recognizes chairman\nfrustration for an announcement\nThank you, Mr. Speaker.\nHouse Judiciary members, if you will come to the front of the chamber upon adjournment\nfor our annual committee photo, we also have lunches available for Judiciary members\nin room 132, and the committee will meet at 1.30 today in room 132.\nThank you, Speaker.\nChair recognizes Chairman Worcay's or forward announcement.\nThank you, Mr. Speaker.\nThe Industry and Labor Committee will meet today at CLOB at 3 o'clock.\nThank you.\nChair recognizes Chairman Barr for an announcement.\nListen up, Code Revision.\nCode Revision, we are having a meeting today at 2 o'clock in room 415 CLOB.\nCode Revision, 2 o'clock, thank you.\nChair recognizes Chairman Dollar for an announcement.\nThank you speaker creative arts and entertainment will meet this afternoon the music subcommittee\nThank you\nChair recognizes representative gill yard for an announcement\nThank you, mr. Speaker today is Savannah seafood sample a day if you get a chance stop by room 2 16 at 12 o'clock\nAnd in the words of our Williams brain your own hot sauce low-country balls no crabs\nand we're going to have a good time. Thank you.\nThat completes our announcements.\nThe chair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker. Mr. Speaker, I move to this House standing recess until 2 p.m.\ntoday then stand adjourned until 10 a.m. Thursday, March the 18th, 2021.\nThe majority leader has moved that this house be in recess until 2 o'clock p.m., whereup\non we will stand adjourned until Thursday, March 18 at 10 a.m. All those in favor of the\nmotion will say aye. Those opposed will say no. The\neyes have it. This house will be in recess till 2 p.m. And\nthen we will be adjourned until Thursday at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T13:41:38.08691+00:00"
}