{
  "video_id": "QbF8gs1pMuA",
  "url": "https://www.youtube.com/watch?v=QbF8gs1pMuA",
  "title": "4/20/2023 - Georgia Military Veterans Hall of Fame Unveiling Ceremony",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 44,
  "summary": "Here is a structured markdown summary of the Georgia 4/20/2023 - Georgia Military Veterans Hall of Fame Unveiling Ceremony session:\n\n**Overview**\nThis session was a ceremony to unveil the inductees to the Georgia Military Veterans Hall of Fame for the classes of 2021 and 2022. The ceremony included an opening prayer, the Pledge of Allegiance, remarks from the director of the Hall of Fame, and an introduction of the host, Senator Ed Harbison.\n\n**Key Actions**\nNo specific bills were mentioned or acted upon.\n\n**Bills Introduced (First Reading)**\nNo bills were introduced.\n\n**Notable Moments**\n- The ceremony featured remarks highlighting the accomplishments and service of the inductees to the Georgia Military Veterans Hall of Fame.\n- Several JROTC programs from local high schools were recognized and applauded for their participation in the ceremony.\n- An opening prayer was delivered by Pastor Mark Beatty.\n- The Pledge of Allegiance was led by Cadet Captain Jimmy Holton from Lovejoy High School.\n\n**Votes**\nNo votes were mentioned.\n\n**Attendance**\nNo specific quorum notes were provided.\n\n**Adjournment**\nThe session details do not indicate when the ceremony was adjourned or the date of the next session.",
  "transcript": "And ladies and gentlemen, good afternoon.\nI have some really smart good friends, so Lisa just told me to remind everybody to turn\noff your phones, okay?\nSo thank you, Lisa, for keeping me straight.\nIf you have phones, make sure they're in the off position.\nAs I describe these ceremonies, both, this is an unveiling ceremony.\nMany of you have been to the induction ceremony, which is always held down in Columbus, Georgia,\nalways the first Saturday in November veterans month.\nThe way we describe that ceremony and this ceremony is emotional because your emotions\nare all over the place.\nIt's the happiness of a wedding and the salimony of a memorial service.\nSo I think you'll get the full impact that as we go along.\nLieutenant Governor Jones, Senator to Harbison, distinguished guests, ladies and gentlemen,\nGood afternoon and welcome to the Georgia Military Veterans Hall of Fame unveiling ceremony\nfor the 31 inductees from the classes of 2021 and 2022.\nAlso as Paul's here, we normally have one class at a time, but because of COVID and other\nthings, we're combining these two classes.\nGeneral Wright, right here.\nIt's always good to make an entrance.\nRight on that second row right there.\nMy name is Colonel Retired Rick White and I have the humble privilege of being the director\nof this rare and noble Hall of Fame for our great state.\nthe inception of the GMV HOF in 2013, a grand total of 162 Georgia veterans have\ninducted. In today's ceremony marks the second time that an unveiling ceremony has\nbeen conducted in our beautiful state capital. By the way, I didn't know until\nabout two years ago and Roger Wise informed me and in brief me, this is the\nofficial museum of the state of Georgia. Many of you, I lived your all my life\nexcept while I was in the Army for 31 years. I didn't know this was the\nfishing museum. So when you have a chance today or whenever, enjoy yourself, walk around\nand see this beautiful building as a museum.\nAt this time, I mean, as the program progresses, more information will be provided about\nthe Hall of Fame. And at this time, I will introduce Master Chief, J-R-O-T-C, Master\nChief Petty Osser, Jorge Schisneros.\nHe is the commander of the troops for the ceremony today.\nCommander, please post the troops.\nSamoye Dijon, up, ten, ten.\nWatch him ride! Beats him!\nGo for it! Watch him!\nLadies and gentlemen, I know it's in your program, but I want to just spend special\nrecognition to these three great JROTC programs.\nThe King's Academy, Army JROTC, led by Colonel Rick Steppett, Senior Military Science Instructor,\nNaval J.R.O.T.C. from Alituna High School,\nAkworth, Georgia, Lieutenant Colonel Jeffrey Knudsen,\nSenior Naval Science Instructor, Air Force J.R.O.T.C.\nfrom Lovejoy High School, Hampton, Georgia,\nwith retired major, United States Air Force\nRetired Major, Colleen Murray,\nSenior Aerospace Science Instructor.\nIf this doesn't make you feel good\nabout the youth of America,\nand we hear so many negative things about the youth of America,\nThis is the upside, this is the positive.\nFor that, I'd like to give these young men\nand women a round of applause.\nApplause.\nYou know, most of us grew up saying,\nyes, ma'am, no, ma'am, yes sir, no sir, please, thank you.\nThese people to the person does that.\nI had a good chance this morning to talk to many of them.\nSo polite.\nSo, my hat's off my salute to their instructors.\nThank you so much.\nAt this time, as we always do since 2013, since the inception,\nthere will be no polyphane ceremony or meeting or gathering\nwithout an opening prayer and a closing prayer.\nAnd along with that thing we've established,\nI'd like to introduce,\nlost my notes here.\nIntroduce Pastor Mark Beatty.\nAnd Mark is the, let me find my notes here.\nHe's the pastor of the Holy Trinity Lutheran Church in Marietta.\nAnd no Mark is also the chaplain\nof our John Screek Veterans Association\nand great man, great veteran,\nAir Force veteran, pastor.\nIn thanksgiving and gratitude for this day, let us pray together.\nGod of all creation, God of life, God of love, we thank you for the many blessings you\nshower upon us for the breath of life this day, for the freedom to honor your name here in this place.\nFor the freedom of being able to say openly and joyously, this is the day that the Lord has made.\nLet us rejoice and be glad in it. For love and for life, you have sacrificed for us.\nyou reign and lead by serving and giving. You stand in power and might for the\npowerless and the meek. You are life-giving. But we who strive to be your\nfaithful followers, stray to seek our own ways, our own narratives, our own\ncontrol our own power too often we don't love you like you love us nor do we\nlove our neighbors as ourselves but we are both saint and sinner though we\nstray yet we were created good and you yourself proclaimed it so in the\nword through the power of your word of your grace and through your spirit some\nof us, your children have been called to a unique godly service, beyond the norm of\ncivilian, secular, and culture. Some have been called to serve in selfless sacrifice,\nin leadership that is ultimately serving and giving, being willing to give of their\nvery lives so that others might live abundantly. We remember some of the bravest, the most\nselfless, the most giving, the most faithful and serving of those you have called, and\ntheir acts of courage and godliness through sacrifice and selflessness.\nMay the Georgia Military Veterans' Hall of Fame serve to honor the godly selfless service\nof all those who have been called and named, that their faithful actions might be a witness\nand a legacy of what self-giving love truly is and may the memory of their service be a\nlamp for this nation and a light unto your path as we give thanks to you for each of\nthese precious service men and women. Together as one in your life giving name of freedom\nWe pray, amen.\nCadet Captain Jimmy Holton from Lovejoy High School,\nAir Force Gerald T.C. will now lead us\nin the pledge of allegiance.\nYou may be seated.\nAs you can see in our program agenda, our host for today's ceremony is State Senator\nEd Harbison from Columbus.\nSenator Harbison is the United States Marine Corps veteran, a Vietnam war veteran, the\nrecipient of the Purple Heart for wounds received in combat.\nDr. Harbison was inducted into the Georgia Military Veterans Hall of Fame in the second\nclass in 2014, and is the inducted sweet sequence number is 27.\nOf all the true words that you will hear today, my statement that, without the steadfast\nand passionate support of Senator Ed Harbison, the state of Georgia would not have a Hall\nof Fame for its veterans, and we all thank him for that.\nLadies and gentlemen, Senator Harbison.\nApplause\nGood afternoon.\nThank you so much, Colonel White, for the matchless job you and my good friend Long,\nColonel Long Reddough for veterans in the state of Georgia.\nHello and good afternoon to you all.\nI am so glad to be here today to honor the 2021 and the 2022 inductees to the Georgia\nmilitary of veterans Hall of Fame to reintroduce myself.\nI'm Senator Ed Harbisson, and I am the Senator for the District 15 area of our state.\nAnd the 14th, as you heard, inductee into the Hall of Fame is my greatest honor since\nI've been serving in the Georgia State Senate.\nyou kind of white, direct of this esteemed organization, along with my good friend Roger\nWise, and all members of the Georgia military of Venice Hall of Fame, for allowing me to\nhave the privilege of hosting today's event. I am truly humbled to be here, under the\ngold home to command and pay tribute to the courageous men and women of Georgia who served\nand the uniformed services of our great country,\nthe United States of America.\nThese men and women, bravest they are,\nhave exemplified great valor,\nachievement and service to our nation.\nAnd I'm overjoyed to welcome them\nto the growing list of heroes\nand the Georgia military veterans, Hall of Fame.\nI would like to take this time to welcome our speaker\nfor the ceremony today.\nMy good friend, Lieutenant Governor Bert Jones,\nand the Georgia Department of Veteran Service\nCommissioner Patricia Ross.\nLet's give them a great round of applause a bit.\nApplause.\nIt is an honor to have such highly recognized public servant\nand leaders to be here today to say they appreciate\nwhat you do, what you are, to Georgia, and what you represent.\nOnce again, thank you so much for being here today\nas we honor our Georgia patrons.\nAt this time, please welcome my great friend,\nLieutenant Governor Bert John.\nWell, good afternoon. I hope that young ladies are all right. We have an infirmary here in\nthe capital and hopefully we'll get her assistance right there. I hate that. But thank you young\npeople for being here today and I appreciate everything you're doing. I will be a\nbrief in comments and because I know we do have the largest inductee group, Hall of Fame\ninductee group in the in the history of the Hall of Fame. And so I want to congratulate\neach and every one of you. I want to thank my good friend Senator Ed Harvison. He's obviously\na member of the Hall of Fame himself. He's a retired colonel, Army veteran, and he is an Army\nexcuse me, excuse me, excuse me, excuse me Marine and I apologize to that now yeah good Lord\ngive me a hug you you can vlog me later on round to that but no he's a retired Marine and you\nknow it took and he's such a humble guy it took us several years of he served in the Senate before\nhe started really kind of telling me about stories about him serving in Vietnam and and being a purple\nheart recipient and he's truly a great American and a war hero and I appreciate his service\nnot just to the United States military but to the state of Georgia as well. I'd be remiss\nif I didn't recognize retired Lieutenant Colonel Mike Dugan here who is also serving the\nstate senate, a good friend of mine and colleague and our Commissioner of Insurance, two-star\ngeneral John King. Thank you guys. Let's give those gentlemen a round of applause for\nof their public service, everything like that.\nWe are so fortunate to have so many men and women in this room who are willing to serve\nand who have served, and we want from the bottom of our hearts, we'd like to thank each\nand every one of you for your service to this country and to your service to the state\nof Georgia.\nI had a five star general one time and I was a young man, just elected to the state\nSenate. He was a General Peter Bowling and he was like most five star generals. He\ntold you exactly what he thought about things and he was the president at the time of George\nmilitary college and I never will forget he told me he said you know if it wasn't for\nthe young men and women in this country who are willing to serve a man in this country\na person can go their entire life and not know their coward because of the service and\nthe work that the people in this country do, many women in our military service do for\nthis country, and it, you know, it, it was profound a statement at the time, but as I've\ngotten older, it's really sunk in that we enjoy the, in this country, we take for granted\nthe luxuries that we have and the freedoms that we have as individuals and citizens of\nthis country, and it's all because of the, the men and women who are willing to serve\nin the United States military.\nAnd I just want to tell each and every one of you\nfrom the bottom of our hearts, we appreciate your service.\nWe want to congratulate you on this award,\non being honored and recognized for your service.\nAnd we're so proud to have heading\nour, the commissioner here today, heading our,\nour veteran services up here in the state of Georgia,\nretired Colonel Ross is here today.\nand she is doing a fantastic job.\nShe is someone who retired from the military in 2014\nand she has done an exceptional job\nand I know we'll continue to do a great job\nas in that role as a commissioner of veteran services\nbecause we do have over 400,000 veterans living here\nin the state and it is vital that we cater to their needs\ncater to their needs and she has the resources and we're committed to making sure that she has the resources to do that and\nAnd I'm so appreciative of Senator Harbson for all the hard work that he did to make this possible and\nAnd without without further delay\nIntroduce our commissioner commissioner Ross here today\nThank you, Lieutenant Governor Jones.\nHaving heard you speak several times,\nI have the unenviable position of following you,\nso I am very honored and humbled to be here\namongst such heroes.\nAnd I do wanna tell our young men and women on the stairs\nhaving been in many formations myself\nduring my 25 years in the military,\ndon't lock your knees.\nThat is the key to success.\nOkay, so today we joined together\nto recognize those Georgian heroes\nwho exemplify our core values, those of service,\nintegrity, commitment, excellence, loyalty.\nAnd with less than 1% of our population\njoining the United States military,\nit's important that we take the time\nto recognize these men and women\nwho selflessly gave of themselves.\nWhether it be physically and lands\nacross the globe and in hostile environments,\nor whether it be spiritually and emotionally,\nbecause in war, all are wounded.\nAnd I can say to a person, we faced our demons.\nWhile many would call it resilience\nor the capacity to withstand and recover quickly,\nfrom our difficulties for this group before us,\nthey've not just recovered, but have come back stronger,\novercoming some of the most difficult obstacles\nhumanly imagined.\nI want to thank not only the individuals\nrecognized today, but the Georgia military veterans\nHall of Fame, who recognizes about 15 veterans a year\nof our almost 700,000 veterans here in the state of Georgia.\nThey recognize those that have exemplified what's best\nin all of us.\nAnd while no one joins the military for selfish gain or glory,\nInstead, we join because we believe in a cause\nthat is greater than ourselves.\nAnd I dare say the individuals we're recognizing today\nare infinitely humble and probably uncomfortable\nwith this recognition.\nBut not only do we owe this recognition to these heroes,\nwe owe it to these junior ROTC students here today\nand the hundreds and thousands of school children\nwho will tour this capital and see these photos\nso that they know that we, the state of Georgia,\nvalues our military and our veterans.\nGeorge Washington said,\nthe willingness with which our young people\nare likely to serve in any war,\nno matter how justified,\nshall be directly proportional\nto how they perceive the veterans of earlier wars\nwere treated and appreciated by their nation.\nToday we appreciate these heroes\nwho rushed into the heat of battle,\nmade institutional changes,\nor committed to a life of service\nafter their military time.\nAnd today, we tangibly show the value we place\non the service of our military.\nAnd we make every effort to ensure that they are recognized\nfor doing what so few in our nation have dared to do.\nThat is dawn of the military uniform,\nan answer that call to go wherever the president\nand our nation says is in our national security best interest.\nAnd the words of Bernard Malamud,\nwithout heroes, we are plain people\nand we don't know how far we can go.\nThese heroes here today show us all what's possible.\nHealth Street comes from adversity\nand health selfless service can have a ripple effect\nthat impacts countless others.\nSo on behalf of Georgia's Department of Veteran Service,\nI want to thank you.\nLet me say that again.\nI want to thank you.\nLicensurist, thank you for all that you have done,\nfor our nation, and for the state of Georgia.\nAnd with that, I will turn it back over to Colonel Rick White.\nApplause\nThe commissioner reminded me of something\nWhen she talked about raising your right hand, many of you have heard me say this before\nthat you've gone through listening to me, but I never passed the opportunity to talk\nabout what the Bible says about veterans and military service members.\nOne verse is found in the Old Testament and one verse is found in the New Testament.\nIn the Old Testament, in Isaiah 6, 8, there's two questions in one answer.\nAnd every time a man or woman stands before that officer of enlistment or commissioning,\nthey are in fact in essence quoting, Isaiah 6, 8.\nTwo questions are, whom shall I send?\nWho will go for us?\nThe immediate quick answer is,\nhere am I, send me.\nEvery time a young man or woman raises that right hand\nand takes that sacred life-changing oath\nto join our United States military,\nthey are in fact saying, here am I, send me.\nAnd once they've taken that oath,\nthey fall into the next verse,\nJohn 1513, which I'm sure most of you are very familiar with,\nand it tells what that service man or woman\nis willing to do.\nGreater love has no one than this\nthan to lay down their lives for a friend.\nAnd those friends are you and me and the people they know,\npeople they don't know, people around this world\nthat have asked for the freedoms that we enjoy.\nAnd so many times, take for granted in our country,\nthat's what young men and women do in our military.\nIf you see us soldier to quote Roger Wise, walk up and say thank you for your service.\nIf you see someone that's a first responder, thank you for our safety.\nAs each inductee's name is red, if able, the inductee or a representative of the inductee\nwill stand or raise their hand as their JROTC cadet will present the beautifully framed\nphotograph and citation of that inductee. Please hold your applause until all\n31 inductees have been announced. The inductees' citations that you see in\nthe frames will not be read during this presentation, but rather only their\nname and the categories for which they have been nominated will be\nannounced. In your program is a shorter version of the inductees'\ncitations. For the ten posthumous inductees and those inductees that are\nunable to be with us today, a family member, a friend or another veteran will stand in their place.\nA bell will be wrong for the three killed in action inductees and the seven deceased inductees.\nThis is the first time that this new Georgia military veterans' Hall of Fame bell\nwill have been used in a ceremony. This bell is inscribed and dedicated to all that have given\ntheir lives or freedom and also our POWs and MIAs. The base that this bell's\nrestaurant is in memory of the late quote submarine Mike Kotler. Many years ago\nsubmarine Mike started the tradition of ringing a Navy bell for those of our\ndeceased inductees. Unfortunately Mike passed away just shortly a few weeks ago.\nHis son Alexander Kotler is with us here today from New York City and as we\ndedicate this bell and demonstrate what the bell sounds like. Alex will stand\nbeside the bell as United States Army first sergeant retired, Marshall Huckabee.\nInducty number 89 will now ring the bell as it is now being dedicated.\nThat will be what you will hear when we announce a deceased or killed in action veteran.\nNow we'll present the inductees of the classes of 2021 and 22, 22 along with their frame\nphotographs and citation.\nI'm going to go slightly out of order due to honor and help another veteran who needs\nto make it to the airport.\nInducting number 153 Logan Thomas Gray Service.\nNumber three, number one, three, two, Sparkle, K, Adams, service.\nInducty number one, three, three, Orman, Craig, Fowler, Jr., Vowler.\nOC's wife passed away this morning.\nCommander Fowler cannot be with us today, obviously, standing in on his behalf is his friend\nand fellow Georgia Military Veterans Hall of Fame inductee,\nnumber 1-6-0, Bob Raminelli, inductee number 1-3-4,\nJames McLellan Grimshaw Valor, inductee number 1-3-5,\nThomas, excuse me, Michael Thomas Hall achievement,\nCommand Sergeant Major Hall, they live in Tennessee.\nCity would be here.\nI hope their safety is that he's not here\nand I just hope they're safe.\nInducting number one, three, six, Samuel,\nDavid Hernandez, Valor.\nCommand Sergeant Major Hernandez cannot be with us today.\nStanding in on his behalf is fellow Greenberry,\nChief Warren Officer for Ken Griffith.\nInducting number one, three, seven, Dallas, Scott, Huggins, service, posthumous.\nStanding in on Sergeant Huggins' behalf is his grandson, Cole, Huggins.\nInducting number one, three, eight, George, Marvin, Johnson, Valor, posthumous.\nInducting in on Major General Johnson's behalf is his daughter, Jean Johnson Marion.\nInducting number one, three, nine, Alfred J. Langereth, Valor Pustumus.\nStanding in on Captain Langereth's behalf is his son-in-law, Guy Condra.\n3-1-4-0, John Patrick Newport Service.\nInducting number 1-4-1, Thaddeus Rayman-Sobensky Valor-Postimus.\nStanding in for Colonel Sibensky is Army Veteran and Tomb of the Unknown Soldier, badge number\nNumber 58 and my good friend Larry Cooper.\nInducting number one, four, two, James Michael Sprayberry, Medal of Honor.\nLieutenant Colonel Sprayberry cannot be with us today.\nStanding in on his behalf is the son of the nominator, Andrew Kotler, and his capacity\nAndrew is standing in honor of both the Medal of Honor recipient and his father who we just\ntalked about, the late submarine, Mike Kotler.\nInducting number one, three, excuse me, one, four, three,\nMarion, Edward, Squire, Valor, posthumous, standing in on\nLieutenant Colonel Squire's behalf is his daughter,\nSally, Squire's, Bevel, inducting number one, four, four,\nClark, Jackson, Thomas, Valor, posthumous,\nStanding in on Lieutenant Colonel Jackson's behalf is just nominated, Dan Besenko.\nInducting number one four five, John William Thompson achievement.\nInducting number one four six, Robert Aquin Thomas Valor killed in action.\nStanding in on Captain Thompson's behalf is his son,\nJohn William Thomas, inductee number 145.\nInductee number 147, Larry Dean Wright, valor.\nInductee number 148, Dolas David Bain, valor.\nPrivate Bain, now 102 years old, cannot be with us today.\nstanding in on his behalf is his fellow\nArmy medic and inductee number 1-1-5 Roger\nSergeant Roger Wise inductee number 1-4-9\nKaren Fuller-Branon achievement Colonel\nBrandon cannot be with us today standing\nin on her behalf is fellow Marine\nOfficer Captain Mary Sanders inductee\nInducting number 1-5-0, Armon, Shepo, Service.\nInducting number 1-5-1, Sarita, Y, Dyer, Achievement.\nNumber one, five, two, Alvin, Wilson, Floyd, Valor,\nKilden Action, standing on Sergeant First Class,\nFloyd's behalf is his daughter, Theresa Floyd Haines.\nInducting number one, five, four, Thomas Harder,\nGreer, Valor, Pustumus, standing in major Greer's behalf\nhis widow, Deidre Greer, and his two daughters.\nInducting...\nInducting number 155, Michael Edward Grisham Valor.\nInducting number one five six, Claude Milton Kicklider achievement.\nInducting number one five seven, Travis B. Lee Jr. Valor killed an action.\nStanding in on first lieutenant Lee's behalf is his nominator Ed Woods.\nSoldiers don't cry, but occasionally they get sweaty eyeballs.\ninducting number one, five, eight, Grant, Andrew, McGarry, Valor, Rangers lead the way.\ninducting number one, five, nine, Frank, Sidel, Reese, Valor.\n13 number 1, 6, 0, Robert James Ramanelli, Valor.\nInducting number 1, 6, 1, Walter K. Schmitt, Valor, Colonel Schmitt, call me this morning.\nHe cannot be with us today, standing in on his behalf, the United States Air Force Veteran\nMichael Volosov, inducting number 162, Billy Fowler Wade Vowler.\nSergeant Wade cannot be with us today, standing in on his behalf is his sister, Judy Wade\nStevenson.\nLet us all now welcome these latest inductees of the Georgia Military Veterans Hall of\nThank you all very much for your time, and I'll see you in the next video.\nOthers that are with us today are previous inductees of the Hall of Fame, some of which\nI know that are here some of which have come in since the ceremony began, all other\nin first of all, all in the inductees that were previously inducted past years, would\nyou please stand or raise your hand.\nSome of the many individuals and groups that have made significant contribution to today's\nceremony possible need to be recognized.\nAs I call your name, please stand and remain standing and let us hold our applause until\nall have been recognized.\nMs. Laquithia Tolen, whose team at Georgia Correctional Industries makes possible the\nHassemly-Frame photographs and citations that are presented today.\nThank you, Laquithia, you're a good friend.\nRetired Army Command Sergeant Major, Carrie Dreyer of the Georgia Department of Veteran\nService is our go-to person when it comes to the supervision and handling of the inductees\nframe photographs and flutations in the Floyd Veterans Building.\nThank you, Carrie.\nThank you, Sergeant Major.\nGeorgia Military Veteran Hall and Fame inductee number 1-1-5 is former Army Sergeant Roger\nWise.\nHe is our ambassador to the state government, and he, along with Senator Ed Harbinson, just\nmake things happen when it comes to this Hall of Fame.\nThank you, Roger.\nThe photographer today is Kent Ruby Kent at his own volunteer in Columbia.\nDo you need a photographer?\nYes, I do, Kent, and he's also taking videos, so afterwards people can have photographs\nwith the cadets, groups, whatever,\nand we'll post that on our website and our Facebook.\nMy sincere thanks to all go out to the members\nof the Atlanta Vietnam Veterans Association\nand the Johns Creek Veterans Association\nfor assisting with seating and passenger drop-off.\nThank you, my fellow veterans.\nRaise your hand, you guys that helped us out.\nThank you.\nMy thanks to the Georgia Building Authority\nspecifically Miss Brooke Hamill for her team for today's support here in the\nSouth HM. Thank you, Brooke. Thank you, Brooke.\nIf I have failed to thank anyone else, please forgive me, and if I did, oh, you 50\npush-ups. As I said earlier, we always open and close with prayer at this time\ninducting number 132, Sparkle K-Adams will now lead us in the closing prayer.\nAll hearts and minds clear? Dear Lord, we most humbly thank you for this auspicious opportunity\nto honor the inductees and the families that gave so much to support their loved ones and\nendeavors. Lord, as our friend Winston Mendez reminds us that we must never forget or fail to\nappreciate the investments and the sacrifices of those who gave and who have gone before us to\ncreate and secure our form of government and the God who has given it to us and allowed us to live\nhere. We ask, Lord, to make patriotism a part of our character. Lord, we can all\nimprove by acquiring positive character traits that will bless our entire\nlives as well as our performance for you. We pray for the gold star, mothers and\nfathers who have returned their loved ones to you in the sacrifice of their\nservice. Lord, we thank the state of Georgia. The leaders of this state are veterans, the\nfamilies, the youth that are doing such a wonderful job and are going to carry the torch for\nthe rest of us. And last but not least, Lord, the men and women of the Georgia military\nVeterans Hall of Fame and our fearless leader, Rick White, who gives so much to the life\nof the organizations.\nWe also pray that you put a head to protection around Tommy Clark for healing and comfort.\nAs we leave from this place but not from your presence, Lord, leading guide us with the\nblessings of patriotism, compassion, respect, and love.\nand it's in your name, we pray, amen.\nLadies and gentlemen, this completes the ceremony,\nbut please remain seated.\nAnd like I say, after the cadets,\nyou'll see them come off the stage.\nYou can feel free to get photographs with them.\nWith that, Captain Holden, please dismiss\nthe ceremonial detail.\nCome out of the room.\nThis is the room.\nI serve.\nServe on the detail.\nUp, dead, dead.\nOnce each cadet is off the stage, please feel free to stand.\nOne more time.\nof these great cadets.\nI have a great afternoon and a safe travel home.\nThanks for being here.\nThank you.\n",
  "updated_at": "2026-02-12T20:33:04.850457+00:00"
}