{
  "video_id": "QBZJP_3pokM",
  "url": "https://youtu.be/QBZJP_3pokM",
  "title": "Georgia House - Day 6 (2026-11-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-11-10",
  "duration_minutes": 167,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThis session featured a prayer and scripture reading by the chaplain, Reverend Mark Lawrence, who spoke about being a \"good soldier\" in service to God and country. The session had a focus on military service and veterans ahead of Veterans Day.\n\n**Key Actions**\nNo major legislation was passed or referred during this session. The session focused on the chaplain's remarks.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Reverend Mark Lawrence, the chaplain, gave a sermon emphasizing the importance of being a \"good soldier\" for God and country. He drew parallels between military service and Christian service.\n- The session recognized the late Senator Max Cleland, a veteran, who had recently passed away.\n\n**Votes**\nNo recorded votes were taken.\n\n**Attendance**\nThe session began with a quorum present, as indicated by the roll call.\n\n**Adjournment**\nThe transcript does not provide the specific time of adjournment or the date of the next scheduled session.",
  "transcript": "The floor of the house and take their seats, the clerk will ring the bell. All members will take seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. The clerk will be seated. The doorkeepers will please close the doors and keep them closed. Good morning. Hope everybody is in a good spirit this morning. Beautiful, beautiful day out there. We're going to begin as we do today with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 136th House District Representative Carolyn Hugley. Representative Hugley. Good morning. Thank you, Mr. Speaker. I have the honor of introducing not my pastor but my friend. We have with us today Reverend Mark Lawrence, who grew up in Columbus, Georgia, and he graduated from the GW Carver High School before entering the United States Army. Following his discharge from the Army Reverend Lawrence had a distinguished career in the Department of Corrections until his retirement. He furthered his education on an bachelor's degree in criminal justice, and he later earned a bachelor's degree in pastoral studies, as well as a bachelor's degree in theology. Reverend Lawrence is well-traveled and he has always had an interest in global social justice. He's the author of a book that's called Ungovernable Behavior. Reverend Lawrence has the pleasure of being the husband of the beautiful Crystal Lawrence, and he's the father, one daughter, Erica, and the grandfather of two wonderful grandchildren. He's the proud pastor of the Mount Olive Baptist Church in Fortson, Georgia, and I got permission from Representative Van Smith for him to be here this morning. Reverend Lawrence, a treacherous Christian education, and being a voice in the community for those that cannot speak for themselves. He's a lover of great preaching, teaching, and dividing the word of truth. Our Chaplain of the Day, Reverend Mark Lawrence. Good morning. Thank you, Representative. Hello, I'm Leslie. Mr. Rolston, thank you. Our speaker of the house. I feel honored to stand behind this desk to look out and see so many wonderful people. I want to say that the Lord has made, we should rejoice and be glad in it. So many went to bed last night and did have the privilege to wake up this morning. If you will, want to speak for just a few moments, and it's very hard as a Baptist preacher to do anything in a few minutes. I'm going to do it because I want to come back again. I want to look at something from the writings of the Apostle Paul in the second letter to his son Timothy. In the second chapter, Paul was in a dingy prison, damp. I'm sure cold and dark, but he wrote these words to Timothy. And he said in the second chapter in the third and fourth verse, he said, Dow therefore endured hardness as a good soldier of Jesus Christ, no man that wore the entangles himself with the affairs of this life that he may please him who has chosen him to be a good soldier. I could just talk for just a few moments and I promise you it would just be a few moments. I want to talk about I am a soldier in the army of the Lord. On this eve of veterans day and I salute all of the veterans and all of those our constituents who have served in armed forces. God bless you all, our late Senator Max Cleelan, who went to be with the Lord. We pray that his family, they are being covered at this time. This message is close to me because I know that we all have wars to go through. We have jobs that's almost a war zone sometime. We have positions that put us in places that we really wouldn't like to be in, but we are always receiving the other part that we don't want to see. The late Bill Withers had a song. He talked about bullets, don't look good coming at me, but they sure look better going out the other side. No one liked to be the one that's receiving eat, but I want to tell you about a soldier. A soldier volunteers to go through the battle. He volunteer. He don't know what the next day would bring. We always want to be at peace, but battles come on every side. Dean Smirry battles come on every side, but we must stand up and be good soldiers for the Lord. We have to understand that it's not us. We have to come here to work and it's not about us, but it's the work that we do for others that make our work so much easier. When we understand I'm talking about myself and no one else, that we have to endure hardship as a good soldier, we must understand who we are serving. We do everything that I do, everything that we do. We do it as unto the Lord. I was greeted and I told where I'm from and the Baptist church that I passed her. The person said, another good old Baptist. I want to let you know that God just has us in places. When God put us there, we have to be able to stand up, flat foot it and do the work that He has called us to do. With heart, we have to understand that a farmer, many of you have been around a farm and many of you only go to Pilar Wiggly to the farm section to get what you need. But those who have been on the farm understand that he should have first choice of the seeds that sprouts and come up. He should be able to gleam the fields and his family should be provided with the best that come out the farm because he put his heart working. That's the way it is. When we look at life, we should be able to gleam from the Lord because we are children of God. And we should have the best that God has as for us. What would a good soldier look like for a sinner them this morning? I just want to use the army because I'm a proud veteran of the United States Army. And not saying anything against the Air Force, the Navy, other Marines, Coast Guard, other space force, other national guard forces. But a good soldier is one who would show up on time for duty. He will show up to say that I'm ready to do the work that's needed of me. What must I do today to make everybody fall in place? A good soldier. He will show up on time. A good soldier will not. He will not argue with the commander. He will ask commander, what is my duties for today? Commander, what must I do? And he won't get mad with the commander when he don't give him what he wants. He's not standing up for himself, but he understands who he is standing for. Secondly, it's kind of hard. They said, run, run, but it's kind of hard. Who's qualified for the service? And we know as military service, when I volunteered for service, I was drafted in, I was volunteered, I volunteered to go in. And I had to meet three requirements, three major requirements. I met the age requirement. I met the educational requirement. And I wasn't a person who have had any convictions, so I met that requirement. So it was pretty easy after I passed the AFAD test, the second or third time, I was able to go in. And the recruiters said, well, we'll get you in there. You know, you have to do the rest in basic training. But laughter is better than a medicine. That's what the Word of God tell us. And once I got in there, I knew that I had rooms to follow. And once I followed the rooms, I understood that it's not again. It's not about me. I must follow the rules of those that are in charge. Listen at this. I will close here. I couldn't across the path. Anybody been in the African American Baptist Church when I preach, I say he's couldn't across the path. That means he couldn't out his notes, and he's going to an end right there. Yeah. Romans 12, one and two say, I beseech you therefore, brother and by the mercies of God, that you present your bodies a living sacrifice, holy and acceptable unto God, which is your reasonable service. What is our reasonable service to God today? What is our reasonable service? It's not about us again. It's all about giving God our best. When we find out in our minds that we can only give God what we have. And if we give God our best, we have turned ourselves over to him. We are willing, soldier. The one that was stand up in the battle, even when the darts are flying, words are flying, and things that we don't want to see fly fly by us. But we know that God is with us. He promised that he never would leave us nor would he forsake us. And we have to understand when God said that, we could count on it because we are his soldiers. He's our commander. So what will we do now? Let us stand in prayer. Let us pray. We are grateful and eternal Father. We come to the throne of grace. Say thank you for letting us be in the army of the Lord. Lord God, even in the jobs that we have, even in our positions in life, we know that you are our commanding officer. And Lord, whatever you would have of us to do, let us be led by you and not of our own conscious. Lord, we thank you for just touching us today and bringing us to this place. Lord, we ask that you would just help us. Even as we leave this place and we are joined from here and go other places in life, let us do the work that you have given us to do. Lord God, let us remember the golden rules. Let us love our brother as we love ourselves and let us not be self-centered. And Lord, we are going to be so careful to say thank you for all that you do in our lives. We know that all our help coming from the Lord. And we thank you in advance for anything that you do for us because we know Lord God that we can't do it on our own. We bless your name and Jesus' name we pray. Let us all agree by saying amen. Let us turn to the flag. Amen. Thank you. Dorkypers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and have found it to be correct. And furthermore, Mr. Speaker, this applies to everyone in this house. Be helpful when you see a person without a smile, give him or her years. Oh, that is good. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Ms. Burns, on 59, who has found to be established as the order of business, then the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, the ports of standing committees, third reading a passage of uncedasted local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. Senate Bill 1EX by Senator Kennedy, 18th, cows are with 46, Duke, and the 30th, Gutsch, the 51st, Berkeley, 11th and others. There will be Todd and active revive for the composition and number of states and the tutorial districts. All right, sir. The legislative and congressional reapportionment. A numbered house bill by Robson of Wilson, the 80th and others to be entitled to amend the act to authorize the government authority, the city of Brookhaven, the levy and excise tax. The intergovernmental coordination. That completes first readers. Second reading of bills and resolutions, the clerk will read. House bill 7EX by represent 930th, black one of the 146th, Carson of the 46, 518th, Smith of the 130th and others. Bill relating to revenue and taxation, house bill 8EX by represent scogans of the 14th, the 13th, the 12th. Bill to reconstitute and reestablish the board of elections and registration of Floyd County, house bill 9EX by represent scogans of the 14th, the 13th, the 12th, the 12th. Bill to amend and act to create a board of elections and registration for Floyd County, through second readers. Reports of standing committees, the clerk will read. Rbson, Jan Tancor, the 160th district chairman of committee on intergovernmental coordination, local submit to the following report. We'll speak to your committee on intergovernmental coordination, local. The third consideration following bills the house. It starts to meet the reports saying back to the House of the following recommendations. House bill 3EX due pass, house bill 6EX due pass. It's strictly submitted, Rbson, Tancor, the 160th district chairman. Rbson, a blackman in the 146th district chairman of committee on ways and means submitted to following report. And speaking to your committee on ways and means, is there any consideration following bills and resolution of the house? Mr. Dr. Media reports saying back to the House of the following recommendations. House of resolution 3EX due pass, house bill 7EX due pass. It's strictly submitted, Rbson, blackman in the 146th district chairman. That completes the reading of the report to standing committees. We're going on to the rules calendar. I'm sorry, local calendar, but I knew that gets your attention. Going on to the local calendar, chair has an announcement before we go on to the local calendar. Now that everybody's kind of greeted the minister and said hello to each other this morning. We are honored to have joined us today, a new member of this body. She represents House District 165 in Savannah and Chatham County. Please, what make welcome to the House family representative Edna Jackson. Okay, now we're going to the local calendar. Third reading and passage. Now, uncontested local bills. If there is no objection, we will vote in the local calendar as a whole with a recorded vote hearing none. The clerk will read the local calendar. House bill 3EX by Rbson of 170 seconds. City of Coolidge, House bill 6EX by Rbson of Lomston of the 12th, Shatuga County. Is there any objection to the previous question being made? I'm going to read the last question. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted have all members voted if so the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 100 and 7. The bill is on the local calendar having received the requisite constitutional majority. Are there four passed? The bill is on the local calendar. The bill is on the local calendar. The bill is on the local calendar. Have the requisite constitutional majority are therefore passed. We're going on now to morning orders. So let's remain calm, quiet, respectful to the members of the will. The chair is going to limit the morning orders today since we have a number that have signed up to two minutes each. The chair recognizes for a morning order representative Tommy Benton. Thank you Mr. Speaker. Members of the House, this morning I bring to you some sad news from Jackson County. On Friday, Jackson County Sheriff's Deputy, Lena Marshall entered a call to a house outside of Houston, domestic disturbance. What she walked into was a lady who was claiming to be a sovereign citizen and was shot on duty of the deputy that was with the officer that was shot, returned fire, killing the assailant. On Monday, deputy Marshall passed away. She was 49. She had three children. She had been in law enforcement for 10 years. This is something that Jackson County is certainly not used to. In fact, the last officer that was killed in this way in Jackson County was a 1919. I want to remind everybody we've had eight officers killed in this manner this year in Georgia. So I would ask for a moment of silence for that family. Thank you. Speaker, I yield the will. Thank you representative Benton. I saw the news reports last night of this deputy and she must have been an amazing person. Chair recognizes Chairman Dave Belton for a morning order. Thank you, Mr. Speaker. Would you please rise with me. Lance Corporal David Lee Espinoza, age 20 of Rio Bravo, Texas. Sergeant Nicole G. H. 23, Roosevelt, California. Staff Sergeant Taylor Hoover, age 31, Salt Lake City, Utah. Staff Sergeant Ryan Canal, age 23 of Knoxville, Tennessee. Lance Corporal Riley McCullum, age 20, Benderant, Wyoming. Corporal Hunter Lopez, age 21, Indio, California. Lance Corporal Dylan Marola, age 20, Rancho Cucamaga, California. Lance Corporal Kareem Nacui, age 20, Norco, California. Sergeant Johnny Picardo, age 25, Lawrence, Massachusetts. Corporal Enberto Sanchez, age 22, Logan Sport, Indiana. Corporal Dagan Page, age 23, Omaha, Nebraska. Lance Corporal Jared Schmidt, age 20, St. Charles, Missouri. Seaman Max Soviac, age 22, Berlin Heights, Ohio. On August 26, 2021, when the deadliest days of our 20-year struggle in Afghanistan, these brave fallen gave the last full measure so that no American would be left behind. You know, three thousand years ago, Plato totals it only the dead has seen the end of war. Of course, everyone wants to believe that, but 103 years ago, tomorrow, on the 11th hour of the 11th day of the 11th month, all the nations of the world all agreed to finally end the war. They would end all wars. Sadly, throughout history, the plighted man has always been martyred by the greed and avarice of tyrants and dictators. Because of this in 1793, President George Washington created America's policy of peace through strength. His words were prophetic. When America has been strong, America has known peace. And since the days of the greatest generation, America has always been the greatest guaranteed peace the world has ever known. Unfortunately, Plato was also prophetic. On September 11, 2001, the United States was viciously attacked by militant terrorists of al-Qaeda. A branch of the Italian man, which ruled Afghanistan, was 2958 Americans, or murdered that day, over 6,000 more wounded, the calamity was even worse than the day of Infimiant Pearl Harbor. Ronald Reagan totals that peace does not exist without heroes who are willing to defend it. It pins on us on our courage to build it, and guard it, and pass it to future generations. Luckily for us, today's generation still has heroes. The day before she dies, Sergeant Nicole Guy posted a picture of herself tenderly holding an apple. A picture of an apple, literally holding an Afghan baby. A picture right there. The caption she posted said, Everything you need to know about the character and selflessness of the American Marine. I loved my job, she wrote. Just days before she was mercilessly cut down. The state of Georgia loves you too, Sergeant Guy, because of you, and it doesn't that fell beside you, they're very best in America. Lincoln and his guysburg dressed so that we cannot dedicate, we cannot concentrate, we cannot howl their sacrifice. Our words are poor power to add or detract, but we can remember, and we can thank God that men and women like Sergeant Nicole Guy and the 12-Defelbesider are still willing to lay down their lives. Thank you.\n\nto recognize this representative plant crow for a morning order. Thank you Mr. Speaker. Colleagues unfortunately is represented bit and did I come with sad news today. Today I rise to acknowledge the passing and honor the sacrifice of a hero and public servant Henry County police officer parminist decide officer to decide something good and shot on November 4th, 2021 while responding to a domestic violence call near the city of New York and Florida and flarest to drive in McDonough. He was transported by the Memorial Hospital where he remained on life support until some coming to his wounds on November 8th while surrounded by his family. Officer decide to join the Henry County police department in 2020 and he previously served with the Georgia Department of Corrections and the Cád County Police Department during his 17-year law service by having multiple organs donated which will save numerous lives. He is survived by his wife and two young sons. I ask you to keep officer decide his family and his brothers and sisters with the Henry County police department in your prayers during the stiff coat time. Please join me for a moment of silence in remembrance of a true hero officer parminist decide. Thank you. Thank you Mr. Speaker. I have asked all of the veterans in the house to join me at the well. If I was not able to get in touch if you could make your way down to the well. Tomorrow as we know is veterans day will not be in session. This morning I had wanted to simply paint a picture for you and for our constituent. I was not able to get in touch if you could make your way down to the well. I have a picture for you and for our constituents of a group of folks that are gathered up at the well this morning that we all don't look exactly alike. We come from different backgrounds. We represent different types of constituencies. We have different types of beliefs but we are united in one title and that is veteran. Each one of us gathered here at the well raised their right hand and we sworn oath to uphold and defend the Constitution against all enemies, foreign and domestic and to bear true faith and allegiance to the same. Less than 10% of our current population are veterans and when I did the math that is about the same percentage here in the house. So we are very much representative of our communities. And I just wanted to stand up publicly and let each one of my fellow veterans know how much I appreciate what you've done, how honored I am to serve with you and I'm speaking on behalf of all of us to say how much we honor the over 700,000 veterans that reside in the state of Georgia. As Chairman Belton just displayed for us a minute ago, there are those that are willing to put themselves in harm's way between us and between the enemy in our families. And I'm grateful for that and I'm grateful to serve with each everyone. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Chair recognizes representative Scott for a morning order. Good morning. Thank you, Mr. Speaker. From a female veterans perspective, I am the veteran not my spouse. I was not drafted, but I chose to join. If I park in a spot for veterans, it is because I am one. If you ask me for my military ID, I hope you ask a man too. My looks have nothing to do with being a veteran. Don't forget to thank a woman veteran for their service. We are veterans too by Avvog Magazine. Thank you. Thank you. Chair recognizes representative Meeks for a morning order. Thank you, Mr. Speaker. And to every veteran across this country, our state and this chamber, thank you. It gives us the opportunity to do what we do today. I come today to recognize a veteran in Pierce County, one of my constituents. Mr. Jacob Davis, Jr. was born October 6, 1921. October, he turned 100 years old. At Pun graduation, he moved to Virginia, worked in a shipyard until the draft noticed a rive in 1943. He was later assigned to the USS Intrepid, where he served as the tail hook operator during World War II. After discharge in 1945, Mr. Davis returned to the family farm, where he continued the tradition of his family and growing tobacco, cotton, peanuts, soybeans, timber, pecans, hogs, and cattle. Again, I've just mentioned he recently celebrated his 100th birthday. He continues to stay busy as he believes in the say and of the older I get, the more I see that needs to be done. So he stays busy. Of all the milestones that he's reached from serving in World War II to turning 100 next month, he and his wife will celebrate their 75th wedding anniversary. So, Mr. Speaker, I take this opportunity to recognize Mr. Davis and his contributions to our country and to his community. Thank you. Chair recognizes Chairman Hitchens for a morning order. Well, I appreciate the opportunity to come here today. I was going to talk for about 10 minutes. I didn't bring my speech up because I was talking a little, even though some other people extended it. Today is a very important day to me and for a lot of people around the world. And it's Vetchers Day tomorrow, but a lot of people don't know that today is a 246th birthday of the United States Marine Corps. It was conceived in Tundish Tavern in 1775, and I thought it very appropriate that adult beverages were served in that facility when the Marine Corps was coming to be. And believe it or not, I wasn't there on that day. But the Marine Corps history is part of the history of the United States. Just like in a him, we fought in every climate and place where we could take a gun. I served 13 months and four days in Vietnam if you were counting five of us going together into the buddy system. We all went together. One got killed. One got shot in the leg and crippled for life. And three of us came home without a scratch. And I'm very proud of our history in the Marine Corps. Today, there will be celebrations all over the world where there are Marines. I'm S.R.S. and Savannah with the Marine Corps League. But just like everything else in the Marine Corps, there's a protocol. There will be a dance, a party, there will be a birthday cake. The youngest Marine and the oldest Marine will cut the cake with a sword. And the senior Marine president will give a toast to the Corps. And I'm going to give a toast today that I've given many times before. And I weren't so much mine, but the Commodited Marine Corps gave it in 1975. And it goes like this. I think it says a lot about Marines. Oh, for the love of a beautiful maid. For the love of a staunch true man. The love of baby, unafraid, have existed since time began. But the greatest of love, the quintessence of love, the love of lows, even greater than out of a mother, is the tender, passionate, infinite love of one drunk in Marine for another. Uwa! APPLAUSE Chair recognizes Representative Carter, Representative Carter for a morning order. Good morning. Good morning. I would like to ask if you are a rise with me as we share our condolences with my family members in the city of Latonia. As we heard yesterday, Senator Max, Collie Lam passed a native of Latonia graduated from Latonia high school. And a week prior, another giant in our community, former City Council member Barbara Lester. So the city of Latonia is saddened because we had two remarkable people that came their way, came our way that has passed on. So if you would join me in a moment of silence and share our condolences with my family. Thank you. Chair recognizes Representative Bennett for a morning order. Good morning. Thank you, Mr. Speaker, to our steamhouse first giving honor to God and giving honor to all of our soldiers and our veterans who we are honored here today, and honor to all of the memorials that have gone forth before us. Today I rise, Mr. Speaker, in honor of all signers awareness month. As you will see on the screen, Purple Sunday is coming up on November the 14th. In 2019, the African Methodist Episcopal Church partnered with the All Signers Association so that we can continue to be a force and provide information and resources to all of our constituents and all of our members. Having dutifully and an appreciation served as a pastor in the African Methodist Episcopal Church for the past 11 years, Mr. Speaker, I'll be a ram in a bush at any time if you need a chaplain of the day. But what I'd like to say is that in Georgia, nearly 334 family members and friends cared for people with Alzheimer's disease and other dementia, providing 640 million hours of unpaid care and annual value given a total of $9.1 billion. Also, in recognition of these individuals, friends and caregivers dealing with Alzheimer's disease, there's research now on the horizon that will make a difference in the lives of your family members. When I was growing up, represented in Williams, we used to say Uncle Daniel and grandfather Daniel and Grandmama and Big Mama, they just were seen now. As they got older, they became more and more seen now. But because of research and the millions of dollars that are going into this cause, now we know that it is a form of Alzheimer's. Let's continue to wear a purple on the third Sunday in November, recognizing this great and awesome awareness for Alzheimer's disease. Thank you. Chair recognizes Representative Rebecca Mitchell for a morning order. Thank you, Mr. Speaker. I just wanted to take a moment to celebrate an achievement. As of November 1st, the White House announced that 80% of US adults have had at least one dose of COVID vaccine. On average, it is now our expectation that people we meet are vaccinated, and it's estimated that upwards of 70% of US adults are fully vaccinated. We do have so far to go to keep everyone safe. We have vaccines for children five and up that are happening now, but I just want us to take this moment to appreciate the progress that has happened and evaluate the narrative on vaccine uptake. Vaccine is not a, to be vaccinated is not a rare choice. It's the norm, and we needed to speak of it that way. Thank you very much, Mr. Speaker, and I yield well. We are now going on to the rules calendar. The clerk will read the caption to House Bill 1EX. House Bill 1EX, by the way, is in a rich of the 97th being titled and act to provide for the composition and number of state house districts. This bill I'm inferred to the Committee on Legislative and Congressional Reapportion. The Committee recommends that this bill do pass by Committee substitute. The chair recognizes the chair of the legislative and Congressional Reapportionment Committee chairman Bonnie Rich to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. This process started an earnest for me back in the spring, April or May, when we first started planning our summer tour of the state. With the federal government delaying the release of the census data by five months, we used this time over the summer months to learn about the 180 districts in our state that vary quite a lot from the mountains to the coast to the farmland to the metro. And everything in between, this was an extremely helpful part of the process for me and I hope for the other members of the Committee. Between June and August, we held public hearings across the state and we ended up driving I think over 1400 miles to get to our various destinations. We started with a public hearing here at the Capitol, which was virtual. And we moved from here to the northern suburbs of coming Georgia and then on up to Dalton. And after that we headed to Athens. We were supposed to go to Augusta from there. Our trip there had to be rescheduled however due to a governor's declared emergency and the weather. So we had that meeting a bit later. Our next set, a leg of the tour included a lot of South Georgia. We went to the coast at Brunswick. We traveled to Albany and from Albany we traveled to Columbus. We traveled to Macon. We came back to Atlanta for an in-person meeting here at the Capitol. And we also had a second virtual hearing from the Capitol. So all in all, we had 11 public hearings. We heard from everybody who showed up at the hearings turned out to be 328 speaking participants from 162 of our 180 districts. We heard over 15 hours of testimony. We also, I did between June and September, had allocated over 88 hours of time to meet with members of this body from both the Democratic Party and the Republican Party to learn about each member's districts. In addition to that, we have been accepting written public commentary on our website. We informed everyone at the meetings about that commentary and also got the information out to our constituents that they could submit information for us to consider through that portal. Toward the end of that process this week, we had heard from over 700 comments. The last time I checked yesterday, there were over 900. I did read the first 800 and I'm still in the process of getting caught up. I haven't read anything new in the last week. But I have continued to stay abreast of those comments. We also held committee meetings at the end of the summer in order to prepare so that we could hit the ground running when this special session started. The first committee meeting we held was what we called an education day here at the Capitol. We invited groups, various interest groups to come and to provide us information that they wanted us to know and to share their expertise about the redistricting process. We heard from the Georgia Democratic Party, the ACLU. We heard from NCSL, which is quite the authority on the redistricting process. I haven't written the red book that so many of us are familiar with and that I believe our very own Gina Wright has a lot to do with and educating legislatures across the state on the redistricting process. Following that meeting, we met again to adopt our committee rules and also the guidelines by which we would draw these maps. Those guidelines were essentially the same as the guidelines that had been used successfully the 10 years before the last time that we drew these maps. We just made some clerical or technology updates to take out references to floppy disks with respect to the submission of commentary. So those guidelines focus of course first and foremost on the constitutional requirement of equal population among our districts and then compliance with the Voting Rights Act. We also emphasize and our guidelines the importance of jurisdictional boundaries, the most important of which in our state is and has always been the county lines which are constitutionally decided and that are static. We also prioritized communities of interest, compactness and contiguity. So our first responsibility is to balance the population under the United States Constitution. Each of our districts is required to have approximately 59,500 I think is 59,411 members. So that was our first responsibility. We applied the redistricting office to this, they applied the 2020 census data to the existing districts and found that the districts that we have right now are they vary, some are overpopulated and some are underpopulated. Overpopulated by as much as 32% and underpopulated by as much as 24%. The districts have to be substantially the same size. We wanted to get that as close as possible while also complying with the Voting Rights Act and the other guidelines and we ultimately decided on a deviation of plus or minus 1.5%. After overlaying the census data, we then drew the Voting Rights Districts in consultation with our legal counsel of course to ensure compliance. We do comply with the Voting Rights Act, we have created majority minority districts and also new minority opportunity districts. The maps that we propose and that are in your packets before you contain 49 majority black Voting age population districts, which is an increase of one of those districts from the maps that we're currently operating under. We also were able to draw 27 minority opportunity districts. So we have a total of 76 majority non-white Voting age population districts that 76 out of our 180. We have one Latino majority Voting age population district, which is district number 98 and two heavily influenced Latino districts, which are in districts 4 and 96. In addition to these two very important legal requirements, our guidelines also of course as I mentioned emphasize communities of interest and minimizing county splits as much as practicable. We did prioritize county lines and for the first time based upon a request from a lot of the public, we also tried to minimize the splitting of municipalities where we can. This is difficult since city lines change and they pop up during the decade and also we have precincts that are drawn according to county lines and not city ones but where we could, we did honor the requests of the public and also a couple of the Democrat members here who made specific requests about the municipalities in their own districts. The maps that you see in front of you split 69 counties. The maps that we're operating under right now split 73. Contrast that with the 2001 House District Maps which split 80 counties into 147 districts. That's 147 districts because we had multi-member districts. We didn't have single-member districts when the Democrats drew those maps in 2001. They also had a deviation of plus or minus 5%. These are the maps that were struck down as being illegally jerrymandered. So what we have drawn before you today is a significant improvement upon that and maps that were drawn in 2011 that were approved by the Obama Justice Department were very good legal maps. Well we've done even better this time splitting only 69 counties. We also wanted to avoid incumbent parings as much as possible that is not to protect incumbents that is to protect the citizens, the constituents from having a significant change of representation. So in order to minimize that we obtained the current incumbent addresses so that we can plot and overlay those onto the map. We did prioritize minimizing that as much as possible because nobody is ever happy with incumbent parings. We ended up pairing only four, four current representatives. There is one pairing of two Democrats, two pairings of two Republicans, and one pairing of a Democrat and a Republican. So that's only four. In contrast the 2001 House District Plan paired 37 of the 74 Republican incumbents and nine of the 105 Democratic incumbents. So we took our guidelines seriously and we did a very good job. We combined all of this information to get the maps that are before you now. It's also on the screen. So I'm going to walk along with you through various regions of the state. You can walk along on the screen or on the packet in front of you. Starting down in the southwest corner, we had a significant loss of population in that area. And remember this is a population driven process. This is what resulted in one of our parings. That is the Democrat Republican pairing that you see there in House District 154. We were able, though, to protect the voting rights districts there. We created House District 153 and 154, which are both voting rights districts. That's majority, black voting age population. And with the collapse of that one district with that one pairing, we were able to maintain the course of the remaining districts in this area. Moving across the state east to the central part of the state, you'll get to House District 177, which is also a voting rights protected district. We were able to accommodate the request of the Democratic incumbent there to include some precincts that were explained to us to be a part of that community of interest and to shore up that district in that regard. Also in this area, we had a significant population loss, which resulted in another pairing. And this is the Republican pairing between two Republican incumbents in House District 176. If you continue to move east across the state, you get to the big light purple shaded area. This is 174, District 174, which is most of the swamp that is in Georgia. We were able to keep these five counties together. They all share the swamp, which creates unique ecological and social and economic issues. So we understood from the representatives and the people in this area that this was an important community of interest that we were able to keep together. If you keep moving across to the coast, you get to District 180, House District 180, which now has the whole of Camden County. It removed one of the county splits there. And Camden County was returned to be wholly represented there in District 180 as it had been historically before. If you move up the coast to House District 168, our very own Dean of the House, we were able to keep that House District number, which is quite historic, assigned to our much beloved Dean of the House. And this district is wholly contained in Liberty County, which I understand was also very important to the people of that district. If you move a bit to the Savannah area, we have a voting rights district there, number 165, that we created. And we have two minority opportunity districts there, House District 162 and 163. We were able to accommodate the request of a Democrat member there who had some suggestions with respect to precincts that needed to be included in.\n\nthat voting rights district. And we were able to accommodate that while still complying with the Voting Rights Act. If we just start heading back west across the state, go up a little. We get to House District 156. This district includes Wheeler Montgomery and Tooms counties. This is an area that we heard a lot about from the public. We had strong public requests to keep these counties together. I learned that this area is called the Onion Belt. This is where most of the world's population of Vadelia Onions are grown. And this is a community of interest there with the agriculture and related industries related to the Vadelia Onion farming. If you move up a bit into Central Georgia to House District 142, 143, and 150, this is the Macon Bibb County area. We were able to maintain the core of the districts in this Macon area while protecting those three Voting Rights Districts. 142, 143, and 150. It's a very densely populated area. So this took some extra attention there. We also were able to maintain greater than 50% Voting Age population in House District 137, which is just south of there a bit, by putting it into the city of Lagrange and Troop County. If you move a little further west to the Columbus area, we have two Voting Rights Districts there that we were able to protect. House Districts 140 and 141. If you move up a bit to the north to the South Metro area, this is an area that felt a lot of squeeze based upon the significant population loss that we suffered in the southern part of the state. We lost three or four House Districts south of here due to population loss at the same time from the north in Fulton County and Douglas County, there was some population growth that was pushing down on there. And that put a bit of a squeeze and caused the actual creation though of another Voting Rights District. If you keep moving up the border to Northwest Georgia, that area, we were able to maintain the district cores throughout this area and avoid any incumbent pairings. If you move a little bit east over to Pickens County, our current maps do have Pickens County whole. The Senate map and I believe the congressional map had divided them. So the people who live in Pickens County came out and were very vocal. They wanted to make sure that they remained whole on our maps and we prioritized that. They made some very good arguments with respect to the road infrastructure there and then the necessity of keeping it whole. So we prioritized that. If you move up to the northernmost area of the state, we have House District number seven. It's a perfect number, number seven, lucky number seven, perfect number seven. It's a perfect district. It is a perfect district. It remains a perfect district. We didn't change it. So number seven, it actually really did have exactly the right population that fit within the deviation. So that district grew at the same rate as the state did as a whole. If you move down a bit south into the Athens Clark County area, there is a lot of growth in this area. It's a very large county. The population alone would require it to be split three ways and that's if we were in a vacuum. If we didn't have to take into account the rest of the state. So we were able to minimize this being broken up as much as possible. We were able to keep one of those districts wholly within Clark County. So they will have a dedicated representative there. But like Barrow and Jackson County, also in the area, there was no way to avoid the splitting here. If you move a bit to the east, to the Georgia South Carolina border, we had legislators in this area who worked together to just adjust their lines based on the population and the communities of interest. Those were, I think probably some of the simplest adjustments that we made to those lines, to the lines on the map. Moving down the border to the Augusta area, we were able to create and protect four voting rights districts. Those are districts 128, 129, 130, and 131. We were able to keep Jefferson County whole there, which was a request from the people of Jefferson County while also creating those voting rights districts. And then I saved the most complicated for last, the metropolitan Atlanta area, which you cannot see from that statewide map. So we have a blow up here of the metropolitan area and it is still difficult to see. This is an area where we took a lot of the general concepts of the voting rights districts, the shapes of the districts from the Democrat proposed map. In this area, it is very difficult to not pair incumbents. We all live very close together when you see it plotted on a map. So this was work that our redistricting office, they spent a lot of time on that to make sure that we did not pair incumbents. We, in the North Metro area, we had a lot of population growth in Bartow, Cherokee, and Versailles, which pulled those districts south and to the east some. Gwyneth County, my home county, I'm going to mention it, just because it's my home county. We also had tremendous growth. We created two or three minority opportunity districts here alone and we had initially started with one or two Democrat parings, but we continued to work on this throughout last week and we were able to un-pair one of those. So we are left now with just one Democrat pairing in the state and it does happen to be in Gwyneth County. That is an overview of the state. At this time, I am happy to entertain questions. Do you yield for questions? I do. Cher recognizes representative Dukes to your left for a question. With the lady you? Yes, I do. You said that what is the African-American bone age population percentage in House District 154? I don't know that percentage. I don't have those calculations here, but I can with a lot of confidence tell you that it's going to be greater than 50%, but I don't know the actual percentage without looking at the chart. Is it not true that I have looked at the chart? I would imagine that you have. And I'm somewhat baffled because one chart has it is 53%. And the other has it is 55. I would rely on the information that we obtain from the redistricting office. Are you aware of the fact, how is the prison population in that district counted? Are they counted as a part of the African-American population? Is there is a prison in your district then I believe that the prison population is counted because that is where they are residing? I think that's those are the rules that we follow. Thank you. Are you also aware that there is a prison population there? It is the Calhoun State Prison. If you say so, then I have no reason to not believe you. Yeah. And I think it's probably about a hundred, close to about a 1,500 dead facility. Is that not true? I don't know that population of that prison, but I trust that you are speaking the correct facts here. So if I have to depend on in my African-American vote-naged population, people who are incarcerated, do you think that we can really get those pass of bill next year so those people can vote and vote for me? Well, I'm not here to speak to any other legislation other than the Redistricting Act of 2021, but I am confident that district 154 does satisfy the Voting Rights Act and has the population necessary for the voters there to elect the candidate of their choice. Who would the lady further yield? One more time so that we can get to some other people. Okay, then so I got to put it all in one question. I'm sorry. I got to put it all in one question. And that is House District 154 is what we call a legacy district. It was the first district that was committed, that was carved for African-Americans in Southwest Georgia in the 70s. For 50 years, that district has ripped and represented by an African-American. Further, throughout most of our other redistricting, while we had two, we kept the population, the vote-naged population in those districts similar. This time, what your map does is that it packs African-Americans into House District 153, giving it a vote-naged population of almost 70% while in House District 154, the legacy district, you reduce the number of African-American vote-naged population to perhaps 53% and give that district 1,500 prisoners. Thank you for your question. And thank you. Well, my question is this. Do you think that you could have been a little more considerate and less disingenuant in creating an African-American vote-naged population for the people of all of any Georgia in Southwest Georgia? Okay, I completely, and my friend, Gerald Green, a dinner service. Okay, I completely disagree with you on two counts. I am not disingenuous. I was not disingenuous in drawing this map and neither was the reapportionment office and neither was our council. I also disagree with your use of the word packing. That's a word that's thrown around a lot and that's a legal term. And we do not have any packing in our maps. We have drawn legal maps that comply with the Voting Rights Act. I will yield for another question, Mr. Speaker. You don't appear to have any more questions. Okay, let me just before I yield the well, I was remiss in thanking Gina, right, the executive director of our joint office. She has worked harder than any of us. I've gotten a lot of compassion from a lot of you, but the truth is Gina Wright has done a lot of the heavy lifting and the long hours. So I just wanted to thank you publicly for everything you've done to make this possible. We are very fortunate to have you. Applause. The Rules Committee has limited debate on this measure. To not more than two hours, the chair will allocate that one hour to each side. And then within that one hour, I'm gonna let the opponents of the bill and the proponents of the bill sort of divide up their time on their own. But at the end of the hour, that's everything's cut off. We'll then have, there's a minority report, which will be given and then the chair will have the chairman's time. So that's kind of the process that we're gonna go through. Okay, chair recognizes to speak to the bill representative Sandra Scott. Chair recognizes representative Carolyn Hugley. Thank you, Mr. Speaker, ladies and gentlemen of the House. I stand before you today just to have a bit of a conversation about a special and complex legislative undertaking called redistricting. Before we begin, it's important to provide background and context to our real audience, the people of Georgia. Every 10 years, the United States embarked upon an effort that is mandated by Article One Section Two of the United States Constitution. That effort is called the census. And throughout Georgia and throughout this country, the census was conducted and completed during a worldwide pandemic. The census data are important for many reasons. And among them is the process of apportioning the U.S. House of Representatives. It's 435 seats amongst the 50 states, which also determines how many seats each state will have in the House of Representatives over the course of the next 10 years. And according to the 2020 census, Georgia saw substantial population growth. Some 1 million, 24,255 new people in Georgia, that's 10.6% over the census of 2010, making Georgia the eighth largest state in the country. Although we did not gain enough population to increase our congressional representation to gain another seat, our total population to 10,000, I mean 10,711,908. We use these census results not only to determine how billions of dollars will be spent, but they become the building blocks for what we do in redistricting. The census results have shown us that Georgia has grown more diverse and more urban, and that fair maps must reflect this growth and diversity. The population growth was fueled by people of color while the population of whites in the state of Georgia decreased by some 4%. African Americans make up 30.6% of the population while Hispanic and Latinos are at 10.5% of the population. Non-Hispanic Asians make up 4.4% of the state population and 6.9% of residents say they are of more than one race. And then here we are in this special and complex legislative undertaking called redistricting. And I want to extend my congratulations or condolences as it may be to the chair of the redistricting committee because it is a tough job. A job where nobody's going to be happy and she's going to have to make new friends after all of this is over. So I do extend her my condolences. So redistricting to a just and to redraw our congressional senate and house boundaries were based upon the new census numbers. And that information has resulted in an ideal population for us for a house district of 59,511 people. So before today is house bill 1EX. And what the chair of the House Legislative and Congress and the Reapportion Committee refers to endearingly as the Republican map. So I'm going to continue to call it the Republican map. Some have said that the job of the redistricting chair as a candidate hurting 180 cats. And however to me it appears very much like a magic show because things are not always as they appear. Republicans may talk about adhering to the Constitution, compliant with the Voting Rights Act, transparency, fairness, and all those words that make us feel trusting, warm, and fuzzy about this redistricting process. They are in charge of it this time. However, when we look at the map, things are not always what they appear to be. The House Legislative and Congressional Reapportion Committee adopted its guidelines on August 30th in less than 10 minutes. And the chair has said that they are substantially the same as they were 10 years prior. But the whole world has changed in the last 10 years. And it would appear that the committee would have taken time to consider some other things. There was no discussion in the committee at all. And that clarified the process or the protocol for the public or members of the general assembly to actively engage in a meaningful way in this redistricting process. The adopted guidelines certainly did not take into account what the people of Georgia said over and over and over as the committee traveled all across this state. What they heard over and over again was that Georgians want fair maps. They want transparency. And they want an opportunity for public input. And they asked for at least two weeks after the maps were proposed. We have guidelines, but things are not what they appear to be. Republicans have said their map complies with Section 2 of the Voting Rights Act, and that they must protect voting rights districts as referred to by the chair. In order to comply with the Voting Rights Act, it is necessary that racial blood voting analysis be conducted. But the chairwoman has yet to disclose the name of the expert that was used to ensure compliance with the Voting Rights Act. To make sure that voters of color are not disenfranchised or discriminated against. However, Section 2 absolutely requires the Republicans to draw minority opportunity districts to protect voters of color. Things are not always what they appear to be. Republicans have said that their map considers communities of interest. Yet in order to consider community of interest, a community must have the opportunity to define who they are and to share those fundamental elements that will allow them to benefit from having cohesive representation. We are in 2021 and not 2011. And the technology exists to allow the public to upload maps and to do any number of things, but this was not available to our citizens at this time. So things are not always what they appear to be. And there were members who came to public hearings to talk about their communities of interest, but those concerns are not necessarily reflected in the map. Republicans have boasted about hosting joint redistricting hearings around the state. As if hearings prior to the census data release provided sufficient information or education for our constituents to gain an understanding of the redistricting process and share their concerns based on a real proposal. Well, I just want to say that the complexities surrounding redistricting are challenging for us to understand as members, and they are certainly challenging for members of the public. The public pleaded for doing those hearings for more time, as well as time for a fair map and a transparent process to be reviewed. Yet the Republicans have decided not to yield to the police of our constituents for more time. They decided not to yield to the pleas of constituents for fairness. They decided not to yield to the pleas of constituents for transparency. Instead, this map has been rushed through the legislative process. The public demanded and deserves more than the time that has been allowed for them to review the maps that will affect us for the next decade. The joint redistricting hearings just did not give people what they needed. The people of Georgia deserve more than a magic show of smoke and mirrors. The redistricting cycle is likely to be the most consequential redistricting cycle in our recent history. And Republicans have ignored the will of Georgia voters in drawing their state house map proposal. Republicans have a state house map that silences the voices of Georgia voters. It minimizes the political power of people of color. And it ignores the fact that Georgia is equally divided politically. And there is no way that you can follow the guidelines that the committee has established and provide a map that will do anything other than bolster the Republican advantage. So, Mr. Speaker and members of this house, this house, this house map does not meet the standard of excellence that I believe the residents of our great state deserve. And I ask my colleagues to reject this map. Thank you, and I yield a well. You have a question if you care to yield. From your own caucus. Do you do? You do. The lady is yielded the well. Chair recognizes representative Park to speak to the bill. Thank you, Mr. Speaker. Colleagues, this decade we as elected representatives in the Georgia General Assembly have the tremendous responsibility to draw fair, non-Jerrymandered, house district maps. This cycle is perhaps the most important of any prior decade, especially because this is the first full redistricting cycle in Georgia where pre-clearance by the Department of Justice is no longer required. Even given this reality, the map passed by this by must still unequivocally comply with Section 2 of the Voting Rights Act of 1965. Also, the House Legislative and Congressional Reapportion and Guidelines specifically state all plans adopted by the committee will comply with Section 2 of the Voting Rights of 1965 as amended. In a state like Georgia, with a long history of racial discrimination in voting, Section 2 is of the utmost importance to ensure fair maps are drawn and enacted that do not discriminate against voters of color. Voters of color have the undeniable right to elect their candidates of choice. To deny this right is both unjust and abhorrent. To ensure the map drawn and passed protects the rights of voters of color to elect their candidates of choice, a racial-block voting analysis is a must. Unfortunately, we do not know if a complete racial-block voting analysis was conducted for the Republican map on the floor today. There has not been full disclosure to the public or even committee members. On this point, the name of the expert statistician retained to conduct such analysis on the Republican map is still unknown. What we do know is the Republican map fails to reflect the growing diversity of Georgia and draws one less opportunity district than the proposed Georgia House Democratic Caucus map. The Republican map also dilutes existing opportunity districts. This Republican map threatens the ability of voters of color to elect candidates of choice. And for this reason, I will vote no on House Bill 1EX. Thank you, Mr. Speaker. I yield the well. Do you yield for questions? No, Mr. Speaker, I yield the well. Chair recognizes representative Oliver to speak to the bill. Thank you, Mr. Speaker. The book of my co-6-8 calls upon us to do justice, to love kindness, and to walk humbly with our God. I'm going to talk this morning about justice, as defined by six decades of case law that seeks to protect the rights of voters. I'm not going to talk about kindness or mercy, because reapportionment is not about kindness or mercy. And the milk of humankind runs thin by those with the power of the pen to draw maps. I do want to speak a little bit about humility. We are not humble enough on this body. We have spoken a lot, and we have thought a lot this week about Max Cleelan, the two officers killed in the line of duty this week. The 28,000 Georgians who died from COVID, those were cherished and loved people. They and we are not promised tomorrow, that is the ultimate fact of humility. On a different level, not as important, we are not promised a district. We are not promised entitlement to be re-elected. The right to elect the 180 folks on this house floor is dependent and given to the voters. It is not ours to defend. We come from different places to this floor. I was not from a political family.\n\nI didn't intern in a congressional office. I was not president of fraternity and thought I needed to be governor. I hope young women now who are presidents of sororities want to be governor. But in my era, I didn't have any of the background that led me to this body. I came here, you know, most pragmatically, based on the death of a very fond legislator who represented my district at that time, representative Peggy Charles, a good legislator, who brought to us Georgia on our man as our state song and brought Ray Charles right there to this house to sing it for us. Dean Calvin Smarrie was here. The humility is not shown in most of our acts and is something I won't preach about more, but this map is not humble in relation to the wishes of our 50-50 states, nor is it respectful in my view of the dictates of the cases that define the rights of voters. Let me turn to a definition of community of interest, which the committee did not define and which is a primary opportunity for us to be respectful of voters in this era of political change. In this era where our state is very equally divided. I did voting rights cases myself and my youth and it was in an era where voting rights cases in the ones that I was involved in were relatively easy to win. It was clear that counties just south of Atlanta had changed from single member to at large member seats to deny the rights of African American communities to have political representation. In one of the cases I represented by citizens, the lawyer for the county stood up in federal court and took the position that the voting rights act did not apply to his county. Even a very young and inexperienced lawyer was going to win those cases. I did win those cases and it gave me an opportunity at the beginning of my career to look at the six decades of the court's actions to protect voters. Today's legal issues without the Section 5 pre-clearance are more complex. They are more complicated. But we do have guidance on defining what community of interest means and we do have an opportunity to know, to believe, assert that the facts of this map does not protect the community of interest. Community of interest reflects a shared political goal and I'm going to read from you just one sentence from a United States Supreme Court case that gives us a good guidance on what communities of interest means. Legitimate yet differing communities of interest should not be disregarded in the interest of race. The practical consequences of drawing a district to cover two distant, disparate communities is that one or more or both groups will be unable to achieve their political goals. Let me turn to DeCab County. I'm a native of DeCab County. I'm a native of my district. I'm a native of Georgia. I love my district the way all of us love our state and our districts. Stone crest community is split into three separate districts. My city of Decatur where I practice law for a good while, if I had the corner office which I don't have the corner office on the square, I could look at three different districts. The city of Decatur is four square miles. It has four representatives. The district lines separating House District 91 and House District 116 divides the community of Stockbridge. The Groveway community in Roswell, a community of African American churches that vote and pray together has been divided by a split precinct. I haven't read all 900 comments that have been submitted to the committee, but I am very confident that hundreds of those comments said do not divide our community, do not split our cities, do not divide us. This map divides us. The United States Supreme Court has decided that partisan politics is not a basis to set aside maps, but it has decided that the disenfranchisement of minority voters and the violation of principles of community of interest are a constitutional basis for setting aside redistricting plans. I say to you ladies and gentlemen that this map fails to honor the constitutional protections of Section 2 provision of the Voting Rights Act. I thank you for your time and let me give you one more lesson of humility. It is not our district. Every one of us can be replaced by somebody who will do a better job and we are obligated to respect first and foremost the wishes of our constituents, the wishes of Georgia's voters. Thank you. Chair recognizes representative Scott to speak to the bill. Thank you, Mr. Speaker. In many ways we are still feeling the impact of the initial surge of the COVID-19 pandemic in the summer of 2020. The economy is rebounded. People are getting back to work and while the spread is still serious, every day we move closer to a normal life. During that time the federal government began to fulfill one of its most important obligations the census. Every ten years the United States counts its people so that we can accurately present them in their government. In the COVID-19 pandemic this process was delayed. It is not the fault of any electric leader. It is not the fault of the Republicans. It is not the fault of the Democrats. But we are working on a different schedule thanks to our new pandemic reality. This schedule made the needed data available to us in mid-August when we will otherwise have it months earlier. And as it turned out I will state experienced enormous population surges in some areas and dwindling numbers and others. This made I will task a rejoined alliance significantly harder. Unlike any redistricted and recent memory no one who speaks today without the challenge that we all faced in this process but the challenge did not leave us without options. It did not force us to ignore the public in a rushed process that will undoubtedly change Georgia permanently. Thank you, Mrs. Speaker and I yield the way. Chair recognizes Representative Alexander to speak to the bill. I am sorry, I call out of order. Overluct y'all's order. So the next speaker, Chair recognizes Representative Gilear and then you. Thank you, Mr. Speaker. And to my brothers and sisters of the Georgia General Assembly. You know, we heard our colleagues talk about what led us to this moment but allow me for just a few minutes to expound a little further. As we know this year's redistricting process had challenges even in democratic and republican districts. And yet the committee began to gather public comment before the data was available. The committee put the cart before the horse. The committee put the symbolism of public engagement ahead of what the public really needed. What they needed was a chance to advocate for their communities with an understanding of how a potential map would look. And out of all the public comments recorded, a vast majority came before the release of the map that we are voting on today. Communities across Georgia learned for the first time last week exactly how their representation would change. And in response, they were given two options. Come to the state capital in the middle of a work day or go on the portal and put your information in. Where the re-apportionment committee may or may not be taking public comment or they could submit their feedback in writing, I would ask all of you and my colleagues of the people's house. How often does this process for a regular piece of legislation, how often do we submit this at the last minute and change? For the bill concerning truck drivers, we would hear from economic development authority on the latest economic statistics. For bill concerning funding for a state agency, we would ask our investment on how it would be spent. But this bill concerning the representation of Georgia's everywhere is apparent that it's fine to ask the people to respond to data that did not exist and a map that had not been drawn. Dr. Kenk said, give us the vote and we will change the course of this nation. I don't know how we could change the course of this nation when we go into the phone book as Clark Kent and we come out with Tadai Supermap. And so in my district and many of us in an on re-apportionment, not one single Democrat was asked to be a part of the We Map. We said we drove, we drew the map. We heard our constituents. I don't understand what the We Map is because it wasn't the map of citizens from around the state of Georgia. Not only Democrats, Republicans sounded the alarm that they were disenfranchised, that they were not heard. And so my brothers and sisters, let us stir up your conscience today. Move yourself out of your party and you tell me that what is right today in voting on this map that was rushed, the data that was rushed, the redrawing of the map that was rushed, we do not need We Map. We need the map. Mr. Speaker, I yield the well. Chair recognizes representative Alexander to speak to the bill. Thank you, Mr. Speaker. My colleagues, I rise today in opposition of House Bill 1EX. In the past decade, Georgia has grown by 1,02425 people. The population growth was not uniform in the state. What we know from the 2020 census is that Gwinnett County was the fastest growing county in the state. And it increased its population by 1,51741 people. In contrast, Southwest Georgia lost the most population in the state over the last decade. The United States Constitution as well as the Georgia Constitution requires the legislature to redraw House district lines every decade. So Georgians have equal representation on one person, one vote principle, one person, one vote. This is principle paramount to ensure Georgians have equal representation regardless of race, political party, or address. In fact, the equal protection clause of the United States Constitution requires states to redistrict with substantial equal population. The redistricting guidelines adopted by the House Legislative and Congressional Reapportionment Committee also require House districts to be drawn. To quote, achieve a total population that is substantially equal as practical role considering the principles listed below. In quote, equal population, equal representation is an objective value proven by data and statistics. The data and statistics show us objectively that the Republican drone map is not drawn to provide equal representation to all Georgians. The higher the deviation, the more unequal the representation, which is why you will see on the maps. Some of the maps have a little bit past 59,000 and some are very, very close to 60,000. Ten years ago, the House district maps were drawn with a deviation range between minus 99, minus 0.99% to 99%. In a total deviation of 1.98%. The map on the floor today for a vote has a deviation range of minus 1.40% to 1.34%. In a total deviation of 2.74%, the higher deviation is contrary to Fair Maps and the one person, one vote principle. The data and statistics also show that this Republican map fails to reflect the partisan preferences of voters. The Republicans map creates a significant Republican advantage. It reduces the share of the Democratic electorate and two current Democratic districts, HD48 and HD105. It carves two new districts out of Democratic, Metro, Atlanta, House District 99 in Gwinnett and House District 53 in Buckhead. That are also drawn for Republican advantage. This is not a fair map. The Republican map splits 184 voting precincts. The map proposed by the Georgia House Democratic Caucus splits only 137 voter precincts. Split and fewer precincts help keep communities together. The Republican map also fails to reflect the growing diversity of Georgia's population. It creates one less minority opportunity district than the map proposed by the Georgia House Democratic Caucus. Georgians have demanded Fair Maps and Georgians deserve Fair Maps. The data and stats show us that there is more work to be done on the proposed map before us. For all these reasons, I am voting no on House Bill 1EX. Thank you, Mr. Speaker, and I yield the will. Chair is going to ask the clerk to read House Rule 81, the portion about a little reminder about when members are to sign up to speak on the bill. Rule 81 in part. Any member wishing to speak on any measure shall notify the speaker prior to the measure being called or during the time the first presenter is speaking on the bill unless otherwise ordered by the speaker. With that, the chair recognizes Representative Singleton. Let it be noted that the chair is waving your noncompliance with that rule in order to hear from you. I appreciate it, Mr. Speaker. Thank you. I spoke to the wrong person when I came up. Thank you for letting me speak today. I rise in opposition to these maps. We've heard from the chair about the importance of population, county lines, communities of intent. I'm not going to focus on these details today. There's been a lot of discussion on all of these things. I'm not going to discuss focus on my one district being divided into five, focus on the cities, city, divided into three different districts, or the 30,000 rural coweat of voters that are going to be put into urban Fulton County. These are important facts and these are facts that have been well known. These maps violate all of those principles for the members that I'm here to represent and then I'm here to serve. So I must speak up on their behalf. It's important to note that with 88 hours of meetings, 30 plus hours of public hearings, 900 plus comments, not one single amendment was submitted to the committee to adjust these maps. All of this, everything on these maps was done behind closed doors with a select few. It's also worth noting that trying to provide comments and input is on maps that you haven't seen and that haven't been published is like asking an editor to edit a book with no draft. It's an impossible task and frankly political theater. I've seen some amazing things. I've been very blessed to serve down here and I'm very honored to know the members on both sides of the aisle. I've been very blessed. I've seen some amazing things in my very short time here. I've seen a member present a bill that they'd never seen before and when they were questioned, they said this is the first time I've read it. I've watched a member vote no on the floor for an unchanged bill that they were the primary sponsor of after it was whipped. I've watched a member denied morning orders, privilege revolutions and stripped of committees for challenging those in power. I've been able to see a bill that was being voted on actively called for a vote in committee and then a senior member received a phone call and leaned over and whispered to the chairman and the vote was stopped immediately and the bill was killed. I've seen several and I've heard several members on both sides of the aisle that were on this reapportionment committee with combined decades, decades of service to the people of this state and to their committee who said that they had never seen the maps until they were published last Tuesday. That is a travesty and is a shame. Many in this chamber, I feel have been greatly disrespected in this process. I would dare say most in this chamber have been greatly disrespected in this process and have had no voice. The dire part of this is that functionally and by proxy, the members of Georgia and the members that we represent have had functionally no voice in this process and we are ultimately here for one purpose and that is to serve our constituents. So Ben Franklin said, you have a republic if you can keep it. It's a famous quote, we all know it. Those of us that have been inspired to serve the public, I believe have taken it to heart. Members on both sides of the aisle who I respect, I want you to hear my plea and my caution. If you allow your voice to be silenced or you willingly submit your voice to a select few, you are complicit in the destruction of our republic. I'm going to say that again. If you allow your voice to be silenced or you willingly submit your voice to a select few, you are complicit in the destruction of our republic. You are creating a functional oligarchy. All that is required for evil to prevail is for good men to do nothing. I want everyone in this room to have an equal voice and I hope that you will stand with me in opposing these maps and making sure that we represent the people that we serve. Thank you so much for the time. Thank you Mr. Speaker. You're the well. That concludes all of the members who wish to be heard in opposition to the bill. The Chair now recognizes the chairman of the House Judiciary Committee, Chairman Abstration, to speak to the bill. Thank you Mr. Speaker. Ladies and gentlemen of the House, I come before you today both as a member of the committee that has had this measure under consideration that has engaged in these town halls all across the state that has heard comments from voters, from the public, from anyone who wanted to submit comments through an online portal to give you the perspective that I bring to this as an attorney, as someone who has heard the arguments that have been raised about how the law maybe factors into this and what legal considerations need to be given. So I'd like to go through some of that with you here today. And at the conclusion of my arguments, I want you to maybe see how the map that's before you in the form of House Bill 1EX conforms to these legal requirements meets the standards that we were required to follow as we put together this map in committee and present it to you here on the floor today. The Voting Rights Act was passed in 1965 as we've heard and it has been up for consideration by the U.S. Congress since then for renewal. Of course, the Act prohibits discrimination on the basis of color, or race, and voting practices or procedures and that would include the redistricting process as before us here. Section 2 applies nationwide. In Congress amended Section 2, after there were some judicial opinions, to make clear that review for discriminatory intent and discriminatory impact intent was not required if impact could be shown otherwise. So the question of discriminatory impact is the standard to be determined. Section 2 prohibits was referred to as minority vote delusion and that's the minimalization or cancellation of a minority in voting strength as a result of the Act that's passed. Now Section 2 prohibits any practice or procedure that interacting with a social or historical condition impairs the ability of a protected minority group to elect its candidate of choice on an equal basis with other voters. That's the law. And careful consideration was given to this in the House Committee to ensure that the map that's before you today is House Bill 1EX follows the law, follows the U.S. Constitution and it hears to the Voting Rights Act. Now with respect to equal population size between districts, I know that issue has been raised today, the population equality is plus or minus around 1%. That is an incredibly impressive standard to reach when you have 180 districts to draw across the state. And I think a real accomplishment to be touted in the map that's before you now. And I'm grateful to Chairman Rich for her diligent work for the members of the committee that reviewed this process and to Ms. Wright and her entire staff for their hard work throughout this process. Additionally, guidelines were used by the committee, which were the same as those used in 2011. Well, I say the same, but as Chairman Rich pointed out, the word floppy disk was removed, technology is advanced a little bit since then. But otherwise, those guidelines were the same. And these are the same guidelines that were up for reviewing consideration by the Department of Justice under President Barack Obama. The same guidelines that were considered when Georgia's state house, state senate congressional maps were approved through pre-clearance after the 2011 special session. Now input was utilized from the public to determine communities of interest that were for consideration and that should be considered by the committee. We made minor modifications with input that was provided by members speaking on behalf of the districts that they represent as to their respective communities of interest. And in committee, we heard from different groups, many, many different groups, different advocacy organizations. And I'll just point out that Fair Districts Georgia referenced the Princeton gerrymandering project. And we heard repeatedly about that and included a review of the each map that has been proposed. And I've had a chance to even review their findings and conclusions from the map that's before you here today, the committee's substitute to House Bill 1EX. And their conclusions are that of the proposed map before you and the map proposed by the Minority Caucus, each map received the same grade, a B. Each map was consistent with the grade with respect to competitiveness and other standards that they took into consideration. Now, I think we have to note that the map is before you reduce the number of county splits. It's really impressive to hear. Chairman Rich said only 69 counties are subject to count to splits as part of this map. The proposed map from the Democrat Caucus has 78 split counties. A marked difference.\n\nin the map this before you now. Where possible, and as much as possible, splitting precincts was avoided. And that is, I think, reflected in the map this before you now, and also the reduced splitting of counties that I referenced a moment ago. Chairman Rich detailed that there was a real effort to avoid splitting municipalities, which is, frankly, not easy to do sometimes, particularly in densely populated areas. And the work that was put forward to reduce or minimize the impact from splitting municipalities is impressive. Additionally, this map reflects the increases in minority opportunity districts across this, reflects an increase in minority opportunity districts across the state of Georgia. This is a reflection of the growth and minority populations in the state of Georgia, our states increased diversity, and compliance with the Voting Rights Act. And it's for all these reasons that I say to you now that this is a good map. It's a legal map. And I encourage your favorable consideration of House Bill 1EX. Thank you, Mr. Speaker. I yield the well. Chair recognizes the chair of the House Judiciary Non-Civil Committee, Chairman Barchett, to speak to the bill. Thank you, Mr. Speaker. Colleagues, it's been a long two weeks. I think many of you are in a situation similar to mine, and that you don't exactly like everything about your district. Well, that's what I'm coming up here to talk to you about. I want to talk to you about the fact that this is one of the, many times we come up here and we say, I've got a simple bill for you, right? This isn't a simple bill. This is not easy for anybody. But what I want to remind you of is this. We're here to serve the people back home. Each and each and each individual here is serving their people back home. That seat doesn't belong to me, doesn't belong to James Barchett, District 176 belongs to the people in District 176. It's not about me, and I'm asking you to support this bill and support this map for that very purpose. These districts are drawn in a fair manner. It's fair. What we did on the outset of this is to draw a map that will be, will withstand judicial scrutiny. And coming from one of the four parings in this map, if I can set aside my personal ambitions and my personal feelings to do what's best for the state of Georgia, I think that each and every one of us can do that. I'm appealing to you just from a personal perspective just to say, hey, this is not about you. This is about the state of Georgia. This is about your constituents. This is about the future of Georgia. So I'm asking you, please, please vote yes on this bill. That's all I have. That's all I have to say to you. I appreciate you. I appreciate the opportunity to be here with you. I may not come back. I do not relish the opportunity to have to run against one of my colleagues. But I'm able to set it aside because I feel confidently that this is what's best for us. So I ask you, please, please support this bill. Thank you, Mr. Speaker. Chair recognizes the Speaker Pro Tem of this House. Speaker Pro Tem Jones to speak to the bill. Thank you, Mr. Speaker. I'm honored today to speak in favor of HB1EX, which accomplishes the federally required redistricting of Georgia House maps to reflect changes in population following the census count. First, I'd like to give a short history. I came in after the Democrat majority house redistricted in 2001, taking office in 2003. I never met many of the Republicans that served in the House in 2002 because they were packed and intentionally paired. As mentioned earlier, 37 out of 74 Republicans were paired. They were packed in districts with a 10% deviation in population. In other words, conservative voices in Georgia were diluted because their districts were diminished the number of districts because of that deviation. A federal court struck the map down for violating one man or woman, one vote, as required in the U.S. Constitution. Judges redrew the maps without any regard for incomeancy, which resulted in many dim and some are pairings. I have to say, I remember that period, we kept waiting and waiting for the Democrat majority to produce a map, but they couldn't produce a map that I guess was legal and kept them in charge. To be a member among 180, waiting for the judges to redraw them and it was really excruciating knowing that no public testimony was given. Nothing was considered except these federal special masters redrawing it. When the maps came out, they didn't even consider the incomeancy. They didn't put dots on the map, unlike Chairman Rich, who asked every member to give her where they lived so we could take it into consideration. After a few decouplings by the judges, you had to be within one or two precincts of where you were paired and next to an open seat, ours took the majority for the first time in 140 years in 2005. Next in the redistricting timelines since I've been here, in 2011 redistricting was performed by Republican leadership. And the maps were pre-approved by the Obama Justice Department with no changes at all. Not one. Perings were avoided, were possible, and the average population deviation was kept low. Republicans did it right. And now we've arrived at the 2021 redistricting and I can assure you we're doing it right again. There are no multi-member districts as the Democrats created to maliciously eliminate Republicans by pairing one Republican in a multi-member district with say three other Democrats, so they had no chance of winning. The relative average deviation is less than 1% compared with the 10% that Republican districts were given in 2001. The map reflects compliance with the Voting Rights Act similar to 2011. This is a fair legal map driven by census confirmed populations shifts. I would like to mention that things are not always as they appear. The only prior House chair of reapportionment still serving in the House, a Democrat who chaired such a committee in 2004, failed to report out of a legal map or frankly a map of any fashion. This followed, of course, the previous Democrat produced map being struck down in the federal court for violating the U.S. Constitution. The map before you was voted out at committee and complies with federal law. Now I'd like to speak for a minute to the public, those who are watching this streaming. I just want to mention a few things that I've listened to among these many hearings that we've had in reapportionment across the state and here at the Capitol. First I want to mention city versus county splits. With 537 cities in Georgia and a requirement to keep deviations and population size minimal, splits in cities are unavoidable. This map though has fewer city splits than the 2011 map. In contacts, many of you know, but some in the public may not know, counties or constitutional cities are created by the legislature. The 159 county lines haven't changed in modern history and have always been considered with greater weight in redistricting in Georgia than cities. Many cities changed their lines every year through annexations and there are 72 cities that straddle county lines. Additionally, since 2005, numerous new cities have been created. This is a 10 year map. County lines don't change. We're possible? Sure, it's preferable to keep cities together, but when the greater weight is to county lines. I also want to mention to my fellow Georgians that live in Cherokee County. If reelected, I will have the awesome privilege to represent a portion of this tremendous county. And I will work with the other Cherokee representatives to make sure that your priorities are listened to at the Capitol. Other district representatives will also add to the Cherokee team, giving you additional weight at the Capitol. Population increases south of Cherokee County, push districts north and it push districts south. And you will be the beneficiary. This is very different from 2011 when, for example, the city of Atlanta grew statistically like 1%. 20% this year and it did push districts in different, north and south. I would also like to mention to my fellow Georgians in Caliida County. I heard testimony in the reapportionment committee that was incorrect and misleading. Contrary to what was suggested, we do not have the luxury of leaving districts or county representation unchanged after a census count that saw Georgia grew 10% over 10% and for example the city of Atlanta by 20%. South Fulton also grew as well. Population growth and compliance with the Voting Rights Act drove changes to Caliida's redistricting. But you will continue to have very strong representation. I must mention that the Democrat House map appears to have significant flaws. I suppose when you know it won't become law and be subject to federal court scrutiny, you can just throw anything on the wall and make it stick. There are significant concerns about the legality of a number of majority black districts in the Democrat-produced map, which has the effect of concentrating where those districts are located. This affected the Caliida and the Fayette County maps that the Democrat majority produced. Caliida resident and Fayette County residents are being gained by the Democrat majority map. It would not be legal, it would be struck down, and it would be in violation of the Voting Rights Act. If the Democrat majority map were drawn with a straight face and I do judicial scrutiny and expectation that it would actually have the force of law, compliance with the Voting Rights Act and avoided malicious Republican parings, the House district maps that they produced would look predominantly similar to the map that you have before you today. I'll close there are few jobs that state legislators such as ourselves are required to do by the state constitution or federal law. One, we are required to pass a state budget each of every year. And two, we must comply with federal law that says we must redistrict the House, the Senate, and the Congressional Districts after a new census count. I cannot emphasize to enough, this is a consequential vote. I was here when judges redrew them. I don't wanna be here to leave it to judges, to redraw them without regard to the testimony we heard, communities of interest, county lines, and trying to create a map that reflects as best as we can what different areas of Georgia want. I encourage you to vote from map that was fairly drawn, complies with federal law and fulfills your oath of office to redistrict fairly the various communities in Georgia. And I encourage you to vote favorably for HB12X, one X. And with that, Mr. Speaker, I will yield the well. Ladies, yielded the well. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. We now have a minority report. That will be limited to 20 minutes. And that will be followed by the chair's time of the same length. Chair recognizes for the minority report Representative Alexander. Thank you, Mr. Speaker. I yield the reminding time that we have to the minority leader. Thank you. Chair recognizes the distinguished minority leader, Beverly, for the minority report. Thank you, Mr. Speaker. To the chair of the committee, thank you for your effort. Arise in opposition to House Bill 1EX. The Republican map for redistricting the Georgia House of Representatives. Because the people of Georgia deserve better. The people of Georgia demanded a fair and transparent redistricting process with the opportunity to review and comment on proposed maps before their consideration by the House. What they got instead was a rust and secretive process. With the current committee's substitute map released just over one hour before public comment was scheduled to begin on Monday of this week. Public comment on this map, including from Republicans, was overwhelmingly negative. It was promptly ignored. Republicans voted the map out of committee on partisan lines without making a single change to the map after hearing from the people. That speaks volumes about how little the commitment and the committee value public feedback and the people of Georgia deserve better. The people of Georgia deserve a map that complies with the guidelines adopted by the reapportionment committee on August 30th. But that's not what they got. But they got instead as a Republican map that gives only lip service to the first guideline that requires population equality of Monday districts. The Republican map deviates from population equality by more than 2.7%, which may not sound like much. But that's almost 50% greater than the current maps deviation when it was enacted in 2015. And it is far higher than the deviation that the Democratic proposal presented this year. Under the Republican map population equality takes a backseat to partisan purposes and the people of Georgia deserve better than that. Another guideline requires all maps that comply with Section 2 of the Voting Rights Act of 1965. This provision prohibits all forms of racial discrimination and voting and it ensures racial fairness in the redistricting process. But the Republican map contains fewer opportunity districts for voters of color than a Democratic proposal and intensely puts two existing opportunity districts at risk, undermining the ability of voters of color to elect candidates of their choice. This is a map that resists the growing diversity of our state rather than reflected in the people of Georgia deserve better. The guidelines also say that maps should avoid splitting precincts, that's especially true this year. When election officials have less time than usual to reassign voters to their new districts before the next election cycle, split precincts are more difficult for election officials and they raise the cost of elections overall. The Republican map splits 184 precincts, which is far more than necessary. And many of those precincts appear to have been split either for partisan purposes or to harm minority voters. That's unacceptable and the people of Georgia deserve better. As two communities interest, the guidelines say to protect communities of interest were possible but the reapportionment committee got an airfall for members, a airfall for members of the public about how their map fails to do that. For example, the map cars up Calvita County and to several pieces and puts rural and frankly, Republican leaning parts of that county in the democratic districts that extend north well into urban parts of Fulton County. When asked why she did that, the committee chair said that it was necessary to comply with other guidelines. But our map, the democratic map, shows that it wasn't necessary to do that. We kept Calvita County intact. And while we're happy to make new friends down in New New New, we also respect the desire to have a representative with whom they see more eye to eye. And the Republican map doesn't do that. The people of Georgia deserve better. The Republican map also violates the guidelines by pairing incumbents unnecessarily. Their map pairs two democratic representatives where in Gwinnett County. The county that saw the largest population growth in Georgia since the last census. Despite the fact that there's an open seat nearby that either one of them could have been drawn easily into those districts. This is a perfect example of politicians using their power in the redistricting process to settle some personal or political grudge rather than to benefit the public good. That's not right. It undermines public confidence in our democracy and the people of Georgia deserve better. Now I want the people of Georgia to know that there's a better map available. It's out there. It's on the website. But the rules of this body are structured so that we cannot even bring it to the floor. We cannot offer it as an amendment. It will not get a vote. If it did, it just might pass. The better map my friends is the map produced by the Georgia House Democratic Caucus. Our map, which was developed with careful consideration and input from stakeholders, demonstrates the Democratic Party's commitment to fair, transparent and an inclusive redistricting effort. Our map incorporates feedback from both the Georgia House Democratic Caucus Statewide Listening Tour and the Reapportionments Committee joined hearings that took place over the summer. Our map also reflects Georgia's diverse population and changing population trends within the state. I'm confident that it's the best map available for all of the people of Georgia. Our map began with an analysis of how Georgia's population has shifted over the last decade. That analysis showed that counties in Southwest Georgia, South Central Georgia and Northwest Georgia together lost more population relative to the state. So those areas had to lose a representative. Our analysis also showed that the Atlanta Metro area has gained enough population relative to the state to make up four whole house districts. So our map adds four districts there. One of the new districts in our map, by the way, is located in Forsyth County, which experienced tremendous growth over the last decade. Now, much to my chagrin, that new district is likely to be won by Republican. Given the political lean is a Forsyth County, but the Democratic map drew it anyway because that's what the population trans dictated. Pure and simple, our map does not play the kind of political games that you see in a Republican map. Our map also takes population equality seriously and results in a much lower deviation than either the Republican or the current map. Our map complies with the Voting Rights Act. In order to be sure about that, we hired an expert statistician, his name, Dr. Steven Popich, who worked in the Voting section of the Department of Justice under both George W. Bush and the Obama administrations to perform racial block voting analysis for George's elections. Dr. Popich found what I think we all know, the Voting in Georgia is highly polarized along racial lines. And that section too, therefore, requires us to protect voters of color when we draw our maps. The committee chair says that she hired a statistician who found essentially the same thing, but we don't know who that is. As a result, our map carefully avoids dismantling any district in which minority voters currently have an opportunity to elect the candidates of their choice. And it creates three new opportunity districts that reflect the tremendous growth in George's diversity over the last decade. The Democratic map also splits fear precincts than the Republican map preserves the core of existing districts and avoids parent and comments unnecessarily, because of the dramatic shifts in George's population over the last decade. Throughout our map, the changes we propose were dictated by the population and the guidelines, and not by trying to secure an advantage for one group or one faction over another. That's what we heard George's demand is, so that's what we tried to do. And our map didn't even get a chance to have a vote. Our map reflects communities of interest like the one in Caluita, and then the one in Athens Clark County. You know, when Reapportion Committee met this summer in July, witness after witness complained about the way the current map splits their county in the three pieces and leaves them represented by legislators beholden to constituencies outside of Clark County that have little in common with the voters in Athens. We listen. Our map, that is the Georgia House Democratic Caucus map ensures that voters of Athens Clark will be able to elect at least two members of the House while the Republican map, the fragmentation was worse, they only, they had more, and they said that was gonna be four. Our map didn't get a chance to be voted on. It's as though the Republicans weren't even listened to you, Georgia. You deserve better than that. We listen. Georgia House Democratic Caucus, listen. With your help, we produced a map that we think is the best plan for all Georgians, but we didn't even get a vote. Our choice today is a vote yes or no on the Republican map, which pales in comparison to ours. That's why I'm voting no. I want House Bill 1EX and why I urge all of my colleagues to do the same. Thank you, Mr. Speaker, I yield the well. We're going on now to the Chairman's time, 20 minutes for the Chair's time, Chair recognizes the Chairman of the Committee, Chairman Rich. Thank you, Mr. Speaker, ladies and gentlemen of the House. I want to take this time to clarify and correct a number of misstatements that have been made earlier in these presentations. First of all, with respect to our timeline, we have been attacked for supposedly rushing this process. The truth is we have been working through this process since the summer to learn about the communities of interest, to speak with members and to hear from members of the public. As soon as the data was arrived, we began an earnest drawing the maps. We published and made public our first draft of the map over a week ago. It was posted on the website. It was made available to not only all of the members of this House, but also all of the members of the public. That map, that first draft, had taken into account all of the public comment that we had received through our public hearings across the state, through our written portal, and it also had taken into account information about individual districts and communities of interest that members of this body had shared with me. Unfortunately, members of the Democratic Caucus had been apparently advised to not meet with me. A few did, these are their files. Every single one of them shared with me information about their districts and their communities of interest. And that was taken into account and was drawn into the map that was released over a week ago. Contrast that with the Democrat member who stopped me after yesterday's vote in committee on this bill to tell me that she has a community of interest and that the map doesn't take it into account. That is something that would have been very helpful for her to share with me over the summer in one of those 88 plus hours that I had made available. That would have been something that would have been very helpful for her to share with me over the last week as have many members here, Republican and Democrat. We have taken into account commentary that we have received from you.\n\nover the last week and where we could, we have implemented those changes. But that person never came to me. That person didn't even show up at any of the three committee hearings that I had. Never testified, never spoke up, never emailed me. In addition to the 88 plus hours that I made available in the four separate emails that went out to every member of this body, I also offered to meet with each and every one of you at any other time if none of those times that I suggested were convenient for you. Some people did take me up on that. Most Democrats didn't, and that's unfortunate for their districts and for their constituents. Interestingly, the Democrats' own attorney at our committee testified that it is impossible to determine a community of interest by looking at a map. The only way to determine a community of interest is to learn about that community to speak to the people in that community and who better than the representatives who represent those communities and those districts. So thank you to all of you who did right by your constituency and shared with me information about your communities of interest. The work that I did this summer and that the other members of our committee did this summer was not in vain. It was very useful. It's part of our guidelines. Speaking of those guidelines, one of the representatives who spoke earlier today had a problem with the guidelines. Thought they should do something different. Well, that's the first I've heard of that. I didn't hear a motion to amend. I didn't hear anybody even ask that we consider a different guideline or that we change any of the guidelines. Just straight no vote. It would have been nice to have that information. We still actually haven't heard what other guidelines we should be employing. Also interesting is that the only bill that is before you today that has gone through the committee process, which is the process that we perfect legislation, is this bill. No other redistricting plan has gone through the process. I heard that it didn't have a chance. Nobody asked that there be a vote on that bill. We had a hearing, we had public commentary. I had no request that that bill be voted on. I also thought it was interesting that this process is supposedly being rushed. When everybody knows, we have deadlines. We have deadlines as was acknowledged by the minority leader, the elections officials are going to have to rush to implement this, these maps, this new data. They have a lot of work to do. We have a job to get done now. And we also very interestingly have provided the most public input and time on the map consideration that I could find in the record for this house. In 2001, this was the timeline. August 14, 2001, the maps were revealed in committee. They were voted on in committee. August 15, the maps were voted on on the floor, the house floor. August 16, they were voted on in the Senate committee, the house maps. August 17, they were voted out of the Senate. That is quite a clip compared to the over one week that we have been looking at this map and that we have been hearing from the public that we have received over 900 comments, three committee hearings, two days of public testimony, everybody who came got a chance to talk. And we have implemented the input that we received, the input that was appropriate, the input that was possible to still comply with the law. We also heard talk about cities. Cities I learned, as you heard from the speaker pro tem, are quite a different jurisdictional boundary than counties. Counties are defined by the constitution. They don't change. City boundaries do change. Something else is very interesting. We have 500 cities. 500 cities in this state. 74 of those cities straddle county lines. Well guess what? Precincts are drawn by the counties within county lines. It is impossible to respect every city boundary. But that is something that we considered. It wasn't a requirement in our guidelines. It is not something that has ever been considered before, but we did and we have minimized city splits. Ask your Democrat colleagues in Smirna and Marietta and Vel Dosta and John's Creek. Ask them. We have done what we could to minimize those. But this is a talking point that is designed to mislead and I am imploring you to look at the facts. There was mention that we have split 184 precincts. I do not think that anybody made that up, but I do have to correct the record here. We have not split 184 precincts. I don't know the number, but it is definitely less than that. And the number, the report that was given and the number that you heard was based upon old precincts from 2018. And drawing our maps, we use the 2020 precincts. So running a 2018 report is going to give false information and result in a higher number of precincts. That was inadvertent, but I felt like I just had to correct the record there. Something else that has been concerning to me, I learned through some social media posts after the fact, but then my information was filled in during the committee process that the Democratic caucus had formal town halls apparently all across the state, wherein they heard from members of the public. I as the chair of this committee was not invited to any of those. I was not even informed of any of those. And neither was any of the other Republican members on my committee with whom I have spoken. It's concerning to me also that none of the information that was gathered at those town halls was shared with me or the committee. If that information were so important, why wouldn't that information be shared with us? Again, I'm just concerned that there are some smoke and mirrors. As I heard, my maps described, my maps, these maps that we have worked on with the redistricting office and with legal counsel who is much more alerted in this area of the law than I am. These maps are smoking mirrors. I'm concerned that some of the commentary that you heard from those opposing the bill today is a lot of smoking mirrors. I want to address also the racially polarized voting analysis. In committee, I was asked if we had conducted a racially polarized voting analysis. And I answered that yes, we have. And that the result was that there was a finding of racially polarized voting. I could not remember the name of the professor who conducted that. I asked for it sitting here and I have again forgotten the name. I do remember that he is a professor of political science from the University of Texas. He is not a statistician. We went and got the gold standard here and we retained a political scientist to conduct that analysis. We did request during the committee meeting when we learned that the Democratic caucus had retained or had had a statistician conduct a racially polarized voting analysis. We requested a copy of that and we were denied it again. Information that apparently is important but that we were denied. I want to reiterate that this is a map that complies with the law. First and foremost, we complied with the United States Constitution and the Voting Rights Act. Then we complied with the guidelines that the committee adopted. The map is fair to Georgia. As an elected Republican woman from Gwyneth County, I am very proud of the number of minority opportunity districts that we have drafted here. My family, my children and I have benefited greatly from our diverse community. We have had a rich experience. Now I know that my neighbors, my friends, my children's friends and their parents, they all have an opportunity to do what I am here to. Our maps have ensured that our maps are representative of our state and I would request a favorable vote on House Bill 1EX. Thank you so much for your consideration. Mr. Clark, you want to ring the bell? Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill? Each one EX will vote I. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1EX. The eyes are 99. The names are 79. This bill, having received the requisite constitutional majority, is therefore passed. For what purpose does Chairman Rich rise? Chairman Rich rise? I would like to make a motion for immediate transmittal to the Senate. The chairman has moved the House Bill 1EX, we immediately transmitted to the Senate. Is there objection? Chair here is none and it is on its way across the hall. The clerk will read the caption to a group of privileged resolutions. The chair here is none and the resolutions are adopted. We have one more first reader. The clerk will read the bill. Senate resolution number 5EX by Senator Dickson of the 45th Goodman of the 8th, Hatchin of the 50th, Anderson of the 24th, Strickland of the 17th, Ratifying Governor Brian Peacamps executive orders and suspending the collection of motor fuel and diesel fuel taxes. Ways and means. We have one announcement. Chair recognizes Chairman of the Higher Education Committee, Chairman Martin for an announcement. Thank you, Mr. Speaker. Ladies and gentlemen, House Higher Education Committee, I just wanted to remind everyone we were scheduled to meet it. One o'clock today, we're still going to meet. Let's get together and get over there by 1-10. We'll give everybody a few more minutes to get there, but we'll try to convene that meeting at 1-10. CLEB 606. Thank you, Mr. Speaker. I yield well. We have a birthday today, and it's going to be a hot time in the old town tonight. Help me wish a happy birthday to the chairman of the regulated industries committee, Chairman Allen Powell. Chair recognizes Chairman Darling Taylor for an announcement. Notice, please, we have a legislative and congressional redistricting meeting today at 430 and CLEB 406. Thank you. I think that now completes the announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 930 AM Friday, November the 12th, 2021. The House will be adjourned tomorrow so that people may observe and pay respect to our nation's veterans. The motion of the majority leader is that this House be adjourned until 930 AM on Friday, November 12th. All those in favor of the motion will say aye. Those opposed will say no. The aye is having it in this House as adjourned until Friday at 930 AM.",
  "updated_at": "2026-02-13T23:23:46.751585+00:00"
}