{
  "video_id": "qC-0HWRKD_8",
  "url": "https://www.youtube.com/watch?v=qC-0HWRKD_8",
  "title": "Rules Subcommittee Special Session for the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 153,
  "summary": "Here is a structured markdown summary of the key points from the Georgia Rules Subcommittee Special Session transcript:\n\n**Overview**\nThe session focused on discussing and debating a bill related to jury selection and closing arguments in civil trials, with testimony from witnesses both in support and opposition of the bill.\n\n**Key Actions**\n- **HB 837**: Bill addressing issues around jury selection and closing arguments in civil trials\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Witness Pamela Lee, a litigator, provided testimony in support of the bill, focusing on how it would address issues around \"anchoring\" during jury selection and plaintiffs' counsel arguments on damages in closing.\n- There was some back-and-forth questioning from committee members to the witness on the role of the judge in instructing the jury on the law.\n\n**Votes**\nNo recorded votes mentioned\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nNo adjournment time or next session date mentioned",
  "transcript": "I'm going to give two hours to the hearing today. My desire today is to hear from the witnesses in support of an opposed to the bill and with specific emphasis on those first few sections I mentioned in the notice. So that's what I would prefer to hear about. But if you want to talk about something else, we'll still let you talk and if you want to talk about the bill in general, that will be fine too. My thought is to spend about an hour on each side. So we'll let with the witness to the hearing today. So we'll let witnesses go for close to an hour. I will also let the sponsor be able to address any questions or concerns that are raised toward the end. So we'll tell you, let's see if I can do some cipher in here. I can figure out the number of minutes you'll have. Thank you. you I think we'll have about for each of the speakers, we'll have about seven minutes. I will allow some questioning by members of the committee, but I would like to keep that sort of limited and focused today. The primary goal is to hear from witnesses on their position on the bill and concerns they have. So we're going to start with those in favor of the bill. Oh, I could too. I'm going to give you any fair warning, but you might open this up quick. Thank you, Mr. Chairman. If you all please join me in prayer. Here, have a look at the link for this opportunity for us to review good policy, to work with each other, to attempt to do important committee work here today. Please be with all members of the general assembly, with their families back home and all Georgians who come here to the state capitol. Thank you, Mr. Chairman. Thank you. Thank you, sir. Appreciate it. All right. For those supporting the bill, I'm going to start with you, and I'm just going to call on you in the order that you've signed up. When I call on you, if you'll come up over there to the podium, and we'll cut the mic going for you. And I'll we'll time in and try to give you a little fair warning when your time's about up. Thank you. Thank you. Thank you for being with us, Mr. Lee. Thank you, Mr. Chairman. Thank you to the committee for having me. My name is Pamela Lee. I'm a litigator and a partner at Swift Curry, McGee, and Hires. I do defense work on in civil cases, and I'm the immediate past president of the Georgia Defense Lawyers Association. I'm here to talk this morning about section one and the anchoring as we refer to it. Section. And I want to talk about how it will apply to trials in a couple of different ways. One, we see very often in board deer where plaintiffs' counsel gets to go first and sometimes can spend hours questioning prospective jurors. And anchoring with numbers and asking them, would they be willing to give millions of dollars to a client before they've even heard evidence of the case, what type of came up with the case? What type of case it is or anything like that? Folks that are uncomfortable agreeing to that ahead of time get more questions and are often then stricken for cause for being biased against the plaintiffs. And what we end up being left with oftentimes are jurors not that are fair and impartial, but that are biased toward the plaintiffs rather than the defendants and who are willing to pre-judge and agree ahead of time to potentially give millions of dollars before they've heard them. Another place that I think this statute solves an issue that we face is in closing arguments, which I understand there's already been some compromise on this, which is good. But what ends up happening is the plaintiffs' counsel gets to go first and last and the defense counsel is sandwiched in the middle. And typically, plaintiffs' counsels will save for the last word arguments on damages, non-economic damages in particular, and will make arguments that have no rational basis to the actual facts of the case. And I can tell you one way that I have seen it play out and we have no way to respond to it because it's the last thing that the jury hears and this fixes that problem. We can tell the jury after they've heard some argument whether or not that's Georgia Law, which they currently don't get to hear. They don't get to know that that standard that's being put in front of them is not Georgia Law. Georgia Law is the enlightened conscience of the jury and putting things that have nothing to do with the case in front of them and having no way to respond to it is an issue. But I can tell you a way that I've seen this play out. I was representing a single mother who was a defendant in her car accident case. Her insurance policy limits had been offered and rejected by the plaintiffs' counsel. And they argued for non-economic damages that it was a job opening for a person with an injured knee and what that would pay for the rest of that person's life. The jury gave in pain and suffering against my single mother client $1 million in damages. And it was assured her during the process of this litigation that if a verdict came back above her policy limits, she would be chased into bankruptcy over that verdict. And it's things like that that the defense counsel have no way to respond to, have no rational basis to the evidence of the case. And we see so many examples of this. And it's really affecting both businesses and individuals. I've got at least one client that has a large self-insured retention. So before their insurance even kicks in, they are responsible for a lot of the verdict that they have. And because of the way that Georgia juries have been the last few years and I think this law helps to fix, they are considering no longer doing business in Georgia. They do a lot of business in Georgia and they are considering no longer doing business in Georgia. The other going back to the board deer issue and then I will yield my time. But going back to the board deer issue, it is also a violet of uniform superior court rule 10.1. The jury really should not be asked how they would act in certain contingencies. They should not be asked anything which amounts to pre-judgment of the case and what is happening is it's very inconsistent how the judges apply this. Some judges will stick by uniform superior court rule 10.1 and not allow those types of questions. The courtroom next door, the judge could rule that those questions can be asked and it is causing inconsistency in the jury selection process as well. Thank you. Thank you very much. Hold on, we have one question. I beg you to keep it fairly direct. Is it on? Thank you, Mr. Chairman. Thank you to the presenter. It doesn't the judge instruct the jury on the law? The judge instructs the jury that non-economic damages are the enlightened conscious of the jury. We frequently see the way that it is argued on closing arguments, especially when it has no rational basis to the facts of the case. It is very confusing for the jury. I have one very recently where, and I have no way to respond, the plaintiffs counsel just said, let's pre-standard to give three times the special damages. That's not standard. That is not the law. And there's no way for us to respond to that. So the jury is instructed that what lawyers say is not evidence, correct? That is correct. And the judge instructs the jury on the law, correct? She reads the law. And everyone in the room understands that it is the judge and only the judge who gets to tell the jury what the law is, isn't that true? That is true, but it is very confusing for the jury when they have been... The reading of the law often takes 30 or 40 minutes and is quite frankly can be boring for the jury. And when they have a lawyer telling them that it is standard for whatever the standard that has been made up for that particular case, it is very confusing for the jury. But your job is to argue. Mr. Chairman, we have two other questions and we are on a tight time line. I understand, Mr. Chairman. I apologize. I think you have made your point, however. Mr. Chairman, a quick follow-up question. Is your...is my understanding what you are describing of giving evidence or giving an argument to the jury? Would it be prohibited by Section 1 that...that example of something that is not based on law but they get the last word? Does it just let the defense counter that? Is it given option? The judge has given option for the defense to counter if something is brought up or does it prohibit them from bringing up things that have no rational... I think it does two things. The wording of the statute or the bill as it is currently written, I believe, does two things. One, it tempers the not being able to argue things that have no rational basis to the case. It also gives the opportunity...it asks for the plaintiffs' attorneys to argue it at their first opportunity which then gives the defense an opportunity to counter whatever argument has been made. So it does both. Thank you, Rupshin. I have a quick question. I do and I think...this is actually working. Is the button that doesn't work? I think it may not work. I have to be sure. The example that you... With the million dollar verdict, what was the policy limits and I think $100,000? Thank you. Thank you. Thank you very much for the testimony. Appreciate it. All right. Let's see. All right. Next up we have Cory. Is it Cory Tire? How are you doing the last name? I just tell the C.R. and if you're with representing anybody and the four years? Yes, sir. I'm Cory Tire from Alma, Georgia. I'm a farmer. Mr. Chairman and ladies and gentlemen of the community, I appreciate you guys giving me an opportunity to tell my story. October of 2013, had a tractor pull out, implement on the back on the four lane highway, turn to the right, and drove approximately a mile and a half coming out of Alma, south of Alma on the four lane highway with a median in the middle. So there was a lot of room to the left of our equipment obviously. And had been on the road for approximately two and a half, three minutes, something like that nature. Lady Cummins, southbound, U.S. 1, she could see the tractor for three miles. It's a straightaway light splashing. It was like Christmas trees going down the road. So all the signs of placards in place, drivers looking in a rear-view mirror thinking why aren't you getting over, why aren't you getting over, why aren't you getting over. So he starts diving off of the road. And she clips side of our equipment and turns her car over. And the whole time we're thinking we're okay because we will follow in the law. So later on we get the later from lawyers obviously saying we're being sued for this accident. How's contactable by our insurance company and by all the others. And anyway, so he sued us for the total limits of a million. And he said he was going to sue us for the other 100,000 because of the limits being so low. And anyway, so we go to the intermediation. The insurance company decided that they didn't want to fight it. So they went in a mediation and in mediation they settled at 850,000. And I lost my insurance for about three and a half, almost four years. How did it have any insurance? That's a young farmer, no general liability insurance. And you know, you're starting to think about it. I think about this daily. I mean, I have equipment on the road every day. We found about a thousand acres of hay in Bacon County. You know, I mean, if anything could happen. And at the time, all I could think was, you know, I just worked so hard to try to acquire our family farm that we've had in our family since 1878. You know, I did what my grandfather did. I put it all back together. And you know, it was a challenge to try to do that. And I kept thinking to myself, man, what if something like this happens again in the next few years? I have no liability insurance. I can't get anybody with carry me. You know, potentially I could lose everything I've worked for at that point, not the mention of family farm, you know. The terrible situation right and by looking at somebody else living in our farm now for my grandpa, this is born. And died, by the way. And I live in that home now. And you know, and that's our story. You know, it's just a challenge for us to be able to, you know, operate every day. Knowing these lawsuits are out there, you know, and we're, and we're fearful. I ain't gonna lie to you. It's a fear. It's a fear we live with, you know, every day of knowing that, you know, people are out there trying to get you, you know. I just remember at the end of it all, hey, a whole lot of details. I remember it some years, but I do remember at the end of it all, the lawyer tell him exactly how he won his payment of $200 and whatever $1000. You know what I'm thinking to myself? Something about this just don't seem right. Just, you know, just didn't seem right to me. That happened, you know, that way. And anyway, that's, that's my story. I appreciate you all getting me off the end of telling. Well, thank you. I hope you have one quick question from Chairman Newton. Thank you, Mr. Chairman. I just want to, you know, on behalf of all of us, I want to thank you for coming. I know that farming is a seven-day-a-week job, especially this time of year. And I know there's a lot of others like you. There's a life many of us don't understand. It don't know. It's very long. I appreciate you letting us know the challenges that we're trying to solve by having this legislation. I appreciate you being here. I appreciate you all being willing to try to do so for the time I really do. I thank you every one of you. Thank you all for all your energy. Thank you, Mr. Chairman. We appreciate to echo Chairman Newton's comments. We appreciate you taking your valuable time to come up here and share with us. Jake Daley. Good morning. I think by now you've probably seen what everybody does. You know the drill. Just go ahead and help yourself. Thank you, Mr. Chairman and members of the subcommittee. I appreciate the opportunity to be with you today. My name is Jake Daley. I am a roughly 25-year attorney. I've done several defense my entire career. I'm presently with Freeman, Madison, Gary, here in Atlanta. I want to try to touch real quickly on a couple of different topics today. First being the stay of discovery provision in section two of the bill. This is a matter of fairness, really, to defendants as well as the reduction of waste and efficiency. The defendants have a statutory right to challenge the legal sufficiency of a complaint by filing a motion to dismiss. Under the current law, doing this would give a stay of discovery for up to 90 days. But if 90 days go by and there's no ruling by the court, then the stay is automatically lifted and the discovery period proceeds. Of course, the current law also requires judges to rule on a motion to dismiss within this same 90-day period, but this often does not happen. The consequences that defendants are forced to participate in discovery without knowing when their motion will be ruled on or how it will be ruled on. We all know if your practice and attorney discovery can be timely and excuse me, time consuming and costly, so this can be a real problem for defendants. It's simply not fair for defendants to be required or forced into participating in discovery when they have chosen to exercise their statutory right to challenge the complaint. I'd like to read a quote from the case from the 11th Circuit Court of Appeals, because they say it probably better than I can when they talk about the usefulness of benefits of a stay. The court said in this particular case, if the district court dismisses a non-maritorious claim before discovery has begun, unnecessary costs to the litigants and to the court system can be avoided. Conversely, delaying ruling on a motion to dismiss such an abuse, excuse me. Lying ruling on a motion to dismiss such a claim until after the party's complete discovery encourages abusive discovery and if the court ultimately dismisses the claim, imposes unnecessary costs. For these reasons, any legally unsupported claim that would unduly and large scope of discovery should be eliminated before the discovery stage, if possible. Court went on to say, allowing a case to proceed through the pre-trial processes with an invalid claim that increases the cost of the case does nothing but waste the resources of the litigants and the action before the court. Delay resolution of disputes between other litigants, squander scarce judicial resources and damage the integrity and the public's perception of the federal judicial system. Back to turn then to section three of the bill dealing with voluntary dismissals. The current rule allows a plaintiff to dismiss a case all the way up to the time the first witness is sworn. This is a real problem because it could require a defendant to go through full discovery, depositions, experts, trial preparation, and then you're at the beginning of a trial and then the plaintiff decides to get to dismiss the case. We've heard valid reasons in other testimony in the Senate Judiciary Committee for example, but what they don't mention of course is maybe they just don't like the jury that was chosen. Maybe there's a pre-trial ruling that they don't like now. Maybe the plaintiff's attorney realizes, gee, I wish I had another expert on such and such topic. Whatever it is, the possibilities are endless at that late stage and these of course are not options that the defendant has. All this bill would do is limit the time when a plaintiff could voluntarily dismiss a case. And as with section two of the bill, this is really just about fairness in reducing waste and inefficiency. And I'd like the subcommittee to really take note of the fact that in the Senate, this current version of the bill is already reflects a compromise between the two main sides of this issue. So given that that is already been negotiated from basically the time of the answer to 60 days after there's no reason to now change that again. I'd like to also touch real quickly on section five seat belt evident through. There's a lot I'd like to say about it, but there's four main points that I'd like to make. First, the current law treats safety devices different for no valid reason. Georgia law currently allows evidence of a person's failure to wear a motorcycle helmet, but does not allow the corresponding evidence of the failure to use a seat belt. There's no reason for such a distinction in the law. The opponents of this part of the bill frequently talk about the prejudice that it would cause to their clients. This is probably about the fourth or fifth time over several years that I've testified about this issue. And never once have I heard the opposition explain how this evidence is prejudicial. Prejudice is something far more than it hurts my case, but that's really what their argument amounts to. The courts before this current law was enacted in 1988 admitted this evidence. It was always found relevant. It was never found prejudicial. There's no reason why you have to have a special rule for this evidence. Third point is that admitting evidence of a seat belt's non-use is more consistent. I said I would tell you when you get close, you're under a minute. I just want to let you know in case you need to. Thank you. This evidence is consistent with modern concepts of comparative negligence and proportionate responsibility, which this body has enacted several years ago in the form of the statute that does away with joint liability and proportional responsibility. So with that, I hear my ding. I will stop if there are any questions. I'd be happy to adjust. Actually, it's not the ding from over here, but I'll take the cessation of testimony in case there are any questions. I think Representative Evans had one. Thank you, Mr. Chairman. Thank you for coming and sharing your testimony. How long have you been practicing? About 25 years. I'm embarrassed to say I'm getting close to you. Surprise me. I'm sure it's ever been that long. How often have you had, in cases where you filed motions to this miss, how often have you had those ruled on to your memory within 90 days? Ever? Absolutely. Majority being much longer. I don't know if I can characterize it as a majority, but some judges are particularly better than others about scheduling hearings, and the hearing is most of the time what prompts the decision. But if you don't ever get on a hearing calendar, then a lot of judges offices just don't even know that it's the motion dependent. Have you ever waited over six months for a ruling? Yes. Have you ever waited over a year for a ruling? Yes. Have you ever waited over a year and a half for a ruling? Yes. Have you ever waited over two years for a ruling? Yes. Have you ever waited longer than that? Yes. What's the long as you've ever waited? I have a motion currently pending for six years. You would agree with me that the passage of time, states, memories, documents, leave, employees leave, there's a lot of change in companies that makes it difficult to get evidence. If discovery is prolonged for too long, would you agree with me? Sure. Sure. But I'd like to say, though, that is a judge problem, not a stay of discovery problem. The statute requires a ruling within 90 days. There's another statute that a lot of people don't know of in Title 15 that requires rulings on all motions within certain time periods, depending on the size of the county. 30 days for counties under 100,000 people, 90 days for counties, over 1000 people. And that statute actually provides that it's an impeachable offense for a judge not to comply. I agree with you. I agree with you on all those points. Do you have any suggestions for us recognizing that neither party, plain of defendant, can not control a judge ruling and as a practitioner, a fellow practitioner, you're probably as resistant as I am to pound a judge to rule on a motion. Because we know how that will go. Do you have any suggestions for us about how to make sure that the burden of motions lingering and those decisions lingering can be dealt with, recognizing that our judges are strapped to you. But do you have any suggestions for how we might make sure that motions are ruled on more timely and not as this bill does in my opinion, puts all of the sort of the negative effect of a delayed motion on the plaintiff. In this instance. Well, it's not. Respectfully, I don't agree with the premise. And listen, because I know the chairman doesn't want us to talk forever. So I know you don't agree with my premise. But let me just go back to my main question, which is, you have any suggestions about how we might help move motions along and enforcement of the rules that you've mentioned or already in our code that require judges to rule within a certain time. But the reality is they just don't. Yeah, I mean, it is admittedly a difficult question because it's hard to statutorily require judges to do certain things. There'd be problems with that. I know when I was a law clerk, my judge just told us prioritize all motions to dismiss so they would get ruled on and not have this problem happen. I don't know if there's a way to just encourage that. But it's maybe reporting of sale motions by the clerics, which I think that would be helpful. It works with some federal judges. Some of them don't care about that when those reports come out. Others do. So it's certainly an option to consider that. Thank you. Well, and if you come up with any suggestions after you leave here, please note that we're all ears. And thanks again for being here. Absolutely. Thank you. Thank you. I think Representative Miller has a question for you. Thank you. Please, be brief if you would. Thank you. I know what you did. I'm going to make up for it. Thank you, Mr. Chair. A just a question for you. I'm trying to quantify this issue of lingering motions to dismiss and what the real harm is. Can you tell us if there's any data or statistics about how many motions to dismiss that are filed by defendants in these cases are actually granted? I'm not aware of that being kept as a statistic. There are ways that you could somewhat figure that out, at least just by doing some hand-to-hand sort of reviewing of court of appeals decisions. Have you done that? I have not. And can you give me a sense in your own practice of all the motions to dismiss you file in-state court on personal injury cases. What percentage of those motions are granted? It's fairly low overall. It depends on the nature of the case. I've had great success in arguing motions to dismiss on issues like any item notices. If you are arguing the merits of a claim, that's a lot more difficult to convince a court to dismiss. So it depends on what the subject is. It's a clear cut issue, statute limitations, jurisdiction. Those result in a lot more orders granted. And of the cases that you had where judges have failed to grant, excuse me, to decide motions to dismiss for these really lengthy times. Have you ever filed a JQC complaint? No. I don't know any lawyer that would want to do that. Thank you. One quick park you had one rapid fire quick question, I believe. Yes, sir. Thank you, Mr. Chairman.\n\nof what relevance is seatbelt evidence to causate? It could be a great relevance depending on the type of injury, you know, certain injuries. If you're belted, you might get a bruise chest, for example, on the seatbelt. If you're unbelted, you might be ejected from the car accident causation. Oh, the accident. It's not. But that's not the proper way to look at this issue because the correct way to look at it is, when is the torque complete? You don't have the cause of action just because there's contact between the two cars. The cause of action is complete when the injuries occur. So that's the better way to look at it because that's when you have a complete torque that can be seen on. Thank you. Thank you, sir, for your testimony. I appreciate it. We have, is it Brent Walker? We're still in the morning. It's a good morning. The mic should still be on when you're ready. Good morning, Mr. Chairman, members of the committee. Thank you for the time to be heard on this very important bill. My name is Brent Walker, and I'm General Counsel for the Medical Association of Georgia. And we rise in support of Senate Bill 68 and ask for your favorable consideration of this bill. For myself, I've been a practicing attorney for about 18 years prior to joining MAG in private practice. I've been a litigator on both the defense and plaintiff sides of medical liability issues in both Alabama and Georgia. Medical Association of Georgia itself is for 175 years been the leading advocate for patients and physicians in the state of Georgia. And has been around these issues for quite a long time and has a long institutional memory regarding them. About 9,000 physician members across the state in many different and varied geographic and practice specialties. And, you know, year in and year out, when we survey our members, civil liability is the leading concern amongst physicians. Because it has direct impacts on the practice of medicine and the outcomes for our patients across this state on a daily basis. I think it's apparent from the testimony and the reasons these bills have been brought forward over the last year that our system of civil liabilities profoundly out of balance. And nowhere is that more acutely felt than in the context of medical liability. The state of medical liability has a profound impact on access to care, costs of care, and our ability to recruit and retain physicians. This is important at a time right now where Georgia is 4,000 physicians short of meeting the national average. By 2030, we're projected to be 8,000 physicians short. Nearly 150 of our counties are federally defined health professional shortage areas. One third of our practicing physicians are at or near retirement age. In every year we lose about 50% of our graduates from residency programs across the state who elect to move to other states. And one of the leading reasons of this is the medical liability climate that our physicians face. Right now in the state of Georgia to resolve a medical liability claim just for a physician, the average cost is around $630,000. Over the last 10 years our physicians alone have paid out over $1.5 billion to resolve medical liability claims. What we see is a direct impact on the medical liability premiums that we have to pay across the board. Since 2016 medical liability premiums have increased almost 90%. We see general specialties like OBGYN and general surgery faced with premiums for 1,000,000,000 policies in excess of $100,000,000, which can really be cost prohibitive for physicians looking to enter private practice and as a distinct burden on our hospitals in particular. Who operate sometimes at deficits in rural areas and constantly require the assistance of our state to keep their doors open. And even with all the support that you provide, their essential services like emergency rooms and labor and delivery centers are being closed because of this issue. Fear of litigation is very real for our physicians. And it's not just the financial costs that we experience but there's a distinct emotional and intellectual toll that's being taken on our physicians that prevents them from continuing to practice or impacts disproportionately where they elect to practice. Far more often times than not we see new physicians entering into employed practices at large institutions or with large practices centered in urban areas to the detriment of our rural areas because of the costs associated with this issue. It also results in higher costs because of the very real nature of defensive medicine that's being practiced by our physicians because of the fear. Most physicians will tell you that they're able to make a pretty sound diagnosis and the nature of differential diagnosis is really important but they don't typically have to order a lot of extra tests. But the fear of litigation drives them to order extra x-rays, extra blood tests, just to cover themselves in the event that they're hauled into court under an accusation of malpractice. And that cost in many cases is born directly by the patients who have health care insurance plans with very high deductibles. In 10 years speaking for myself personally my wife and I only met our out of pocket maximums in two years and those are the years that our children were born. So it's very rare. Otherwise we were bearing the cost of emergency room visits, blood tests, streptest, you name it. And that's a very high cost and a time when the average family can't bear an unexpected $500 bill and lives paycheck to paycheck across the state. And it causes our patients to delay care and this is a very important issue. The five sections that we're here discussing today are very important. They represent very reasonable changes to procedure and with seatbelts the way evidence is presented in our courts. That work to create a civil liability system that is fair, predictable and efficient. In no way to these reasonable reforms impact the ability of an injured party to bring a claim in court. It simply changes the rules that impact how the juries are going to hear this and how the evidence ultimately makes its way to them. And this is really important in medical liability cases because these are regardless of the estimated value. Some of the most complex cases that our courts handle on a daily basis because of the requirements for expert testimony. And when cases are really important and really complex, the rules really tend to matter even more. For instance in section one regarding angry one minute. That's very essential because I've followed a case in Cald County recently with a catastrophic injury against an emergency room position. And what we found was that during the course of the trial it was suggest the value of those injuries was between $203 million which is really devastating to the physicians and the practice of medicine. Ultimately a defense verdict was found but it closing arguments they asked for about $170 million. They're anchoring these really high and that's important in medical liability because you have catastrophically injured patients that were already sick to begin with. We talked about voluntary dismissal that's really important to bring us into conformity with the federal rules in our neighboring states. Because what we see is that's leveraged against plaintiffs to create higher settlement values. I mean against a dentist to create higher settlement values. In medical liability we regularly see 200-300 pages complaints. Along with affidavits exhibits and piles of discovery and erogatories request for production and request for admission that the plaintiffs have had months to prepare and investigate. And now the defense has 30 days to respond to all of this. It creates an incredibly unfair and expensive situation from the exception of litigation that's unfair for our physicians. On voluntary dismissals it's also essential because again it's costs the rules are being leveraged against our physicians in order to create an unfair and unjust playing field. And finally on seatbelts regardless of the evidentiary commonsense that makes us an important public policy decision that we encourage our physicians are people in the state of Georgia to be safe because our physicians in the emergency rooms will tell you they're tired of seeing folks not wearing their seatbelts. Thank you and I'm happy to entertain any questions. Thank you. You have a couple of questions. I mean what park was the first one to request? Thank you Mr. Chairman. Based on the National Practitioner Database paid claims that are decreasing in premiums over time when adjusted for inflation and population growth is stable. Can you provide me the actual source for your claims? That is the National Practitioner Database. And I would dispute the number that you're offering there because that is such a qualified number to meet the narrative that numbers are about to screen. What we've seen over the years is an increase not necessarily in the frequency of medical liability claims but in the severity of claims. Again 20 years ago the average settlement value and resolution value was around $330 to date it's $630,000 and that's a very real number for our physicians. If you could provide me a source. I'm happy to provide that to you. I have a few more questions if I may. Is it not true that two more questions Mr. Chairman if I may he'll be quick. Is it not true that medical law practice premiums have fallen by 19% from 1990 to 2024 just for inflation? That is not true. Again if you could provide me written source for you. Is it not further true that in states that have expanded Medicaid you have not seen their hospitals either rule hospital that is shut down and we've seen lower premiums for individuals in states that have actually covered their uninsured population as opposed to these claims of medical malpractice insurance increasing. Well the way in which Medicaid expansion is addressed is an important factor but the driving factor right now is medical liability claims particularly in the state of Georgia. And while expansion of the payer mix in rural areas might incentivize physicians to enter practice there it's not a good incentive to reduce medical liability premiums or anything like that. The hospital closures are very directly related particularly in surgery emergency medicine and obstetrics and gynecology to the high costs for the malpractice premiums that they have to pay to support this. And really in order to meet the standards of care the numbers of physicians that they have to employ that they simply can't afford to do. Happy to take another question. Thank you. I've got our Williams at the end here. I've got a question for you. Thank you Mr. Chairman. Thank you sir. Thank you. Just a morning. Since very interesting things I have a question. My question is let me predict with this. I've spent the last three four years traveling this state working on problems through the rural development council where we looked at rural hospital physicians. And I must admit that in all the testimony I never heard and we heard so many problems that are posing a hospital and why physicians are not coming. I've heard from beings of medical schools as well as physicians and never once have I heard that we can't get physicians because of premiums. Well that's very interesting and I have a completely sort of different set of data and in the governor's round table last summer that point was made abundantly clear by our physicians and hospitals in that effort. But the amount of premiums that are being paid as an associated cost with the entry to practice of medicine are very profound, especially for private practice positions who are the most likely to practice in rural areas and provide additional care. And that's something that I see day in and day out with the positions of members of mag. This is a massive issue particularly for our core specialties that are higher risk like general surgery and OBGYNs. A typical OBGYN can pay $120,000 for a 1 million, 3 million policy with no excess coverage. That's a tremendous line item if you're trying to start a practice. Not to mention the amount of equipment that you need in the clinical settings that only a hospital or institution can provide to be efficient and meet the standard of care for labor and delivery. So they are constantly being deprived of their ability to access rural areas and establish the practices. Thank you. Speaking of doctors. Thank you, Mr. Chairman. I appreciate your work on behalf of patients and those who care for them. I've had some conversations with fellow members of our subcommittee regarding auto insurance rates and one of the questions. So when we bring up malpractice rates, one of the questions is are the insurance companies just getting rich on this or is there something else going on? My understanding from my auto insurance friends is that many auto insurers and truck insurers have actually left the state. I would contend nobody leaves the state because they're making too much money. They don't drop their policies. Have you seen in hospitals or medical malpractice carriers of any of them leaving the state? Yes, we have. We're starting to see very distinct trends within the medical liability insurance markets. About 80% of us covered by four very large insurers and several of them have stopped writing new policies in certain areas of the state leading to a contraction in the availability. Down on a downward look of the scale. A lot of hospitals and physicians groups have captive insurers to re-insure the frontline policies of the physicians. And a lot of those are either ceasing operations in the state or they're stopping the issuance of new policies because of the prohibitive costs generated by the civil liability system in the state of Georgia. We know that these reforms are incredibly effective because I can tell you in the context of medical liability the last time we did a major reform in Georgia in 2005 by 2007 medical liability insurers had reduced premiums by 10 to 18% across the board, which is a significant savings for our physicians and the patients that benefit from the lower costs of that. So there is a profound impact that can be had by these very reasonable reforms to the way our courts handle liability cases. Thank you, sir. You're absolutely right. I was going to mention with the whip park when he mentioned that 1990 till now. There was a decrease. I was running an emergency department group back in 2005, 2007 at time frame that when we did see we were able to hire an additional physician to take care of patients with the savings on malpractice liability at that time. And it was a good effort is 20 years later now. So look forward to moving. Thank you. I believe. Representative Evans, you have a question. Yes, thank you, Mr. Chairman. Thank you, Mr. Walker. I wanted to talk about the recruitment of doctors. And I appreciate the concern for having doctors particularly in rural areas. And I'm originally well, represent Atlanta now. I'm originally from a little part of the state and I couldn't agree more that that's important. When you agree with me that recruiting doctors of rural areas, it's not just a problem in Georgia. That's a that's a national issue. It is a national issue, but it is particularly acute in the state of Georgia. But in Georgia, even with the difficulties that we sometimes have recruiting not just doctors, but other professionals, sometimes the rural areas. Georgia's actually seen an increase in physicians moving to rural areas over the last 20 years. And those numbers have been stable for us in Georgia. Thank goodness. Probably because of the work done in this body with a rural development commission. We've been stable in our numbers at least since 2000 if not increasing. Would you agree with me on that? Well, I would disagree with you. If not, could you provide me the data and tell me why the efforts that we've taken are not working here? As a general proposition, we have seen over time an increase in a number of physicians. I believe that the health care workforce board is tracking about 27,000 resident physicians. We've seen over time about 25,000 the last time they did their biennial survey. Unfortunately, we are still tragically short of the needs of our growing population. I mean, we'll add another million people in the next five years that require additional care from physicians and nurses and our nurse practitioners and physicians assistants. And it's really essential. We haven't kept pace in the ability to deliver the appropriate levels of care. And again, I would point that despite the hard work that we've done, and it's something that should be applauded, and we have to continue doing that. But we still have the vast majority of the state of Georgia that is a health professional shortage area. But numbers are going up. The numbers have stayed relatively stable, but I expect that they're going to continue to decrease relative to the national averages. And Georgia is going to remain in the bottom 40 when it comes to physicians. Final question from me. Recruiting doctors, whether it's rural areas or just to the state generally, there's a lot that goes into that. It could be quality of life. It could be availability of real estate. When we got private equity, buying up our all of our homes, it could be any number of things, including specifically for OBGYNs. Certainly, you can't exclude as an issue that we have statutes on the books in this state that criminalize OBGYNs for providing life saving care to women. Isn't that true? I have heard the statement made and I'm willing to accept that that has an impact on our ability to recruit. However, most of the evidence right now is still anecdotal. The statute that you're referring to was passed in 2019 and took effect in 2022. The numbers that we have from before 2020 already demonstrated an impressive and alarming decline in the number of practicing obstetricians and labor and delivery across the state. 2020 had a shortage of 80 families. We had a lot of restrictions around the care of women and the extra scrutiny on pregnancies and how abortions might be dealt with before the heartbeat bill. You would agree with me on that, I think. There was a lot around it, but more recently, it's hard to determine what the impacts of that legislation are right now until we get updated numbers on our healthcare workforce, which I don't anticipate. We'll see those until later this year, early next year. Thank you. Thank you. I think there's a Miller. You have one quick question right here like I think. Thank you, Mr. Chairman. My question is this during the period of COVID-19, there was a virtual shutdown of our judicial system. You would agree with that, correct? Yes. And yet medical malpractice premiums continued to rise even though there weren't any verdicts happening for years, correct? But there were still settlements of these claims that were happening in the background. I understand. So then if there was a obvious decrease, right? Naturally logically speaking, can you explain to me why the insurance industry continued to raise premiums on your doctors? There's a correlation between the two. Well, the pandemic did effectively shut down our courts for a period of time in toll cases. We've seen a significant uptake in medical liability cases after the tolling of the pandemic. If anything, what the data from the MPD shows is that was something of a plateau in claims, but just because the courts were closed didn't mean that claims weren't being demands weren't being sent and claims weren't being made outside of the filing of complaints. And during the pendency of cases while the courts were closed, I mean, there was still a cost associated with that. They barely had time to keep up with. So there was a distinct impact. It was a bit of a silver lining that there was a decrease in the number of verdicts, honestly, on a terrible time in the history of this country. But we've seen it catch up in the numbers lately with the rise in the average settlement values and the numbers of verdicts that are coming out and we're still distilling what the full impact of that is. Thank you. Thank you very much for your testimony. Appreciate it. We have Dennis Keen. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Pam Brocker.\n\nGood morning. George Erasmus Brunner. Thank you, Chair and thank you, subcommittee members. I am Pam Brecher and I am with the American Trucking Association and I'm here on behalf of the ATA as well as the Georgia Motor Trucking Association. The more importantly than my role at the ATA, I am a proud defense trial attorney of 27 years on licensing the states of Georgia and Tennessee and I have practiced exclusively or primarily when I was in the courtroom in Georgia and Tennessee. Through my career prior to the ATA, I was in-house for two different trucking companies and I had the experience of litigating quite literally hundreds of personal injury lawsuits in the 48 states. So I have been privy to lots of discovery, lots of depositions, lots of settlement negotiations and making the decision to attend when a case should go to trial and be present at the trial. In Georgia, one in 12 Georgians are employed in the trucking industry and 76% of Georgia communities are completely dependent on trucking for the goods they consume. Nationwide, the trucking industry employs 8 million workers and invest $14 billion annually in safety. We are nothing without trucking and Georgia trucking companies are a critical link between Georgians and the marketplace. Some legislation like SB68 is going to remove some of the barriers to economic development of Georgia trucking companies and it opens up the door for overall economic development. Our second speaker, the farmer, touched upon this, excuse me, I forgot that gentleman's name. Trucking companies are not supporting SB68 because we are trying to evade or elude responsibility. We believe that when a driver acts negligently and that negligent conduct injures others, then the truck driver should be held accountable. The purpose of tort litigation is to make the plane a poll and to restore the plaintiff to the place she or he would have been had the collision not occur. Our civil justice system here in Georgia is not designed to be random or unpredictable. It is designed to provide proper remedies for injured people and incentivize responsible actions. In consistent verdict amounts negatively impact the state's civil justice system and in turn the state's economic and human resource development. There are studies that have been put out by the Perryman Group which is a Texas-based economic and financial analysis data center as well as the U.S. Chamber of Commerce Institute for Legal Reform. And in between 2022, 2023 and 2024, three studies were released. In 2023, the Perryman Group, based on its results, found that there was an estimated excess lawsuit cost in the state of Georgia, a sort of a tax, if you will, of $1,561 per person or $3,965 per household. The ILA are the Institute for Legal Reform. In 2022, the 2022 report had $2020 saying that the Georgia tort cost per household was $4,157. And then in 2024, when they released the report based on $22, it was $5,050. So in a two-year period of time, that was a 21% increase of cost per household. Your neighboring states, Georgia's neighboring states, South Carolina, Alabama, and Tennessee have all had lower costs, lower tort costs as estimated by those groups. Florida had a higher one, and as everyone knows in 2023, Florida passed its reform bill, HB837. And just a few weeks ago, the editorial board of the Wall Street Journal published a report to show that the reform legislation that was passed in Florida is making a difference. 11 new insurers have entered the Florida market. 477,000 policies have shifted from citizens' property back to private insurers, the private market. Four of the top 10 insurance carriers have filed for rate decreases. The lowest average homeowners increased nationally at 1%. Auto insurance, auto insurers filing for rate decreases included Geico, Progressive, and State Farm. So those are just some of the progress that's being made in Florida. I want to touch upon real quickly three aspects specifically of SB 68. First, on the anchoring, I don't want to repeat what Ms. Lee said, but I would like to say that this has become a technique that is used not just in argument, but during jury selection opening statements. And without even realizing it, jurors are finding these numbers reasonable because of how it is suggested to them. Anchoring is a technique that's used in sales and marketing. The Georgia provisions in SB 68 that speak to anchoring are consistent with Supreme Court opinions that have been issued in other states that have attempted to rail in improper anchoring. The most recent one is Gregory V. Choham, which was a trucking case. And the Texas Supreme Court said that the plan of attorneys comparison to a $186 million work of art and a $71 million fighter jet was unsubstantiated. And it clued in on the same language that you see in SB 68 that there needs to be a rational relationship to the evidence when damages are argued. On seatbelt gag rule, I did want to share this one thing. As I was preparing these comments last night, I saw a plane of attorney commercial that actually said it was all about wearing your seatbelt and promoting the fact that people should wear their seatbelts so that they aren't injured or that their injury isn't more severe. So I find it inconsistent that a plane of attorney can advertise that way, but then in the state of Georgia, a juror can't learn whether or not the plane of was wearing his or her seatbelt. And then finally, because I may not be here, I want to talk about the medical damage provisions in Section 7. Man, finish my thought. I just wanted to say that the way that medical billing works now is certainly changed and it's very complicated. And when jurors go back and deliberate, they make up stories about how health insurance comes into play. And so I think it is what SB 68 seeks to do is consistent with giving them the full picture so that they know truly what the actual damage amount is and how to make that plane to pull, which is consistent with the purpose of our toward system. So thank you for your time today. Thank you. I don't say any questions like very much. But we do have one. Thank you, Mr. Chairman. My dad was a truck driver this recently. He came off the road long haul over 30 years. So thank you for your service to the truck drivers. So number one employment of men in the country. Rising number of women, I'm proud to say. And it is a pathway for women to own their own business, especially independent contract or ship. But that's not your question. Yeah, exactly. But we can talk about the loveliness of trucking all the way. Another time. I wanted to talk about the roads though. You were comparing us to other states, but Georgia has, we have a lot more interstates than our neighboring like Alabama and Tennessee, for example, because we've got the, we've got 85, we got 75, we got 20, we got 95, I'm sure I'm leaving several. But we've got more. You would agree with me. You have more in the sense of I agree like 285. But I mean, Tennessee was 75 and 40 is quite crowded and we have our own congestion problems. And Georgia has twice as many accidents as the national average. You would agree with me on that. Honestly, I don't know. That's just statistics. I don't have anything to do with me. You don't, you don't have any reason to disagree with me. I don't have any reason to. But even with that, even with, in Georgia, you're twice as likely to get into an automobile accident. On average, Georgia don't pay that much more than the national average. Do you have any information to read about that? Georgia don't pay much more than the national average, even though they're twice as likely to get into an accident. I don't know about, you know, personal lines. I can tell you that in commercial, in the commercial auto space, the insurance, market for commercial auto liability insurance in Georgia is quite tough because Georgia is considered a judicial helical. And there's lots of reasons why how commercial auto is priced the way it is. One of it is a particular company's loss runs and loss history as well as the legal environment in a given state and other factors. And there are insurance companies that have left on the excess tower the state of Georgia for commercial auto. But we're not out of whack with the number of insurance companies making up the vast majority in market. I think the average is about 10. We're not outside that norm. I'm not sure that I understand your question with how you're praising it. I do know that it is harder to get commercial auto liability insurance, especially above primary layers in the state of Georgia as compared to other states. I hope that others will. But if you could provide us with that, I think that would be really helpful. Yes. Because I've been probably providing some more specific information around rates. Yes. I understand that the cost of defending claims in Georgia, those actually less than the national average. Do you agree with that? Or do you have any of those? Not based on the work of the Pyramid Group and the US Chamber ILR. No. It is not. And you can provide us with those requirements. I can provide you with those reports. Yes. Thank you. Yes. Thank you very much. Thank you, Mr. Chairman. So for me, I'm learning as much about this as I can. Is your expectation that trucking insurance rates will fall with passage of this bill? Can you point to a state in which that's occurred? Florida. I just gave the statistics that were summarized in the Wall Street Journal editorial that was published mid-February. And that has since Florida passed its tort reform legislation in 2023 its markets have opened up. And the City of Florida is currently revisiting some of that tort reform. There is a bill that has been filed, but my understanding is that it will not be successful. Thank you. One question from Chair Lee DeMille. Thank you. You cite the work of the paraman. Is it paraman? The paraman group out of Waco, Texas. Okay. The paraman group on tort costs. Are you aware of the Wall Street Journal article called economist Ray Perryman is hailed as a genius for self-promotion, calling him the most bought economist in Texas? I have not aware of that Wall Street Journal, but again, his study was not the basis of the separate US Chamber of Commerce Institute for Legal Reform study. Thank you. I will see you guys in the questions. And I apologize for a butcher in your last name. You can blame our pediatrician Charles Brocker. He taught me to pronounce it that way. Is it Jimbo Floyd? Thank you, Mr. Chairman. Good afternoon, Chairman and committee members. My name is Jimbo Floyd. I'm the President of Turnwood and Smith Insurance in Gainesville, Georgia. This year, I have the honor of serving as the President of the Independent Insurance Agents of Georgia. This is a distinguished role that I take very seriously as I represent over 500 agencies and more than 5,000 of my peers. Thank you for allowing me to speak with you today and a special thanks to the Chairman for taking up this crucial issue. Many people are not familiar with what an independent insurance agent is. Tell me, explain. We serve businesses and individuals by leveraging our relationships with multiple insurance carriers to ensure that our clients receive the best possible coverage at an affordable price. Today, independent agents represent, excuse me, about 87% of the business insurance market in Georgia and help protect about 30% of Georgia households with personal insurance. I'm here today to strongly support Governor Kimps' Tortreform Bill. This bill is essential to stabilizing the Georgia Insurance market and ensuring that all of our small businesses can continue to thrive. After more than 20 years in this industry, I feel like a firsthand knowledge of how Georgia's legal environment is crushing our business. Let me highlight a few of the challenges we're facing. First, non-renovals. Insurance carriers are not willing to work with businesses that are at risk. If a business even has slight increase in claims or losses, we're finding that carriers are pulling back and non-renovable policies rather than trying to work with the customer to improve the situation. This makes it difficult for business owners to find affordable coverage, which in turn threatens their ability to stay in business. Lack of availability in the market is it becoming increasingly difficult to find coverage for essential businesses like apartments, hotels, grocery stores, and the standard marketplace. Insurance are citing recent legal rulings that have made Georgia a less favorable state in which to do business. The shrinking umbrella market. In the past, we could offer businesses umbrella policies with limits that has $10 million without much trouble. Today, carriers are scaling back those offerings to 1 million or eliminating them entirely. This leads business owners vulnerable to catastrophic losses. Exclusionary clauses. We are seeing more and more exclusions and insurance policies for things like firearms, assault and battery. This not only limits the protection business owners have, but it makes it harder for them to secure a comprehensive coverage that they need. I'm proud to represent my clients, Georgia business owners, and I can tell you that these insurance challenges are becoming untenable. As we have seen a dramatic reduction in carrier options and more restrictive policy exclusions, it is becoming increasingly difficult for us to find affordable and comprehensive coverage for our clients. For years, I have served as an advisor to several insurance carriers, and each of them is pointed to Georgia's legal environment as a major factor in their decision to pull back from the state. Charters are simply less willing to do business in the state where the legal climate is unstable. Let me clarify some key statistics that we talked about earlier here. In 2023, Georgia's insurance carriers paid out a dollar for every dollar they collected. That results in an underwriting loss of $1.28 billion in the state of Georgia. In commercial auto, alone, carriers lost nearly $265 million in 2023. For private passenger auto, the losses amounted to $783 million. Georgia ranks 47 out of 50 states in commercial auto insurance profitability and dead last 50 out of 50 in private passenger auto. These are not just numbers. They represent real consequences for Georgia's businesses and consumers. Small businesses, childcare facilities, convenience stores, churches, apartment complexes, affordable housing providers, they're all seeing their insurance premiums soar and coverage options shrink. If this trend continues, many of these small business owners will be forced to close their doors. The Georgia insurance market is in crisis. Carriers are leaving the state and fewer are willing to write new business. This is reducing competition and as competition shrinks, rates continue to climb while coverage options are reduced. I've spoken to many senior agents who have been in the business longer than me and none of them can recall a time when carriers are exiting Georgia as quickly as they are today. We must reverse this trend and try to restore Georgia to a healthy competitive marketplace. Now I want to take one moment to address an important part of the bill, the principle of truth in our legal system. Telling the truth is never a bad idea. This bill ensures that the jury is presented with all the facts of evidence. The truth is powerful. It's what we, as business owners, rely on to make sound decisions. And it's what every party involved in legal matter is entitled to here. The reform proposed in this bill would help restore fairness to the courtroom by ensuring that juries have a clear and full picture, unclouded by misleading or incomplete information. This will lead to more just and reasonable outcomes for everyone involved, including our businesses and the entire state of Georgia. Governor of the campus team has shown tremendous leadership in working with stakeholders from all sides to develop a plan to restore balance in our legal system. The changes outlined in the total form bill are exactly what we need to ensure Georgia remains a state where insurers want to do business and where businesses thrive and where coverage remains affordable and inaccessible. I urge this subcommittee to vote yes on Senate Bill 68 as recommended by the governor, the future of Georgia's economy and the businesses that fuel it, depend on it. Thank you. Thank you, Ms. Florida. I think you have a question. Good evening. Thank you, Mr. Chairman. Thank you for being here. There's a lot of numbers there. One of the numbers that stuck out to me was you were talking about not making money off of premiums. But that's not where insurance, you would agree with me. I think the insurance companies are not expecting really. They're not trying to turn a profit off premiums. Their place to make money is investing the money that they get from premiums while they're not using them. Much like a bank uses our deposits. I don't know that would agree with the premise of that. I would say that all businesses are trying to make a profit if you're a business. I think what you're alluding to is that yes, there is investment income because unlike many businesses, insurance carriers are, they have to carry lots and lots of reserves in order to pay claims. So yes, do they use those reserves to invest? Absolutely. Their parameters around that investment. Yes, they do. If the stock market goes up, then yes, they can make money. That's the profit maker. That's the profit maker. It's not premium. If the market goes up, if the profit maker, if the market goes down, it's a loss. You don't have any reason to disagree with me. I don't think that when premiums go up and down, oddly enough, maybe this is just a coincidence, premiums go up and down and sink with the market. When there's a heart market and insurance companies might want to throw more money into the market, it seems premiums go up. When the market's not doing so great, it just so happens that data shows that premiums go down. Do you have any reason to disagree with that? Absolutely. The stock market returned, I think, 24% and the insurance premiums went up because of other factors had nothing to do with the stock. Profits last year, 90 billion. I think nationwide, I have seen that number. But again, in Georgia, we're talking about Georgia here in Georgia. That's not the case. Well, not just what we know. Because carriers are leaving. Have you read this article from the Tampa Bay Times, Florida House Speaker, Republican Florida House Speaker orders hearings into insurance reports and profits finding that insurance companies not only reported these record profits, but also that wasn't the whole story. They had been sending things off to subs and affiliates and hiding so much so that now we're going to be investigating. Do you think we need to do anything like that? I actually read that article this morning. So I read it up. So Florida is a completely different animal homeowner's insurance. That article is addressing homeowners. Yes, Georgia has no similarities with hurricane seasons and the hurricane deductibles. But this is about profits. This is not whatever type of insurance it is. Do you know, some of the same insurance companies that write policies for Floridians write them for Georgians, wouldn't you agree? I would say very, very few. The all state state farm, most of them are out of the state of Florida for homeowners insurance. I don't think we can resolve that information. But we can agree on 90 billion in profits for the insurance companies last year across the nation. Nationwide. We can also have it Georgia that lost money. I think the witness is trying to distinguish that. I want to get that. Mr. Chairman, I'd like to get that report, something that shows that Georgia insurance companies lost money. We'll work on trying to get that. I want to move on. I got one quick question for Chairman Newton and then I think Wood Park has a quick question. Thank you, Mr. Chairman. The number you mentioned, I think a dollar, all private dollar, a dollar six that they spend or pay out for every dollar. They collect, obviously, if they earn more than 6%, maybe they break even, if less, they lose money. But is that dollar six? Is that the type of number that Carrier would go? If they wanted to stay in the state and offer insurance the following year, would that they would take to the Department of Insurance to ask for a rate increase, if indeed that continued over several years, or if they wanted to do a rate reduction, would they bring different data that might show 94 cents paid out for every dollar collected and they would ask for a decrease auto insurance rate? Absolutely. They're using what they call combined ratios to figure out where they should ask for increases or decreases. And that's probably what's behind the decreasing rates in Florida is that they're not paying out as much now after total reform. So they're asking for decrease rates because they can't justify an increase or even stay in the same. So one of the reasons, the other reasons somebody mentioned earlier, they've had quite a few carriers want to come back to the state of Florida in New Business and increase competition also draws down rates. Thank you. One quick question that we need to move to the last witness. Thank you, Mr. Chairman. Is it not true that the insurance industry data shows that unrepresented claimants are 70% more likely to receive no recovery? I have no idea. I'm in essentially, you know, for the vast majority of my constituents, the vast majority of Georgians, if they do not have an attorney, does insurance, I mean, insurance industry data is saying that these folks who do not get an attorney are more likely than not to not get their claim paid out from insurance companies? Is that not what you're saying? That has not been my experience. Well, I think that's what the data is saying. I think it's the insurance commission before I look to get a little more information there as well. Sure. Absolutely. All right. Thank you for those questions. Thank you so much for your time. Thank you. Good morning. Good morning. You have the floor. Chairman Leverton, members of this committee, I thank you for having me here today. I'm Lanny Allgood. My company, Singo, provides pest prevention and other home protection services in five Georgia cities. Atlanta, Augusta, Dublin, Savannah, Douglas, and then Charleston, South Carolina. Founded in Dublin, Georgia by my father. We marked 50 years in business last year. I attended law school at University of Georgia, and I'm a member of the State Bar. I also serve as a director of an insurance program that serves the middle market of my industry and covers my company. I appreciate your interest in my testimony and the opportunity to share this experience. My company business model requires every revenue producer, drive a light duty truck, all day long on public streets. And we operate a fleet of 100 vehicles, so highway risk is our number one safety issue. We utilize GPS, driver scoring, and advanced technology to block all cellular communication while the vehicle is in motion. Unfortunately, though, all the safety measures in the world will not protect me or my company from the Georgia Civil Justice system that has gotten out of balance. The reality is that people make mistakes. People have accidents. My drivers are not immune from that. Neither are the individuals with whom we all share the road. I believe injuries and losses that result from those accidents, including pain and suffering, should be compensated, but they should not be inflated by medical charges. No one will ever pay and by lawyer tactics that blur the line as to the monetary value of loss. As I mentioned previously, I manage our risk through a captive that runs a traditional but small insurance program nationally. Interestingly, since I served on that board that puts me in charge of my own rates, unfortunately, I've not been able to temper my own rates because I know that in the last five years, we can't raise them fast enough to keep up with the claims dollars. Otherwise, the health of the program would be compromised. This is not about out of control accidents. This is about a runaway system. In the last five years, single revenues have grown 21%. That's my company. Auto-lobability, double umbrella coverage, quadruple. Why is it running away? Twenty years ago, trial verdicts in the plaintiff's favor typically awarded pain and suffering on top of medical damages at a cost ratio of three to one. Today, that ratio was five to one, so to some extent, this is a national problem. In Georgia, it's just worse. Today, when our claims adjusters receive a trial evaluation for a particular claim in Georgia, pain and suffering now estimated 10 to 1. And since medical damages in Georgia don't have to reflect the amounts actually paid, but rather an inflated number, you can see where this gets out of hand real quickly. This is not an insurance carrier problem. Their raw goods are claimed, and if the cost of those claims is exceeding what they are charging for them, then those costs just keep getting passed onto the insurance. Businesses, property owners, and drivers. And if defendants fear their ability to get a fair hearing in Georgia trial courts, they have no choice but to settle for anything less than what they believe could happen through an expensive trial proceeding. What does this mean in practice? In January of 2021, one of my drivers reported he had been in an accident, but that the damage was minimal. Now I have no polyannas, so when my driver says it was just a bump, I hear that with a high level of skepticism. Nevertheless, no injuries were reported at the scene and the airbags did not deploy. Here are the pictures of the physical damage. It was just over $5,000 to a newer model Lexus and no discernible impact to my truck. In December of that year, 12 months later, plaintiff hired an attorney who made contact to request policy declarations. The plaintiff went to the doctor for the first time 16 days after that. At a well-known and patient, plaintiff patient-oriented firm, this claim was settled for $235,000. The same as it would have cost if we took a trial.\n\nway to the jury and receive a no-liebility verdict. This happens every day in Georgia because only one side is really afforded their day in court. Our friends on the other side of this argument want to blame the insurance companies. And over the weekend, I even saw a social post declaring the insurance company could have settled this lawsuit for 2.5 million. Instead, my firm received a 25 million dollar jury verdict. Now, let me be clear, no one is suing insurance companies. They are suing real Georgia businesses, landowners, and citizens. But more importantly, what does this social post say about our system? Where even plaintiffs' own council believed the case was worth 2.5 million and the jury awarded 10 times that much. Opponents of this legislation argue that victims will not be compensated. This legislation would not bar compensation. It will make it reasonable. Governor Kemp has proposed common sense modifications to this system after listening to all stakeholders. I applaud his effort and his leadership. It's time to restore ballots and have a judicial system reflective of our thriving state. Please vote this legislation out of committee. Thank you. Thank you, sir. You get a pass because I'm so far behind. We're going to move on to the oppose. I don't have time to lie to any questions. I don't see any right this minute. But thank you so much. We appreciate your testimony today. All right. Now shifting to those posing Senate Bill 68. I believe my first witness is Dax Lopez. You have the floor, sir. Good morning. My name is Dax Lopez and for 11 years I served as a DeCab County State Court judge. Presiding over the very types of cases that this bill will impact the most, I was charged with having to interpret the very legislation this body would often pass. But before I was a judge, I served 10 years as a defense lawyer. I've served as a mediator and continued service mediator. I've served on the board of governors for the state of for the state bar of Georgia. And I'm currently a member of the JQC, the Judicial Qualifications Commission. But I was happy to serve for those 10 years. And so I lost my honor in 2021 and retired from the bench and came out and started practicing law again. But I'll tell you that my greatest accomplishment was serving those years as one of your judges. And in that time I presided over hundreds of jury trials, the very jury trials, what we're discussing here today, both in the criminal and the civil context. I got to observe jury's first hand deciding cases. And in that time I came to develop an abiding faith in our civil justice system. And more specifically, an abiding faith in the collective wisdom that 12 ordinary Georgians have, helping to resolve disputes and reaching just outcomes unanimously. Let me tell you about juries because I want you to understand what we're talking about. Juries all over Georgia are made up by your neighbors and your communities. They're made up by each of you. You get to serve on juries. Each of us is eligible. Each party has a hand in helping to decide and to select the members of the jury. And those who express any bias towards either side will be struck for calls. Juries reflect the values of our communities from the jury box. All right. They hold wrongdoers accountable. And if you bring a weak case with rec evidence, they will hold you accountable and they will rule against you, seeing it hundreds of times. Juries come in kicking and screaming. No one wants to serve on a jury. It's one of the hardest things is when you call all these folks and you look around and they're not happy to be there. But I will tell you that once they are chosen, our citizens are up to the task. Once they take their oaths, they take it seriously. They listen to the evidence. They decide who's telling them the truth, who's being credible, who's not being credible. And they apply the law that I instructed as a judge to the case at hand. They use their common sense, their value systems, and they did not try to do anything that would not be within the balance of the law or the evidence. You know what I learned is that jurors usually got it right. In 11 years, in a very high volume docket, because I was in the cab county, one of the busiest courts in the state of Georgia, I only saw one case where I disagreed with a jury's verdict. And in that case, I exercised my powers judge to remove that case and take it away and we would re-tried that case. Only one case out of the thousands of cases that I saw and the hundreds of cases that I presided over. Jurors are also the same people that vote in our elections. We respect their decisions from the ballot box. We should respect their decisions from the jury box. I say all this to say that jurors get it right more often than not. And but I know that there's been a lot of talk in this body and about this legislation about the runaway juries and these large verdicts. But let me tell you, it is incredibly difficult to get 12 Georgians, 12 strangers who've never met each other to work together, reach consensus, and to render a unanimous decision which it must be. And when they render a large verdict, there's usually a pretty good reason for it. But despite the common belief that large verdicts over $10 million, having all the time, it is the absolute rare exception. Again, 11 years presiding on hundreds of cases in the Cald County, which has perceived to be a very plaintiff's friendly jurisdiction, I can tell you that I've presided over three cases over a million dollars in verdicts. The largest one being 6.5 million, none of which were over 10 million. My partner, my law partner at Tony Dull Campo, was a state court judge in the Cald County for nine years. And I asked him, and he only had one verdict in nine years over $10 million. That is the exception. So it got me thinking, let me go look at the data. What does that look like, statewide? In 2022 and 2023, there were 162,000 civil filings and just state courts in Georgia. Out of those only 0.0019% of them resulted in a verdict larger than 10 million. That is far less than 1% of the cases. More often than not, there are defense verdicts or low-value verdicts. And that really is sort of the day-to-day experience of a state court judge. We're not presiding over multi-million dollar verdicts. We're presiding over smaller cases. And juries do a very good job of deciding those cases. But I want to turn to my why I'm here opposing this bill today. My position is rooted in the belief that this bill will take away discretion from our judges and from our juries. Who do a very good job every day. More specifically, I fear this legislation will make cases more inefficient, will make trials longer, which will make jury service longer for your constituents. It will take discretion away from our judges, it will take discretion away from our juries, and it will create backlogs in our courts. And it may intentionally or intentionally tip the scales towards defense. But I know this body would not want to create an uneven playing field for anyone. And I know your goal is to pass legislation that is fan-balanced. So let me quickly discuss some of these sections. When I talk about delays and backlogs, I'm referring to section two, which deals with these days and section eight by vacation. Mr. Daily discussed, the amountions to dismiss that might take six years to resolve. If you pass this legislation, that would be six years of stay that no, that case will now proceed at all for six years waiting for a judge to decide the case. That cannot be an appropriate way to run a courtroom. That will absolutely cause delays. And really quite frankly, emotions to dismiss are very infrequent occurrences that happen in courts. The standards are such that they don't get filed often. And when they do, yes sir. Oh, thank you. When they do, they get ruled upon pretty quickly, but it could take six to seven months, depending on the judge. But here you've heard up to a six year delay. Section two allows defendants to hit the pause button, definitely, on starting that discovery process. What I would suggest is that you allow it to end after 90 days, create a 90 days day on these motions to dismiss or emotions for a more definite statement, and allow the defendants to ask the judge to extend it beyond 90 days for good cause shown. This will allow defendants to seek extensions in cases where it is necessary, but would preserve the judge's discretion to decide when an extension is appropriate. I will talk about bifurcation, but I know that'll be next week. I did want to sort of mention a couple things about anchoring. I think anchoring the section is written right now will cause some interpretive issues for the courts to deal with. First of all, you're not going to allow folks to discuss potential bias and barred here, which will create problems for both sides. And lastly, I think the creating, allowing the folks to talk about it at first close may cause an additional interpretive issues, which first close is that the first close on liability or that first close on damages. And with that, I yield my time. Thank you. Thank you, Judge. I believe Chairman Newton has a question. Yes, thank you, Mr. Chairman. Thank you, Judge. I lost the charter three years of law. Follow me down. What area of the law are you in now? I'm sorry? What area of the law are you in now? I am now represent plaintiffs, yes sir, in personal injury actions. You were very eloquent about the jury system and it is an amazing thing. I agree. Do you think those juries, we've got a couple of sections you mentioned seat belts and we heard earlier about helmets, use or non-use can be relevant. Two questions do you think that the presence or absence of seat belt use and that the accuracy with hospital bills, for example, showing the list price but also showing the price to fully reimburse the providers. Do you think those juries are able to understand that and make a informed decision? I do think jurors are a lot smarter than we give them credit for. Absolutely. That's why I haven't been on a body faith in their ability to decide cases because they get to hear both sides and that's what makes our system great. Right, is being able to hear evidence from both sides and neither sides should be precluded from presenting their case? Thank you. Thank you. Rips of Mevins. Thank you. Have a question. Yes, thank you, Mr. Chairman. I'm told that once you're the honorable, you don't ever actually lose that title. That's what they tell you. The honorable. A little bit. Thank you for sharing your experience on the bench, particularly with juries because that's an insight that a lot of us don't have. Could you also share with us what you see during our dire and this testimony we heard earlier that plancillers are coming in and really just trying to poison the minds of the jurors and whether that's true or not, what the fincillers may be doing and then what tools the judge already has to rule that in and whether you think it is actually a problem. You've already heard some of it in the spirit court rules and there are already restrictions on what can be said both in board dire and in closing arguments with relations to the amounts and you can't make certain arguments about sending a message or winning the lottery. Those things already exist. Most judges are pretty good about keeping it even keeled and not allowing lawyers to go too far off field in their arguments, but you do want to give both sides a fair opportunity to make their arguments and I think that's what makes our system the best out there. Most judges I think are well trained and do a good job of keeping track of what's going on and making sure that no one's making these inflammatory arguments. I think those things are things that will get you reversed at the court of appeals and no judge wants to get reversed and have to try the case over again. Our court of appeals do a great job of making sure that people stay within the bounds of law. Thank you. Thank you for coming, Judge. Can you talk a little bit about a judge's power to deal with a quote unquote frivolous lawsuit? What mechanisms exist in the law to already handle that? Absolutely. There's already two mechanisms that judges have at their disposal. 915-14, which allows a party to ask for sanctions and fees if they find that the other side has made a claim or a defense it's frivolous. I will tell you that in 11 years I saw two of those at hardly ever get filed. George Law also allows for abusive litigation. So you are allowed to sue someone who you feel has abused the litigation process and you have the direct claim against that person and their attorneys. So you can see compensations from either and again in 11 years I saw no lawsuit that was raised under abusive litigation but I did see a few 1915-14 motions. Right. Thank you very much. Appreciate your test. I appreciate you. John Pope. We're good luck to move. Good afternoon, Mr. Chairman. Leader of the Restoration. Chairman, the pro-tell. Good to see you. My name is John Pope. I'm a lawyer in Gainesville, Georgia with H.D. Pope. I was the former president of GTLA many years ago and they dusted me off and asked me to come out and talk a little bit. So I want to talk really about two things. One is just a little bit about the underlying premise of the bill and then I want to talk a little bit about one section of dealing with seat belts. I will say just initially the stated one of the stated goal. I think the primary goal has been discussed today of the bill is look at insurance premiums. Insurance premiums are up. They're up. We all know it. I've got two teenagers. It's up. My property insurance is up. But we're making some assumptions as to sort of why. And I think we don't want to miss out on the underlying reason. Why are they increased? Why have they increased? I put some information on your desk. And the other thing I'd noticed, we've heard from people insurance defense lawyers and insurance agents Jim Boff Floyd, my good friend, was eloquent when he spoke. But we've not heard from anybody with the insurance industry directly. Nobody from state farm or all state are progressive. And let's be clear. In 2024, there was a $95 billion profit in the insurance industry. Travelers alone made $2 billion. Ganko had pre-tax income of $5.8 billion. All state 1.2 in the third quarter of 2024. But again, why are insurance rates going up? And so what I did was try to provide you direct information from state farm, one of the very largest automobile insurance in the United States. And I provided an article again. It's not John Pope. It's straight from state farm. The reasons are things that we already know. Inflation, rising car repair costs, electric vehicles which are more expensive to repair, increased accidents due to distracted driving, and then weather catastrophes. And that's straight from state farm. What you will not see is nuclear verdicts, replanists, verdicts, anything like that. So I want to say that. And then I want to talk specifically about, and we had Professor Stiegel, I believe his name was, do a study. And George's auto rates are about $200 more than national average. But we have 200% more accidents than the national average. That's a lot. And look folks, no offense to Atlanta, but that's Atlanta. You're a large part of it. We have more accidents here at Atlanta. And so we also found that the issue of insurance carriers about the same amount of insurance carriers came in to Georgia that left. And none of those that left were the ones that have the significant market share like state farm and all state progressive. Now let's talk specifically about that portion of the bill regarding seat belts. This seat belt provision has come up many, many times. And this is like, it sounds good like me pulling that all night or right before my last law school exam sounded. It sounded really good at the time because it was a great concert. I wanted to go see. But later on I look back and I said that was a really bad idea. So it sounds good, but let's talk through it. Okay. Give you a clear example. Right now the law says that seat belt non-uses uses should be admissible in a civil case. And man that sounds reasonable. Why shouldn't the jury hear that? Well, under Georgia law right now you're not required to wear seat belt in the back seat. So despite this under this new law you'd have to prove that you had your seat belt on to be able to bring a claim for injuries. A law abiding citizen would be penalized and potentially lose their entire case even though they were obeying Georgia law. Okay. Outside of a car wreck. And this is practical speaking. Okay. I talked to the late Senator Bruce Thompson, one of my good friends. He was my state senator from my hometown in Kenton. And I said, Senator Thompson, what's the first thing you do? If you're not dead or incapacitated in a car wreck, what's one of the first things you do? If you're a nice person, you take your seat belt off and you get out and you make sure is everybody okay. Now why is that important? Well, because the next, the first time anybody sees you at the scene, you're not wearing your seat belt. And now you're going to the victim who did nothing wrong, you're going to have to prove that you had your seat belt on. And that's the problem. So literally you could have a drunk driver, teabone you, break your leg and you could go to court and get nothing because you weren't able to successfully prove you had your seat belt on. Now people counter that to say, well, John, there are ways that you can do that. We can prove. There's eye witness testimony. Well, again, we already talked about that. First time you see someone at the scene, they're walking around. Well, I don't know Mr. Defense Lawyer. First time I saw the plaintiff, he didn't have a seat belt on. That's not going to be fair. And then, well, we can look at, we can download the computer data from the vehicle. That's something that we as plaintiffs and defense lawyers do a lie. I got a quote yesterday from an expert to do that very thing. It's $850 to $1,000 as they quoted me. It's very expensive. And what you're doing is you're putting the onus on the victim to prove that they had their seat belt. So that's why in an essence, it sounds good. But again, it's like pulling that all nighter. The last thing I would say is we're not unique. In other words, we're not the only state that has the inadmissibility of non-usage. 26 other states have the same law as Georgia, preventing seat belt evidence at trial. Only California, West Virginia and Louisiana, only three states have law like the law that's proposed in 68. So I know I'm running out of time and I wanted to beat everybody and be quicker. Happy to take questions. All right. Do we have any questions from Mr. Pope? I won't see any, Mr. Pope. You did such a good job. You don't have any for you. Thank you. Thank you very much. Susan Cobb. Mr. Cobb, you go right ahead. I want to thank you, Mr. Chairman, for allowing me in the community to allow me to be able to speak today and also want to just give God the glory for allowing the strength to stand here and be able to speak to you. Our daughter, Jennifer Autumn Cobb, she should be the one standing before you today to talk. Tragically, she is no longer with us. That is largely because of the negligence, betrayal, no safety, no systems in place, no training in place. Our daughter, Jennifer Autumn Cobb, was essentially green. She was silomized, molested, brainwashed by her gymnastics coach. He was an adult male, 17 years older than her at the YMCA in Hartwell, Georgia. She was not his first victim nor his last. There are many other victims from the YMCA that occurred at that K prior to her. She was just 11 years old, an innocent child with the dreams of becoming Olympic gymnast, just like her Olympic heroes, Ali Rosnan, Kaby Douglas. The truth is, it should not have happened, but tragically it did. Jennifer told me before she died that she never wanted this to ever happen to another child. She never wanted another family to be tore apart. The way that our family was tore apart. She was willing to come forth. She knew what she would have to face. But she said, I don't care mom, I don't want to tell what happened. I want my story to be heard because I don't want this to happen to another child. Jennifer wanted to protect others. Her life would later be shortened as a result of the devastating abuse that she endured. We were left to face what no parent, sibling, or family should ever face. Therefore, I have chosen to advocate for her and for other victims, for justice, a voice for the voiceless. I'm a registered nurse. I did not set out on the journey to be an advocate. But this is my path. I made a promise to Jennifer dying that I would fight for the justice she deserved in life. And I would fight for other victims. And today I'm fighting for other victims as well. Her abuse happened because the YMCA did not follow and enforce its own policies designed to prevent child sexual abuse and gave a predator, a predator, a feather, access to our innocent little girl. We sued the YMCA with a sole purpose to hold it accountable for its numerous failures and providing both our and Jennifer's trust. Understand it was not about money. Understand their fears, lawsuits, but this was not about money. But accountability, accountability with the hopes that this tragedy would never happen again. We see the wine and sea in host, changes would be made. And no other child or family would be subject to such abuse, devastation, and tragic loss. I apologize. My mouth is dry. Unfortunately, we were able, fortunately we were able to get justice through the current legal civil system. While we wait for the criminal system to resolve this case, we've been waiting for years, it'll be four years in June. And we also have a civil case against the predator we're waiting to go to court. Although it will not bring our daughter back, we can now honor her memory by using the money, all of the money, from the case to fund nonprofit in Jennifer's name, not one dollar where we keep for ourselves. The Jennifer Autumn Car Foundation, finding hope in the darkness, is the foundation that has been formed. The money will go there and through this foundation, Jennifer's legacy and love for humanity and animals, we should care deeply in her heart, who live on doing good things for a great cause. Understand we were able to file a civil lawsuit and get some form of justice under the current system. However, if SBCCA had been all over the end, it would have locked our claims and prevented us from holding the YMCA accountable. SBCCA is bad for children, families, and victims. I am here to advocate for the future victims that this will impact. Children are our most precious resources. They are our greatest treasure, and it is our job as citizens to protect them, whether you are a Republican, Democrat, or independent, but as a citizen of the United States. Parents' trust place is like the YMCA. We did. She did. School's churches, daycare facilities, camps, etc. to act responsible, to keep our children safe, especially from sexual abuse. I am here today to advocate for victims. So they too will get justice when such organizations fail them. Some like our daughter won't get their day in court. Children who are sexually abused, sexual assault victims in the elderly are the most vulnerable population. This bill, if passed, as is, will remove their sewer rights. We cannot support SBCCA to its written, which allows that trust to be violated without any consequences. And I understand your concerns about free willless lawsuits, but I want to ask you, if this is in your child, what value was you have put on their line? How much have it been enough? I can tell you there is not an email that you have given me, especially when you have lost that child to an organization that was negligent and failed to protect. I ask in the memory of Jennifer Allen who called that you can reconsider SBCCA. Thank you, Ms. Cobb. Thank you for your testimony. I can't imagine the pain you have had to suffer, and also the challenge of coming here for us today. I think, there is one question for you. First, thank you. Thank you so much for coming. But thank you for putting a face on this problem. It is unfortunately sometimes we get lost in the lawyer-to-lawyer insurance company, to insurance company, adjusted to adjust to talk and forget the hurt that is felt by real Georgians. Thank you for speaking for Georgia, not for the fancy ads or the names that are given to such and such things, but as a father of five-\n\nThank you. I feel your pain and I know how I would feel. And no way in the world can anybody limit justice or identify how much it's worth for the loss that you had to suffer. Thank you, God bless you. Thank you, sir. That is one reason we chose for all of the money that we received to go into that foundation so that no one could say that it was frivolous or we did it for the money. But when it goes into this foundation, it would do good things and what was meant for evil will be turned to good throughout the state and other states. We are going to do that in her memory. Thank you so much, Ms. Cobb. We appreciate your testimony today. Thank you for allowing me. Thank you. The care Phillips. I appreciate the time to speak to all of you. And I've spent a little bit of time coming up after seasons talked about what happened to her daughter because I had the honor along with my law partners of representing her in her case. I'll tell you, when this bill passed the Senate last week, I was trying to understand what could be done because what I see is at stake here are the Jennifer's. And she's one of many that my firm has seen over the years exclusively representing crime victims. So I started working on what we can do to amend it because I believe that this body and the larger body has no intention of keeping the Cobb family from justice or others like them. So I've got several copies and I'd like to share it with you all. But I figure that there's there are two approaches. We can either take something out or we can put something in. And so the version that I have here, can I hand it out? Yes, if you do it quickly. Okay. We'll need to make some kind of confidence. No, I have a need. Responsive say to. We'll help you with a hand in our you keep testifying. So simply the first amendment would simply look to remove some language that would be very difficult for the Cobb family to prevail on their case and others that have been injured at a place that's really solely there to provide protection to children. And as a mother of three children, I've dropped my child off at daycare before. And ultimately I am trusting people to have policies and procedures in place that will protect them and to do the right thing. In the case of Jennifer, the YMCA held numerous overnight lock-ins during which they allowed a coach to have unfettered access to her despite his age being well beyond what could even be remotely appropriate for him to be spending an overnight time at a lock-in with a bunch of gymnasts. And the YMCA did nothing to supervise there. So her case had nothing to do though with a physical condition. And as you'll see on the first page, we're suggesting striking out that language because it will ultimately bar claim such as Jennifer's claim. That's the only change that's proposed in the first two pages. If you get to 51-353, our suggestion is affixed by deletion. So here it's adding in the section that's in red there to carve out children to carve out victims of sexual assault and to carve out the elderly. Is that paragraph D in 51-352? That's correct. That's the addition, yes sir. And obviously I'm speaking about section 6 here, but I want to talk briefly. Section 1 and section 8 are addressed in the last page there because when we're talking about anchoring and there's been a lot of talk about it, it does impact children, sexual assault survivors and the elderly in particular. If you're not able to root out the biases, then might keep someone from serving on that jury along the same lines when it comes to testifying in court sexual assault victims are brave. And some of y'all have seen them down here and they have bravely faced really an uncomfortable environment even for me. And I'm proud of them, but they ought not have to testify twice in a trial. That's cruel. It's harsh. It's unfair. And it's not what Georgia wants. Susan is just one face. We represent children who change out of their Spider-Man bathing suit during day camp and are raped by another child. We have to protect these children. Our firms represented women, grandmother's, who are at a memory care unit and a staff member sexually assaults them. At minimum, we can take the children out. We can take the sexual assault survivors out and we can take the elderly out. They're the most vulnerable. And they're the ones that are going to be the unintended consequence of this bill. Thank you. Thank you very much for your testimony. I don't see any questions and we've got a few more witnesses for we wrap up. So we'll move along. Thank you again. Is it Mark? Is it Harlis? Thank you. Thank you for allowing me to speak. Before I say anything, I just want to tell Ms. Cobb that the courage is amazing. And to imagine coming up here and having the reload that pain is quite astounding. Thank you. I'm going to talk a little bit about the security part of this. As it really been talked about a lot today. But let me tell you a little bit about me, about who I am, what I do, where I come from. So I'm a retired career FBI. I was an FBI agent for roughly 20, almost 23 years. I feel old. That's where I get the grade. But I think I worked hard for that. Currently I'm a senior security consultant with a group called nine, a group nine risk consultant. And so a little bit more about me. I hold a master's degree from Florida State to go nose. And I graduated from the school of criminology and criminal justice. And I'm also a board certified physical security professional by ASIS. A little bit about what I do. So, and about my experience. So I have extensive experience in violent crime, criminal enterprise, crime scene analysis, red team security operations. Now I'd be a question that you ask a little bit more about that. But basically what my job now is I combine my law enforcement expertise with my experience in corporate security to design and execute security solutions to protect organizations from the state of the state. I've been a select organization from evolving threats in the physical security space. Needless to say I've seen firsthand what happens when organizations fail to do security the right way. Security is neglected. One more thing that I like to throw in there about me. My wife and I are residents of Georgia. We live here for 15 years. We're vested in a state. We're vested in the community. We have three kids. We go to the businesses, the venues, the churches and the schools that you go to. So I'm talking like one of you. A little bit about the firm that I work for about the work that I do now. So our physical security consulting team is routinely hired to advise companies and organizations on how to reduce crime by assessing threats to their properties and businesses by providing detailed information about what we call best practices to keep customers tenants and employees safe. Miss Cobb touched on some issues that I'll speak about as well. Kind of move on to to the bill. A very crucial part of every analysis and recommendation that I make that we make is to clearly understand the practical impact of state laws where property or businesses are located. We work extensively in Georgia and surrounding states. In fact, we've worked all over the country. And we've seen how certain laws can be very critical and determining which security measures companies are going to use. The current Georgia law, as it stands now, it emphasizes how critical it is for companies to use all reasonable security measures to prevent inter to crime. In security terms, we call this layered security approach. So not to get too technical, but that's what it is. If you can envision layer upon layer of security techniques, policies and procedures, guards, cameras, I'll talk more about that in a minute. But that's essentially what the idea is. This layered security approach is a fundamental building block for any effective security program of plan. So Georgia companies are currently motivated to use the most widely accepted crime deterrence security measures that make up this kind of approach. Again, I'm going to list out a bunch of measures here that are part of this. Employing security guards and following recommendations of higher security contractors, conducting security awareness training, doing appropriate background checks on employees and tenants, evicting dangerous tenants and terminating dangerous employees, adopting and enforcing crime prevention and security plans, policies and procedures. I've said for a long time, the absence of plans, policies and procedures and security is the author of chaos and disaster, I've seen it over and over and over again. Engaging with and following the recommendations of local law enforcement, being aware of and responding to high rates of shooting, sexual assault, home invasions on their property, being aware of and responding to gang activity on their property. Finally, using appropriate physical security equipment such as fences, gates, lighting and surveillance cameras. But SB 68 would do away with any and all measures as we see it that encourage companies to not only use these minimal physical security measures such as fences, gates and lighting. In my view, SB 68 would actually incentivize companies to eliminate certain security measures to avoid being liable by creating a situation where a malfunctioning or poorly maintained camera or device exists. So basically, no one in a row could get about a minute. What doesn't exist can't malfunction with the thought. Under the new law, it appears that a company simply cannot and will not be held responsible for any harm that results from their failure to use these widely accepted practices that don't deal with the physical security. This kind of drastic change to the law will clearly motivate irresponsible companies to do the bare minimum to keep their properties safe, which will clearly result in an increase in the risk of harm to the public. Kind of an anecdotal example here. Our firm recently attended a conference by roughly 40 plus businesses who own properties within the state of Georgia. Many of the companies are head quarters actually outside the state. We actually offered to do security analysis of their property to help them deter crime and keep customers safe. We personally contacted them, spoke to them individually multiple times. In it would have cost little or nothing to do the security analysis for them. Not a single company that we spoke to was interested in our certain services to help understand industry standards and specific security needs on their properties. Why one of the companies they responded we don't need security in Georgia because we're getting torqued. Now shocking. I'm almost done. I'll end it and say I can very confident say if irresponsible companies are not allowed to ignore any of the highly recommended and long accepted security standards every Georgia citizen will be at high risk of violent crime in their homes and their schools places of work and businesses and places of worship. Thank you for testing on it. I'm running about 20 minutes late so if there are any questions I'll just ask members to take it up with you offline. We've got your number and your email here. I appreciate you coming today. Got one of the witness Andy Rogers. My name is Andy Rogers. I'm a lawyer. And this is going to fill a little bit like the negligent security concerns are hijacking this hearing. I'm not going to apologize for that. As was mentioned a couple of days ago this is an omnibus bill. It probably should be eight different bills. There at least should be a separate bill dealing just with negligent security and I'm not going to I'm not going to shy away from that. Fantastic that would be much appreciated. I'm in my 37th year of practice and law so I guess I'm the winners last loser. And I'm glad to see Senator Kennedy here. I want to thank Chairman Parish for putting together this subcommittee because it's important that lawyers talk about this lawyers who are in the courtrooms talk about this and talk about it intelligently and to be intellectually honest about what is said to be the goal of this whole process. I'm a former prosecutor. I did that for five years. I'm a former part time municipal court judge in the city of Decatur. I served on the Decab-Rake Crisis Center board for ten years. I've seen two lawyers in this room that I recognize who've done any premises liability defense work much less negligent security work and that's a problem. It's a problem that all of the folks who don't understand the impact of this aren't being asked to be involved. It surprised me and disappointed me frankly as a Georgia resident. To hear that apparently there was never any interest and never any effort effort on the part of the governor's office or any of the sponsoring legislators to speak with somebody like Mark who's in the business of and the profession of understanding how companies work, how owners and operators of places like apartments and daycares and other places operate and how they make decisions. And why they make decisions the way they do. This bill as it currently is written particularly as it relates to the negligent security piece of it will result in the worst of the worst offenders being given the green light to continue to do what they're doing. It provides no incentive to protect anybody and that is a problem and should be a problem in and of itself to stop this whole bill that in its tracks or to allow for a carve out that makes sense. I saw Ed Lindsey out and I don't know if he's still here. Senator Lindsey defended the first premises case, negligent security case. I handled after being a prosecutor which involved five young people who worked at the BMW plant up in Spartanburg coming down to Atlanta for the weekend who found themselves after doing an online search at the quality in on chalifor road off of I-85 and three hours later. Because there's no security on the property. A person was in their room, made them all take their clothes off, sexually assaulted all three of the women in front of their boyfriends and walked out of the door and off the property unidentified. If SB 68 were in effect at that time, there would be no possibility of holding that very bad actor hotel responsible for what happened. I was happy to see Pamela Lee here talking. We handled a case with her that wrapped up last year. Our clients were a mother and a daughter who were awakened in their apartment, buying a truder who had gotten through a window that should have had a pen lock that the apartment management company had decided needed to be put on all the ground full windows that cost a dollar. They came through the window and made them both strip at a knife point and had the mother sexually assault her own daughter. And then he walked out of the apartment unidentified and is still out there. If this law that's being proposed now were in effect when that happened, there would be no way to hold that property owner responsible. Plain and simple. It's great to see Jake Daley here. Jake's firm and our firm handled a case where a man drove to his home. And behind him were three people who were able to follow him and pass the guard house because the guard just sat there and did nothing. They approached him as a guy out of his car. They robbed him. They shot him in the head and he's and he has no longer with us. We're six were SB 68 the law today. There would be no way to hold that very bad actor management company responsible for what should have never happened. There are numerous changes that can and should be made simply to the negligent security part of this bill. I hope we have more time to have a robust discussion about what those changes could be Senator Kennedy and I understand the powers that be make this very difficult. And that is unfortunate but I am very hopeful and want to keep a very positive open mind that there is room to work on this stuff that needs to be worked on. And if it can't be worked on it is my personal opinion that the whole bill should stop exactly where it is because it's too much to do in the short amount of time that y'all are trying to do this. And it's nobody's fault but it's the truth. I appreciate your time. Thank you. Thank you for your testimony. And we do plan to have some additional hearings next week and we will take up premises. Great. Thank you very much. Senator Kennedy, I am running late but I told you I will let you have the last word if it is a sponsor if you wanted to speak briefly. So you may take the podium, sir. Thank you, Mr. Chairman and members of the committee. I recognize where beyond the time you had allocated and so I am going to try to be brief. And we will maybe make other comments if you allow Mr. Chairman and maybe the conclusion of the last hearing. Let me just try to address rather than going back into the sections but address some of the commentary that we have heard from some of the witnesses today and I am going to try to be brief because I have realized folks have been in their chairs a long time. So I will first talk about some of the witnesses that came in opposition. We heard from Dax Lopez, Judge Lopez. And the comment that was made that we believe in the jury system and I will tell you I believe in the jury system but I will tell you that 68 and 69, the two Senate bills that we have don't challenge or impair any in any aspect the right to the jury system that we have in Georgia. So nothing in this bill does that. The jurors are still there to make their critical decisions about issues of fact and render important decisions on very important cases. The comment was made that this bill somehow takes the discretion away from the judge and the jury but there was no details given for that because it simply doesn't do that. So with regard to the motion to dismiss comments in the one outlier case of a six year case that you had mentioned, this is clearly an outside an outlier. I think we most lawyers would agree that is not the normal time for a motion to dismiss. And in fact, the model that's being offered in Senate bill 68 specifically provides a very carefully crafted balance that incentivizes it first. It gives fairness so that folks that ought not to be a defendant in a lawsuit have to pay a lot of money to engage in the discovery process. But after 90 days the judge has to rule and so the question that was earlier asked, well what if the judge doesn't? What's different about this model than is different from what we have in the current code is that everybody is sent is incentivized and will be asking the judge to rule. Because the defendant of the course wants the ruling because they want the motion to dismiss to be heard and the plaintiff doesn't want the stay to continue. So both sets of lawyers are going to be bombarding the court saying please rule. That's one of the things that's unique here. So there were comments also made about we believe juries do the right thing. I do too. But jurors cannot be expected to do the right thing if they don't have all of the facts. If they don't have the relevant evidence, how can we expect and why should we expect jurors to make reasoned decisions and come out with verdicts that we're pleased with. My friend John Pope made some great comments but I would tell you with regard to the first comment that you know why haven't we heard from the insurance companies. I think it's important that we haven't heard from the insurance companies because they're not the ones you're asking for help. It's the people of Georgia. It's the businesses. It's the hardworking Georgians that are paying the premiums. Folks let's look at it. Insurance companies at the end of the day virtually it's a pass through program right. We all pay the premiums that go to fund all of these excessive verdicts and all of the expenses that's involved in this. So of course they're not here. The comments that were also made about $95 billion let's all bear in mind. Nobody's talking about from that side of the of the V on this. The Georgia numbers because the Georgia numbers Georgian insurance companies are losing money. So when you hear the $95 billion in the big picture numbers that ain't happening in Georgia. Those details were given and I'm happy to give more of those details. Mr. Chairman I can provide that to the committee outside of this. On the seatbelt usage argument. The comment was made that you have to now prove you were wearing your seatbelt to bring a cause of action or claim. Simply not true. Read the bill. Nothing about this proposed bill says that that is a prerequisite to bring a lawsuit for personal injuries. All it says is that the jury finds out whether or not the plaintiff was wearing their seatbelt or not. It says nothing about what they're supposed to do with that information because that's up to the jury. That's what the jury does. That's where jurors do every day across the state when they do their jury service. I had the privilege of speaking to Mrs. Cobb when she came up to me after the first hearing you held Mr. Chairman. And what a horrible set of circumstances and horrible thing that her family's had to endure. And my heart goes out to her and she is extremely sympathetic and we should be sympathetic to her. And I told her that when I met with her and now having heard more about the situation. But the comments that Senate Bill 68 would have precluded her from bringing the lawsuit are simply not true. I actually looked into this a little bit after having met with her last week. The lawsuit that was brought had five counts, one for child sex abuse under Marsh's law. Nothing about this bill 68 or 69 touches upon Marsh's law. The second count child sex abuse under Georgia law. Nothing about Senate Bill 68 or 69 touches or impairs of cause of action or what anyone who's harmed can bring under soft child sex abuse. The third count was negligent failure to warn that claim was against the YMCA. Nothing about Senate Bill 68 or 69 touches upon or impairs that in any way. The fourth count was negligent hiring retention and supervision. Again, nothing about what's being suggested to you as appropriate legislation touches upon that. The fifth and last calls of action was one for premises liability. Again, the language of this bill does not would not impair the claims that she is talked about that her family has endured. One of the other witnesses talked about that somehow this is going to incentivize and de-incentivize the use of security devices. All I can say in the interest of time is that we hear a lot of static and a lot of misinformation about what this bill does and this simply falls into that category. The purpose of the bill is to simply bring clarity to Georgia law on when claims can be brought so that businesses know what they have to do to avoid liability. So that jurors then have information on what the law is and they will know then how to factor that into the decisions they make. I'm almost done. I see you nodding at me, Mr. Chairman. When we talk about a couple other things that we heard from the people that came to speak on behalf of this, Mr. Tyle came, I think that was his name, Corey Tyle, the farmer. It's a good example of how an insurance carrier was simply scared to death to defend the case. It seems entirely defensible. That's one of the multiplying effects that we are having and why the cost that we are all paying continues to escalate because businesses, individuals, insurance companies are scared to go to court because of the unpredictability and the volatility of jury verdicts. I thought it was interesting to comment that was made by the attorney from Prima...\n\nMathis. And I thought this was an interesting perspective. And this talked about the validity or the value of making sure that we don't make sure litigants endure unnecessary expenses. And he quoted from the 11th Circuit Court of Appeals that said delay in answering and ruling on motions to dismiss encourages abusive discovery and it allows discovery to proceed that causes the waste of the court's time. That's kind of a different perspective on this. Not just the waste of the litigants having to pay for warrior fees when they shouldn't have to be because they're not even the right defendant. It waste the court time, the court's time as well. One of the issue on seat belts, you know. Again, I've already addressed that, Mr. Chairman. The comments that were made from the Savannah Attorney I thought was very telling from the standpoint of the comments from the client who said, why is it fair that I have to pay you $50,000 to prepare for a trial that the plaintiff then sits and gets to the very, we go through all of that prep and expense process and the jury selected and the opening arguments and then the plaintiff gets to file a piece of paper and gets to walk out of the courtroom. Those are the kind of real questions that we get that you get that you may get from Georgians, hardworking Georgians because that's not fair and it's simply one of the tweaks and one of the changes being offered with regard to the civil practice rules that we all live under as lawyers. I'm going to stop there. Mr. Chairman, I appreciate your time. I appreciate everyone quite frankly, those that came and spoke for and against the bill and I appreciate this committee's time and attention. It's clear that everyone is taking this seriously and that's what I simply ask for as the proponent of the bill and thank you for your time. Thank you, Mr. Pro Tem and we have some questions but I've asked and the ladies have graciously agreed to defer those questions until we have you back with us another time. But thank you very much for your testimony. Thank you everybody for coming today. Appreciate your attention. Sorry, woman over. We'll see you sometime next week. I should be getting a notice out in the next few days.",
  "updated_at": "2026-02-13T15:24:13.124228+00:00"
}