{
  "video_id": "qGbz7-sJq9o",
  "url": "https://www.youtube.com/watch?v=qGbz7-sJq9o",
  "title": "Capitol Report Day 37 03/28/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 37,
  "video_date": null,
  "duration_minutes": 2,
  "summary": "Here is a summary of the Georgia Capitol Report Day 37 03/28/25 session:\n\n**Overview**:\nThe session featured disagreements over a judicial pay raise bill and the state budget, with the Senate making changes to the House version that the House did not support. Key legislation was passed, including a bill increasing penalties for fentanyl trafficking and protections for in vitro fertilization.\n\n**Key Actions**:\n**HB68**: Fiscal Year 2026 state budget bill, passed Senate with changes from House version\n\n**Bills Introduced (First Reading)**:\nNone noted\n\n**Notable Moments**:\n- Debate over Senate amendment to judicial pay raise bill that added increases for governor and other state leaders\n- Discussion of federal funding changes impacting state budget\n\n**Votes**:\n- HB68 (state budget): Passed Senate 48-7\n\n**Attendance**:\nQuorum present\n\n**Adjournment**:\nSession adjourned, with next week being the final week of the legislative session.",
  "transcript": "Good evening, I'm Sarah Callis with the Lawmakers Capitol Report.\nIn the House, members disagreed to Senate changes to House Bill 86.\nThe bill was written to increase pay for some judges, but a Senate amendment made yesterday\nadded significant pay increases for Governor Brian Kemp and other state leaders.\nI think that is the discussion we as a body need to have at some point, but we shouldn't\nhave it as an amendment to a bill in the last two or three days of session.\nThe House also passed a bill increasing penalties for fentanyl trafficking and gave final approval\nto protections for in vitro fertilization.\nThe Senate presented their version of the HB68, the fiscal year 2026 budget, stressing\nthat money is going to be tighter as COVID era federal funds sent to the state are disappearing.\nThe Senate's budget realigns some of the funding you may have seen in the House and it's\na recognition of what we're looking at at the national level. As you know, the federal\ngovernment is in a position now to realign its budget, get its fiscal house in order\nfor the first time in decades. We support that initiative, but it might mean some changes\non the state level. The state prison system had big increases to hire more correctional officers\nfor pay raises and to acquire new technology\nto counter prison contraband.\nIn education, the Senate fully funded\nprivate school vouchers at $140 million,\nbut cut 28 million from the house\nplanned to fund disadvantaged students.\nThe bill was passed 48 to seven\nand now goes back to the house.\nMonday marks the last week of the legislative session\nunder the Gold Dome.\nFor GPB News, I'm Sarah Callis at the State Capitol.\n",
  "updated_at": "2026-02-12T01:23:28.089394+00:00"
}