{
  "video_id": "qhyBygAIHx0",
  "url": "https://youtu.be/qhyBygAIHx0",
  "title": "Georgia House - Day 33 (2026-03-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 33,
  "video_date": "2026-03-16",
  "duration_minutes": 87,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-03-16:\n\n**Overview**\nThe session included a scripture reading and prayer by the chaplain, the Pledge of Allegiance, and the confirmation of the journal from the previous legislative day. Several bills were introduced for first reading and reference to committees.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\n- **HB 755**: An act to amend the law creating the Board of Elections and Registration for Pierce County.\n- **HB 756**: An act to reconstitute and reestablish the Board of Elections and Registration of Pierce County.\n- **HB 757**: An act to amend the Atlanta Urban Enterprise Zone Act.\n- **HB 758**: An act relating to the inspection of state-owned motor vehicles.\n\n**Notable Moments**\n- The chaplain, Pastor Josh, provided an encouraging message about God's provision and support for the legislators in their work.\n\n**Votes**\nNo recorded votes detected.\n\n**Attendance**\nQuorum was present, as members were instructed to report to their seats for the morning roll call.\n\n**Adjournment**\nThe transcript does not provide information on the time of adjournment or the date of the next session.",
  "transcript": "The hour of convening having arrived, all members of the House will please report to\nthe, their assigned seats, all members of the House will please report to their seats.\nClerk will ring the bell.\nWe are about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nand the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nWell, good morning.\nHope everybody's ready to work today on legislative day\n33 or work for a few minutes anyway.\nWe will begin our day with scripture reading and prayer\nby the chaplain after which we will pledge allegiance\nto the flag of our country.\nOur chaplain this morning will be introduced\nby the gentleman from the 19th House District\nRepresentative Joseph Gullet.\nRepresentative Gullet.\nThank you, Mr. Speaker.\nMembers of the House, I'm so honored today to present to you, Pastor Josh.\nHe is a lead pastor, Fortified Hills Baptist Church, right in the heart of my district in Dallas, Georgia.\nFortified Hills has a long, rich history, having celebrated their 100-year anniversary back in 2013.\nPastor Josh grew up in Kinesa, Georgia, and graduated from Harrison High School.\nHe also graduated from Auburn University, as well as the Southern Baptist Theological\nSeminary.\nHe is married to his wife Jessica, and they have four children, three girls and one boy.\nPastor Josh and Fortified Hills Baptist Church are a true asset to Paul and County into\nmy community, and I'm so happy he's here to join us.\nWelcome Pastor Josh.\nLike you said my name is Josh Price and I am the lead pastor at Fortified Hills.\nThat as church has been a great joy and a privilege to be able to serve in that church and in that county.\nthankful for the opportunity to be here.\nI do, I do want to just say that.\nI am thankful that I can be here to let you know\nhow grateful I am as well for all that you do,\nfor all the hours and the days and the years\nof public service that are represented in this room.\nI just want to thank you on behalf of my church\nand me and my family as well.\nThe task before you I know is a big one.\nIt's often complicated, I'm sure,\nin ways that I'm not even aware of,\nbut I know that you deal with complicated\nand big issues on a regular basis.\nYou have constituents that are varied.\nYou often, I'm sure, feel pulled in multiple directions.\nI may be able to relate to some of that as well as a pastor.\nAnd add to some of that, some of the issues that you address\nhave some real weight.\nThe decisions that you make have real impact\non the lives of Georgians all over the state.\nAnd I'm sure there are times then in which\nwhere your jobs feel really demanding\nand perhaps overwhelming.\nWell, I want to spend just a couple of minutes.\nI know I'm a Baptist pastor,\nbut I'm going to spend just a couple of minutes.\nWe're going to break the mold here and try and do that\njust to encourage you this morning\nby simply reminding you that there is a God\nwho is never overwhelmed,\nwho knows all that you need\nand provides when you need exactly what you need.\nThere's a passage in Joshua chapter 5, verse 12 that says this,\nand the man assessed the day after they ate\nof the produce of the land.\nAnd there was no longer mana for the people of Israel,\nthe ate of the fruit of the land of Canaan that year.\nLittle backstory on that, the Israelites needed food\nas they wandered in the wilderness for 40 years.\nThey had no food, they needed someone to provide it.\nAnd so each day, every day, as they woke up,\nGod had provided this mana from heaven\nthat literally their lives might be sustained.\nEvery day, for 40 years, they went to bed with no food,\nthey woke up and the Lord had provided exactly\nwhat they needed, right when they needed,\nat the very right time that they needed to have it.\nEvery day, for 40 years, until the verse that I read,\nthey entered the land that was flowing with milk and honey.\nIt had all that they needed.\nAnd on that very day, then the manna from heaven ceased.\nAnd I think in a little text like that,\nwe see something here of the heart and the nature of God.\nWe see a God who knows what we need,\nwho provides just what we need,\nat exactly the right time that we need it.\nNo place is this more clear for us\nthan God's provision of our greatest need.\nThe forgiveness of our sins that he provides in Jesus Christ.\nAgain, we see his heart and his nature\nas a God who knows exactly what we need\nand provides all that we need.\nSo I just wanna encourage you this day\nin the days to come, in the weeks to come, in the months to come, in the years to come,\nas you serve, as you work diligently through hard issues, complicated issues, and very\nconsistency, long days.\nThere is a God who knows just what you need, who provides all that you need at exactly\nwhen you need it.\nLet us pray together this morning.\nin heaven, we are a needy people. We are not sufficient in and of ourselves, but ones\nwho desperately depend on you. And so, God, we are thankful, as we've seen here, even\nin this brief little verse, that you are a God who needs nothing and yet has everything,\nand you are completely sufficient in and of yourself. And yet you're also a God who\nis gracious and generous. And so, I pray for those that are here this morning that they\nThey might trust in you, lean on you, as they go throughout all the tasks they have this\nday and in the days to come.\nAnd God, I pray that as they do that, they would find you to be a God who knows all that\nthey need, provides just what they need, and exactly when they need it.\nWe pray these things in the powerful, mighty, and beautiful name of Jesus, amen.\nLet's stand and pledge allegiance to the flag.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands one nation under God, indivisible, with liberty and justice for all.\nMore keepers will unlock the doors.\nChair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, don't trust everything you see.\nsalt looks like sugar. Is there any objection to the confirmation of the\njournal that Chair here's none in the journal is confirmed? The clerk will\nread the resolution establishing the order of business for the day. Mr.\nBurns on her 59th Moose following me establishes the order of business and\nher first part of the period unanimous concerns introduction of bills and\nresolutions first reading and reference of house bills and resolutions second\nreading of bills and resolutions, reports of standing committees, third reading and passage\nof uncontested local bills and resolutions, first reading and reference of setup bills\nand resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is none and the resolution is adopted.\nreading of Bales and Resolutions of Clark Reed House Bill 755 by\nRepresentative Meeks and 178 will be taught an act to men that\ncreated Board of Elections and Registration for Pierce County\nIntergovernmental Coordination House Bill 756 by\nRepresentative Meeks and 178 Bill be taught an act to reconstitute\nreestablish the Board of Elections and Registration of Pierce County\nIntergovernmental Coordination House Bill 757 by\nRepresentative for one of the 89th Highland of the 54th\ncan in the 80 of the 58th.\nThat's the 55th drier, the 59th and others.\nThere'll be Todd and Active Men,\nthe Atlanta Urban Enterprise Zone Act.\nIntergovernmental Coordination.\nHousehold 758 by Representative Davis\nto the 87th Scott of the 76th,\nMcLeod of the 105th and Scofield of the 60th.\nThere'll be Todd and Active Men Article 4 chapter 18\nin Title 50.\nThe official go to Joe Van Tater relating\nthe inspection of public records.\nRules.\nHousehold 759 by Representative Petrie,\nthe 166th Bill be Todd and Active Authorized\ngoverning authority of the town of Thunderbolt to levying an excise tax.\nIntergovernmental Coordination House Bill 760 by reference in a park of the 101st\nclerk of the 108th Kendrick of the 93rd and marine of the 96th, McLeod of the 105th\nand others, will be taught an act to amend the act creating board of commissioners of\nGwyneth County.\nIntergovernmental Coordination Senate Bill 21 by Senator Jones, the 10th Butler, the 55th\nAnderson, the 43rd, will be taught an act to amend an act to incorporate the city of\nstonecrest into cabins.\nThe Intergovernmental Coordination.\nSenate Bill 287 by Senator Paine to the 54th and Anderson to the 24th, Bill Bitton and\nAct to Maddenack, providing a new charter for the city of the Intergovernmental Coordination.\nSenate Bill 290 by Senator Hickman to the 4th, Bill Bitton and Act to Maddenack, providing\nfor the composition of Board of Education of Evans County.\nIntergovernmental Coordination.\nThat completes the first readers.\nSecond reading of Bill's Resolutions, the clerk or read.\nHouse Bill 753 by represent Smith with the 70th Jenkins of the 132nd Bonner,\nthe 72nd Singleton of the 71st to build to create the Cowayda County Public Facilities Authority.\nHouse Bill 754 by represent Benton of the 31st to build to amend and\nact to provide a new charter for the city of Austin.\nSenate Bill 274 by Senator Thompson of the 14th,\nthe House Debtler of the 52nd.\nThe bill to provide a homes to the exemption from Bartow County School District Evalor in Texas.\nSenate Bill 275 by Senator Thompson of the 14th and House Debtler of the 52nd.\nBill to amend an act providing a new, for a homestead exemption from certain Bartow County School District at Valorant Taxes, through 2nd Readers.\nReports of standing committee is the clerk will read.\nRepresentative Greg Morris, the 156th District Chairman on Committee on Banks and Banking submitted the following report.\nMs. Speaker, Committee on Banks and Banking, is that on consideration the following bills of the Senate.\nThe District Committee report, saying back the House following recommendation, Senate Bill 168 Dupas, respectfully submitted.\nRepresentative Greg Morris, the 156th District Chairman.\nRepresentative Chan Takersley, the 160th District Chairman on Committee on Intergovernmental Coordination Local submitted the following report.\nYou committee on intercom or coordination locals have a consideration following bills of the house\nInstructed me to report the same back to the house filing recommendations house will 724 new pass house will 730 new pass house will 734 new pass\nHouse will 739 new pass house will 742 new pass house will 743 new pass house will 749 new pass house will 750 new pass\nRespectfully submitted representative tackers leave the 160th district chairman\nSenator Chuck, of the 100th District Chairman of the Committee on Judiciary submitted the following report.\nAnd the Speaker of the Committee on Judiciary has set under consideration the following bills of the Senate.\nAnd this is Dr. Media Report saved back to the House of the following recommendations.\nSenate Bill 9, do pass by committee substitute.\nSenate Bill 32, do pass by committee substitute.\nSenate Bill 34, do pass, Senate Bill 75, do pass, Senate Bill 143, do pass.\nSenate bill 163, due pass by committee substitute, Senate bill 169, due pass, Senate bill 185, due pass, Senate bill 221, due pass, respectfully submitted.\nRepresentative Chuck Constration, 104th district chairman.\nSenate John Corbett, 174th district chairman of the committee of motor vehicles submitted the following report.\nThe speech of the committee on motor vehicles is out on consideration.\nFollowing bills of the Senate is instructed to meet the report, same-backed, thus following recommendations.\nSenate Bill 210, new pass, Senate Bill 237, new pass, respectfully submitted.\nRepresentative John Corvitt of the 174th District Chairman.\nRepresentative Lynn Smith, the 70th District Chairman of the Committee on Natural Resources and\nEnvironment submitted the following report.\nAnd speaking of Committee on Natural Resources and Environment, is that in consideration\nthe following bill of the Senate, the District of the Media Report, same back class following\nrecommendation, Senate Bill 119, new pass, respectfully submitted, representative Lynn Smith,\nthe 70th District Chairman.\nRepresentative Dave Belton of the 112th District chairman of the committee on special rules submitted the filing report to speak your committee on special rules\nIs on a consideration following a resolution to the House is instructed me to report same back to the House following recommendation\nHouse resolution\n117 do pass by committee substitute respectfully submitted\nRepresentative Dave Belton and the 112th District chairman\nThat completes the reading the reports of standing committees\nOkay, we're going on now to the local calendar, going on to the local calendar, third reading\nand passage of uncontested local bills.\nFor what purpose does Chairman Tancersley rise?\nMr. Speaker, I rise to make motion.\nState your motion.\nI would like to make motion to recommit House Bill 739 to Intergovernmental Coordination\nCommittee.\nTancersley has moved that House Bill 739 be recommitted to the Intergovernmental\nCoordination Committee. The author is agreeable to that. Is there any objection?\nMr. Clark, you want to read the caption? House Bill 739 by Reps and of\nRoss to the 7th of the City of Blue Ridge.\nOn the ladies' motion, is there any objection?\nIs there any objection hearing none?\nThat bill will go back to the Intergovernmental Coordination Committee.\nIf there is no objection, we will vote on the local calendar as a whole without House Bill\n739.\nit is so ordered, the clerk will read the local calendar.\nHouse will 724 by reps of Allen, the 40th Cobb County, House will 730 by reps of Carcorder,\nthe 4th Woodfield County, House will 734 by reps of Gamble, the 15th City of Uihari,\nHouse will 742 by reps of Dubnic of the 29th, Gainesville City School District, House will\n743 by reps of Dickey, the 140th City of Fort Valley, House will 749 by reps of Gillier\nto the 160 second, Chatham County,\nHouse Bill 750, Barbara, some gillier to the 160 second,\nChatham County.\nIs there any objection to the previous question\nbeing ordered on the local calendar?\nThe chair here is none, the previous question is ordered.\nis there any objection to agreeing to the report of the committee, which was\nfavorable to the passage of the bills. The chair here's none the report of\nthe committee has agreed to. Shall these bills now pass all those in favor of\nthe passage of the bills remaining on the local calendar will vote aye of those\nopposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine.\nOn the passage of the bills on the local calendar, the eyes are 153.\nThe nays are two.\nThese bills having received the requisite constitutional majority are therefore passed.\nWe're going on now to morning orders.\nThe ten minute rule will be strictly enforced today because we have a joint session coming\nup soon.\nGoing on to morning orders, Chair recognizes Representative Carpenter for a morning order.\nThank you, Mr. Speaker.\nI just want to come today and apologize.\nI offended some members in this body yesterday.\nMost of you know I enjoy a good laugh and love to keep things light and such as tense\nsociety.\nI can assure you I never wanted to come across that way and I apologize if my words offended\nyou in any way and I hope you can find it in your heart to forgive me.\nI yield the well.\nChair recognizes the Dean of the House, Dean Smirey, for a morning order.\nThis speaker and members of the House, I just wanted to come down today. It's Columbus Day, and on behalf of Chairman Richard Smith,\nRepresentative Hugley, Representative Vance Smith, and Representative Buckner.\nYou should have received a gift bag in your office and on behalf of our chairman, Gerald\nMitchell and Pace Holtar, our Chair of our Board of our Chamber, you have a nice charcoal\nBarbara, Bobby Cue Kid in here,\nand the Aflac Duck, and a couple other niceties.\nSo, Mr. Speaker, we just wanted to,\nyou know, we always have Columbus up here,\nbut because of COVID, we're not able to visit the Capitol,\nbut on behalf of our City of Columbus,\nour Mayor and our Chamber of Commerce\nand Columbus State University and Columbus Tech,\nwe just want to say thank y'all for y'all's support\nof the Columbus community.\nOn behalf of our delegation, thank y'all very much.\nChair recognizes Chairman Dempsey for a morning order.\nGood morning and thank you, Mr. Speaker.\nAs we focus on National Women's History Month, I want to bring you two incredible ladies\nwho have been prominent leaders throughout our century.\nI want you to just take a moment and look at it.\nIn case any of you have seen this magazine here,\nyou should have received the Georgia magazine\nfrom our Georgia EMCs.\nOn the cover is an incredible woman from Rome, Georgia.\nHer name is Jane Tucker.\nShe's 93 years old, and at the age of 16,\nshe learned to weld at a shipyard in Savannah\nand help build the Liberty Ships for the war effort.\nShe is one of those rosies.\nThey're profound.\nThey walk across all of our avenues and places in life.\nLast year, we would have honored them,\nbut because of the pandemic, I hope that next year,\nwhen it's in our rearview mirror,\nwe will honor their 102 years of service.\nBut I want to ask you now to focus\non an incredible educational leader, Martha Berry.\nShe founded the Berry Schools for the academically able,\nbut economically poor children,\nall throughout rural South Georgia, particularly.\nThe Berry schools became the model for vocational agriculture\nand mechanical schools throughout our world,\nshowing how the needs of people in poor rural areas\ncould be met.\nThrough her schools, she blazed a trail\nfor the establishment of an agriculture mechanical school\nin each congressional district of Georgia.\nIn the early 1900s, these grew, and within three decades,\nThis grew into Berry College, a comprehensive,\nstrong liberal arts college that still exists today.\nShe traveled widely.\nShe became an accomplished fundraiser.\nMany of the gifts were small, but she also received support\nfrom philanthropist Andrew Carnegie,\nAutomotive Pioneer Henry Ford,\nPresident Theodore Roosevelt,\nand President Woodrow Wilson's wife,\nEllen Axon Wilson, also from Rome.\nThat wasn't heard of at that time\nfor a female to go out on her own and ask for contributions.\nAs you look around here today, you're\nin the midst of many who have graduated\nor been touched by Barry College.\nThey've attended, they've graduated,\nthey have children or family and friends.\nOur own Holly Pitcock is one of those special, special\nalums from Barry College.\nThis work is so profound, she taught the value\nof appreciating our land and gathered while she was still alive, 30,000 acres that are\npart of the campus.\nIt continues to grow and the motto of head, heart and hand and not to be ministered unto\nbut to minister can be seen in all of those who have been touched by an education or an\nexperience at Berry College.\nThank you, Mr. Speaker.\nI yield the well.\nChair recognizes the Speaker Pro Tem of the House, Speaker Pro Tem Jones for a morning\norder.\nWell, thank you, Mr. Speaker.\nI want to draw everyone's attention to a brave and determined woman who made a difference\nin our state and, frankly, nationally, Charlene Hunter Galt.\nShe paid the way not that long ago for African Americans to attend Georgia State colleges\nand universities and pursued the American dream.\nFollowing graduation from Henry McNeill Turner High School Hunter Goat applied to the University\nof Georgia and was denied admission due to her race.\nShe enrolled at Wayne State University in Detroit, but her battle was not over.\nteam of civil rights attorneys secured her admission to UGA in January of 1961. It made\nher the first black woman to attend the women, the nation's oldest public university.\nShe graduated from UGA with a degree in journalism from the Henry W. Grady's School of Journalism,\nwhich I'm proud to say I did as well. Following graduation, she led a most successful career\nand journalism, which I did not.\nToday and every day, we remember women like Charlene Hunter\nGold, who paved the way for Black Georgians\nto pursue their dreams of higher education\nin our great state.\nThank you, Mr. Speaker.\nChair recognizes representative Glanton\nfor a morning order.\nThank you, Mr. Speaker, and good morning,\nladies and gentlemen of the house. I just came up this morning to say thank you. Thank\nyou to those of you who have reached out to me doing my health challenges. And thank\nyou to those who even thought about reaching out to me this morning. And so I want to\nsay that some folks have been a little concerned and it's not COVID related. So you don't\nhave to bump air, we can bump.\nBut also, I just want to see something\nthat you go through life and different things happen\nand you never expect some things to happen,\nbut they do anyway.\nAs a military, growing up in the military,\nI was master fitness, I was drill sergeant candidate,\nand I was paratrooper airborne.\nBut this has certainly been a humbling experience.\nAnd so while I will be on light duty for a while,\nI declare and decree that by his stripes,\nI am healed.\nSo thank you, may God bless you, and may God bless this house.\nGo dogs.\nThank you Mr. Speaker. Good morning colleagues. On behalf of our Augusta delegation, we are so proud to commend three of our public\nhigh school basketball teams that won championships on last week,\nTW Josie Girls, Cross Creek Girls and Boys was the only school that had two teams in\nand it was their first championship in school history.\nWe commend them and thank you so much for your support. We yield the well.\nChair recognizes representative Reeves for a morning order.\nThank you, Mr. Speaker, realizing that I used up years of goodwill yesterday, but I would\nbe remiss if I didn't come to the world of the day and also pay recognition that yesterday,\nthe Georgia Tech Lady Yellow Jackets basketball team received a birth to the NCAA tournament.\nThey're going to be a number five seed, which is four seeds better than our mids program.\nIt's great that we have the state of Georgia representing us on a national level, good\njackets.\nThat completes morning orders for today if you have signed up and didn't get reached\nand you want to be reached tomorrow then see the messenger.\nWhat purpose does the chairman of the House Rules Committee rise?\nParliamentary inquiry and immediately followed by motion, please.\nState your inquiry.\nWell, isn't it true that the last words out of my wife's mouth this morning was to play\npretty. And part of the motion is I've moved that Senate Bill 46 be recommitted\nback to health and human services.\nThe I want to party to your conversation with your wife this morning so I hope you listen\nthough. On the chairman's motion that Senate Bill 46 be recommitted to the health and\nHuman Services Committee.\nClerk will read the caption.\nSenate Bill 46, my senator Berkley, 11th, wants in the first hatch of the 50th\nMiller, the 49th, Copatric, the 32nd, and others.\nThe entitled act to men, title 31 of the fish go to Georgia,\nannotated relating to health.\nSo it's to authorize certain medical personnel to administer vaccines during the\npublic health emergencies under certain conditions.\nOn the gentleman's motion, Senate Bill 46, be recommitted to the Health and Human Services\nCommittee.\nIs there objection?\nIs there objection, Chair, here's none, and it is so ordered.\nor read the caption to a group of privileged resolutions.\nHonoring the Life and Memory of Lieutenant Colonel Charles\nGeorge Nieman, Honoring the Life and Memory of Mr. Bradley\nScott Brad Bynes and Dedicating a Road News\nMember, Honoring the Life and Memory of Comer H. Flynn,\nHonoring the Life and Memory of Jeremiah Lawrence,\nhonoring the life and memory of Daniel Allen Donautz.\nRecognizing an honoring, Mr. Elmore Mo Calloway Thrash,\nJr. upon his 50th year of lobbying at the Georgia State\nCapital, recognizing the importance of creating\nmultiple diploma pathways for high school students,\nrecognizing commending Nancy Burton,\ncongratulating commending Maria F. Feifer\nfor receiving the 2021 Yellow Rose\nNICY-T Randall's Service Leader Award.\nRecognizing commending judge, Lewis Patterson,\ncommending and congratulating Adam Riley Plocha.\nCongratulating commending,\nLarissa Settles for receiving the 2021\nNICY-T Randall Service Leader Award.\nCommending the Harrelson County High School Game Day,\ncheerleading team for winning the 2021\nstate cheerleading championship and for\nother purposes that completes the\nreading of privilege resolutions.\nIs there any objection to the\nadoption of the privilege resolutions?\nThe chair here's none and the\nresolutions are adopted for what\npurpose does Chairman Mate the\nact rise?\nMake a motion state your motion that\nthe rules of the House be temporarily\nsuspended so that a bill can be read\nan interduced and committed input into committee.\nChairman Matheak has moved that the rules of this house be temporarily suspended to allow\na bill to be read for the first time in a signed committee.\nClerk will read the caption.\nOn number of House bill, we're up to Matheak on the 73rd and 9th of the 130th to be\ntitled an act to amend the act to provide a board of elections for Spalding County.\nthe ladies' motion? Is there any objection? Is there objection? Chair, here's none, and\nit is so ordered. Intergovernmental coordination.\nOkay, we will do announcements after the State of the Judiciary, which should be\ncoming together most any moment now we'll be at ease for a moment but be\nprepared to come back in quickly and take your seat. We will have the Chief\nJustice and some representatives from across the hall with us today.\nYou\nYou\nYou\nYou\nYou\nYou\nThis House will come to order.\nThis House will come to order.\nMembers will please take your seats.\nMembers will please take your seats.\nMadam Doorkyper.\nMr. Speaker, the President, President Pro Tem, the Majority Leader, and the Minority Leader\nof the Senate, awake entrance to the House Chamber.\nMadam Dorkiever, please allow the President, the President Pro Tem, the Majority Leader,\nand the Minority Leader of the State Senate to enter the House Chamber, and please escort\nthem to their seats.\n.\n.\n.\n.\nMr. Speaker, the honorable Harold Milton, Chief Justice of the Supreme Court, and the\nthe Honourable David Namios,\nRick presiding justice of the Supreme Court\nawait entrance to the House Chamber.\nMadam Dorkiever, please allow the Honourable\nHarold Milton, Chief Justice of the Supreme Court,\nand the Honourable David Namios,\npresiding justice of the Supreme Court,\naccess to the Chamber.\nmembers may be seated members of the House of Representatives and Senate this joint session\nwill now come to order the clerk will read a resolution House resolution 315 by\nof Burns, the 159th, calling a joint section of House of Representatives in the Senate\nfor the purpose of hearing a message from the Chief Justice of the Supreme Court inviting\neach other, justices of Supreme Court, and each judge of the Court of Appeals to be present\nof the joint session and for other purposes.\nLadies and gentlemen of the House and the Senate, it is my distinct honor today to introduce\nto you, a dear friend and a distinguished jurist, the Chief Justice of the State of Georgia.\nA native of Washington, DC, our Chief Justice grew up in East Point and Marietta.\nHe attended Auburn University, where he was elected to serve as President of the Student\nSenate.\nIf you visit the campus there today, I'd encourage you to visit the Student Center, which has\nfittingly been named in his honor by his alma mater. He earned his law degree from the University\nof Georgia in 1991. He spent 11 years with the Department of Law where he dealt with issues\nfrom the creation of the Georgia Lottery Commission to Georgia's Tobacco Settlement.\nHe later served as Executive Counsel to Governor Sonny Perdue before his appointment\nto the Supreme Court in 2005, where he has served with distinction ever since.\nIt is for all these reasons that I was honored earlier this session to join with the Speaker\nPro Tem of this House, the Majority Leader and the Minority Leader and several Chairman\nto sponsor House Resolution 332, honoring Chief Justice Milton on the grand occasion of\nhis forthcoming retirement after 30 years of service to our state.\nSo please join with me and his dear wife, Kimberly, as we thank him for his service and\nwelcome him to our House Chamber, ladies and gentlemen, the Chief Justice of the State\nto Georgia, the Honorable Harold Melton.\nThank you.\nThank you so much.\nLieutenant Governor Duncan, Speaker Ralston, President Pro Tem Miller, Speaker Pro Tem\nJones, Members of the General Assembly, Constitutional Officer is my fellow judges, ladies and gentlemen.\nwritten in big letters above the bench of the Georgia Supreme Court is the Latin phrase\nfiat justicia, ruric, calum, translated into English it means let justice be done though\nthe heavens may fall.\nTo me this motto has always meant that we who are judges must do the right thing and\nuphold the rule of law regardless of politics, the public will, or the consequences.\nNow I have another take.\nGiven this past year, I believe it also means that justice must prevail even when everything\naround us is falling apart.\nTruth and justice for all must remain front and center, even if we find ourselves in historic\ntime of great political upheaval, racial and social unrest, and the worldwide pandemic\nthat has altered our lives.\nI thank you for this annual opportunity\nto report to the general legislature\nthe state of this judiciary.\nWhat the courts have accomplished this past year\nand where we are headed.\nAnd I thank you for your continued support.\nI'm also grateful to Governor Campfour's leadership\nand help this past year.\nI want to give a special greeting to my lovely wife,\nKimberly, who adjusted her travel plans\nat the last minute in order to be here for this moment.\nI'll tell you that this is the kind of support and love that she is consistently extended\nto me and I do thank you for being with me here on this special day and thank you all\nfor recognizing her in a special way.\nWhen I stood before you a year ago, I spoke of the pride and hope that I had in our Georgia\njudicial branch of government going forward in 2020.\nI did not know that three weeks later I would declare a statewide judicial emergency in\nresponse to the COVID-19 pandemic that had reached Georgia's borders.\nI did not know that in coming months,\nmany of us would lose colleagues, friends,\nand loved ones to this dangerous disease\nor fall victim to it ourselves.\nI did not know how hard our courts would have to work\npivot and change in order to uphold justice.\nBut today, ladies and gentlemen,\nI can report to you that going forward in 2021,\nthe state of our judiciary is sound, solid, and strong.\nIt is not with Alex challenges and I particularly want to thank you for your support of this legislative\nsession in helping us to confront some of those challenges.\nThis past year I have witnessed firsthand that your judges and courts are remarkably resilient,\nflexible, creative, and committed in their mission\nto uphold the law and meet out justice fairly and equitably.\nIt has been my honor and one of the highlights\nof my professional career to work\nwith an amazingly cohesive group of justices, judges, clerks,\ncourt administrators, leaders of the state bar, law school\ndeans, public health officials, sheriff's offices,\nand others who have collaborated and cooperated\nto keep our courts open and the work of the judiciary\non track, all while going an extra distance\nto ensure that people are safe.\nOur courts exist to uphold the rule of law.\nIt is what we are, it is who we are.\nThe rule of law is the principle that in our nation\nand in our state, the law is in charge.\nNot a king, not a dictator, but a body of laws.\nNo one stands above the law\nand no one should be treated differently under the law.\nIn a democracy, our laws must be applied equally\nwhether you're a weaker, powerful, richer, poor,\nwhite, or of color, young or old,\nor of one religion or another.\nThe rule of law is intended to protect the rights\nof the people and to prevent tyranny.\nJustice and the rule of law cannot wait on the pandemic.\nOne year ago, on March 12, 2020, in an emergency phone call, I told Georgia's judicial leaders\nthat under state law, the chief judge of each judicial circuit had the authority to suspend\njury trials and other court proceedings in response to the COVID-19 virus.\nThe next day, Fulton County Superior Court Chief Judge Christopher Brascher became the\nfirst to do so.\naround the state soon followed suit. Two days later, I declared a statewide judicial\nemergency following the lead of Governor Camp. The order took effect immediately and was\ndue to expire in 30 days as state law required. At that time, we knew of only one death in\nGeorgia due to COVID-19. The emergency order sign that they required courts to remain open\nto address critical or central functions and give priority to such matters as domestic\nabuse or straining orders, criminal bond hearings, mental health commitment hearings, and cases\nwhere the immediate liberty or safety concern was present.\nThe order suspended a number of judicial deadlines and urge courts to begin using video conferencing\nwhere possible as a safer alternative to in-person proceedings.\nIn the ensuing months, new orders followed every 30 days, extending the statewide judicial\nemergency order.\nAt first we thought this pandemic would be over in a matter of months, and we would go\nback to normal.\nI certainly never envisioned that we would still be within its grips one year later.\nWith the help of the administrative office of the courts and director Cynthia Clinton,\nwe have held emergency virtual meetings almost every week with the judicial council.\nThe Judicial Council is the policy-making body of the state's judicial branch that is\nmade up of judges representing every class of court in Georgia.\nThose meetings, in those meetings we heard questions that needed to be answered, rules and\nlaws that needed to be changed and steps we needed to take to get the courts fully operational\nduring a pandemic.\nIn a normal year, there are four quarterly meetings of the Judicial Council.\nIn this past year, there have been more than 30, and they have been extremely productive.\nI want to emphasize that from day one of this emergency, Georgia's courts have remained\nopen, and the work of the courts has continued.\nIt looks different.\nAlong the way, I've told judges that if you have to stick a bucket inside the door of\nthe courthouse to accept the filing and instruct that file or to kick that bucket back and\nforth in order to get things going, then do that.\nSo our courts have not closed.\nWe've adjusted operations, and there are things that we have not been able to do, but\nour courts have not closed.\nOur judges have taken an oath to uphold the law, and many will tell you that they go to\nbed at night worried about how they can push cases towards resolution without endangering\nthe public health of all those who come to our court houses.\nYou should be proud of the many judges in Georgia, in the superior courts, the state courts,\nthe juvenile courts, the magistrate courts, municipal courts, the business court, and the\nappellate courts, who have stepped up this year to go beyond the normal duties, to keep\ncases moving as much as possible, and to keep people safe.\nIn some cases, it has cost them their lives.\nOur probate court judges have been particularly hit hard by the virus.\njudges have a host of critically important jobs including the emergency\nappointment of guardians and the involuntary hospitalization of incapacitated\nas adults and other dependent individuals. Ensuring care for those who\ncannot care for themselves cannot wait until the end of a pandemic. Among\nprobate judges we lost this year from COVID-19 our judge Karen Baton of\nBrantley County, described by a probate counsel president, Kelly Wulk, as a\ngenuinely kind soul. Judge Nancy Stevenson of Dirty County, a judge who loved\nand served her community of Albany, a community which loved her back. And\nJudge John Payne of Chittuga County, a veteran of the U.S. Marines, and the\nformer Sheriff's Deputy, who was elected Chittuga County probate judge at the\nage of 25 and remained a probate judge for the next 45 years until he was struck down by the\ncoronavirus. We lost my dear friend and colleague, former Chief Justice George Carly to the virus.\nAnother former Chief Justice Norman Fletcher lost his beloved wife, Dott.\nIn superior court judge Horace Johnson of Covington, a bright shining star left us way too early.\nafter collapsing only hours after holding a virtual court hearing from his home.\nAnd even though he tested positive for COVID-19, Judge Johnson continued doing his sworn duty until the end.\nIn addition to these countless of judges and staff deputies, prosecutors, and public defenders,\nand others in our court family, many have contracted the virus, but survived COVID-19.\nI know a number of you have suffered similar losses, and maybe you've even had the virus\nyourselves. I want to thank you for still being here and showing up to do the great business\nof this great state. Thank you.\nIn the first month of the emergency order, the Supreme Court of Georgia like other courts\ncanceled courtroom sessions that were scheduled for March 2020 for our arguments.\nBut my colleagues and I, thanks to our first-rate IT staff, quickly adapted to the use of Zoom\nvideo conferencing technology as the attorneys who argued before us.\nAnd with the exception of March, the state's highest court has not missed a single month\nof oral arguments.\nThe cases canceled in March were added to the April calendar and we have continued to\nstay on track.\nOur court of nine justices continues to meet regularly and virtually to decide cases.\nAnd the number of opinions we issued remained about the same as in the last two years.\nWe issued 265 opinions from April through December in 2020 compared to 261 opinions during\nthose same months in 2019.\nAt the beginning of the emergency, one bright spot was the governor's appointment last\nMarch of a New Justice, Judge Juan McMillan of the Georgia Court of Pills, who took\nthe seat of the retired Justice Benham.\nJustice McMillan is the first Asian American ever appointed to the State's highest court,\nand she has been a welcome addition.\nAlthough the number of cases argued before the court has slowed during the pandemic, the\nwork of the court has increased because of the pandemic.\nI'm so grateful to my colleagues,\npresiding Justice David Namius,\nformer Justice Keith Blackwell,\nJustice Michael Boggs, Justice Nails Peterson,\nour clerk of court, Ms. T. Barnes,\nour chief deputy clerk, Ms. Tia Milton,\nwho formed our internal working group\nto lead our judicial branch through this crisis.\nAmong many changes,\namong many changes, we amended the court rules,\ntrial court rules to allow for virtual hearings\nthrough video conferencing technology\nin proceedings that normally require\nthe physical presence of the judge and parties.\nWe also replace the in-person Georgia Bar Examination\nwith an online bar exam to avoid having hundreds of people\nsitting for hours in close quarters.\nThis took enormous effort, and I'm thankful\nto all those involved, former Justice Blackwell,\nJustice Peterson, the board of bar examiners,\nthe office of barred missions under the leadership of Heidi,\nFyanzah, and the deans of all five of our law schools.\nWe have successfully administered two remote barred exams,\none in October and one last month,\ntesting a total of more than 1,800 applicants\nwho now have a path of licensure to practice law.\nI also want to thank Governor Camp and his staff\nwho helped us in making some of these changes.\nThe governor responded to us immediately last April by issuing an order that now allows\nnotaries to certify documents remotely rather than in person.\nFrom the beginning of this pandemic, our greatest challenge in the judiciary has been jury\ntrials.\nWhen people think of the courts and court business, most think of jury trials, the kind of things\nwe see on TV.\nIndeed, jury trials are the hallmark of our American system of justice, a fundamental constitutional\nright in a criminal case to be tried by a jury of your peers. Early on, we suspended jury\ntrials due to the number of people involved, the length of the trials, and especially due to\nthe number of citizens needed to be summoned in order to have jury selection.\nThe public health risks to all involved was significant.\nAt that time, we were seeing COVID outbreaks in Georgia and across the nation, where large\nnumbers of people were gathering inside close quarters, such as they do for a jury trial.\nThe decision to open jury trials is different than opening businesses.\nUnlike when individuals choose whether they visit a store or a gym or a restaurant, when\nThe citizen receives the jury summons.\nThat is not an invitation.\nIt is an order.\nWe compel people to come to court.\nIt is therefore been critical that when we summoned jury\ntrials, we did it the right way,\nwith the necessary safeguards in place\nto protect the public health and safety of the lawyers,\nthe judges, the jurors, the clerks, the bailiffs,\nthe sheriff's deputies, court reporters, witnesses,\ndefendants, parties, and all the many people we require to be present for a trial.\nBut we suspended jury trials at a real cost, and we recognized that we could not suspend\nthem indefinitely, even during a pandemic.\nUnindicted criminal cases have been building, and there are many individuals in jail who have\nbeen waiting for more than a year under the presumption of being innocent until proven guilty.\nIn addition to criminal trials, many people are awaiting resolution of weighty civil\nmatters, including cases that involve business disputes and personal injuries and divorces\nand child custody.\nIn mid-October, I signed an order lifting the suspension of jury trials.\nNot too long after that, we reopened jury trials, however, the number of coronavirus cases\nspiked.\nAnd in December, we had to shut down jury trials again.\nSince then, our courts have been accumulating more cases, more than those that have been\naccumulating more cases than our waiting in diamond and trial.\nThe potential backlog in cases is staggering and we must find a way to reduce the growing\npressure.\nSo one week ago, after the number of coronavirus cases, sharply declined, I again signed\nan order authorizing the resumption of jury trials in Georgia.\nAfter this order, before jury trials may resume, courts must have written plans in place\nto ensure that jury trials can be conducted safely and in conformity with public health\nguidance.\nI'm grateful for the leadership of former Fulton County Superior Court Judge Charlotte\nGrueh, now Justice Grueh, the most recent appointee to the State Supreme Court.\nShe and Chief Judge Russell McClellan of the Forsyth County State Court together have\nof co-chair the Judicial Council's COVID-19 Task Force\nthat I appointed last May.\nSince then, they've been working diligently\non the particulars of getting the courts fully\nand safely operational during and after the pandemic.\nThese two leaders have marshalled the resources\nof the judges appointed to that task force\nand divided them into subcommittees\nto address various issues.\nThey brought in clerks and civil and criminal lawyers,\npublic health experts and others as advisors.\nAmong them was Dr. Mark Swain cut\nof the Fulton County Board of Public Health\nwho has been an invaluable source of wise counsel.\nTogether, these professionals, all volunteers,\nhave created guidelines on how courts must operate\nto ensure safety for in-person proceedings,\nincluding jury trials.\nThey started with one question,\nhow can we keep everybody safe?\nThe plans that courts must have put in place prior to resuming jury trials cover everything\nfrom where people part to how they walk into the building, how they line up to go through\nsecurity, how they ride the elevators and walk through the halls or visit the restaurants.\nOn the day of the trial, the court will look different than it has in the past.\nProtocols include pre-screening for health risk of all parties, temperature checks, use\nof mass, social distancing, plexiglass barriers, touch-free evidence technology, constant\nsurface cleaning, and the reconfiguration of courtrooms and jury spaces to ensure social\ndistancing. You may see spectators in one courtroom and participants in another, also that\nwe can accommodate social distancing. In some cases, court will be held in a different\nbuilding altogether. These changes are well underway all across the state. We\nare of course hopeful that the widespread vaccination of citizens will help\nput it into this pandemic, but we're not there yet. And even when that day\ncomes, our courts will face a huge challenge, one for which we will need your\nhelp. As I said before, we've gone essentially one year without jury trials.\nAlthough judges across the state have worked hard to keep the trial and the jail\npopulations down, there still remains a large number of inmates still sitting in jail waiting\nfor their cases to be heard.\nAnd although we now have lifted the suspension of jury trials, it could take up to one and\npossibly three years to dig out of the backlog.\nNot only will we have significantly more cases, but the process of moving those cases through\nthe system, at least initially, will go more slowly due to the safety protocols.\nAs we resume jury trials, if we're only able to move at a third of the pace, we will\nbe relieving some of the pressure, but the backlog will continue to grow.\nFulton County has the largest court system in this state.\nIn a ten-month period, the number of defendants in jail without being indicted grew from 230\nto roughly 1,400.\nAt the same time of the 40 courtrooms normally used in Fulton County for trial courts, only\ntwo are large enough to hold an array of prospective jurors while accounting for social distancing\nand public health precautions.\nThroughout the pandemic, we have suspended the statutory speedy trial deadlines as a part\nof our statewide judicial emergency.\nOnce the governor ends the public health emergency,\nby law, the judicial emergency must also end.\nUnder the Georgia statutory law,\nif a defendant files a speedy trial demand,\nthe court has only a few terms of court\nto try that person.\nAnd if it fails to meet that deadline,\nthe defendant is automatically acquitted and released.\nFulton County and other large counties\nhave terms of court there are only two months long.\nImagine what would happen in Fulton County\nif those 1,400 inmates\nwent indicted all filed speed trial demands.\nThe avalanche of demands would overwhelm the court system\nand a sizable number of defendants\nwould be acquitted and released without trial.\nWe realized the burden of having defendants\nwaiting longer for trial while being in jail.\nBut we need to have a system that actually determines\nwhether people who have been charged\nand indicted with a crime\nare guilty or innocent before allowing them to walk free.\nSo we need your help to avert this crisis.\nWe're also very grateful to the Georgia General Assembly\nfor your support for House Bill Senate Bill 163,\nwhich is designed to address the situation.\nThis legislation will allow trial courts in some counties\nto continue to suspend statutory speedy trial deadlines\nuntil those deadlines could reasonably be met.\nConstitutional speed trial rights are not affected.\nAnd this legislation has a sunset date,\nso we're targeting this legislation\nto allow us to get through this backlog.\nThis legislation is the highest priority\nof the Judicial Council and the Georgia courts\nand Georgia Superior and State courts.\nAnd we have proposed other legislation\nthat will help us well to get through the backlog.\nAll these legislative proposals\nare supported by the Judicial Council\nand we appreciate the amount of consideration\nthat you have given them.\nI've mentioned to you before,\nour courts have had to pivot and change,\nlike many of your businesses in our society.\nProbably the biggest change in how our courts operate today\nhas come through the use of technology.\nAnd many of our judges have surprised even themselves\nby how proficient they have become.\nIn every judicial order that I've signed,\nWe have encouraged courts to switch from in-person\ncourt proceedings to video conferencing\nwhere legally and practically possible.\nMany of our courts rose to the occasion\nand seemed to have turned on a dime.\nAs president of the Council Superior Court Judges,\nChief Judge Brian Amaro of Henry County\npushed for the immediate acquisition of WebX licenses.\nSo Superior Court Judges around the state\ncould increase their use of video conferencing.\nToday, 238 licenses are now in use by judges all over Georgia.\nUnder Chief Judge Brascher, the Fulton County Superior Court,\nFulton County courts have built a huge infrastructure\naround Zoom with more than a dozen Zoom stations\nat the Fulton County jail,\nso that judges can conduct aramance and plea hearings\nwithout having to transport defendants.\nPre-COVID, the county was busing 200 inmates a day\nto the courthouse involving an enormous security undertaking.\nToday, they transport an average of less than 12 a day.\nI believe that this is one of the types of changes\nthat may become permanent.\nWe have learned a great deal during this pandemic,\nand we need to continue using some of the things\nthat we've learned to make us better and efficient.\nThere are other types of hearings I believe\nthat we will continue to conduct virtually.\nWe have learned that it probably doesn't make sense\nto require an attorney from Savannah\nto travel to Atlanta for 15-minute status conference\nwith a judge, where the judge will simply ask,\nhow are we looking?\nWhat do you think we're gonna be ready for trial?\nThe client really shouldn't have to pay for that.\nThat could be easily conducted virtually.\nOne of the many heroes during this pandemic\nhas been Chief Judge Rob Lunner\nof the Cobb Judicial Circuit.\nAs chair of the COVID-19 Task Forces Technology Committee,\nhe has led the judiciary on technology matters\nand helped many of our judges become more savvy and capable.\nJudge Leonard took it upon himself\nto create a library of video tutorials\nto help judges learn how to do Zoom\nand other virtual proceedings.\nHe's made use of technology understandable and accessible,\nand we are very grateful to him.\nI also want to mention a few more judges who thank them\nfor their dedication and leadership and creativity.\nNewton County's probate court judge and chief magistrate\nJudge Melanie Bell, member of our COVID-19 task force,\nbecame sick with the virus early in the pandemic.\nSo sick that she spent four days in the hospital.\nBut she recovered and has since become a beacon of hope\nand vigilance for the judiciary, stressing\nthat this crisis has brought Georgia's judges together\nin a collaboration like never before.\nAfter his son contracted COVID-19,\nCobb County Superior Court Judge Tain Kell\nconducted virtual hearings\nfrom a makeshift courtroom in his bedroom,\ncomplete with an American flag.\nUnder the leadership of Judge Dale Bubba Samuels\nof Monroe and Judge Willie Weaver of Albany,\nthe Council of Municipal Court Judges early on developed\nbest practices and guidelines for operating municipal courts to ensure the safety of the\npublic and court and court staff coming into the core houses.\nChief Judge Norman Quadra of Swanning has lost three family members to COVID, yet continues\nto stand out as a leader on the COVID-19 task force working with interpreters and court\nreporters.\nChief Judge Osso Jackson of the Cab Cab County Superior Court has been an innovative force\non the COVID-19 task force and with a judiciary as a whole, she recognized early on the importance\nof improving ventilation in the courtrooms and made that a priority for change.\nThis pandemic has had some unexpected consequences within the criminal justice system beyond\nhow the courts are adapting.\nOne of the effects of the pandemic has been an increase in mental health problems, drug\nabuse and suicide, both among those who come before our courts and those who work within\nthe judiciary.\nPeople with mental illness or substance abuse or both are already considered a vulnerable\npopulation.\nThey have needs which are typically unmet in which are driven up and which drive up their\nrisk for criminal activity or suicide.\nSince the pandemic, many therapy and support group meetings have shut down and this isolation\nand lack of interaction has contributed to their problems.\nYet in Georgia, our accountability courts or specialty courts, dealing with drug courts,\nmental courts, and others are thriving.\nThe work of the professionals and judges in these courts has been unwavering throughout\nthis past year.\nI've been amazed at their dedication and perseverance that they've stepped up to go\nthe extra mile. Accountability court team members have maintained critical\ncontact with program participants by visiting them at their homes, not only to\nconfirm that they are staying away from drugs and alcohol, but also to ask how\nare they doing and whether they need anything. The courts have helped keep\nparticipants connected by setting up treatment groups who can meet virtually\nand by conducting Zoom status hearings with judges. These participants know that\nthe judges and staff are invested in their lives because they meet with them virtually every\nweek for a minimum of 18 months. Some judges have begun returning to in-person group therapy\nsessions using masks and alternative sites, including meeting outdoors when the weather\nhas been good. Superior court judge Stephen Kelly of the Brunswick Digital Circuit has\nbeen holding felony drug court in a gymnasium. Georgia now has 169 accountability\ncourts. That's up from 72 in 2011. Chief Judge Kathleen Goslin of the North\nEastern Judicial Circuit has been a solidifying voice as leader of the\nCouncil of Accountability Court judges in continuing to further development of\nGeorgia's specialty courts. Even during a pandemic, six new accountability\ncourts are preparing to begin operations in the next year.\nGeorgia's accountability courts help fuel our economy.\nEach graduate has a positive economic impact of $22,129\nbased on the amount of money saved from avoiding sending\nthat person to prison, as well as other avoided cost.\nIf you take that $22,129 and apply it to the\n$1,841 participants who graduated last year,\nThat's more than a $40 million in in positive economic impact to the state of Georgia\nWe appreciate the support that you give and continue to give to these courts\nWe've also realized during this past year the psychological impact the viruses had on\nthe already stressful legal profession\nIn October of 2020 we lost an assistant district attorney in Columbus, Georgia to suicide\nI don't know what role COVID played in that, but a recent academic study supported the\nassociation between several COVID related experiences and suicidal ideation and attempts.\nThese findings underscored the need for access to mental health services during a pandemic.\nWe know from research that connected this to others has been identified as an important\nprotective factor in preventing death by suicide.\nThroughout the pandemic, we in the legal community have been working to foster connectivity\namong its members and raise awareness of available services.\nIn April 30 of this year, the Chief Justice's Commission on Professionalism under the leadership\nof Ms. Carly's career will hold a suicide awareness program statewide.\nWe want to make the case that death by suicide is preventable.\nWe want to assure members of our legal community that is okay to ask for help.\nI began talking to you today about justice and the rule of law, and I wish to conclude\non that topic.\nIn this past year, our world has been rocked by a pandemic.\nMy friend, Chief Judge, been stuttered of the Henry County State Court believes history\nwill call 2020 the year of the pandemic. But he also believes that 2020 will go\ndown as the year as of the call for justice. I like to think that we are in\nhistoric time of opportunity and reconciliation. I've often said that at\nbottom of the social unease we are experiencing is an assistance on the rule\nof law. That's what we are all asking for. That is the true promise of our\njudicial system. Both the pandemic and the social unrest of this past year call\nfor an even greater fidelity to the rule of law, not less, but more. My friends,\nI believe that every growth spur in our nation's history, moving us closer to the\npromise of liberty and justice for all, has come only after some degree of\nstrife and turmoil. What gets us to the next level is when people of good will\ndo the necessary soul work, soul searching and put on the shield and do the work that it takes.\nI believe that a year from now when my successor delivers the next state of the judiciary address\nin this Howard Hall, life will be different. We can only speculate about what will return to\nthe way it was and what will not. But one thing I'm sure of, regardless of what will be in the\nthe win on that day, Georgia's judiciary will remain steady and fully committed to the\nrule of law. That will not change. It has been one of my greatest privileges of my\nlife to serve the last 16 years as a justice on the state's highest court. In preparation\nfor my departure from the court on July 1, last week my colleagues voted unanimously\nto name presiding justice David Domes as your next chief justice. Justice Michael Boggs\nwill succeed him as presiding justice. There are no two more able. Our state is\nextremely fortunate to have them in these roles. A reporter recently asked me\nwhat I will miss most when I step down from the bench. I did not hesitate the\npeople. My colleagues are court staff, the judges I've gotten to know, and I'll\nmiss you, the many legislators with whom I've worked over the years. It has\nbeen such an honor. Thank you for that honor. May God bless you, may God bless your families,\nand may God bless the state of Georgia.\nAt this time I will ask the doorkeeper to escort the Supreme Court justices and their\ndistinguished guests from the chamber.\nMembers of the House, we have been honored to be joined today by some distinguished friends\nfrom across the hall.\nHe's recognized and honored my dear friend and a former member of this body, the Lieutenant\nGovernor of Georgia, Jeff Duncan.\nThe President Pro Tem of the State Senate, the Honorable Butch Miller.\nspeaker pro-tim of this body speaker pro-tim Jones and the majority leader of\nthe Senate majority leader Dugan and the minority leader minority leader Butler\nThank you all very, very much.\nChair recognizes now the majority leader of the House for a motion.\nMr. Speaker, I've moved it now that this joint session be dissolved.\nThe majority leader has moved that this joint session of the Georgia General Assembly be\ndissolved. All those in favor of the motion will say aye. Those opposed will say no. The\nthe eyes clearly have it and this joint session is now dissolved.\nOkay, we're going on now to announcements, going on to announcements.\nThis house will be back at order.\non to announcements. Chair recognizes Chairman Tancersley for an announcement.\nThank you, Mr. Speaker. The Intergovernmental Coordination Committee will meet today at\n1.30 in room 403. Thank you. Chair recognizes Chairman Hatchett for an announcement.\nThe majority caucus will meet today upon adjournment in the Floyd room at Twin Towers.\nUpon adjournment, we have a guest that will be there at noon, so please be there.\nThank you.\nChair, recognizes Chairman Hawkins for an announcement.\nThe committee on budget fiscal affairs will meet today at one o'clock in room, 341 in the capital.\nChair, recognizes Chairman Dubnick for an announcement.\nThank you, Mr. Speaker of the House Education Committee will be meeting at 3.30 p.m. today, 3.30 p.m.\nChair recognizes Chairman Eftration for an announcement.\nThank you, Mr. Speaker. Both subcommittees of the House Judiciary Committee are meeting today.\nGunter subcommittee at 1.30 in room 1.32 and Skoggen subcommittee at 3.30 in room 1.32.\nThank you. Chair recognizes Chairman Dickie for an announcement.\nThank you, Mr. Speaker.\nTomorrow morning, 8 a.m.\nAgricultural and Consumer Affairs Committee meeting,\nCLOB 606.\nChair recognizes Chairman Darlene Taylor\nfor an announcement.\nThank you, Mr. Speaker.\nThe Insurance Committee's Life and Health Committee,\nSubcommittee will be meeting today at 3 o'clock\nand 341, thank you.\nChair recognizes Chairman Cooper for an announcement.\nThank you, Mr. Speaker, there is a change\nwhen the Health and Human Services Committee\nis going to meet today.\nWe are meeting at three o'clock, not two o'clock.\nThe Health and Human Services Committee\nwill meet at three o'clock in CLOB room 606,\nthree o'clock, 606 in the LOB.\nThank you.\nChair recognizes Chairman Lumsden for an announcement.\nFull House Insurance Committee will be meeting in the morning\nat 8 a.m., C-L-O-B, 606.\nThank you.\nChair recognizes Representative Alexander\nfor an announcement.\nThank you, Mr. Speaker.\nToday we recognize and celebrate over 35 women\non the front line of the COVID-19 pandemic.\nThis virtual event marks the sixth\nannual Nikki T. Randall Servant Leadership Award\nsponsored by the Georgia Women's Legislative Caucus.\nCongratulations to all the honorees\nfor your outstanding services.\nThank you.\nChair recognizes.\nChair recognizes the majority leader of this house for a motion.\nMr. Speaker, I move that this house stand in recess until 2 p.m. today, then stand adjourned\nuntil 10 a.m. Wednesday, March 17, 2021.\nThe majority leader has moved that this house be in recess until 2 p.m. today.\nAt which time we would stand adjourned until Wednesday, March 17 at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThis house will be in recess until 2 p.m.\nstand adjourned until Wednesday, March 17th at 10 a.m.\n",
  "updated_at": "2026-02-12T13:46:33.084175+00:00"
}