{
  "video_id": "qKyCoAXXWxA",
  "url": "https://www.youtube.com/watch?v=qKyCoAXXWxA",
  "title": "Lt. Governor Jones | Tax Credit Reform Press Conference |  02/07/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 13,
  "summary": "Overview:\n- The Georgia Lt. Governor and legislative leaders discussed upcoming tax credit reform measures, with a focus on increasing transparency, accountability, and fiscal responsibility while maintaining Georgia's business-friendly environment.\n\nKey Actions:\n- None detected\n\nBills Introduced (First Reading):\n- None detected\n\nNotable Moments:\n- Lt. Governor Jones and legislative chairmen emphasized the need to carefully evaluate tax credits and incentives to ensure the best return on investment for Georgia taxpayers.\n- There was discussion of suspending a tax exemption for high-tech data centers, adjusting the affordable housing tax credit, and modifying the film tax credit.\n- The leaders praised the collaborative, deliberate process between the House and Senate in pursuing these reforms.\n\nVotes:\n- None detected\n\nAttendance:\n- No quorum notes\n\nAdjournment:\n- No specific adjournment time given, but this appears to be a press conference rather than a legislative session.",
  "transcript": "Good afternoon.\nAs many of you know over the past year, so we have taken a hard look at our tax credits\nto ensure we are putting state in the best possible financial posture.\nIt is our job to ensure the state's tax structure is fair and equitable for all Georgians.\nAnd there were no shortage of well thought out suggestions.\nSo after several meetings reviewing a number of audits, we've considered some recommendations\nand we'll be putting them into legislation.\nWe appreciate the work of our respective committees\nand hope to continue our joint review of tax expenditures\nand an effort to best serve the citizens of our state.\nWe set out with a few goals in mind to focus on.\nIncreasing transparency and accountability,\nstrengthening taxpayer return on investment\nand limiting the fiscal exposure for the state.\nIn general, we will be adding sunset provisions\nto exemptions and credits under a million dollars,\nshortening some of our longer carry forward items.\nAnd Chairman Huffsteadler has measures\naddressing transparency and accountability.\nAdditionally, we have some suggested adjustments\nto three specific credits\nin order to better align with our shared goals.\nFirst, we will be suspending the tax exemption\nfor high-tech data centers.\nAdditionally, we will be raising the salary threshold\nrequired to qualify for the exemption\nto 200% of the average county wage\nshould it be revisited in the future.\nSecond, on the Affordable Housing Tax Credit,\nwe have added some transparency\nat an uplift menu of options for entities\nto receive a portion of the state credit.\nAnd third, on the film credit,\nwe are adjusting the uplift menu\nto include nine possible measures\nof which production companies must hit four\nto obtain the additional 10% credit.\nWe also raised the minimum investment requirement\nand add assignability of credits\nwith regard to transferability to include\nan exposure limiting provision.\nWe believe these measures meet an expected level\nof fiscal responsibility while at the same time\npreserving a very business-friendly job\ncreating economic environment.\nMany thanks to Speaker Burns and Lieutenant Governor Jones\nfor their leadership and insistence\non protecting our taxpayers and our state's economy.\nNow hand it over to Chairman Huffsteppler.\nThank you Chairman Blackman, as y'all know we've had a very slow and deliberate process\nof evaluating these tax credits.\nJust like we've had a slow and deliberate process of lowering the income tax in Georgia\nwith triggers and safeguards to be sure we're doing it in a responsible manner.\nI got a few members that think maybe we're doing a little bit too slow, but we are being\nresponsible in it.\nBut I also want to point out, this isn't just about tax cuts, tax credits.\nWe've increased funding in many areas of our budget to address the growing needs of\nour state.\nAn example I'd like to give is our teachers now have the highest average salary anywhere\nin the south from Texas to Virginia.\nSo this is all about using the taxpayers' dollars in the most effective and efficient manner.\nWe also are in a competitive market with other states in our area of the country to attract\nboth businesses and the best and the brightest of talent.\nSo, George has certainly been a leader in the South,\nbut we can't relax and rest on our laurels, and we won't.\nSo, I thank Chairman Blackman for his hard work\nover the last year and the issues that he talked about.\nWe'll go through the process of both the House and the Senate.\nWe appreciate the work of the House,\nand we'll give it our due diligence in the Senate.\nWe look forward to getting their hard work to the Senate\nand continuing our efforts to give our taxpayers\nbest bang for their hard earned tax dollars and continue to make Georgia the\nenvy of the South in the nation. Again I appreciate everybody's work on this\nand we'll turn it over to our leader in the Senate Lieutenant Governor\nBert Jones. Thank you Chairman Hustler and thank you Chairman Blackwind. I just\nwant to really commend these two gentlemen for working so hard in the\noff season on this initiative. You know it's always been my goal to no one\ncontinue to lower our state income tax.\nWe've started that measure, started that measure\nseveral years ago.\nWe're going to continue to do that.\nAnd the only way you can do that is by assessing\nthe tax credits and incentives that are out there right now,\nadjust some of them, eliminate others.\nAnd that's what we're working on as two bodies.\nI want to thank the speaker for allowing us the opportunity\nto work together.\nI've had Chairman Black in my office in Jackson, Georgia on several times during the\nall season as well as Chairman Hussetler and so it just represents a good cooperation\nbetween both chambers looking at all these incentives and really looking out for the\ntaxpayers of Georgia at the end of the day because that's what we're here for and we're\ngoing to continue to do that and we're going to be very methodical and like I said,\nfiscally responsible and we're going to go at the pace that we want to go and but right\nnow we are putting these initiatives out there and each chamber will get to work on it and\nwe'll see what we come out as a final product but once again I want to congratulate our two\nchairmen for being able to work together and thank the speaker again for his continued\nfriendship and cooperation, and just look forward to continue to work on these things.\nSpeaker.\nThank you.\nSpeaker.\nSpeaker.\nSpeaker.\nSpeaker.\nWell, y'all know how I like to start off.\nIt's a good day to be a Georgian, I think.\nSome good announcements.\nI know it's a good day to be a Georgian.\nIt's a good day to be a Georgia taxpayer.\nWe want to take care of our Georgia taxpayers and to turn our governor and myself.\nand these two find chairman that are dedicated to the House and to the Senate.\nThank you for your work.\nYou know, we all in the General Assembly have worked really hard of the last few years\nto work on the issues that make sure Georgia continues to be the number one state in the country\nunrivaled in our country and our success.\nAnd what we've been working with here is part of that success story.\nYou know, Governor Camp continues to champion\nthe economic development and he's doing a great job\nof working with us and the General Assembly\nto write this story.\nWrite a story for Georgians, lower taxes, you know,\nhistoric, continued historic economic development projects\nall over this state.\nI like to remind myself of this, so I'll remind y'all\nthe best place in this nation in which to do business\nfor the last 10 years running.\nAnd we're not going to jeopardize that,\nBut we're going to make a few changes.\nAll the time, we've done all these things,\nworking together.\nWe've managed, as you also know, to put together\na $16 billion surplus for the people of our state.\nAll the while, as we put that surplus together,\naccumulated that surplus and saved it,\nwe've cut taxes and benefited Georgians\nby at least $5 billion.\nAnd along with that, I promise my folks everywhere I go,\nwhen I speak to my local groups at home or wherever I may be,\nthat we want to be, we are good stewards\nof our tax money, yours, mine, these gentlemen.\nSo we're making good investments.\nWe want to make sure those investments\nare receiving and creating jobs in our state,\nin our local communities.\nBut for the very best return on investment,\nthat we can possibly receive\nbecause at the end of the day, that's our job\nand that's what we're about.\nI think today's announcements\ncontinues us in the right direction\nand a very responsible direction,\none that is a fiscally sound position\nthat continues to move our state forward.\nNow, one of the things that Chairman Blackman mentioned,\nwell, we're looking at rebalancing, if you will,\nwhen it comes to incentivizing our data centers\nin this state, which is an important part of our success, but we know that these\ndata centers currently use a disproportionate amount of our state's energy. We\nhave to make sure that we are balanced with that, that we have to resource us\navailable. We also know that we've heard a lot of talk about this with our film\ntax credit, which has been very, very successful for Georgia. We want to make\nsure that we streamline our text credit so we continue to get the absolute best\nreturn on that investment for Georgia because if we don't we won't remain the\nnumber one state in this union in which stupidness and we are I believe as\nthese folks behind me believe and I believe we've demonstrated the house\nalong with Lieutenant Governor Jones, Chairman Blackman, Chairman Husteadler as\nAs we've worked, as they've worked, over this interim since last year, to put these great\nideas in place to ensure that all of the work we've done continues to be a reality and\nmaking Georgia this best place that I've heard about to live, work, and raise a family.\nSo that's what we're trying to do.\nNow we'll open this up.\nIf you're good with that,\nyou're trying to go to Willa,\nWilla at these two chairman,\nanswer some questions about what we're doing.\nSo with that, we'd be glad to take some questions\nand we'll get the appropriate answer from the appropriate person.\nSo thank y'all for being here with us.\nThank you for giving us this courage.\nWe look forward to your questions.\nNo, sir, you go.\nWill that Chairman Blackman take a stab at that one, right?\nIt would just be a function of the annual budget.\nSo the prior year's budget revenue, you would look at a 2.5% on transferability.\nIt doesn't limit what can be earned and what can be exercised.\nIt just limits the state's exposure on an annual basis and any credits would roll over\ninto the next year.\nWell, if you look at that, that's 900 million right now, right, or an excess of 900 million.\nYou could redeem all that you could take\nunder your current tax obligation that you choose,\nbut the transferability would be limited\nto that two and a half percent amount annually,\nand anybody that didn't get covered in that particular year\nwould roll into the next year\nso that you're not losing any credits\nand you would get an extra year carry forward\nin addition to that.\nI'd be happy to talk about it more offline.\nI know it's a complicated measure.\nAnother question.\nI think what Chairman Blackman has over here is a method to make sure that there's not\na open-ended cost that when he says he's going to limit the transfer of\nability and this will come into the Senate that it would spread it out and not\ngive the state government budget a huge liability in one year because some of\nthese have kept over several years they could all be redeemed in one year so\nhe's trying to protect the budget and smooth the process out it doesn't really\nchange the tax credit set out there but we've got to continue to look at this\nAnd I think we need to look at, you know, anybody that pays taxes in Georgia doesn't have\nto transfer them.\nSo we might have encouraged some companies to move to Georgia in the process as well.\nWell, you know, the process, of course, is it goes through the houseways and manage\nover to the full house to the Senate Finance Committee and then under the\nfloor and the governor so you know it's our certainly I hope to have this done\nin this session.\n",
  "updated_at": "2026-02-12T19:33:09.081719+00:00"
}