{
  "video_id": "QM64zI-6QtY",
  "url": "https://youtu.be/QM64zI-6QtY?t=547",
  "title": "Georgia House - Day 4 (2026-12-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-12-04",
  "duration_minutes": 189,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on a morning devotional and prayer led by Pastor Lee May, a former county commissioner who is now a pastor. There was no substantive legislative action detected in the transcript.\n\n## Key Actions\nNo bills were passed, referred, or introduced.\n\n## Notable Moments\n- Pastor Lee May, a former Dekalb County commissioner, delivered the morning devotional and prayer.\n- Rep. Darshan Kendrick introduced Pastor May and recognized his guests from the church.\n- Pastor May spoke about the parable of the Good Samaritan from the Book of Luke, relating it to the work of the legislature.\n- Pastor May acknowledged that it was the 117th anniversary of the founding of his fraternity, Alpha Phi Alpha.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nThe transcript notes that the Speaker asked all members to report to the floor and vote green to signify their presence before proceeding.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you we're going to stand at ease just for a minute before we get started. We have some members that are making their way here now. I want them to have time to get here because we have a good pastor this morning who's going to speak to us so we want to build it up for him, no pressure to our pastor. Pastor Lee May has a good message this morning so I think we're getting pretty close. We'll come to the floor, we'll get the show on the road. All members report to the floor to your desk. Okay we're going to have the morning row call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk will you unlock the machines? Have all members voted themselves present? Have all members voted? If so Mr. Clerk you can lock the machines. More keepers will you please close the doors and keep them closed. As is our custom we will begin our day with script reading and prayer by the chaplain. After which we will pledge allegiance to the flag of our country. Today our chaplain this afternoon will be introduced by the lady from the 95th House District Representative Darshan Kendrick. Thank you Mr. Speaker and good afternoon colleagues. Before I introduce my pastor I wanted to acknowledge his guests that we have this morning on the floor of the house. We have Pastor Chris Etheridge and John Schultz from the church and Yalprey for them because they're in charge of keeping me in line. Now it's a pleasure to introduce my friend and my pastor and last time I checked my constituent. Pastor Lee May. Just saying Lee May the second is a former elected official in Decapcom where I was born and raised. He was first elected as commissioner in 2006. He served in that role until he was appointed interim chief executive officer of Decapcom County by Georgia Governor Nathan Deel in 2013 while he's pursued many different areas of passion in business and politics. Lee knew deep down that there was a draw to full-time ministry. So in 2017 Pastor Lee answered that call with his wife Robin. Transforming faith church was launched in the heart of Decapcom County Georgia. The ministry is committed to helping people experience transformation in every area of their life. He's a joy spending time with his college sweetheart from Clark Atlanta. Robin and their three children Ryan Reagan and Riley and I will note that he is a member of one of the best fraternities, Alpha Phi Alpha fraternity and his wife is a member of one of the best sororities and my sorority of Alpha Kappa Alpha sorority incorporated. So without further ado Pastor Lee May. Good morning. It is good to see you all here this, actually this afternoon. I don't think I've been in the afternoon before but again it's such an honor and a privilege to be here with you on this afternoon as you begin to do the people's business. I definitely want to acknowledge my speaker John Burns. Thank you for your leadership and thank you for your welcoming hand. I want to thank my state representative and last I check you are my state representative as well and I thank you for your leadership as well and she's also one of the founders. One of the beginning we started our church six years ago and she was one of the first members to join our church and I'll just let you know she's a good member, an active member. A giving member, God bless America. Amen, amen, amen. And so it's good to be here as well, good to have some of our members from our church as well. I bring you greetings on behalf of our church transforming faith church. We are in Stonecrest, Georgia. Used to be the Decatur area off of I-20 and Panola Road and it's just good to be here. You know about a little over six years ago the Lord transitioned me. He gave me a promotion. He took me from politics to preaching and I thank him every day for that promotion. It's good to see so many familiar faces here today and so many friends as well and I will say this is good to see your face but I don't really miss you that much because it's good being on this side of elected office. A couple of things I just want to do. I want to make sure that I acknowledge the fact that today is a special day. As Darshan has mentioned I'm a member of Alpha Phi Alpha fraternity and incorporated and today is the day that our fraternity was founded 117 years ago. 117 years ago on the campus of Cornell University in Ithaca, New York and I've been a member of that fraternity for 28 years and it is really if you know any Alpha, it was a really any Greek organization. Just thank them for the work that they do because our platform is all about service, serving humankind. This morning I want to just pull for your hearing a message out of the book of Luke, Luke chapter 10. Luke chapter 10. As you begin to do the people's work this morning out of Luke chapter 10, starting in about verse 25, we find Jesus. Now I'm a Christian pastor, that is my faith perspective. I believe in Jesus and I understand that everyone in this room that may not be your faith perspective and we honor that this morning. But I believe out of this passage of scripture it can speak to all of us, right? And I believe it can speak to even the work that you are called to do of this morning. Luke chapter 10 verse 25, a young lawyer comes before Jesus and he asks him this question. He says, what must I do to inherit eternal life? Something must have sparked in him to make him think that what I'm seeing and experiencing right now in life is not the end all and be all. He was thinking beyond his current situation and circumstances. So he asked Jesus because he had been watching Jesus, teach and preach and perform all of these miracles. Jesus, what must I do to inherit eternal life? And Jesus kind of turned back around and if you ever read the scriptures and read how Jesus kind of interacted with people, sometimes he wouldn't be just straightforward responding to your question. He actually turned back around and asked him a question and said, well, what does the law say? This lawyer was a lawyer. I don't know how many lawyers we have in the room, but when they spoke about lawyers in the Bible, these were students of the law of Moses. The law of the Bible, the commandments as we understood it. So Jesus asked him, what does the law say? And the young lawyer says to him, well, it says to love God with all your heart, soul and mind and love your neighbor as yourself. And Jesus basically said, show you right. Good, you passed the test. And that's my own vernacular. But the lawyer, as lawyers do, typically want to be exact with your words, right? Because if you're not exact with your words, it can have some major consequences, both criminally and civilly as well, right? And so the lawyer asked him back, now, now, who is my neighbor? Like let's be clear, who is my neighbor? And Jesus begins what I believe is a special message for us this morning, declaring what we call the parable of the Good Samaritan. Jesus tells the story about this Jewish man who had come down from Jerusalem, down to Jericho. He must have lived in Jericho. And on his journey from Jerusalem to Jericho, he got hijacked. He got robbed. He was beaten. He was wounded. He was bleeding. And he was on the side of the road. And Jesus continues to tell this story that this priest saw him and looked at his situation. And the priest walked to the other side of the road. The priest of that time would be our preacher of today. So I saw a man hurting or a woman hurting and I looked at him and I said, I'm too busy for that. I went to the other side of the road. Then Jesus continues to tell the story that a Levite, a Levite would be the current day church worker. These two gentlemen that are with me today, they would be considered a form of a Levite. They worked at our church. The Levites saw this man in need and the Levite walked across the street again. Both the priests and the Levite were this Jewish man, Jewish brother. They saw their brother in need and they walked to the other side of the street. But Jesus continues with the story and say, this Samaritan. This Samaritan with no title, that didn't give that person a title, just describes who that person is. The Samaritan sees that man in need, looks at him and doesn't cross over to the other side of the street, but comes to that person in need. Jesus tells the story that he bandaged his wounds. He got him up on his feet. He tended to his tangible, practical needs in that moment. Put him on his horse and took him to an end and put him up in the end so that he could recover and heal from his wounds. This Samaritan decided to do what the priest and the Levite refused to do. I could tell the story about how the religious people of the time ignored the practical needs of this person. I could talk about that. I could talk about if you call yourself a person of faith that you really need to not just talk to talk but walk the walk. Can I get amen? I just say you believe a certain thing but actually walk out that in your life. What you say ought to be reflected in how you live. Amen? I'm turning this into a church right now. What I really want to pull out of this passage of Scripture is the fact that this Samaritan came to this person in need. The Samaritan represented not really the enemy of the Jewish people, but someone who was different then was raised differently. Believed in God but believed and served God differently than the Jewish people did. It would be during this time it would be rare for a Samaritan to engage and interact with the Jewish person. But the Samaritan, through all of the traditional norms out the window and just saw a person, body and blood and flesh, a life with children and whatever that Jewish man's story was and said I feel called to help this person in need. We're going to throw away the side. We're going to throw aside our differences and the things that separate us but we're going to figure out how we can bring together common things that we can work on together. Now I'm talking outside of the Scripture now. I think I'm talking to you right now but the difference is that you may bring to the table different people, geographical realities, figuring out ways that you can come together in unity and unison, supporting and working for the people. I know I shifted real fast on you because I was talking about the story of the good Samaritan but now I'm talking about this body and what God wants for all of us to set aside the traditional things that separate us. To set aside, I know I'm person at you right now but to set aside the political norms that you come from, to set aside even some of the district differences that you may represent and say how can we come together today to serve all the people of this great state of Georgia. To me that's what the story of this good Samaritan is. It's about this man who is different, so different from this Jewish man in need but he decided to throw away the differences and come together to work in unity. Now I realize that because I've sat in similar seats that you all have, I understand that it is almost impossible to set aside some of those differences. I've been in some of the biggest political fights that the state is seeing and I'll tell you this on this side of that reality. Those fights never serve the people. Today I'm calling on you to be bold in your convictions because I'm looking at faces here this morning that said I have come under this old dome to serve the people, to serve not a party, to serve the people, the needs of families and flesh and bone and blood and to serve the needs of people and sometimes serving the needs of people causes for you to be courageous. So I'm just praying my prayer this morning is that we be bold and by we I mean you, that we be courageous, that you stand up and say who is my neighbor? I would actually encourage you to by the end of this special session find a brother or sister that is as different from you as a knight is from Dave and sit down with them and figure out a way to tangibly put something forward that can benefit all of this state. And I believe if you do that God will smile down upon you and I believe you'll be okay politically as well. No one has ever regretted being bold and courageous. I know I have it. So I will end this by just speaking a word of prayer over all of us this morning and I want to thank you all as you all stand for your leadership. Thank you for saying yes to serving God's people and just showing up. Let's have the battle. God I am so grateful and thankful that you are God that you've given us two basic commandments God that that you say everything else rests upon this foundation to love you and to love our neighbor. Like this morning my prayer is that your people will stand forward and boldness and courage God to love you and show you how they love you by how they love their neighbor. And I thank you God that as they stand forward and walk and boldness and courage God that you would cover them protect them keep them keep their families keep their their districts God would you would you bless this state of Georgia that you've allowed for us to live in and grow up in and be born in as well to be with us during our time here would you be with each and every legislator from every district God would you open up their eyes and they can see how they can show how much they love you by how they love their brothers and sisters on this floor. God we love you we honor you and it's in the name of Jesus that I pray this prayer. And we all say amen together. Amen. Amen. Amen. Would you all recite the pledge of allegiance with me as we face the flag? Let me also say one thing my beautiful wife Robin May is watching is hey baby. New you are smart man. Thank you for that encouragement brotherly door keepers can unlock the doors. Members you may join brotherly may in the south any room to make his acquaintance and thank him for his words and being here to serve us today. Thank you. Thank you.\n\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\nDirector Tim Laramore and his group and a big thanks to the Georgia Building Authority and their staff for the hard work in getting this building with the Poinsedias and the Christmas Tree Ready for this Christmas season. Now if you were not here at 11 and you didn't see or if you were here and you didn't see what was going on, you definitely heard some beautiful voices in this building. The Atlanta Boys choir, who happens to be up in the gallery and we're going to recognize them in just a minute, I'm going to let someone else do that. They put on a beautiful, beautiful performance this morning, their voices are like angels. They were. They put on a wonderful performance for the tree lighting this morning and we have a special member who happens to be the mother of one of those young voices. So as a morning order, I want to invite Representative Draper to come down and talk to us about the boys choir and tell us about Oscar. Representative Draper. Thank you very much, Mr. Speaker and hello everyone. I don't know how many of you caught the 11 o'clock tree lighting ceremony but it was absolutely beautiful. And as the speaker mentioned, the Atlanta Boys choir dressed beautifully here in red was featured during that ceremony and I'd like to take you a couple moments just to tell you a little bit about the choir and its history. So the Atlanta Boys choir has been one of Atlanta's premier organizations for 77 years. The choir originated in 1946 as a part of the Atlanta City School System and in 1959 it was formally founded by Maestro Fletcher Wolf. Over the years, approximately 10,000 boys and young men have performed in the Atlanta Boys choir and among their alumni are Grammy, Emmy, Tony and Pulitzer recipients. The choir has served both Atlanta and the United States as a cultural ambassador throughout Europe, Russia, Canada, Mexico, appearing before presidents, popes, foreign dignitaries, crown heads of state, US soldiers and a joint session of Congress and a special session of the Georgia General Assembly. We can add that to the list. The Atlanta Boys choir has established a remarkable record of artistic achievements. In 1966, the choir marked its Carnegie Hall debut. In 1989, the choir won a Grammy award for its performance and recording of Britain's War Requiem with the Atlanta Symphony Orchestra and the choir has sung for Pope John Paul II at Vatican City on five separate occasions. In 2006, the choir returned to Italy where it performed for Pope Benedict XVI and the XVIth Chapel of St. Peter's Basilica. Under notable places where the choir has performed include the White House and the US Capitol in Washington, DC, St. Paul's Cathedral in London, Notre Dame Cathedral in Paris, the Kennedy Center in Washington, DC, the Great Hall of the Philharmonic in St. Peter'sburg, Westminster Abbey in London as well. In 2015, the choir was featured in the film Captain America Civil War Performing for Ray's Requiem. More than performance and accolades, the boys and men of the Atlanta Boy Choir continue to adhere to a lifelong appreciation of music and abiding love of beauty, a keen sense of respect for themselves and others, and they remain leaders in their families, their communities, and the world. Today the choir is under the direction of Dr. Robert Henry and Assistant Director Hal May. Each performance season, the angelic sound of the Atlanta Boys Choir and the robust voices of the alumni men's choir are accompanied by some of Georgia's finest musicians for festive Christmas and spring concerts, concerts, as well as a summer tour series. Many boys who age out of the choir join the alumni choir, adding their voices to a rich and historic vocal legacy. So colleagues, let's recognize the Atlanta Boy Choir for its many decades of artistic excellence and its enduring commitment to education and cultural enrichment both here in Georgia and throughout the world. Thank you, Dr. Henry, to all of the members of the choir and to the alumni members of the choir. You all sounded great too and you look very short too, but I tell you, I've watched the last number of years and been able to watch and listen to these young men perform and watch them grow up too and still be a part of this choir. So your voices are awesome. We encourage you to continue what you're doing. Great to have you in the house chamber this morning. So thank you again for being here. Thank you for ingracing us with your beautiful music and your beautiful voices. Thank you again to all of you. We appreciate you being here. I have it on a we're going to stand at ease for just a moment or two, but we're going to ask that Kevin Billy Mitchell allow him to make an announcement before we stand at ease. Now we're ready. Thank you, Mr. Speaker. The Democratic caucus will meet immediately during this recess in room 230 of the Capitol, which is right now. Thank you. Thank you, Mr. Chairman. This house will stand in recess and promptly come back to order at 12. Excuse me, 215, 215. 15 minute recess. Thank you. Thank you.\n\nyou you you you you you you you you you you you you you you you you Representative Cox, are you ready? Representative Cox is recognized to speak to the resolution. Thank you, Mr. Speaker. Roughly two months ago to the day, a horrific attack happened October 7th. From the southwestern border of Gaza and Israel, the Kabut's community said, oh, as well as a music festival, tragedy occurred. This resolution is to speak one against the terrorists known as Hamas. And number two, that we stand with Israel and the Jewish people. There's an enemy that comes to kill, still destroy. And in this situation, that enemy happens to be Hamas. The goal of Hamas is to eradicate the state of Israel, the Jewish people, the United States of America, and all that support these causes. There's an individual in 2006, per journalist named Yaya Senwar. In 2006, he was sentenced to four life imprisonments for terrorism, for killing Palestinian collaborators and Israeli soldiers. This individual came down with a brain tumor and remarkably, the people of Israel received surgery and lived. A miraculous healing. In 2011, he was released from prison with one Israeli soldier exchanged for a thousand. And he is the one to this day that is viewed as the leader of Hamas in Gaza. Just being in Israel, back in late August, September, with another representative this year, some of our friends were killed. A innocent lives destroyed. A three-year-old girl, close to the age of my own granddaughter, an American, Abigail Moore-Idon. She was standing there as her mother was murdered and saw it. She ran with her father, who shielded and protect her and was murdered and fell upon the little girl. Her two-older siblings went and hid. She crawled out from underneath her dead father, ran to a neighbor's home and was taken as a hostage, three years old. Where did they take her? And where did they take these hostages? Twenty to thirty countries represented that were hostages, some from the state of Israel, some Jewish, some from all over the globe. But this little girl was taken to be put under the dirt in a tunnel. Why in a tunnel and why in the dirt? Complete darkness. The goal here should be that we bring light in life, that we take an individual that has a brain tumor and find a way for that individual to have a life. But to kill still and destroy is unacceptable. It's unacceptable in all regards and I stand with Israel and I stand that Hamas is a terrorist group and needs to be eradicated and the state of Israel must do all that it needs to do to destroy Hamas so the world's a better place. Thank you. I yield for questions. Gentlemen, yields four questions. They're a question. You have no questions. I yield the well. The gentleman has yielded the well and the wisdom of the rules committee, we will limit debate on this proposition to thirty minutes for those in favor and thirty for those opposed. The part is recognized to speak. We will start to you get ready. Thank you, Mr. Speaker. Colleagues, I rise to make a point about the resolution that we're voting on. To begin, this resolution speaks on a very important issue and it's certainly one that is very well deserving of consideration by this body. However, because of the importance regarding the subject matter of this resolution, I do not think that it is appropriate for this body to take up this resolution during special session. The governor's proclamation is very clear and that we are only able to take up legislative matters that fall under four specific categories for the very clear plain language of the proclamation based on the power the state constitution has empowered our governor to do. When I asked during the rules committee, which are the four categories, this resolution fall under such that this body can vote upon it, I unfortunately did not receive an answer. So for those purposes, while I do plan on voting yes, if this resolution proceeds, I would urge members of this body to not take up this resolution at this time because again, it is my understanding based on the plain language of the governor's proclamation that it falls outside the scope. With that, Mr. Speaker, I yield the well. Thank you, went, part. I'm as yielded the well. Representative Fry is recognized to speak to the resolution. Good afternoon colleagues. You know, I've really, this is weighed heavy on my mind. It weighs heavy. It has weighed heavy on my mind since my father became a Presbyterian preacher. And the way I was raised, we talked about this all the time. We talked about the conflict. We talked about supporting Israel. And I absolutely understand the positions that each and every one of you may have on this. But I've been called to tell you something. And I want to point out that my opposition to this specific resolution has nothing to do with opposition against anybody. It has nothing to do with the opposition against my Jewish friends. It also does not say that I support a terrorist organization because I do not. And the oversimplification of this issue is a problem for me. Because it's not an either or. One thing that we are missing is the thousands and thousands of lives, innocent lives that have been lost in all fronts. Jewish and Palestinian. Now when I ran for office, I really had to make a decision. You know, I'm from South Mississippi. And I tried to find the intersection of my faith and my politics. So I didn't vote hypocritically. It's one of the things my father hammered into my head. Don't be a scribe or a pericy. So you know, I ordered this new Bible the other day. And I don't know if you've ever heard about it, but it's called the Geneva Bible. And the Geneva Bible was a Bible that was translated directly from the Greek and Hebrew that I grew up listening and watching my father learn and memorize. And you'll be surprised to note that the Geneva Bible has different messaging on certain points than our modern day Bibles, where kings and leaders didn't want you to use some turns like tyrant. So they changed them all. But one thing that is static between the Geneva Bible and today's Bible are what I call the red letter print. And within that red letter print. And Matthew, I'm not putting my glasses on, sometimes I'm more Matthew. I've gone on the script. You know me, I don't follow a speech script. I got to hear, but I can't do it. Sorry. So somewhere in Matthew, and we get the Beatitudes and it says, Blessed are the peacemakers. And I can understand how much it means to people to try to not turn the other cheek to start focusing on, oh, will they kill this many people? So we need to kill that many people. That is not right. This resolution needs to be a call for peace. A call that condemns the terror. But also a call that condemns the unilateral killing of innocent lives on both sides. And we should listen to that as Christians. I know they're like the preacher said this morning, there's a bunch of different religions in here. So I'm not trying to make anybody offended. But I'm speaking to those who you say are Christian. The quest for peace is real. The quest for peace is real. We are guided. We are called to this body to lead for peace. My ask to you is that we table this and come up with a resolution that condemns the terrorists, condemns the loss of innocent lives and calls for a ceasefire. Thank you, Mr. Speaker. I yield the well. The gentleman has yielded the well. Representative Holly has recognized to speak to the resolution. Thank you, Mr. Speaker. Sorry about that. I certainly understand that, Representative. With you, that one. You're good. Today I ask my colleagues to table this motion. But I would like to recognize Georgians who have made themselves available for us today, preceded in the House Gallery, our members of Jewish voice for peace at Lanta, the Atlantic multi-faith coalition for Palestine, voices for Muslims and Christian faith leaders rise briefly for this measure just in a silent moment of support. Thank you. I would just like to read a brief statement given to me by a Jewish voice for peace at Lanta. As members of Georgia's Jewish community, we recognize the pain and loss of life that has been endured by families across Israel and Palestine. However, we refuse to allow our government and the government of Israel to twist our grief to justify the terrorizing, painful, and dehumanizing campaign of violence against the Palestinian people. We are deeply opposed to such one-sided resolution that does not mention Palestinian life a single time. We are particularly concerned with lines 17 to 19, which describes the, and we quote, brave Israeli soldiers who were exercising their nation's right to self-defense, and we stand with Israel, unquote. What Israel and their soldiers are currently doing in Gaza and the West Bank goes far beyond self-defense. We have all watched the bloodshed on our screens, the children reaching out of underneath the rubble under their homes, the premature babies left alone, to die because of the bombings and attacks on Palestinian hospitals. Attracities, killing, and more civilian bloodshed will not bring back those who were killed and will not save those still held captive. Jewish people are not a monolith. Anyone who claims to speak for an entire group of people is not only wrong, but is attempting to manipulate you. There is a sea change happening within the Jewish community and millions of Jews across the world are no longer willing to unquestionably pledge their allegiance to Israel. We urge you to have the same courage and do the same. Instead of passing one-sided resolutions or legislation that has no bearing in our state of Georgia, we would hope that this legislative body would focus on so much supporting the actual needs of Georgians such as ensuring that all people have fair and equal representation in our state's electoral bodies. This is a message that was echoed also by the Churches of Middle East peace on November 13th. And their letter stating that we condemn the collective punishment imposed upon more than 2.2 million Palestinians living in Gaza. And on October 8th, the Israeli government cut off water, gas, and electricity, and all goods and supplies that the territory, putting even more pressure on a community suffering from a humanitarian crisis more than a decade in the making. We further condemn Israel's large-scale Arab bombardment and ground invasion that continues to have an indiscriminate and tragically disproportionate impact on civilians. We further support a demilitarization of the conflict rather than supplying additional military aid or arms to Israel at this time. For the U.S. already sends $3.8 billion per year in military assistance to Israel for which effectively the United States has not imposed consequences for its gross violations of human rights as required in the U.S. laws. Additionally, military aid will only prolong Israel's offensive, will lead to more Palestinian civilian deaths, and will not likely be subject to any accountability. Peace with justice is the only lasting solution that will protect the long-term security and sustainability for the state of Israel and self-determination and independence of Palestinians. And for the United States must demonstrate its commitment to the protection of all human life advocating for just and durable resolution to this crisis in which all Israelis and Palestinians must realize a vision of a just peace, illuminating human dignity, and advancing security and self-determination for all. This was signed by the American Baptist Churches of USA, American Friends Service Committee, the Lot Carry Form Mission Convention, the United Church of Christ, the United Methodist Church, and the National Council of Churches, Sentiments, such as these expressing similarly have been echoed by the respected pastors, Dr. Cynthia Hale, the ray of hope Christian Church, and the pastor Jamal Bryant, of New Birth Missionary Baptist Church, among 1,000 black faith leaders addressing this to President Biden. Among labor unions, the United Auto Workers of America have demanded an immediate and permanent ceasefire. Finally, I'd like to share an excerpt, a letter from the Georgia Muslims Coalition. It's an open letter to Georgia representatives and senators seeking personal support for an immediate ceasefire. Gaza. It reads, as concerned citizens who value justice and peace on a national and on a global scale, we are compelled to share our concerns with you collectively about the direction of the one-sided support in this resolution. On behalf of our diverse collective, we present the request to demand an immediate ceasefire, calling for an unconditional ceasefire from all sides to the conflict. To bring United States citizens home, make it a priority policy position for bringing all American Palestinians that are stuck in Gaza back to the United States. To end occupation for permanent peace, to prevent and reverse any temporary and permanent displacement of Palestinians in Gaza and the West Bank. The Muslim American community has worked tirelessly for decades to deepen its civic engagement with the belief that United States, a champion of democracy and human rights, will play a critical role in fostering a just and fair resolution to the complex issues facing the country, including those that have played the Middle East for decades. Saying we urge you as representatives of the Muslim American community to stand for justice and support a balanced approach that promotes peace. We are certain that the path forward cannot look like the past, as much damage has been done by our elected representatives. We remain committed to the principles of equality and justice, and hope that we can find a path forward working with you and our national leadership to foster a more balanced and constructive approach based on international law, to bring peace to the Israeli and Palestinian people. Similarly, the Georgia Muslim Coalition and partnership with Al-Hasna, a bill for Georgia, Al-Madina, of North Atlanta, Albany Community, the Unhar Institute of Atlanta, Georgia, the Athens, the Muslim hub, the Bosnian Community Center of Georgia, the Burmese, Rohingya Community of Georgia, the Council on American Islamic Relations, Georgia, East Cove Islamic Center,\n\nParkston, Gainesville Islamic Cultural Center of Gainesville, Georgia, the Georgia Muslim Voters Project, the Greenview-Modani Center of Lawrenceville, Georgia, the Gwyneth Islamic Center of Suwaning, the Hamza Islamic Center of Al-Foretta, Hindus for Human Rights, the Iqnah Council for Social Justice, the Indian American Muslim Council of Atlanta, the Islamic Center of Columbus, Georgia, the Islamic Center of Duluth, Georgia, the Islamic Center of Middle Georgia, the Islamic Center of West Georgia in Douglasville, the Islamic Society of Augusta, Jewish Voice for Peace, the Atlanta Chapter, Justice America, United States, the Green to Islamic Center, and the Green to Georgia, the Macon Community Massage and Macon, Georgia, the Medina Institute of Duluth, the March 15th Forum combating Islamophobia USA, the Masjid Abu Bakr and Broken Haven, Georgia, Masjid Al-Farouk, Atlanta, Georgia, Masjid Al-Kuba, and Pufra, Georgia, Masjid Al-Farqan of West Cobb Islamic Center, Syria, Masjid Al-Mumineum of Atlanta, Georgia, Masjid Al-Rakhman of Cumming, Georgia, Masjid Jafar of Johns Creek, Georgia, Masjid Omar bin Abdulaziz in Lilburn, Georgia, Masjid Sumaya of Peachtree Corners, Masjid Sufa of Kinesa, Muslim American Society of Atlanta, Russia, the Muslim Community Center of Peachtree Corners, Georgia, the North American Manipura Project, sorry Manipura Tribal Association, USA One Uma Project, Roswell Community Massage, Savannah Community Massage, the Surah Foundation, Somali American Community Center, Valdosta, Voices of Muslims and Muslims of USA. Together and not supporting this resolution, I'm thankful to be here as a man of Christian faith 25 years since my baptism and being wholly standing alongside them to vote no should be given the time but for now to table this measure. Thank you. General Geo the well, members will refrain. Representative Ramon, to read, rule 8.1, as we do with the caller up. Representative, you now recognize since we're having this discussion now state your position. I would like for the speaker to request the clerk to read, rule 8.1 to call. I appreciate the gentleman's sentiment but we will, I think this body is acting respectfully, so move forward with the discussion. Representative Ramon is recognized for, to speak to the resolution. Oh, how much time do I have? 10.45, 10 minutes 45 seconds. Thank you, Mr. Speaker. Colleagues, apologies, as you can hear, this is definitely not great for my voice. So if you can't hear me, please let me know. Thank you, Mr. Speaker. Colleagues, I rise before you today to explain why I will not be voting for or against this resolution. I want to be clear. My issue isn't with the Hamas condemnation. After all, I've been doing it since I was 15. And no, that's not an exaggeration because it's a moment in my life I will never forget. You see in high school I was fed up with the kids on the school bus, calling me a terrorist and pointing to my house calling it the bomb lab. So I decided I'm going to take drivers at. I was ready to become independent and start driving myself. Now little did I know my biggest hurdle would be my parents who, and I quote, trust in me, just not the other drivers, but I digress. When my drivers at teacher overheard a classmate mentioned on Palestinian, to be clear I wasn't part of that conversation, he just simply overheard it. He called me into the hallway and proceeded to interrogate me to make sure that me and my family don't have any ties to Hamas the terrorist group. I'll never forget how his questions seemed so absurd and beyond comprehension to me that I literally laughed thinking he was joking. He wasn't. For context, I was 10 the first time somebody called me a terrorist. Those experiences robbed me of my childhood and my innocence. And instead of worrying about the typical things a teen worried about, I felt like now a deep sense of responsibility to not only represent all Muslims and all Palestinians, which is beyond absurd for a child, but also fight all the stereotypes about my community. But I quickly learned that my condemnation meant nothing. It did nothing. I'm not exaggerating. I agreed to a couple interviews at the beginning of October where instead of talking about what I'm seeing in the Palestinian community, interviewers asked me if I condemned Hamas over and over and over again. I did on the record, over and over and over again. And yet there were some people that still wrote in saying they really loved my perspective, they appreciated it, but why didn't I condemn Hamas? The interviewers were flabbergasted. All these experiences recently and in the past taught me, though, is that it doesn't matter. It matter how much my community, whether Muslim or Palestinian, condemned terrorism, no one listened. He mumps from around the world signed and shared letters, mosques, and Muslim organizations would put out press release after press release every time something happened. Nobody cared. Because it didn't fit the narrative. But I'm telling you, something recently shifted in the past few weeks. And people are starting to realize that these absurd accusations and these absurd traps are simply not true. And I personally take so much solace in that. I want to be abundant and clear that my Palestinian Muslim community didn't support the policies leading to this violence. It wasn't us funding Hamas to prevent a Palestinian state or expanding settlement to the West Bank as an example. It was Prime Minister Benjamin Netanyahu, who as reported in 2019, helped facilitate those cash transfers to Hamas. And without that important context, it probably would have still voted for this resolution. You know, we don't get everything we want around here. So what's the problem? I can assure you it's not because this resolution stands with our Jewish community. That shouldn't surprise you. My Palestinian grandfather, who grew up with Jewish and Christian neighbors, taught us there is no Holy Land without the Jews, Christians, and Muslims. He's the reason I started Interfaith work at 16 and the reason I've learned to find beauty in all faiths. In fact, I'm glad that's in here. Because to be clear, anti-Semitism is on the rise. And with it, the rise of Islamophobia and anti-Palestinian racism. And the same people targeting the Jewish community were the same people that threatened my life in 2016. I want to be abundantly clear about that. When I say our faiths are intertwined and that we need to fight hate anywhere we see it together, it's not just a talking point. It's also a sincere belief that I hold. My issue with this resolution is two things. The first, this resolution conflates pro-Palestinian rallies and protests as pro-violence. This is and has been dangerous. We've seen the danger this has caused, play out with the murder of six-year-old Wadiyah and Illinois. And the shooting of three Palestinian students in Vermont, one of whom will never walk again. I've honestly been shocked at how pervasive this has been and the outright lies. To give you an example, I personally witnessed. I went to a peaceful visual to pray for all lives lost in Gaza, Israel and the West Bank, here in Atlanta, a group of about 30 pro-Israel counter-protesters showed up. They yelled at us saying they hoped we get beheaded. We deserved to be raped. And they were coming for our blood and more. We had peace marshals who bravely linked arms to keep them away from us, but at one point, they started swinging at us, hurting multiple people. It was heroin and I couldn't believe the vitriol. Now imagine my shock when I saw a blog post about that, visual, saying that we attacked and surrounded them. It was a blatant lie. We had media there. We have video, people saw it. I was there. I mean, we've got plenty of witnesses. They approached us. They yelled at us. If we're going to engage on this issue of protests, then we should be accurate about it. The second concern that I simply cannot move on and is the most important one is that, and while I appreciate that there are so many here who have a lot of personal feelings about this, I cannot stand with Israel. Not the Israeli people, but Israel and its current government. I need you to understand that it is not hatred that places me in this position. It's my life experiences. My grandparents were forcibly expelled from their homes by Israel. Three of them have now died without ever seeing their homes again. And one day I will tell you that story, but today I want to tell you about all of our constituents from all around the state, including Atlanta, Al-Faretta, John's Creek, Augusta, Dalton, Duluth, Macon, Beach Recorders, and that's just the ones that I know off the top of my head. A lot of you have said that this resolution has nothing to do with Palestinians, but it does. You see, over the past eight weeks, I have been receiving daily messages from my Palestinian community members sharing with me that they've lost 10, 20, 50 family members. In fact, I started pulling a list. Here's just four of them that gave me permission. Radha Najad has lost 68 family members. Hany Shoa has lost 31 community members, family members. Rehkis Maid has lost 12 family members. Professor Hussain Adajib at Georgia Tech has lost over 100 family members. Just four people have had over 200 family members killed in Israeli air strikes. I simply cannot support what happened to them. I keep being told that this resolution has nothing to do with that, but come on now. It absolutely does. You want me to vote yes for bombing these innocent people? And I hear it. I hear you all saying, you know, we're doing this to get rid of Hamas. But for my understanding and after talking to some folks who have served, what we are seeing is not urban warfare. This is not the way that you conduct military operations in densely populated areas. This moment in our history is already painful enough, and I will not and cannot add any more to that pain. But I will also not oppose standing with community members who are hurting at this time. And this is why I will not vote for this. I will not engage on this. I invite you all to join me because our constituents deserve better. Thank you, Mr. Speaker. I yield well. We're glad to have you in the gallery, but we will not tolerate any showing of any, making any noise in the gallery. So if you'd like to stay, you can read, conform or you can be escorted out. Your choice. That includes all of those in favor. Now we're, excuse me, with all those opposed. We now, we're from those in favor. We'll start with a representative page. This group, you'll have several of you that will be, they've asked to speak. You'll have 30 minutes, so divide your time accordingly. Shalom, y'all. I ask for your support of this resolution. While I am the only Jewish member in this house, I'm here as a human being, because this is a human issue, which affects each and every one of us. On the morning of October 7th, until 6 a.m., when in the most festive days of the Jewish calendar, there was a ceasefire in existence between Hamas and Israel. With that morning, Hamas fighters implemented plans more than two years in the making. Their instructions were to rape, torture, slaughter, and kidnap, civilians in towns, in villages inside Israel. At a music festival, celebrating peace, Israel's equivalent of music midtown, terrorists moved through the crowd, shooting and rounding up people for rape, torture, and emulation. When people hid in groups or shelters, they just threw in grenades. Another 240 people were dragged back into Gaza as hostages. Among those murdered were citizens of countries from around the world, at least 31 US citizens and 39 French citizens, and at least 34 Thai nationals. Because many workers from Asian countries come to Israel seeking opportunity. These attacks were not on what some call, quote-unquote, settlements, on land under debate since 1967. These were towns, these were farmers, and they were inside Israel's 1948 borders as legally constituted. Hamas's goal was to spark a war, to stop the Abrahamic courts, and to do so, they put their own civilians between Israeli children and those who need to rescue them. A little less than two weeks ago, Israel agreed to essentially what is a ceasefire in order to get back their children who were taken hostage. Some of whom had been branded on their bodies and held without food. In return, Israel freed criminals, convicted of crimes, including stabbing of Israelis and attempted car bombings. Hamas broke that ceasefire by continuously firing rockets into Israel, having operatives shoot and slay three Israeli civilians at a bus stop in Jerusalem, and refusing to release any more of the women it was holding against their own agreement. A ceasefire like we are hearing will not solve this crisis. Hamas believes every inch of Israel is occupied territory, and its founding charter calls for the destruction of Israel and Jews everywhere in the world, including those who live in our country, including my family. Not to mention the other 150,000 Jewish Georgians. Hamas sympathizers and pro-Hamas protesters had carried out acts of intimidation, vandalism, and assault against Jews around the world, including on our own Georgia college campuses. But this is not just about Jews or Israel. Hamas leaders have also said that Christians and any others who do not subscribe to their particular fundamentalist approach are targets and will be next. Their leaders have also repeatedly said that October 7th was merely a rehearsal and that they will commit the same atrocities again and again and again. Israel's constitution calls for peaceful coexistence with all residents of the region. Proof of that is that over 20% of its citizens are Arab who have every same right extended to every other citizen. They serve in the Knesset and on Israel's Supreme Court. Arab Muslims of citizens of Israel, especially women and members of the LGBTQ community, have more rights in Israel than any other country in the Middle East. Condemn Hamas is literally the least we can do. We should demand this of every member of the civilized world, the way we ask nations to ban together to defeat Al-Qaeda after 9-11 and ISIS. This is the easiest moral test of our time. Stand with Hamas, a U.S. designated terror organization, or with all of its victims. Some have noted that this resolution says nothing about Palestinians as a larger group. Georgians may have different views on their aspirations and the best resolution of many interlock conflicts affecting multiple countries and ethnic groups in the Middle East. That is not what this war is about. This is not a microcosm of the Israeli-Palestinian conflict. This is a blood, thirsty, genocidal regime openly promising to continue slaughtering innocent Jews as soon as it is able to do so. This resolution is a statement on a specific organization, Hamas. And not only takes children hostage but operates from civilian areas, using hospitals and schools as bases, and is responsible for the deaths of thousands of innocent Palestinian men, women, and children under its control. Aid sent by the United States has been misused, fuel and sewer pipes have been used to build rockets, and cement that should be going into homes was used to make tunnels and store weapons. If you believe as I do that Palestinians are held hostage to Hamas, then you too should support ridding the world of Hamas. I didn't draft this resolution, but I'm grateful to representative Cox who did. No one else filed anything, even those who keep telling me how sad they are about the rise of anti-Semitism. Perfection should never be the enemy of the good. Despite against terror should be non-partisan. If we can't come together as Georgians and condemn Hamas, what does that tell our citizens? If you believe a resolution is truthful but just not as comprehensive as you like, you had the chance to bring your own. There is no shortage of paper in this chamber. But do not punish those that hate Hamas by no voting or by walking. Hamas openly wants to kill every single Jew in Georgia. Your walking or no vote tells the Jewish community in Georgia that their lives don't matter. And because one of my colleagues decided to mention an organization that was here, I feel the need to respond to it. They mentioned Jewish voices for peace. You should all know that 90 to 95% of Jews are Zionist. We believe in the right of Jewish self-determination. That is Zionism. The fringe of the fringe don't believe it and actively work against it. They are essentially the West Barrow Baptist Church to Christians. And don't forget throughout history there have been those that appease the people who try to harm and to them I say Hamas will kill you too. Pastor May this morning talked about the Samaritan looking at the Jew as a person. That's what we are asking you all to do. Thank you. I want more things. To the Jews of Georgia, we hear you, we see you. I wish you a happy Hanukkah, the original Zionist holiday. And I'm Israel Khai, the people of Israel live. Thank you, Mr. Speaker, I yield. And lady has yielded the well. Representative Jenkins has recognized the speak to the resolution. Mr. Speaker, friends, today I rise in support of House Resolution 4EX. I won't restate what's already been said here. I've been moved by all the testimony so far. The graphic description contained in the very resolution should leave no one to question the true legal nature of the beast that we face here in Hamas. I want to take time to discuss some other aspects of this conflict that I feel cannot remain unsaid. First, we must acknowledge that this is a complex issue and there is no easy solution. One of my favorite sources that understands the Israel, Palestinian conflict best is Georgia's own Jimmy Carter. He's one of the world's foremost experts on the Middle East and one of the world's greatest peacemakers. I encourage each of you to study his work. I find his wisdom from Plains, Georgia easier for me to understand than some of the other experts on this issue. In this entire process, peace is something that we cannot lose sight of. Americans fight for peace, not war. I expect our allies to receive American military aid to do the same. As the horrors of this crisis have unfolded over the past few months, I've often thought how much the world needs President Carter's leadership today. The world needs a peacemaker. The President Carter is in hospice and plains and I'm here in the General Assembly. I cannot match his expertise but I'll at least try to convey the compassion that he put into his work. I reluctantly step into the well to speak about this. I assure you the last place I want to be is in the well of the General Assembly talk about world politics in the Middle East. But I come to you as a retired Army officer. I spent about 15 years in the 101st Airborne Division where I spent four years in combat in the Middle East. Operations of note was the invasion of Iraq where we removed Saddam Hussein and the bath party who had brutally ruled Iraq for over 30 years. In 2010, I served in the surge that liberated Kandahar from the Taliban and allowed displaced Afghan refugees to return their homes for the first time in years. My last and most rewarding tour saw me embedded with the Afghan Air Force where I mentored senior Afghan officers who were educated in Moscow during the Soviet occupation of that country. The commander of the Afghan Air Force had been in a cosmonaut in the Soviet space program. But during this assignment, my interpreter was an elderly gentleman who escaped Afghanistan during the same period because his family was brutally persecuted by the same Soviet government that trained the folks that we were there to work with. My entire military career has been spent on counterterrorism, not operations and nation building in the Middle East. As we condemn the attacks on October 7th, we must recognize that these attacks are part of a continuous cycle of violence dating back over 100 years. We all know this, let no one tell you differently. Those that study this conflict recognize that violence and Gaza was imminent. This is important because we all must know that putting things back as they were at the beginning of October if that were even possible is no road to peace. The governments of this region must do better to set the conditions for a real, sustainable, lasting peace. As we condemn Hamas and express our outrage for the atrocities they committed against Israel and the citizens of other countries, we cannot forget the Palestinians killed who are also victims in this conflict. We must reject any assertion that Palestinians are all Hamas. Hamas has been armed to the teeth by the enemies of the United States since elections were last held in Gaza over 16 years ago. This government, which at that time, came to power without a majority, is not legitimate. The people of Gaza suffer their deprivations most and it is not reasonable to expect the unarmed population of Gaza to have the power to eject this terrorist regime. I recall during my service in Kandahar when fighting the Taliban, the Afghan civilians had less ability to protect themselves from the Taliban in the military. The civilians, the women, the children were powerless against an armed, outfitted force that could blend into the civilian population when they wanted to. During that time, American patrols could not give a starving child food because the child knew the Taliban would kill them and probably their loved ones as well if they took it. One night a friend of mine, piloting an army, Medevak Helikop, to respond to a child who was boiled alive by the Taliban, to punish that family that they suspected collaborated with peacekeepers. As I condemn Hamas, I reject efforts to dehumanize any of the victims of this conflict. I also want to remind everyone that dehumanizing people is an instrument of war, not peace. The lives of children playing in the streets in Gaza are just as precious as those playing in the streets in Israel or swinging an entire swing on the Flint River in Georgia. All life is precious. Nothing is more heart-wrenching to a soldier who has served in combat than a child trapped on the battlefield. Very few countries in the world have more combat power than just what is spread across the various military installations in the state of Georgia. I want to remind everyone that although we are a powerful nation above all else, America is known for compassion. As we condemn Hamas, I call on Georgia to share their compassion with everyone affected by this horrible conflict. Many times these conflicts are just proxy wars against the United States for the benefit of other countries and I'm convinced that this is no different. The point here is that this war serves Iran, it serves Russia, and it serves Hamas, but not the people of Gaza, which is usually the case in situations like this. To the satisfaction of the Russian government, world news stories about innocent children slaying in the Ukraine have been replaced by stories of slaying children in Gaza. We should never fight the wars that our enemies choose for us and make no mistake we're fighting this war. We have troops in Syria\n\nIraq, warships in the Mediterranean, and they have all been engaged in conflict. And I haven't even digested it yet, but we have saw a news report of some conflict in the Red Sea against commercial shipping that our naval warships were also responding to today. It cannot be overstated how important de-escalation and a resolution that leads to a lasting peace are to the national interest of the United States. So far in this operation, we've seen over 1 million people displaced, unprecedented civilian casualty rates, and over 75% of the homes have been destroyed in northern Gaza. The war, fought in a captive civilian population, in an area with the density population density of Tokyo has taken a brutal toll on the population of Gaza. General David Petraeus, who I served under when he commanded the 101st Airborne Division in Iraq and later when he was the ISAF commander in Afghanistan, always said, you can never kill your way out of an insurgency. This must not become a war against the civilian population of Gaza. That war would never end in peace. I urge Israel to follow the direction of the U.S. State Department and ensure that military operations are conducted in a manner to reduce further displacement of the civilian population, ensure that the delivery of humanitarian aid to the civilian population of Gaza and to carefully target Hamas, the enemy of both Israel and the Palestinian people. In closing, I pray for peace in the Middle East for both the people of Israel and the Palestinian people. I pray that all hostages are returned home safe. I pray that soldiers don't die in needless wars. I pray the scars from this conflict are healed. Since I have quite literally beaten my sword into a plowshare, I vowed to never stop demanding the world to be as it should. I know that this is American idealism, but as silly as some foreigners think it is, it's our greatest gift to the world. With that, Mr. Speaker, I yield the well. The gentleman has yielded the well. Representative Al, you are recognized to speak to the resolution. Thank you, Mr. Speaker. Good afternoon. I rise today in support of the sentiments expressed in the resolution presented by the gentleman from the 28th District, denouncing the Terroristic Acts of Hamas and the atrocities committed on October 7th. My family and I continue to hold those close who are affected by the events of that horrible day, both in House District 50 and far beyond. And it's my fervent hope that all the hostages will soon be returned to their homes and their families. I also want to note that as Georgia state legislators, we represent a large and diverse constituency and that in the nature of war, suffering can metastasize. Further, those who end up suffering the most are innocent civilians who simply want to live, work, and raise their children in peace. In addition to our Jewish constituents, all of us, all of us, also have Muslim, Arab, Palestinian constituents whose families have been deeply affected by the unrest in Gaza. What's more, just as we've seen a rise in despicable anti-Semitic acts here in the United States, there's also been a concomitant rise in anti-Muslim, an anti-Palestinian violence and discrimination accompanied by the corrosive social effects of bias and hate. I appreciate the solidarity for Israeli innocence expressed in this resolution and join its sponsors in its denunciation of the terrorist group Hamas. I rise today to simply remind people that in the days and weeks and months since October 7th, there are many members of our community who have lost innocence too. Americans, elders, women, and children. Many members of our community who are fearful and suffering and feeling unseen, unheard, and ignored. But we represent them all. I recognize this as a targeted resolution. It's very focused and that broader goals might fall outside the written points of being presented today, and that's fine. I simply want to take this time to remind everyone of our job and our responsibility in this chamber to all that we serve and that empathy and compassion are not finite resources nor do they lose their power when they are applied more broadly. Recognizing our shared humanity is a strength, not a paradox. So as we move forward towards the end of our special session, let's look again to why we are here in the first place, which is to build a representative system for our diverse, growing, and international constituency in a state with a heart big enough to include us all. Thank you, Mr. Speaker. I yel the well. The lady is you to the well. Chairman Bonner is recognized to speak to the resolution. Chairman Bonner. Thank you, Mr. Speaker. I rise in support of House Resolution 4EX. It's unfortunate that we even have to debate what is such a straightforward measure. But here we are. I had a former youth pastor constantly tell us that if you don't stand for something, you'll fall for anything. Something that may be a little more recognizable in terms of a quote comes from Edmund Burke, where it says the only thing necessary for the triumph of evil is for good men to do nothing. Colleagues, it's time for us to stand with our friends and to call out evil. And what happened in October was absolutely evil. Representative Cox and myself attended a screening of footage from that day. And what we witnessed was horrific. Bodies piled on top of bodies. Babies burned. Footage of one individual trying to be head in Israeli with a garden hoe. All the while, every one of the members of Hamas conducting these atrocities, praising Allah, shouting, enjoying what they were doing, it was absolutely horrific and evil. Some call it war, some call it conflict. It's simply an act of terror. How do I know this? Because it was conducted by terrorists. And how do I know that? It was a question that was answered for us as a nation back in October of 1997 when Hamas was added to the foreign terrorist organization list. Every time you see someone out supporting Hamas and what they're doing, understand that they are doing one thing and one thing only, supporting terrorists. And these were not military targets. They went after innocents. They were not trying to secure an objective. They were trying to strike fear in the hearts of all Israelis. There's been talk about peace and restraint in this chamber and in the media. And I frankly just find it absurd that any one of us in this chamber, anyone else, would tell the nation of Israel to restrain yourselves, to not seek out and punish and eliminate those that in their charter calls for your destruction. And like Representative Panett says, the moment they have the chance, they will kill you the moment. I'll end by paraphrasing a quote that you may be familiar with, but it's definitely appropriate in this situation. And I'll paraphrase by saying that if Hamas were to lay down their weapons today, there is a chance for peace. If Israel lay down their weapons today, there would be no Israel. Thank you, Mr. Speaker. I yield the well. The gentleman has yielded the well. We have one more speaker signed up, Representative Maynard. And I'd like to speak to the resolution representative you have about three and a half minutes. Thank you, Mr. Speaker. And I'm going to put these glasses on so I can make sure that I am going to say everything I think is important to say in this very brief time. I want to start with just saying that there's never a bad time to pray. Someone said earlier that the governor did not give us permission to do this resolution. This resolution calls online 16 through 19 to pray for all. It doesn't say to pray for some. It says to pray for all. It also says to condemn terrorism and hate. It also says, let's support American hostages. It states the fact that freedom of speech has been recognized online in maybe ways that we may not want people to practice their freedom of speech. But it does say that people have been practicing freedom of speech. It also says that countries can defend themselves. It does not say that this resolution agrees with how countries defend themselves. It simply says that countries can defend themselves. We are here today because a lot of people are afraid to talk about very hard things. My daughter is a freshman in college. Her major is international relations. With her major being international relations, they cannot talk about this subject in school because it is too sensitive. My question to her was, when are you supposed to talk about international relations? Then if you can't talk about tough things like this. Let's say yes to this resolution because saying yes to this resolution opens the discussion. Your vote is a yes for freedom of speech, whether you like what someone says or not. It is a yes for supporting American hostages. It is a yes for condemning terrorism. And it is a yes for praying for the Middle East. It is great to say that there should be a ceasefire. The resolution does not address that because as another representative said, this issue is so large but it is quite targeted. Your yes is not against any group. This is a complex subject because this is actually the first biblical war recorded in the Bible starting in 1880 BC. We will not resolve this today but what we can resolve today is saying that we pray for others that we condemn terrorism and that we support all human beings. Thank you, Mr. Speaker. I yield the will. The lady has yielded the will. That concludes our comments both in favor of an oppose to the resolution. It is clear. Are you ready? Is there an objection to the previous question being ordered? Chair here is done. The previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? Chair here is done. The board of the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machines. All those opposed will vote no and the clerk will be adopted. For what purpose does the minority leader rise? Mr. Speaker, I move to the law. In order to perfect this resolution, we are expressed awareness for the Palestinians and other ethnicities that have negatively been impacted by the past 55 days of violence in this region. Mr. Leader, I think our posture is that that motion is a little late. If you have a parliament, we have already called a question. If you have a parliament inquiry, we will be glad to take that. I yield, Mr. Speaker. I yield. For what purpose does the representative say rise? Parliament inquiry. State inquiry. Is it not true that this resolution does not condemn the Palestinian people or any people of Muslim faith but only the extreme fraction of terror known as the unilaternism of the chain of events that they have created? I am sure the gentleman has studied this issue. Pay attention to it and listen to the debate. I am sure he believes in what he speaks. What purpose does the representative holly rise? Parliament inquiry. State inquiry. Mr. Speaker, is it not true that while this resolution certainly does address a mass, it is actually, it puts us as having our alignment completely with the state of Israel and that is perilous, especially for those Palestinians who we certainly bear the responsibility of impacting by our funding of Israeli military to a tune of $3.8 billion per year. I am sure the gentleman believes what he speaks. I thank each and every member has the opportunity right now to vote their conscious on this issue. Have all members voted? All members voted if so, the clerk will lock the machine. Only adoption of the resolution, the resolution of Yays are 129 that nays 2. The resolution ever received the requisite constitutional majority is therefore adopted. Thank you ladies and gentlemen for your respectful consideration of those in the well on this important issue. We will now move on to afternoon orders and we have several of those. Chairman Carson, if you will, give your attention to the gentleman in the well. Chairman John Carson, members, if you will please stand. Thank you, Mr. Speaker. I know you expected me to speak on the last bill, not this morning order, but I just wanted to come up here and say thank you for all the calls and the texts and the flowers and the people that came to my mother's memorial service and we will try to get through this, brother. Beverly Hudson Carson, that is her picture right there. She was born in 1938. She passed away at 85 years old. She was a valedictorian of Fort Valley High School. Yes, you know her that is. She reminds me of it that I didn't do as well in school. She married dad and was married to him for 49 years raised three sons. I was the youngest. She was stood right here, a sat right here at my swearing in ceremony in 2011. Speaker David Rolston was there and she pulled me aside when we were at Mary and Max after we were she said that he speaks with a stern voice. I said yes, mommy does. She lived in Warner Robbins all her life and she would actually put one of my campaign signs in her yard. I don't think Chairman Heath Clark ever found out about that but so be it. But Mr. Speaker during the one of our retreats during a caucus there was a speaker coming up another one and you said John get to your senses go see your mama and I appreciate that sir. She was ready to be with the Lord and you see this picture of her. This was taken about in May and this symbol that my family does on my mother side it's the circle in means a constant love and I just know she has a constant love. Right now in the loft of my house I have that cross and that star David hanging up. If you want to know where my love of Israel comes from it's from my lovely mom. Thank you Mr. Speaker. You'll do well. Well Mr. Chairman I don't know if anything is any more special than the mook than a mother's love and I can tell these folks as I know they know because they know you that you've been dedicated your mother through these last years and her illnesses and we just know that there's a special place for her in heaven and if you live good you'll be there with her again. I'm still working on that sir. Yes sir. Thank you colleagues thank you very much. Thank you colleagues we appreciate that. You know what I'm going to do well. Chairman Dickie is recognized for an afternoon order. Thank you Mr. Speaker. I hate to follow what's just going on with this chamber but I want a little lighter note. Each of you have an invitation on your desk from Commissioner Tyler Harper a conversation on cannabis. Since his election 11 months ago Commissioner Harper and others me and my colleagues in the Senate have really been engaging on cannabis and hemp and I know many of you have a lot of questions on that it gets very controversial when we vote on some things but commissioners is charged with making our food supply safe in this state for consumers and he's very concerned as well as I am about the products being sold throughout our state on convenient stores as well as drug stores pharmacies and that's what this is about. This is not an ag discussion we will have is about a consumer bill and we're trying to make these consumable load to the HC CBD materials that you're finding for sale. We're trying to tighten up the regulations and know what is in these products and we will have some bills coming before you this year so I invite you this is a members only discussion and lunch on December 18th so I hope you'll take the time to come back to Atlanta and engage in this if you do have concerns or questions about these products. So that's what this meeting is about and again we will have some bills hopefully coming before you and this will just be a deep dive in explanation into what we're trying to do. On your day I hope you can come thank you Mr. Speaker. Thank you Mr. Chairman and Board of the announcement. Mr. Daryl-Rice and Representative Daryl Jackson are recognized for an afternoon order. There's Representative Jackson I was looking for you. Good to see you. Recognize for an afternoon order gentlemen. Thank you Mr. Speaker. As many of you know I got the honor of serving behind a gentleman who served in his body for 48 years. One thing he said to me he said Teddy you're going to have some tough days. It's going to be some days where you and your colleague are going to be against each other. He said but once that vote is done we go back to being a family because we hear for the state of Georgia. So now I'm going to change the tone a little bit and had to prefer it with something because I don't want you all mad at me. But 117 years ago on this day it was a cold winter day in the northern part of the state of New York. 7th grade man that was 7th. 7th grade man came together on the campus of Cornell University in Ithaca, New York and found it what would be the first and the greatest African American male attorney for turn. Minion war turn. To walk this earth. So I have my great brother with me here today. Brother Jackson who is also going to say a few words but to all my brothers out there of alphaphy, alphaphy, fraternity incorporated. May this day be a blessing as we continue the great work that we are doing. Not only here in the state of Georgia but across this nation and this world to be of influence for those who needed the most because when we look back on that day and those 7 men and you look at what they were up against and the challenges that we had as a society as a country in 1906 it truly was a great thing. We'll let you in and you come join okay. So Mr. Speaker when you think about being first that means everyone else are following you. You create those footprints for everyone else to follow. Alphaphy, fraternity incorporated has been not only engaged in shaping our society but they have been leading from the front. There have been members in NAACP. There have been members to help shape hallmark legislation like the Civil Rights Act and the Civil Rights Act affirmative action. Some of you know by name like Thurgood Marshall, Dr. King, Davis Scott, Senator Warnaug, Teddy Reese and Derrick Jackson but there are over 250,000 black men that wear this color in the United States. There are 3,000 right here Mr. Speaker in the state of Georgia and so we want you all to know on this cold day on December 4th we will bring the ice and we will fight you on the ice. So bring your skates because we are first of many. Thank you Mr. Speaker we yield a well. That's strong gentlemen. That's strong. Thank you for giving us the details. Representative Nullowicz has recognized for and after in order. Thank you Mr. Speaker. This is an announcement specifically for all of the women in the chamber. There is a reception this evening for every woman legislator. It is going to be hosted by Georgia Public Broadcasting and Georgia Link. It's at 5 p.m. at GPB headquarters. You all should have received an invitation and because I am peripherally involved with this I will tell you there will be arts and crafts and if you would like a hint ladies of what these arts and crafts might be I will read some words from a woman who is far wiser than I am. There were pages turned with the bridges burned. Everything you lose is a step you take. So make the friendship bracelets. Take the moment and taste it. You've got no reason to be afraid. Thank you. Did you do that? Is that your words? No. You're a poet. Oh excuse me I'm sorry. I thought you could have done it though. Thank you. Representative Reeves is recognized along with Representative Craig. Thank you Mr. Speaker. I'm here to recognize the Mercer 2023 football team and would invite all the Mercer alumni and friends and representatives who love the Mercer Bears to join me down here at the well. Mercer Bears at the well. All right. 2023 the Mercer football team went further and higher than any Mercer football team has ever been in Mercer's history from 1833 to now. They've been on ESPN twice over the last two Saturdays. This last Friday they took five buses from making Georgia to Columbus and got on a plane and flew to South Dakota to play the reigning national champion the Jack Rabbits out there in South Dakota. It was it was cold in South Dakota and unfortunately the Bears did not prevail over the Jack Rabbits but former representative Jim Coles athletic director, President Underwood brought football to Mercer. Dr. Matt Astin, the team doctor, coach chronic and the football team. Y'all can hold your heads high. We're proud of you. Look at this. The people's house here in Georgia loves Mercer football and players go make A's on the finals and know you've laid the foundation for future championships by Mercer football and for other student athletes. Go Bears. Well, we hope they came back all the one piece of South Dakota boys are tough. I tell you what, they've been really good for a number of years. What did he glaze is recognized for an afternoon ordering. She has friends. I do. Well, we're going to follow in tune with what has just been said with Georgia football. We can't really say gold dogs but we can say today that we have done our best and the dog showed up and we will never stop barking. So in the little dogs that are coming in House District 67, Creexide High School is 13 and 1 and in their region they are without any losses and they are on their way to the dome and I want to say to Jefferson our opponent on Friday night. We appreciate you. We thank you for a hard part game but we came out and we're going to represent and we're going that way whether we end up being dogs or going over to Mercer. I want to say that my colleague here represented Creexide Mandisha Thomas for three years before I got here and I would love for her to say congratulations in her own way to Creexide Seminoles. Well, I would thank you, Representative Glaze. I would be remiss if I didn't also say that they Creexide is actually our young farmer program and I want to thank this body for supporting South Fulton Schools from the political farmer. Go Creexide! Awesome. Good luck. Good luck to some great teams. This is the championship weekend and yeah, it is. That concludes our afternoon orders for what purposes represent a percolise. I'll make a motion. Get your motion. I move. We suspend the rules of this House to have a bill read for the first time in the Senate Committee. Clerk will read the caption. Senate Bill 5.\n\nSenate Bill 5-EX by Senator Summers of 13th, be taut on act to amend and act creating a state court of Turner County through April 18, 2002. Mr. Clerk, could we clarify their representative? Is this a local bill that has been passed by the Senate? It's just come over. Yes, it is. It's local bill only impacts Turner County. Only affects Turner County, a local bill. All the gentlemen's motion that the rules of House B. T. Pro is suspended so a bill can be read for the first time in the Senate Committee is the objection. There is objection. Does the gentleman move? The gentleman moves. All those in favor. We all have the motion to suspend the rules that have this bill read for the first time in the Senate Committee. We all vote green. All those opposed will vote red. Vote no. Vote yes or vote red. Mr. Clerk, unlock the machines. The gentleman moves. The gentleman moves. The gentleman moves. Have all members voted. All members voted if so. Clerk will. Lock the machine. All on the gentleman's motion to suspend the rules. The motion has failed. We will not suspend the rules. It takes 120 votes for your resolution to be considered to suspend the rules. Moving on to announcements. Chairman Corbyn has recognized for an announcement. If you don't mind, let me move step down for just a moment. Let me move on with something I forgot. You have some privilege resolutions. Mr. Clerk, are you ready? The clerk will read the caption to a group of privileged resolutions. Celebrating the birth of Mitchell, Adam K. III, commending and graduating Julian Ferrer, commending the children in foster care, commending Grenade, Oranco, commending under 21 the band, commending Alvin Dollar. And for other purposes, actively serene the privilege resolutions. Thank you, Mr. Clerk. Is there any objection to adopting the privileged resolutions? Chair here's done and the resolutions are adopted. Now, Chairman Corbyn, we're ready for your announcement. Thank you, Mr. Speaker. The Motor Vehicles Committee will meet in room 606, L.O.B. upon adjournment. Thank you. Representative Holland, you recognize for an announcement. Thank you, Mr. Speaker. Tomorrow morning, we will be welcoming Liberty Schools to hold a drop-in breakfast to talk about the power of classical public education. If you don't know what public classical education is, but you would just like a good cup of coffee or a chicken biscuit, you can swing by room 216 in the capital tomorrow morning between 8 and 10 and get breakfast. Thank you, Mr. Speaker, forgive me, but as long as I'm in the well, I would be remiss if I did not wish my husband of 20 years a happy birthday today. Normally, a December birthday means you fall between election season and legislative session, and we get to spend that birthday together, not today. So, honey, if you're watching, thank you for handling carpool. I'll be home in time. I promise for dinner. Thank you. Thank you, Mr. Speaker. Thank you, Mr. Speaker. I'm very smart woman and a very smart man to marry a lady like you. German camp, recognize for an announcement. Thank you, Mr. Speaker and colleagues. On your desk, there is an invitation for the Georgia Mobile Home Association to go see some hybrid homes tomorrow. There's going to be a bus over on Mitchell Street. There's going to take us there. There's food. If you haven't seen a mobile home in a number of years, you're going to get blown away with what's available now, which could be a very prominent answer to our workforce housing issues. So, please come and check it out tomorrow. Mitchell Street. They're going to leave around noon or just past a journey. Thank you. Cheer lady camp. If they need any more information, can they speak to you on this issue on this opportunity? Yes, Mr. Speaker. They certainly can or represent a representative's sense of fries also involved in this. So, please reach out to either of us. Thank you. Thank you. Representative Gamble is recognized for an announcement. Thank you, Mr. Speaker. Tomorrow morning at seven o'clock in the House Judiciary Committee room, the fellowship will meet. So, for those of you all who come and those of you haven't been before, we invite you to come at seven o'clock in the morning for the fellowship. Thank you. Chairman, Richard Smith is recognized for an announcement. You might want to hear this one. Okay, rules will meet tomorrow morning at nine o'clock. Nine o'clock tomorrow morning room, 341. Thank you. Thank you, Mr. Chairman. 9 a.m. rules 341. 341 representing Brad Thomas. You're up. Thank you, Mr. Speaker. The House Technology and Infrastructure Innovation Subcommittee on Artificial Intelligence will be holding a joint meeting with the Senate Public Safety Science and Technology Committee upon adjournment. I would be at room 450. C.A.P. Thank you. Thank you, sir. Chairman Hawkins is recognized for an announcement. Thank you, Mr. Speaker. The Committee on Health will be meeting upon adjournment 403. We've had some presenters. There have been here since 1130 today. So, I appreciate your attendance. We will move it as rapidly as possible. Thank you. Chair, we have a meeting with the Senate. We're part. You're recognized for an announcement. Thank you, Mr. Speaker. The Georgia House Democratic Caucus Whip Team will be meeting at room 515. Ceil to be 515 immediately upon adjournment. All members of the Georgia House Democratic Caucus are invited to attend. Thank you, Mr. Speaker. Thank you, Witt Park. Chairman Williamson has recognized for an announcement. Thank you, Mr. Speaker. There will be a majority caucus breakfast available tomorrow morning, room 403 at 7.45 a.m. It's not an official caucus meeting, but breakfast will be available in room 403 at 7.45 a.m. to tomorrow morning. 7.45 403. Chairman Mitchell, you have an announcement? Yes, sir. Let's hear it. Thank you, Mr. Speaker. The Democratic Caucus will meet tomorrow morning at 9 a.m. in 2.30 in the capital. Breakfast will be served starting at 8.30 a.m. tomorrow morning 9 a.m. Thank you, Mr. Speaker. That concludes our announcements. Mr. Leader, you are recognized for a motion. Thank you, Mr. Speaker. I move that this House stand adjourned until 10 a.m. on Tuesday, December 5, 2023. 10 a.m. December 5, 2023. On the motion of the majority leader, this House stand adjourned until 10 a.m. Tuesday, December 5, 2023. All those in favor will say aye. Opposed? No. I was clearly ahead with this House as adjourned.",
  "updated_at": "2026-02-13T22:13:13.172097+00:00"
}