{
  "video_id": "qMuA7Gm5Nu4",
  "url": "https://www.youtube.com/watch?v=qMuA7Gm5Nu4",
  "title": "Georgia House 2026 - Day 16 AM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a summary of the Georgia House 2026 - Day 16 AM Session:\n\n**Overview:** This session focused on a prayer and scripture reading by a guest chaplain, Leighton Culie, who is a local farmer and pastor. The session did not appear to involve any substantive legislative action.\n\n**Notable Moments:**\n- Leighton Culie, a farmer and pastor from Crawford County, was introduced by Rep. Robert Dickey to provide the morning devotional. Culie spoke about his background in agriculture and faith.\n- Culie shared a message from the Book of Habakkuk, emphasizing the importance of spiritual watchfulness and leadership.\n\n**Attendance:** The session began with a roll call, and all members were recorded as present.\n\n**Adjournment:** The transcript does not indicate when the session was adjourned. The next session date is not provided.",
  "transcript": "Good morning\nall members. All members, if you'll make\nyour way to the floor. All members,\nplease come to the floor. Mr. Clerk, how\nabout ring the bell?\nAll members,\nall members, please come to the floor.\nAll members,\nwe're going to have the morning roll\ncall.\nAll members present will please vote\ngreen to signify their presence in the\nchamber. Mr. Clerk,\nwe'll unlock the machine, please.\nAll members\nAll members present.\nAll members voted. If so, Mr. Clerk,\nwill you lock the machines?\nDoorke keepers, please close the doors\nand keep them closed. As is our custom,\nwe will begin our day with scripture\nreading and prayer by our chaplain.\nAfter which we will pledge allegiance to\nthe flag of our country. Our chaplain\nthis morning we will be introduced by\nthe gentleman from the 134th house\ndistrict. We know him better as the\nchairman of a and consumer affairs,\nchairman Robert Dicki. Chairman Dicki.\n>> Well, thank you, Mr. speaker. Thank you\ncolleagues and uh happy Farm Bureau Day\nand Georgia Forester day. So you get a\nlot of agriculture today and that's what\nour uh morning devotion is going to be\nbrought to you by a great friend of mine\nfrom Crawford County uh Leighton Culie.\nUm it is very fitting for Leighton and\nhis wife Brenda uh here today. Leighton\nwas born in Crawford County and raised\nin Crawford County, my home county,\nright down the road. As a fourth\ngeneration farmer, he knew from an early\nage that he wanted to be in agriculture.\nBut he left home, went off to Valdasta\nState University where he played on a\ncouple of championship football teams as\ncenter. uh came back to his farm with\nhis parents Leighton I mean Larry and\nTerry Culie raising chickens, cattle,\nhay along with three fine sons, Lawson,\nLane and Ledger. So um Leighton uh\nbackground in agriculture goes way back.\nHe served for many years on a Crawford\nCounty Farm Bureau board as president\nand now represents the fifth district on\nthe Farm Bureau state state board and is\nvery active in that and all his and his\ncolleagues are uh down at the depot and\nwe will be up here shortly uh in the\nhalls of the Capitol. So, thank you\nLeighton for your involvement that he's\nalso very involved in EMC Flint EMC\nElectric Board. He followed me when I\nwas elected here and uh when my power\ngoes out that's who I call Leighton. So\num but Leighton felt God's call soon\nafter he came home from college began uh\nthe youth pastor at Roberto Evangelistic\nChurch. He served in this position until\nthe church called him to be lead pastor\nin 2023.\nI want to tell you one other interesting\nfact about Leighton. He's a movie star.\nUh he and his wife Brenda were featured\nin a documentary called Farmland and you\ncan find that on YouTube. It's a great\nmovie that they filmed of six young\nfarmers discussing their family uh farm,\ntheir legacies and uh all it takes to be\nuh farmers and uh it's a wonderful\ndocumentary uh for agriculture. So uh\nwith that the multi- uh multi-talented\nuh and multi uh just loves agriculture\nand loves the Lord Leighton Culie. Thank\nyou.\n>> Yes, sir.\n>> Thank y'all very much. Mr. Robert, what\nan introduction. I'm gonna have to get\nyou to start doing more of those for me.\nThe uh y'all, what a blessing to be here\ntoday. Mr. Robert, thank you so much\njust for asking me to be here. Um known\nhim a long time, my whole life. growing\nup there in Crawford County. But u man,\njust what an honor to be here to get\nyour day started or help you get your\nday started if you will. And I just want\nto thank each of you for allowing me to\nbe here this morning. Um see a lot of\nfamiliar faces in the crowd and I just\nsee friends and I just thank you uh for\nwhat it is that you do. But I just want\nto take a few moments this morning just\nas we get your day started just to share\na little bit. Um I want to start share a\nlittle bit about me. Mr. Robert kind of\ngave the the uh the 30,000 foot view.\nBut I was raised in the small town of\nRoberta by two parents who loved my\nsisters and I who love the Lord and who\ndeeply love one another. Uh growing up\nin Roberta, I grew up on a chicken,\ncattle, and hay farm where hard work and\nsweat was and still are a daily\noccurrence for us. As a kid, I fell in\nlove with farming and the rural way of\nlife. In high school, I fell in love\nwith government and the process in which\nour American society operates. In\ncollege, I fell in love with my wife,\nBrenda. And as a young adult, I fell in\nlove with my savior, the Lord Jesus\nChrist. Today, at 42 years old, I just\nthink about how each of these things\nhave really just led to to who I am and\nand where I am today. And I I praise God\nthat that I've still not been able to\nget over either of these infatuations in\nmy life. And I'm just thankful for it.\nY'all, like many of you, I have the\nblessing of serving in several different\ncapacities. As Mr. Robert said, I get to\nserve on different boards, but kind of\nalong my my journey, I I really used to\njust ask the Lord, I'd say, just just\nnarrow down my scope. I really just want\nto be really good at one thing. I just\nlike to be good at one thing and wear\none hat. And I just have realized, I\nguess I've I've I've discerned that his\nit's just not his will. But I've\ndetermined that uh that in each one of\nthese situations, wearing whatever hat\nit may be, I just want to be as good as\nI possibly can in that moment and in\nthat presence. And that's just kind of\nhow I I try to walk that out. Brendon, I\nhave the blessing of raising our three\nboys on our family farm in Roberta. We\nfarm for a living with mom and dad. And\num I serve farmers, as Mr. Robert said,\nthrough Georgia Farm Bureau Federation.\nAnd I'm absolutely blessed to serve as\npastor of Robera Evangelical Church.\nJust a small church there in Roberto. We\ngot some folks that love and I love them\nback. They love the Lord. I'm thankful\nfor them. But y'all, this morning I just\nkind of want to share a word with you\nfrom the book of Habacook. I don't know\nhow familiar that book is or or how\ncommon you guys may hear something from\nit, but just want to share a little bit\nout of that. The prophet here is\nrecorded as laying out this strong\ncomplaint to God just about how\ndifficult, how unfair, and how unjust\nthings are just in the world around him,\nin his immediate surroundings. He's\nlooking around at how far uh things have\njust gotten out of hand. And as he he\nconcludes this expression of disdain, he\nfollows it with this statement that's\nfound in chapter 2 verse one where he\nsays, \"I will stand at my guard post and\nstation myself on the watchtowwer and\nI'll keep watch to see what he will say\nto me.\" Here's what the prophet was\nsaying right there. He says, \"Lord, I'm\nlooking around. I'm looking around at\neverything around me and I don't I don't\nreally understand what's going on when I\nlook outside of my windows or my walls.\nI really don't even agree with what it\nis maybe that you're allowing to take\nplace maybe amongst the people. However,\nhe says in the midst of this, I know\nwhat it is that I'm supposed to do. I\nknow what it is that I'm supposed to do.\nSee, the prophet was declaring here that\nhe had a guard post. He said, \"I have a\nguard post. I am to be stationed on the\nwatchtowwer looking out standing guard\nfor the people. You see as a prophet it\nwas his responsibility to spiritually\nstand guard and be the watchman for the\npeople. He was to hear from the Lord and\nto look out for impending danger. In the\nbook of Ezekiel, it says that if the\nwatchmen sounded the alarm but the\npeople didn't respond, then the blood\nwas on their hands. However, if the\nwatchman were to see the threat but\nfailed to sound an alarm, then the blood\nwould be on the hand of the watchman.\nWhat I'm trying to say is as a prophet,\nwhat he did, it mattered. It really,\nreally mattered. And I think about me\nand and a lot of you as a father, as a\nparent, it's my responsibility to stand\nguard for my family. Um, regardless of\nwhat's going on around me, regardless of\nwhere society or uh public opinion heads\nto, I stand accountable to God to\ndeclare that as for me, in my house,\nwe're going to serve the Lord. And see,\nin my home, what I do really matters. It\nmatters, y'all. As legislators of this\ngreat state, a place that I am so\nincredibly thankful to have been born\nand raised in, a place that I'm so\nthankful to be raising my family in.\nY'all, as legislators, as leaders, as\ninfluencers,\nyou stand guard in so many ways for men,\nwomen, and children around our state.\nYou stand guard, y'all. This this sacred\nchamber right here that as I walk in, I\njust kind of sense that it's a special\nplace. This sacred chamber is your\nwatchtowwer.\nWhat you do matters. I mean, what you\nmatter, what you do matters on a daily\nbasis. For those of us who are who are\noutside of these walls, it matters so\nmuch more than any of us could fully\nunderstand. And I just want to thank you\nfrom the bottom of my heart for what you\ndo for me and my family and other people\njust like me around the state. What you\ndo for my industry and I promise you I\npromise you that it it matters. It\nreally matters. I want to close with a\nbenediction and prayer found in the book\nof Numbers. And I want you to kind of\nhear these words as I as I share them.\nand and maybe asked the question, Lord,\nis all well with my soul? And I want you\nto think about it in a way that of\ncourse of course we want his blessings\nand favor. That's what the benediction\nis. Of course, we want his blessings and\nfavor. But the real question is, do we\nseek his heart and his guidance? Do we\nreally seek his will for our lives and\nfor those around us? When we look at\nHabac and what he was going through as a\nprophet, when you start reading in that\nbook, the first chapter, you realize\nthat Habac really wants God to change\nthe world around him. He really wants\nGod to change the world around him. And\nthat's a noble venture. That's a noble\ndesire. But what he realized through\nthis is that God really wanted to do a\nwork inside of him. That he really just\nwanted to change him for the better and\nhim for the good. I was thinking about\nwe we we've heard it said or we say it\noften that you guys can't legislate\nmorality, right? You guys make laws, but\nyou can't legislate morality. But if\nthere's one thing I was thinking about\nthis morning that as you legislate,\nyou can do so through accountability to\nthe Lord, through the strength of Jesus\nChrist, you can do so morally and\nethically. And I thank you for that. I\nwant to share these words over you this\nmorning found in Numbers chapter 6.\nsays, \"May the Lord bless you and\nprotect you.\nMay the Lord smile on you and be\ngracious to you. May the Lord show you\nhis favor and give you his peace.\"\nThat's my prayer for you today. It's my\nprayer this morning. Let me ask you if\nyou will to stand. We'll open in prayer.\nFather, in Jesus name, we thank you so\nmuch, Lord, for who you are. Father,\nyou're good. You're merciful. You're\nfaithful. And we thank you for that,\nLord. We thank you for a hand of\nprotection. Lord, we thank you for a\nhand of mercy. Lord, most of all, God,\nwe thank you for your grace of\nsalvation. Lord, we thank you for your\nson, Jesus Christ. And Lord, this\nmorning, I thank you for these men and\nwomen, Lord, who stand at their\nwatchtowwer. And Lord, they stand guard\nfor so many people. Lord, I thank you\nfor that. I thank you for their\nwillingness to serve. And Father, this\nmorning, Lord, we just pray over this\nday, God. We pray for a good day. God,\nwe pray for a productive day. But Lord,\nwe pray for a day that our sights are\nset on you. God, we love you. We thank\nyou and we praise you. It is in your\nname we pray. Amen.\n>> I pledge allegiance to the flag of the\nUnited States of America and to the\nstands one\nindivisibley\nfor all.\nDoorkeepers, you may open the doors.\nBrother Leighton, thank you for that\nmessage.\n>> Awesome. Members, you may join Brother\nLeighton and his family out in the South\nAnnie room and thank him for his service\nto us today and get a photo.\nChair recognizes Chairman Hilton, the\nchair of the committee on information\naudits. Chairman Hilton.\n>> Thank you, Mr. Speaker. Your committee\non information audits read the journal\nsix, seven times and we found it to be\ncorrect. Thank you.\n>> Was hard for you to go to sleep last\nnight, wasn't it? Six or seven times.\nChairman Hilton, the chair of the\ncommittee on information and audits,\nreports that the journal of the previous\nlegislative day has been read and found\nto be correct. Is there any objection to\ndispense with the reading of the\njournal? Hearing none, the reading of\nthe journal is dispensed with. Is any\nobjection to the confirmation of the\njournal? Hearing none, the journalist\nconfirmed. Mr. Clerk, will you read the\nresolution establishing the order of\nbusiness of the day?\n>> Representative Stration of the 104th\nmoves filing the establishes the order\nof business during the first part of the\nperiod. Unanimous consents. Introduction\nof bills and resolutions. First reading\nin reference of House bills and\nresolutions. Second reading of bills and\nresolutions. Reports of standing\ncommittees. First reading in reference\nof Senate bills and resolutions.\nMorning orders.\n>> Is there any objection to the adoption\nof the res resolution establishing the\norder of business for the day? Hearing\nnone, the resolution is adopted.\nThank you members. First reading of\nbills and resolutions. Mr. Clerk will\nread\n>> House Bill 1245 by Representative\nCameron of the first and Tarburn of the\nsecond. A bill be entitled act amendment\nand act provided for the election of the\nmembers of the board of education of\nWalker County.\nIntraggovernmental coordination.\n>> House Bill 1246 by Representative\nAnderson of the 10th. The bill be titled\nact to provide a new charter for the\ncity of Clayton.\n>> Intragovernmental coordination.\n>> House Bill 1247 by Representative Reeves\nthe 99th, Paulo 33rd, Tarburn and\nsecond, Horner the third, Donatui the\n105th and others. Bill be titled act to\namend chapter one of title 15 of the\nofficial code of George annotated\nrelaying the general provision so to\nprohibit courts and administrative\nofficers\n>> governmental affairs\n>> house bill 1248 by representative\nJackson the 68th bill of the 75th\nMitchell the 88th clark of the 108th\npark of the 107th bill be titled act to\namend title 16 in the official code of\nGeorgia annotated relating to crimes and\noffenses\n>> judiciary nonivil\n>> house bill 1249 by representative Santos\nof the 117th bill be titled act to amend\narticle 19A of chapter 2 title 20 of the\nofficial code of George anter relating\nto American history recognition\n>> education\n>> house bill 1250 by representative Hilton\nto the 48th Hawkins the 27th Taylor the\n173rd Dempsey the 13th Petri the 166th\nand others bill be titled act to amend\narticle one of chapter 2a title 31 of\nthe official code of Georgia annotated\nrelating the general provisions\nconcerning the Department of Public\nHealth,\n>> Public and Community Health,\n>> House Bill 1251 by Representative Davis\nof the 87, Scott of the 76, Scoffield of\n63rd, Ali of the 106, and Taylor of the\n92nd. Bill be titled an act to amend\nchapter 3 of title 44, the official code\nof Georgia annotator relating to\nregulation specialized land\ntransactions,\n>> governmental affairs,\n>> House Bill 1252 by Representative Alier\nthe 59th, Oliver the 84th, Fry the\n122nd, Hagen in the 156th, McCollum in\nthe 30th, and others. There'll be title\nact to amend article 2, chapter 5 of\ntitle 44 of the official code of Georgia\nant relating to conveyances.\n>> Judiciary,\n>> House Bill 1253 by Representative\nCarpenter the 4th, Jones the 47th, Dicki\nthe 134th, Williams of the 148th, Hilton\nof the 48th, and others. It'll be titled\nact to amend article 31B of chapter 2 of\ntitle 20 of the official go to Georgia\nannotated relating to charter school\ncapital finance\n>> education\n>> house bill 1254 by representative Reeves\nin the 99th hatchet of the 155th way to\nthe 9th prince of the 132nd seball the\n34th and others bill be titled act to\namend various titles the official code\nof Georgia annotated so the move the\nregulation of various professions from\nindividual boards\nRegulated industries\n>> house bill 1255 by representative Smith\nof the 18th hong of the 103rd lever to\nthe 123rd and pandich of the 51st. It'll\nbe titled act amend title 17 in article\ntwo of chapter 13 to title 24 of the\nofficial code of Georgia annotated\nrelating to criminal procedure and\nsubpoenas\n>> judiciary non- civil\n>> house bill 1256 by representative Barry\nthe 56th herring in the 145th McQueen\nthe 61st park of the 107th Bernal the\n77th and others bill be titled an act to\namend part three of article 7 of chapter\n3 of title 20 of the official code of\nGeorgia annotated relating the Georgia\nstudent finance authority\nHigher Education\n>> House Bill 1257 by Representative Rice\nof the 139th, Hilton of the 48th. Donna\nTucci the 105th and Ballard of the\n147th. It will be titled act to amend\nchapter 2 title 20 of the official code\nof George annotated relating elementary\nand secondary education.\n>> Education\n>> House Bill 1258 by Representative Reese\nthe 140th, Uli the 141st, Rice the\n139th, Buckner the 137th, and Smith the\n138th. Bill be titled an act to amend an\nact establishing the state court of\nMuscogee County\n>> intragovernmental coordination.\n>> House bill 1259 by representative\nDubnick of the 29th Irwin of the 32nd\nhatchet of the 155th and Jones of the\n25th. Bill be titled act amend part four\nof article 6 chapter 2 title 20 of the\nofficial code of George Antator relating\nto finance relative to the quality basic\neducation act. Education\n>> House Bill 1260 by Representative Hagen\nin the 156th Betta the 176th Chastain of\nthe 7th Campbell the 171st Ostein in the\n169th and others bill be titled an act\nto amend title 36 of the official code\nof Georgia annotated relating to local\ngovernment\n>> governmental affairs\n>> house bill 1261 by representative Hudson\nof the 72nd Dicki the 134th Williamson\nof the 12th fry the 122nd canon the\n172nd and others they'll be titled neck\nto amend In part one of article 2,\nchapter 5 of title 48 of the official\ncode of Georgia annotated relating to\ntax exemptions,\n>> ways and means.\n>> Senate bill 146 by Senator Williams the\n25th, Hatchet of the 50th, Robertson the\n29th, Alers the 56, Malow II, and\nothers. It'll be titled an act to amend\ntitles 31, 36, and 44 of the official\ncode of George annotated relating to\nhealth, local government, and property.\nIrregulated industries\n>> Senate Bill 150 by Senator Hickman of\nthe 4th and Noart of the 31st. Guest,\nKennedy the 18th, pay of the 54th and\nothers. It'll be titled act to amend\narticle 7 chapter 3 title 47 of the\nofficial code of Georgia annotated\nrelating to retirement allowances.\n>> Retirement Senate Bill 41 by Senator\nStill of the 48th. Watson in the first,\nKpatrick. The 32nd. It'll be titled act\nto amend title 43. The official go to\nGeorge Antator relating to professions\nand businesses.\n>> Help.\n>> That completes first readers.\nSecond reading of bills and resolutions.\nMr. Clerk will read\n>> House Bill 12:30 by Representative Jones\nof the 25th, Thomas of the 21st, Crow of\nthe 118th, Hitchens of the 161st, Thson\nof the 12th, a bill relating to general\nprovisions regarding aviation. House\nBill 1231 by Representative Corbett of\nthe 174th, M17th, Parsons of the 44th,\nGreen of the 154th, Wilkinson of the\n38th, a bill relating to conditions of\nemployment. House Bill 1232 by reps of\nChocus of the 151st, Irwin of the 32nd,\nDubic of the 29, Ballard of the 147th,\nHilton of the 48th, and others. A bill\nrelating to compulsory attendance.\nHouse Bill 1233 by Representative\nCarpenter of the 4th, Qu of the 118th,\nClifton of the 131st, Fry of the 122nd,\nWashurn of the 144th, a bill relating to\ndevelopment impact fees. House Bill 1234\nby Repzer Taylor of the 173rd, McDonald\nof the 26th, Matis of the 133rd, Santos\nof the 117th, Stinson of the 150th, a\nbill relating to state employees\nassurance department. House Bill 1235 by\nRem Hilton of the 48th, Montan of the\n17th, Brie of the 99th, Gullet of the\n19th, Herring of the 145th, and others.\nA bill relating to government\ntransparency and campaign finance.\nHouse Bill 1236 by Kelly of the 16th,\nNewton of the 127th, Hatchet of the\n155th, Matthew of the 82nd, Douglas of\nthe 78th, and others. A bill relating to\nrequirements for certification\nutilization of nationally recognized\naccreditation standards and website\nidentifying nationally recognized\naccreditation entities. House bill 1237\nby represent Bell of the 75th, Tran of\nthe 80th, Davis of the 87th, Carter of\nthe 93rd, Basemore of the 69th, and\nothers. A bill relating to waste\nmanagement. House Bill 1238 by\nRepresentative Dempsey of the 13th,\nHawkins of the 27th, Cameron of the 1st,\nCrawford of the 89th, and Cooper of the\n45th, a bill relating to medical\nassistance.\nHouse Bill 1239 by Representative Barry\nof the 56, Wilkerson of the 38th, Ali of\nthe 106, Clark of the 108, Leptton of\nthe 83rd. A bill relating to compulsory\nattendance relative to elementary and\nsecondary school students. House Bill\n1240 by Represent Martin of the 49th,\nCox of the 28th, Kelly of the 16th,\nHilton of the 48th, Canon of the 172nd,\na bill relating to redevelopment powers.\nHouse Bill 1241 by Representative\nCrawford of the 89th, and Oliver of the\n84th, a bill to amend an act providing a\nnew charter for the city of Decatur.\nHouse Bill 1242 by Representative Bird\nof the 20th, Gahan of the 81st, Horner\nof the 3rd, Matthew of the 82nd, Ridley\nof the 22nd, a bill relating to control\nof hazardous conditions, preventable\ndisease, metabolic disorders. House Bill\n1243 by Representative Hulcom of the\n101st, Jones of the 25th, Barrett of the\n24th, and Miller of the 62nd, a bill\nrelating to state printing and\ndocuments. House Bill 1244 by Remova\nValley of the 106, Ballard of the 147th,\nBlaze of the 67th, Green of the 154th,\nCarter of the 93rd, a bill relating to\nduty-free lunch period and planning\nperiod required exemption from\nextinuating circumstances and funding.\nHouse resolution 1269 by Representative\nGlaze of the 67th, Barrett of the 24th,\nFry of the 122nd, Irwin of the 32nd,\nPrince of the 132nd, and others.\nResolution urging the Georgia Department\nof Education to provideformational\nsupport to school districts to encourage\ntesting school pipes and fixtures for\nlead.\nHouse Resolution 1270 by Represent Seal\nof the 34th, Hawkins of the 27th,\nFranklin of the 160, Stevens of the\n164th, Bryce of the 139th, and others.\nResolution recognizing May 2026 as\nSavior tooth Month. House resolution\n1271 by Representative Canon of the\n172nd, and Ford of the 170th. A\nresolution honoring the life of Mr.\nWilliam Brown Love and dedicating an\ninterchange in his memory. Senate Bill\n283, 383 by Senator Kurpatre of the\n32nd, Alers of the 56, Hatchet of the\n50th, Robertson of the 29th, Jackson of\nthe 41st, and others. A bill relating to\nchild abuse. Senate Bill 402 by Senator\nTiller of the 19th, Kurt Patrick of the\n32nd, Dixon of the 45th, Walker of the\n20th, Anna Varte of the 31st and others,\na bill relating to programs and\nprotection for children and youth.\nSenate Bill 431 by Senator Kurpatre of\nthe 32nd, Hatchet of the 50th, Payne of\nthe 54th, Cucha the 51st, and Parents of\nthe 44th. A bill relating to disclosures\nand information required for permanent\nenrollment and grade higher than third.\nProvisional enrollment and transfer of\neducation records.\nSenate resolution 622 by Senator\nKpatrick the 32nd, Hatch of the 50th,\nparent of the 44th, Pain of the 54th,\nBrass of the Sixth, and others. A\nresolution creating the joint study\ncommittee on evaluating escalating costs\nin Georgia's foster care system through\nsecond readers.\nreports of standing committees. Mr.\nClerk will read.\n>> Representative Hawkins of the 27th\ndistrict, chairman of the committee on\nhealth, submitted the following report.\nMr. Speaker, your committee on health\nhas had under its consideration the\nfollowing bills of the house. Mr.\ninstructive me to report the same back\nto the house with following\nrecommendations. House bill 970 do pass\nby substitute. House bill 810 do pass by\nsubstitute. House bill 662 do pass by\nsubstitute respectfully submitted.\nRepresentative Hawkins the 27th district\nchairman. Representative Garner of the\n8th district chairman of committee on\njudiciary submitted the following\nreport. Mr. Speaker Committee on\nJudiciary has said under his\nconsideration the following bills of the\nHouse has instructed me to report the\nsame act to the House with following\nrecommendations. House Bill 211 do pass\nby committee substitute. House Bill 1024\ndo pass. House Bill 1042 do pass by\ncommittee substitute. House Bill 1187 do\npass by committee substitute\nrespectfully submitted. Representative\nGarner of the 8th district chairman.\nRepresentative Camp Chairman of the\nCommittee on Jud Judiciary Juveniles\nsubmitted the following report. Mr.\nSpeaker, your committee on judiciary\njuveniles had under its consideration\nthe following bill of the house has\ninstructed me to report same back to the\nhouse it following recommendation. House\nbill 256 to pass by substitute\nrespectfully submitted representative\ncamp but chairman\nrepresent John Corbett of the 174th\ndistrict chairman and committee on motor\nvehicles submitted the following report.\nMr. Speaker, your committee on motor\nvehicles has had under its consideration\nfollowing bills of the house. instructed\nme to report the same back to the House\nof Following recommendations. House Bill\n585 do pass by substitute. House Bill\n1073 do pass. House Bill 10 1181 do\npass. House Bill 1202 due pass\nrespectfully submitted. Representative\nJohn Corbin of the 174th district\nchairman Representative Alan Powell the\n33rd district chairman committee on\nregulated industries submitted the\nfollowing report. Mr. Speaker Committee\non Regulated Industries has had under\nits consideration the following bills of\nthe House and Senate has instructed me\nto report same back to the House with\nthe following recommendations. House\nBill 504 do pass by substitute. House\nBill 1086 do pass by substitute. Senate\nBill 220 do pass by substitute\nrespectfully submitted. Representative\nAlan Paul, 33rd district chairman. That\ncompletes the reading of the reports of\nstanding committees.\nThank you members. If you will uh come\ninto the chamber and take your seats, we\nwill have some morning orders here.\nYou have some important conversations,\nplease take them out to the any room.\nAs is our custom lately, we have a whole\nslew of morning orders.\nWith the exception of the leader who\nwill bring us a moment in black history\ntoday, she has two minutes or whatever\nshe needs. The rest of you need to get\ndone in about a minute.\nI hope y'all will comply. We have a lot\nof guests in the chamber, in the\ngallery,\nso we know you need to recognize them.\nSo, uh, if you can do that, that'd be\ngreat. Respect the other members and\ngive them time.\nThe minority leader of this house,\nRepresentative Carolyn Hugley from\nColumbus, Georgia, is recognized for a\nmorning order.\n>> Thank you, Mr. Speaker. Ladies and\ngentlemen of the House, today we honor\nRosa Parks,\nnot just as a civil rights icon, but as\na powerful reminder of what true courage\nlooks like. Rosa Park did not raise her\nvoice. She did not seek the spotlight.\nShe did not act out of anger or implus.\nInstead, she demonstrated the kind of\ncourage that comes from quiet strength\nand unshakable dignity.\nOn December the 1st, 1955, Rosa Parks\nmade a simple but profound decision\nto remain seated.\nIn that moment, she showed the world\nthat leadership does not have to be loud\nto be transformative.\nSometimes leadership is calm, resolute,\nand grounded in selfrespect.\nThat quiet act sparked one of the most\nsignificant movements in our nation's\nhistory. Because of Rosa Parks,\nthousands of AfricanAmerican citizens in\nMontgomery, Alabama refused to ride the\ncity's segregated bus system for 382\ndays. Day after day, rain or shine, they\nwalked, they carpooled, and they\nsacrificed not out of anger, but out of\ncollective resolve.\nThat sustained act of courage shook the\nconscious of this nation and ultimately\nled to the desegregation of public\ntransportation in Montgomery.\nRosa Parks taught us that courage is not\nabout volume. is about conviction.\nShe understood her worth, the power of\nher humanity, and the ripple effect of\nstanding firm in what is right.\nHer life reminds us that change often\nbegins with one quiet no that inspires\nthousands of courageous yeses. You don't\nhave to be loud to be strong. You don't\nhave to seek attention to lead. And you\nnever know how one brave principled\nstand can carry a people forward. Mr.\nSpeaker, thank you. I yield the well.\n>> Thank you, Leader Hugley.\n>> Representative Carter,\nare you on the floor?\n>> Chairman Blackman, you're on deck.\nrepresent Dorene Carter is recognized\nfor a morning order.\n>> Good morning.\nThank you all for joining us today.\nThank you, Mr. Speaker. Today we have\nthe Jackson State University Alumni\nAssociation, the Atlanta Chapter. They\nare here with us. Uh some of you may\nknow that I did attend Jackson State\nUniversity. I went there on a music\nscholarship. I played trombone and\nbassoon. Yep, those were the days. if\nyou would stand with us, please members\nof the Jackson State University alumni,\nand let's welcome them to the people's\nhouse.\n>> Thank you, Mr. Speaker. We hear the\nwell.\nChairman Corbett is recognized for a\nmorning order. Chairman John Corbett\nand friends represent Griffin, you're on\ndeck.\nThank you, Mr. Speaker. I have a\nresolution uh stating today, February\n10th, as dyslexia day at the cap. We've\ngot a special group in the gallery\ntoday. Uh decoding dyslexia. They're\nhere to bring awareness, keep us uh make\nmake sure we aware of the issue with\ndyslexia and how early intervention is\ncritical. Uh and I've got a letter I'd\nlike to read from from somebody at the\nShrank School. It says, \"Please keep\nfunding for dyslexia. I am a fourth\ngrade student at the Shrank School. I\nwant you to keep refunding because I\nhave trouble with reading and writing.\nSince I went to shrank school, it has\nbeen a lot easier. Dyslexics also have\nadvantages like extra time on tests.\nSome famous dyslexics are Tom Cruz, Walt\nDisney, Albert Einstein, Leonardo da\nVinci, John F. Kennedy, George\nWashington, George W. Bush, Jim Carrey,\nand Hen Henry Winkler. As you can see,\ndyslexics are talented in lots of\ndifferent ways. Please keep please keep\nhelping all dyslexics. So I'm going to\nask the groups here with disclo decoding\ndyslexia to please stand and let us\nhonor you today.\nRepresentative Griffin\nWhip Bett,\nthat's you\n>> represent.\n>> Y'all taught before y'all came in,\ndidn't you?\n>> Yes.\n>> Thank you, Mr. Speaker, uh want to make\nsure to recognize that it is Georgia\nforestry day at the capital today. Uh we\nhave many folks in the halls and uh all\nover the capital today. Forestry being\nthe number one um agricultural industry\nin the agricultural sector and we're the\nnumber one forestry state in the\ncountry. We very much appreciate what\nthis industry does for our state and\nthere will be a reception this evening\nand I will give you all the details of\nthat reception and very much appreciate\nthe opportunity to present this to you\nall today. Thank you very much, Mr.\nSpeaker.\n>> Very good. Thank you. You had some\nfriends too. That's\nit's a wakeup call for me.\nRepresentative Ford.\nRepresentative Ford's recognized for a\nmorning order.\n>> Ladies recognized.\n>> Thank you, speaker, and thank you,\nmembers. Today I would like to welcome\nmembers of Georgia Farm Bureau,\nespecially the members from my district\nof Barry and Cook and Tiff counties. Um,\nand my area of the state and my family\nrely heavily on the cotton sector of\nagriculture.\nThe cotton sector is one of our big\ndrivers. But in the last several years,\nthings have not been good with low\nprices and low demand.\nAnd let me tell you what the cost of\nthat is to consumers. Most people are\nsurprised to learn that majority of\nclothing today is made from synthetic\nmaterials, essentially forms of plastic.\nNatural fibers such as cotton make up\nonly about 20% of the market. Synthetic\nfibers have become so common place that\nmany of us rarely stop to consider what\nour clothing is actually made of. And\nthis convenience comes at a hidden\nhidden cost. Every time we wash or wear\nsynthetic garments, they shed tiny\ninvisible plastic particles known as\nmicrolastics\ninto our environment. So, I encourage\nyou today and all days to wear cotton.\nThank you.\n>> Georgia cotton. That's what I'm talking\nabout.\nThank you, ma'am.\nRepresentative Griffin, you gonna bring\nRepresentative Jackson with you? That's\nstrong. Now, I'm telling you, that's two\ngood ones there. Gentleman's recognized\nfor a morning order.\n>> I had a couple other people from uh GMC,\nGeorgia Military College wanted to come\nup.\n>> Anybody from Georgia Military want to\ncome up and join Griffin, come on up.\n>> Military, you asked to be a part of us\nthis morning.\nOkay. Uh, thank you. Uh,\nokay.\n>> There you go. You got you have one\nthere.\n>> Thank you, Mr. Speaker.\nGood morning, everyone, ladies and\ngentlemen of the house. I'm proud to\nrecognize Georgia Military College from\nmy district today. Georgia Military\nCollege is an unacquired public\nindependent state authority that\nprovides accessibility,\nhighquality education and leadership\nuh development to students across\nGeorgia. from his home campus in\nMilligville serving a K through 12\npreparatory\nuh school, a junior college with a\nresidential core cadetses, student\nathletes, and commuters commuter\nstudents to serve uh locations in a full\nonline\n4year college. We are also proud to have\nthe GMC students and they are here but I\ndon't see them upstairs. They'll be here\nuntil noon and if you go out in the\naudience please uh downstairs please\nstop by and uh say hello to them because\nthey are our future and especially in\nthe in the military.\nThank you Mr. Speaker and I yield the\nwell.\nThank you, Representative Griffin.\nYou're right. They are our future. A\ngreat school. We appreciate what they\ndo. Do a fine job. Do a fine job all\nacross all across the state.\nChairman Blackman, are you ready?\n>> You have a morning order.\n>> You have a youth group here.\n>> Why don't you recognize them right now?\n>> Thank you, Mr. Speaker. I know.\n>> Gentleman suspend just for a minute.\nYes, sir.\nFolks, we recognize some some of our\nneighbors from back home. So, please\ngive the gentleman the well your\nattention. Please proceed. And friends,\n>> thank you, Mr. Speaker. Uh local\ndelegation certainly welcome to uh join\nme up here, but we are honored today to\nhave with us some very special people\nfrom uh the Perry area and our\nleadership group. Uh some youth and some\nadults. Would you please stand and let\nus welcome you to the people's house\ntoday. So glad to have you.\n>> Thank you, Mr. Speaker.\nThank you, members. Welcome from the\ngreat city of Perry\nHouse and County, a pretty cool spot in\nour state. Thank y'all for being here.\nWe appreciate your what you're preparing\nyourselves for.\nChairman Bonner,\ngentleman's recognized. He has some\nguests here in the gallery. So, please\ngive the gentleman your attention\nand friends. Chairman Bonner. Thank you,\nMr. Speaker. Uh on behalf of the Faget\nCounty delegation, we are so pleased to\nhave the Faget County Chamber of\nCommerce leadership fyet class here with\nus today. Uh they are led by the\npresident of our chamber, Leonardo\nMcCclardy, and we are so grateful to\nhave them here today. Thank you.\nChair Matiac, why don't you come back?\nOh, that was Rymen, wasn't it?\n>> Chairman Matiac, why don't you come\nback?\nCome on down. Ladies recognized.\n>> Thank you, Mr. Speaker. Today is\nChiropractic Day at the Capitol and um\nRepresentative Anessa Jones and I would\nlike to welcome the Georgia Chiropractic\nAssociation. Life University and Vice\nPresident Jills Lam Marsh. Also, state\nboard member Mary Watkins is over here\nin the in the window and past Georgia\nChiropractic um association member um\nboard member Nyla Smith is over there,\ntoo. We're so excited to have some of\nour our older um chiropractors here\ntoday. Thank you, Mr. Speaker.\nChairman Parish,\nyou have an important visitor here\ntoday.\nknows something about our environment,\nall those kind of things. Is that\ncorrect?\n>> Yes, sir.\n>> Thank you, Mr. Speaker.\n>> Gentleman will suspend.\nShow the gentleman some respect in the\nwell. Gentleman's recognized.\n>> Thank you, Mr. Speaker. Following up on\nthe forestry day at the Capitol, it's my\npleasure to introduce to you today the\nGeorgia tree farmer of the year. Mr.\nHerbert Hajes and his wife Sandra are in\nthe gallery with us. If you would please\nstand. today.\nThe Hajes live in Swainsboro\nand live on their farm and were\nrecognized as the 2025 Georgia Tree\nFarmer of the Year at the Georgia\nForestry Association annual meeting in\nJuly of 25. Uh, this award award\nrecognizes land owners certified to the\nAmerican tree farm system who\ndemonstrate outstanding private forest\nstewardship that support wildlife, wood,\nwater, and recreation. What sets Mr.\nHodes apart is his work in the woods is\nmatched by his work with people. A\nretired military veteran, educator, and\nordained minister, Mr. Hajes approaches\nforestry as a long-term responsibility,\nbuilding a legacy of healthy forests\nwhile also helping others to do the\nsame. Mr. Hodes has made his property a\nmodel farm and a living classroom,\nopening up for workshops and field\nlearning, hosting learn and burn and\nother hands-on training with\nconservative partners, conservation\npartners so that land owners, students,\nand professionals can see practical\nstewardship in action. Mr. Mr. Ters, we\ncongratulate you. Thank you for being\nhere with us today. Would you help me\nrecognize him? Thank you.\n>> Mr. and Miss Hodgeges, thank you for\nmanaging the good Lord's trees. We\nappreciate what y'all are doing. Hey, we\nneed to get you down for chaplain of the\nday one day. We'll put you on the list.\nThank y'all for being here.\nCongratulations.\nRepres Representative Scott,\nRepresentative Davis,\nRepresentative Scoffield,\nare y'all present accounted for?\n>> Yeah. Are the ladies are recognized for\na morning order?\nChairman Fleming and Crow are\nrecognized. Y'all on deck.\nAll right. Who's going to do the\ntalking?\nThere she comes. Represent Sandra Scott.\nLadies recognized.\n>> Good morning, uh, Mr. Speaker, and thank\nyou. This morning, we have the HOA, CO\nA, and P O. They at the capital.\nThey are here to advocate for change\nwith HOAs, COAs, and POAS.\nIf you're in the gallery, would you\nplease stand?\n>> They're trying to get in.\n>> They're trying to get in. Okay. Thank\nyou, Mr. Speaker. And we yield the well.\n>> Thank you, Representative Scott. Welcome\nto the capital.\n>> Appreciate your work. Good to see you.\n>> Representative Fleming and Crow. What do\ny'all got there?\n>> Oh, cool.\n>> Thank you, Mr. Speaker. Good morning,\nmembers. It's our honor this morning to\nwelcome a fine group of uh leaders and\nindustry leaders from Newton County with\nus today for Newton County Industry Day\nat the Capitol uh sponsored by the\nNewton County Industrial Development\nAuthority. Y'all noticed on your desk,\ny'all got y'all's annual Bridgestone\ngolf balls. Uh so uh I want fun fact,\nevery Bridgestone golf ball is produced\nin Covington, Georgia, which is amazing.\nAnd if\n>> where?\n>> In Coington, Georgia, Mr. Speaker.\n>> All right. And uh from 11:30 to 1:00\ntoday, if you'll come to Capitol Room\n125, you will pick up this year's Golf\nTile presented by Bridgestone uh and\njoin and meet some of our industry\nleaders while you're down there. And\nsome of the other industry leaders that\nare with us are Archer Aviation, Meta,\nRivian, Snap and Shaws, EMC, and Thomas\nand Hutton. Thank you, Mr. Speaker.\nYield the well.\n>> Thank you, gentlemen. Cool things going\non in Coington. That's awesome. Thank\nyou,\nChairman. Tyler Paul Smith is recognized\nfor a monor represent Kahan. You're on\ndeck.\n>> Thank you, Mr. Speaker. Mr. Speaker, I\njust want to rise and welcome those fine\nHarelson counties from the Harelson\nCounty Farm Bureau to the capital today.\nThey have taken time off of the front\nline of defense against Alabama over\nthere on I 20 to come to the people's\nhouse. And also a shout out to Miss\nAllison Bridges with Wheeler High\nSchool. Her grandfather Stanley is the\npresident of our board. members, if you\nwould help us welcome them to the\npeople's house.\nThank you, Mr. Speaker.\nRepresentative Kahan and friends friend.\nNo friends.\n>> Yeah, many friends coming with you.\nRecognized for morning order. Ladies\nrecognized.\n>> Thank you, Mr. speaker and good morning\ncolleagues. Our delegation would like to\nwelcome Leadership Henry to the people's\nhouse. It was a pleasure to speak with\nthem this morning. They had so many\ngreat questions. Leadership Henry is a\nyear-long program focused on leadership\ndevelopment with community and civic\nengagement. We recognize the time and\nthe effort it takes to come to the\nCapitol, and we'd like to thank you for\nyour commitment to our community. If\nthey're in the gallery, would they\nplease stand? or if you see them around\nthe capitol, please welcome them to the\npeople's house.\n>> Thank you, Mr. Speaker. I yield the\nwell.\n>> Thank you, members.\nChairman Le Hood\nrecognized for a morning order.\n>> Thank you, Mr. Speaker. Uh and members,\nI want to recognize some special people\ntoday. It's a group of uh providers of\nsenior living services all around the\nstate. The Georgia Senior Living\nAssociation is up in the gallery today.\nAnd uh these are some of the hardest\nworking people with the biggest hearts\nthat care and provide dignity to our\nolder adults in this state. Over 40,000\nolder adults are are living in these\nsettings. Over 20,000 people uh doing\nthe good work. And we appreciate them\nbeing here today. Please help me give\nthem a round of applause.\nLet's see. This looks like the Columbus\ndelegation to me.\nLeader Hugley,\nRepresentatives Ree,\nRepresentative Vance Smith,\nRepresentative Buckner, and\nRepresentative Rice.\nAll recognized for a morning order.\n>> Thank you, Mr. Speaker.\nIn the interest of time, we'll go ahead\nand move forward. We have some guests\nwith us here from Columbus today who\ncame down to bring some pages for us. So\nif you see the girls in green, they're\nall from Columbus, Georgia, and they're\nwith our Lynx chapter out of Columbus.\nThe pages that are in green today. We\nalso have with us in the gallery our\natlarge school board representative, Dr.\nKia Chambers. If you will please stand\nup for us, Dr. Chambers.\nWe also have Miss Tanya Douglas. if you\nwill please stand. The whole group, you\nthe whole group, all four of y'all stand\nup. We have two parents with us as well.\nSo, if you will, our colleagues, let's\ngive them a round of applause for\ngetting our young folks here to\nparticipate in the Page program cuz many\nof us know just how life-changing that\nis for our young folks to be able to do\nthat program and we enjoy seeing them\nevery day that we're here at the\ncapital. So, thank you, Mr. Speaker, and\nthank you to the delegation from\nColumbus.\n>> Thank you'all for being here. Met some\nof those young pages while ago. Very\nimpressive. Thank y'all for being here.\nWhip Bett.\nIt's unusual to have two now.\n>> Yes. Thank you, Mr. Speaker. Um, today\nis also Oki Finoi Day at the Capitol. We\nwant to recognize our board. Uh I\nbelieve they are in the Senate chamber\nat this point, but uh the Oki Finoi is\none of the cherished gyms of South\nGeorgia. If you haven't been there,\nplease come there. Um they'll be in um\nCapitol 216 from 1 to 3 and I believe\nyou'll get an opportunity to uh take a\npicture with a alligator if you'd like\nto do that. So we want to recognize\nthose folks uh and the importance of the\nOki Finoi to the state of Georgia. also\nwanted to re um or at least tell you all\nthat the GFA reception is from at 5:00\npm at the blue room this afternoon.\nThank you, Mr. Speaker.\n>> Representing Bazemore and Donna Tucci,\nladies are recognized.\n>> Thank you, Mr. Speaker. And so just\nwanted you to know that we had the\nopportunity this morning to go across\nthe street and to join with human\ntrafficking organization, the street\ngrace. And it was enlightening and there\nwere so many children there and we just\nwanted to recognize them for coming down\ntoday and realizing that we have to do\nall we can do to save and to keep our\nchildren safe. So, thank you.\n>> Absolutely. We're keeping our children\nsafe. Thank you very much, ladies.\nThat concludes our morning orders.\nSo, I want you members,\nhe's going to be further recognized in a\nminute, but it's always special when a\nformer member of this house who happens\nto be a farmer as well. former member of\nthis house who's a farmer\ncomes back to visit us.\nY'all help me make\nformer chairman of agriculture consumer\naffairs, a dear friend of this house,\nchairman Tom McCall.\n>> He taught me a lot and I forgot half of\nit. So,\nMembers, we have an invite resolution.\nRepresentative Dicki is going to bring\nto us at this time.\nGive the clerk your attention as he\nreads a resolution, House Resolution\n1081. Mr. Clerk,\n>> House Resolution 1081 by Representative\nDicki of the 134th, Howard of the 71st,\nCampbell 171st, Hulesen of the 72nd,\nCorbett of the 174th, and others. A\nresolution\nrecognizing February 10th, 2026 is\nGeorgia Farm Bureau Federation Day at\nthe state capital and for other\npurposes.\nWhereas the Georgia Farm Bureau\nFederation was formed in 1937 as a voice\nfor production agriculture in the\nlegislative arena. And whereas from its\nhumble beginnings in Northwest Georgia,\nthe Georgia Farm Bureau Federation has\ngrown to 158 county chapters with a\ncurrent membership of over 235,000\nled by volunteer farmer members. And\nwhereas this outstanding federation of\nGeorgia farmers has become diversified\norganiz organization which focuses on\nservice to its members and the\nimprovement of Georgia agriculture. And\nwhereas the Georgia Farm Bureau\nFederation now operates companies which\nprovide services to its members in areas\nthat include advocacy, insurance, and\nbanking. And whereas the House\nAgriculture and Consumer Affairs\nCommittee has long recognized the\nGeorgia Farm Bureau Federation under the\ndedicated leadership of its president,\nMr. Tom McCall, as an exemplary voice of\nGeorgia agriculture. And whereas it is\nabundantly fitting and proper that the\nGeorgia Farm Bureau Federation and its\nmembers be appropriately recognized for\nthe many years of dedicated service to\nGeorgia agriculture.\nNow therefore, be it resolved by the\nHouse of Representatives that the\nmembers of this body recognize February\n10th, 2026 as Georgia Farm Bureau\nFederation Day at the state capital.\n>> Thank you, Mr. Clerk. Chairman Dicki is\nrecognized to speak to the resolution.\nChairman Dicki.\n>> Well, thank you, Mr. Speaker.\ncolleagues, I want take but a second\nbecause I want to recognize Tom McCall\nuh Farm Bureau President, Georgia Farm\nBureau President uh and uh former\ncolleague, former House Act chairman\nhere, a great friend doing a great job\nwith Farm Bureau in all 158 counties. Uh\nso Tom, come here and uh speak to our\ncolleagues here. Thank you.\n>> 10 15 minutes. Yeah.\nWell, thank you, Mr. Chairman. Mr.\nSpeaker, to all of y'all that all y'all\nold guys, it's good to be back home with\nyou. I appreciate y'all letting me back\nin the chamber. But up here with me,\ny'all all time ask me when I see you,\nhow's Jane doing? Well, y'all know now\nJane still telling me what to do.\nBut we uh we have a board of directors\nand I have two of my vice presidents\nwith me. Daniel Johnson from down in\nPierce County and Ralph Cwell from over\nin Herd County. I want to invite y'all\ndown to the depot for lunch. We have\nabout 600 people from all over the state\nof Georgia, all over your districts that\ngo into the voting booth and click the\nbutton. So, our people vote, our people\npay attention to who looks after\nagriculture in this state, and we\nappreciate what y'all do. You know, a is\nthe biggest contributor to the economy\nof the state of Georgia, which in turn\ngives y'all the money y'all get to spend\nback home or on state projects. So, we\nfeed, clothe, and shelter the world out\nof Georgia. And your farmers do it. We\nrepresent the people that squeeze the\nmilk out of the cows and turn the dirt\nto grow your food and your clothes.\nThat's what Georgia Farm Bureau is. You\nheard the clerk I That's first time I\never heard you read a whole resolution.\nThank you for doing that for us, Mr.\nClerk. Uh say that we had about 230,000\nmembers. That's 230,000 member families,\nwhich rolls into about a half a million\nat least votes. So, thank y'all for what\nyou do. Thank you for looking after the\nmost important industry in the state of\nGeorgia. We appreciate y'all and it's\ngreat to be back home and see y'all. I\nonly sat in two places. Right there\nwhere Angie is and right over there\nwhere Buddy Delo is in the whole 26\nyears I was here. So, I kind of\nunderstand it. The chamber looks great.\nRenovations look good.\nJohn, thank you. He and I were office\nmates. He said I taught him a lot and he\nremembers a little. He just remembers\nthe good parts. That's what it is. He is\nlike me. If it wasn't for Dale, he\nwouldn't get where he's going. So,\nthank y'all.\nMr. chairman, you set that bar high and\nthe current chairman is still working a\nlittle bit under it, but he's growing. I\ncan tell you that he's going to get\nthere. Thanks to Farm Bureau, as you\nsaid, all over our state representing\nour number one industry that puts food\nand fiber makes it available for every\nGeorgian. Best place to live, work, and\nraise a family. It's because of our\nagriculture community. Thank you, Mr.\nChairman. Thanks to everyone involved\nwith Farm Bureau.\nMembers, we'll move on to the rules\ncalendar. Move on to the rules calendar.\nWe're going to take up House Resolution\n1050. Mr. Clerk, will you read the\ncaption of House Resolution 1050?\n>> House resolution 1050 by Representative\nGreen in the 154th and others. a\nresolution authorizing the conveyance of\ncertain state-owned property in Clayton\nCounty, authorizing a lease of certain\nstateowned property in Dawson County,\nauthorizing the conveyance of certain\nstateowned property in Dicab County, and\nauthorizing a lease of certain\nstateowned property in Troop County. Mr.\nBill, this resolution having been\nassigned to state properties, that\ncommittee recommends that this\nresolution be adopted.\nWe're getting ready to convey some\nproperty. You need to know about it. So,\nwe're going to recognize the dean of\nthis house, chairman Gerald Green,\nman down in Culbrit. Did I get that\nright? Culprit.\nGentleman's recognized.\nThank you, Mr. Speaker. Ladies and\ngentlemen of the house, I bring you uh\nHouse Resolution 1050. And you know,\nthis resolution is uh something that we\ndo every year that we bring forth these\nconveyances.\nAnd the resolution authorizes the state\nof Georgia acting through the state\nproperties commission to convey or lease\ncertain stateowned uh properties. And\nthere are 11 of these uh that are uh\nlisted in the in the House resolution\nand make and Mr. Speaker, each member\nthat is affected by the conveyances,\nthey were notified by letter uh if they\nhad any questions uh concerning the\nconveyances and they are to Clayton\nCounty, Dawson County, DAB, Dy,\nEffingham, Floyd, and I checked to make\nsure that wasn't yours, Mr. Speaker, in\nEffingham County. uh McDuffy, Macintosh,\nPoke, Richmond, and Troop County. And\nMr. Speaker, if there's no uh questions,\nI uh encourage the members to vote for\nHouse Resolution 1050. And I yield the\nwell.\n>> The gentleman has no questions. He's\nyielded the well. Is there any objection\nto the previous question being ordered?\nHearing none, the previous question is\nordered. Is there any objection to\nagreeing to the report of the committee\nwhich was favorable to the adoption of\nthe resolution?\nHearing none, the report of the\ncommittee is agreed to. Shall this\nresolution now be adopted? All in favor\nof the adoption of the resolution will\nvote yes. All those opposed will vote\nno. And Mr. Clerk will unlock the\nmachine.\nHave all members voted?\nShe's getting it.\nAll members voted.\nAll members voted this. So, Mr. Clerk,\nwill you lock the machine\non the passage of House Resolution on\nthe adoption of House Resolution 1050,\nthe yays are\n165, the days are zero. The resolution\nhaving received the requisite\nconstitutional majority is therefore\nadopted.\nMr. Clerk, will you read the caption to\nHouse Resolution 1051? 1051.\n>> House Resolution 1051 by Representative\nGreen of the 154th and others. A\nresolution authorizing the grant of\nnon-exclusive easements for the\nconstruction, operation, and maintenance\nof facilities, utilities, roads, and\ningress and egress in, over, under,\nupon, across, or through property owned\nby the state of Georgia, Baldwin, Barto,\nBulock, Camden, Katusa, Chatuga,\nClayton, Kolquit, and other counties.\nThis resolution having been referred to\nthe committee on state properties. That\ncommittee recommends that this\nresolution be adopted.\n>> The gentleman who represents Culprit, I\ngot it right that time. Thank you.\nChairman Green is recognized to present\nHouse Resolution 1051. Chairman Green.\n>> Thank you, Mr. Speaker. Mr. Speaker, I'm\ngoing to take just a moment to thank you\nfor giving\nme as chairman of the state properties\ncommittee, the best committee to work\nwith that I have ever had in the many\nyears as chairman. They are they dig in,\nthey ask questions, they are very very\nuh good and I just want to thank them\nthis morning for the work that they have\ndone to make sure that uh everything was\ngood and that we're presenting to the\nhouse this morning. Mr. Speaker and\nmembers in House Resolution 1051,\nthere are 22 easements and I understand\nthat the Senate is going to add some\nmore easements and conveyances. So, we\nwill see this uh these once again.\nThe resolution is authorizing once again\nthe state of Georgia acting through the\nstate properties commission to grant the\neasements. This is uh not a during the\nuh time of the general assembly. This\ngoes on all year long. We are working to\nsee what uh the members have come up\nwith that are needed in their districts.\nAnd so it is with uh this at this\nparticular time that I offer to you\nHouse Resolution 1051.\nAnd Mr. Speaker, if there's no\nquestions, I'll yield the well.\n>> Gentleman has no question. You yielding\nthe well?\n>> I read your resolution. I know what it\nsaid. So\nNo questions. Gentleman's yielded the\nwell. Is there any objection to the\nprevious question being ordered? Hearing\nnone, the previous questions ordered. Is\nany objection to agreeing to the report\nof the committee which was favorable to\nthe adoption of the resolution? Hearing\nnone, the report of the committee is\nagreed to. Shall this resolution now be\nadopted? All in favor of the adoption of\nthe resolution will vote yes. All those\nopposed will vote no. And Mr. The clerk\nwill unlock the machine.\nAll members voted.\nAll members voted. If so, Mr. Clerk,\nwill you lock the machine\non the adoption of House Resolution\n1051,\nthe yays are 166 and are zero. The\nresolution having received the requisite\nconstitutional majority is therefore\nadopted. Good work, Mr. Chairman.\nMr. Clerk, will you will you read the\ncaption of House Bill 944?\n>> House Bill 944 by Representative\nMcDonald of the 26 and others be titled\nact to amend code section 418\nof the official code of Georgia\nannotator relating to safe operations of\nmotor carriers, commercial motor\nvehicles and drivers and safe\ntransportation of hazardous materials.\nThis bill I'm referred to committee on\nmotor vehicles. That committee\nrecommends that this bill do pass.\n>> Chairman Lauren McDonald is recognized\nto present House Bill 944.\nRepresentative McDonald.\nThank you, Mr. Speaker. Ladies and\ngentlemen, colleagues, uh this is that\nutmost important bill that everybody\nwill be when you qualifying in March\nthat you can go to your constituents and\nsay you passed this bill. Uh this bill\nis the one that set down from the\nfederal government that for our safe\noperation of motor carriers, commercial\nmotor vehicles and drivers and safe\ntransportation of hazardous materials.\nAll we're doing here is changing the\ndate, the annual date from 2025 to 2026.\nI know your board's lit up back there,\nMr. Speaker, but I'm going to go ahead\nand yield the well.\n>> You have a couple of questions.\nThe gentleman's not going to answer any\nquestions, so I guess I won't recognize.\nHe get them he can uh\nyou can do it in parliamentary inquiry.\nGentleman's yielded well. Is there any\nobjection to the previous question being\nordered? Hearing none, the previous\nquestion is ordered. Is there any\nobjection to agreeing to the report of\nthe committee which was favorable to the\npassage of the bill? Hearing none, the\nreport of the committee is agreed to.\nShall this bill now pass? All in favor\nof the passage of the bill will vote\nyes. All those opposed will vote no. And\nMr. Clerk, will you unlock the machine?\nFor what purpose does represent Meeks\nrise?\n>> Parliamentary inquiry, Mr. Speaker.\n>> State your inquiry.\n>> Mr. Speaker, is it not two that the\ngentleman from the 26 last year authored\na bill that changed the name of MCCD to\nanother acronym which is not in this\nbill? So, I'm not sure that it is fully\ncompliant uh with what he's intending to\ndo.\n>> I'm not sure that's true, but I tell you\nwhat, we're going to look into that\nbecause of this uh something that's not\nkosher here with MCD. We're going to\nhave to check on it over in the Senate.\nI'm sure they'll be more than willing to\nlook into that issue.\nAll members voted.\nAll members voted this. So, Mr. Clerk,\nwill you lock the machine?\nOkay.\nOn the passage of House Bill 944, the\nyays are a 162, the nays are four. The\nbill having received the requisite\nconstitutional majority is therefore\npassed. And we'll look at that issue in\nthe Senate.\nMr. Clerk, will you read the caption\nto House Bill 1015 10:15?\n>> House Bill 10:15 by Representative\nWorkheiser the 157th to be entitled act\nto amend article 10 of chapter 9 on\ntitle 34 of the official code of Georgia\nannotated relating to self-insurers\nguaranteed trust fund regarding workers\ncompensation so as to provide certain\nfunded levels of such fund. This bill\nbeen referred to the committee on\nindustry and labor. That committee\nrecommends that this bill do pass.\n>> Chairman Warheiser is recognized to\npresent the bill.\n>> Thank you, Mr. Speaker. Don't know how\nhe did it, but the only thing we could\nfind that was less interesting than\nfederal regulations and conveying\neasements was workers comp.\nSo,\n>> gentlemen will suspend. I'm sure there's\nat least one person other than me wants\nto hear this. So,\n>> please give the gentleman the well your\nattention. He deserves it. Gentleman\nrecognized or continue.\n>> Thank you.\nSo, if you're a small business and you\nhave more than two employees, you\ngenerally will get your workers comp\nthrough an insurance agent.\nlarge businesses because they get to\nkeep their money and earn interest on\nit. They will pull their b money with\nother businesses or if they're large\nenough, they'll do it themselves, but\nthey will self-fund their workers comp\ninsurance\nand they'll keep that in a stack of\nmoney over here.\nOver here\nis a precaution in case there was a\ncatastroph catastrophic event. In case\nthe business were to go bankrupt or the\nfunds be depleted out of money, they\nimpose on themselves\nan assessment to go into a fund that is\noverseen by the self-insured guaranteed\ntrust fund which is overseen by the\nstate workers comp board.\nThat fund has a floor and a ceiling that\nhas not been updated in decades. And 15\nmillion doesn't buy what it used to. So,\nwe're raising the floor from 5 million\nto 10 million and raising the ceiling\nfrom 15 million to 25 million. Once that\nceiling is met,\nthe employers no longer have to put\nmoney into that fund, but it's just a\nsafety valve and it caught a\ncatastrophic event. And so that's what\nthe bill does. If there's no other\nquestions, I would ask for your favor.\n>> Gentleman has a question.\n>> Question. Okay.\n>> Representative Lupton to your left\n>> is recognized for question.\n>> Thank you. Does the gentleman yield\n>> reluctantly?\nthe the lady from the the gentle lady\nfrom the 85th would like me to ask you\nif we need to get out the fish. Is this\nyour first bill?\n>> Hardly hardly my first bill, but first\nfirst one this year.\n>> Congratulations.\n>> We haven't seen a vote yet.\nSo if he congratulates him then uh the\ngentleman has no further questions.\n>> Thank you. And I ask for your favorable\nconsideration. Thank you.\n>> Gentleman's yielded. Well, is there any\nobjection to the previous question being\nordered? Hearing none, the previous\nquestion is ordered. Is there any\nobjection to agreeing to report of the\ncommittee which was favorable to the\npassage of the bill? Hearing none, the\nreport of the committee is agreed to.\nShall this bill now pass? All in favor\nof the passage of the bill will vote\nyes. All those opposed will vote no. And\nMr. Clerk will unlock the machine.\nHave all members voted?\nAll members voted. If so,\nMr. Clerk, will you lock the machine? On\nthe passage of House Bill 10:15, the\nyays are a 165, the nays are a three.\nThe bill, this bill, having received the\nrequisite constitutional majority is\ntherefore passed. Now we'll offer our\ncongratulations to the gentlemen.\nThat completes our rules calendar.\nWe have a couple of motions that we'll\ntake up. For what purposes,\nRepresentative Wade rise?\n>> He waves.\nFor what purposes, Representative\nLumston, Chairman Lumston, rise?\n>> Make a motion.\n>> State your motion.\n>> I move that the House that House Bill\n868 be moved from the committee on\ninsurance to the uh committee on\ngovernmental affairs. Both chairman are\nin agreement.\n>> Mr. Clerk, will you read the caption?\nHouse Bill 868 by Representative\nLumpston the 12th and others will be\nentitled act to amend part one of\narticle one of chapter 18 to title 45 of\nthe official code of George annotated\nrelating to state employees health\ninsurance plans\nThank you.\nOn the gentleman's motion to House Bill\n868 be with be withdrawn from the\ninsurance committee and recommitted to\nthe governmental affairs committee. Is\nthere objection?\nHearing none is so ordered. For what\npurposes? Representative Douglas rise.\nMake a motion.\n>> State your motion, sir. Uh I move that\nthe house uh house bill 11:22 be moved\nfrom the committee on insurance to the\ncommittee on uh health. Both chairman\nare in agreement.\n>> Thank you. Mr. Clerk, will you read the\ncaption? House Bill 11:22 by\nRepresentative Douglas the 78th and\nothers to be entitled act to amend\narticle one of chapter 24 of title 33\nthe official code of Georgia annotated\nrelating to general provisions regarding\ninsurance generally.\nOn the gentleman's motion that House\nBill 1122 be withdrawn from the\ninsurance comm insurance insurance\ncommittee and recommitted to health\ncommittee. Is there objection? Hearing\nnone is so ordered.\nWe have some afternoon orders that we'll\nuh recognize members for. At this time,\nwe'll give you up to two minutes to\nbring your afternoon order.\nRepresentative Anish Anisha Jones,\nRepresentative Herring, Representative\nParish, the Mon Bib delegation is\nrecognized for an afternoon order. And\nI'm going to ask the members,\ngive just a second to get here. Going to\nask the members to please stand.\ncommittee will suspend just for a\nmoment.\n>> Thank you, Mr. Speaker. And as I stand\nhere, I'm really trying to keep it\ntogether because this was a very dear\nfriend of mine. Um, today I rise with a\nfull heart to honor the life and legacy\nof Ron Shipman, a devoted husband,\nfather, and a leader whose steady hands\nhelped guide Georgia Power, the making\nwater authority, and the economic future\nof Middle Georgia. And a man whose\npresence reminded us that true\nleadership is rooted in service to\npeople. Ron Shipman did not simply hold\ntitles. He built trust, strengthened\ninstitutions, mentored future leaders,\nand carried a vision that our\ncommunities could grow stronger\ntogether. Born in Videlia, Georgia, Ron\nlived a life marked by curiosity,\npassion, and a love for others. He had a\ndeep appreciation for aviation by and\nbiology and was someone who truly\nenjoyed learning and exploring the world\naround him. From his decades of\nexcellence at Georgia Power to his\nhistoric leadership at making water\nauthority, he worked quietly but\npowerfully to ensure that families,\nbusinesses, and neighbors across our\nstate had opportunity, stability, and\nhope. I'm going to yield to Rep.\npreparing for the remainder.\n>> But beyond every achievement, he was a\nfamily man grounded by love, guided by\npurpose, and remembered for the\ncompassion he extended to everyone he\nmet. Today, we honor not only what he\naccomplished, but who he was. a\nbridgeuer, a servant leader, and a proud\nGeorgian whose legacy will continue to\nflow through the lives he touched in\nevery community that he served and\nhelped shape. I ask this house to join\nme in celebrating his life, lifting up\nAnita Shipman and the Shipman family in\nour prayers and recognizing that Ron\nShipman's impact on this state will\nendure for generations to come. If you\nwould please honor him with a moment of\nsilence.\nThank you, Mr. Speaker. I yield the\nwell.\n>> Thank you, members. very appropriate and\nour condolences to the Shipman family.\nFine man he was. I'd met Ron. Good man.\nGreat work. Condolences to the family.\nRepresentative Ali is recognized for an\nafternoon order, sir. Give the gentleman\nyour attention, please. Please. He has a\nphoto that you need to hear about.\n>> Thank you, Mr. Speaker. Members of this\nhouse, on the screen is Elise. Elise is\na 13-year-old in the foster care system.\nHer adventurous personality, cooking\nskills, and love of animals all make her\na star in the people around her's lives,\nand it will be for those who eventually\nchoose to adopt her as well. However, we\nneed to make that happen. And it's my\nturn now.Hs.jah.gov\nis where we can make that possible.\nThank you once again, Mr. Speaker.\nAyoda.\n>> Thank you. Representative Townid, Delo,\nand Sains\nrecognized for an afternoon order.\nThere's Representative Towns, Sains, and\nthe Loach. The gentleman will pause for\na moment.\nThank you, Mr. Speaker. Just a reminder,\na week from today is going night. Goals\nday at the capital. Next Tuesday, we're\nhaving fresh Georgia shrimp next Tuesday\ndown the depot from 5 to 7. I hope you\ncome down and join us. It's going to be\na good time. It's all You can't beat\nfresh shrimp for Mr. Shucks. I can tell\nyou that now. So, it's going to be a\ngreat day, Al. Looking forward to seeing\nyou there and all your friends. Thank\nyou.\nIt will be just as fun as Savannah. I\npromise.\nY'all going to have some Georgia wild\nshrimp down there?\n>> Yes, sir.\n>> I bet you will.\nSo, we did not recognize our doctor of\nthe day earlier today, but\nRepresentative Reeves,\nRepresentative Matt Reeves,\ngentleman's recognized. He's going to\nrecognize our doctor today. Thanks for\nbringing our doctor and I'm going to\ngive you some time to recognize her and\nthanks for her service. Thank you so\nmuch, Mr. Speaker. I rise to commend our\ndoctor of the day, Dr. Indren and\nKrishnan. He is one of our most frequent\ndoctors of the day, most consistent.\nHe's a gastroenterenterologist from\nGwynet County. He's an adjunct professor\nat Emory. He's on the Georgia board of\nhealthc care workforce. Last year he\ncame here or last week he came here to\nthe capitol to uh join with the governor\nin c or in noting Georgia cancer day. An\nounce of prevention is worth a pound of\ncure. Uh he was here today. He had the\nprivilege of uh attending to one of our\nmembers today. That's what they're there\nfor if you need them. Uh proud to honor\nhim with a resolution and uh let's let\nhim and all the other doctors of the day\nuh know how much we appreciate them\ncoming to the capital. Thank you,\nChairlady Hagen.\nThank you, Mr. Speaker. Colleagues, I\nhave two sons and I am incredibly proud\nof both of them, but most of you only\nknow one of them, and that is my younger\nson, Henry, because he spends spring\nbreak here every year. He's been up here\nfor spring break every year that I have,\nand he'll actually be back next week to\nspend that week with me. Um, right now\nmy entire family is in Statesboro\ncelebrating his birthday while I am\nhere. So I wanted to see if you would\nplease join me in wishing my son Henry a\nhappy 22nd birthday. He is watching\nright now. So happy birthday Henry.\nThank you Mr. Speaker.\nRepresentative Edna Jackson. Oh, there\nshe is. Mayor, come on. Representee,\ncome on up. I can't help it. I still\nhave to call you may mail from time to\ntime.\n>> Thank you.\n>> Ladies recognized.\n>> Thank you very much. Uh I'm a little\ntired. I just drove in from Savannah. Uh\nI just want to remind you that on\ntomorrow, Savannah will be Savannah\nState University Day here at the Capitol\nand we want you to come and to meet our\nleaders, students, alumni, and people\nfrom across the state of Georgia. Please\ncome out. We will start at 900 a.m. in\nthe morning over in the Coverdale\nbuilding and then we will be over here\nroom 510.\nCome and help us this hostess city of\nthe south. Thank you.\n>> That's it.\n>> That's it.\n>> Okay. Good job.\n>> Thank you.\n>> Representative Holly. Thank you. Uh,\nmayor representative Holly is recognized\nfor an afternoon order. The gentleman's\nrecognized.\n>> Thank you, Mr. Speaker. Colleagues, uh,\ntoday uh, we will be having our first of\na series called Mental Health Live.\nFortunately, we have joining us, he's\nactually flying in from Brooklyn, New\nYork. He's flying in from Brooklyn, New\nYork, uh, Dr. Robert Gore who is\nemergency room uh surgeon um who's going\nto be talking about um the lessons he's\nlearned with his published book uh\ntreating violence. Uh we will also be\njoined uh with Mon'nique Bell uh who is\na uh the steering committee chair for uh\nthe National Alliance on Mental Illness.\nThat will be taking place today um\nreally a time around 3:00 uh downstairs\nin room 216. So members, uh, it' be good\nfor you to be able to come and be able\nto glean some lessons that might be\nimpactful for your own communities.\nThank you, Mr. Speaker. Are you the\nwill?\n>> Mr. Clerk, will you read the caption to\na group of privileged resolutions? Mr.\nClerk,\n>> honoring the life and memory of Dr.\nJames Matthew Garrett\nhonoring Lula Reigns of Augusta,\nGeorgia. She reaches the grand milestone\nof her 90th birthday. Recognizing\ncommending Susan Fishner, recipient of\nthe EWN\nWCM Social Service Case Manager of the\nYear Award. Recognizing and commending\nLisa Anne Miner, recipient in the\nAssisted Living Administrator of the\nYear Award. Recognizing and commending\nRachel Egleston, recipient of the\nadministrator of the year award.\nRecognizing and commending Richard Caps,\nrecipient of the Emergency Preparedness\nChampion Award. Recognizing and\ncommending Stephanie Millage, recipient\nof the EDWCM\nNurse Case Manager of the Year Award.\nRecognizing commending Brad Adams,\nrecipient of the Engineering and\nEnvironmental Services Champion Award.\nRecognizing, commending Angela Watkins,\nrecipient of the Leadership Excellence\nAward. Recognizing, commending Jennifer\nYansom, recipient of the EDWCM\nSupport Staff of the Year Award.\nRecognizing, commending Kyle Facet,\nrecipient of the new administrator of\nthe year award, recognizing February\n24th, 2026 is ER Day in the state of\nGeorgia.\nRecognizing and commending the honorable\nJudge Stacy K. Hydrickch for her\ndistinguished judicial service.\nRecognizing commending the American\nFoundation for Suicide Prevention and\nits Georgia chapter. Recognizing the\nSnellville Youth Council. Commending the\nbenefits and contributions of purebred\ndogs to the state of Georgia.\nRecognizing May 1st, 2026 as Georgia\npurebred dog day. Recognizing February\n11th, 2026 is KIA day at the state\ncapital. commending Kia's vehicle\nmanufacturing impact to the state.\nRecognizing commending the Lambert High\nSchool girls golf program for its\nsustained excellence, championship\nrecord, and contributions to high school\nathletics. Honoring the accomplishments\nof Georgia Wildlife Federation.\nRecognizing Athena Yo, 2026 GHSA Class\n7A Girls Golf Individual State Champion.\nRecognizing and commending the Lambert\nHigh School's Girl Golf Team for winning\nthe 2025 Girl High School Association\nClass 6A Girls Golf State Championship.\nCommending the Professional Association\nof Georgia Educators and recognizing\nPaige Day on Capitol Hill. Commending\nGrace Lee upon winning the spring 2025\ngirls golf championship.\nRecognizing and honoring Older\nAtlantans's Day at the Capitol.\nRecognizing February 12th, 2026 is New\nAmericans Day at the state capital.\nRecognizing Family and Consumer Sciences\nand recognizing commending Liberty\nMinistries Family Worship on its\noccasion of its 25th anniversary and for\nother purposes. That completes the\nreading of the privilege resolutions.\n>> Thank you, Mr. Clerk. Is any objection\nto adopting the privilege resolutions?\nHearing none, the resolutions are\nadopted. All right, we're ready for some\nannouncements. So, um, maybe something\nyou want to hear here.\nChairman Scoggins\nrecognized for an announcement.\n>> Thank you, Mr. Speaker. Special rules\nwill meet today at 2:00 and 5:15. Thank\nyou.\n>> 2:00 5:15. Representative Gamble.\nChairman Parsons recognized for an\nannouncement.\nThank you. A reminder that energy,\nutilities, and telecommunications will\nmeet today at 300 PM in room 403 of the\ncapital. Thank you.\n>> Chairman Williamson\nrecognized for an announcement.\n>> Thank you, Mr. Speaker. The majority\ncaucus will have a lunch at noon in room\n403. Thank you.\nChairman Gunther\nrecognized for an announcement.\n>> Thank you, Mr. Speaker. Uh, tomorrow at\nbreakfast, uh, let's see, it's it's on\nyour little cookie here. Uh, the\nmagistrates are providing breakfast in\nroom 216. And then later at lunch, the\nprobate courts will be in 216 also\nproviding a lunch for us. So, keep that\nin mind.\n>> Chairman Dicki\nrecognized for an announcement.\n>> Thank you, Mr. Chairman and colleagues.\nIn the morning, 8:00, Agricultural and\nConsumer Affairs Committee meeting 606\nLB 8:00 in the morning. Thank you.\nRepresentative Rhonda Taylor.\nRepresentative Taylor is recognized for\nannouncement.\n>> Thank you, Mr. Speaker. Um the women's\nlegislative caucus will meet at 100 p.m.\ntoday in room 510 clo. Please come. We\nhave some important things to discuss\nand we will have lunch. Thank you, Mr.\nSpeaker.\nRepresentative Gamble,\n>> take your time. You're good. Gentleman\nhas an announcement.\nThank you, speaker. Tomorrow morning,\nthe fellowship will meet at 700 a.m. in\nthe House Judiciary Committee. I think\nyou'll all be blessed if you come. And I\nbelieve that uh Representative Vance\nSmith is going to share with us in the\nmorning. So y'all come and enjoy\nfellowship in the morning at 7 a.m.\nHey, we have a birthday.\nShe's 21.\nRepresentative Yasmin Neil has a\nbirthday. Yay.\nHappy birthday, Yasmin.\nY'all, we are we have some pages today.\nY'all check it out. I think you all know\nif you have one or not, but check it\nout. If you'll join us down front, we'll\ntake some page photos. That completes\nour announcements. Majority leader of\nthis house is recognized for a motion.\n>> Thank you, Mr. Speaker. I move that this\nhouse stand adjourned until 10:00 a.m.\non Wednesday, February 11th, 2026.\n>> Thank you, leader. On the motion of the\nmajority leader that this house stands\najourned.",
  "updated_at": "2026-02-14T14:44:55.292447+00:00"
}