{
  "video_id": "QO-puD9OCDc",
  "url": "https://www.youtube.com/watch?v=QO-puD9OCDc",
  "title": "11/2/2023 Senate Committee on Public Safety | Subcommittee on Fulton County Jail",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 185,
  "summary": "Overview:\n- This was a Georgia Senate Committee on Public Safety | Subcommittee on Fulton County Jail session focused on understanding the operations and responsibilities related to county jails in Georgia.\n\nKey Actions:\n- No bills were passed or referred during this session.\n\nBills Introduced (First Reading):\n- None detected\n\nNotable Moments:\n- The session began with an opening prayer led by Senator Chuck Payne.\n- Introductions were made by the committee members, highlighting their relevant backgrounds and experience.\n- Chairman John Albers emphasized that this would be an educational process to better understand the various entities responsible for managing county jails.\n- The Georgia Sheriffs' Association was the first presenter, with Executive Director Terry Norris providing an overview of the role of the sheriff's office in county jail operations.\n\nVotes:\n- No recorded votes were taken.\n\nAttendance:\n- A quorum of the committee members was present.\n\nAdjournment:\n- The session adjourned, with the chairman indicating there would be multiple committee meetings on this topic moving forward.",
  "transcript": "you you you standing on the ... county jail we do I would love to ask Senator Chuck Payne if he would open this meeting with a prayer. Absolutely. That's right. Let us pray. I have a father who come to you today, Lord, and we just thank you for all of our many blessings first and foremost. Let us think, take nothing for granted, Lord, for every breath we take as a blessing from you, Lord, which is ask you to lead us and God us and all that we do and all our deliberations here today that you be served and all that we do. First in Jesus' name, I pray. Amen. Okay. I think the best way for us to start out this morning is with introductions of the committee members. And I'd like to start to my left with Senator Brian Strickland. If we could each tell him our district and a little bit about our professional background as far as the reason that the individuals were placed on this committee was because of unique skillset, unique talents, and other parts that we feel would be a value to this type of study. So we'll start with Senator Strickland. Brian Strickland, I represent St. District 17, which includes portions of Henry, Newton, Morgan, and Walton counties. And I've practiced law for a living in my full-time gig, which I'm assuming is my special skill that puts me on this committee. I mostly do civil litigation work and I've farmed it as a little bit of everything, including some criminal work and other areas of law as well. So looking forward to learning more about these issues and hopefully I'm kind of with some solutions as a group here. Mike Dugan, I'm the Senator for the 30th District. I represent Carol, Haroldson, Douglas, and Paulton counties. So just west of here, Goddard, Alabama, come back a little bit and that's my area. I am retired military and now I'm work for construction. We build everything from hospitals, hotels, schools, and prisons. Good morning, John Albers, Senator for the 56th District, Fulton County, Cobb County, and Cherokee County. I live in Fulton County. Chair of Public Safety for the Senate as well as served in public safety for the last 33 years. I'm Chuck Payne. I represent the 54th District in Georgia and that which is Whitfield, Murray and Gordon counties. For 30 years prior to that, I was a state juvenile probation officer and prior to that, I worked in detention facility for six years as a correctional officer in the RYDC. That's good to be here. Thank you, Mr. Chairman. I'm Jason Antivatar. I represent the 31st Senate District, Paulton County and just here to listen, learn and look forward to the solutions that come about. Thank you, Mr. Chairman. I am a state Senator Randy Robertson. I represent the 29th District which is Muscogee, Harris, Maryweather, and Troop counties. Even over 30 years of my life in law enforcement work for a large sheriff's office for that entire career. Start out the age of 22 in the Muscogee County jail, which aged me well. Every aspect of law enforcement throughout my career, but I will tell you, the most rewarding portion of that was the time I spent in the Muscogee County jail. A lot of friendships and learn more about society as a whole. Locked inside those four walls for the years that I was held there. There has been, since the announcement of the study committee and I do want to point out Allison and Anna to my left, they are the administrative assistants who actually brought all of this together for us today. And I can't thank them enough for the hard work they did. But since the time that Chairman Albers announced this subcommittee was going to come together, we have been inundated with calls of individuals and organizations and special interest groups that wanted to come and speak before this committee. And at some point, everybody that wants to will be given that opportunity. But this will not be a political podium for anyone to come and speak about what their beliefs are. What this is, my intent is this to be an educational process so that all of us on this committee have a better understanding of what the county jail is, who's responsible for the county jail, which I'll say right now. The county is responsible for funding. The sheriff is responsible for managing. The district attorney is responsible for moving cases in a timely manner and in out of the jail and the judiciary is responsible for adjudicating those cases according to state, federal and local laws. And so we'll be looking at all four of those parts of running a county jail. And so we're going to be meticulous. I can't tell you right now today how many committee meetings that there are going to be, but I will tell you there will be quite a few. And we'll be digging deep into each one of the issues that come up. And hopefully, when this is over, we'll be able to submit a comprehensive report to the full public safety committee that is chaired by Senator John Albers. And hopefully offer some solutions or recommendations to the full committee to consider. The Fulton County government will be fully engaged in this hearing, in these hearings, along with all other aspects that are responsible for managing the Fulton County jail. If there, we just had Senator Halpern show up, so we'll give her an opportunity. What Michael Young, Senator Halpern? If you'll do me a favor and introduce yourself, talk about your district and what your professional experience is. Good morning. Glad to be here with you all. Sorry to be a little late, Mr. Chairman. I am Senator Sonia Halpern. I represent District 39, which is fully in Fulton County and runs through the five cities of Atlanta, College Park, City of South Fulton, East Point and Union City. I am also the chair of the Fulton County delegation here in the Senate. And my background includes business, not for profit. And now the Senate, which I am glad to be part of. Thank you, Senator. Okay, our first presenters today will be from the Georgia Sheriff's Association. So I'd like to ask the gentleman that will be representing the Georgia Sheriff's Association. If you all come up and sit at the witness mics, I do want to point out that this hearing is live streamed by Senate press. And so anyone that is outside of this building that you think should be aware of what's going on, I would encourage you to have them go to the website and start watching the meeting. And Georgia Sheriff's Association. Yes, yes, please. I want you to be as comfortable as possible because as you know, we're allocating each group 60 minutes in the presentation to include questions. What mics do you see? Three and two? Three and two. Three and two. Yes sir. Yes sir. Thank you, Mr. Chairman, members of this committee. I'm Terry Norris. I'm Executive Director of the Georgia Sheriff's Association. With me, I have Bill Hallsworth, who is our long-time jail expert. Also in training and operational technical support for jails. And in our background, we have Shelley Daniel, who is with our research side that is involved with our newly established or revised county jail report, which reports data from all, hopefully all 142 active county jails. And next to Shelley is Mike Mitchell. Some of you all know he darkens the door down here with us during the session. He is our governmental affairs and legislative person. Shelley and Bill are here to answer any questions that you may have concerning jails in the way we're reporting on jails and watching jails. Bill, as I said, will be our primary spokesman on the operations of jails and who won't win and how of county jails. But before I ask Bill to start, if you'll indulge me just a minute, not to be too elementary in my explanation or my discussion about the office of sheriff in general, oftentimes find in my soon to be 42nd year of coming to the state capital that what we know every day to be accurate and truthful and understandable about the office of sheriff, sometimes our friends in the general assembly don't hear it all the time. So I'd like to take just a minute to talk about the office of sheriff. And I will do that very succinctly. I hope very quickly. But as you all know, sheriffs are constitutionally elected officers. They elected every four years and next year they'll be all running. So we anticipate Chairman Albers will be asking you for some training money for our newly elected sheriffs. We expect up to 40 new sheriffs next year. We've identified about 18 now who we do not think will run again. So that is a big issue for us. We have to train these sheriffs and state law requires that we pay a minimum salary while they're in sheriffs elect training. So they run every four years. They are independent from county government except for the budget. They are locally elected constitutional officers. They hold an office. And it's very difficult for me to even explain that to some sheriffs, they are not departments of county government. They are totally independent office. As I said, the county governing authorities are responsible for funding the office of sheriff as they do with the clerks, tax commissioners and probate judges who are also constitutional officers. But these people, we highly encourage them to get along with our county governing authorities and other local officials. But they are totally independent from that county governing authority except for the funding. The other big point I'd like to make is, and Chairman Robertson said this, county governing authorities are responsible for funding the sheriff's office. And the jail is the biggest part of sheriff's offices. It's the biggest high-slot building area. It's the biggest cost. And in fairness to county governing authorities, if you'll envision a pie chart of revenue in a county where there's a jail and a sheriff's office, of course, a big chunk of that pie, they really have no discretion over. They have to fund the jail. They have to fund the sheriff's office. So at home in counties, many times, there is confusion and there is concern between county governing authorities and sheriff's offices on the cost of their operations. So jail is highly expensive. Bill Hall's worth a talk about this a little bit. And in our case right now, due to a lot of factors, some of which had to do with criminal justice reform over the years, we're seeing more and more increasing numbers of inmates and county jails who had been released on probation. Terry, real quick, I hate to interrupt you. And Bill might be going to talk about it. Are you going to talk about the impact of criminal justice reform? A little bit. What we're talking about is the criminal justice reform that was passed pre-2019, right? Yes. Under Governor Deals office. Yes, yes. Okay, so I just make the point that a lot of these people, and we will know more about how many of these people we're talking about, many of these people are on probation. And they were given the probation and many people should be on probation, but there are a lot of people too that simply cannot function in the free society on probation. So what is happening there is, and we will have more of this, I hope, for a later meeting to talk more specifically about who's in county jails. But in years past, I'll go back a few years. In the early years of my career with Sheriff starting in about 1995, we always worried about the inmate, state inmate backlog in county jails. And Georgia Law says that if you're sentenced to prison, then you've got to trial, you get your sentence, and the State Department of Crations has 15 days. After 15 days has to assume that sentence in package and know about that inmate and return some funding back to the county. It's not the sheriff, but the counties. And that had got a little bit confused over the years because I think really, and we're going to try to do this for y'all. We're going to try to help you identify who these state inmates really are because they're new categories. These probationers are one example of that. So I won't build to kind of lead into this. We spend a little time. He's going to go over some bullet points and we're going to talk about these things, but know this. A lot of the problem we have in county jails has to do with these other inmates that shouldn't be in a county jail. But nobody should be sentenced to a county jail. They are being sentenced to county jails. Either as being sentenced as misdemeanor offenders and judges are putting them in county jails, or there are felony offenders who have either served, been detained in county jails for a lengthy period of time, prior to going to trial. There's not much time left on the sentence they're given, so they just stay in the county jail. So we're happening here, and this affects all of us. We're all local property taxpayers. And we're paying for the cost of inmates that ought to be in a state prison system, or at least somewhere else who are languishing in county jails. And if you think about it, and Bill may have some information on this, I don't know. The cost of housing in an inmate in the county jail varies to some extent based on the jail, based on a few factors. But it's not just food and clothing. It's the medical expenses, and we're being absolutely inundated with increasing cost related to medical and mental health cases. We could go on and on kind of jumping around on certain points. We've got people in county jails that have been evaluated for mental competency, who have been committed to the state hospital system, having no beds there. A lot of these people are staying in county jails. They're not competent to stand trial. They're not competent, really, to live in free society. And they should be in a hospital somewhere. There's not so many of those cases, but it is highly disturbing to the sheriffs, who most of these sheriffs do not have any kind of robust mental health response. They have some, and their medical providers provide some. But if you've got someone that's severely mentally ill that can't control bodily functions, cannot control their behavior, and they soil themselves and cells. And these jail officers have to go in and restrain these folks who are sick, who do not need to be in a county jail, have to restrain them, get them out, clean them up, clean the cell setting up, put them back in there, only to have the same situation to happen sometimes two and three times daily. So that is not overly common, but it does happen. And these are the kind of folks. And one example of the kind of folks that ought not to be in a county jail, along with a lot of these state inmates. So you all know this. It's amazing to me though. I hear our friends in the media and I hear even some of us say they've been sentenced to jail. Now sometimes today they are sentenced to jail, but primarily jails are pretrial, facilitates to whole people awaiting trial. They were never envisioned to be an institution to house those already convicted. I'd like to call on Bill Halsworth now. If you don't mind, I think you'll enjoy his conversation. Bill, if you'll give us one quick second, I just want to say to committee members, as the testimony goes on, if you have any questions, please hit your buttons and we can ask questions throughout out. I don't want to say everything to the end especially if there's something pertinent. So I don't think the buttons are working unfortunately. Terry, always great to see you. Thank you for your leadership and the great partnership we have working together on so many important public safety issues from the sheriffs. We brought this up both myself and Chairman Robertson and I'm glad for us to rearticulate the people, the difference between a jail and a prison. And while we hope in the future that does not happen or happens less for someone being sentenced there, most of the people that are in a jail are in the process of our government which is innocent until proven guilty because they have not been tried by the front of a jury there appears. They have not been sentenced up to prison and I think that's part of the heightened awareness and we need to really delineate and make sure part of this education process is this is over here, this is a jail, right? This is over here and this is a prison. Very different things that we're talking about and why this is so important. And if I may you're absolutely correct about that, there are constitutional rights of the pre-synist individuals than the others that are in state prison system so you're correct. And Bill may talk about this, there's a lot about design, there's a lot about staffing, there's a lot about rights that these folks that have not yet been convicted have that those that have been convicted do not have. Thank you. Thanks. Thank you. Mr. Chair. Thank you. Terry, we hear different statistics about the number of people in our jails that have mental illness or addictive disease. Do we have any data that you all have collected that will say the percentage of inmates that have some sort of mental illness and probably maybe more importantly what you described a minute ago, someone that we might say is severely mental ill, they can't function. How many people we have that in our county jails that meet that criteria? Well, if I may go back just a minute to answer that question, four years, the Department of Community Affairs assimilated a monthly jail report. And that monthly jail report was very Spartan, it was very simple. It did not collect this type of data or information. What he did do is he share us, we're able to report one day of the week, excuse me, one, a snapshot of who was in the county jail. We always looked at that report, the JJ looked at it, corrections looked at it, prosecutors looked at it, and it did not give a lot of information. Several months ago, the Department of Community Affairs chose to discontinue that report. Some of you actually call me about that report and I said immediately to y'all we're going to do it and we are doing it. The problem with collecting data out of jails is there's a number of different software providers for that jail management system. So we are working for those interfaces now. Shelley, would you like to answer, do you have any thoughts about the mental health question that Senator had, do you have something you could add to that? Yes, so we don't have to. Come up to Mike Warren right here, please, Shelley. Just pull that mic over towards you so we can hear you. So yes, we don't have that data right now, but that is an area that we have been discussing of starting to collect, how many are sitting in the county jails that do have mental health issues and especially those that are waiting for a evaluation. So that is going to be part of the new transition that we're doing. So there should be that and much more that you all are going to be vastly interested in we think. Senator Payne. How many on average 1013s and makes do we have a 1013 or have had a 1013? So we are, we do have a mental health transport database right now that we started about 2015 that we've been collecting information on the number of transports that are being made. But specifically how many 1013s are coming out of the jail setting, we don't have that data at this time. Look, one of the things that up top, you know, some of my shares, but you know, you have somebody with 1013, they commit a crime because they're a mental health case and with the hospital or wherever and then once they go to the jail, the 1013 goes away. Is that customary? I don't think it's customary or I don't think it happens to frequency. In fact, a lot of people do get 1013 or a judicial order, which has the same effect as a 1013. You know, 1013s of physicians or someone that you all have defined as a physician, as a certificate saying take this person for evaluation. A lot of times in the jail setting, we see 1013s, but we also see a lot of judicial orders out of probate court. So it, a lot of times depends on where or if there is a bed somewhere for those folks to be evaluated, which is a whole nother discussion that we're all involved in as well. And I think another, and I think to Chairman Strickland's question is since, for the past 15 years at least, there's been a big focus on mental health going into county jails in prisons throughout the country. And one of the issues that we've run into and Bill, great, not from wrong, but is we define what a mental health issue is because we have a lot of individuals that come into the county jail system that are taking medications for depression and things of that nature that fall into that category in certain studies all the way up to individuals with full-brown schizophrenia and other issues. And so what we've had a lot of states try to do is parse out severe mental illness from other with mental health concerns. And so when you start looking around the country looking for numbers, typically you'll find numbers in the 60 percentile group of people in jails, but when you get down into the weeds where that you'll find up into the 80s of individuals, which is something that Terry alluded to with the size of health care contracts now that sheriffs are having to sign individual sheriffs offices signing contracts and also with fully-blown pharmacies inside of jails, pharmacies that carry medications. In some cases that you can't get at CVS or other places because of how dangerous they are and would be in the free world setting. With that being said, Bill, if you want to answer the senator's question and go ahead and start your presentation, after you identify yourself, please sir. Bill Hallsworth of the Georgia Sheriff's Association, I'm the director of jail and court services. One of the issues with the 10th or 13th, they come to jail, the 10th or 13th only valid for seven days anyway. If they're not able to make bond within that, or post bail within those seven days, then they were still in the custody of the sheriff. The other issue, I had an issue yesterday. In fact, South Georgia County called me and they said that they had had a 10th or 13th issued and the deputy went to the doctor's office and picked this lady up and took her to the hospital. The 10th or 13th was the takeer to the hospital. He took her to the hospital and in the emergency room before they could even really do anything with her, she started getting violent and disruptive. They couldn't do anything with her. The deputy arrested her for creating a turmoil because he didn't know what else to do with her. She was disruptive. She posed a hazard to other folks there at the hospital so she wound up at the jail for disorderly conduct, a county ordinance disorderly conduct. The family was there within probably an hour ready to post bail and he was like, what do I do? I said, well, state law says if they have bail and they can make bail, they got to be allowed to make bail. He said, well, what do I do with her then? And I said, well, you still got a 10th or 13th so you can take her back to the hospital. But you know, that's one of those things that you go back to the hospital and we do this thing all over again. And so the 10th or 13th is only valid for seven days. So if you can't get them to a point or to a place where they don't pose a hazard to other people when they become disruptive like that, it's just, I mean, they can actually, depending on the offense that they commit, they could be in jail for a while. So it's not so much that it goes away, it's that what do you do with them? Where do you take them? If they're violent and the folks at the hospital don't want to do it, they're the folks that are visiting the hospital don't want to be around her. She poses a public safety hazard. What do you do with her? So I digress a little bit, but I mean, that's the, to me, that kind of goes to the Senator's question. So, I kind of wanted to start out with just a brief historical look at how we got to where we are today with the jails. Jails have been around for thousands of years. You see, reference to jails in the Bible. I mean, that's how long it's been around. And historically, jails were never used as a form of punishment. Jails were always a holding place for people that were awaiting punishment. Punishment was death. It was some kind of form of corporal punishment. It was exile. It was banishment. But it was never incarceration. And incarceration was just, you were just waiting. It was a holding pattern. It wasn't until the late 1700s that society started, same, we'll wait a minute. We can start using incarceration as its own form.\n\nof punishment. And that's when the concept of prisons as opposed to jails evolved and prisons were built so that people could be held after they had been deemed guilty and needed punishment. And their punishment was it didn't rise to the level of death as very realizing you know we're killing folk for kind of minor stuff. We're beating folks down for kind of minor stuff. Maybe we can just hold them in custody for a while and allow them to become penitent. There was a particular prison where they believed that if somebody was in solitary confinement and they were allowed to be there with their Bible and reflect on the air of their ways and reflect on their God that they would resolve their propensity for breaking the rules and become productive citizens again. Since then we have found out that prolonged solitary confinement actually can generate a form of mental illness. So we you know we try to stay away from that. But anyway that's how the concept of prisons came about and that wasn't until the late 1700s but jails have since then and still are a place for confinement prior to adjudication. And now in Georgia waiting to be sent to a state operated facility if they are convicted of a felony. But right now your county jails are housing all kinds of folks. A lot of them have been have created previous offenses and now they're back in jail because they were in probation and and like Terry alluded to some folks just don't do well on a loosely super even you know well I don't want to say loosely but just a supervised existence out in society they need something more restrictive because they just they're not able to make they're they're not able or unwilling to make good decisions that would allow them to to remain in the public without creating problems for other people. And that's how they wind up in jail because they have created a problem for somebody else. So they've been to court they've been convicted of a felony or misdemeanor but they're still in your county jails waiting to go someplace else. So Terry also alluded to criminal justice reform. We've seen we're seeing higher numbers of people in jails that are already on probation and they don't come back to jail for just a violation of that probation. They come back to jail for committing a subsequent offense. Some folks just don't want to do the right thing. Some folks aren't able and their and their brains to to make good decisions to do the right thing. A lot of folks they want to get they just want to get by or they want to get over. And so they wind up in jail. They wind up being arrested. They wind up on probation because we do want to give them a second chance. But now we've got people in jail that have had their second third, fourth and fifth chance. And they're still on probation and they're still coming back to jail. And those are some of the kinds of folks that that the jail officers are dealing with. These are folks that don't want to follow the rules. I don't know of anybody that went to jail for having good manners. So it's just these are folks that are anti-social. They are they just have a hard time getting along with other people and following rules for the most part. I'm not going to say all of them because that wouldn't be fair either. But a large majority of them are I don't know that we had any hard figures when I was assistant jail commander at the DeCab County jail. But our our thought process was that about 80% of our population were folks that were I'm sorry let me backtrack. 20% of our population was committing 80% of the crime. So you have these folks that are just constantly constantly coming coming back in. And those are the those are the folks that I think are taking advantage of the opportunity to make probation. They they jump through the hoops. They convince folks that give me this chance. I'll be a change man and here we go again. All right. Let's see. Look at that's good. So going back to to jails in Georgia. The jail jail was operated by the sheriff in England prior to colonization of Georgia. And James Erard Oglethorpe brought with him the English common law and he brought with him the officer sheriff and he brought with him the concept of the jail. And the office of sheriff in Georgia has retained all of those duties and responsibilities that were established under English common law. And they've been given additional duties and responsibilities and obligations by previous acts of the legislature. So but they still retain a lot of those responsibilities that were in English common law. There was actually a case L.A.V. camp that points that out makes that that that's strong point. So like Sher it like Terry said we have sheriffs in 159 counties. All of them are elected for four year terms. 142 of them actually operate county jails right now. The those that don't operate a county jail have to pay typically pay another jail to house their county inmates. And it's a lot of it is a financial decision as to whether or not it's less expensive to pay to house out or if it's less expensive to construct a jail, staff a jail, pay for the operation of a jail. So that's that's one of the considerations of that. Can you provide us with 17 that don't have their own jail? The name of those counties. Not right now it's not a tell. Yes, yes. Right this minute. Yes, we we can certainly do that. Yes sir. We can say I got you and and most of those counties are smaller counties too. So yeah. Yeah that was just test bill and you failed. It wouldn't be the first one. That's open. No worries at all. I appreciate your asking. All right so one of the authorities that the legislature has given the sheriff is the ability to to point assistant jailers to help in the operation of the jail. And that closely ties or actually makes the jail really a fundamental aspect or fundamental component of the law enforcement function of the office of sheriff. When people are arrested they got to do something with them. So what do they do? They put them in the jail. That is part of the law enforcement function. And it's important to remember that jails really are little there are many cities. They're like a microcosm of a city because they have their own utilities. They have their own services such as health services and sanitation services. They have their own police force which are the jail officers. The jail officers are the ones that are responding to fights, crimes and any kind of disorder within the facility. They are the first responders. They not only provide a law enforcement function but they also provide a rescue function or a first aid function until somebody else from the outside can get there. But these guys and ladies they really are law enforcement officers because they're handling law enforcement duties inside of a jail. They're responding to crimes committed in the jail. You know one inmate to against another. So they're not only dealing with those that are pure purely criminal at heart but they're also dealing with those that just cannot function in society whether it's due to some sort of mental illness. Perhaps they've got some sort of drug addiction or something that just doesn't allow them to cope well in society. And we've got these jail officers trying to take care of them and they're not trained as mental health workers. They're not trained as doctors or nurses. They're not really trained as paramedics. They are just law enforcement officers and we put a huge demand on them and I say we, I mean society, our profession, the courts put a huge demand on what they expect jail officers to be able to do. And I can tell you I was an active law enforcement 30 years before going to work for the Sheriff's Association and 12 of those years was working in the jail at various levels, jail officer, supervisor, commander, whatever. So you get to see all of these things at different levels and it is the hardest job in law enforcement. It's nasty, it's dirty. You're dealing with people that have their smearing feces all over the walls. They're throwing that, they're throwing urine on jail officers and jail officers have to exercise incredible amounts of restraint. And one of the reasons they have to do that is the Supreme Court said you can't whip somebody's backside because they threw urine on you. So there's a whole lot of stress, a whole lot of frustration and very little appreciation from much of anybody outside of the sheriff's office for what these jail officers have to go through. So I just, I'll get off my soapbox but I'm very and they also, yes, Terry, they also are the lowest paid in law enforcement. And it's hard to keep when they're when they're underappreciated and they're under they're underpaid and you have all of these expectations and demands put on you. It's hard to keep good people. Nobody, you know, there are there are some folks that are happy and God bless them. They're happy to work in a jail for their whole career. But most of the folks that go to work in a jail, what do they want to do? They want to get out on patrol because that's where all the quote unquote glamour is. That's where all the excitement is. That's where people, except for the criminals, that's where people are happy to see you. But in the jail, when everybody's a criminal and nobody happy to see you. So they, I mean, that is the toughest beat anywhere because it is nothing but criminals in there. And it is also the highest liability area of any part of a sheriff's office. Some of the most you would think innocuous type decisions that a jail officer makes and they make them, they make them on a routine basis. They make them hourly. They can have, they can have an incredible liability implications. For instance, somebody asks for their Bible and something happens and the officer doesn't get a chance right away to do it. And then everything's happened and then the officer forgets about the request. Well, next thing you know, we have a lawsuit in federal court because we're denying this person their ability to exercise their, their right to practice their religion. So that's why I say, you know, real quick, is that a hypothetical or is that an actual case? There have been cases where where people have gotten in trouble for that. Yes, or there are cases where people have been denied a kosher meal. And there's been, I mean, the jails have had to pay out big money over that. I just wanted to point that out because a lot of times people will come up and they will tell us third, third hand stories and things like this because I know during Ramadan, we had to change our meal schedule at large jail because we had to feed after a certain time. We're normally, we would serve at a different time. And then we had kosher, those, those that were, were Jewish, we had to have kosher meals. And we had to do that and stay within the caloric intake that was required that every inmate had to get so many calories a day. And then, of course, we got into the special needs meals, which were everything from dealing with diabetics to other individuals that had to have certain meals because of certain medication and things of that nature. So I just wanted to make sure that as you talk about the liability side that we're talking about real world liability and not just something that was on law and order one night that was solved in 45 minutes plus commercials. So I saw someone make sure. I pray and another example is Muslim females and their hudjibs. When you take a mug shot, they can't wear those. And if you ask them, if you don't realize that there's a male officer standing over here and you ask her to take that off, that's a big deal. And that's, that's probably going to wind up in a lawsuit and it has wound up in a lawsuit. So there's all kinds of concerns. Like I said, things that just who would think when you get by taking a mug shot, let me make sure that, you know, there's nobody else around because in larger jails, there's always activity going on around that booking area always. So it's difficult. There's just it's that whole the liability for for jail officers is just it's incredible. And the liability for sheriff's operating the jail that that is their biggest their biggest concern. Or it should be it needs to be their biggest concern because that's where most of their litigation is going to come from. It's from that jail. So the jail officers also their their training is established and controlled. Their status as a jail officer, their certification is all supervised and managed by the Georgia Post Council. So they are basically, I mean, they are pretty much peace officers, but their their their their beat is is the jail, but they are performing the role of peace officer within that jail. And as jails go, sheriffs are required, they're required to recruit, they're required to hire, train, try to retain jail officers and it's hard to do with again them being the lowest paid and the most under appreciated of any law enforcement function that that the sheriff provides. They'll require or is there any post certifications required for jail officers? Yes, sir. They have to be certified as a jail officer within six months of employment. Okay. And could you tell us the definition of a jail officer and a deputy sheriff? A jail officer is a person that is supervising inmates within a within a custodial setting. So would a would a deputy sheriff and a jail officer and some of these are rhetorical understand because we're all trying to understand would a deputy sheriff and a jail officer carry the same certifications? They do not jail officers don't have the power of arrest. Okay. So jail officers are not mandated. They do not go through the police academy. They do not go to the police academy. Okay. Do we have agencies in Georgia that have jail officers that are never given the opportunity? In other words, they are they are slotted as jail officers and they stay that their entire career or is there always a bridge where they can transition over qualify for the police academy and go the police academy. Therefore, opening that slot in the jail where they would bring a new hire in for that and promote if you the jail officer into a deputy's position. So even the the Metro Atlanta Metro area sheriff's offices where there's a police department, even those jails have or those sheriff's offices have deputies out on the street and yes there is a mechanism for a jail officer to be deputized and then go to the police academy or and get certified as a peace officer and go out they and they can still work in the jail or because that's the other thing you don't have to be you don't have to be a jail officer to work in a jail you can be a deputy sheriff and work in a jail. Right. A deputy sheriff can work in a jail but a jail officer can't work on the street would that be correct? Yes or that is correct. Okay and real quick and um our jail officers required as a deputy sheriff's required to get a minimum of 20 hours post training every year or jail officers required a continuation of post training each year. There is a law on the books that has been there for a long time but its effective date was only after funding was established for it. What year was that law established you know? That was back I want to say back in the 1990s. Okay. What was that what was that law state? It says it uh basically requires that jail officers received 20 hours of in-service training annually and that that would become effective once the legislature created funding for it. And it has never been funded? That is correct. Yes. Okay. Do you know the you know the citation for that law? I not off time. My head knows that I do not. Okay. Thank you. Miss ma'am Mr. Chairman I will say this Bill you correct me if I'm correct. There are a number of jails that require some in-service for the jailers not by law but by by need. And I will say this too the um the early years there was no requirement for jail training. That's correct. And the sheriff's and since my career started in 95 created that mandate where they had to get trained within six months. If you you probably remember about years ago even peace officers, deputy sheriff's police officers they had six months after taking office to go to mandate. That changed many years ago. I think we the sheriff would have difficulty making that code for the jail officers simply because they can't hire anybody. I mean in now the six months gives jail jail staff or sheriff's office's time to bring somebody in. What we're hearing now though is the newer younger people that are wanting to go to work in jails they're uncomfortable going in that jail setting and rightfully so without some sort of advanced training. So we're seeing now the need for us to provide jail training earlier in that hiring process. And in fact we do and build build overseas this we do 15 or so basic jail courses which is a two week course throughout the state every year. The public safety trainer's training center does some as a few sheriff's offices that do it too. So we're doing I think as good as we can do internally on providing jail. So the Georgia Sheriff's Association provides two weeks of basic jail training for jail officers but it is not required that sheriff's offices send their jail officers through this course. It is the way it goes. I'll say the two week course is a requirement. Under state law. Yes sir. Okay. And so it doesn't the law doesn't specify which entity they receive the training but it has to be a post certified academy to to provide that. Is there is it pre hire or post hire? I assume it's post. It's post hire. Yes sir. Okay and how soon after they're hired are they required to attend this two week course. They have to complete it within six months. Okay. And Terry when I first got on you had 12 months before you had to go right to the academy course. I was a lot older than you. So. I'm going to say why sir. Okay. So. Have to remember that that sheriff's are required to take people into custody that have been brought to them for indietable offenses and it doesn't matter what other problems this individual might have. And in some jurisdictions state law even requires that people charge with ordinance violations also must be taken into the jail. And sheriff's are prohibited from not receiving somebody brought to them under those circumstances unless there is a need for immediate medical care for some sort of acute medical emergency or medical situation. And under that under that statute which is 442 412 the arresting agency at that point if the if the jail says you know you got to get them medically cleared first this guy's got some sort of medical issue. You know who knows what it would what it would be but something that requires an emergency medical treatment. So you have to take him to the emergency room him or her get them treated and then get them cleared by the medical of the emergency medical staff at the hospital and then bring them back and once you do that we will take them into custody. So Bill to clarify unless it's a medical emergency a sheriff cannot refuse to accept an individual who has been arrested for a violation of Georgia law federal warrant or in some cases you said I guess county and city ordinances. Right so the statute reads indietable offenses and then in I think it's OCGA 151610 counties with the larger populations and I forget what the breakdown is I want to say 750,000 people maybe they can also they also have to take those charges of violation of county ordinances. So if a sheriff's jail is overcrowded is that and is that a legal excuse that he or she can use for not accepting individuals under arrest. All right well let's let's talk about that a minute sheriff's have the authority to choose to house elsewhere inmates when they feel like that their jail is not a safe place for that inmate. Okay so if a municipal police department brings an individual charged with arm robbery to a county jail is the sheriff required to take that individual or does the sheriff and under the last thing you said the sheriff can't say I'm sorry I can't take that person but I have a contract with whatever county jail and you have to take them over there. No he would do the intake there and then make arrangements to have that inmate transported to that other place. Right so that by having a contract with another jail to handle his or her overflow that does not alleviate the sheriff from a requirement that he or she has to accept anybody that that rolls up in the back of a patrol car at their county jail is that true? Yes or that is true. Okay I just want to be clear on that that aspect now I understand if somebody brings somebody in on a Friday night they're so inebriated they cannot stand up that the sheriff's the jail has the right to refuse until that person is cleared medically because if the sheriff accepts that person then he or she accepts the liability associated with that person's condition and so say that person goes to because of where we're at that person goes to Grady they're checked out treated by staff at Grady they're given a clearance by Grady or they refuse treatment at Grady and then the officer holding that person in custody then takes them back to the jail then the sheriff can accept them correct? Yes or that's correct. Okay so somebody clear that overcrowding is not an excuse to refuse an inmate or a detainee correct? Thank you. What number? Four I'm sorry, let's chair. Let's pretend I've never been arrested and give me a minute. Okay. Okay let's go through the whole process. I've been arrested. Okay Take me from that point. All right so take you from the point where you arrive at the jail? Yes. Okay. All right so you you come to the jail with the arresting officer there will be somebody a jail officer or deputy sheriff somebody is going to look at the commitment paperwork whether it's a warrant or whatever that order that authorizes commitment is they're going to look at that and if everything's in order then they're going to accept custody of that individual unless they need a mercy medical treatment and then at that point if everything's in order yes or what it's not in order. But they can I throw a hypothetical out here? Yes sir. Let's say Senator Dugan is arrested for a warrant from another county okay he's brought to the back of the county jail. The deputy sheriff hands the paperwork or the police officer hands the paperwork to the deputy sheriff or jail officer standing there that that individual is now responsible for verifying that there actually is an outstanding warrant for Senator Dugan and another county and they can make the officer who's delivering him to the jail wait until they can verify that there is a legal warrant out there for him and so he would not be he would be on the property of the jail but he would not be a detainee in that jail until all that was clear correct. Right he would he would not be accepted or received into the jail until they had been able to verify that that the committee will play in this would even include if he was wanted for an outstanding warrant from outside of the state of Georgia say an outstanding warrant from California New York or maybe an old infraction in Italy or so.\n\nOr like that, we would have to be verified before the jail would take custody of him, correct? Yes, sir. Because if he were illegally taken into custody, unbeknownst to the sheriff who runs the jail, and he were to be injured or whatever in the jail, then that sheriff could be liable for whatever happened there. That's right. Yes, I've been verified. Okay. All right, so you've been verified. So we're going to, first we're going to make sure you don't have any weapons or any narcotics or any kind of contraband or anything that might be harmful to you, the staff or other inmates. We're going to make sure you don't have any of that on you. We're going to fingerprint you. We're going to take your mug shot. We're going to enter into our docket, whether it's one of those big red docket books that we used to use with hammers and chisels or whether it's done through computer, we're going to record all your demographic information. And then we're at, if you're unable, let's say that you do not have bail set at that point, then we are going to, after we've imitated all of your items and all your personal items and taking those from you, we're going to, imitated where you're clothing. We're going to take those from you. We're going to do a strict search. We're going to put you in a jail inmate uniform. And then you're going to sit in a holding cell until we can classify you and figure out which classification level you need to be housed in. Plus medical screen. Plus, yes. And there will be medical screening there too, just to make sure that, you know, we're going to, we're going to find out whether or not you've got to work your loveless or whether or not you're, you've got a history of mental illness or if you're own any kind of medication that we need to know about, that's going to be all part of that intake process. Because we don't want to, we don't want to put you back in a make population until we're certain that we know everything there is that we need to know about you. To keep you safe and keep you healthy and protect other people from you in case you're a violent individual or a predator, we use a classification system to try to separate the predators from the prey. Those that are more likely to be victimized, separated from those that are more likely to be victimizers. Okay. So I'm spent how much time in the holding cell now? What happens next? Okay. So, if you don't have bail posted and once we've done all that, then we'll, we'll make sure that you have a mattress and a blanket and we'll put you in a cell. Or how? Until we have an order to release you. So I go to trial. If you have bail set, so within, if you're arrested or warranted within 72 hours, the arresting officer is required to get you in front of a judge that's authorized to set bail and offer to set bail. And then if you're able to make bail, then you're released. But if you don't have bail, if the judge says no, I'm not granting you bail. And or you're not able to make bail once bail has been set, then you will stay in jail until court. You said 72 hours? Yes. Is that always hit 72 hours? It's actually in state law. It is. I'm going to find out. We do a lot of stuff that's not in state law, is it always hit 72 hours? It's, I don't know, well, from my experience, we never have one that stayed in jail longer than 72 hours before having that verification of that probable cause exists. Talk about war, miss. All right. So at one point in state law, there was a 48 hour requirement for those that were arrested without a warrant. And it goes back to a case out of Riverside, California, where a Supreme Court said 48 hours without having bail set was the maximum that they would say was acceptable. And we used to have a statute that said that. But when the laws that govern citizens and arrests were revamped, that statute went away. And there was nothing, nothing to replace it. So under state law right now, if you're arrested without a warrant, there's no requirement to get you in front of a judge within any sort of time period to determine whether or not probable cause is valid for you to be detained. Now there still is that Supreme Court decision, Riverside. So the jails would still have to do something with that. When I was at DeCab County, our magistrate court would write what we call, we just refer to it as a Riverside order. And the order was that within about 24 hours, if that individual hadn't gone to magistrate court yet to have bail set, they issued this Riverside order that if by such a date and time, they still hadn't got bail set, you need to, the jails authorized to release them. And Bill, wasn't it not long after that that a lot of the counties created menus, Supreme Court judges, where what charges that were normally not have a bail, they went ahead and pre-assess bail on violation of Georgia control sub-saxx schedule two, other things there when they came in, the jail would have a list there so that the majority of the cases that would not have bail would be those that only Supreme Court judges could set that usually involved extremely violent activities such as murder, rape, child molestation, some of those kind of charges would definitely require Supreme Court order. But those other felonies that used to, the judge would have to set the order, the judge would have had a pre-set so that we knew anybody that came in for possession of cocaine would have a, would have a bail set at $2,500. So there would, you would still get them to the hearing and the reason they went with a 72 was because not every jurisdiction had Saturday court. So if you got arrested on Friday, they wanted to make sure that they would, they would scoop in Monday there so they could get you into court on Monday if you didn't. But they alleviated a lot of those no bond problems by pre-assessing those bonds. Do you remember when that occurred in a, in a big jail like yours? Actually, we had, we had a schedule of pre-set bail amounts for like ordinances and we had one for misdemeanors but even a case like domestic violence, there wasn't, they still had to get in front of a judge because of special conditions. Where I was, where I worked, if the, if the judge was so inclined when the warrant was issued, he would, he would note the bond, the bail amount on the face of the warrant so that we didn't have that issue. But that, it still becomes problematic because if they're unable to make bail within that 72 hour period, you still have to get them in front of a judge. If they've been in custody for 72 hours, they have to be, they have to be before a judge. And when we say before a judge, we're talking about preliminary hearing, correct? It's kind of a committal type thing. It's really just a review to make sure that the judge agrees that yeah, there's enough probable cause. And, and the lowest amount of probable cause. Yes, right. Is so in other words, it's not where you present large amounts of evidence and whiteboard information. The judge and they're basically with the officer attesting to that the individual committed the violation, correct? There is some probable cause. Yes, minimal. Yeah. Okay. Okay. Well, what we're going to do is looking at time. George Sheriff Association, I spoke to, I keep on calling Dr. Norris from, from my time at Columbia State University, but told Terry and them they'll be involved throughout the process, but for us to stay on time, we're going to go ahead and stop at that. We're going to bring up the next expert. And if we will, I'm going to take five minutes. It's currently 1015. We'll start back at 1020 to give him an opportunity to come sit up. First, I want to tell this committee, we're eager to participate in this process. We have more information, more general information about jails. We didn't get into some of the stuff about design, cataloging, etc. We want to do that. We want to talk to you about our jail report. That could be later in some other subsequent meeting beyond this inquiry, but we want to do that. And we want you all to know, these are your jails. These are your people in jails. And one thing that Bill didn't mention, and I'd like to mention is we have a long history of helping Sheriff's understand the importance of managing jail populations and watching who's in jail and helping get the folks out of jail. This should not be there and that have a reasonable reason to be out and be, you know, non-beep productive. So we want to talk about that as well. Thank you, Terry. Representative from the Georgia Jail Association. Good morning. All right. If you do this favor, go ahead and introduce yourself. Give us a quick overview of your skill set and it's all yours. Thank you very much. Hello, my name is Tate McCotter. I'm the Executive Director for the National Institute for Jail Operations and the National Corrections and Detention Alliance. I was asked by the Georgia Jail Association to come in front of you and share whatever I could in this space. So I'm also a very proud new resident of Fayette County. So I moved my family up here about a year ago. Terry, if you give me one quick second. I do want to say something for the people watching and the individuals in the room and the committee members that at certain points during the testimony of different witnesses, there may be videos shown that could make individuals uncomfortable that contain profanity, that contain nudity, that contain examples of severe mental illness and other types of situations. So anybody who is not comfortable with that, I wanted to go ahead and let you know now so you can kind of manage how you watch this subcommittee hearing. One thing I can't do and those who know me, I appreciate y'all dealing with my frankness and everything is we cannot omit that type of information because that is the reality that is experienced in county jails. It's experienced in prisons and it's experienced in society as a whole today. And it's easy for us to sit in a room and talk about it and attempt to articulate what it looks like and what it sounds like. But I think the real, the only true way to understand it is to actually see it. And so anybody that has asked to come up and present or that we've reached out to to come and present, we have not tried to edit their testimony, their evidence or any of their resources at all because we want this to be a very clear and honest subcommittee hearing. So with that said, I appreciate it. And if any of this stuff comes up in any committee member or anybody in the room has to get up and leave, I completely understand but we cannot edit the testimony on something as important as what we're looking at now. Thank you, sir. Go ahead. You just saved my disclaimer. So I appreciate that sensitivity. Thank you very much. First of all, I just wanted to say how much I appreciate the format that this has been presented in. I've been involved in working with dozens of states when it comes to certain legislation or standard writing or whatever it might be when it comes to corrections and jails and prisons and often the very people that are most deeply involved, especially in the day to day operations of that are not always invited to the table. And so to hear George's shares, associations sit down and have you all just have them be here and express from their point of view where they're at, what they do and why they do what they do. I think it really matters and it's super important. I just said I haven't seen that all the time and I think that's a great place to start. So just a little bit just from my background which would maybe lead into what I'm probably going to talk about and share with you. I'm a proud military corrections brat. I don't know if that's a term but I'm going to use it. My father was 24 years military so we let a lot of bases here on the south. He was an MP and his last assignment he was a common on it and 11 worth military prison there. Following that, he was recruited by the governor of Texas to run their department of corrections in New Mexico and then Utah and then I could go on and on but I'm sharing all that with you to tell you. I grew up watching my dad get sued and seen a lot of weird things as a kid. My window would always space the back wall. I saw escapes. I'd see releases going back and forth all of the time back in DOC days. We'd see where the executions, all those would go on in the different meetings that were outside of the prisons. If you were to ask me in sixth grade I'd say my best friend was a class two trusty in mate that we would play football games in the Texas prison rodeo together. It was a different day. I think as we're going to talk about Jails and just wherever you're going to go with that, there is just so much that's under the hood. I think what most people think about when they hear Jail, unfortunately they think orange is the new black or 60 days in or it'll lock down or something that has been pushed out there on television for entertainment. Shawshank Redemption might be an interesting movie. I'm just going to tell you that's not what I have ever seen in hundreds of facilities that I've walked in. So if you're going to look under the hood I think it's good that you look under the hood and everywhere else in the car. I'm happy that you talked about the differences between Jails and prisons because they're not the same. They're very different. I think that was explained earlier so I'm not going to spend a lot of time on that. But it is I think significant that when a sheriff in Georgia who has statutory authority to run a jail and manage that jail, it's important to know that they don't get to pick who comes in. It's just one aspect and Senator you let off with it's one cog of this criminal justice wheel. Jails, they don't get to pick that. It was really interesting with COVID how much our dynamics changed all of a sudden it was like keep everybody out. We don't want anybody in the Petri dish. It's going to be unsafe in there and don't do anything. And certain people that used to be arrested then it was held off or it wasn't. And so it was just really interesting how some of those dynamics of who is arrested and who's brought in can change. With that respect it was mentioned you know these are people from our communities. These are individuals that represent our communities. I mean it's a snapshot. It's a slice of it. And while they might be extreme to some degree because they're not all as mentioned. They're not all boy scouts and girl scouts and they're not always following the rules. Not all of them but it's a very interesting population set. And then putting them all together. Wow. It's quite a challenge. So I think you had asked a question when what happens when I get when I get put in you know when I get booked into a jail. I think one of the most critical things that is often missed is when somebody comes into a facility that is the time that we know the very least about that individual. Okay. You talked about the difference between prisons and jails. Prisons get everything in a nice packaged bow. And what I mean by that is there's a file that goes with them and it's they've already gone through detox. They've already we've established what their medical history. I mean we've got something to work off of. We know there are offenses. We know what they when somebody comes in into into a jail even if they're repeat you know offenders. They could be in a different state of mind. There could be something different that was going on and we don't know those things. It's it's the time where we know the very least about that person.\n\nAnd all of a sudden we have to figure all of that out. And so that process, it's not just a booking process. I mean, we're asking officers to figure out as much information as they possibly can to keep that individual safe from harming themselves or from harming other people. And let's be honest, not all of them want to comply with that. You know, are you taking any drugs? How do you answer that? Are they going to say yes? Are they going to say no? What happens if they just swallow a whole bunch of baths? Are you going to use this against me? I'm not going to say anything. Or maybe they do. Maybe they don't. Are you suicidal? What happens if they are? Do you think they're going to tell you? I'm just throwing out some examples of it. This is tough. It's really tough. So when we start talking about managing a jail, and how all of that big picture looks, we need to run a constitutionally safe facility. Paramount. That's what we do. We need to run a safe, constitutionally safe facility. Now, that involves a lot of things. Balancing the rights of inmates. Against that safety and security concern. And there's times where that can be very difficult to manage. And I'll probably give you some examples of that, because I just don't want to say, yeah, we just need to balance this. It's a lot harder to do than just say. With that, I'll give you an example. Somebody brought up earlier, and I think Bill talked about it with religion, and the lawsuit about having a Bible. You know what? Honestly, those are the easier ones. Since I'm in Fayette County, and you've got Trill Studios right there, all these Marvel things. Do you know what the hot one is right now? Odinism. So we have individuals that are, Thor is my religion. They have a whole Bible to it. They want to act like Thor, be like Thor. Anything that you can imagine, and that is their sincerely held religious belief. I'm not making fun of that. I'm not telling you whether it's right or wrong. But now you have an individual that's asking for certain things. You know, that is incarcerated, and whether again, pre-trial convicted, they're asking, I need to have this or that. I want to have a diet that is strictly meat for my religion. And I want pistachios and I want vanilla ice cream. Do you give it to them? Or are you violating their rights? That's the kind of things we have. And that's just one of, I could go into another religion when where I got hit on, I was just working with a jail in Nebraska and they were telling me, have you heard of post-aparianism? Post-aparianism. Post-aparianism. You heard me right, post-aparianism. Post-aparianism. Post is a big part of it, but he wanted a coal-andered to wear on his head. He had a lot of other different things that he wanted to wear. This one also wanted to wear a pirate's costume, but they want to dictate religious diets that won't dictate. Give me a quick second since you brought that up. Okay, this is an actual case. Absolutely. And stood for $5 million to be agents. And this case was adjudicated? The judge finally said, this was actually didn't get it all the way to court, but they ended up dismissing this in summary judgment saying enough is enough. But that being said, the county had to invest. Absolutely. And I'm sure there were some very highly paid attorneys that handled that case for them, right? Absolutely. Thank you. Yeah. And I'm just touching a couple of examples, but there are legitimate, and it's easy to, you know, I'm going to give you examples that are far spin-offs, but most examples that we deal with on a daily basis are not. They're not sensational, I mean, these are not sensationalized things. These happen every day in our populations. So I don't want to make it sound like the things I'm bringing up are just crazy stuff that one off here and there. No, this happens frequently, frequently in the jails. So when it comes to, and a lot was mentioned earlier from the Georgia Sheriff's about liability and risk, I work with risk pools all over the country. And I will tell you that jails are the largest liability in county government, bar none, because it's not just like with law enforcement, okay, you get into high-speed chase, you might run over a mailbox, something happens, there's going to be some payout here or there or whatever. But when it comes to jail lawsuits, I can count 20 cases that they've, that payouts have been over $10 million. We're talking big money. This is a very emotional thing that we're talking about when we're getting into the space of incarceration. So when the risk pools have identified that jails are the largest liability in county government, why is that? Again, it's this balancing act that you have to figure out and what to do. And there are so many components that are, again, underneath this umbrella, that need to be talked about. Because if you're going to be looking at what's right and right to wrong, what should a county jail should be doing, what they shouldn't be doing, what do they need? I've got to know all of these things. From a liability standpoint, most of the lawsuits that are occurring are what we call 1983 lawsuits. All right. And I'm going to use some terms that if anybody has worked, real briefly, would you explain to them 1983? 1983, yeah, Section 1983 are lawsuits that really come down and I'll kind of give you a background on that. Section 1983. Yeah, but Section 1983 of, when you say a section, what are you talking about? This is federal, yeah, exactly. Thank you. Yes, federal rulings. So 1983 lawsuits are, if it is made as going to file and you hear, you violated my rights, a lot of times they will file a Section 1983. And under that, you're going to do a couple really important key words, deliberate indifference and duty to protect. Now, I can tie along with that. You're going to have failure to supervise, failure to train, some other issues and some of those you've already even brought up here. But those are really, really critical points as we talk about that. So with duty, so deliberate indifference and duty to protect, I'm kind of using that in my head to kind of set a platform, maybe for which you might want to work off of as you're doing this. Let's start with staffing. I don't know if I've ever seen a more perfect storm right now that, and what's brewing in our profession of corrections. And here's what I mean by that. It was mentioned the difficulty in hiring staff. Now, I can tell you one that is eat sleeps and drinks, the profession, it's very near and dear to me. I care about it. I care about what happens in it. I don't know if I would even recommend to my own children that they go into this profession. That's just something. Hiring is incredibly difficult right now. And we have seen so many agencies that have said, look, I can't find somebody to work on the street. And you mentioned the possibilities of, well, is there a pathway for somebody to move from corrections to the street? I don't know too many corrections officers. And if there's some in this room, we could pull them and ask. And I think they would laugh at me by saying this. How many of them grew up saying, you know what? Some day when I get older, I want to be a corrections officer. Said nobody ever. Nobody says that. If they're going to go into law enforcement, they want to hit the road. They want to catch the bad guy. FBI, whatever it is that they're going to do. But most people don't think, you know what? When you catch that bad guy, I want to take care of him. It's not there. So hiring staff right now is incredibly difficult. And most agencies that I talk to, I just got back from a conference in Indiana. And the number one hand that raised up, when I said, how many of you are short staffed? Every hand I could see one up. And a conference is of over hundreds and hundreds of agencies. And I said, let me ask a better question. How many of you are 90% staffed in the room? And two hands went up. This is a problem. But I mean hiring is one issue. And you deal with, okay, if you're not getting the applicants, there's big questions of why. Are we paying enough? Right? That's got to be an issue with that. But also, you know, can they pass a draw, you know, a background test? A drug test? There's all of these things that go with it. And then you move over from the hiring side of it with that challenge to retention. And the best way I could describe that is imagine going to work every day. And you remember the old show I'm going to date myself here, a fear factor? That's a lot what it's like to be in that environment. And every day, every day, every shift, those officers have to do that. So this is real. When they walk in, the very first day, they're usually told by somebody, somebody who's locked up there, you violated my rights. I'm going to sue you. By the way, I know you. I know your family. I'm coming after them. I'm watching you. The manipulation, the whatever else, it is an incredibly stressful job. And I want you to take that mindset and then put yourself where you're a new officer. You've just barely been hired and trained. And you're hearing all of this and you're going, what am I doing? And why am I here? And by the way, I'm 19 years old. We have some agencies now that can't hire and they're hiring 18 year olds. All right. I'm not going to give you a gun. We don't bring weapons into facilities. By the way, if you talk to most sheriffs and those that have worked in law enforcement, they will tell you the very best officers they have are the ones that came from the jail. Why? Because they know how to use this. Because they can't reach for a sidearm. They got to know how to talk to people. And those that have been in there for a while have become really good at it because they know it's a lot easier to talk somebody down to worry about to figure out how to deal with conflict management with this. Instead of just, let's go at it. So I talked about turn, no, no, I didn't. Now we get into turnover. Here's some of the problems that we're seeing in jails. Yeah, the hiring issue, which has then caused two shortages. We are operating in most jails across the country and what I call skeleton staffing. Now, most people know what that term means. But in a jail setting, it means you are operating at bare bones minimum enough to keep the facility. I'm going to say open. And our last weird because we're 24 seven and we can't close. But think about the necessities of what you must provide. And skeleton staffing cannot happen forever. Somebody's going to get hurt somewhere. Something is going to get messed. And I would bet most of our jails in this state. And I've been to a lot of jails in Georgia. Most of these tear is most of the jails in this state have been operating at skeleton staffing for quite some time. Thanks, question. Yeah, put number. Seven. Thank you. I just wanted to mean to stop your flow there. No. This is tremendously a helpful take. I'm wondering, and I know we've got some of our friends with the Georgia Sheriff Association. The report that used to be done by DCA that's coming together. I'm wondering if that data is being captured somewhere for those staffing levels. Do you know off top of your head? I don't. I don't know if that's going to be back to anymore. I think it's one of the take out ways from this meeting is as we try to assemble these different data points of, you know, what the capacity is. How many folks are there? How long they are there? You know, what's the breakdown of mental illness versus, you know, other type of pieces? This is an important component we need to understand. Thank you, Senator. And there are some that I can give you nationally. Okay. I don't certainly want to overstep with things that I don't know specific to your state. I'm going to do that number set. But you asked about mental illness. I'll just tell you, the stats are inclinating incredibly fast as they're coming through over the last 10 years. The latest that I have seen, they are saying, depending on the stats that are being pulled, anywhere from a seven out of 10 to eight out of 10 of those that are incarcerated, have some sort of mental illness. And also remember, this is a difficult number to define. And you asked like, you know, about specific numbers. Here's part of the problem with that. It's not just the jail management systems and not all of them having been on the same page. It's also the fact that many of those that are incarcerated that come in and are arrested have never been diagnosed. You know, you have somebody who's autistic. A lot of times they don't know that. Other people don't know that. But you're going to have to deal with that in the jail. And I'm not saying that that's a part of it. But of those that are mentally ill, they're saying 35 to 38% generally are SMI seriously mentally ill. By pullers gets a frenic, that kind of thing. What number? Three. On that same note, that was the question I was going to ask. I think Senator Albers really hit the nail in the head with what he framed the issue with data. You've identified how rough the environment is. And I think we've heard a lot of that this morning. But it sounds like most of that is the nature of how our system works. I guess when you look at what the solution is to make it better, I'm assuming part of that may be more pay. Maybe it's more training. You look at the issue of retention. How do we get people to stay in these jobs that are inherently so bad? Because I'm not sure if this committee is going to come up with a way to fix the system. So my question would be, when you look at Georgia versus other states, because you have expertise around the country, what are we doing differently here that makes it worse? And we look at retention is what's happening in Georgia unique nationally? Or is this a nationwide problem? Is there some state that's figured this out? Somewhere else we can look at? And I guess it goes back to what Chairman Albers says. Do we even have the data to know those answers? Data is limited and it's now that people are paying attention to this. It's getting better with the data. And I think we're going to see a lot of improvement to that regard. I'm thrilled that you asked that question. I'll bet every state that I've worked with, this is the number one issue. And we're talking about the mental yield part of it right now. And I'll just say the jails have become the dumping ground for the mental yield. And we can go back historically back to the Kennedy past, the deinstitutionalizations act, right? And that transitioned everything out of where we used to have state mental hospitals and all of those things going on. Got rid of that and said it needs to be handled in the communities. And so it was pushed back to that, but the problem was all of that money dried up. And so all of the stuff that was coming from the feds, you know, that used to go into the states to handle that. Now it's not there. So when somebody decides to strip down and run and down the street naked and gives a hug to grandma, and grandma goes arrest him right, right, understandably, you're going to put him in a jail, because where else do you put him? But to Senator Strickland's point, you go back to Kennedy, President Kennedy, you know, breaking up the mental health model that existed in the late 50s, early 60s, then you've got a certain personality working inside of a jail. We're not talking about a prison inside of a jail. What have we done beyond CIT training, crisis intervention training to prepare those individuals to work in that environment? And what do we do to make that a more attractive place to work, as opposed to wanting to go out and do, I think, what one of the other individuals referred to it as the sexy side of law enforcement, where they would want to go into the jail and deal with that particular population, knowing that there were mental health issues to the degree that you're discussing, to attack the short staffing problems, the retention problems that we're having right now. I mean, did we make a change when mental health became the issue in our county jails? And if not, are there any ideas out there around the country on how we make working in jails much more attractive as a profession? From what I have seen, are they trying absolutely? Is it enough? No, we're close. And I think they would all say, absolutely, and it's not a personal effort of, you know, participation award. And I'm talking about, they're trying, but also understand, and I'm thrilled with the question. What happens when training is one of the first things that is cut in the budget? Because it is. And if you're so short staff, tell me who you're going to pull out to go to training, because they're so skeleton-staffed, where are you going to get them from? We want you to stop escorting that guy or giving that guy food or passing meds or whatever you're doing, because we want you to go to training. You see where that's a problem. So number one is, we need to fix for staffing levels. Number two, when it comes to training, I think there can be some considerable things that can be done with that. But number one, it needs to be offered and available. They need to be available, and it needs to be offered. Now, the topics of training, I will say there was a lot of knee jerk reaction a number of years ago, and understood when it comes to de-escalation, right? And some other things that were kicked out. There was a lot of buzzwords where, in our space, we got to get people trained, right? We don't want people using force unnecessarily. And it should have never been the case. And let's be honest, every profession has some bad apples. We need to fix those. So let's not sugarcoat that. That needs to stop. Part of that is, let's have a better applicant pool so we can work on that. But when it comes to training, de-escalation, as a word, most people generally go straight into use of force with that one. You know, there's a use of force continuum. That's been a thing for a long time, right? How far do I go with this? How is this going to look? Most of the interaction that officers have with inmates, as I mentioned before, this is really important. Super important. And so, from a training perspective, that word de-escalation, I've seen some states mandate that people get de-escalation. You know what I would prefer to see? Conflict, conflict management resolution. Teaching individuals how to deal with conflict. Quite frankly, I think our entire society could use a little bit of that training. We don't know how to argue anymore. Everybody wants to disagree with each other. Now, I'm right, you're wrong, and I'm a thousand percent right, and you're wrong. And you will do it my way. If you're not, I'm going to take a pair of business, and I'm going to teach you that I'm right. But does that come prior to hiring these individuals? Is this where we need to look into the police academies on all levels? Okay. Yes, focusing on jail staffing. Absolutely. From academy to ongoing training. Because some of us are old dogs, and you know, if we've been in the saddle for a while, look, I mentioned, I'm military family. My dad is my hero. If my dad said something to me, it was yes sir. Total respect. It wasn't out of fear. It was out of respect. Now, my kids, I would love to think that they respect me as much as I respected my dad. But it's not yes sir. It's why. And you know what? That used to bother me to know end. My wife is an incredible saint, and she's taught me some things. They're not challenging you. They want to know why. And that really goes back to training on this one, right? Instead of getting confrontational, I need to have some skill sets to be able to come back to that, to figure out, what's really going on here. And that's what's missing. So it needs to be done on all levels because I can't expect because I'm a seasoned dog. You fall in line because you know, Sergeant said so. Senator Prey. Yes. I had a question I had was, you know, for years. And I think they still remain that way. But I remember going through all the jumps every year, because I worked with the Dalton Regional Youth Detention Center. And we raised the A.C.A. accredited one, the few in the state that was the A.C.A. accredited. And I know that jails can take now, go through that process too. And so, and so, what's percentage of accredited, whether it be A.C.A. or some other failure, or are jails instead of Georgia? Great question. So, for those that may be aren't familiar with accreditation, should I briefly describe that a little bit? Okay. So, when you come to training, we're talking about certification, that's for officers. When it comes to a facility, there are some agencies that voluntarily pursue something called accreditation. Now, you have an accreditation, you know, hospitals can be accredited. School can be accredited to certain things. So, there's a governing bodies out there that work in our space and corrections. And there's a couple out there that are recognized. You mentioned A.C.A. is one of them, National Commission on Corrections, Healthcare, and CCHC is another one. They do medical. Our organization, Nijio, has one as well. So, there's some options out there. Now, as far as what accreditation is, and I think this one's a great question, but I want to be really clear with it, because I don't want anybody to misunderstand. I'm a fan of accreditation based on whatever the standards or guidelines are so long as they are a benefit to the agency that is pursuing it. Now, what I mean by that is, just simply because you are accredited, does not protect you from liability. In fact, Belby Wolffish, Road to Be Chapman, I can give you a couple other Supreme Court cases where the courts has said that these goals and objectives, that this organization has promulgated, and they were actually using accreditation as their defense and lawsuits with their prisons, they said, while they might be instructive in some cases, and relevant, they simply do not establish constitutional minimum. And they said, merely, they rather reflect that person's opinion or that organization's goals and objectives. So, what the courts are really saying is, look, that's great. If you want to pursue accreditation, good for you, but the most important thing is that you need to follow the law. So, if your standards with accreditation are based on what the law requires, then that accreditation is going to be defensible and solid, and you're going to have good policies, you're going to have good procedures, your training is going to be up to snuff. What I love about accreditation is that it can provide an agency a template to make sure that they're kind of doing the things that are important for them to do, and you also have to have documentation to show that you're doing it. And I think the Georgia Sheriff Association has built an accreditation program for jails inside of Georgia, but one thing we, I think we continue to be cautious of is that we don't mix our apples and oranges, and that corrections accreditation would be different than jail accreditation. Is that not true? ACA developed core standards back in 2008 that are nationally driven, and actually let me thought you brought that up. Those core standards were nationwide across the country, and while that sounds really good, I would caution you on this point. The one-size-fits-all does not fit all. One thing I've learned just being here in Georgia, and I know it's to be true, you're not California. I don't know if you want to be California. I can answer that question. Well, and I'm not saying that as a knock on California. I'm saying you are subject to going back to case law and those standards and whatever you're measuring by in the state of Georgia. What I need to care about as a jail administrator is Georgia State Statutes and Codes. I need to care about the 11th Circuit Court of Appeals, not the ninth. I need to care about federal acts and constitutional and all of that. Whatever set of standards you're going to utilize to measure a facility, all I would simply as vice is please, please, please, based on what the law requires. Your laws, not something that is just buckshot for anybody and everybody out there across the country. I just found that this terminology best practices is not always best. So, we'll follow. So, if there's no necessary of accreditation, what's the oversight to make sure that jails are meeting a high standard of expectations? Okay, this might lead back to what Senator Strickland asked earlier about. What about our state and how is it a little different? Every state from an oversight standpoint operates a little bit differently with that. And really that comes down to what exists from statutory laws and regulations. I'll tell you in some states that they have the DOC inspecting the jail, that one always faffles me. I'm like, how does the DOC know what to inspect for if jails are not prisons and we understand that? A number of states have adopted that and they've had a lot of issues with it. But others, we've seen that the sheriff's offices or the sheriff's association has been more involved and engaged in that process. I've seen some peer reviews that have worked really well. I've actually helped establish a lot of those in different states. They're all different. I can tell you probably easier the ones that don't work and what they're founded on than the ones that maybe do. But again, I would just say make sure you have the right people in the room. If you're going to do audits and inspections for compliance, please make sure that you have the right people that are involved in that space. Sheriff's jail administrators because they're the ones that actually have to do that. And sometimes I've seen some overreaching legislation where I'll give you an example. And the state where the Department of Health is running the jail inspections. It's not working. Okay. How long is your slide presentation? Well, it's not much. What I thought you were talking a lot about what happens in the room. I just want to say something really quickly because we have three minutes. Children's tour in the jail. I mean, in the jail, the capital. It fills that way. There is one slide that we are going to have to borrow out because of the children in the in the in the in the capital. So, but I just want to. Wherever you want to start that. Let's go ahead. I just brought some in and again, these aren't. I didn't pick the crazy ones for you. I could have done that the shocker stuff, but this is just stuff that I would say happens in a lot of facilities. Let's go to the second one. If you don't mind. Yeah, I'm going to the second slide and it's a good skip it right. We skipped number three. Yeah, skip three. Well, actually two and they they. I think they both might have. Are you worried about? I was just saying, would you say turning over? Profound and the monitors are new to me for kids. The monitors are both of that in the capital. Of course, we're off. Yeah. Okay. If the monitors are off, we should be okay. Yeah. Well, we have TV cameras. Oh, and live stream. Yeah. For YouTube policy, maybe a issue. Let's just.\n\nWe can wait. It's hello two minutes. Okay. You go ahead and keep Profit is fine. No, he's not yeah Well, and to your point so it's what it's a jail unfortunately and and and to that I agree with you 100% It is it is what's exposed in our jails each and every day and and with all due respect to our friends and corrections They are not exposed to the same thing because like we said and I think you said it when an individual arrives at prison They come with a bow they have a package their backgrounds understood and all that when someone comes into a county jail It's it's an evolution and so we see this chaotic. Yeah things so We'll give you a couple of minutes. No, we're gonna do it Sam has to do and if you'll go ahead with your test And it may be a little bit of why I wanted to bring some of these out is just I mean sometimes pictures be louder than words And and just to kind of get a visual and see that because if any of you have ever had a tour of a jail I'm not saying you got the disney land package but Most jail administrators don't want to show you The rough part of the job just like if you were probably describing you know what you do for a living for you know It's other people you wouldn't show them the hard stuff That's their garbage that they have to deal with on a day out day basis. So it's it's kind of just there but everybody knows it Bill Hall's worth when he was speaking with Georgia sheriffs talked about classification briefly And I just want to mention this because when we talk about delivering a difference in duty to protect there's Beyond staffing there's two really other big issues that I I hope that you'll be able to address as a committee and kind of look into One is the physical facility of The actual physical facility of the jail. I'm talking about bricks and mortar And the other part beyond staffing is is really inmate management Okay, so With physical facility, I'm just gonna say this They need attention. They really need attention and if anybody thinks for a minute I mean that that you build a jail and it's just gonna sit there and look pretty and it's gonna be okay in 20 years when Every day you have somebody trying to Break it mess it up destroy it whatever. That's not that's not realistic. They need maintenance. They need to upkeep so I just highly encourage you look at that physical facility also from a lawsuit standpoint. I can't count how many questions and even lawsuits that I've been involved with that are ADA related Why because the facilities were built way before ADA was a thing? You know then you get into lighting and you get into you know the floors and you slip and falls and all these other things that you can deal with so You know Sure if doesn't have the budget to fix all of that There's a couple videos that I had here where you have to have somebody who's escorted out of a cell a typical procedure on that would be is They have these what we call them. There's different terminology slaying it but Beam ports or cuff ports where and inmate will we'll put their hands behind their back and stick them through this little Kind of a window thing. That's also where you can pass trays and you can do other things like that It's it's a great invention that exists problem is most of them don't work So what happens when you have somebody who's dangerous or mentally ill or whatever else and you're trying to extract them from something now Now you have to physically go in and get and without them being restrained And that that happens all the time The second part on that one is as I go back getting away from facilities or well, let me jump back in We've also done ourselves a just I'm gonna say disservice It jails so I'm not trying to throw anybody under the bus, but I've just seen this a lot Another reference on a TV show. You all saw the movie McGuire or the McGuire McGiver You know what I'm talking about I don't know of another profession that knows how to McGiver things as well as jails If you give a jail guy some duct tape They're gonna figure out a way how to make that thing work because they don't have a lot of faith that it's ever gonna get fixed So they're gonna have to do something to make it work and I've seen the most creative amazing ways just to to keep things together Which is really sad I'll also say this Technology is not a replacement for staffing I'll show you a picture up on here a little bit of a control room and you're gonna be like how in the world do they do this? Okay, and we're ready when I go ahead Go ahead and I want to say this we're gonna stop the live streaming while we do this because we're unable to blur Some of the stuff out anybody that's uncomfortable with profanity Full-frontal nudity or anything that may encompass any of those characteristics Please go ahead and leave now Okay, and this isn't a holding cell in a nearby state and I got permission to show all of these so here you go You You You They had had him for well over two weeks They're their corrections officers as mentioned earlier what do you expect them to do? With with that individual they're waiting for beds the beds are full they have nowhere to take them nowhere to go It's awful They gave them clothes they try to give them showers they give them food they give them everything that they could possibly give him He shouldn't be in there We have inmates with a five-year-old mentality and some of it is drug use some I mean There's all kinds of things but a five-year-old mentality where if I could give him a crayon They might be okay for a while now normally you wouldn't never bring crayons into a facility for a lot of reasons But all the guy wants to do is color It's a mess and No, we're not gonna probably fix that sitting around a room but But I think if there's anything that I would hope that eventually we can figure out is why do we have a population that is so horribly served Jails are not mental institutions. They're not but they become the de facto one The next one I'm gonna show you So we've been talking a little bit about mentally ill and it's a huge part of our population But this ties right into it. We also again delivered a difference duty to protect we have to protect themselves From others and themselves and things like this are commonplace You You You Know they were waiting for a team to come in to help extract him to To take care of himself. He's not in a good place obviously now a lot of people would look at that and go Are you really gonna let him swallow something? Right what are you gonna do with that? These are split second decision. It's really easy to armchair quarterback this thing and look Oh, they could have done this they could have done that. Well, how many staff do they have on right? What do you know about this individual? He'd been booked in a lot of times. He had he acted like that when he wasn't taking his meds And it's interesting his family would say the best care he ever got Was in the jail and his mom poor mother would say I know he's got a place to sleep It's warm and he's getting fed. It's the first time I haven't worried about him in a long time So when we start talking about suicide These are all things that every officer has to deal with all of the time and In dealing with that Classification becomes a huge issue where are we gonna put up? How are we gonna hire house him? Where is he gonna go with what's the best place that he could possibly be? That ties back into the physical facility you talked any physical you know any person out there that's running a jail Do they have the right space to put the right people to keep separate those that need to be kept separate? Because you can't just put everybody together. It wants to be what would happen if you put that guy with general population as we term it? What would happen? Let me show you another one and say what would happen? That this is a perfect example I got this off the media, but it's it's a perfect wish to breathe to the second count of murder in the second You know, yes sir doing so freely and volunteering Yes doing so many visual Yes, right the reason I kill it was because he was a child in the last year But you didn't fact kill him. I'll share it and you attended all sure that's Well, it's all right. I'd like to tell you where it started. Go ahead. All right. Well, we were he was my bonky and I Found out that he was in prison for a child molestation really bad case so That night he was trying to justify why he didn't I just told him to be quiet and he would have to leave in the morning to find a new cell But he continued to talk about it and try to justify it so He was a little bit bigger to me so I got down and I Get him in his face a few times when he fell like wrapped a quarter of my neck and I took his life There's a code inside facilities as far as how things operate and there are certain people you just don't put with other people As you talked about sentencing reform and all these other things part of the thing that I think a lot of people don't think about with unintended consequences is As you continue to bring individuals that are a little bit more hardened you are going to get a more violent inmate You're going to get more gang introduction and I'll tell you what they've done in California with that where you now have I know a jails that are housing inmates that are serving 33 year sentences in county jails All in the name of sentencing reform So they're serving their entire sentence in county jails and In its other state which I don't want even guess where it might be Or do Individuals just coming into jail being classified to be placed with individuals that are currently serving sentences They've done a little bit of both of that because it was a little bit retroactive at the time that the bill was passed But for certain sentencing they shipped them back to the jail said you're gonna finish your sentence there and we're gonna Stop here in just second because I want to bring fullton county sheriff's office To end today's committee and I know you'll be back with us in the future and I appreciate that But just to be clear classification is when they bring the individual into the jail They try to ascertain as much information about that individual lifestyle charges past charges Medical history as much as humanly possible so that they can classify them to determine What part of the jail that they need to be located in thereby? Attempting to put them in as safe for the environment as possible Inside of a county jail that we know is a microcosm of a community of individuals who choose not to follow the rules Was that correct exactly? Exactly and there's so many factors involved with that that I think the public just sometimes doesn't think about and some of them can be pretty charged when it when it come well But then the next slide this will be all about with us. Yeah So Is this a jail this is jail. Okay We have always classified historically though, you know, they'll kind of walk through the history there we've classified by gender Well, what happens when when gender identity is different now? Then maybe what it used to be Where are you gonna put an individual for example that is transitioning and has a female top but male plumbing? Where are you gonna put them? Do you put them on the male side? Do you put them on the female side and? And again considering what they feel they need to be at Not just what the driver's license says, but also where is the safest place? You're gonna put that individual They might want to be in the female side, but that didn't too work too well for New York at California where they decided to change their policies and say Wherever you think is best we're gonna put you there you know have in California seven females that have been impregnated by a male Transitioning to a female And I'm sensitive. I get I understand what's going on with this, but this is not easy So I guess I would just conclude there's a lot of factors here to consider, but I I don't know if there's any more questions or anything else you want to hit on but the last thing I was just gonna show you on here is All of this is gonna be dependent on staffing everything revolves around staffing Your physical facility. I would hope that they can get the funds that they need to if they need to build a new jail build a new jail From that and to close out on that since we aren't building new mental hospitals Mental health facilities if we build new jails then basically what we're having to do now is we're building jails to encompass mental health hospitals Correct and yes, and please fund it as such As he funded as such great point because what classification levels used to be before this arise I will tell you the videos you just saw is it easier to deal with a model inmate that's not doing that or somebody this mentally ill It might take three to one staff to deal with something like that Thank you so much. You look forward to having me back Okay, now I'd like to invite our friends from Fulton County up I It's You Welcome we had some folks step out They'll be right back in this I don't take enough breaks Who's gonna be doing the primary one two and three? Okay, yeah, and I think we've spoken several times and I appreciate Charles professionalism And I want to start this off by saying that that Senator Alvers and I did tour Rice Street And it was funny somebody asked me afterwards. They said what would you think about the Fulton County jail? This was somebody outside of the facility and I gave them the response always gave because like I said as a young law Force officer I grew up inside of a jail. I said it's it's it's it's very ugly and very clean It's exactly what I expected it to look like you know It's I don't know who chooses paint colors. It's low-bid. I'm sure it's like every gel I've ever been in those colors or predominantly But it was very clean and and I appreciate that the common areas and the hallways and and everything Everything looked well maintained staff was extremely professional And we were we were not given the Disneyland tour We were able to go into the areas that we wanted to go into Chairman Alverson I even discussed it. You know We went into the to the holding areas where the most dangerous individuals were and the staff was extremely professional The the detainees were we're behaving But we could tell the space and anybody that works in jail understands this we could we could identify easily the spaces that the staff will responsible for And the spaces that the detainees were responsible for their self-care and and Cleaning up their personal areas. There was there was a very distinct difference And in those two areas and we appreciate the professionalism and the open opportunity There was no setups and I greatly appreciate that a lot and with that man The floor is yours. Thank you senator good morning senators My name is Amelia Joyner and I'm chief counsel to share Patrick LeBot Of the Fort County Sheriff's Office. I'm joined today by our chief deputy Antonio Johnson our chief of staff michael shows and our interim chief jaylor Curtis clerk On behalf of sheriff LeBot and the men and women of the Fort County Sheriff's Office I thank you for the opportunity to appear before you to talk generally about the Fulton County jail Well to talk generally about the Fulton County Sheriff's Office and specifically about the Fulton County jail Our sheriff regrets that he's not able to be here today. He's traveling with other sheriffs on a summit addressing these specific issues And if I speak to that really quick. Yes, sir I want everybody to understand because I know everything gets so politicized through this sheriff LeBot and I spoke on the phone Yes, and he asked me the importance of him being here And I told him because this was not political that I didn't need him here. I needed the individuals you got the chief deputy you got the chief facilities manager the commentant the commander of the jail The boots on the ground is what we want so you know, I just I just know sometimes the story Maybe we'll sheriff didn't show up well He offered he said I'll fly back in a day early and I said sheriff That's not what we're looking for what we're looking for or the cold hard facts of what's going on in Fort And he picked the perfect staff to bring it here. So thank you. Thank you As you all know Fulton County is comprised of 15 municipalities Few of which have their own holding facilities or jails Generally speaking therefore the Fulton County Sheriff is responsible for housing detainees from all of those municipalities As well as detainees from schools University, Marta police, state and federal law enforcement agencies They all pour in to the Fulton County jail As a result of this point into the Fulton County jail we are one of the largest in the southeast United States Our jail is comprised generally of five different facilities The main jail which is commonly referred to as the Rice Street facility Is located at 901 Rice Street We have the South annex which is located in Union City, Georgia We have the Marietta annex which sits adjacent to the main facility The alpha red a jail is in the northernmost part of Fulton County And then we have the not often thought about Grady Hospital facility The sheriff has little control over how the jail population is created Our jails populated by individuals the majority of which are arrested by law enforcement agencies Other than the Fulton County Sheriff's Office for example 51% of our detainees Come from the Atlanta Police Department arrests Law enforcement agencies arrest these individuals Prosecutors and criminal defense lawyers try those individuals cases Judges move and schedule the cases through the court system But it's the county sheriff's every last one of them Who are in the position of dealing with the inmate population until such time as each and every case moves throughout the criminal justice system The sheer size of the Fulton County jail operation presents us with an awe-inspiring realization The Fulton County jail is its own city It is not a mere building Or set of buildings rather as Senator said It is a microcosm of the community. It's what our community looks like Each of the nearly three thousand detainees that we have in our custody has his or her own personality stresses court cases family loved ones Medical and mental health needs Educational requirements and limitations and sadly Many have their own criminal affiliations or gang affiliations The Fulton County jails also a city that never ever sleeps The doors are open 24 hours a day seven days a week 365 days per year Running facility of this size is a herculean task or set of task that requires both our people and funding Before I get into the specifics as Senator Robertson has asked us to do I first want to tell you what the capacities look like in the Fulton County jail system The operational capacity of each of our facility differs The capacity is impacted both by staffing levels at the jails And also the specific building and questions for instance the main jail our right street facility Has an operational and optimal operational capacity of 2,254 However, currently as we sit here today We have 308 beds that are inoperable because of building deterioration That leaves us with an operational capacity of only 1875 Yesterday's population was 1928 at the main jail only Yes, Senator, it's merely if I could don't mean to interrupt your flow. Yes My understanding I want to make sure it's accurate is when the building was first open I believe in the late 80s. It was actually built to house 1100 inmates. That's correct 1125 right and then they double bunk each one of those cells right to basically make 1100 to 2200 although the cells themselves were made for one individual not to that is correct You're talking about your numbers. We're really already at 200% of the capacity. Yes, sir to begin with. Okay. Thank you so much Actually our total capacity or our total population as of yesterday last night was 2,915 total. That's in all facilities Okay, thank you. So it's it's almost triple where we should be We're severely overcrowded as you pointed out Because of our overpopulation the sheriff's office routinely reaches out to other agencies and entities in order to transfer inmates to those locations we commonly refer to it as outsourcing In February of 2023 Sheriff LeBot reached out to every single sheriff in the state of Georgia asking them for all bed space That they had available even if it was just one bed From his request we were able to enter into outsourcing agreements with additional counties and with the city of Atlanta But we are constrained by their Limitations were constrained by their staffing levels in other words they may have bed space But they have no staff to take on even one of our detainees Fortunately a number of our partners were able to answer the call Currently we have outsourcing arrangements with Cobb County for Scythe County O'Coney County and the city of Atlanta Each of these entities have partnered with Sheriff LeBot in our agency to assist with assist us really and relieving the stress of the overcrowding Now, really, our reference that our Reality is that the jail system cannot work without the men and women in this agency Our agency has an authorized strength of 1,017 members What that means is the county who funds us says that we need 1,017 members Currently we have a staff of 889 Of those 889 655 are sworn staff members and 243 are civilian staff members Of those numbers We have 386 sworn staff members assigned to work in the Fulton County jail system And 106 civilians work in the Fulton County jail systems Unfortunately, we have 21 employees who are out for medical leave Other workers compensation or some other need so the number goes down Coming out of COVID like every law enforcement agency and correctional facility across the country We continued to struggle with severe staff challenges In fact, at the end of 2022, our attrition rate was 36.3% In January of 2021, Sheriff LeBot took office And when he took office, he immediately sought to improve our recruitment and retention efforts Some of the things that he did was he immediately sought to increase the salaries for all of our sworn staff members Although we are the lowest paid and law enforcement Our team is the highest in the state for correctional officers Our deputy starting salary is $60,000 Our detention hour, detention officers starting salary is $54,000 We have a $10,500 sign on bonus in order to encourage people to come to our agency We have a comprehensive medical dental vision and retirement plans The sheriff has sought and had achieved double time for overtime worked in the jail environment\n\nUnfortunately, the Hesse has been rescinded as recent as yesterday by our Board of Commissioners. The sheriff has also entered into a contract with a staffing company. We have 42 individuals who come in to man the towers on the housing unit. That helps alleviate the stresses of being short staff with officers and deputies. With respect to funding, the sheriff's office budget is set by Fulton County and its Board of Commissioners. The sheriff's office is generally underfunded and sometimes obtaining funding can be contentious. Like the sheriff has little control over who comes to the jail, he has little to no control over the amount of funding established for her operations. For fiscal year 23, our total budget for the entire agency was 142,706,567 dollars. Of that, 99,919,951 dollars was for a personnel. Of that amount, 64,600,500,800 dollars was set aside for the jail. And 28 of those millions were for personnel performing the various duties at the jails. So when we talk about the duties at the jails, we're getting into the operations from operational perspective. I mentioned previously that we operate 24,7365. One may question what happens during those days. Well, first of all, our staff works 12 hour shifts each day. During their shifts, the inmates are provided with among other things, medical and mental health services, food services, programming, faith-based services, spiritual support, transportation to court proceedings and medical appointments. Our team ensures that various maintenance requirements are reported and completed. And finally, our team also facilitates thousands of attorney contacts with each of the inmates within the Fulton County jail. Medical and mental health services are performed by a private vendor. That vendor costs approximately $35 million per year. Food services are provided by a vendor. Real quick, ma'am. Yes, sir. The private company I'll have in Affcare. And you said it's cost of their services are approximately $35 million per year. Do you all provide any staff supporting staff for the medical in the clinic? Or I mean, security staff, of course, has to be used to move the detainees to and from medical care. And I guess if they're doing a pill call or whatever around the facility, staffing has to be assigned to them to protect them. But as far as the, is there security inside the clinic? Is that it's housed inside the jail that is paid by the county? Absolutely. Absolutely. The security is our detention offices and our deputies. All of the providers of the medical services or the mental health services are provided by Affcare. But Affcare is always escorted by our security team. Are these, is this a permanent assignment to those deputies inside or officers inside the jail? That they, when they come in and they're given their assignment, they're assigned to support medical staff. So they're not like pulled from other areas at different times. So there are two, there are two different ways that it happens. First, the officers at the start of the day, they're assigned to specific floors. Some are responsible to be just on a floor. For instance, we have a captain who is assigned to be on the third floor of our jail. That is the medical and mental health floor, right? She's there every day. That is her assignment. So those officers get their assignments during roll call. Additionally, through the Navcare contract, they also provide for security escorts. So when they need additional reinforcements, officers during their off duties, their off days are able to come in and serve in that capacity. So they could be escorting Navcare in two different ways. What is it? What number? Just a clarification, Mr. Chairman, I'm seeing up there on page four in the operating cost under 2023 is 36 million plus. But when I'm going through this thing under operations, that's obviously more than 36 million. Yes, I read it. So then you're operating way over your budget. Correct. We operate at a deficit, generally speaking. It's not like $1 deficit. I mean, your first medical and mental health services is almost your entire operating budget. Correct. Okay. Thank you. So with respect to our food services that are provided, our food service vendor is an outside vendor as well. That cost is approximately $7 million per year. Our food service vendor provides 9,000 meals, approximately 9,000 meals each day. Our staff has to deliver each of those 9,000 meals to every single inmate. We also take into consideration the dietary needs as they relate to health, religious, and other accommodations, allergies. All of those are taken into consideration when meals are provided to inmates. In addition to medical and food, you have to keep, as the Senator mentioned, we try to keep the place as clean as it can possibly be. And so there is a massive undertaking as it relates to maintenance. Our maintenance is provided by two different places. The Fulton County Department of Real Estate and Asset Management at a cost of approximately $6.5 million per year and also Johnson controls a private vendor, $5.3 million per year. They do preventative and restorative maintenance. We also have special cleaning projects to include the infestation and medical grade cleanings that cost approximately $1 million per year. Our water bill is approximately $200,000 per month and gas and electric is generally $90,000 per month. In addition to these maintenance, food, and medical services that are provided, programming opportunities are provided, GED classes, life skills classes, cosmology, reentry services, basic computer classes, religious services, and more. We'll quick over. You offer these programming to detainees. Yes, sir. These are not Senate state inmates. These are detainees within the Fulton County jail. Yes, sir. Okay, thank you. Yes, sir. The work that goes on at the Fulton County jail is not just performed by our jail operations team. Our courthouse team, our law enforcement division, support the Fulton County jail on a daily basis. For example, each month, there are approximately 100 building searches performed by our canine officers. Our law enforcement field operations teams supports the jail every day by reinforcing jail staff when there are shortages. Even the administrative staff of the Fulton County Sheriff's Office supports the jail. Our warehouse fleet, bond administration, GCIC, planning and research, human resources, office of professional standards, training, finance, HR, and IT, as well as the people you see sitting here. We all support the jail operations on a daily basis. And these units support the jail all while they have their own critical work to perform in the courthouse and law enforcement and administration. Our detainees, the vast majority of them, are pretrial detainees. As a result, they have not yet had their final day in court. Our team must ensure that those inmates have both access to their attorneys and we have to transport them to their various court appearances. While the Fulton County jail does have its own fully functioning law library, we also have to make sure that the attorneys that represent these inmates have the opportunity to see them. On average, there are 1600 visits that occur from the Fulton County Public Defenders Office and his staff. Are law enforcement- Excuse me, ma'am. Yes, sir. The law library you have in the Fulton County jail, that is for inmate access? Correct. Okay, there could be wrong, but they're not leaving their sale, walking down the hall, checking a book out. Is this done digitally? They're escorted to the law library if they need to do so, or we can bring materials to them. So are these hard copy books that they're pulling off, or these workstations and computers? We use a combination of laptop, tablets, and we also give actual access to the library. Okay. They can also request information from the library and we deliver it back to the sale. Okay, thank you. Our law enforcement team, the transport team, on average, transports 1300 inmates per month from the Fulton County jail to the Fulton County courthouse. They've transport approximately 79 inmates per month to the Department of Corrections after an inmate has been sentenced. And they transport approximately 100 inmates per month to counties outside of Fulton County for various court proceedings. With respect to medical and mental health services, on average, on a monthly basis, Naffcare are medical provider screens 1,467 detainees at the intake process. There are 146,000 occurrences of medication passes. That's just the administering of medication. Each month, 146,000. 158 inmates are transported to the graded emergency room of those 106 are transported by the Fulton County Sheriff's Office on a monthly basis. There are 997 urgent care clinic visits in the jail on a monthly basis 348 scheduled dental visits for mental health, which has been the subject of much conversation today. We have 1800 inmates currently on psychotropic medications in the Fulton County jail. Of the 1278 inmates are on some other type of mental health medication, less than a psychotropic medication. We have 146 monthly urgent mental health contacts, 72 acute least psychotic admissions. Severe mental illness, approximately 1,000 inmates in our custody suffer from severe or serious mental illness. The Fulton County jail is very much so a de facto mental health facility. Every activity that occurs at the Fulton County jail must occur while a deputy detention officer, security specialist, other staff member is present and performing his or her duties to secure the medical and mental health personnel and the inmates. So the greater the inmate population, the greater our duties in the Fulton County jail. I mentioned earlier that our jail is severely overcrowded. What are the impacts? As we talked about very quickly earlier, the additional stress on the physical building causes it to deteriorate. The Rice Street facility is more than 33 years old. The additional occupancy has pushed to the limits, the plumbing, heating and cooling system, electrical systems, the doors and locking mechanisms, and even the actual brick and mortar of the facility. The physical plant has become so dilapidated that the inmates are able to create weapons by reaching into the walls using broken flooring, electrical covering, pipes, et cetera, to create makeshift weapons. There's a fiscal impact of the overcrowding. It's caused an increase in medical costs, food costs. We've had to contract and hire supplemental security. Our staff has to spend more of their off time supporting the jail and making sure that it is as safe as we can have it. Our outsourcing efforts are very, very expensive. In fiscal year 23, Fulton County budgeted that $28 million would be spent on outsourcing. Most striking and sobering is the violence that overcrowding causes or at least contributes to. Because the jail is a microcosm of the community, and has a lot of stresses there, sometimes the stress comes to a head. As of November 1, 2023, we had 293 stabbings. We confiscated 1,186 shanks. There were 337 fights. There were 922 assaults inmate on other inmates. 133 cell phones had been confiscated. There was at least one fire. There were four instances of inciting riots. There were 68 assaults on staff. There were 10 deaths, two of which are homicides. Four were natural. One was natural via overdose. And three others are suspected overdoses. And the cause of death is still pending. Now, when you say as of November 1, these are stats starting January 1 of 2023. Yes, sir. Thank you. Yes, sir. Because our detainees have so much time on their hands, they find ways to engage in negative and criminal behavior. And some ill-intended members of our community seek to assist them. As I mentioned, we routinely confiscate contraband in the form of weapons, drugs, and cell phones. We continually come back the use of drones that try to infiltrate the walls of the Fulton County jail. There's also an effect on the attrition rate within the jail. Jail conditions, overcrowding, and staffing challenges combine to exacerbate the attrition of our jail team. While this all seems insurmountable, our team continues its tireless efforts. We recognize that we did not cause our population. And we can't fix the systemic problems that play the Fulton County criminal justice system. We also don't have the luxury of just throwing up our hands and giving up. Rather, we work nonstop to decrease the population and to provide as safe as possible conditions for the detainees within our care and our custody. What have we done? We have partnered with our solicitor general, the district attorney, and others to obtain consent bonds so that we can increase the numbers of individuals who are able to be released. We've invited PAD to come in to do pre-trial diversion efforts during our intake process. We have given them office space or at least desk space within our intake area so that they can quickly get people out of jail if they're eligible to be out of jail. In June of 2023, we started an inmate advocacy unit. That unit has reviewed 10,980 cases to see if inmates are able to be released from jail, to schedule hearings to make sure that the courts are pushing the cases through the system. As a result of their work, 259 inmates have been released, there have been 185 court date schedule. They have corresponded 358 times with judges and other members of the judicial system. They have made 11 recommendations for early release and they've returned 93 individuals to the Department of Corrections. We continue with our outsourcing efforts. If those efforts are funded by the Board of Commissioners and Fulton County. The result is recently we've experienced a dramatic decrease in our jail population. Our population has declined from a high of roughly 3,700 inmates to 2915 as of yesterday. Today it's slightly lower. This decrease in population has allowed us to address the nearly 600 inmates who were sleeping on portable sleeping devices, commonly referred to as sleeping on the floor. That number has decreased from 600 to a mere 13 inmates are now on portable sleeping devices. I want to be clear now. How many inmates are sleeping on the floor? 13. 13. Actually Senator. The sleeping device you're talking about looks like a small plastic boat if you will. Correct. And it's turned upside down. It's got handles that you can grab on the side which lifts the inmate approximately 6 inches off the floor. It's more of a legless cot if you were up. Correct. And so you're going to have mattress on top, blanket and all of that. Correct. So in the entire facility now you have 13 that would actually be considered sleeping on concrete. Yes sir. Okay. Yes sir. I would say that there are no inmates sleeping on the floor. There are 13 sleeping on portable sleeping devices. Oh okay. I said okay. So I just wanted to make sure that when you talk about sleeping on the floor you're talking about the portable sleeping device. Yes sir. Okay. So nobody's on the floor? No one. Okay perfect. Perfect. Yeah. Well and we use these. I remember when the tractor trailers started showing up with them. Very lightweight, efficient. The only issue was floor space where you had to find a place to put them where they would be in the day room and other areas where the only concerns that we had with them. But I just wanted to be clear that no inmate is sleeping on concrete. Ever. Okay. No. Excuse me. No detainee is sleeping on concrete. Yes sir. That's correct. I realized that people suggest that the Fulton County jail there are many people that should not be in the Fulton County jail and maybe they shouldn't even be arrested perhaps. But what I would say to those individuals is that as of yesterday there are very very few people who are in our custody who should not be there. For instance on yesterday we had 453 inmates charged with murder. We had 1,016 people in our custody charged with aggravated assault and senators as of yesterday only 114 people were charged with misdemeanor offenses. Indeed the Fulton County jail is it can be a very dangerous place. We have entirely too many individuals who are dangerous. The strain on both the physical plant and the Fulton County Sheriff's Office team should not be overlooked. We therefore welcome any suggestions, any input, any advice and we welcome the partnership with this body such that we can continue to improve our operations and the care for the inmates in our custody. Thank you ma'am Senator Dugan. Thank you Mr. Chairman. Two things. One is statement in a question and you just said it about your executive branch government. Judicial branch is the one who determines whether they should be there. You're just holding the ones that judicial branch have sent to your responsibility while it goes through the process. Yes sir. So I know that what you meant but what it sounded like was y'all were determining whether they should be there or not and that's a different branch of government. The second thing is and I know there's all kinds of variables with it. I want to know what the average length of time somebody is in the Fulton County jail and I don't want to know well some of them are this one and some of them are this one. I want to know what the average time is. So it depends on who you ask but the last time I evaluated that number or asked for that number to be evaluated the number was approximately 268 days. 268 days. Yes sir. What said other person go tell me. They may say 117. I mean it is or it's not. It's 268. Okay. Thank you. Senator Abish. Thank you. Mr. Chairman. I'm actually going to piggyback off Senator Dugan's question. He preempted me a little bit. What is the target of the time you'd likely want them to spend in your jail if all the processes before and after you're around you are working in the most efficient matter is that what would that day look like would it be closer to 30 days or 60 days? I can't we can't speak to that quite frankly it doesn't matter how it is we certainly want these cases to be processed quickly and expeditiously but it doesn't matter if the person is their day one or day one thousand we just have to provide care for them. And so I can't tell you the target date that that question is better addressed to either you know the prosecution or or the courts. And I appreciate your response and I understand what your perspective is Chairman Roberts and I have done some research and been given some materials that show that that should be average about 30 days. So knowing that it's 268 where we're obviously the folks that are in your jail today based on a lot of factors what we're missing that by a factor of at nine almost that's pretty significant I think as we continue to delve deeper into that we as a committee ought to know that the target nationally and in some areas that that may have their full system right working better they're closer to that number of 30 and we're at 268 so it's a great benchmark and then the next question if you could wave the magic wand right that you think could solve all the problems that you can be responsible for you know can you give us kind of a maybe I don't want to put you on the spot that a full plan but what would those top three to five things be that you think could help solve the things you could control right away. Three things we need a new building fast the second is we need a lot more staff and and third we need to be properly funded. That's it that's it number three solve number one and number two in theory okay thank you yeah and I'm glad you brought that up Mr. Chairman I think in theory that's right the challenge with staffing right now is we just can't find people that want to work right we're having that problem by the way across the spectrum of pretty much every single industry that we're looking at we have worked for shortages yours being one of the most challenging and difficult and I think from both my perspective and most people on this committee would say is with there's a lot of important priorities but without keeping our public safe none of the rest of the matter so thank you. Actually and also I've just been past the updated number for the average length of stay for the detainees it is increased from 268 to 295 295 days. So almost 10 times what the targeted would be for 30 days I think. Yes sir. And I want to be I want to be clear on this too now and I know you're in a you're an attorney so I hope I don't sound too elementary on this but when we're looking at average time in the jail and we say John Smith comes into jail for domestic violence which is a misdemeanor but which is a very serious misdemeanor. Correct. And we're looking at him being out of the home and based on history and all this looking at 30 days may seem reasonable if we can get everything into place if he can bond out if he's allowed to bond out based on the circumstances and getting back out in 30 days but if John Smith comes in on a murder charge no one in some case where there is no bond on that particular incident is going to get out of jail in 30 days. In some of those situations based on the criminal justice system do process based on his or her attorney based on the backlog in the prosecutor's office based on the docket weight in the court system I mean I think we had we held someone in jail for it was a capital case I think Richard Elliott may have covered it but it was it was four years before we could get this person to trial with all the pieces falling into place. There were no really big things so when we do start factoring in as as Senator Dugan did I can you know I can appreciate the the warning to know an average but again it is a strange basket of fruit that we're trying to average out here because a lot of these cases even some of the felony cases what people lose is you got these murders 453 murders that's high and then you say we got a thousand sixteen aga salts. Yes. In most states an aga salt is identified as an attempted murder. So there is not a huge distance between murder in killing somebody and trying to kill somebody it's just success and failure or the only different different than that. So so I just want to be clear with that when we start looking at the number of days because Senator ours is spot on on on vast majority of these cases 30 days is a great window if if everything hits the way it should but we are always going to have those outliers the murders the aga salts that depend on the court system the prosecutors office and and witness cooperation and everything else. Yes. There are and also there is a mental health component even with that. So for instance we currently have approximately 65 individuals in our custody who may have some competency issues until those competency issues are resolved they cannot have their day in court. So for instance we just had I believe it was last month an individual whose case went through trial he had been in our custody for 10 years. There were competency restoration issues. And and I appreciate that and that was part of the information that I received about the 10 years and and I appreciate that my concern with that is and we've dealt with competency issues.\n\nuse throughout the history of the criminal justice system. I mean, for cases that people, you know, care of research, you can look at Lizzie Borden, and that was a, you know, that type of case, and come all the way to today. But it is really hard. And I want to preface this by saying, you have no control over that. The Sheriff's Office does not participate in competency hearings other than getting the individual from the Fulton County Jail to wherever they're supposed to be. Yes, sir. No competency situation should take 10 years. At some point, the court system has to make a determination whether that person is competent or not. And if they are not competent, then they have rights that have to be, have to be upheld to where they're placed in an institution until some point where they become competent enough or they're let go. Correct. The court says, you know what? Randy is competent. So we're going to put him in the pipeline, and he's going to go to court and do process is going to happen. And I just can't imagine a world. And I hope somebody brings it in and shows it to me and corrects me. But a world where it takes 10 years to determine the competency of an individual. Because one thing to get slapped out of this is there's a victim in there somewhere. Correct. And that victim and their families, and the victim, of course, in most cases, is no longer alive. But the loved ones and the family around that victim, they should not have to wait 10 years to get some form of justice. Any more than that individual is held in custody for 10 years because let's remember that individual's not in prison. Correct. They are still awaiting their due process. And so 10 years, and when you factor 10 years into what Chairman Dugans saying, we skew the numbers beyond. And so that's my concern with that. But listen, this has been very outing, very enlightening. It adds icing on to the cake of our non-Disney Land Tour that we took. And I really appreciate that. Are there any other, yes, what might you own, ma'am? No, I'm just a man, Senator Hal. I wanted to go back to the benchmark period of time, not to argue about timeline, but I did want to make one distinction. So I had heard it was closer to 60 days, but 30, 60, not finding about that. But that was for unindicted. Right? That is for the period of time. I think what your question is is, they should be indicted within 60 days. Correct. That is correct. And then it goes right back to what you were saying, is then once you're indicted, and you just shared with us that you've got 111,040 cases of unindicted cases, but in fact, they have been indicted on other charges for their needs remaining. Because that is correct. And again, because of her advanced degree and understanding the criminal justice system, it's very easy to speak to that. But her current job as representing the Fulton County Sheriff's Office is in the real world. People have to understand that the Fulton County Sheriff, nor his staff, has anything to do with the due process. No, no, I know. And so we're back to determining that there are four parts that contribute to jail's issues. And I will say, and I'll say it here at the first meeting, it's hard to find anywhere that the sheriff would be responsible for overcrowding. Because he doesn't sell tickets for people to come in there. And I've had people come in all the time and complain about me and they're in there. And none of them have ever produced an invitation to me where they were invited. But so that's the reason I think it's important that we look at all four aspects of this so closely. And again, as aged as that facility is, and people don't understand when I say it, it's not a pretty facility, but it was clean. I was looking in corners and stuff like that. And I really appreciate the professionalism of that day. Thank you all so much. Any other committee members? Just one there, done a final comment? Yeah, absolutely. Thank you to everyone who has presented today. And I just want to take a special moment here to thank Chairman Senator Renewarperson. He came today with a very organized, a very detailed and a very thoughtful approach. And I hope that everyone who's in this process is recognizing the work as well as the talented committee members who are very intentionally put together for the sole purpose of finding solutions and solving problems. So thank you for everyone who participated. And again, a very special thank you to you, Mr. Chairman. I appreciate that. I'm being the grumpiest state senator three years in a row. I don't know how to take compliments too often. But I'm, but I'm not going to change the vote count. But I will be getting out the information on the next meeting coming forward so that everybody will know. And the possible will be some opportunities that some of these meetings will occur during the upcoming special session. So they will happen here at the Capitol. And with that said, Godspeed. And I hope everyone has a great day. Thank you all again. Thank you.",
  "updated_at": "2026-02-13T16:44:46.357264+00:00"
}