{
  "video_id": "qP4FCXC9rxI",
  "url": "https://www.youtube.com/watch?v=qP4FCXC9rxI",
  "title": "Lawmakers Day 38 03/31/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session on Day 38 (03/31/25) of the Georgia legislative session saw heated debates on several bills, including the Pediatric Safe Storage Act (HB 1), a bill banning transgender athletes from female sports (SB 1), and a bill creating financial incentives for local school boards to approve charter school petitions (SB 82). The session also included the recognition of 33 Black legislators elected during Reconstruction and the consideration of the state's fiscal year 2026 budget.\n\n**Key Actions**\n- **HB 303**: Bill to place a memorial on Capitol grounds honoring 33 Black legislators elected in 1868 during Reconstruction.\n- **SB 93**: Georgia Early Literacy Act, creating new guidelines for teaching reading to young students.\n- **SB 1**: Bill banning transgender girls from participating in girls' sports and requiring changing rooms to be separated by sex assigned at birth. Passed 100-64.\n- **SB 82**: Bill creating financial incentives for local school boards to approve petitions for new charter schools and penalizing school systems that repeatedly deny charter school proposals. Passed 107-62.\n\n**Bills Introduced (First Reading)**\n- None mentioned\n\n**Notable Moments**\n- Before the presentation of HB 268 (school safety bill), Senator Bill Callisert read the names of Appalachia High School shooting victims and asked for a moment of silence.\n- Democrats opposed SB 1, calling it a \"manufactured crisis\" and criticizing the bill for targeting individuals rather than addressing real problems.\n- Republicans argued that SB 1 protects the integrity of women's sports and ensures fair competition.\n\n**Votes**\n- HB 268 (school safety bill): Passed 45-9\n- SB 1 (transgender sports ban): Passed 100-64\n- SB 82 (charter school incentives): Passed 107-62\n\n**Attendance**\n- Quorum was present for the proceedings.\n\n**Adjournment**\n- The session adjourned for the day, with committees scheduled to meet the next day and the House and Senate floor sessions scheduled to resume on Wednesday.",
  "transcript": "HV1 is a democratic bill called the Pediatric Safe Storage Act.\nThat's what we rushed to this house.\nThat's what we brought a desire to protect our students, a desire to protect young people\nfrom making a tragic mistake that harms them or others.\nThat's what Democrats brought you.\nThis is SB1.\nSB1, the Senate's first priority,\nis a problem that does not exist.\nPassion still run high in the waning days of the 2025 session\nas SB1, which bans transgender athletes\nfrom female sports, finally gets debated in the house.\nGood evening and welcome to lawmakers.\non a Lowry in Atlanta.\nIt's day 38 of the Georgia legislative session.\nThings are heating up on the last week at the Capitol\nand the longer days are already underway.\nThey just wrapped up in both chambers.\nTonight, we've dive into some election bills.\nWe expect debated in the coming days.\nWe'll also take a closer look at proposed legislation\naimed at supporting older adults in assisted living\nand personal care homes, as well as the caregivers\nwho help them.\nAnd if you're like many of us,\nyou probably have a few monthly subscriptions\nfor music or entertainment,\nthat you might not think about much.\nWe'll discuss legislation that can make it much easier\nto cancel those subscriptions when you want to.\nAnd if your driver's license is on your phone,\nyou may be wondering where and when you can use it.\nWe'll hear from two legislators\nwho are pushing to expand those options.\nBut first, we turn to our busy capital correspondence\nSarah Callis for a look at what happened today under the Gold Dome.\nHi, Donna.\nBoth chambers took up dozens of bills on the first day of the last week of the session.\nThe Senate took on 27 house bills on the rules calendar, most notable HP 268, which increases\nschool safety.\nBefore the bill's presentation, Senator Bill Callisert read the names of Appalachia\nhigh school shooting victims and asked for a moment of silence.\nSenators asked for a moment of silence.\nThe bill sets up a variety of new elementary and secondary school safeguards and protocols,\nincluding school mapping for forced responders, transferring a student's academic and legal\nrecords among schools and law enforcement within a required period, and creating a statewide\nemergency alert system. A database of student misconduct proposed in the house's original\nversion was removed because of parents concerns.\nParents kept coming and being heard saying, I don't think I want my child to be persecuted\nfor life because they do something stupid in the eighth grade and they say, man, I'd\nlike to blow this building up.\nI didn't good to say, but I didn't mean they're going to do it.\nAnd if the school faculty didn't think it was significant enough or serious enough\nto give them disciplinary action and create a record, why should we have this shadow\ndatabase, so to speak, on misconduct of students?\nDemocrats wanted to add language that would take children with certain cognitive limitations\ninto consideration, but that amendment failed.\nThe bill was passed 45 to 9.\nAfter years of effort, 33 black legislators elected in 1868 during reconstruction and\nthen expelled.\nOne of the first African-American legislators elected in the U.S. will finally be recognized\nat the Capitol.\nHouse Bill 303 will place memorial on Capitol grounds honoring the men.\nSimply honoring their sacrifice that they made back then when they went up against all\nodds.\nAlso today, the Senate insisted on its substitute to House Bill 68.\nThe Senate insisted on their version of the fiscal year 2026 budget after the House rejected\nthe Senate's changes.\nA conference committee with the House was then agreed upon to hammer out their differences\nto finalize the budget by Friday.\nIn the House, members unanimously passed Senate Bill 93, where the Georgia Early Literacy\nAct.\nThe bill would create new guidelines for teaching reading to young students by banning\nthe three queuing system.\nThis ensures Georgia teachers are being trained in alignment with our science of reading standards.\nIt works to strengthen our efforts to end the reliance on the three queuing practice.\nAnd it supports our teachers by making sure they are ready to teach, reading to our children\non day one in the classroom.\nAfter lunch, the house took up one of the most contentious bills of the sessions.\nSenate Bill One, SB one, would ban transgender girls from participating in girl sports and\nrequire changing rooms to be separated by sex assigned at birth.\nDemocrats were quick to oppose the bill.\nThis is a manufactured crisis designed not to solve a real problem but to create division\nand fear.\nThe NCAA has changed its policy on transgender athletes.\nThe IOC has rules in place that deal with transgender athletes.\nThe Georgia High School Association has rules that deal with transgender athletes.\nI question why we must double down and triple down.\nThey have not asked us for this,\nbut Republicans say it protects the integrity\nof the mail sports.\nThis legislation does not target individuals.\nIt targets inequities.\nIt safeguards the decades of progress made in women's\nathletics by reaffirming the state's interests\nand promoting equal opportunity\nand preventing unfair advantages.\nThe bill also respects privacy by ensuring\nthat shared facilities used during competitions,\nsuch as locker rooms, restrooms, and sleeping quarters\nare designated and used according to biological sex.\nWhile still often reasonable accommodations for all students,\nit prohibits males from competing in female sports.\nthereby protecting the competitive balance and physical safety that women\nsports depend upon. The bill passed 100 to 64 and was immediately transmitted to\nthe Senate. The House took up another controversial school related bill, SB 82.\nThe bill would create financial incentives for local school boards to\napprove petitions for new charter schools and penalize school systems that\nrepeatedly deny charter school proposals that have been approved by the state\ncharter school commission. Supporters say SB 82 expands options for students.\nWhat this bill does is simply it's a very modest proposal to encourage local school boards\nto provide more public school options to students.\nBut opponents say that the bill is taxing on local education systems.\nNot only does it usurp their elected responsibilities, but it pressures them to approve charter\nschool applications and lays the groundwork for increased privatization of all of our\npublic schools. The bill passed 107 to 62 in a mostly party line vote.\nCommittees will meet tomorrow, but the House and Senate floor sessions will be back on Wednesday.\nThat's my Capitol report, Donna.\nThanks, Sarah. Two state senators join us now to talk about election bills,\nlegislation to help older adults and caregivers and more.\nRepublican Senator Randy Robertson of Catala is the Senate majority whip.\nThe former law enforcement officer shares the public safety committee and is the secretary\nof government oversight and Democratic Senator Jason Estevez of Atlanta. His committees include\nethics, finance, children and families, agriculture, and consumer affairs. Welcome to lawmakers,\ngentlemen. Thank you for joining us from the Capitol. I know you guys just wrapped up in the\nSenate, not too long ago.\nThank you, Donna.\nThank you, sir.\nThank you so much for having us.\nIt's been a long day.\nA long day.\nSo we're going to get right to it.\nChairman Robertson, you have a couple of election bills.\nAnd let's start with SB 175, which would prohibit the use\nof ranked choice voting in elections.\nExplain how it would work.\nWell, ranked choice voting has shown itself\naround the country to be a confusing and problematic process and I think we\nsolved a lot of the issues in Georgia with SB 202 and we've shown ourselves to\nbe able to have a turnout that does better than most places around the\ncountry and has been very effective and very efficient. Our voter lines are\nmoving swiftly. The confusion has been moved to a minimum and we still have individuals\non both sides of the aisle attempting to find confusion in our elections and there's\nbeen a move around the country and there's a move here in Georgia to bring right choice\nvoting in here which I think will undo a lot of the good things that SB 202 have done\nand the things that we continue to do in our ethics committee here in the Georgia State\nSenator Estabés, you voted against it, tell us why.\nI did.\nI believe that ranked-choice voting should be an option that our municipalities should\nbe able to use, particularly in an effort to save money.\nElections in Georgia cost taxpayers, especially local taxpayers, a lot of money, and we should\nto be ensuring that our municipalities and our counties\nhave options available to them that could potentially save money.\nAnd ranked choice voting has been shown\nto be successful across the country,\nand I don't see a need to hamstring our local folks.\nOK, I want to stick with elections for a little moment\nand talk about how spill you've both seen\nin the Senate Ethics Committee, HB 397,\nwhich would allow for sweeping changes to Georgia's elections.\nIt deals with everything from paper ballots\nto getting rid of the system that allows states\nto share voter information known as Eric.\nSo let's start with you, Chairman Robertson.\nTell us your feelings on that bill.\nWell, it's a very multi-layered piece of legislation.\nI think we started a couple of meetings ago\nto try to dissect it and pull it apart\nwhile I find a lot of it intriguing and positive.\nI do think we have a little more work to do\nto make sure that again,\nthat we're keeping the field clear\nand transparent for our voters as they go out.\nAnd there are good changes we can make,\nbut we have to understand we cannot undo\nthe good things we did with SB202.\nYeah, you voted to pass it out of the ethics committee.\nSenator Estebes, you voted against it.\nTell us why.\nI did, and Donna, I'll let you know\nthat I'm very glad that the authors of the bill\nremove provision in one of the drafts\nthat would have limited counties across the state\nto one early voting location.\nThat scared me to death thinking about\nwhether it's Muscogee County,\nwhether it's thinking about Fulton County,\nit would have made early voting in our elections a mess.\nAnd we've gone a long way to make early voting easy\nfor voters and I would hate to make that much harder\nby some of the language that had been originally included.\nNow, the current draft of the bill still has its issues,\nwhich is why I voted against it.\nThe main issue that I have is if we're trying\nto keep clean voting rolls, then we need to make sure\nthat we have a safe way to exchange data with other states.\nAnd right now, the only organization that does that is Eric.\nAnd I'm concerned that by requiring the Secretary of State\nto remove the state of Georgia from that organization,\nwe would be relying on one-on-one bilateral agreements\nwith 50 states across the country.\nAnd I have some cybersecurity concerns.\nI have privacy concerns with that.\nAnd I think that we should be using taxpayer money\nefficiently and as effectively as possible.\nAnd there's a perfectly good organization that's\nhelped us with keeping track of voters.\nI'm not sure why we would all of a sudden make a change\nbecause of conspiracy theories and opinions of folks\non what the purpose of Eric is.\nWell, that's certainly one bill we'll be watching this week.\nSenator Estevez, I want to change gears a little bit.\nYou have three bills dealing with older adults\nand assisted living and personal care homes\nand their caregivers.\nSo as be 186, 87, 188.\nI understand this topic is personal for you,\nbut what would the legislation do?\nYeah, so I'm a caregiver of mom with Alzheimer's.\nShe's an unfortunate late-stage Alzheimer's\nand my wife and I have had to navigate\nproviding care for her.\nAnd I've seen how challenging the senior care system is\nin the state.\nAnd Donna, we have more seniors in the state\nthan we do young people than we do babies.\nSo we need to make sure that we're doing all that we can\nto ensure that our seniors are able to grow old\nwith dignity, respect, and love.\nAnd that means ensuring that they have a roof over their heads\nand making sure that they're receiving the care that they need.\nSo the bills that I've introduced, one would expand,\nMedicaid to ensure that we're not forcing our seniors\nto go broke before they receive support.\nRight now, seniors essentially have to go to a nursing home\nbefore they receive state support.\nThey could be perfectly fine at home or in a personal care\nhome or in a assisted living facility with lower levels\nof care.\nThat would save them heartache, but it would also\nsave taxpayer dollars.\nI also introduced a bill to significantly increase\nthe caregiver tax credit.\nRight now, that tax credit is $150.\nAnd for all you caregivers out there,\nyou know that that's a drop in the bucket\nbased on what we spend to care for our loved ones.\nAnd then the last bill that I introduced related to this topic\nis a bill that would create an agency on aging.\nWe have agencies dedicated to our children,\nto our families, to public safety, to mental health.\nThere's a group that's just as important as all those.\nAnd those are our seniors.\nSo we should be ensuring that our seniors\nhave our focus in this building, focus in our budget,\nand ensuring that there's an agency head\nand an apartment focused on this topic,\nI think would help coordinate care\nand ensure that our seniors are receiving the care\nthat is there.\nOkay, well, we'll keep watch on that one.\nI know that didn't pass out this year,\nbut you'll keep it going.\nA Chairman Robertson, I want to get back with you\nabout another.\nIt's going to continue.\nOkay, another bill that passed out of the Senate\nalong party lines would keep inmates\nfrom receiving six change care.\nCan you tell us about it briefly?\nYeah, just briefly, what it would do is basically\nanybody that identifies as transgender,\nthey would be treated in prison\njust the way they are now when they were to go inside.\nIf there was any particular therapies\nor things like that, that they are owned,\nas long as it was not therapy related to transitioning,\nthey would still be able to receive those\nwhile in the Georgia Department of Corrections.\nBut those who go in there hoping to fully transition\nwhile they're in there would not be able to do that\nbecause this bill would prohibit state tax dollars\nfor being used to help individuals transition\nfrom male to female or female to male\naccording to their definition\nwhile being incarcerated in the Georgia Department\nof Corrections.\nAll right, well thank you, Senator Estabez.\nI'll just mention that you voted against it.\nI apologize we don't have time to get into that,\nbut I did want that on record.\nI want to thank you both for joining me\nafter a long, busy day at the Capitol.\nI really appreciate this.\nDonna, thank you always for support,\nand we appreciate you, Greg.\nThanks for having us.\nAll right, thank you.\nWell, coming up, when was the last time\nyou checked your monthly charges for Netflix, Spotify,\nAmazon Prime, or new subscriptions?\nDo they fall under hidden costs in your budget?\nAnd it's hard to get rid of them?\nTwo house members are looking to make it easier\nto get out of those contracts.\nStick around, and here what they have to say.\nYou're watching Lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nAt the state capitol during the session and year round,\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen.\nI don't fear anyone.\nThis was a woman.\nPeople wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it by acknowledging our own worth.\nOh, please.\nDon't continue.\nUnderstanding the past gives a sense of the future.\nThis is the first time that anyone has seen this in 2,000 years.\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nOh!\nWhat?\nIt's a battle against time.\nYou think I'm joking?\nIt really happened.\nDon't let anybody tell you who you are.\nI love this life, I love you.\nHistory teaches us to honor the past.\nWhen you look back, they're like, wow,\nthat was pretty special.\nThis is something that's actually\naltering the course of history.\nYou're charged with keeping these stories alive.\nI'm going to be here.\ngotten about a recurring monthly subscription,\nwhich they are still paying for,\nbut are no longer using.\nThen there's this list that might seem familiar.\nHere are the types of forgotten monthly subscriptions,\nmobile phone, internet, TV, and movie streaming services,\nAmazon Prime, music streaming, gaming, and news subscriptions,\nand of course, other subscriptions.\nAnd I'm sure a lot of us see ourselves on those lists\nand recognize it's hard sometimes to cancel them.\nThat's one of the things we'll talk about with our guests.\nRepublican Representative Houston Gaines of Athens,\nhe's Vice Chair of House Appropriations,\nand some of his other committee assignments include ethics,\ngovernmental affairs, and insurance.\nAnd Republican Representative Carter Barrett of coming,\nhe's Vice Chair of Education,\nand also on the House Appropriations Committee,\nas well as serving as secretary on both the banks\nand banking and code revision committees.\nWelcome to lawmakers, busy men who have been\nat the Capitol all day.\nSo thank you so much for being on the show.\nThank you, Donald.\nThank you, Donald.\nWell, you both have served as lead sponsors\non bills dealing with online subscription.\nSo, Representative Gaines, you led HP 528 last year.\nAnd it became law on New Year's Day of this year.\nSo tell us what that does, and then we'll talk about this year.\nSure, well, as you mentioned, the onset,\nyou know, the number of consumers who have issues\nwhen they go to a new subscription,\nit's a challenge for many folks\nbecause they want to cancel their subscription,\nbut it, it's not like this comes impossible\nto cancel a lot of times and you get signed up for something.\nAnd there's no way to get out of what you just subscribed to.\nAnd so that bill we passed last year,\na consumer-friendly bill that allows and ensures\nthat if someone subscribes to something online,\nthey have to be able to cancel it online.\nThey wouldn't have to be forced to come in and person,\nor even we heard of stories where someone was having\nto send a letter by mail,\neven if they signed up for the subscription online.\nSo as a consumer-friendly bill,\nand this year represent Carter Barrett's\nkind of outstanding bill to add to that work we did last year.\nAnd looking forward to his bill getting\nover the finish line as well,\nas we try to continue to help consumers facing this issue.\nOkay, representative Barrett,\nso you have 529.\nTell us what that would do.\nWell, Donna, I'm standing on the shoulders of giants\nand Vice Chairman Gaines over here.\nAnd he built a really nice foundational build\non which I could work off of.\nYou know, someone said to me,\nwhere did the idea come from this bill?\nI said, oh, it came because,\nwell, in just the last two months alone,\nI've gotten six renewal notices\nand I've missed about half of the emails\nand I've had subscriptions going up dramatically\nand you know a $52 subscription comes $275\nand next year it'll become $480.\nAnd I just thought this is just almost surreal.\nAnd I thought what can we do differently\nto maybe an ounce of prevention kind of a thing?\nWhat can we do just to avoid the problem at all?\nAnd I thought whenever I go buy a subscription,\nlet's say for a year, for a newspaper\nan online, a serious satellite radio, something like that.\nWhat if I could just make the thing terminate\nat the end of that period?\nTypically, what they'll do is take my credit card\nand they'll say, okay, great, you were sending you up\nand for your convenience, we're gonna go ahead\nand put you on an automatic renewal.\nAnd there's no problem at all, you'll just,\nI mean, you can cancel them easily, it's no problem.\nAnd then it's, but now the oneness is all me\nto go put that on my calendar a year from now\nand to pay attention and they'll send me an email\nand I might see it or I might not,\nbecause we all get 500 emails a week,\nit seems like or more.\nAnd if you don't catch those things,\nsometimes they'll just automatically renew,\nsometimes it'll dramatically hire a price.\nIn other cases, sometimes those people will come back\nand say, oh, well, you miss your renewal,\nwe'll go ahead and credit you back.\nAnd in fact, we've got an offer for you,\nand we'll do it at a much lower price today.\nOthers will say, okay, you can cancel,\nbut your subscription's good through March of next year.\nYou're not getting your $100 back.\nAnd so everyone sort of has a different iteration of this.\nAnd these are mostly wonderful companies.\nWe just love to use all their services and products.\nBut I thought, what can we do differently?\nI thought, what if we just set it up so that,\nat the end of your term, your subscription's over?\nSo if a company wants to offer me an automatic renewal,\nthat's great.\nBut they should also offer me the ability\nto have the thing terminate at the end of the term.\nBecause when I bought that newspaper subscription\nfor a year, I'm in a year.\nSo at the end of the year, if they provide a great service\nand a reasonable price, I'm going to renew it anyway.\nWhen I get my car and I want to go to the beach\nand that radio doesn't turn on, I say,\nyou know what, I need to go renew that subscription.\nThat's kind of the premise of that's how we got started on this.\nAnd so what your bill would do is it would make the subscription\nend and people would have to renew it.\nIf they choose to do so, so a company can offer me\nan automatic renewal if they won't.\nAnd they also need to offer me the option\nto have it terminated at the end.\nIt's going to shift the owners from me,\nhaving to keep track of it,\nto putting the owners back on them\nso that they can come back and resell me\nif I choose to have it terminated.\nThis bill is supported by the Georgia Council in aging.\nYou know, like I had someone say to me,\ngee, the private equity funds don't like this bill\nbecause they kind of like that whole get it\nand forget it, mentality, from these subscriptions.\nBut I thought, well, there's almost 11 million\nGeorgia's, I think, who will.\nAnd that's why the Georgia Council on Aging\nand Sports has built.\nAs I took this through committee and the House,\nand the Agriculture and Consumer Affairs Committee,\nthe chairman of that committee said,\nthis one of the better bills we've had this year.\nAnd the fact is, it passed out of the committee unanimously,\nthen it passed the House with the vote of 169 to two.\nSo now it's over in the Senate.\nI think it needs a little more.\nIt's in the Senate, we had a hearing on it,\nand it's gonna take a little refining.\nIn fact, Senator Estevez and I met the other day,\nand I met with Senator Dole's all this week,\nand it's gonna take some refining.\nI think we'll probably have it be\none of the first bills up next session, probably.\nI don't see it going anywhere this year.\nI think it will be a two year bill.\nOkay, well, we'll keep an eye on it, certainly.\nCause some of us relate to it very much.\nSo, Representative Gaines,\nI want to get to your bill on about driver's licenses\nin the electronic format.\nSome people have them on their phones,\nbut this will expand it to where you can use them,\nwho can look at them.\nTalk about HB296.\nSure.\nSure, so there's another pro consumer bill.\nOver 450,000 Georgians have the mobile driver's license\nand encourage Georgians to get it on your Apple wallet\nor Android wallet.\nAnd if you go through, actually now through TSA security, you can use your mobile drivers\nlicense.\nBut if you're pulled over by law enforcement officer in Georgia, you cannot.\nAnd so what this bill would do would be ensure if you're pulled over by law enforcement officer,\nyou'd be able to show your mobile drivers license, they would be able to scan it at your vehicle,\nso they don't take your phone back to their car, they could scan it, tap to touch technology\nas they are now.\nBut this does give two years for law enforcement to give the technology that they would need\nin order to scan that mobile drivers license. But again, another pro-consumer\nbill that allows drivers when they're out and about if they forget their wallet,\nthey don't have their physical ID, they'd be able to present their mobile drivers license.\nAnd again, over 450,000 Georgians already have their mobile drivers license.\nThis just ensures that if they interact with law enforcement, obviously they can present it.\nAnd again, right now, if you go through TSA security at the airport, you can use your mobile\nlicense. So we're just ensuring that opportunity expand the use of mobile drivers license.\nAnd you said it's something that we may not see for a couple of years.\nIt'll take a while for it to be able to be something we can do in Georgia.\nSo the bill, as it's written, would any agency that already has a technology,\nwhich a lot of agencies already do, they would accept it today.\nBut for some agencies, it need a little more time to get that technology by 2027.\nThey would have to accept it.\nBut you would start seeing by July 1 of this year, many agencies going ahead\nand accepting mobile drivers licenses,\nbut I don't want to tell a driver\nis don't worry about bringing your ID\nif you have to get pulled over by the agency\nthat doesn't have that technology.\nThey were stuffed two years to get fully ready.\nAnd that bill is in the Senate,\nwhere is it in the Senate?\nIt's sitting in center rules\nif we expect to vote here on Wednesday or Friday\nand I believe we're gonna get that bill done this year.\nOkay, we'll keep up with it.\nWe don't have a lot of time representative Barrett,\nbut do you have an education bill\nthat would speed up the process for IEP\nyour individualized education programs\nfor special needs, the students.\nCan you talk about it really quickly?\nYou got 30 seconds.\nYeah, the Georgia special needs scholarship program.\nIt allows students with disabilities,\nthe ability to receive a state funded scholarship\nto go to a private school that can better meet their needs.\nThere are more than 6,300 students\nto take part in this program.\nIt's been out there since 2007.\nThis bill just makes a very good program,\na little more efficient, a little more family friendly.\nOkay.\nAnd thank you both for your bills that deal with consumers and families, I appreciate\nthat.\nThanks for being on the show after a long day.\nSo that does it for lawmakers today after a long day.\nWe don't have a show tomorrow.\nThe legislature will spend the day working on committees to get as much done as possible\nbefore Sinney died on Friday.\nOur show returns when they return to the Chambers on Wednesday and we'll see you then.\nAll until the end...\nGod bless you all...\n",
  "updated_at": "2026-02-12T01:30:35.259674+00:00"
}