{
  "video_id": "qP4FCXC9rxI",
  "url": "https://www.youtube.com/watch?v=qP4FCXC9rxI",
  "title": "Lawmakers Day 38 03/31/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session on Day 38 (03/31/25) of the Georgia legislative session saw heated debates on several bills, including the Pediatric Safe Storage Act (HB 1), a bill banning transgender athletes from female sports (SB 1), and a bill creating financial incentives for local school boards to approve charter school petitions (SB 82). The session also included the recognition of 33 Black legislators elected during Reconstruction and the consideration of the state's fiscal year 2026 budget.\n\n**Key Actions**\n- **HB 303**: Bill to place a memorial on Capitol grounds honoring 33 Black legislators elected in 1868 during Reconstruction.\n- **SB 93**: Georgia Early Literacy Act, creating new guidelines for teaching reading to young students.\n- **SB 1**: Bill banning transgender girls from participating in girls' sports and requiring changing rooms to be separated by sex assigned at birth. Passed 100-64.\n- **SB 82**: Bill creating financial incentives for local school boards to approve petitions for new charter schools and penalizing school systems that repeatedly deny charter school proposals. Passed 107-62.\n\n**Bills Introduced (First Reading)**\n- None mentioned\n\n**Notable Moments**\n- Before the presentation of HB 268 (school safety bill), Senator Bill Callisert read the names of Appalachia High School shooting victims and asked for a moment of silence.\n- Democrats opposed SB 1, calling it a \"manufactured crisis\" and criticizing the bill for targeting individuals rather than addressing real problems.\n- Republicans argued that SB 1 protects the integrity of women's sports and ensures fair competition.\n\n**Votes**\n- HB 268 (school safety bill): Passed 45-9\n- SB 1 (transgender sports ban): Passed 100-64\n- SB 82 (charter school incentives): Passed 107-62\n\n**Attendance**\n- Quorum was present for the proceedings.\n\n**Adjournment**\n- The session adjourned for the day, with committees scheduled to meet the next day and the House and Senate floor sessions scheduled to resume on Wednesday.",
  "updated_at": "2026-02-12T01:30:35.259674+00:00"
}