{
  "video_id": "qQPE3mP7mbo",
  "url": "https://www.youtube.com/watch?v=qQPE3mP7mbo",
  "title": "03/04/2024 Senate Committee on Health and Human Services",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 37,
  "summary": "Here is a summary of the Georgia Senate Committee on Health and Human Services session on 03/04/2024:\n\n**Overview**\nThis session focused on discussing and considering House Bill 1078, which would enable the Georgia Department of Community Health to develop and implement a PACE (Program of All-Inclusive Care for the Elderly) program in the state. The PACE program aims to provide comprehensive care for elderly and disabled individuals, allowing them to remain in their communities rather than being institutionalized.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The committee discussion focused on the details of the PACE program, including how it would provide more comprehensive and accountable care compared to current home-based services.\n- There was a discussion about the legal duties and obligations of PACE providers to ensure clients receive the necessary care, in contrast to the potential gaps that can occur with current home-based services.\n- The committee members expressed support for the bill, recognizing its potential to improve care for elderly and disabled individuals while also saving costs by keeping them in community-based settings.\n\n**Votes**\nNo recorded votes took place during this session.\n\n**Attendance**\nQuorum was present, as the committee members were able to have a substantive discussion on the proposed legislation.\n\n**Adjournment**\nThe session adjourned, with no specific date provided for the next meeting.",
  "transcript": "You\nThank you for allowing us all to be here today. God I pray that you give us clear minds\nso that we can think through and make the best decisions for the people of Georgia.\nname a pray amen. Thank you. We have two bills today. House Bill 1078. Chairman\nof Petrie is here and House Bill 1083. Leader Bruce Williamson is not here and\nI'm gonna be doing that one so I'm gonna give you a little heads up. I'm giving you\nno heads up until just now so apologize about that. If I'm sure you can handle it.\nSo Representative Petrie you can be here or there. You want to sit down. That's\nThat's great.\nWitness number two and we do have on 1078 we got one, two, three people that have signed\nup so tell us a little bit about your bill and the floor is yours.\nThank you Chairman and my understanding is my senator is going to be carrying this bill.\nSo I think you got this one also.\nHappy to do it.\nAll right so Mr. Chairman House Bill 1078 this is a Department of Community Health Bill.\nI think most of you may be aware last year the department began studying the idea of\ndoing a pace program in Georgia and what this bill is is the enabling legislation for\nthe Department of Community Health to develop and implement a pace program. Paces in acronym\nwhich is program of all inclusive care for the elderly and Mr. Chairman you and I have\nWe had some experience with the source program and in our careers at home, a wavered service\nthat long ago was really almost patterned after pace, although it was a waver and it was\nnot a capitated program like pace.\nThis is a true pace program, the goal, give people opportunity to stay out of institutions,\nkeep them in the community longer.\nWhen we do that, we save money for taxpayers by keeping people in a less institutional setting\nand we give people a better quality of life.\nSo what this program does is basically the provider\nwould provide all of the kind of all-inclusive care\nfor these individuals that are gonna be\nage-blind and disabled, duly eligible,\nMedicaid and Medicare.\nAnd so they're providing the preventative care,\nthe primary care, the acute care, and the long-term care.\nAll of that is provided by these individuals.\nIt's a voluntary program.\nThey choose this as an alternative institutional placement.\nAnd I said earlier, it's a capitated program.\nThat's what makes it different from our waivers\nthat serve this population today.\nIt's currently in 32 states.\nI do want to emphasize that initially,\nthere'll be three sites, Fulton County,\nand these were sites that were studied by the department,\nhad the population that could benefit from the services,\nFulton County, Bibb County, and Chatham County.\nI think that's\nPretty much explains it. Mr. Chairman glad to answer any questions\nWe have any questions from the committee if not we have two people. I'm sorry three people that wanted to test fine\nAll right\nHey, my friend from chat. I'm great to have you here\nso to understand\nAnd again, I'm not I'm not by any means an expert of this and I just appreciate your expertise\nSo, if somebody goes into an institutional setting now, obviously the institution that takes\nthem in has full responsibility for their well-being.\nIf they're at a home setting, they get services, but there's no strict duty to provide those\nservices.\nThat if someone doesn't show up, it's kind of a, I mean, I've had constituents that have\ncalled me that they're getting home care.\nAnd if the person doesn't show up to change their diaper and bring food to them, it's\nIt's like, oh, sorry, we missed it today.\nWe'll come back tomorrow, maybe, and it's just,\nthere's not this duty.\nDoes this create the same duty that you have\nif you're an institution setting that you provide care?\nYeah, so let me, first of all, say,\nso we don't know where there's,\nin that analogy you just use,\nis that private sector services?\nIs it services to a Medicaid waiver?\nIt could be, is it home health through Medicare?\nSo it could be from a multitude of angles,\nbut to answer your, I think your question\nyou're looking for,\nis somebody going to oversight all of this\nto see that those services are provided yes,\nand that would be the pace provider.\nAnd so, yes, it will better ensure\nthat those kind of gaps don't happen.\nThat's correct.\nAnd I know we don't like to talk about lawsuits and stuff.\nI'm just talking about real legal duties,\nand they have a legal duty to provide the care.\nIt's not a sort of a secondary service then.\nIt's that, okay.\nIt's an all, they accept it.\nSo the provider that chooses to be a pace provider,\nand there are three now that are interested\nand we're working with the department.\nThey're taking on that burden\nto provide all of the care needed for that individual.\nSo if a family member of the person getting care\nsaw that they were missed two, three days in a row\nor weren't getting critical things,\nyou'd have the basis of a suit.\nYou can actually force them to do that\nbecause today you don't have an action to do that.\nWell, I think what, so what would happen,\nSo in the world we live in today,\nI wanna make sure I'm speaking clearly of this.\nSo we can't ensure that always an employee\nis gonna show up one time or something of that nature.\nWhat I'm saying is that provider,\ntheir duty is to make sure that if somebody's not there,\nthey get somebody else there,\nwhich by the way is already the duty\nof home care under licensure.\nSo, but I can't tell you that there's not failures\nbecause there are failures as we all know\nin hospitals every day, in skilled nurse facilities every day,\nand yes, in community-based services every day.\nBut the folks that are, whose duty it is to see\nthat that individual is being served and served well,\nit will be the provider, the pace provider of these individuals\nthat voluntary choose this, voluntary choose this service\nas an alternative to skilled at skilled nursing home placement.\nI love this Bill, Ms. Chairman.\nI just had to ask that question.\nI want to thank you.\nGood question.\nI won't belabor the point out of constituent\nwho is wheelchair bound, can't get out of the wheelchair\nand bathe themselves, would have sat in his own business\nfor 60 straight days.\nNo one came and checked on him for 60 days.\nOnly friends did that for him.\nBecause when you get home care now as a disabled person,\nit's not the, I don't know the right term,\nit's not the obligation that you have\nwhen you're in an institutional setting.\nAnd if this closes that gap, that would be a huge use.\nSo was this in a skill nursing facility or this was at home?\nThey were at home.\nThey were at home, I got you.\nAnd they choose to be there.\nThey could have been in a skill nursing office.\nPart of the qualification, just an education for the committee\nand folks listening is that they had to be eligible for a skill\nnursing facility, IE nursing home.\nThey're going to meet a level of care.\nTo be eligible for this program.\nYes, sir.\nAnd that's, and he was, opted to be home and it sounded like it.\nBut we opted to be home.\nThat was the fatal mix.\nOnce he opted to be his home, he didn't have the guarantee.\nAll right, so I'll say one last thing,\nMr. Chairman, if I may, to the very good question.\nSenator Sessler, so here's where I think\nthis would be advantageous.\nUnlike some of the other programs,\nlike through Medicaid waivers, maybe,\nand where you might have limited choices,\nso here's what'll happen with a program like this.\nThe provider, if they discover that the individual\nbeing served says, I don't like ABC,\nI don't like this agency, they can replace them\nand put somebody else in there.\nAnd they have free reign to do that.\nAnd so I think that, again, as you get feedback\nfrom the individual serve, your goal is make sure\nthey get served and also make sure they're satisfied.\nBecause again, they're choosing the services\nand alternative to skilled.\nRemember, so just to be clear,\neverybody is entitled to skilled nursing home placement.\nIt is an entitlement.\nHome and community-based services are not entitlements.\nAnd so people choose this and yes,\nsomebody's failing, replace them.\nAnd I think this makes it easier for a program\nthat the Pace Provider to say,\nyou're failing us, you're out,\nwe've put in somebody new in.\nSo I think it helps resolve that problem.\nAppreciate we have Deborah Stokes\nand then Tom Bauer and then Kathleen Benton,\nI'll be less.\nWhich everyone you wanna do?\nNow's good, all right?\nI'm sorry, I skipped my vice chair.\nYeah, I really like this idea, Mr. Chair.\nbut I had two questions for you.\nOne is, can someone go from a SNF to PACE?\nIn other words, once they're in a skilled nursing,\nif it seems appropriate that they could be provided\nservice at home, can it go that direction?\nUnless someone here with the department\ntells me otherwise, my answer is absolutely that case.\nOK, and then the second thing is you said\nseveral times it's voluntary.\nWhat's the outreach going to look like?\nHow are people going to know that they have this option?\nThat might be better coming from the department,\nbut that's a great question, Senator,\nand I think the department might better answer that.\nWe have, let's do three people to testify,\nand then we'll talk about questions\nand go from there.\nMistokes.\nThank you, Mr. Chairman.\nAnd committee, this, my name is Deborah Stokes,\nI'm Executive Director of the Georgia Council on Aging,\nand it's Coalition of Advocates for Georgia's Elderly.\nWe are very much in favor of this legislation\nas it will help the growing aging population be able\nto stay home longer.\nAnd we know that that is the goal,\nthat is the best place for our seniors to be,\nis at home with all of the services that they need.\nSo we are very much in favor of this bill.\nThank you.\nThank you.\nTom Bauer.\nThank you, Mr. Chairman.\nMembers of the Committee, I'm Tom Bauer with Leading H. Georgia.\nWe serve at least 125,000 seniors in our various facilities and adult day\ncenters, so we cover the gamut from Lopscale Retirement to subsidized\nhousing.\nMs. Stokes was very eloquent exactly on why we're supporting this bill.\nWe would like to see as many options as possible for seniors to get the\nservices they need, access the services without being in skilled nursing.\nIn particular, we have many subsidized homes and hug facilities and things like that.\nAnd these are folks who are living independently and they're going to get to a point where\nthey can't live alone.\nAnd this would be another tool in the toolbox to use the phrase that everybody uses around\nhere.\nSo we very much support the bill.\nThank you.\nThank you, Mr. Bower.\nAnd Kathleen Benton.\nI'm Kathleen Benton and I'm the CEO of Hospice Savannah and we're out of Chatham County.\nI'm an interested provider in pace and I've actually been studying pace across the country\nfor the last two years to see the benefits it could have in our own state.\nAt all of our neighboring states actually have pace as well and it's actually very instrumental.\nWe serve about 4,000 patients and caregivers, so we've seen the deficits just as you've\ntalked about in what we can't do in health care.\nAnd PACE is an excellent disruptor to all of that.\nVery briefly, I felt that it's helpful for you to meet a fictional patient named Mary.\nMary is a patient that we see every day, an 85-year-old with congestive heart failure,\nAlzheimer's that is advancing impulmonary disease.\nHer son and daughter work every single day to get her to the neurologist, the cardiologist,\nthe primary care.\nShe's dealing with what she's talking about as far as home caregivers who don't show\nup.\nThe family is exhausting themselves, supplementing these home caregivers.\nAnd Mary doesn't want to go to the nursing home, though she is eligible.\nThe family is exhausting themselves.\ncare resources are being exhausted, Mary's gone in the hospital seven times in a year.\nShe's gone to the emergency room with falls three times in the last year.\nSo how could the trajectory be different for Mary's family with pace?\nInter pace and you have immediate transportation.\nSo the first step is to take this off the family, the home caregivers go into the home and\nget Mary ready every day.\nIn answer to your question, if they don't show up, the entire team knows about it because\nyou also have interdisciplinary review of the providers and you have the transportation\ngroup that will be out there to pick up Mary for one of her appointments that are scheduled\nto see neurology or cardiology.\nThen Mary will be taken to the PACE clinic.\nThis is a structured building that is built around the needs of patients.\nIf Mary needs fluids that day to make sure that she's not left dehydrated, if Mary needs\nphysical therapy to make sure that she doesn't fall when she gets home, all of that occurs\nduring the day.\nSo Mary is well taken care of and reviewed by this PACE program.\nAnd at night, Mary goes home.\nSometimes the family helps to get her to bed if they're not there because they're out\nof town or because they just can't do it with all they're doing working\nthemselves, then the pace will also show up to the home and make sure that Mary\ngets a nice meal and goes to bed. If Mary needs her hair fixed the next day or\nneeds the dentist, the pace covers that. If Mary has a fall in the home in the\nmiddle of the night and needs to call 911, the pace meets her at the emergency\nroom, make sure she doesn't stay at the hospital too long, that a subsequent\nsurgery goes well, and even rehabilitation in the nursing home is followed. You\nutilize all of the services that are in health care, but you bind them all\ntogether with the pace. And that's really the benefit of having this program in\nour state. I'm also open to take any questions, but I'll say I'm so grateful to\nSenator Watson, I'm so grateful to\nRepresentative Petrie and to the\nDepartment of Community Health for\nsupporting this innovative program.\nPut simply it will help keep people\nin their homes with round the clock\ncare and really help families do this.\nAny questions?\nSenator Sassler?\nHard hold on, let me get your mic.\nOkay.\nJust very simply again I'm excited\nto appreciate your being in this\nand I appreciate your very clear\npresentation that's what I was\nlooking for.\nSo to be clear, the pace provider is fully accountable for their outcome.\nFully accountable and fully accountable to the bottom line.\nIf they don't do a good job, they're going to pay more because Mary or any other patient\nis not going to do as well in the health care continuum.\nThank you.\nNo, I got you.\nI see. Everybody see that particular point she made.\nEight center Hodges.\nI would imagine there's a substantial difference in cost.\nCan you speak to that a little bit?\nAbsolutely.\nIn compared to nursing home patients, it's about a 12% cost reduction with pace.\nAnd most of that is because the care is no longer disjointed and the capitated network\nis motivated to make sure that there's no redundancies.\nSo for example, if the patient's going to a neurologist and a nephrologist, all of that\nis married together in the interdisciplinary team.\nMedication management is very thorough and there's less hospitalizations and less number\nof days in the hospital during the hospitalizations, which allows the resource reduction.\nIn other words, it is since your assessor said, if someone doesn't show up and they get\na bed soar is going to cost them a lot more money and their capital their\ncapitated fee will certainly not cover their call spainy means so they're\nmo they're motivated on multiple different levels exactly so and it's it's\ngenerally cheaper to provide care and in someone's home than it is in a\nskilled nursing facility.\nThe other questions must be in we sure appreciate you coming that was very\ninsightful appreciate your example there.\nthank you thank you oh you know I apologize okay all right you're on number\n10 no 11 okay about a way just the internet apparently is down yeah and but\nour we're being taped and it will be available later if anybody is dying to\nlisten to us again. Mr. Hood for the Department of Community Health, thank you\nSenator Chairman Huffsteadler has a question. So we had looked at a model a\nyear or so ago where on our subsidized housing we had people that we were\ntrying to mingle on the same floor and the rules wouldn't let us do it. I don't\nknow if you're familiar with that or not. We're trying to get a pilot done on it.\nYes, sir. I think I'm familiar with what you're referencing so so and and we never really got to where one of my question is does this help in that?\nI think it does because those individual members as was referenced earlier and subsidized housing they would be in a\nIndividually if they meet the sniff level of care they would be able to enroll when still saying that subsidized housing and then they would have all the\nBenefits that that pace would offer and it doesn't have the\ndoesn't have the restrictions that have a licensure\nthat you're referencing.\nSo they're not mutually exclusive?\nRight.\nOkay.\nSenator Chairman, Hustetler, number five,\nstill shouldn't have that memorized, shouldn't I?\nYeah, okay.\nWell, make a quick, the geography,\nwe talked about Fulton, Bib, Chatham,\nwhat's the prospects of this being a statewide thing\nand what's gonna be required to do that?\nYes, sir.\nSo what we've done is last year,\nthe legislature directed us to do an assessment.\nWe reached out to the National Peace Organization\nand they have a formula which goes through an algorithm\nand demonstrates where peace would be most successful\nand where there's sufficient numbers of eligible members\nto make it successful from an investment standpoint\nand operational standpoint.\nAnd in doing so, we asked for those specific locations\nbecause we had interested parties that already had facilities\nthere to that would go to a pace organization.\nYou basically have to have a 10,000 square foot building\nthat would meet the services that were referenced earlier\nin testimony.\nAnd then you can serve a population of zip codes that surround\nthat within a certain mile radius.\nWith their algorithm, they demonstrated\nthat those three had that.\nLargely, we think that other population centers\nare going to be eligible.\nWe didn't specifically look at those\nbecause we didn't have the same interests\nthat had been demonstrated.\nBut certainly, Fulton and DeCavs showed the greatest number of populations you might expect,\nbut also expect Cobb, Gwyneth, Columbus, Augusta, so forth, you know, we qualify.\nBut if we act on this and the CEO who spoke to us who's doing this in Chatham decided,\nyou know what, I'm going to open up a Cracker Jack facility in Gwyneth County, that\ncan start providing the service as long as the capabilities there or do we need to\nappropriate dollars, do we need to act again legislatively or where does that stand?\nSure, let me explain it a little bit further.\nSo what has to happen, what this is authorizing the department\nto do is to go to CMS and submit a spa\nto add this to our state plan to authorize\npaste services as a Medicaid covered service.\nPaste is a Medicare program.\nIt's in a number of states, but it's set.\nAll the rules and regulations are set by Medicare,\nwhich is why this legislation is really so, so small.\nBecause we're going to rely upon everything\nthat Medicare has as an impolining entity.\nAnd they're just to add to that.\nThey're also a subsidy to this program.\nThey pay a substantial amount for those\nwho are dual-eligible.\nAnd this is largely focused at a Medicare population.\nIf we did not have PACE, which we don't have today,\nall the other things that we offer that are on Medicaid\nare 100% state match.\nSo this has this subsidy from Medicare as well.\nSo with that, that's how we will implement.\nbut in doing so to identify locations,\nwhat we have to do is to make sure\nthat there's a readiness component of that.\nThe way that we initially intend to do that\nis to hire a contractor to go out\nand do what is known as a request for qualified vendors.\nThey'll set out all the things that would be necessary,\nlargely that building and staffing and all the things\nto demonstrate that a facility is going to be ready\nwithin a certain time frame.\nand that's really why we focused on these three\nbecause we knew we had to identify providers\nwho likely would be able to meet that.\nIf we see additional interest,\nwe would come back the next year\nand then we would do that again\nand allow for those additional providers,\nwhich is what we expect to do.\nI will say,\nI do expect that it might acquire additional appropriations.\nWe've only got a small number of this year.\nIf we have to do additional administrative tasks\nand actuarial services and all that at a larger scale,\nwe do anticipate that we would bring that forward as needed.\nThank you, Mr. Hood.\nChairman Walker.\nI'm on board.\nMy follow-up even though I'm not even on the internet,\nbut like the concept, certainly,\nI wondered if meals are part of it.\nAnd my other question is, well, I have two questions\nif you don't mind, Mr. Chairman.\nSo I believe that it's contemplated anything, any service component that they would need\nthat they would have met.\nI mean, it's a total managed care model.\nSo if there's that need, then I suspect that they will find a means to do that, whether\nit's through its other service programs to provide meals or meals on wheels or whatever\nthe case may be, it's going to vary probably depending upon that person's circumstance.\nI expect the facility, which really acts in addition to the health care component, really\nas a senior services center, that they have activities and meals and all the things that\nare associated with that, but I think it's going to vary to be honest, Senator.\nThank you.\nYou have the follow-up question.\nYes, sir.\nYou mentioned it's like a capitated fee, and so there's an incentive from the provider,\nthe pace provider to use these wraparound services and try to keep them out of the hospital\nand that kind of thing.\nBut it also seems, it says, transportation is included.\nI mean, what if they are real profit-oriented and are like,\nno, we're not going to take you to get your haircut or,\nyou know, you already did that.\nWe're only going to do that six times a year or,\nI mean, who's overlooking all this and making sure\nof the making money that can get in the way of taking care of the patient or the patient.\nSo a pace program is going to be very equivalent to a license program, even though we're not\nseeking license, we're going to follow all of the certification through the Medicare\nguidance.\nSo they would be able to complain to the department, it would meet that similar complaint.\nAnd then just as a reminder, this is a total voluntary program, if they're truly dissatisfied\nand can't reach resolution, they can disemroll and go back to regular Medicaid services\nwhether that be HCBS or they could go to a nursing home.\nI will say that if they don't, if they digress and they end up in a nursing home though\nin the PACE program, PACE is responsible for that nursing home care.\nSo there's truly incentive to try and keep them not only out of the hospital but out of\nthe nursing home.\nMakes sense.\nGot you.\njust add one thing to that.\nSo this is all value-based cares what it sounds like.\nAnd incentives are for the quality to drive the cost, right?\nSo the outcome should be there's motivation for the outcomes\nto be better, but then cost less money.\nI mean, that's how value-based programs work.\nThat's right.\nI mean, how often does it say in this committee\nthat the quality drives price, right?\nNumber two, three.\nThank you for being with us, and I apologize that the chairman had presented his bill pretty\nmuch almost completed when I got here, so if I'm being repetitive, I apologize.\nBut we've had a community-based services for eons, and it's been characterized as being\nunderfunded. You know, we're always pushing for more funding of community-based services.\nHow does that reality sync up with this proposal?\nYes, ma'am. Senator, I'll answer that, and then Joe needs to, he can as well. So, to\nme, they live together. So, you're right. For many years now, we've been trying to continue\nto increase funding for home and community-based services, largely through Medicaid waivers\nto keep people in the community longer, who do have a skilled nursing home\nlevel of care. And we're doing that. We continue to do that. This will give us\njust another route, another choice, if you will, for individuals who have\nMedicare and Medicaid to do it a different way. So it's not through a\nMedicaid waiver, but it's through this this pace model. And which is a\nepisode, it's different entirely from a fee for service provider through\nhome community, community-based services because it's a\nThey're all fee for service at this time and so this will be different, but it just gives\nanother choice for that same population, same population, different option.\nSo it's just another way of serving people who, as we all know, are the people really\nMedicare has all the way back to the 60s been most targeted to, age blind, disabled,\nelderly and so it kind of captures that group with another opportunity is the way\nI would describe it and Joe may have a better answer. Mr. Hood, anything to add?\nYes just just one other thing and that is remember this is a\ncapitated rate and as the chairman referenced the community-based services on\na waiver and those rates are Medicaid rates which are really at the to raise\nthose rates are you know would be an ask to the legislature to do I mean you\nbeen very kind this past year. We've raised rates for the first time for many of those waiver\nprograms in a long time. The difference here is a capitated rate, much like the CMOs,\nit gets done by an actuary every year. And these are largely driven by Medicare rates\nbecause this is a Medicare program. So not really set by Medicaid. So you've got an actuarial\nrate, which is going to be revisited every year and updated. And then you've also got the\nMedicare participation, which is driving that, which ensures that you're going to get\na competitive rate and that it's going to remain so as you go forward.\nIt sounds like why is it taking us so long, right?\nOkay.\nAny other questions from the committee?\nThank you, Mr. Hood, Chief Operating Officer of DCH.\nSo, is it anticipated that this approach will have a cost savings that the home community\nbased care does not have?\nIt's a cheaper, less costly way to deliver with the hope of better services, I mean,\nis that?\nI would describe it, Mr. Hood may have to answer that.\nThey both offer savings, traumatic cost savings over skilled nursing, institutional placement,\nso the degree to which one may be cheaper than the other, it may be that Mr. Hood should\nanswer.\nWell, Medicare is subsidizing this program, so I mean, I would say that's a large part\nof why we expect savings.\nI don't know, there's certainly not going to be savings per se immediately because what\nyou're doing is you're going from a standard of care where there is no\nmanagement. Largely, most of these members are in fee for service today and they\nare managing their own care. And then what would traditionally happen is they\nwould reach a point where they have to go to the nursing home. They're\nfamily or themselves and then they go. If they elected pace, then that option\nwould divert them from a nursing home. It's you're going to see savings\nbecause of that managed care over time and the diversion from the nursing\nhome, but from a financial standpoint this next year, I don't expect to see savings.\nWe did a review of that, and what we expect is that it's budget neutral in the first years,\nbut it's really difficult to pin that down because you're trying to estimate who is indeed\ngoing to go to a nursing home versus not, and we did our best attempt with that with the\nactuaries and determined that we believe we'd budget neutral.\nAnd the long term, of course, we would have savings because we would not be sending people\nto a nursing home and keeping now the hospital and just just the managed care component\npart.\nBut yet this bill exempts pace from meeting the requirements of a managed care organization,\nright?\nRight.\nBecause we are using the Medicare standards and all the Medicare certifications and that's\nwhat we want to use to manage the program because of that subsidy and their participation.\nThat's the reason for that.\nas if you had a CMO, that is not the case, that is purely Medicaid, or if you had an HMO\nlike Kaiser, that's a private entity, that's generally what's expected for in the statute\nand what it would regulate, and this is separate and important because of the Medicare component.\nRight, and I think the state, an important difference is that there's a management of\nthe overall needs of the client,\nas opposed to relying on the client's own personal support\nsystem to manage all that.\nIsn't that absolutely?\nAbsolutely.\nIt's a piece of the puzzle, as we like to say here.\nAll righty, I'm not sure there's a wrap up\nthat's needed on this one.\nSo the consideration is wrapping up.\nI got Senator Chairman Sessler says, move, do pass.\nWe have a seconded.\nWe'll do Chairman Walker and any further discussion.\nCan't imagine there would be.\nSo we are, all those in favor say aye.\nAll those opposed, like sign passes unanimously.\nThank you, Chairman Petru,\nand I'll be happy to carry that bill.\nThank you, Chairman.\nI'll get it to you.\nAll right, I'm, as I said earlier,\nWe're going to swap out here, because later Williamson is not here.\nI'm going to carry the bill for him, so I'm going to turn it over to my vice chair.\nOkay, our next bill is House Bill 1083, and that's representative Williamson's bill.\nAnd they else say that I have is 540348S, which is a committee sub.\nthat what you have, Senator Watson.\nThat is it.\nOkay, floor yours.\nThank you chair lady.\nThis has basically a date change.\nWe're relating to adult residential mental health programs.\nWe passed this legislation a couple years ago\nand the rules took longer than we anticipated\nlonger than we anticipated, but the rules have been done.\nThey just didn't get done until the end of last year.\nSo folks who have been in this adult residential mental health program\nhave had provisional licenses.\nAnd this just basically extends the license from, as you'll see,\nfrom those dates on lines 30 from December to June.\nabout a year and a half and the same for line 33 and then again about a year\nand a half on line 38. And that's it. I have one question for you. So is it\ncorrect that the rules have been promulgated but they just haven't had the\npublic comment period and all that or they have not been promulgated? Yeah I'd\nlove that. Mr. Hood can save me. So the rules have we had draft rules and we had public\ncomment and we have not reached resolution on all the public comment that was there and\nsome of those comments were from the primary provider who had the provisional license.\nSo we need additional time to get to a place where we feel comfortable to come back to\nthe board and adopt final rules to try and work through those commentary. We certainly\nwant don't want to displace the provisional license that is in place. So the\nlegislation is to extend that while we continue to work through that process.\nOkay questions from the committee. We have one person signed up to speak. Stan\nJones? Joe Hood has reported what I would have said. Stan Jones, the\nrepresent Scallon Trail, which is the provider\nthat it's been a partial care on before.\nAnd we added a residential subacute program for jobs\nlike we had on the show.\nWe'll just need a little more time to get finished.\nThank you.\nOK, any questions?\nOK.\nOK, we have a motion due pass by substitute, right?\nYeah, LC 540-348S, and we need a second.\nOkay, Senator Butler, and any further discussion?\nOkay, all in favor say aye.\nAye.\nOpposed, same sign.\nOkay, the bill passes, by substitute.\nThank you.\nSo just a heads up on our Wednesday we'll be meeting we have three or four bills that\nare already teed up and we'll continue to march three we have really counting this\nwhen we have four meetings maybe five meetings to get all the bills done and that's not\njust for HHS, that's for everybody.\nSo just FYI, I really appreciate that meeting adjourned.\n",
  "updated_at": "2026-02-12T19:26:39.272291+00:00"
}