{
  "video_id": "QvULEy8F4yY",
  "url": "https://youtu.be/QvULEy8F4yY",
  "title": "Georgia House - Day 28 (2026-03-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 28,
  "video_date": "2026-03-08",
  "duration_minutes": 215,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session included the passage of several bills related to taxes and public safety, as well as the adoption of various privileged resolutions.\n\n## Key Actions\n- **HB 428**: Updating American Industrial Classification Codes for the high-tech sales tax exemption\n- **HB 317**: Defining \"innkeeper\" to include marketplace facilitators for hotel/motel tax collection\n- **HB 534**: Providing offenses for promoting illegal drag racing and lane drags\n\n## Bills Introduced (First Reading)\nNo new bills were introduced in this transcript.\n\n## Notable Moments\n- Adoption of privileged resolutions honoring various individuals and events\n- Debate and passage of HB 428, HB 317, and HB 534\n\n## Votes\n- HB 428 passed unanimously (170-0)\n- HB 317 passed 147-22\n- No other recorded votes mentioned\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "Mr. Clerk, would you ring the bell, please? Thank you. Clerk will read the caption to a group of privileged resolutions. Honoring the life and memory of James Garland Vance, Senior. Congratulations, Commending, Jennifer Wilson for receiving the 2021 Yellow Rose, NICY-T Randall Service Leader Award. Commending University System of Georgia Outstanding Scholars on Economic, Academic, Recognition Day for 2021. Congratulations, Commending, Doctor Monica Parker for receiving the 2021 NICY-T Randall Service Leader Award. Commending the first annual Yeruba Cultural Day, Virtual Celebration in Georgia on March 27, 2021. Congratulations, Commending, Wendell and Stiegel for receiving the 2021 Yellow Rose, NICY-T Randall Service Leader Award. Congratulations, Commending, Hayes Automotive Group, and Recognizing Commending, Leisha Johnson upon the Grand occasion of her retirement. And for other purposes that completes the reading of the privileged resolutions. Is there any objection to the adoption of the privileged resolutions? The chair here is none, and the resolutions are adopted. We're going back to the rules calendar. We are going back to the rules calendar. We're going to today's first rules calendar. The clerk will read the caption to House Bill 428. House Bill 428, by resident Martin of the 49th, and others to be entitled back to amend. Chapter 8, the title 48 of the Fisher go to Georgia annotated, and the title is, in use taxes, so it's to change certain definitions regarding such taxes. This bill then referred to the Committee on Ways and Means that Committee recommends this bill do pass by Committee Substitute. Chair recognizes Chairman Chuck Martin to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House, this is a short bill. It seeks to make some changes to update American Industrial Classification Codes for the high-tech sales tax exemption. So what you see on the first portion of the bill is just simply updating those codes to current years. We found out that this exemption is used by a number of companies, but there's not good reporting. So really all the bill does. So if the sale of the tax exemption is used, the sale of the tax exemption is used by a number of companies, so we know the value of the tax exemption is required. So if we approve this today, the credit will remain in place, and it will provide a transparent accounting for this exemption so that we can move forward and do this for this exemption, and perhaps others. Any questions, Mr. Speaker? You have no questions? You'll be well and asked for the favorable consideration. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the Report of the Committee, which was favorable to the passage of the bill? The Chair here is none. The Report of the Committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 428 will vote aye. Those opposed to vote no, and the clerk will unlock the machines. Thank you. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 428. The eyes are 170. The nays are zero. This bill, having received the Reconcert Constitutional Majority, is therefore passed. Clerk will read the caption to House Bill 317. House Bill 317 by Rosenthal Stevens, 164, and others to be in total enact to amend our 3rd chapter 13 in Title 48. The official put a Georgia annotated relating excise tax on rooms, lodging, and accommodations. Those are revised the definition of inkeeper to include marketplace facilitators. This bill ever referred to the Committee on Ways and Means. The Committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Stevens to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, House Bill 317 bill is upon last year's marketplace facilitator legislation to improve the efficiency of collection of hotel motel taxes. As you might remember, the marketplace facilitator was on sales tax. This has to do with hotel motel taxes and the $5 hotel fee that it levels the play and feel if you will between the short term rentals and the hotels. Specifically, House Bill 317 does the following things. It defines an inkeeper which is an entity required to collect and remit hotel motel taxes to include the marketplace inkeepers like the VRBOs and the Airbnbs that facilitate lodging and accommodation transaction. Mr. Speaker, this also is these taxes, these hotel motel taxes, are taxes again that are currently due and sometimes not collected by the owners. Again, these taxes are currently due and owed but sometimes not collected. This, Mr. Speaker, also adds the $5 fee. As you might know, the hotels have been talking about this. Since we put it in, levels of play and feel if you use one of these VRBOs, you're going to collect the $5 fee as well. Unless you're a long-term rentor 30 days or more. You're exempt from both. Based on the fiscal note, from 448 last session, the bill would collect approximately $30 million in annual state, annual county and city hotel motel taxes. And again, these taxes are currently owed and sometimes not collected. Mr. Speaker, I'll answer any questions if there are. This is a feel leveling position for these short-term rentals that are to be treated exactly like our hotels which have been asking us for the longest to do this. So I'll accept any questions if there are any. Do not appear to have any questions. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 317. The eyes are 147. The nays are 22. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 534. House Bill 534, members. In the bottom of the 72nd and others, the Natal and Act 2 men are to the chapter 11 and the total 16 in the fish go to George Annotated, relating offenses against public order, so is to provide for the offensive promoting illegal drag racing and lane drags. This bill having referred to the committee on public safety and Homeland Security, that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Bonner to present the bill. Thank you, Mr. Speaker. This even arise to present House Bill 534. This bill seeks to address the activity of drag racing and lane drag, both of which are currently criminal offenses, even as recent as this weekend, the George Department of Public Safety and Atlanta Police Department went after this illegal activity over the weekend. They issued an excess of 89 citations, two felony arrests, non-pursuits and multiple injuries. This bill has been an issue that we've seen on the rise of the last several years. Law enforcement came to us and asked for another tool in order to combat this, and that was going after the folks that actually organized this activity. So House Bill 534 adds the additional offenses of promoting or organizing an exhibition of illegal drag racing or lane drag and reckless stunt driving. The penalties are set forth in the bill and are very similar to our DUI penalties. And with that, Mr. Speaker, I'll be happy to stand for any questions. You do not have any questions. Thank you. I'd ask for a favorable consideration or I yield the will. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. The members voted if so. The clerk will lock the machines on the passage of House Bill 534. The eyes are 130. The nays are 39. This bill having received the requisite constitutional majority is therefore passed. The House is going to be at ease here just for a few minutes until we get the new supplemental rules calendar in and the bills. I'm told it should be here momentarily. You You You You You You You You You You You You You You You You You You You You You You You You You You You You You You\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you 17 year olds, a lot of y'all think 17 year olds, if you get arrested as a 17 year old, you go to juvenile court, that's not true in the state of Georgia, or one of three states with this horribly antiquated practice of treating 17 year olds like grownups. So this right here raises the juvenile court age, so 17 year olds would actually go to juvenile court where they belong. That's what the bill does. What the bill does not do is it does not let 17 year olds off, it does allow them to go to juvenile court which is a more rehabilitative process, but they're much more likely to reoffend. A 17 year old charged with a serious offense would still go to state or spirit court. 123 counties had fewer than 50 arrests of 17 year olds, so we're only talking one a week, so the numbers are not that great. Nor is it an unfunded mandate. I said on public safety appropriations, and over the last three years we have increased funding for dedicated prosecutors for our juvenile courts and also our public defenders for juvenile court. Mr. Speaker, that is the bill. I know we have a long calendar in front of us, that is the bill in essence, and I will stand for any questions. You do not appear to have any questions. Thank you, Mr. Speaker. I urge your favorable consideration of this important measure. Thank you. Is there any objection to the previous question being ordered? The chair here is none, the previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is none, the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is none, the rules committee substitute is adopted, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none, the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 272? Will vote aye, those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 272. The eyes are 113, the nays are 51. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 291. House Bill 291 by Representative Dempsey, the 13th being titled an act to amend code section 23, 411 of the official code of Georgia and its administrative relating the definitions regarding tuition, equalization grants, private colleges, and universities. This bill ever referred to the Committee on Higher Education. That committee recommends a disbilled new pass by committee substitute. Chair recognizes Chairman Dempsey to present the bill. Thank you, Mr. Speaker. House Bill 291 keenly focuses on a concern here that is so important at the state of Georgia dealing with our workforce, our healthcare workforce. This will allow for the expansion of nursing students. In 2011, during that legislative session, House Bill 326 was passed and signed. And this changed the eligibility criteria for private colleges and universities qualifying for the tuition, equalization grant. Specifically, it grandfathered in all eligible institutions at that time, but made it practically impossible for new institutions to qualify. So this legislation will amend that code section and provide that in addition to the 34 current private colleges and universities that are eligible, also very, very strict, tight, tightly drawn. This is so, very tightly drawn. It took us two years to do it. The opportunity to allow award recipients, 317 per quarter or $475 per semester. To help them go to college and become nurses and take care of Georgia's needs. Mr. Speaker, if there are any questions, I will yield. You have no questions. Thank you. Then I yield the well and ask for your favorable support. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted, have all members voted. If so, the clerk will lock the machine on the passage of House Bill 291. The eyes are 169. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 343. House Bill 343, by the represent of Rhodes, the 120th, being titled an act to amend Code Section 2731. Committee fiscal to George Antony relating requirements of permission of hunt on the lands of another written permission, enforcement, and immunity of a landowner from civil liability. This bill I'm referred to the Committee on Game Fishing Park. Second committee recommends that this bill do pass by rules committee substitute. Chair recognizes Chairman Rhodes to present the bill. Thank you, Mr. Speaker. I have a for you tonight. House Bill 343 is the rules substitute LC 441699S. Mr. Speaker, what this bill does is basically what we've had some pockets of poaching that that has gotten worse around the state and we're basically just trying to decrease the ripple effect. They're doing it one time and getting away with it and they just they keep on and on. And we're increasing the fines on the second and third offense and that is all this measure does, Mr. Speaker. I'll be glad to answer questions. You have a question if you care to yield. I'll yield for one. Chair recognizes the minority leader of the House leader Beverly to your left for a question. Gentlemen, you. Yes, sir, Mr. Leader. Good to see you, my friend. Lion 46, can you tell us what the rebuttal presumption is? I don't have a line 46. Well, I left it on my desk. What does it say? This is the this. No, this is the outdated LC. That's why I don't have it. But thank you for the question. I'll let you tell me what it means. Do you further yield? You've got a bunch of questions. Mr. Speaker, nice going to be long. I yield the well. Gentlemen, yields the well. Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is not in the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is not in the committee. Your rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is not in the report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 343. The eyes are 172. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk agreed to caption to House Resolution 183. House Resolution 183 by Representative Knight of the 130th urge in Congress of the United States of Pass are recovering America wildlife. This resolution have been referred to committee on game fishing parks. That committee recommends that this resolution be adopted. Chair recognizes Chairman Knight to present the resolution. Thank you, Mr. Speaker. This is a simple urging resolution that Congress adopt the American, recovering America's wildlife act. Basically, what it does is it makes a dedicated funding for our states in an annual allocation of $1.3 billion to state-based conservation. In Georgia, it would be eligible for more than $25 million so that we can implement our state wildlife action plan. There's any questions? Mr. Speaker, would you like to answer them if not? I'll ask them. Looks like you have one question if you care to you. I will. Chair recognizes the minority caucus whip. Representative Wilkerson to your left. Thank you, Mr. Speaker. This is gentlemen Yield. I guess we do these urging resolutions. Do they ever respond to us when we ask them? Well, I don't know. We hope that they will in this case because we're trying to keep Georgia wild. Can we put that on our tags? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House resolution 183. The eyes are 171. The nasors 0. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House resolution 248. House resolution 248 by Representative Stevens. The 164th resolution doesn't need this. The banal logistics technology innovation corridor is an official technology innovation corridor in Georgia. This resolution having been referred to the committee on economic development tours and that committee recommends that this resolution be adopted by committee substitute. Chair recognizes Chairman Stevens to present the resolution. Thank you, Mr. Beeper. Lace Jim in the House. HR 248 does one simple thing. It takes the current designated Savannah Logistics Technology Innovation corridor, which is a health full and just makes it an official technology innovation corridor. What we found with the explosion of the ports, that the sometimes the connectivity, if you will, with the universities, the hospitals, the manufacturers, the rail, the warehouse, trucking, there's just not a logistics hub. And this is all this does, it makes it an official technology hub, opens it up for federal grants and that kind of stuff. So I'll accept any questions if there are any. We do not have any questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machines on the passage of House Resolution 248. The eyes were 172. The nasors zero, this resolution having received the requisite constitutional majority is therefore adopted. Clerk will read the caption to House Bill 117. House Bill 117 by Representative Wolinski, the 79th and others to be entitled to amend the code section 31 to 18. The fiscal code of Georgia annotated relating the low THC oil patient registry. This bill I refer to the committee on regulated industries. That committee recommends that this bill do pass. Chair recognizes Representative Wolinski to present the bill. Thank you, Speaker. Today I present House Bill 117. This is a simple bill.\n\nthat adds to the cannabis oil registry ulcerative colitis. We already have crones on that list and crones and colitis are so interlinked that it's a common sense fix. And I'll accept any questions. You do have a question if you care to yield. I'll yield. Chair recognizes representative Holland and the gallery to your right for a question. Is the gentleman yield? I yield. Is it not true that this representative suffers from this disease and is really grateful that there will be an alternative to invasive and sometimes harmful treatments that are often considered for it? The lady knows what she speaks. Thank you for bringing this forward. No further questions. Thank you so much, Speaker. And we've talked about the turtle and the fence post. And thanks to all of you all here today, I am the turtle. As for your favorable consideration, I yield the well. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote I. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 117. The eyes are 170. The knees are two. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 454. House Bill 454, five representatives. The bill is set up to the 120 third to be entitled. Act to amend Code Section 3320C2 of the official code of Georgia and Tate of Related Online Provider directories. It is just for provide for certain coverage requirements concerning providers that become out of network during a plan here. This bill haven't referred to the special committee on quality health care. That committee recommends that this bill do pass by committee, rules committee substitute. Chair recognizes Chairman Newton to present the bill. Thank you, Mr. Speaker and colleagues. When you look and find a vehicle advertised in Georgia, you will often see a price. You will also often see a stock number beside that car or that truck. That's because of the Fair Business Practices Act, the Anti-Bate and Switch Act that's enforced by the Attorney General to make sure that what they are offering for sale, they actually are going to sell you and they have on the lot available. Unfortunately with health insurance, even though some of them cost as much as a good used car annually, when a consumer during open enrollment chooses a health plan because of a particular in-network provider, the consumer can find themselves midway through the next year, even though they're paying their premiums on time and in full, they can find that that provider was canceled in no longer part of their health plan. They're stuck without of network bills. If they want to continue seeing that or they got a change on short notice to a new provider that's in network, what HB 454 will require health plans to continue coverage at the in-network rates and it will also require the providers to accept that as payment in full. We worked hard to keep the consumer out of the middle when large insurers and providers have disagreements. We worked hard with the insurance plans to make sure this was fair to everybody if a provider canceled themselves or had quality reasons to be canceled. We have exceptions. I think this is a good bill for us to take one more step to leave consumers out of the middle when they're doing everything they can do and try to give them affordable health care. So I'd appreciate your support and I'll yield the well. Gentlemen, as yielded the well over a question from Representative Al Williams. You want permission to return? Granted. Senator, recognize as Representative Al Williams to your left for a question. Will the running, will the representative yield? The running doctor will. Yes, I will yield. I was just, I was just to make a correction. Is it not true that health care premiums are usually higher than a new car? They're up there. It's nip and tug depending on how what you decide to get. Well believe me, it's cheaper for a real cattle like there is, the cattle like plans that are out there. I'd appreciate your support. Thank you, sir. You mean, if there are no more questions, I'll yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is not in the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is not in the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is not in the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye of those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 454. The eyes are 173. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 495. House Bill 495 by the members of the Crow, the hundred and tenth being titled an act to amend Article 1 of Chapter 3, Title 35, Article 2 of Chapter 142 of the Fish and Go to Georgia and attend to relating the general provisions regarding the Georgia Bureau of Investigation and the Sexual Offender Registration Review Board. This bill ever referred to the committee on public safety and homeland security. That committee recommends that this bill do pass. Chair recognizes representative Crow to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, this is a GBI Department bill that's basically codifying a practice that's already in place. In 2012, there were several investigator positions that were transferred to the GBI from the Sexual Offender Registration Review Board or SOARB. Those were classified as analyst positions, but budget cuts in the fall of 2019, GBI had to eliminate all but two of those positions. This reduced the amount of work that GBI was able to provide. During the 2020 legislative session, House Bill 720 was introduced and if passed this legislation would have transferred one of these positions from the GBI to SOARB along with changing the nature of the GBI's responsibilities related to SOARB. That bill did not pass it past the House, so unfortunately, I'm not able to make it through the Senate. But the fiscal year, fiscal year 2021 state budget still reflected the transfer of funds from one of those positions to SOARB from the GBI. The one remaining position in the GBI is still going to be kept and utilized for fulfilling criminal history requests for SOARB. They're unable to gather background information so the GBI will do that for them. So I'd like to provide the report to the SOARB for their review and that's essentially the bill and I will yield for questions. You have a question if you care to yield. I will. Chair recognizes representative Ridley to your right for a question. Does the gentleman yield? Yes, sir, I do. You don't get to change your mind after you know who it is. Yes, sir. You done a great job reading whoever wrote that for you. And I just got one question. Yes, sir. Does this bill have anything at all to do with having to get a driver's license to operate a boat? Nothing whatsoever. I'm doing. Thanks, sir. Yes, sir. No further questions. All right. I'll yield the wealth. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee. Does it agree to shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 495. The eyes are 172. The days are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption. The House Bill 532. House Bill 532, by the way, the work is in the 157th to be tied on act to amend title 34. The fiscal to Georgia, anti-regulating labor and industrial relations. So it's to change certain provisions relating to the Department of Labor and Employment Security. This bill I'm referring to the committee on industry and labor. That committee recommends that this bill do pass by committee substitute. Chair recognizes chairman work iser to present the bill. Thank you, Miss Baker. I for wanted okay with the Senate going home early. These are the bills that the state is interested in just hope they're ready to get to work tomorrow. This is the annual Georgia Department of Labor agency bill. Section one just gives some consistency on service notice service. And the rest of the bill is an update from the United States Department of Labor, mostly striking case that's been in for some time. I'll stand for any questions. Do not have any questions. Thank you. I'm sorry you do have a question. Oh you. Chair recognizes representative Hugley to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes ma'am. Will this help the Department of Labor process claims any faster than they're doing now? Ma'am I've already told you more than what I know. We hope so. I need a minute to break that Senate's down. Is that a no? That's for every time. No further questions. I appreciate your favor. Considerations. Thank you. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 532. The eyes are 165. The nays are 5. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 469. House Bill 469, I'm a resident of Stevens, 164. To be taught on an act to amend Article 2, Chapter 7, Title 48. The official of the Georgia Antietta related the imposition rate and computation and exemptions from state income taxes. First I would like to refer to the committee on ways and means that committee recommends the disbilled due pass by rules committee substitute. Chair recognizes Chairman Stevens to present the bill. Thank you Madam Speaker. Ladies and gentlemen of the House. Today I bring you House Bill 469, which does on the first section of the bill extends the historic tax credit, the mega historic tax credit. There are two of those. The one year it expires this year, we need to care for an additional year at the current rate. It also does not mess with the historic tax credit that is your standard like for small homes and small businesses. We also found out late that wearing a short list for an economic development project here, some of you might have possibly seen one of the test vehicles out in the street there. It's on section 2. It's for an electric vehicle. It says that if you domicile here in Georgia and if you're willing to create the jobs, we'll give you $2,500 per vehicle for a short period of time with a cap of $5 million and we're going to let it expire in 2024. We're on a short list. I hope it goes to everyone in your districts. If we make it there, but ladies and gentlemen, today this is a care. I hope you'll vote for the bill. Any questions? There are no questions. For what purpose does Representative Kenard rise? Parliamentary inquiry. The state's your inquiry. Isn't it true that section 2 of 469 would allow electric vehicles to come more steadily in our state, which is an environmentally friendly measure as well as a job creator? If the gentleman so states, is there any objection to the previous question being ordered? The chair here is none. Are there any objection to withdrawing the committee's substitute? Chair here isnone. The committee's substitute is withdrawn. Is there any objection to adopting the committee to substitute offered by the committee, unrules the chair here's not on the rules committee's substitute is adopted? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none. The report of the committee has agreed to shall the spill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose does Representative Carson rise? Madam Speaker, pursuant to rule 133 I ask to be excused from this vote. The gentleman has that right. Clerk will reflect it in the record. All members voted. If so, the clerk will lock the machine on the passage of the bill. The A's were 167. The A's were 0. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 160. House Bill 160. House Bill 160 by. Representative Boatty. House Bill 160 by. Representative Boatty. To be entitled to amend Article 4 of Chapter 8 of Title 48. The bill is made in the water and sewer projects and cost tax. So it's to redefine the term municipality. This bill then referred to the Committee on Ways and Means that Committee recommends that this bill do pass. The chair recognizes Representative Boatty to present the bill. Thank you Madam Speaker. I rise today and ask this House to vote yes to HB 160. Based on what HB 160 will allow for the cities of East Point College Park in the hate bill to levy the most sales tax. The most sales tax is the municipal option sales tax was first implemented passed by this house in 2003. The City of Atlanta implemented that tax. That allows for our wastewater systems to be upgraded in the City of East Point College Park in hate bill. The reason why this bill is so important is because the City of College Park is whether airport is located. The City of College Park needs about $18 million to upgrade their system and we will be able to do that. Also at East Point which is right outside of the college park or right next to College Park in the airport. The need is needed there as well. So what the most sales tax would do it will allow for us to upgrade our wastewater and sewer infrastructure that is going to be a great need to the airport which is the crown jewel of not only state of Georgia but the South Southern region itself. Madam Speaker I will reveal for any questions. You have a question Representative Bentley has a question. Yes. Thank you Madam Chair. This is gentleman Yeeil. Yes. To my dear friend. Is it not true that I serve on the ways and means committee? Yes. You do, Madam. And is it not further true that I was unfortunately not present at the time of your presentation of your bill in the ways and means committee but had I been there I would have voted for your bill to come out of committee. The lady knows what she speaks. Thank you for your work on this legislation. There are no more questions. Thank you. I'll yield the well. Gentlemen has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so the clerk will lock the machine on the passage of the bill the a's were 167 the nays were two. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 681. House Bill 681 by Representative. Year to the 150 second to be entitled to amend part two of Article 6 of chapter two. Total 20. The official to Georgia and Tate related to competencies and court curriculum relative to quality basic education. So it's to provide for a course of study and financial literacy for students in 10th or 11th. Pray. Miss Bill ever referred to the committee on education. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative year 10 to present the bill. Thank you, Madam Speaker. Tonight I rise to bring you House Bill 681. This is asking the State Board of Education. She'll prescribe a program of study and financial literacy. And this is to be completed in high school. The goal behind this bill is to help students develop basic understanding of financial literacy. A strong foundation and financial literacy can help with life goals using debt responsibly, savings, retirement, even running a business. Also learning basic skills like household budgeting or balancing a checkbook are important in this course. And can be very valuable later in life. Today it's estimated that four out of five US workers live paycheck to paycheck. Liking skills and financial literacy can lead to poor credit, bankruptcy even for closure. The skills learned in a financial literacy course will prove valuable to the rest of the student's lives. To help make this will even help make them build well and be less vulnerable to fraud. A number of things in the bill that we've outlined to teach in the course are balancing a check-in account like I mentioned. Money management such as savings, spending, credit scores, and managing their debt. Investments, post-secondary educational financial planning, even completing a loan application. Simple contracts and types of savings and investments and the value of compounding interest. We've worked with the Department of Education to make it flexible for the school systems, so they could work within the framework of the existing courses offered by the school system. In other words, instead of taking economics for example, they could take the financial literacy course. So I think it's a good bill. I think it'll prove very valuable to students and be very, very helpful later in life to them in the future. Thank you for letting me present the bill. I'll entertain you a question. You have a question. The chair recognizes Representative McLaren for a question in the gallery. Thank you Madam Speaker. Will the gentleman yield? I will. Mr. Representative, isn't it true that if I had had access to a course like this in high school, I would have been smart enough not to run for the Georgia House of Representatives? If the gentleman believes that would true, thank you sir. You have the chair recognizes Representative Bentley for a question. Thank you Madam Chair. Does the gentleman yield? Yes ma'am. How does this bill affect the funeral industry? Well I would hope they would be able to set aside money for that if it occurs later in life. Is there any language in your bill that helps individuals to understand the importance of having life insurance? I would think that would be very valuable when we could work on that in the future. All right. Thank you for your work on this bill. Yes ma'am. Chair recognizes Representative Wilkerson for a question. Thank you Madam Speaker. Is the gentleman yield? Yes I will. I guess who's going to teach this class? I'm trying to think of practical experience like who's going to have the experience to be able to teach about tax successments and different things that are on here? Well I would think maybe some economic teachers or something like that. And I envision even getting people to come in from the community and helping with the course also. Maybe bankers could do a day or even a count or something like that and come in on special occasions like that. Does the gentleman further yield? Yes the will. So is your expectation that a teacher will bring in expertise on calculating taxes and different things or would they be able to incorporate that inside? I don't know how to do this in detail though get without but I think that they could get the basics and you know just let people know that they need to set aside money for taxes and make sure enough is taking out of the pay jacks and things like that. Well after a most thorough discussion with the gentleman like to continue to yield? I will yield the will. The gentleman has yielded the will. And I thank you for your consideration on this bill. Is there any objection to the previous question being ordered? Chair here is none the previous question is ordered? Is there any objection to adopting the committee substitute? Chair here is none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is none the report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of the bill the yeas were 169 the nays were two. The bill having received the requisite constitution majority is therefore passed. Clerk will read the caption House bill 631. House bill 631 by motion of Chocos 138 to be entitled an act to amend Code section 3533. The fiscal to Georgia annotator relating to powers and duties of the Georgia Crime Information Center. So it's required for the development operation system to voluntary collect and disseminate information relating to conditions that may impede an individual's ability to communicate law enforcement. This bill have been referred to the committee on public safety and Homeland Security that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Chocos to present the bill. Thank you Madam Speaker. Members of the House of Representatives I bring before you today House bill 631. This legislation will allow local governments with emergency 911 systems to collect, store and disseminate information that is voluntarily submitted by parents or guardians of individuals that have a physical, mental or neurological condition that impede his or her ability to communicate. During the committee process there was no opposition that I'm aware of. This measure has no fiscal impact to the state. This measure will allow parents or guardians with autistic children or adults to voluntarily submit this information to their local E911 centers. First responders will have this information in the database and will be better prepared to deal with the occupants of the residents. This measure improves public safety and will bring peace of mind to the parents of individuals with autism and other developmental disabilities. Madam Speaker I will yield questions if there are any. Otherwise I'll yield the well. There are no questions. Thank you. I ask for your favorable consideration. The gentleman is yielded the well. Is there any objection to the previous question being ordered? Is there any objection to adopting the committee substitute? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill. Vote yes. All those opposed will vote no. The clerk will unlock the machine.\n\nhave all members voted. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 169. The nays were one. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 562. House Bill 562 by the House of the Department of the Department of the Reform and others to be entitled to amend Article 3H4, Title 17. The Fish Go to Georgia and Senator relating to warrants for arrest. So, stand de-facts, case managers to the people for whom arrest warrants may be issued only by certain judicial officers. Ms. Bill, I'm referred to the Committee on Judiciary and Non-Civil Act Committee recommends that this bill do pass. Chair recognizes Representative Carpenter to present the bill. Thank you, Madame Speaker. This is not my favorite bill I'm carrying today, but I will report that House Bill 562 is a bill that will help protect de-facts workers when they're performing their work. We do that currently with teachers, peace officers, law enforcement officers and school administrators. And all we're asking is for a little extra vetting when the issue and warrants while they're performing their job. And I appreciate your favorable consideration on this bill. There are no questions. Up. There is one question. Oh, you'll ruin it. Chair recognizes Representative Hutchinson in the gallery for a question. There we go. We got something. Okay. I'm sorry. This is gentlemen, you. Absolutely. Can you give us an example of what this bill, a situation that this would, this would help? Yeah, absolutely. So, we passed this bill. I think you actually voted for it last year. We passed it out of the house. It got hung up in the Senate. But basically we had some issues where de-facts workers were going to perform their task at a home with police officers there. And then a member of that home issue went to magistrate court and issued a warrant and made them come to court basically at the end of the day. The magistrate judge didn't do a whole lot of research on it. He just went ahead and made them come in. So this is just saying we want this to be vetted a little more. Thank you. Thank you very much. We appreciate it. Thank you, House. We look forward to your favorable consideration. The gentleman has yielded the well. For what purpose does representative, Cantrell rise? E-waves. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which is favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? If so, the clerk will unlock the machine on the passage of the bill. The bill has received the requisite constitutional majority. The clerk will read the caption to House Bill 464. The clerk also said Vacation came out with a decision that the civil maid has issued, therefore she just refused. The clerk was not offered an invitation for the appointment of a temporary guardian gwineir filed in the pro bait ward, maybe transferred from the pro bait court to the juvenile court. This bill having referred to the committee on juvenile justice, that committee recommended, this bill, do pass. Chairman recognized as representative Skaggins to present the bill. This bill just allows the probate judge of any county to transfer a temporary guardianship of a minor to juvenile court so that the juvenile court can do a home study for a background check. The way the glow is currently written is the probate judge shall issue the order granting the temporary guardianship and this just allows them to move this to juvenile court where there can be a background check in a home study and I'll ask for your favorable consideration and I'll give for any questions. There are no questions. Thank you. The gentleman is yielded the well. There's any objection to the previous question being ordered. The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none the report of the committee has agreed to shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so the clerk will lock the machine on the passage of the bill the a's were 163 the nays were zero. The bill having received the requisite constitutional majority is therefore passed. The chair recognizes the rules chairman for an announcement. Okay I guess we'll state about two o'clock this morning. See how that goes. Rules committee will meet in about two minutes and we're going to add just three or four five six ten more bills to the so this calendar tonight. By the way just for your information rules committee will not meet tomorrow morning but we will meet in about two minutes. The House will stand in recess for five to seven minutes. We have five to seven minutes to get back. Okay we have a committee substitute for House bill four six five.\n\nyou you you you you you you you you you you you you you you you you you you you you you you the the the and the the the the the the Recognizing commanding the honorable Samuel, Dr. Tway, Jr. And for other purposes, that completes the reading of the Privileged Resolutions. Is there any objection to adopting the Privileged Resolutions? The chair here is not in the resolutions are adopted. Clerk will read the caption to House Bill 520. House Bill 520 by Representative Singleton of the 71st Committee, Todd O'Neck to amend Article 1 of Chapter 40, Title 50 to fish go to George Antetti, really, and the general provisions regarding promotion and deployment of broad-paid and services. Let's bill them refer to Committee on Energy Utilities and Telecommunications that Committee recommends this bill do pass by Committee Substitute. Chair recognizes Representative Singleton to present the bill. Thank you, Mr. Speaker, members. I'm here to present House Bill 520. What this bill does is in the definition of broadband, what it does do is it removes the word to restrile from the definition of broadband service. So it says broadband services consist of capability transmitted rate of not less than 25 up to three provides access to the end of the acute of processing. So what it does do is it updates our code to make sure that we're not limiting any of the definition of broadband. What it does not do is change the current process with the one Georgia authority or the current rural broadband commission and how they're identifying and how they're expanding rural broadband. So it does not impact that in any way currently. What it does do is that it is permissive in nature to make sure that we are allowing for emerging markets. So, Mr. Speaker, I'm happy to take any questions on the bill. Do you yield for questions? Nervously, I do. Yes, sir. Well, you've got a couple of chairman that would like to question you. I'm sure I do. Mr. Chair, recognize this representative Hausten, do you write for a question? Uh-oh. Well, isn't it not true that this would have allowed the satellites to come into broadband and delivering broadband? Well, yes and no, Madam Chairwoman, what this would do is it removes the requirement for broadband to be terrestrial. As you know, there are satellite companies that currently are providing broadband in Georgia. Yes, and is it not true that people in rural Georgia won't wise run underground so when it rains, we can still use them in that? I'm sure that the South Georgia, they're very smart about what they know that they've been. This would not. And is it not true we never heard from y'all? Do you put some money in it? We put some money in it. Thank you. That's true. So to answer a question this would not in any way shape or form prevent any of the current rural broadband initiatives to happen. What it would do is it changes the definition to make sure that we're not arbitrary limiting the market. But thank you for the question. Chair recognizes Chairman Watson to your right for a question. Thank you, Mr. Speaker, Mr. Gentlemen, you. Oh, yes, sir. Is it not true that if we allow more access to these satellites, providers, that it will limit the resources that our current telecommunications carriers and our EMC affiliates that are currently have access to this fund, it will limit what they're able to use. And in fact, they're the ones that are already expanding into our rural areas of our state with multiple announcements, who even hear recently. And that being said that it will reduce the choice of broadband in rural Georgia because these companies may take all of the funding and not allow our telecommunications providers access to the most expensive form of broadband, which is a fiber and the wireless technology. I appreciate the gentleman's question. The answer is absolutely no. It would do none of that. So what this bill does is it's a definition of broadband. I mean, if we're talking about the amount of money spent, the FCC just did a, we just invested as a country, $9 billion into rural broadband. That $9 billion was divided amongst 180 companies. One company received 10% of that. It was a satellite company. This doesn't do that for Georgia because our code section separates the definition of rural broadband service, which we are not amending the definition of rural broadband service provider. The satellite companies aren't eligible currently in Georgia code because of the definition of service provider such as a thousand unique users, three years operating in the state. So it does not do any of those things that you just said. What this does is when we as a state define broadband service, we're not putting a descriptive word in there to limit future market access. This bill is a free market bill. If you believe that we should not arbitrarily define things based on a certain portion of the market. Okay, does the gentleman farther real? For you, absolutely. So how will the state know that these companies are spending the money and what they spend it on? I know from a fiber standpoint, we can actually see it and touch it and put our hands on it. But if they're putting it up in the space and it's taxpayer money, how are we going to know they're spending it to grow broadband in rural Georgia? So again, this bill does not at all deal with any of the provisions that are financially benefiting these companies. This bill in no way shape or form does it affect the one Georgia authority the way that they distribute the funds. This does not affect the requirements that they've already set out. So any characterization of this bill is affecting the way that we are doing the rural broadband of Georgia's completely false. This bill does not do that. What this bill does is says that broadband service is defined as broadband service, which is those things that produce broadband. And it removes the word terrestrial in there that says broadband service is only broadband if it's terrestrial. So again, the funds that we currently distribute through grants and other programs that we've talked about one Georgia authority, they have their own requirements for the grant writing. This does not affect those. I hope that answered that question, but I am happy to take more questions. Chair recognizes representative Al Williams to your left for a question. We'll see if you're still happy to take questions after this one. I will yield. The gentleman will yield before you've been asked. I'll not ask you to yield, but thank you. I'll appreciate it. He's a forward thinker. I'm sitting here listening and you know, being from rural Georgia, we kind of miss some of the sophistication of new technology, but we do know what works and what does not work. Is it not true that with just two or three sprinkles now, our satellite systems go out? I would never use a service that goes out with two or three sprinkles. Well, is it not true in rural Georgia, you're a little limited between two Dish and what's that other one, but one's bad as the other. The question that I have, is it not true that the most substantial is through wires that are not interrupted by bad weather, and is it not further true that we're getting so used to being so bill of goods in rural Georgia until it's kind of run out? No, because is it not so that we, at $356 million, has bought a lot of good-looking stuff to the table, but we don't want a scump. It's been washed and sprayed, but it's still a scump, is that natural? I believe that's totally true. I think that luckily for us, the one Georgia authority and the Georgia broadband development plan, they have a great plan and they're doing a great job delivering rural broadband to you and to rural Georgia. And again, this does not affect that one way at all. What this is just making sure is that in Georgia code, when those satellites are finally meeting your standard, which will probably be a long time, but when they do, if they decide to apply for the grants, which by the way they'd have to get approved through one Georgia authority, we're not putting an arbitrary limiter on what the definition of broadband services. So broadband service should not be limited to protect what industry should be a free market. It will be a long time if we, when we pass this bill, unless we change many other sections of code, it will be a long time before any of these providers that you seem to be fearful of would have access to any of those grants. Again, this is not a bill that deals in any way with grants. So in other words, this is a bipartisan bill that had Democrat and Republican support, unanimous support and subcommittee, unanimous support and committee, not a single person, lobby or anyone else spoke against the bill. So all of the things that have been discussed, I think they're really valid questions. Unfortunately, they don't apply to what this bill does, but they're a good argument that we should have. Chair recognizes the chairman of the House Appropriations Committee, chairman England, to your right. Does gentleman yield? Yes, or I yield? Why do you look so digicted when I stand up and ask you a question? You have very intimidating facial hair. Oh, that's okay. You used to have a lot more color in it than it does now. Something with budgets. Appreciate your interest in this topic. Is it not true that my former seatmate and I'll meet Jay Powell and I spend a lot of time working on this issue through the years? I believe that's probably true. Yes, sir. I do have some concerns with your bill in opening up the definition because as I have understood the FCC rules as it applies to mapping and served versus unserved areas. In changing this definition, it basically says at that point then the entire state is served with their definition of high speed broadband, which 253 or 110, but 253 does qualify under the federal definition under the FCC codes. And my fear is that in changing this definition, the way that it does, then it changes the definition of our maps that we have spent an awful lot of state taxpayer money on to define those census tracks that are served or versus not served. So, if you're doing this, then opening up to spatial service, then would say the FCC would look at us and say, well, your entire state is served at this point. I do appreciate the question. It's actually that was those are very valid common question. It has been in the discussion about the mapping. I do know that companies such as Starlink, which is owned by SpaceX, which did receive 10% of the federal funding because they are the best performing of all the broadband entities in the country right now. They specifically have been working with the Georgia Role broadband authority about mapping. It's my understanding that that is not an issue that the definition here would not affect that. There are other sections of code where that would be true. And as a side note, I will say, you know, four years ago, and this was written, which you spent so much work on, there is a lot of discussion on whether they should add latency into the code as well, which would then define, again, the big difference four years ago between emerging satellite technology and ground technology was latency of the satellite technology was so poor and so bad. And then consistency of service was so bad. These are problems that are being actively resolved. So, ladies and gentlemen, to not take up, there's a lot of important bills here, but not too much time. But the bottom line is, we as Georgia, we care about rural broadband, we care about the open and free market. We want to make sure that Georgia is prepared for the future. This does not change any current rules or current plans with the one development authority, the way that Georgia is investing in broadband. But it does open up the potential for future investment and future growth in an emerging portion of the market that is yet untapped. And that is the intent. That's why it had bipartisan and broad support across the board and Mr. Speaker, unless there are more questions. Well, there are more questions, but you don't have to continue taking them. That's your call. It is very enjoyable, and I really do appreciate the conversation. Again, I just want to point out that, you know, bipartisan support nobody spoke against the bill. All we're doing is, if you believe that there should be arbitrary limits and the definitions of things that we try to provide to Georgia's, then we're disagreeing with this bill. The point of this bill is to be permissive to allow the broadband authority to allow them to make the decisions that are best for Georgia without us putting constraints as a legislature on what they can or can't do based off of what we currently understand the market. So this is to open markets and with that, Mr. Speaker, you'll do well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none the report of the committee is agreed to. This bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines. What purpose does representative Holland rise? Mr. Speaker pursuant to rule 133 I ask to be excused from this vote. The lady has that right and the journal will so reflect. What purpose does chairman Parsons rise? Parliamentary inquiry. State your inquiry. Isn't it true, Mr. Speaker, that all this bill does is exactly what the author of the bill described. It just reflects in code that satellite is a method of broadband. It has nothing to do with mapping. It has nothing to do with funds being allocated to it. That satellite is broadband and is just reflecting that in code. It's all it's doing nothing more. If the gentleman so states have all members voted have all members voted. If so, the clerk will lock the machine on the passage of House Bill 520. The eyes are 51. The nays are 108. This bill having failed to receive the requisite constitutional majority as therefore failed. Clerk will read the caption to House Bill 435 House will 435. Chair recognizes representative Anderson to present the bill. Chair, chairman, the House. I stand before you again to present House Bill 435 in a slightly revised manner. First of all, House Bill 435 clarifies that local governments can utilize competitively bid and certified state convenience contracts for public works projects. Currently there is no reference in the local government public works purchasing statute regarding the ability to access statewide contracts. The House Bill 435 clarifies this script and see by adding a new paragraph as an additional exception. Furthermore, the committee substitute adds language emphasizing local government accountability by requiring all work to be approved by the government of entity. With that, I will answer any questions if there are some, sir. Did you yield? I do, yes, sir. Chair recognizes representative Larickia to your left for a question. Thank you, Mr. Speaker. Gentlemen, you? Yes, sir. To my friend in the world, is it not true that y'all took some time to look over some changes to this, to tighten it up, to get it to a better position to be able to move this bill forward? That is definitely true, sir. Thank you so much for doing that. And I appreciate you listening to me and helping work through that. Well, thank you for your input. Do you yield for one further question? One more, sir. Chair recognizes the minority caucus who are representative Wilkerson to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. Is it not true that I agree with the gentleman that you've done some good work on this and that interested parties are pleased to have this move. I'm pleased to have this moving forward and continue to work on this Senate. Is that correct? That is correct. Thank you. And again, I appreciate the opportunity to make a good bill better. With that, Mr. Speaker, I will ask for everyone's favorable consideration. I'll yield the will. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The Chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The Chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? What purpose does Chairman Setslow arise? I'll put it in the floor. I just came on the floor. I need to recuse my first person to rule 133. The gentleman has that right and the journal will so reflect. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 435. The eyes are 157. The nays are nine. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 411. House Bill 411 by Representative Gollett of the 19th to be entitled an act to amend Article 1 of Chapter 18 to Title 15 of the fiscal to George Anand's head relating the general provisions regarding prosecuting attorneys, so to create the prosecuting attorneys oversight commission. This bill haven't been referred to the committee on judiciary and non-civil. That committee recommends that this bill do pass by rules committee substitute. Chair recognizes Representative Gollett to present the bill.\n\nMr. Speaker, members, I bring to you today House Bill 411. This bill creates a prosecuting attorneys oversight commission. It's been through a lot of iterations throughout the committee process. I want to specifically say thank you to Florida Reeves, Chairman Perchette, and Representative Lauren for their help in the committee process. This commission will be made up of five member investigative panel and the three member hearing panel. The investigative panel will be responsible for the investigative prosecutorial and administrative functions of the commission. The hearing panel is responsible for adjudicating formal charges filed by the investigative panel, issuing disciplinary and incapacity orders and issuing standards of the commission. The commission will start on April 1st, 2022, and we'll start writing the standards of conduct and rules for the commission's governance. No complaint will be filed before July 1st, 2023 in order to give the Supreme Court time to review and adopt the commission's rules. Section H is related to the totality of behavior for an elected district attorney or elected solicitor general. Section I says that if complaint is made, there must be a sworn affidavit detailing personal knowledge of the fact supported and complaint. The section also restricts basis complaints about charging and trial decisions. We're trying to address things like willful misconduct, like sexual harassment, like misuse of funds, and like the persistent and blanket refusal to prosecute charges based on politicized motivations. The bar in the Supreme Court have a very important role to play in this, and this bill recognizes that. When it's your community that's dealing with a district attorney or solicitor general who has brought their office into the dispute and your constituents have disdain and no trust for the office holder, you realize just how badly this bill is needed. Members, let's do the right thing for our constituents. Let's do the right things for Georgia and this past this measure. I ask for your favorable consideration and due to the late hour, I yield the will. Did you yield or did you yield for questions? I'll yield for one question. Chair recognizes representative Moore in the gallery to your left for a question. Does my former seatmate yield? I do, I miss you. Likewise. Let's not get into all that here. Isn't it true that you and I initiated a conversation about a D.A. oversight committee over a year ago back in starting back in approximately January of 2020? That's absolutely true. Does the gentleman further yield? I do. Isn't it also true that the Georgia House Democratic caucus included the creation of a D.A. oversight committee as part of our justice for all criminal justice reform package? I believe that to be true. Thank you. Does the gentleman yield for one more question? I do. Is it also true that our friends over at the Georgia NAACP have taken a neutral position on this bill? I don't know that to be true, but I absolutely trust your judgment in what you say to be true. Thank you so much. Thank you. Mr. Speaker, I yield the will. The gentleman has yielded the will. Chair recognizes representative Gunter to speak to the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I rise to support House Bill 411. I served as a prosecutor for 12 years and I understand the position very well. This bill is a needed addition to watch over the district attorneys. And I'm not saying that they're doing anything bad. These are some of the hardest working brilliant people that I've ever worked with before. But we have some bad apples every now and then. And a commission would be a good thing to assist the district attorneys in quelling some of these problems. And it's not that a lot of them are doing bad things because a lot of them do oppose this bill. But what's going on is that currently they're receiving a lot of complaints to the state bar about decisions that they make as prosecutors. It's a tough job. You have to have the ability to make those decisions. And I think what they worry about is whether their decision making would be quelled or attacked because of this. So I'm not saying that this is a bad bill. This is a good bill. This is something that we need for those people that can't control themselves in the office. So anyway, that's my position. It's a good bill. It's something that's needed. It's something that's been needed for a while. But if you've had any phone calls from district attorneys, they're worried that this is going to be used as a political tool against them to prevent them from doing their job. So for that, I yield the well. Thank you. Gentlemen, as yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules. The Chair here is none. The Rules Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which is favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative Cannon rise? Parliamentary. State your inquiry. Is it not true that there are many African-American district attorneys and solicitor generals in the state of Georgia who can be negatively impacted by the passage of this legislation? Well I suspect any district attorney in the state of Georgia could be negatively impacted. What purpose does representative Reeves rise? State your inquiry. The speakers are not true that if this panel had been established in the district attorney and runs with Jackie Johnson could have potentially been removed from office many years ago. That is possible, yes. Have all members voted? Have all members voted? So the clerk will lock the machine on the passage of House Bill 411. The eyes are 104. The nays are 61. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 76. House Bill 76, by the way, of Carson 46 and others to be entitled to amend Title 46, the Fish Go To Georgia annotated relating to public utilities and public transportation. It is also to modify the percentage limitation as the amount of the investments and electric membership corporation we make and maintain in a gas affiliate. This bill ever referred to the committee on energy utilities and telecommunications that committee recommends that this bill do pass. There recognizes Chairman Carson to present the bill. Thank you, Mr. Speaker. House Bill 76, this is the exact same bill that I had last year that passed this body 158 to 7. All this does is increases the cap on which an EMC may own and have an ownership or investment in a gas marketer. This goes from 15% to 60%. It keeps prohibition on cross-substitutions. All this must be at market rates. Georgia EMC supports and the last time I spoke with them over the interim, Georgia, excuse me, Southern company was still neutral. That's all the bill does. We're going to grow jobs here in Georgia and with that, Mr. Speaker, if there's no questions, I'll yield the bill. You have one question if you care to yield. I'll take one question. Chair recognizes representative Meeks in the gallery to your left for a question to your left. That's right here in the side. Well, that's the gentleman you. Oh, okay, they're right up there. This gentleman you? Yes, sir. Is it not true that the Holi owns the citrary by Coby EMC late last year purchased the largest gas marketer in Florida under the current cap? There was a merger. I don't know if I would qualify as a purchase, but there was a merger and they are still within the cap. They are just concerned about violating the cap because part of the net plant definition includes gas guarantees. With that much to speak, I'll yield it well and ask for the House's favourable consideration on this bipartisan measure. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 76. The eyes are 157. The nays are 11. This bill having received the requisite constitutional majority is therefore passed. We'll read the caption to House Bill 109. House Bill 109, my representative, clerk on the 147th being titled next to provide. Greater protections for individuals who have suffered from childhood sexual abuse into amend. Code section 9-3, 33.1 of the fish quoted Georgia annotated. This bill having referred to the committee on judiciary that committee recommends that this bill do pass by rules committee substitute. Chair recognizes Chairman Clark to present the bill. Thank you, Mr. Speaker. Today, I have House Bill 109 for your consideration. Before I get started, I want to thank the judiciary committee for working with me on this bill. This is exactly the same bill that we passed last year if you remember. It was the last bill we passed on crossover last year. It got over to the Senate and didn't make it out because of all the slowdown with COVID. This bill does three things. It extends the two-year window from the date of discovery from two years to four years for a victim to bring a case forward. It raises the statute of limitations from 23 years of age to 38 years old for victims after if their abuse happened after July 1st of 2015. It opens a one-year window for a look back for victims whose statute of limitations has expired. It's important to look at this. The look back only goes back to July 1st of 1988. If the abuse happened after July 1st, 1988, why is that? That is when the code of Georgia was updated to clearly state that all these organizations and entities were mandatory reporters. For the look back, they had to know that the event happened. It's not should have known that language was taken out. They had to know that the abuse happened and that they intentionally or fraudulently covered it up after they were mandatory reporters. They have to be able to prove this to the highest standard in civil court to the clear and convincing standard. I know there are concerns about this look back, but there's precedent in our law for this kind of action and it's fraud. There's no statute of limitations for fraud. You can argue that in many of these cases, the statute of limitations expired on these victims, in part, due to the entity not reporting it. You think about it. A child is being abused. Is that child going to feel comfortable coming forward? No. They're not. And so the organization or entity that had a duty of care over that child, if they had obeyed the laws of Georgia and reported this, then those that had a position to be able to bring that case forward would have done so, but they were left in the dark. So in many of these cases, the statute of limitations expired because of the act of against not reporting. And it's very clear that so I hear the argument all the time, why don't we just go after the criminals? We are. I want to make that clear. Since we're only going back to the time that these entities, mandatory reporters, I want to make it clear that these organizations were breaking the law of Georgia by not reporting the events that were happening while that child was under their care. So we are going after the criminals. And these, these, these victims are asking for justice and we're going to be able to allow them to do that by the passage of this bill. Mr. Speaker, that's the bill and I will stand for any questions. It looks like you have only one question or maybe two. Do you yield? I will yield. Chair recognizes Chairman Setslor to your right for a question. Mr. Jim and you. Yes, sir. So to be very clear, organizations had an organizational duty beginning in 1988 when they had knowledge of something to report it to authorities that they failed to do. Correct? That is correct. But instead of that, they concealed and you can demonstrate that as well by this bill. Correct. And it has to be proven. And again, the burden of proof is on the plaintiff. That's correct. They have to be able to prove it to a clear and convincing standard, which is the highest standard in civil court. The typical civil court would be proponders, but this is clear and convincing. Clear and convincing, yes, sir. Appreciate it, Bill. I will yield for one more question, Mr. Speaker. Okay. You have no further questions. You'll then ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair hears none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair hears none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 109. Any eyes are 163. The nays are zero. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 138. House Bill 138, progressing a banger of the 56th and others to be entitled to amend article on chapter 7 and title 44. The fish put a George Anantetti relating the landlord and tenant in general, says to provide that certain landlords shall provide certain notices to existing prospective tenants with regard to certain crimes occurring on the promises being leased. This bill ever referred to committee on judiciary. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Maynard to present the bill. Thank you, Speaker Rothston. Chairman F. Strachan was essential in his wisdom with the substitute language, chairman Birchett and chairman Skoggins for their input, and representatives Wollensky and Lem for their legal expertise. And leader Beverly and Fulton Sheriff Patrick Lebot for helping me the night this child was violated from once House Bill 138 originated. A 15 year old girl living in an Atlanta Midtown high rise where the average rent is $2,500 a month was being watched by peeping Tom in her apartment's pool lounge. Going forward, House Bill 138 will protect Georgia families and improve public safety by listing violent or sex crimes that occur in apartments. I encourage you to vote yes for this bill because it saves lives and not know because it's a task. The executive director of the Georgia police chief says that information is a public safety tool. The more information the public has the better they can protect themselves and the more law enforcement can help with community policing. It protects innocent bystanders, seniors, veterans, college students, children, parents, and families living in apartments. It protects everyone in every single zip code in Georgia. The crimes to report online are rape, murder, gang crimes, assault, battery, peeping Tom's, and felony drug crimes. Simply put, online data of violent crimes prevents crimes. I vote it yes on the bill last week regarding cameras and nursing homes similar to House Bill 138, Prevention saves lives. The safer apartments are, the safer communities are, the safer communities are, the better Georgia's crime data is. And the more we attract people to our beautiful state. Children will have more stable home environments instead of moving from apartment to apartment in order to dodge crime. So to my distinguished body of colleagues, I ask for your favorable support of House Bill 138, which is a yes to excessive information and form decision making when looking for an apartment, tenants peace of mind, and enhanced community public service, service safety. Thank you, Speaker Roths, and I yield the will. You yield for a question. Mr. Speaker, is it your opinion that this is cross over day and you would like everyone to vote yes for House Bill 138 to move on? Problem is, you don't get to ask me things like that tonight. Good try. Good try. I will yield for one question. Chair recognizes representative Sharper up in the gallery to your left for a question. With a woman you. Yes, I will yield. Is it true that I am a landlord and have apartments and it will add a little extra work for me? However, this is a very, very great bill for the tenants and I think it's very important and I'm willing to go the extra mile and do the extra work. Thank you, Father's Bill. I appreciate you. Representative Sharper, I yield the will. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Cannon rise? Parliamentary inquiry. Is it not true that this bill exempts up to 100 law enforcement agencies in Georgia on the final lines of the bill? I don't know the answer to that. I'm sure that the lady believes that to be true. That purpose does Representative Stacy Evans rise? Parliamentary inquiry. State your inquiry. Isn't it true that this bill does exempt certain share of office below a certain size of employees because there was concern in the committee about burden on law enforcement, but we wanted to make sure that as many areas as possible could have this information available to their tenants in the area. That's a good explanation to the previous question, I think. Thank you, Mr. Speaker. Have all members voted? Have all members voted? If so, the clerk will unlock the machine on the passage of House Bill 138. The eyes are 128. The nays are 34. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 327. House Bill 327, our representative, Bob the Hon. The 17th being titled an act to prevent organized retail crime to amend Chapter 1 of Title 10 of the Efficient Go to Georgia and intended relating the selling and other trade practices and so is to provide for definitions. This bill I refer to the committee on judiciary non-civil that committee recommends a disbilled do pass by committee substitute. Chair recognizes representative Mom to hand to present the bill. Thank you, Mr. Speaker. And members of the House, today I rise to present to you House Bill 327. House Bill 327 addresses a serious and growing problem throughout the entire state of Georgia. It is called organized retail crime. It does not matter for you to have or you shop whether it's urban, suburban, or rural, this crime is happening. It is devastating to stores, jobs and customers. It does not matter what science retail you are, Main Street of Wall Street, Bigger Small, if you are a retailer in Georgia than you eventually be a victim of organized retail crime. Science retail crime is where organized and sophisticated criminal elements use retailers of all sizes as an ATM to fund more serious criminal activity like the sale of narcotics, gang activity, and human trafficking. This activity is orchestrated by professional criminals and command, often taking advantage of some of our most vulnerable Georgians to assume all the risk by performing the leg work for their criminal gains. It is time that we make sure that the professional thieves assume the risk instead of the disadvantaged Georgians that they are targeting. Make no mistake, we are targeting the professionals. This bill, many years in the making, targets these professionals and organized thieves by holding unauthorized merchants who purchase gift cards for cash on the secondary market to the same extent that we currently hold punch-ups. By changing the definition of retail property and the retail fencing statute to contemplate all goods being fenced and not just new goods being fenced. At around no vote please account as convictions for the purposes of misdemeanor aggregation for the crimes of shoplifting and refund fraud. And it creates a new offensive organized retail theft and allows law enforcement in the judicial system to treat the leaders of professional retail crime rings appropriately to the emerging and urgent threat that they are. I will say that this version does not include any language that would hurt Georgians that are sending craft goods on websites. Georgia is the number one state in which to do business. We know that, but we want to make it crystal clear that Georgia will be in the last place when it comes to the business of organized retail crime. This bipartisan measure that was worked on by both sides of the aisle passed out of this house 144 to 15 and 2020. Thank you, Mr. Speaker. Thank you, members, for your favourable consideration. Mr. Speaker, I give you a question if there are any. You got a couple. I'll take one. Chair, I recognize as Representative Reeves to your left for a question. Representative Montagli yield. I give. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill will vote aye. Members opposed to vote no and the clerk will unlock the machines. What purpose is Representative McLaren rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that the reason this bill creates a new 3-20 felony for organized retail crime is because a lot of the retailers experiencing this crime don't want to require receipts for returns, which makes it really easy to return stolen goods for retail cards, which means that essentially these retailers are asking the criminal law to subsidize their customer goodwill when they could just lock their back door to prevent theft? I believe the gentleman believes that very intensely. I'm sure he knows where off he speaks. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 327, the eyes are 120. The nays are 48. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 236. House Bill 236, Representative Neil of 74th to be entitled next to amend Article 1 of Chapter 13 and Title 19. I believe if you go to George Anterty, relating to the granting of relief by Superior Courts.\n\nI for additional monitoring of the victim after the granting of a temporary protective order. Ms. Bill then refer to the Committee on Judiciary Non-Soviet Committee recommends that this bill do pass by committee substitute. Chair recognizes representative Neal to present the bill. Thank you, Mr. Speaker and colleagues. Today I rise to bring to you House Bill 236, which allows for law enforcement security checks for persons who are granted protective orders or restraining orders by a judge. Like one of my colleagues mentioned in committee and it has continued to stick with me, two often people say restraining orders are known to not be worth the paper they are written on. No teeth, it doesn't mean anything. We can change that today. Too many petitioners who apply for restraining orders in order to seek out peace or safety only to find that oftentimes it is not enough. Today we can change that. With the restraining order the citizen can take that document to the local law enforcement entity and get placed on a general patrol list or as equivalent. This bill is carried with bipartisan co-sponsors and I would like to thank Chairman Bershett and sub-chair Reeves on their support. And for working to get this bill right in the hearings I would also like to thank my colleagues on both sides of the aisle for their support and input on the bill. Additionally, I would like to thank the following law enforcement agencies for their support, Georgia Chiefs of Police, Georgia Sheriff's Association and Georgia Peace Officer Standards and Training Council who all came to speak to the bill during committee hearings. And with that Mr. Speaker, if I have no questions I yield the well and ask for your favorable consideration. We have a couple of questions if you care to yield. Probably against my better judgment I yield. Chair recognizes Representative Kendrick to your right for a question. Thank you Mr. Speaker. Does the general woman live? I do. So is this not your first bill representative? Yes, me. I almost got away with them knowing that. Yes, it is. It is my first bill. Is the general woman further you? I do. Is it not true that when you and I were first sworn in in 2011 you and I were there two youngest members of the legislature? That is true. Does the general woman further you? Yes, I do. Is it not true that when we were first elected that we had grand thoughts of saving the world and doing good for the state of Georgia? I agree. And will you further you have one more question? I do. Is it not further true that we haven't quite saved the world. This is a good citizen's protection bill and I am very proud to know you as a friend. Thank you so much. Yes, I agree. If I have no further questions. Well you do but I don't know. That is a pretty good note to end on. It is up to you. I will take one more. I recognize his representative, Kenan, to your left for a question. Thank you. Do you yield? Yes, I do. What is a periodic security check and what happens if that person doing the security check observes something outside of what they were looking for? What would they do? They would respond like they usually would as if it was a regular 911 call. And with that I yield well. No further questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 236. The eyes are 166. The nays are zero. House Bill having received the requisite constitutional majority is therefore passed. Clerk? Okay. As about to forget this. We are now going on to the final, final unless you all want another supplemental calendar. Now put your hand down, Representative Carpenter. Middle calendars and materials are outside the doors right outside the central door here, center door upstairs and 341. We'll take about a minute to do that. Sooner you get them, the sooner we get ahead and home. All right. I don't see any stampede to get them. Clerk will read the caption to House Bill 575. House Bill 575, I'm going to add a particular 140th to be titled an act to amend Code Section 485, 7.4 relating to bona fide, conservation, use property, residential, transitional property, and application procedures. This bill ever referred to committee on ways and means that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Dickey to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the caption to House 75 is a little misleading. This is our Macon Bib Consolidated Government O'Loss bill that represented Washburn, his work very hard on. We did a little maneuvering and with Chairman to get this bill to this point. I'm going to just ask you to vote. This is a great bill. The Electrical Citizens of Macon Bib vote on an extra one penny sales tax to 100% offset their avid loan property tax. That is what the bill does. The processing and marking is no longer in the bill. Representative Washburn, I think, wants to speak to this bill as well. He's the one that's put a lot of work into it. Chair recognizes Representative Washburn to speak to the bill. Thank you, Mr. Speaker, and thank you, Chairman Dickey. This is a good bill. I want to especially thank Chairman Chow Blackman for allowing us to substitute this bill into the original bill, Chairman Dickey had. This bill provides for a referendum by the Bib County voters to add a one penny sales tax if they choose to do so. If they do, it will provide some needed operating revenue for them, but it will also provide a significant rollback of property taxes. It provides, if they pass this bill, they will collect a certain amount during this year, but in 2022 there will be a seven-mill rollback that is part of the legislation. After that there will be a 100% rollback in years forward starting in 2023. There is a five-year sunset, and so the voters will have the opportunity to come back and vote on this after five years and extend it if they so choose. It's a good bill that provides needed revenue that the county needs, but it also provides substantial property tax relief for the property owners. I urge you, a favourable consideration of this bill. Thank you, Mr. Speaker. Chairman, as you did the well, is there any objection to the previous question being ordered that Chair here is none of the previous question is ordered? Is there any objection to adopting the Committee Substitute, the Chair here is none? The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The Chair here is none. The report of the committee has agreed to shall this bill now pass all those in favour of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machine. The purpose is representative butner rise. She waves. If all members voted, have all members voted, if so, the clerk will lock the machine on the passage of House Bill 575. The eyes are 162. The nasor zero this bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 465. House Bill 465, I will call it to the 19th and others to be entitled to amend. Chapter 60, total 36, the fish go to Georgia and M. Tatebele, and the general provisions applicable to counties and municipal corporations, so as to prohibit local governments from opposing civil penalties upon an alarm systems contractor for false alarm. This bill I refer to the committee on governmental affairs. That committee recommends that this bill do pass by rules committee substitute. Chair recognizes representative Gullet to present the bill. Thank you, Mr. Speaker. Today I rise to present House Bill 465. This is a compromise common sense bill that says that cases of false alarm dispatches only the party responsible she would liable for the fines or fees as long as they are following Georgia law. This is a pro business bill but also protects the consumer if there is any fault of the installer of the alarm system. There were some issues between the industry and GMA which have been worked out to both parties satisfaction and reflected in the rules substitute. Here's a body I ask for your favorable consideration and I will yield for any questions. Do you yield for a question? I'll yield for one. Chair recognizes Chairman Timothy Barr to your left for a question. Thank you. Does gentleman yield? I do. Can you walk us through if there's a false alarm? Who gets the bill? Depends. So if the installer did everything correctly and they can prove that the police department comes to them and says hey I need you. We sent the police there. It was a false alarm, false dispatch. Proved to me that you made two calls, the telephone laws that you made the two calls to the consumer. They've done everything in the law that they're supposed to then the consumer would get the bill. If they did not do that then the alarm company would get the bill. Very good. Thank you. Are you at the well? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. As opposed to vote no and the clerk will unlock the machines. What purpose does representative Wilson rise? Parliamentary. State your inquiry. Mr. Speaker, isn't it true that alarm providers have a much stronger idea of what constitutes a false alarm? I'm sorry, could you repeat that? Isn't it true, Mr. Speaker, that alarm providers would have a much better idea of what constitutes a false alarm? I'm going to let the members make that determination. I just know they're annoying if they come in in the middle of the night. What purpose is representative canon rise? Parliamentary. State your inquiry. Is there any way that the committee can't prove that a false alarm could also be an excessive use of force by a police officer? I don't know. I need for you to explain that one to me offline someday. Chair recognizes what purpose is representative McLaren rise? Parliamentary. State your inquiry. Mr. Speaker, isn't this sort of cap in the season for us on another preemption bill that takes away the ability of cities like Sandy Springs and Brookhaven to make decisions about what's best for themselves? I'm sure the gentleman believes that to be true. That's a determination to be made by each and every member. If all members voted, if so, the clerk will lock the machines on the passage of House Bill 465, the eyes are 113. The nasor 52, this bill, having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 194. House Bill 194, we're going to say it's the 180th and others to be entitled to amend Article 1 of Chapter 10 of Title 17. Bishop go to George annotated relating the procedure for sentencing and imposition of punishment. So it's to clarify that in term of probation shall follow the mandatory term of imprisonment for persons convicted of a sexual offense. This bill I refer to the Committee on Judiciary Non-Civil Act Committee recommends that this bill do pass by Committee substitute. Chair recognizes representative Sains to present the bill. Thank you, Mr. Speaker. I'll try to be quick. Chair, I request that the committee to make House Bill 194 address this part V, Georgia, 2019 decision that over the course of one night hundreds of dangerous sexual predators that through the Sheriff's Office discretion were given the important deterrence of a GPS monitor because of their leveling from SOAR, which classifies through three levels, third being dangerous sexual predator. This bill refines that measure that and adds a lifetime sentence of probation to 14 felony level sex offenses. It does this again, 14 felony level sex offenses that have been twice adjudicated, meaning two separate offenses, two separate complete instances that have been found guilty through this and one item that has come up through Committee that folks have been against is it doesn't give judicial discretion. I'd highlight in the bill that after 10 years of being on probation, the state has to then bring it before his appear court judge. This gives judicial discretion, it's a judicial discretion in the time frame that a judge would have the necessary leveling information. We know that SOAR is the most important leveling information to appropriately classify potential of recidivism is through the course of that sentence. It adds that 10 years of the judge at that point doesn't find that it's appropriate to do the lifelong sentence, they can take it off. It also has important measures regarding SOAR, which is the leveling organization, name change, etc. Mr. Speaker, given the time, I'll yield for one question. You have no questions, not even one. Thank you. Chair recognizes Representative Kenner to speak to the bill. Thank you, Mr. Speaker. Tonight I rise in opposition to H3194. It was never on my vision board to run for elected office, it's never on my radar at all. I was very content being a pastor and directing the Inspire program, which works to end homelessness. But after years of working in this field, I began to notice patterns, predictable patterns, and finding common threads among this population. As I became more and more curious about the root causes of these predictable incomes, I drew the conclusion that poverty is not only behavioral, but it's also structural. It's behavioral, and there is the important component of personal responsibility, and individual should own and address their life results. That is what we do in our program. We work on modifying behaviors, habits, and belief systems. But just as powerful of a factor is an undeniable structure that's in place that accounts for a significant amount of poverty that we face in our state and nation. I have discovered that this structure is propped up by policy and legislation, and that is what it's compelled me to run for office to work on this political structure. Dr. King said true compassion is more than flinging a coin at a beggar, but it comes to see that an edifice which produces beggars needs restructuring. We do see people work hard and change their lives in our program, but I must be honest with you. It's a heavy lift because of this structured, powered by existing policies and codes. It's difficult to move the needle with this group because of systematic inequities in education, literacy, mental health, and bias in our criminal system. We have had some momentum in the recent past. We were going in the right direction with criminal justice reforms during the Nathan Deal administration, but it is clear that we have done in about face. The criminal justice reform ship has sailed, and we are headed back to this very dark road of not just punishing people, but crushing them with harsh sentences. The longest probation periods in the country is in Georgia four times in national average. Then we put them in our state prisms that are honestly in disarray. Conditions are simply horrific in many of our facilities. Proof positive that we are regressing in criminal justice reform is HB 194, which piles on punishment for sex offenders when we already have some of the toughest punitive measures in the country. The program I work with attempts to work with these folks on the registry, but it's virtually impossible because of just the housing restrictions alone. As a matter of fact, there are so few housing options in my county that many of the individuals on the list are essentially exiled from Gwyneth. During the Tefong crime years, we saw debilitating policies like three strikes in your out that ballooned our incarceration rates to the largest in the world. The US represents 4% of the world's population, but 25% of the world's prison population, which means that one out of four persons behind bars in the world are locked up ironically in the land of the free. HB 194 does one better, though, instead of three strikes in your out, it's two. Lifetime punishment for the second offense. And it's an additional cost to the state, $1,100 per person per year for the ankle monitor cost alone. It removes judicial discretion. It's a solution looking for a problem when there is a microscopic recidivism rate with this group. It's so small that the bill's sponsor could only identify 53 individuals that would qualify. Do we really want to end judicial discretion because of 53 individuals out of 20,000 total on the registry? Let me be clear. Please understand, individuals should be held accountable for their wrongdoing with appropriate punishment. But this Old Testament-style vengeance is a throwback to a less evolved society. Do justice love mercy, the scripture says? Justice and mercy are not mutually exclusive. Let's indeed hold these persons accountable, but also allow these same citizens an opportunity with a path forward to redeem themselves and find restorative justice. Vote no to HB 194. Thank you, Mr. Speaker. I yield the will. Chair recognizes Chairman Bershit to speak to the bill. Thank you, Mr. Speaker. I think one important thing to remember about this bill is this is not the first time around for these offenders. This is the second time these offenders have committed some of the most heinous crimes that can be committed. Let me just tell you what these crimes are. I won't belabor this point because I don't know that I'll change many minds, but I do want to just tell you some of these crimes that are already after a second offense can be sentenced to up to life. Kidnapping if the victim is 14 years of age or younger, trafficking of child for sexual servitude, trafficking of a child less than 18 years of age, rape, aggravated sodomy, child molestation, aggravated child molestation. I think many people in this chamber would agree that these are some of the most heinous crimes that can be committed in the state of Georgia. Anywhere for that matter. And the fact of the matter is this is the second time. The second time these folks have committed this and all we're asking for is that we can monitor them for the rest of their lives because data shows that these folks are going to commit these crimes over and over again. So I am okay with airing on the side of monitoring stalking type behavior against children. I would ask for your favorable consideration on this bill. This is a good bill. I understand the opposition's argument that we want to be in this posture of criminal justice reform, but when it comes to the worst of the worst, and I would submit to you that these folks are the worst of the worst, I'm okay with giving them a life sentence. If you would please vote yes on this bill. I'd appreciate it. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative mom to hand rise? Mr. Speaker, Parliamentary. State your inquiry. Mr. Speaker, is it not true that the ministry that was mentioned earlier is the same ministry that puts those in only pink bags on anybody's mailbox? I have no idea. What purpose does chairman Todd Jones rise? Mr. Speaker, pursuing to rule 133, I'd like to be excused from this, wrote. Gentlemen has that right and the record will so reflect what purpose does chairman sets for rise? Parliamentary. State your inquiry. I think the gentleman is correct in that. What purpose does representative Holly rise? Parliamentary. State your inquiry. Is it not true that this chamber often having to receive the understanding and wisdom of our morning prayers often finds us at odds with the forgiving Jesus and what he would expect of us? I'm going to let everybody determine that within their own conscience. What purpose does the representative mom to hand rise? State your inquiry. Is it not true that sorb got indicates that over 7% of their classified offenders would be applicable to this law that though that the inaccuracy of 52 individuals being applied to this law is another notion. But 52 individuals of sex crimes lead many victims and victims of rape, child molestation and aggravated child molestation would not see this measure as insignificant. If the gentleman so states, I'm sure he believes that to be true. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 194, the eyes are 110, the nays are 59. House Bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 714. House Bill 714 by the represent of Kelly the 16th to be titled an act to amend our Glated Chapter 11, Title IX in the Fish Go to Georgia, Antidermal, and Provisional and Final Remedies and Special Proceedings. Those are revised and provide for new requirements under the Georgia Civil Practice Act for settlement offers and arrangements for Torclaims. This bill ever referred to the Special Committee on Access to the Civil Justice System. That committee recommends that this bill do pass by Rules Committee Substitute. Chair recognizes the majority caucus whip, Representative Kelly to present the bill. Thank you, Mr. Speaker. All this talk about the Bible reminds me of Matthew 2016 that says the last shall be first, the first shall be last. Mr. Speaker, I come before you with House Bill 714, the Rules Committee Substitute, LC413090S. This measure looks to do two things. First it looks to take our time limited demand statue back to the original agreement that was struck in 2013, provide clarity for both our plaintiffs' bar, as well as our defense bar for the way time limited demands can be sent and accepted. And second in section two, Mr. Speaker, it addresses our bad-state UM Statute with a measure that this body has passed overwhelmingly before in terms of the penalties of 25% or $25,000. The Speaker, I'll be glad to answer a question or two if there are any. Chair recognizes Representative Williamson to your right for a question. Thank you, Mr. Jim Monield. I will. Or just one final time we talked about in rules but are all parties in agreement on this bill. This bill does represent a compromise that's been worked out with the insurance industry and the members of the plaintiffs' bar. Further question? I'll yield. I don't know that note. Doesn't this simply put us back to where the industries, both sides of the trial bars, you phrase it were, had an agreement several years ago that just kind of morphed as one court case changed it. That's right. This is looking to take the legislation back to the 2013 deal that was on agreement between parties in and we've worked to put together an agreement between both parties in them. And final question. Yes, Chairman Leild. Heaven, you work really hard to get these parties together and this representative would like to thank you for that hard work. Well, I appreciate that. It's certainly been a team effort and I appreciate your help us where Mr. Speaker, I'm going to yield the well and ask for this body. Say we'll consideration on this measure. Do you further yield? I'll take one more. Chair recognizes Representative Wolenski over in room 341 for a question. Thank you, Speaker. Does the representative yield? I will. Sorry, I got lost. I'm tired. Online 31. Nope, go up. Online 28.\n\nIt says whether or leases for limited and itemization of what the claimant or claimants will provide to each release see as you know I'm an injury-referral death attorney What does that what would we tell him on itemization of what the claimant will provide to each release see? What's asking to be provided as you know when you're drawing up different types of releases? There's usually the conversation I know when when I'm dealing with these types of claims when to go share it with the defense bar on Necessarily what all terms will be spelled out in that release and that language was meant to encompass that Do you further you miss speaker? I think We've been here a long time today and and we were diligently through the process Again, this is a measure that's been negotiated and parties agreed both between the plaintiffs bar and the insurance Industry so I'm gonna yield the well and ask for this body's favorable consideration Is there any objection to the previous question being ordered the chair. Here's none the previous question is ordered Is there any objection to withdrawing the committee substitute? The chair here's none the committee substitute is withdrawn, is there any objection? To adopting the substitute offered by the Committee on Rules the chair. Here's none the Rules Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye those opposed? Will vote no and the clerk will unlock the machines. Have all members voted? What purpose does representative Wilinski rise? Preserve to rule 133. Excuse from this vote. Gentlemen has that right and the record will so reflect. Have all members now voted? If so, the clerk will lock the machine on the passage of House Bill 714. The eyes are 137. The nays are 31. This bill having received the requisite constitutional majority is therefore passed. The chair recognizes Chairman Mike Chokas for an announcement. No, not today. Thank you, Mr. Speaker. The small business development committee will be meeting tomorrow at 11 a.m. 5.06. 11 a.m. tomorrow morning 5.06. Thank you. Chair recognizes representative Nelson for an announcement. Hold up. We have one more announcement on the way down. House will remain at order. Let's see if you can run as fast as Chairman Chokas. I think she's faster. On tomorrow the women's caucus will be meeting at 11.30 in the capital room 216. Lunch will be provided. We look forward to seeing you have a great evening. Thank you again. I yield the well. Okay. Cross over day 2021 is over. And the chair, Chair wants to thank all the members, both caucuses, for helping this day go as smooth as it did. And I'm grateful for that. And we can be very proud of this House tonight. And the chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 1 p.m. Tuesday, March tonight, 2021. The majority leader has moved that this House be adjourned until Tuesday, March the 9th, at 1 o'clock p.m., all those in favor of the motion will say aye. Those opposed will say no. The eyes have it in this House as adjourned until Tuesday at 1 p.m.",
  "updated_at": "2026-02-13T10:48:57.226789+00:00"
}