{
  "video_id": "qxmEMoklBi0",
  "url": "https://www.youtube.com/watch?v=qxmEMoklBi0",
  "title": "Democratic Response to the State of Judiciary | 1/28/2025",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 15,
  "summary": "Here is a summary of the key points from the Georgia Democratic Response to the State of the Judiciary session on 1/28/2025:\n\n**Overview:** The Democratic Senate leadership introduced and discussed SB 50, a bipartisan bill to expand Medicaid in Georgia and close the insurance coverage gap. This was presented as the top legislative priority for the Democrats this session.\n\n**Key Actions:**\n**SB 50:** Expands Medicaid coverage to 500,000 Georgians, helping to reduce infant and maternal mortality, provide access to care for working parents and children, and increase access to mental health services.\n\n**Bills Introduced (First Reading):** SB 50 - Medicaid Expansion Bill\n\n**Notable Moments:**\n- Democratic Senate Memorial Leader Harold Jones highlighted the benefits of SB 50 and the bipartisan support for the bill.\n- Senator David Lucas, a sponsor of SB 50, spoke passionately about the need for Medicaid expansion in Georgia and criticized the Governor's alternative \"Pathway\" proposal.\n- There was discussion around educating the public and working with the Governor to get the bill passed.\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** No quorum notes provided.\n\n**Adjournment:** The transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "Good afternoon. I'm Harold Jones, the Democratic Senate Memorial Leader and the Georgia State Senate.\nAnd today, we are the honor of actually dropping SB 50. Actually, it's not done on purpose, but it is the carrier of this particular bill.\nIt is its 50-year also within the Georgia General Assembly. So SB 50 will actually help us close insurance gap that exists in the area of health insurance.\nClosing this gap means various things.\nNumber one, it helps reduce infant and maternal death rates.\nSecondly, it also makes sure that working parents\nand kids have access to care.\nIt also will increase access to needed mental health services\nbuilding safer and stronger communities.\nThe insurance gap that currently exists\nmeans that people have to use emergency rooms.\nUnfortunately, sometimes even jails,\nall sorts of stuff got measures\nto actually get health insurance.\nThose days will now stop.\n500,000 Georgians with the passage of this bill will see health insurance coverage.\nAnd the great thing about this particular piece of legislation still also uses our private\nsector.\nBecause what we take places, the actual funds will be able to be used for private insurance\ntoo.\nAnd that would be key.\nIt allows for flexibility.\nIt also allows for innovation.\nAnd those are key things.\nSecond aspect of this particular bill is that it also will allow for a commission, which\nwill be five Republicans and five Democrats on this particular commission, to where they\nthey can actually overlook and kind of oversee\nhow the insurance program is working.\nOnce again, basically be it to adapt\nto the change in insurance industry that may take place,\nchange in healthcare industry that may take place.\nSo you have a situation where you have private sectors\nto still actively involve that allows innovation.\nAnd at the same time, you're making sure\nthat this particular legislation will continue\nto grow over the years.\nAnd so 500,000 George will have an opportunity now\nto have health insurance.\nAnd that is something that is very meaningful\nwithin this state.\nThis is our number one legislative priority.\nYou'll remember that last year,\nlast session, we actually came one vote short\nin regulatory industries from moving that out\nto getting into the Senate floor.\nWe believe this bipartisan piece of legislation,\nbecause we actually do have some Republican signage\nfor this too.\nWe believe that this bipartisan legislation\ncan actually get passed.\nAnd we're gonna work hard to make sure\nthat actually takes place.\nOur agenda this year is based on economics,\npure and simple.\nWe're gonna make sure that we take care\nof our people in Georgia.\nOne of the other issues that we're gonna be looking at,\nof course is to increase the minimum wage\nthat has not done for many years.\nWe have to realize that almost 20% of our children\nstill live below the poverty level with Georgia.\nWe're gonna make sure that we continue\nto push public schools.\nWe know last year there was a plan\nactually to increase vouchers.\nWe wanna make sure that the public schools\nare properly funded.\nAnd then lastly, we also wanna push\nto make sure that people can afford childcare.\nThose are issues that matter to Georgia's.\nThose are the issues that this Democratic caucus\nis gonna be pushing.\nAnd we cannot be happier today\nto actually have a piece of bipartisan legislation\nthat will impact over 500,000 people.\nAnd also stabilize the insurance industry,\nalso stabilize healthcare industry in general\nfor this particular state.\nAt this point in time, I want this sponsor of the bill\nand there's been many persons who also signed on to it\nto come speaking as Senator David Lucas.\nThank you, thank you, thank you.\nThis is Medicaid expansion, Georgia is a donor state.\nYou have Miss McCartle, who's the United States Summit, can put Medicaid expansion in\ncan take it. Then we ought to be able to do it for half a million Georgia's. We have\na plan that's the governor's plan, which I totally disagree with. It has work\nrequirements as well as the premiums are high. Medicaid experts will give\nhospitals, the greatest, the people. And in a new hospital being built, they\nwill not be dealing with unculturally uncomplicated care. That's in the\nemergency room because folks don't have health insurance and therefore see the\nemergency room as their primary care physician. It is time that we stand up and\nGeorgia across Democratic and Republican rights that not only do we need to\nbe the one of the dollar state but we need to be one state that benefits from\nthe money that George put in the pool. We tried it, we found hard for it, but we\nhave to fight a little bit hard. And hopefully that will some of our counterparts\ncoming across and joining us to help provide health care insurance for\njoy. We have to realize one thing. It's about eating others. See, you got folks who do work every day.\nGo to work every day. Take care of family. Pay rent. All more. Drive a clock to get to work. When\nAnd when it comes to expendable income, they don't have it.\nMedicaid expansion is not about work, it is about health care.\nAnd that's the reason that we have put our efforts behind trying to make sure that I\nhave for me and Jordan, can receive health care.\nThe plan to go to the health, you don't see anybody running the junk.\nupon the plane. We spent 29 million dollars. We got about\nforty two hundred folks inside, but the premiums are high, and\nthere is a work requirement. It's time that we, as legislators, see\nabout the people of Georgia.\nAnd also, as our public also have even here, also with us, there are partners in this\ncourse.\nWe will, I'm sure we get this done for the State of Georgia, and this time we open up\nany questions.\nI think that's something that the governor have to deal with. We want to get it to that point. That's the key. We want to get it to that point. I think it's we kind of educate the public. The fact we have bipartisan shit. That's number one. The fact that we know that rural hospitals are closing.\nhospitals are closing. And that's number two, that's something that's real. Those are things that\nhave really happened. Real hospitals actually closing. Now we have bipartisan, but to buy in,\nwe realize that Georgia actually lags behind the national average as far as doctors are concerned,\nalso lags behind the national average as far as nurses are concerned, because of the fact that\nour reimbursement rates really are not there. I think when the facts are there, and as long as we\nare pushing the issue openly, and we are welcome by partisanship, we welcome dialogue, but I think\nas long as we're pushing this issue in a good fashion,\nwe can get the governor on board.\nI just believe Pathway is right now.\nIt has too many logistical issues with it\nthat will not be at work.\nBut I think that we can work together on this\nand I think that's the key thing.\nWe're open.\nWe're open to working with the governor on this.\nWithout a doubt, we're open to doing that.\nAnd I think that's key.\nWe all want the same thing, but I believe this mechanism\nis the best way to get there.\nAnd that's the path I think we should be taking.\nWhen the governor announced his proposal, Pathways proposals, he made this claim that his\npathway has covered 200,000 more than full Medicaid expansion was.\nWhat was your response?\nI think what's happening is basically he's conflating what's called the premium tax credits\nthat comes from the federal government and actually putting those numbers within there.\nI think that's what's taking place if you really look at it.\nSo what happened is the federal government actually prepared the tax credit.\nmade access to healthcare a little bit easier,\nmore affordable, and people who went to the marketplace\non their own.\nSo you have the private market,\nthe other marketplace there, the ACN marketplace.\nYou still on your own could actually access that insurance.\nAnd so people who now had that tax credit,\nthey were able to access that.\nBut that's actually a federal program\nthat actually came from the Biden administration\nthat he actually has taken credit for.\nBut I think that's exactly what was taken place.\nBut as far as pathways itself,\nconcerns, look at the numbers,\nthat would not be supported.\nSo we have a card in summers, Billy Hickman, Russ Goodman, and Sam Watson.\nDemocrats have some power when there's other legislation that Republicans are not unified on and need Democratic votes.\nI'm thinking potentially of the tort reform push from Governor Pamp that we're expecting to see later this week.\nWhat is going to engage on court reform perhaps in exchange for some health from Republicans\non this bill?\nThey're quite frankly the separate issues and I think they should be treated separately\nand that's how we want to be approaching this at this particular point in time.\nRight now those are two separate issues but when you start talking about health care\nand total fund, here's the difference, health care really should be treated as a right.\nSo we should not be connected to any kind of other kind of deal, health should be treated\nas a right.\nis just something that you're trying to bargain\nand make it a deal out of.\nThe third pathway being available in the last year\nand definitely has the same application\nthat we did, you get that in the emergency\nor is it familiar with the session?\nYes.\nIt certainly is added in the sense of urgency,\nbut the urgency really is not on our part.\nThe urgency is for the $5,000 figure, not covered.\nThe urgency basically is for Georgia,\nbecause the fact that when you have this kind of instability\nwithin your healthcare system,\nthat causes instability all around.\nSo that's really where the urgency is.\nSo it's not for us.\nWe want to build paths, but the urgency is people right now\nwho today can't get the chosen shirt,\ncan't end themselves in shirt.\nThat's where the urgency actually exists.\nArthur?\nI saw a hand in that hair.\nIt was great over here.\nYou talked about, did you feel like the premiums were too high?\nI think that we came up with the premiums and the credits\nwas like, I did your plan for it.\nIt differs, but what I say, the premiums,\nthey're not really necessarily talking about\nnecessarily the premiums on the government's plan.\nOne of the issues about the government's plan is\nyou're basically trying to create a job program\nand a health insurance program to combine.\nThat's really the key part about that plan\nthat becomes difficult.\nIt's an administrative nightmare is what it is\nbecause that's exactly what you're doing\nbecause you have to go out of all these different poops\nto determine whether a person is working or not working.\nThey have to do different things to show that.\nThat really becomes a logistical nightmare of it.\nThe premiums that will exist, of course,\nthat's now going to still go into a private instrument\ngoing through private insurance, that is something that would still have to be worked out.\nBut I think the problem with the government is playing more so as the logistics of it,\nbecause you have your employees trying to be basically persons who are looking at jobs,\nbut at the same time trying to provide health insurance. Those two should be melted together\nin that way. Yes, ma'am? About being in the minority a lot of times it's a number of things,\nso you just mentioned those senators, but what would your message be to other Republican senators\nto come to your side when it comes to its people? You constituents need your help.\nThat's the bottom line.\nYou're constituents near and huge your health.\nGeorgia needs your health,\nbecause many of those Republican senators\nrepresent those rural areas.\nThis isn't just a rural issue, it's a Georgia issue.\nBut certainly those who live in those rural areas\nthat have hospitals that are being closed\ndon't have access to almost any medical care.\nWe even heard talking about legal deserts today.\nThere's also medical deserts.\nThis is a real issue.\nAnd so your constituents need you.\nThat's what my message should be to them.\nIs there anything in the cheaper that is driving\nI think it's the same issue that already exists and that's what that we have people right now wait the emergency room just to get health care. I think that's the issue.\nI think so. I think so. I think we have a good chance because we came so close last year and so that helps that gives you the momentum and that's why we didn't want to lose that and if we had a conversation about that she may not push this absolutely not we have to do a\ncould state need.\nI feel like one of the biggest things that has changed my life here is that the speakers\nseem to have close to when they're going to last year.\nTalk about that.\nWell, you know, under the gold dome, a gnome might mean not now, and one of those are\nnever really closed.\nBut Republicans see what we see.\nThey see that we have 11.7% uninsured here in Georgia.\nThey see that hospitals have closed.\nThey see that we have maternal care deserts.\nThey see that rural communities don't have doctors.\nThey don't have hospitals.\nThey see that and they feel that this is an economic issue.\nAnd we have a moral obligation to continue to push it because it is what is right for\nthe citizens of Georgia.\nSo I always say, no, may not mean no.\nMaybe just not now.\nIs it possible that no means not while Brian comes with governor?\nWell, you know, governors can be persuadable.\nAnd I think it's incumbent upon all of you all to help us tell this story.\nThis is Georgia's story of this is the greatest failure of Republican leadership is the lack\nof providing access to health care to Georgia citizens.\nI heard some of our students from both members of both parties about\nis in many cases the concern that maybe the biggest change in the federal government\nis that I'm familiar with this and I think that if I happen,\nI'll see if I get the direction I'll be changing.\nNot being up there is hard to tell, but I will say this.\nI think that it's so entrenched now quite frankly,\nonly 10 states have not done this.\nAnd so we have to look at it from that perspective\nto make that kind of change\nwould affect the majority of states now.\nSo I feel hopeful that that kind of change\nactually wouldn't take place.\nBut let's wait for that.\nLet's continue before that's going to be the key thing.\nAnyone else want to say anything?\nThank you guys so much for coming out.\nWe really appreciate it.\nThank you.\nThank you.\nThank you.\n",
  "updated_at": "2026-02-12T19:06:35.552195+00:00"
}