{
  "video_id": "qyHqclSC_Ys",
  "url": "https://www.youtube.com/watch?v=qyHqclSC_Ys",
  "title": "Conference Committee HB189 - 3/29/23",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 62,
  "summary": "Here is a structured markdown summary of the Georgia Conference Committee HB189 - 3/29/23 session:\n\n**Overview**\nThe session focused on the ongoing discussion and negotiation around HB189, which deals with increasing weight limits for certain agricultural and timber trucks in Georgia. The discussion highlighted the need to balance supporting the state's crucial agriculture and forestry industries while also addressing concerns about infrastructure funding and maintenance.\n\n**Key Actions**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Representative Minks opened the session with a prayer.\n- Representative Gooch shared remarks emphasizing the need to work in good faith to find a solution that helps the state's farmers and foresters.\n- Senate Majority Leader Gooch gave an extensive speech outlining the history of transportation funding challenges in Georgia, the importance of infrastructure investment, and the need for a broader, long-term approach beyond just the current HB189 negotiations.\n- There was discussion about the provisions in the Senate version of HB189, including the one-year extension of increased weight limits, the carve-out for non-attainment counties, increased fines for violations, and allowing local law enforcement to assist with enforcement.\n- Concerns were raised about potentially losing the bill if drastic changes were made in the conference committee.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nThe quorum and attendance were not explicitly stated.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "You\nYou\nAnyway, I don't know what you got.\nThey say I'd like to talk.\nRepresentative Minks, do you mind starting us out\nwith a word of prayer?\nAbsolutely, let us pray.\nThey're having a father just thank you for this day.\nThe opportunity to come together to continue\nto work out issues facing many Georgians across our state\nor guy would just pray that what we do\nwill be pleasing unto you and that your will be done.\nBe with our families that are traveling here\nto be with us to your having a father.\nBe with those families that may still be at home\nor waiting loved ones to return.\nJust got our conversation to your early father\nand bless us.\nguidance and direct snow things and all things we ask in your name. Amen. All\nright. Later Gooch, I believe you wanted to share some\nremarks. I'll be glad to. I'm glad to be here where we're at now with this\nconference committee. I come here in good faith to try to try to work out our\ndifferences between the two bodies and to try to do something to help the\nThe people that made me who I am and the folks that I represent back home and the hardworking\nfarmers and foresters of our state and I hope we can do that the day and I hope we can\nget something that everyone can agree on and hopefully get it passed to help the people\nof our state and so we shall see.\nLeader Gutes go ahead. Number seven. Thank you Chairman Goodman and Chairman\nJasper's and Chairman Meeks and Whip Berchette and Chairman Dolezal. We have\nhad a full long session. This is day 40. We've got a lot of work to do before\nwe all leave here tonight and this piece of legislation has been in this\nbuilding for more than one year. I think it's been around four years or so. I\nI think I see nodding heads out in the audience.\nIt's an important piece of legislation for industry.\nObviously our ag industry is our number one industry\nin our state.\nWe want to continue to promote it, protect it,\nbut we also have responsibilities as a state\nto protect the citizens and protect the investments\nthat we have made in our infrastructure.\nWe have spent billions of dollars over the years\nin the 12 years that I've been in the Senate.\nWe went from practically not being able to make bond payments,\nnot being able to pay our employees,\nand basically not building any new roads\nbecause of inadequate funding.\nIn 2015, we did what we thought was the right decision.\nWe increased the gas tax and the diesel tax in Georgia,\nwhich increased over a billion dollars a year\nof additional revenues.\nAnd we have seen significant improvements\nin that infrastructure as a result of that investment.\nThe billion dollars a year that we increased in 2016\nas a result of passing house bill 170\nwas a bare minimum that we were told by the experts\nthat we needed to just maintain what we had.\nAnd we were told day after day after day,\nwe could not improve our infrastructure\nwithout additional funding.\nWe were able to get a billion dollars\nand we knew that was not gonna be sufficient.\nThe last four years, we've spent time, chairman Jasper's,\nchairman Gianne, chairman Dolezal, myself,\nchairman Beech, and others, chairman Tanner.\nWe've had study committees on freight and logistics.\nWe have a tremendous state to do business.\nWe're here all the time.\nWe're the number one state to do business.\nWe have the fastest growing port in the nation\nor on the eastern seaboard at least.\nWe have the number one airport,\nthe busiest airport in the world.\nWe have all the right ingredients of best climate,\nbut we have an infrastructure that is not adequate\nto continue to support the kind of growth\nthat we have experienced and what we expect\nto experience in the future without investing billions\nand billions of dollars more to not only maintain\nbut to enhance that infrastructure.\nAnd so this decision tonight has to be bigger\nthan just about allowing additional weights\non farm trucks, ag trucks, or timber trucks.\nIt's got to be more than adding 4,000 pounds per load.\nThis discussion has to go from tonight forward\nthrough the next six to eight months,\ntalking to the people that are in this room\nand the people that are listening to us online\nto say the Georgia businesses have to be a part of the solution.\nWe need every one of you to be back in this room\nthe next time these two transportation chairman calls\nmeeting for this discussion because we've got to find additional funding to fix the\nproblems that we know or that are coming. We have to invest in this infrastructure.\nSo whatever we do tonight, it's not the end of the conversation, it's the beginning\nof the conversation. If a bill passes here tonight, we can't say, all right, we're finished.\nY'all go and you'll have your way or you won't have your way. But instead, we're going\nto be back in this room in the next few weeks talking about it even more. We need additional\nfunding. I don't know where that additional funding would come from. We've\nspent a lot of money over at the DOT looking at it with consultants. We have\nstudies. We have a freight logistics plan that has just been completed that\nindicates how much that money is and it's in the billions of dollars with the\nV. And so Mr. Chairman, I want us to make sure we keep the big picture in mind as\nwe go through this conversation tonight. This bill that the Senate passed gave\nus a one-year extension on the truck weights that were increased from 84,000\npounds to 88,000 pounds and we narrowed it down to ag industry and timber\nindustry trucks only. We put a carve out to where those extra weights would not\napply in the non-attainment counties in Atlanta. There's about 13 counties\nthat that would apply to, we increase the fines for bad actors.\nIf you're pulled over by a motor carrier, you would be weighed and you would be fined accordingly.\nWe also put language in our bill that came out of the Senate that allowed local law enforcement\nto do the enforcement as well.\nAnd I know people in this room have heartburn with that.\nAnd so we need to have that discussion as well.\nbelieve that if you're going to be able to carry the extra weights, you should be in compliance\nwith the letter of the law. And that's important for two big reasons. One is public safety and\ntwo is going to help us to be sure that the bad actors do not continue to degrade the infrastructure\nof our back roads, especially county roads that are built to substandard performance. And we know\nour interstate routes are built to good quality standards but for whatever reason the federal highway\nwill not allow you to go over 80,000 pounds and so what we're asking in this legislation is allowing\nis for us to increase our weights not on the interstates but on other roads other than interstates to\ninclude secondary county and city streets so what we have to do is be very careful in how far\nthis bill carries us into the future. One year, in my opinion, is adequate. 88,000 pounds is a\n5% increase over what we had. So I think it was a safe approach. It was a carefully crafted bill\nthat Chairman Dullesall and I worked on together and it came out of the Senate with 44 votes for it\nand a few votes against it. If we make drastic changes to this conference committee report tonight,\nWe may lose the bill. I just want everybody to be prepared for what could happen.\nSo thank you for letting me share a few words and maybe others will want to share some words and maybe we can talk and ask questions.\nAbsolutely.\nNo doubt that we're going to have needs in the future.\nI just, from my personal point of perspective, and maybe it's just because I'm a, you know,\nSouth Georgia farmer holding our farmers hostage to get it, there's something that doesn't\nsit very well with me, and the folks that I represent, but I would like to, who would\nlike to go next, you know, representing Meeks?\nThank you, Mr. Chairman, and leaders, Mr. Leader, and Mr. Chairman, and Wilbur Chett, and\nChairman Jasper's certainly appreciate the many,\nmany hours of debate and conversation that has taken place\nwith House Bill 189.\nMany of you probably know that House Bill 189\nthat finally passed the House was actually\nthe third version of the bill that passed.\nOne that we took from the, as introduced,\nwe kept making changes to it, trying to make it better,\ntrying to work with industry to make sure that we were addressing the issues to the\nleader's point, not all of rural Georgia has an interstate that runs through it.\nAs we look at the competitiveness of agriculture and forestry, margins are thin.\nAs we put input cost onto those loads, that's not something that we pass along to the end\nuser, we absorb that cost as a cost of doing business in a time when input cost and margins\nare extremely thin.\nI think that's one of the things we have to look at.\nWe look at tax credits and other things that we do for businesses and I sit around and\nI think about this and I'm like okay if a business really doesn't like what we're doing,\nhave the opportunity to pick up and relocate somewhere else. That's not the case with\nthe land people. That's not the case with the farm land. We can't pick up and move to\nanother state if we are trying to be competitive in an area in which we can we can do something.\nWe run under an executive order now for three years at 95,000. I know last year the whip\nhad a bill that came out I believe at 95,000. I mean there was conversation about going\nto a hundred. I felt like we started at nine and we backed it up to 88, felt like we had\na good compromise in the house in the build that could be workable for the industry, for\nthe economy, for the end users, for the customers. And I agree it is a big picture. But I think\nwe have to remember as we move forward that, you know, I think the industry is happy to\nbe at the table and help come with ideas but when we look at the bottom lines of where\nwe are and producers are as opposed to one that can be passed on to the to the end consumer\nI think it's one of the things that we have to keep in mind.\nI know a lot of hours have been spent on this bill both those that supported and those\nwho oppose it.\nI certainly appreciate everyone working with me and trying to get us to a workable solution\nas we move forward on the day 40 here of Sonny Dye.\nSo thank you for all the efforts and hopes\nthat we can come to a resolution\nthat's positive for the industry.\nThank you.\nChairman Jasper.\nThank you, Mr. Chairman, just real quick.\nAnd we all want to have lots to do.\nYou know, thank you for the openness\nthat we have in this discussion.\nI think everyone that's been involved in this\nhas been very open in the committees.\nYou know, we had a nearly five and a half hour meeting\nthe first time we heard it this year in January.\nYou know, to let the public had what 90 questions\nby members to see how we drill down into the center,\nI mean, Representative Meeks is a deal.\nI, you know, and I appreciate this.\nIt's a great discussion and the openness of it.\nYou know, Senator Gooch, I agree with you absolutely\nthat as you and I have worked together for the last three years\non infrastructure needs.\nThat's the overhanging cloud over all this.\nYou know, I put forth a house bill this year\nto kind of look at just House Bill 617\nto look at a plan to spend money.\nHow would we go about taking infrastructure needs\nthat we, and how we apply money toward it\nif we can determine what we do.\nAnd I hope we continue to look at that next year.\nYou know, the only thing I just want to throw out\nAnd a couple of things is, you know, local law enforcement\nenforcing these laws.\nI think, you know, the motor carrier division\nis a very professional well-trained\nprecise group of people.\nWe got to know them in the two community meetings\nwe had in the house, and I certainly want to keep them\nat the forefront of making sure that we do stop bad actors.\nAnd I, we all recognize there are bad actors out there\nin that that group can do a good job doing that\nand we'll do it right.\nBut you're right, infrastructure needs are huge,\nbut I think with the side of the local agricultural needs\nare great in this area too.\nI look forward to finding a solution.\nThank you.\nChairman Dullesall, are you here to say something?\nRepresentative Berset, what number are you nine?\nOkay, go ahead.\nThank you, Mr. Chairman.\nI'm just excited to be on my first conference committee.\nI know what doing my hands.\nWhat are we doing here?\nI totally understand.\nI shave just for this conference committee, just so everyone\nof you all know.\nSo that should earn me some credit here.\nI think the Senate did some good work\nin improving the bill of the House.\nI just think there's a few provisions in here\nthat if we tweak a little bit,\nwe can get to a workable solution\nthat both benefits the opportunity\nfor the industries that continue to grow,\nwhile also understanding that these folks\nare using these roads and that they should be\ncognizant of the necessity of the state\nto be able to keep these roads in a state\nor in a place that keeps our roads in the state that they are now, right?\nSo we want good roads in the state of Georgia.\nI just, I think that a one year is not a long enough time to figure this out.\nI get that we have some, you know, some budgetary needs coming up fairly quickly.\nAnd frankly, I don't know anywhere else that we sort of say,\nhey, you guys need to be here at the table to make sure\nthat we can tax you appropriately.\nI think that any time taxes are talked about in this building,\neverybody's going to come to the table\nbecause they don't want to give their pound of flesh, right?\nSo they're going to be in here advocating on their behalf.\nAnd I don't think we should pick out\njust a couple industries here.\nI do get the, you know, the point of it to make sure\nthat they are sitting here, but the folks that I'm dealing\nwith that are advocates for raising the weight,\nthey're here every year.\nThey're here every year.\nThey're working on their issues every year.\nYou think you get their issues handled this year\nand they come up with new issues next year.\nThat's the way it happens.\nI don't think they're going anywhere.\nI think that it's a, like I said, you guys did some good work.\nAre you thinking of, you know, in a different manner than we are in the house?\nThat's why our process is perfect.\nI'm just asking that we come to some terms here that the industry can live with and the\ncynic can live with and let's get a bill passed.\nThere's been too many hours under this gold dome dealing with this issue.\nYou know, I think we've reverted back to a weight that is a reasonable ask, 88,000 pounds.\nconsider the other initiatives we have in this state here we're you know we're\nadvocating and running down a road so fast that sometimes I can't figure out\nwhere we are with these electric vehicles and nobody's thinking about you\nknow a Tesla being two and a half times the weight of a camera or thinking\nabout a commercial truck that's going to be 15,000 pounds heavier empty if it's\ngoing to be a battery operated truck. Those conversations need to be had if we're going\nto be walking down this electric vehicle road. So I'm just asking that we look at some\nof these provisions here, the sunset, this radius 175 miles. I mean, currently, correct\nif I'm wrong, you don't even have to have a CDL if you're a farmer and you can drive\n150 miles from the farm. I'd like to see us at least match that code section that allows\n150 miles, and I'll be honest with you, I think that most of the folks that are in these\nindustries, they'll tell you they don't haul much further than, they certainly don't\nhaul more than 150 miles, they haul, you know, try to stay around 100 miles, I think\nthat's probably the spot where it's not economical anymore to haul wood or haul farm\nproducts. Those two provisions, and then this local enforcement thing, I'd like to have\na conversation about the local enforcement thing. The conversation that I've had with\nmy folks back home, they can't even get deputies enough to respond to domestic violence calls\nor run radar on a road, and I don't think that it's practical to say that our local\nshare so they're going to or PDs are going to go out and buy scales and get the\ntraining and put them on the roads ready to you know enforce this law. I think\nthat you know it's a lot of all approach but we need to be a little more measured\nin that approach because everybody is telling me that they're having hard\nenough time getting folks hired for these positions to do just you know public\nsafety from a, you know, from a burglary, fire arms, kidnapping, you know, just\ndoing the regular run of the mill law enforcement. We're going to add to\nthese local guys. I think that's a provision that I'd like to discuss here.\nAnd I don't know how this goes, Gucci. I know you've been on these things\nmultiple times. So you tell me when it's low down or when to stop and I will.\nAnd those, I'd just like to talk about those, see if we can come to some terms that we\ncould get the industry to live with and you guys can live with so that you feel we have\ngot enough hook into them to get them back here to sit at the table and talk about, you\nyou know, how we're going to fund these all roads in our bridges.\nThat's all I got, Mr. Chairman.\nNumber seven.\nThank you.\nWe'll help perchette.\nLet me, since you've identified three areas of concern, which is basically the\nthe Jess of the bill now.\nThe local law enforcement piece.\nLet's talk a little bit about that and drill down some.\nAs you know in this bill, it's not a mandate that the locals enforce it.\nand it's totally optional.\nEach county would make that decision\nor each jurisdiction, whether it's the city PD\nor a county sheriff's department,\nor whoever it's always subject to appropriations\nby the governing authority,\nwhether it's city council or county commissioners,\nand there would have to be certification training requirements\njust like we do with motor carrier division in the state.\nBut why would you be opposed to a county\nthat wishes to invest in the equipment,\nwhether that's $5,000 for portable scales\nor $10,000 for training, whatever the number is.\nIf the county is willing to invest in that,\nand allow that police department or that sheriff's department\nto go out into those communities\nto protect their citizens for public safety.\nNow, we're not just talking about\nweight that would tear the roads up,\nbut we're talking about public safety as well,\nespecially in back roads.\nA lot of these county subsurface treatment roads\nare very thin, but they're also very narrow.\nVery little drainage.\nI've been all over South Georgia with Chairman Goodman.\nI live in North Georgia.\nI grew up on a farm.\nI understand it.\nI was a county commissioner.\nI understand how some of these roads are built.\nThey start out with dirt.\nAnd in North Georgia, we use granite for base.\nAnd then we put a little chip cell down,\nwhich is tar and gravel.\nFew years later, we get a little bit more money.\nWe put a couple inches of binder or e-mix and then come back,\ntop it with F-mix or whatever,\ntopping you want to put to make it slick and pretty.\nBut two, three years later, it starts to crumble,\ndepending on the thickness of the asphalt and the base.\nIf the base isn't prepared correctly,\nthe roads are going to come all to pieces.\nThey're not going to last.\nWe have to let the county commissioners\nprotect their investments.\nI don't think Motor Carrier has enough resources\nto take care of the interstates\nin the state routes that we have today.\nI think they do a great job.\nSomeone's bragging on them earlier.\nWe need to invest in their resources as well\nto protect our citizens, protect our roads.\nSo why would we be opposed to allowing counties\nand cities to do that on their own?\nAnd I get it.\nThe sheriff's may not politically want to do this,\nbut at some point they have an obligation\nto enforce the laws on the books.\nThey do it today on other things.\nThey run radar, they catch speeders.\nI've been pulled over for speeding, and I violated the law.\nI paid the ticket.\nSame thing should happen with any of us\nif we're doing something wrong.\nI don't think anybody at this table\nis going to disagree with that.\nSo why would we not let the locals enforce\nthe laws that are being broken?\nAnd if that number that's in here is wrong,\nlet's find what that number should be,\nwhether that 20 cents is too high or too low or what have you.\nSo let's have that discussion.\nBut I'd love to hear some feedback from you\nwhy we shouldn't let local law enforcement\nhave that authority.\nWell, I agree.\nYeah, nine.\nWell, I think I understand your argument.\nThe question is why do we not want to let them?\nI don't think they want to.\nI don't think they want to be weighing trucks.\nAnd so that's just the, that's where I'm come,\nthat's the position I'm starting.\nI don't think they want to be weighing trucks.\nI don't think your PD or your sheriff's\nwant to be weighing trucks but that's pretty much the basis of my argument. I do understand\nyour argument about the roads at a county level. I know there's only so much money to go\naround in rural Georgia or we'll just pick any county and so many times the county commission\nis the commission of roads and bridges. Roads and ditches is how we say in South Georgia.\nSo what they do is they get $600,000, maybe they could get a G dot spec, you know, quarter\nmile out of that, but, you know, Commissioner A wants a mile in his district, Commissioner\nB wants a mile in his district and so on down the roads, they take that $600 and they\njust put binder down on a road and they go 12 miles with it or whatever it is.\nI think that's also a basis for the problems that we're having.\nWe're building roads to a substandard spectre.\nBut I have to address the fact that we've\nbeen running 95,000 pounds for three years.\nAnd before that, when we had a fire in 13,\nwe ran it for, I don't know, at least 18 months,\nmaybe longer than that.\nAnd before that, in 2007, we ran at 95,000 pounds\nfor however many months.\nI mean, this is not unprecedented.\nWe're asking for 88,000 pounds.\nIt puts us in line with these other states.\nAnd I know that the feds don't let 88,000 pounds\nride on there, but if you get a permit out of Savannah,\nyou can haul 100,000 pounds.\nAnd I know that's 1% of the trucks that've got that permit,\nbut I don't know how many trips they're making,\nbut there's a god awful lot of containers coming out\nof that port at 100,000 pounds.\nAnd they're riding on that interstate.\nThey're riding on that state road,\nand they're riding on that county road,\nbecause they can only go from pick up to delivery.\nAnd I would submit to you that there's not a truck anywhere\nin the state of Georgia in this nation\nthat is doing anything but picking up and delivering.\nSo you got 100,000 pounds running out of the port\nwith 6,000 trucks with the permit\nfor however many trips a year running from the port\nto there's no interstate that runs from the port\nto Stewart County Company in Wakecross, Georgia.\nSo this is not unprecedented.\nWe do have the operating at these higher weights.\nWe have operated these higher weights.\nI'd just like to say that if the locals\nare asking for these things,\nI mean, maybe we give it to them,\nbut how many calls do you get Senator Gooch\nabout a speed trap somewhere and getting speed trap?\nAnd the next thing you're gonna be getting is\nlike so and so's set up on the corner\nor their weigh-in trucks.\nI don't think that lens is conducive to this environment,\nbut I mean, that's just my opinion, particularly if they're\nnot asking to do it.\nNow, the fine structure, I want to assure\nthat we get the bad actors.\nI like the bridge fine and the weight fine.\nLet's just pick, can we pick two out of three?\nMaybe go do away with the axle fine\nand go whichever one's the, you know,\nwhichever one's gonna be the most severe.\nI'll go with that, but the structure,\nand I'm just reading it, I'm a little bit confused\nand the chairman probably be able to clear it up for me.\nCan we have, can we just have two fines?\nAnd I definitely wanna get the bad actors.\nIf they're hauling above the weight, let's get them.\nYou know, I've heard conversations about, you know, some sort of technology you can put\non bridges that weighs them when they cross, and if they're heavy, fight them.\nI think everybody in this room will say that you got bad actors.\nWe need to address the bad actors, but the whole industry shouldn't suffer for these\nbad actors. Okay, go ahead. Representative Makes.\nThank you, Mr. Chairman. And to the local law enforcement, Mr. Leader, I think we have\nto reflect on where these roads and bridges are. And as we've heard from testimony that\noverweight trucks may seem to turn over, if in the area where I live, if a log truck is\nstop to be weighed there's nowhere for that log truck to pull over except for on the shoulder\nof the road and when that happens it is my sense that if we've had a rainy season and\nit is slick we're going to have a truck out there rolling that truck back over and\npicking the the the wood up simply because there's nowhere for that truck to stop except\non the road to have the scales pulled out\nif that's what the local law enforcement\nor local law jurisdiction is doing in order to do that\nand do it safely.\nI may be coming from the opposite direction\nwith a tractor that takes up the whole road\nand that makes us have a whole nother predicament\nof trying to get around with nowhere for them\nto stop safely to be weighed.\nAnd from the ones that I have seen on, they're usually on a four-lane road, they're usually\npulling to a turning lane, particularly on a highway 84, they'll pull into a turning\nlane that's in the middle, or either, it's where they always are when I see them anyway.\nI very rarely see them on a two-lane road unless there's a designated spot where they\nhave, they can't get off the road.\nYeah, can I say something real quick?\nWell, I understand, but I want to be fair to everybody.\nI just, for everybody in the audience, I want to,\nI just want to make you understand what it means\nto everyday Georgians who are out there trying to make\n11, because I've reached out to people in my district\nLager's farmers.\nAnd so we're appearing, you know, we're trying\nto implement public policy.\nBut for a, for a small family login business,\nthat's going to move about 60 loads a week.\nThey're going to turn about $1.7 million in gross revenue.\nThat's gross revenue.\nThat's total money coming into that business.\nThe difference on an average 50 mile haul\nfor that small family business\nbetween 84 and 88,000 pounds\nis $154,000 a year on a business that doesn't turn\nbut $1.7 million in gross revenue.\nAnd keep in mind that every state that touches us\nin terms of Agon Forestry, Florida, Alabama, Tennessee,\nNorth Carolina, South Carolina,\nThere are either 4 to 6,000 pounds more than we are.\nSo when you look at in terms of competitiveness and cost\nand everything else, that is a policy that we have\nat 84,000 pounds is a true cost.\nAnd $154,000 in a small business is a difference\nbetween being able to pay your fuel bill\nand make your payments to caterpillar financial\nand everything else.\nI just wanted to, that's for the total business, $154,000\nyear on what would you have about you probably have three four trucks on that\nmaybe five yeah is that about right that's a hundred and fifty four thousand\ndollars on a total gross of one one point seven million dollars that is a real\nnumber chairman dollars all would you did you have since you wanted to add you\nwanted to ask her speaker absorb the conversation a little bit here but\nI think if, respectfully, if somehow the forestry and ag industries are such that business\ninputs are not paid by the consumer, I would like to know why my grocery prices cost\nwhat they are.\nWhy timber prices have risen the way that they've risen?\nI would actually argue that we've seen enough data over the last three years to say the business\ninput costs 100 percent are passed on to the consumer and then some. I know a lot of people\nwho are in these industries and none of them are starving. In fact, they've had some of the\nbest years they've ever had. Primarily because the cost of to the consumer have increased\nso much. So I think that perhaps if you look at it from the minutiae, you may\nI might optically think that I'm not seeing a change in my bottom line, but somewhere\nthat's getting passed on to the consumers.\nI don't know where that is, but I think that we can all agree that we've seen cost get\npassed on to the consumer.\nI want to dive into the MCD thing, though, because leader Gouge made a comment that last\nweekend there was one enforcement agent on for the entire state of Georgia.\nIf that is true, and I've no reason to believe that's not true, I think we can all agree\nthat's absolutely ridiculous.\nSo, and to the whip's point, if the locals don't want to do the enforcement, they don't\nhave to do the enforcement.\nThere's nothing in this bill that is making them do enforcement.\nSo if our pushback on enforcement is, well, they don't want to do it.\nWell, nobody's making them do it.\nBut for those people who do recognize that there's a problem, I don't know the two lane\nversus four lane thing.\nWhen I come back to the way my brain works is I think about the inverse of every argument.\nAnd so if the two-lane enforcement is a problem for locals, it's a problem for MCD.\nIf it's only happening on a four-lane road, that means that we're running, you know, who\nknows what's happening on the two-lane roads.\nI think the thing that concerns me on the enforcement and fine piece, and whether it's what we\nheard under testimony from the Forestry Division, don't make us submit our weights when people\ncome into our facilities or whether it's this,\nif don't let local law enforcement enforce it,\nit seems if I peel back a layer of that,\nwhat I'm really hearing is we're running our trucks\noverweight, and we just don't want anybody to know it.\nAnd I can understand the Barney 5 argument\nif we don't want a bunch of Barney 5s running around\nand pulling truckers over at harassed them.\nI don't think that that's what they just want.\nBut I think the thing that concerns me,\nas I've listened to this conversation\nover the last 90 days, it kind of seems like what's inferred\nis, yeah, we want to tell you that we're complying with the law, but don't make a sure\nyou that we are.\nAnd I think that that's a problem.\nAs it relates to the family farmer and the 1.6 million, and we've got a lot of 1.6 million\ndollar small businesses in this state, a lot of them.\nAnd I think that all of us, my business partners here today, and he's out here probably\nwondering what in the world I'm doing down here, talking about truck ways.\nBut they all have to live by a set of guidelines that does not force everybody else to subsidize\ntheir business, hopefully, right?\nSo and I've said this before, on the degradation of the road thing of the asset piece, this\nis my primary concern, the commission would marry testified that it takes a 20-year road\ndown to 12, the Georgia Tech gentleman I think said it takes a 20-year road down to 18\nyears.\nSo there's some discrepancy.\nBut what everybody will tell you is this does increase the rate at which I'll rose to\ndeteriorate.\nSo I'm concerned about us coming here and saying, well, we're just going to do one more\nthing where we make everybody else pay and we have a firm might ask you, why are we just\ndoing two industries?\nWell, I can't all these trucks run this way and I don't have a great answer to that question\nto be perfectly honest with you.\nBut this is an unfunded mandate to the local governments, whether it's 10% or 40%, whether\nit's the 18 years of the 12 years.\nThis is an unfunded mandate.\nAnd I said this from the well, I said this in committee.\nWe have underfunded infrastructure in the state for far too long.\nWe have had surpluses in this state and have not dropped the dime of them that I can tell\ninto infrastructure.\nWe see our surrounding states that yes, they allow more vapes, spend a heck of a lot more\nmoney on infrastructure.\nBillions of dollars more in the state of Florida went into infrastructure this year than what we put in\nWhat I called the commissioner. I hope he doesn't mind me saying this\nI said commissioner. I said how much is this gonna cost you? He said 500 million bucks a year not counting the bridges\nAs I word or the bridge is gonna cost. He said I don't know 10 billion\nSo okay, let's talk about the 500 million if we could find you 500 million\nHow much does your heartburn go away?\nAny paul is to give it some thought and he said it significantly goes away\nAnd what I appreciated about that is he was being open to the reality of recognizing that\nwe want to move freight and people and products through this state.\nBut it seemed like an intellectually honest approach to where my take away from that was\nthis is largely a funding issue for the commissioner and we've done nothing to address the funding.\nAnd quite frankly we don't know if we're going to be able to get a bill passed here that\nwill address the funding because I know that some of the things that have been\ntalked about will not pass this chamber. Maybe even either side of the chamber.\nIf we try to do what Colorado does, I don't think that gets done, right, on the\nper package fee. So I think, and I wanted to clarify, I think the 95,000\npounds happened with a permit over the last three years. It was not every\nstrike. It was not every forestry trucks. I think that's important to note.\nI don't know what percentage of them got permitted. The last thing I'll tell you\nguys is I whipped my committee a week and a half before the vote on y'all's bill and\nit you had about three yes votes.\nSo that's what I went to leader Gooch and we got together and had conversations on this\nand I found what I thought was a pacifier of sorts that allows the industry to at least\ncontinue to do some things that they want to do, doesn't do everything that they want\nto do.\nthat if we take some of the things out of here that were sales pitches from me, from the well,\nI think the number can change, I think, faster than any of us realize.\nSo I want to make sure that I'm open to some of these things that we've discussed.\nI think let's have those conversations, but I also, you know, we've got five and a half hours to get a bill.\nSo I want to caution us that we find the right things.\nSo, if I can, can we talk about the radius thing, and I'll just step back, because 75 was\nin our bill.\nYou mentioned 150 whip, but then I think you said most stuff comes in under 100 anyway.\nSo can you just help us understand why 75 doesn't work if 150 is the, what's the, help\nus understand your thinking?\nCurrently, as my understanding, you can drive a commercial truck without a CDL license\nfrom the farm 150 miles.\nAnd so I'm just looking for some parity in the law there.\nWe could probably jump back to 120, or maybe it's, I think it would just be cleaner if\nit was 150.\nI mean, I'm just throwing that out there, Mr. Chairman.\nMr. Chairman, for the clarification of that.\nSo a producer that owns their own vehicle,\ntheir own commercial size vehicle, a semi,\nthat is not for hire, they're hauling their own products,\nmay haul their farm products 150 mile radius from the farm.\nThat coincides with the Federal FMAT program\nthat allows you without a CDO license for scale CDO license,\nyou have to have a class E, I believe it is,\nbut it keeps that consistent across the southeast.\nWhat's current law?\n150 miles.\nFor the 5% allowance?\nYes.\nWell, I got one question on the road degradation thing.\nWhy do y'all think the federal law is 80,000?\nAnd can we agree that we think those roads are better made than most county roads?\nAbsolutely.\nSo, help me bridge the gap there in my mind.\nThe bridge the gap, why it's 80 and why it's not 80 elsewhere?\nIf those roads are yes, obviously the feds have an interest in commerce just as much as we do.\nTheir tax rates are higher, so they want to see more commerce because they tax it more than we do.\nSo why are they built better than ours?\nNo, not why they built better, but if they're built better\nthan they're at 80, how are you guys comfortable\nas it relates to the road degradation?\nOh, OK, I get it.\nSo in committee, the conversation we had\nabout degradation of roads is not wait.\nIt's volume.\nHow many times you drive over this thing?\nSo I would say that the construction of those roads\nare at the spec they are because I say 75\nhalls more than Highway 82, stay Highway 82 or stay Highway 1. There's just a lot more\npeople using 75, 95, 10. Then there are using these, you know, these, I guess, the Ancillary\nRoads, 82, 1 County Roads. I think that's probably why they're built to the\nsuspect that they are. And to the wait portion, there's more trucks, more trucks\nperiod. Most of the trucks coming out of Savannah are getting on one of those, 95, getting\non 75. Anything coming through the state from Alabama, Florida, South Carolina, all of\nthose the rows they're traveling. So I think it's volume is why they construct that, constructs\nrows like they do, but it's clear that they do allow for more than 80,000, but it's just\npermit on a permit basis and so the question that I had was and didn't come up\ntill afterwards there was testimony that said 6,000 some trucks got that\npermit for a hundred thousand but I don't know if that includes interest state\ntravel so if somebody leaves New York City and they're running down 95 do they\ngot to get a permit to drive through on I-75 or I-95 I don't know the answer\nSo those containers are coming out of the port, they have a seal on them.\nThey're not allowed to be opened until they get to their final destination.\nThey're indivisible loads.\nIt's not going from one warehouse to the other through Henry County.\nSo we talked about every truck has to stop somewhere, yes.\nBut some of those trucks stop multiple times throughout the state.\nThese containers coming out of the port have a clip on the back, they're locked.\nnot to be reopened again until they get to their final point or they'll be shipped.\nThey'll be taken off of that trailer and then bust them up and then out to distribution\ncenters or where they're going.\nSo those are 100,000 pounds and there are less than 1% of those on the road at any time.\nWe have that data to show that.\nSo those interstates are built.\nI showed a core sample in the chamber.\nYou have about an 18-inch slab of concrete and asphalt and another 18 inches of base\nunder it compared to a county dirt road that has about two or three inches of\nasphalt compared to a state road so we can't asphalt in a state route maybe\nfour to five inches so we have to invest in our infrastructure what did we put\nin our budget today we just passed a budget tonight in the Senate we put\nzero dollars in there for bonds for bridges for the last seven years we've\nhad House Bill 170 in place we've added a hundred million dollars almost\nevery year. We didn't put one dime in the budget this year, guys. Not one dime.\nAnd so that shows the community that we're not really serious yet. We have to\nget serious about it. So you're point about the less than one percent of the\nhundred thousand pounds. The question I was, oh, so that's, I would, I think that\nis trucks originating out of Savannah. Yeah. Primarily. Or bronze. Or bronze.\nOr bronze. Wherever. That's correct. My question is, if you get, if you go into the\nport of New York and you travel in Florida with that seal container. I don't\nknow if that happens. Does that, does those trucks have to get a permit from\nGeorgia to run down 75 or they get that seal container? I think it falls\nunder the RP program, which is the international road program that allows\nthem to follow that regulation through Georgia, but I don't want to be quoted\non that tonight. So perceivably possibly possibly we have more than 6,000 trucks\nthat are running through Georgia.\nI think that one percent is based on data\nthat the DOT has accumulated.\nAnd I would assume that statewide,\nregardless of where there's coming from Georgia\nor the Florida ports, or going to South Carolina or wherever.\nWell, okay, all right.\nWell, I'll submit to that.\nI think that those are those probably we originate in Georgia,\nbut there could be some loads coming from South Carolina\nor Florida or whatever.\nBut does that answer your question that I was talking about?\nI think it's volume.\nIt's based on volume.\nAnd I recognize the problem is the weight on the axle\nwhere the wheel touches the ground.\nI don't think it's as much the number of trucks at a day\nas much as is the direct weight.\nI'm not an engineer, but we've had several discussions\nwith the engineers at our experts at the DOT.\nAnd so we're asking how much more can a road take?\nIt's 80,000 pounds, too much, too less.\ndon't know, 100,000, where does it stop?\nAnd so we have to rely on the experts\nto help us with that information.\nIf we ignore the DOT commissioner and his staff,\nthen why do we even have them?\nAnd so we have to listen to them,\nand they're asking for help.\nThey're not saying we're not ever gonna do this.\nI'm for including every industry\nat some point in increased weights.\nI'm not saying no tonight to Ag in Timber.\nI'm saying let's find a way to increase it\nfor every industry in our state to make our state better,\neconomically and better competitive.\nWe need to talk about tort reform, too, Mr. Webb.\nMaybe that won't happen tonight,\nbut that discussion needs to continue.\nIf we're going to stay on top of it,\nwe're going to help the trucking industry.\nListen to what they're asking for.\nI have a letter in here.\nThey're asking for that as well.\nInsurance rates are one of the highest in the country\nhere in Georgia.\nSo I'm fine to focus on these three issues tonight,\nbut the discussion has to continue after session.\nI'm fine with also sticking to funding mechanism.\nI know that the Chairman Hatchett\nand Speaker Burns have both committed to funding.\nAnd I think everybody in this room\nunderstands there's a funding mechanism.\nI don't think anybody has opposed that.\nI think what we said is that the industry's growing,\nand every industry like you said pointed out is growing,\nwe need to grow with them.\nAnd if that means we need to invest a billion more dollars,\nthen we need to invest a billion more dollars.\nAnd I'm for having a conversation\nabout how we find that billion dollars.\nBut I would like to move a measure here forward.\nAnd so the devil's in the details,\nI'd like to consider these few revisions.\nIf you guys are willing to move on some of these revisions,\nI don't know how we do this.\nI think we had a full-turted debate here.\nDo we go get a amendment drafted?\nand then see if we can strike a language and I'd like to make a recommendation to the\nchairman. I'd like for y'all to give us your your final ask and then let the Senate committee\ngo and have a little time to talk and come back. Set a time to come back. It's 6.45 now.\nWe can come back at 7.30 or whatever time you wish and we can come back with the proposal.\nBut we'd like I'd like to hear what's your final ask is your final and best offer.\nMr. William, if I can make a suggestion,\nI know they've got some very important business\nto attend to in the house.\nSo I would suggest that I would suggest\nthat we reconvene this meeting\nafter that very important measure.\nAnd I'll be well fed and probably a really good mood\nand ready to have a good robust conversation.\nI'm with you on that.\nMr. Chairman, does that mean that you're gonna be\neven more open-minded after you eat?\nYou could be more robust.\nOkay.\nthe answer is it depends, but I know the RIP is going to do this job over there and I\nwill be very grateful for it.\nWell, I'm working as hard as I can over there.\nDo you want us to submit you language or what?\nJust tell us.\nOn these three issues, the 150 mile radius starts at 75, local law enforcement, and I guess\nit defines.\nI mean, a little while ago, I thought you said you were okay with the robust science.\nWell, I'm not clear as how the fine structure works.\nI like the bridge portion and the overweight portion,\nbut there's an axle.\nIs there an axle fine in here somewhere?\nIt is, but it's equated to the dump trucks\nto where you've got tandem axle dump trucks.\nAnd so that weight is the equivalence\nof the weight of the others.\nInstead of gross weight, it's done by axle\nbecause of the spread of the weight\nalong the surface of the road.\nSo it's not in addition, it's not second.\nIt's just, they had to weigh the dump trucks by the axle\nand not by the way they were the 18-wheelers.\nSo it's an ore, not an ant.\nAnd a load on any kind of axle without a lift axle.\nSo this wouldn't apply to a tractor?\nI think the motor carrier division\nwould be the experts in the room to answer that question.\nIf we have anyone here, I would love to hear their response\nto that, or G-dots.\nLet me get some clarity on that.\nBut what I would say is that if, you know, and this is just my opinion, and I'll defer to the chairman of the committee from once the bill came and obviously the author, my opinion is that we go with the,\nwe go with this section one here, start on 34, and then you have a bridge proportion here.\nWhere's the bridge portion? Is it two on this on the next page?\nIs it two 58 line 58?\nIs that a bridge?\nOf course you have a bridge.\nWe can talk about this later.\nThat's one of the bridge.\nThat's it.\nSo my ask would be the 150 miles, the bridges on line 58, 369.\nMy ask would be the 150 miles.\nIt would be the going away with or extending the sunset date, maybe three years.\nfive years I'll take whatever you'll give us and this can we go with one and two\nversions one and two here without section are you on well excuse me I'm on\nsection one you know mine is 34 so that's from going from 88,000 to 93,000\npounds, the fine would be 5 cents per pound. If you weigh in excessively, over 93,000 up\nto 100,000, then the fine gets increased to 10 cents per pound. And then of course, if\nyou go over 100,000, anything over 100,000 pounds, you would be fine 20 cents per pound.\nNow, that goes back to the 80,000 pound base.\nThat's not included in the variance. That's right. No variance. So when our bill section\none with the five sand, that included the variance, but the others did not.\nBut I would argue that if you get pulled over in downtown DeLonica and you're breaking\nthe speed limit, local law enforcement won't write you a ticket for the first 10 miles\nper hour over.\nThere's a state law that prohibits that.\nYou understand that?\nBut if you go 11 miles per hour over the speed limit, the speeding ticket's going to\nbe for 11 miles per hour over the speed limit.\nIt's not for one mile per hour over the variance.\nSo this is written in the same manner.\nSo if you got a truck that weighs 110,000 pounds, do you want them to pay a fine or not?\nYeah, I think we do.\nI do.\nI just want to go back to work.\nCan't we just find them under line 40, though?\nEquator of greater 100,000 pounds would be 20 pounds per excess weight.\nIt's 20 cents per pound.\nThat's what this bill does.\nWell, I like that.\nCan we just strike the B and C out of there and not have them find it all for another first\ntwo?\nWell, isn't the fine 20 cents per pound for excess weight over a liable weight limitation?\nSo instead of going back to 80, you would say go back to what, just for the excess over\n100?\nYou know, he's saying a strike line is 42 through 55.\nYou should get rid of the axle.\nYou should get rid of the axle.\nThat doesn't give me heartburn unless there's a significant reason why that's in there.\nThat's not language that we particularly...\nI mean, if we can find them under this first section and then we can find them and that's\nwith their hull on the road and if you can find them under two I think you're\nthinking that these are stacked fines and they're not so this is a different\nway of the MCCD measuring the weights of the truck okay well if you pull up on\na scale on a regular scale at a mill it's going to weigh the entire truck if you\npull up on scales out on the road they're going to do it by the axle that's\nhow they compute it and so I think that's why that language is in there but we\nneed to verify that before we get it.\nYeah, I would ask, I'm open to the idea one way or the other, I would, this just seems\nmore simplistic to me in the last 30, 40, 41.\nIt's a lot simpler, but you would have to have the total weight of the truck.\nIf you're pulling them over on the side of the road, you're not going to have that capability\nbecause they have to weigh each actual weight.\nAnd so that's why that language is in the car.\nOkay, I see.\n43 through 55.\nAnd then I want to make sure that this bill, the new bill,\nit's not repealing the $84,000 for all the other industries\nthat are hauling currently.\nThat's correct.\nAll right.\nAnd then the sunset would apply to the fines and to the underlying.\nThe sunset, the way we drafted this bill only applies\nto the excess 5% variance.\nThis, the local enforcement and the extra fines were\nforever in this bill until somebody with more wisdom than us\nchanges in the future.\nNothing forever.\nNothing is forever.\nWell, can we, if we're going to take this thing all together,\ncan we just make sure if we're going to sunset this increase\nthat we sunset the fines and go back to the regular\nfine, fineing mechanism?\nI mean, it seems like we're taking on the good and\nSunset and the good but we won't keep the bad with the we're punishing the people that are\nBreaking the law. Well, I'm actually catch that we actually do catch with that one inspector in the whole state and to the\nFor a weekend chairman, but all of those all point. I'm all for getting some more MCC folks out there. I mean me too\nIs it possible to eliminate the sunset forever?\nShould take it completely out of the bill now. He's he was saying\nthree years. I understand what maybe five now you're saying I think that would\nkill your business. Yeah listen we as I said the thing is we can extend this to\nevery industry if we can get to a point next year to where we have a\nfreight logistics plan that has some funding in it Chairman Jasper here I've\ntalked about this for many many months now we have to have everybody in the\nroom working with us saying this is important maybe for these industries so\nSo, if we make this permanent just for these two industries and no one else, what does\nthat say into the rest of the businesses in our state?\nI think it's wrong to carve it out just for two industries.\nIf we're going to make it permanent, let's make it permanent for everyone, but we can't\ndo that until we solve the funding issue.\nCome on, Pindy.\nYou agree with that, Chairman Jasper?\nI'm sorry, what number are you, Chairman?\nFive.\nYou were in deep thought.\nYou were figuring this out.\nI'm listening.\nI'm listening.\nI've looked at that I've noticed Germany is on line 17.\nWe're talking about the attainment area.\nThat attainment area needs to be defined at Bill signing.\nSo it's, it is, it is defined.\nWell, I mean, just that we need to locate it.\nIt's defined by, it's defined by state law and by EPD\nbased on the nine attainment areas of the state.\nWell, that, well, that will move over time.\nWe're under, we're under the limits now,\nsince time.\nSo you want to make it larger or smaller?\nWell, we're going to do that, we're going to include the attainment area.\nLet's lock it in on what it is today.\nThere's issues with, as you know, with population bills, they're unconstitutional.\nSo this was the language that we worked with, Jim, at Ledge Council,\nthat we came up with, that we believe is defendable based on the emissions issues and the...\nCan I interject?\nWhich leader is it not true, though, that the federal government could change what...\nIt could change the PPPs or whatever else and it could be the intent of this body to have those 15 counties be\nYou know the and what's what we call I'll keep what we call the containment area, but not a tenement. Yes\nBut a federal regulation could change that from 15 counties to be in 40 counties overnight. Well, that's not the intent of this body\nWell, I suppose that's possible. I think it's so far outside the realm of probability because our emissions are actually lower\nthan the federal standard that caused them to put that\nin place altogether, so that whatever's been done\nin advancing automobile emissions has satisfied\nthe Feds requirements, so there'd be no justification\nfor them to expand it beyond where it is,\nbecause we're talking about that.\nThat's a good question.\nWe can go back there.\nWe can lower it.\nSenator, you could also come back in January\neven if you're feeling that part of the bill.\nThis is a one-year extension.\nWe're not talking about two years from now.\nWe're talking about three or five.\nWell, even if we went to 36 months, we got work to do.\nOh, absolutely.\nI agree.\nThis is a mix you have in you.\nI think we just need to put something together and get it to you and see where we go.\nMeanwhile, I'm going to do my job and see if we can get some measures moved.\nI would recommend it.\nI want to be on the record of saying that the outcome of the measure that we're going\nto be working on, I hope it doesn't change the negotiations\nthat's in this table.\nI'd like to go back to Chairman Dolezal's recommendation.\nWe meet after this bill of interest passes.\nWe have a little time for supper.\nWe can come back, the three of us will talk,\nand the three of you guys will make a counter offer to you.\nAnd if we agree, we can go and draft the legislation\nand get it ready.\nAnd then what do we have to do at that age?\nWe have to put it on the table.\nIt has to be on the, it has to be on the desk for two hours in the Senate.\nI'm not sure what the rules are, but in the Senate it's a two-hour rule.\nSo we need to get moving on that within an hour when it's starting to wrap.\nIt doesn't look like there's a lot to change, so I think the structure of the bill can basically\nstay in place, move some numbers around, and some of the things we agree on at our next\nmeeting, and then we can get this done quickly.\nSo we're going to reconvene, but hopefully we have some language on our side, but we reconvene.\nSo let's run a timeline here so we can have it here at 8 o'clock.\n8 o'clock sounds good.\nBut we have to have it on the desk of the cent two hours before we have to have it on\nthe floor no later than 10 p.m.\nI would be nervous with 10, 8, 30, let's just do 8, 30.\nSure.\n9 o'clock it in the latest will be it.\nOkay.\nAll right.\nSounds like we got something to work towards.\nWe'll see you in eight.\nYep.\nAll right.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:02:05.739553+00:00"
}