{
  "video_id": "qYUKlrPhN00",
  "url": "https://youtu.be/qYUKlrPhN00",
  "title": "Georgia House - Day 1 (2026-01-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": "2026-01-13",
  "duration_minutes": 52,
  "summary": "Here is a summary of the Georgia House session from 2026-01-13:\n\n**Overview:** This was the first day of the 2026 session of the Georgia General Assembly. The session began with a prayer and Pledge of Allegiance, followed by a special musical performance. The notable aspect was the introduction and first reading of HR 877.\n\n**Key Actions:**\n- **HR 877**: Urging Congress to pass legislation to strengthen election security and integrity.\n\n**Bills Introduced (First Reading):**\n- HR 877: Urging Congress to pass legislation to strengthen election security and integrity.\n\n**Notable Moments:**\n- Opening prayer delivered by Rep. Mac Jackson, who spoke about God's faithfulness and the importance of applying one's heart to wisdom. \n- Performance of the national anthem by singer Timothy Miller, a Georgia native.\n\n**Votes:** No recorded votes.\n\n**Attendance:** Quorum present, all members signed in.\n\n**Adjournment:** The session was adjourned. The next session date was not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nHaving arrived, all members will please report to the floor of the house and take seats.\nAll members will please take their seats.\nMr. Clerk, we'll ring the bell.\nAll members.\nWe are about to have the call of the roll for the first time this year.\nAll members present will please vote green to signify their presence in the chamber and\nand the clerk will unlock the machines.\nHerman Hogan, it's the green button.\nIf you're here, have all members voted?\nHave all members now voted?\nIf so, the clerk will lock the machines.\nkeepers will please close the doors and keep them closed.\nWell first of all happy New Year and welcome back to the\n2020 session of the Georgia General Assembly.\nI don't know about y'all but I'm excited to be here.\nHow about y'all?\nWe're going to begin today with our chaplain of the day, and I'll introduce him momentarily,\nbut at the end of the chaplain we're going to do things a little different.\nI'm going to ask you to please remain seated.\nYou can greet the chaplain afterwards, but we're going to have a little, as we like to\ndo on the opening day and day 40 have a little special treat. And we have a great one today.\nSo I want you to remain seated and stay at attention and stay at your desk. They gave\nme a long biography of our chaplain of the day. Early this morning, Mack, I'm not going\nuse it.\nMac Jackson, who is the representative from the 128th district, first of all is just one\nof the finest people that I have ever known.\nAnd we all go through challenges, I've been through a few, and it seems as though when\nI am going through one of those tough times that I hear a message from Mack and God speaks\nto me through him in a way that touches my heart and gives me encouragement, gives me\nstrength, and I can't tell Mac how much he means to me, and I know many of you feel the\nsame way. In addition to serving the 128th House District down in Middle Georgia, Mac\nalso pastors a church and has since 1993. They obviously don't believe in term limits.\nAnd it's probably a very good thing they don't, but they wouldn't have Mac Jackson.\nBut you're going to be blessed today.\nYou're in for a real treat.\nIt is an honor, a real honor for me to introduce our chaplain of the day, Representative\nMac Jackson.\nThank you, Mr. Speaker.\nI got more than happy new year to everyone.\nMr. Speaker, I just want to thank you for the privilege\nand the honor to do this devotion for the opening session\nof the year 2020 of the Georgia House of Representatives.\nI've had some great things that happened to me in 2019.\nIt was a great year for me and my family,\neven through the death of my wife's brother\nand the death of her father just three weeks ago.\nBut despite all that, we've still been blessed by the Lord.\nWe've been through a lot,\nbut we still got joy and faith in the Lord Jesus Christ.\nBecause of his grace and his mercy.\nAnd I just wanna tell you that I was overwhelmed\non one Sunday morning,\nas I was getting ready for service that morning.\nAnd I saw State Trooper cars driving up in the yard of the church.\nAnd I went into the church, and in the foyer,\nSpeaker of the House, David Ralston was standing there\nat our church for that church service.\nAnd that was the most overwhelming moment that I've had in a long time.\nSo I'm going to speak, I just want to publicly say thank you\nfor being so kind and gracious to come to our church service\non that Sunday morning.\nI got a lot of calls afterwards, people in the community\neven knew that you came to church that Sunday morning.\nSo thank you.\nYou can't find a better friend and speak a David Ralston.\nHe's proving himself over the years to be a true friend.\nBut this morning, because he's asked me to give the devotion,\nI want to bring your attention to the book of Lamentations\nin chapter three, verses 21 through 23.\nAnd it says this, this I recall to my mind.\nTherefore have I hold.\nIt is of the Lord's mercies that we are not consumed\nbecause his compassion's failed not.\nThey are new every morning.\nGreat is his faithfulness.\nAnd it's because of the mercies of God\nthat you and I are still here in 2020.\nNothing that we've done or accomplished\nis all because of the grace of God.\nAnd I like what the prophets said in verse 23.\nThey are new every morning,\nmorning by morning, new mercies I see.\nGreat is thy faithfulness.\nAnd because of his faithfulness,\nI've found a new love for God.\nThrough all my trials and tribulations,\nI've developed a home gonna thirst for righteousness\nin this new love for God.\nAnd in the book of Micah, chapter six, verse eight,\nit says, he has shown the old man what is good.\nAnd what does the Lord require of thee?\nBut to do justly, to love mercy,\nand to walk humbly with your God?\nNow think about it, that's all that God requires of us.\nHe requires us to do justly.\nHe requires us to love mercy,\nand to walk humbly with our God.\nAnd I don't know about you,\nbut I've decided to build a closer relationship\nwith God in this new year.\nAnd I believe that's what the psalmist had discovered\nwhen he wrote these words in Psalm 9.\nHe was talking about the brevity of life,\nhow brief life is.\nAnd he wrote in verse 12,\nso teach us to number our days\nthat we may apply our hearts unto wisdom.\nMy grand daddy used to say,\nnobody knows the day nor the hour.\nAnd they used to sing a song that said,\nthis may be the last time,\nMaybe the last time, I don't know.\nSo I wanna be able to number my days\nand I wanna apply my heart to wisdom in the year 2020\nbecause every day is valuable\nand I don't wanna waste a minute or a second\nin this new year with a heart and heart.\nAnd that's my prayer for this year.\nLord, teach me to number my days.\nShall we pray?\nHeavenly Father, God of all truth, God of all mercies, as we come before you in this new\nyear of 2020, we ask you by your spirit to visit hungry hearts.\nWe ask you to mend the broken hearts in this place.\nWe ask for your wisdom and your guiding us as we come together to solve the issues of\nthis great state.\nthere be no division in the hearts of these brave men and women who have given so\nuncephishly of their time and talents to serve the people of Georgia. We ask\nyour blessings upon the governor, the speaker of the house, the lieutenant\ngovernor, the men and women who make up the Georgia General Assembly, bless\nour soldiers wherever they are today Lord, protect them from all hurt, harm\nand danger. And this we ask all in the majestic name of Jesus, that name that is\nabove all names, amen. The pledge of allegiance. I pledge allegiance to the flag of the United States\nof America and to the Republic for which it stands. One nation under God, indivisible,\nwith liberty and justice for all. Thank you for speaking. God bless you. Thank you, sir.\nYou can stay up here if you'd like house will continue to be at order house will\ncontinue to be at order I told you that we had a real treat for you this morning\nand we do. We have a tenor. Somebody that sings in tenor. Okay, don't look at me. Blank\nlooks like that. Timothy Miller is a native of Augusta, Georgia, and has performed nationally\nand internationally in opera. And Timothy, I'm not going to try to tell them all the operas\nyou've been in because I can't pronounce them, but he had been in some of the greatest\noperas in the world.\nHe's probably more known for his performances here in the state.\nHe gives a stirring rendition during the seventh inning stretch at Atlanta Breaves Home Games\nof God Bless America.\nHe's saying and performed at Governor Nathan Dill's, I think both of his inaugurals and\nhe is honored us by being here today.\nHe is a Georgia, a son of Georgia, lives here in the metro area.\nHe's an assistant professor of voice and music at Morehouse College.\nan honor for me to introduce to you now Timothy Miller.\nOh, say can you see by the dawn's early light,\nWhat so proudly we hailed at the twilight's last gleaming.\nWhose broad stripes and bright stars through the perilous fight\nO'er the ramparts we watched were so gallantly streaming.\nAnd the rocket's red glare, the bombs bursting in air,\ngave proof through the night that her flag was still there.\nO say does that star-spangled banner yet wave\nO the land of the free and the home of the brave.\nWhere the storm clouds gather, far across the sea, let us swear allegiance to a land that's free.\nLet us all be grateful for a land so fair as we raise our voices in a solemn prayer.\nGod bless America, land that I love, stand beside her, and guide her,\nThrough the night with light from above, from the mountains, to the prairies, to the oceans,\nWhite with a foam, God bless America, my home, sweet home, God bless America,\nMy home, sweet home.\nI don't know about y'all, but if that won't make you feel better, I don't know what will.\nBut this time the chair wants to recognize two new members that have joined us since\nlast session.\nThe gentleman from the 71st District Representative Philip Singleton.\nAnd from the 152nd District, the gentleman from Sylvester, Representative Bill Yerda\nAnd now, a moment that I've been waiting for for three or four months.\nWe all feel the tension building.\nChair recognizes for the report of the Committee on Information and Audits the Chair of that\nCommittee, the gentleman from the 107th and 9th District representing the coast of Georgia,\nChairman Don Hogan.\nThank you, Mr. Speaker.\nMr. Chairman, before you get started on your report,\nyou've had three or four months to get ready for today, right?\nYes, sir.\nOK.\nNo pressure.\nLook, just look who you surrounded me with.\nMr. Speaker, your committee on information\nand all that has read the journal of the previous legislative\nday and found it to be correct. And what a great start of this session.\nChairman Hogan, the chair of the Committee on Information and Audits, reports that the\njournal of the previous legislative day has been read and found to be correct.\nI'm hesitant to ask, but is there any objection to the confirmation of the journal?\nChair, here's none, and the journal is confirmed.\nThe clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, on the 59th, who's following me, establishes the order of business\nin her first part of the period unanimous consent.\nIntroduction bills and resolutions.\nFirst reading and reference of piles, bills and resolutions.\nreading of bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day. The chair here's none in the resolution is adopted. First reading of House\nbills and resolutions the clerk will read House Bill 725 by Representative Taylor 173rd\nHawker's at the 27th Gaines 117th, Mithiac the 73rd, Green 151st and others, Bill B.\nTodd, an act of men article 7, Chapter 4, Title 49 in Fish Code, George Amitender relating\nthe medical assistance generally, health and human services.\nHouse Bill 726 by Representative Taylor, the 173rd,\nHitchinson, 161st Jasper, the 11th,\nLumpsum of the 12th, green to the 151st,\nand others, Bill B.\nTitle and Act to a man chapter one.\nTitle 35, the Fisher go to George Amtator,\nrelating the gentle provisions regarding\nlaw enforcement officers.\nPublic safety and homeland security.\nHouse Bill 727 by Representative Anola Wittes\nof the 42nd, Stevens of the 164th, Beverly,\nthe 143rd with Linsky, the 79th,\nand Holcomb of the 81st, and others,\nBill B. Title and Act to a man chapter 10\nTitle 43, the fiscal to Georgia, and it's ended relating to Barbars and\nCosmetologists.\nRegulated industries, House of the 728 by\nRivers and Martin of the 49, Charles of the 47, the Silcox, the 52nd,\nBuilding Title Act to provide for a new homestead exemption from Fulton County\nschool district ad ballorum taxes.\nIntergovernmental, Intergovernmental\nCoordination, House of the 729 by Rosar Bayes,\nmore than 63rd Bruce, the 61st, Jackson, the 64th, Beverly, the 143rd,\nand Hugley of the 136th.\nThey'll be tunneling act to amend coach section 15,\n6, 77, the physical to Georgia,\nannotated a relay to the fees\nand construction of other fee provisions\nregarding superior courts.\nJudiciary, as an instrumented Mr. Clark,\ndoorkeepers will unlock the doors.\nOkay, go home to House Bill 730.\nHouse Bill 730, Governor,\nso if Steven's 164th, they'll be\ndollar and act to amend Code Section 48, 8, 3, the fiscal Georgia and TATA relating\nexemptions from sales and news taxes.\nWays and Mains.\nHouse Bill 731, Barbarossa, Stevens, the 164th Building Tata and Act to amend Code Section\n48, 11, 2, the fiscal Georgia and TATA relating the excise tax on tobacco products.\nWays and Mains.\nHouse Bill 735, Barbarossa, and a black man of the 146, fiery at the 135th, Clark and\nthe 147th, Williams on the 68th, Belton on the 12th, and others.\nIntercontinental NAC2 Men article 2 at Chapter 7,\ntop of 48 in the fish go to Georgia and it's ended\nrelated to the imposition rate and computation\nof income taxes.\nWays and means.\nHouse Bill 736 by Rose in a belt in 112th Glant\nin the 75th Taylor in 173rd.\nGreen in the 150 first and Stonewall in the 74th.\nBill B. Todd in the active men article 7,\nchapter 3, a total 20 in the fish go to Georgia\nand it ended relating to scholarships, loans and grants.\nHigher education.\nHouse Bill 737 by Representative Gamble\nof the 15th scogers, the 14th, Kelly the 16th,\nthe building title to act to them and act providing\nfor the Board of Education of Bartow County.\nIntergovernmental coordination.\nHouse of the 738 by Rosanna, Mark of the 49th,\nthe building title to amend chapter 5\nof the title of 33.\nThe fish go to Georgia,\nannotated relating to malt beverages.\nRegulated industry.\nHouse of the 739 by Rosanna, Jasper,\nthe 11th Jokers, the 13th.\nHawkins the 27th will be titled an act to a men article one of chapter 34 title 43 that there's go to Georgia annotated related to Georgia composite medical boy\nHealth and human services House for 740 by Rose and Steven's the 164th building title an act to amend chapter 7 to title 50\nThat there's go to Georgia annotated relating the department of economic development\nEconomic development and tourism House for 741 by Rose and built in the 112th Stove all the 70th\nfour-tanner the ninth, Taylor the hundred seventy-third and green in the hundred fifty-first,\nWilmington on the act to amend part three-a of Article two of chapter fourteen in total\ntwenty.\nThe fish go to Georgia annotated relating the turnaround schools.\nEducation.\nHouse Resolution 843 by Representative Blackman in the hundred forty-six clock in the\nhundred forty-seven, administration of the hundred-fourth, Williams, hundred sixty-eighth,\ntanker sleeve, the hundred sixty-eighth and others, a resolution urging the United States\nCongress to oppose the green new deal.\nEnergy, utilities, and telecommunications.\nHouse Resolution 844 by Resonant.\nVanolo, what's in the 42nd?\nWilliams, the 145th, Buckner, the 137th,\nGovernor of the 19th, and Gardner of the 57th.\nResolution urging the United States Congress\nto pass the Transit Worker and Pedestrian Protection Act.\nTransportation.\nThat completes first readers.\nThis house will be in order.\nHouse will come to order. The chair was advised early this morning that Minority Leader\nTrammell had some unexpected surgery last night, and I've texted with him this morning.\nHe seems to be in good spirits and doing well, but he's going to be out for a couple of\ndays, so I would ask you to keep Representative Trammell and his family in your prayers.\nHe and I don't agree on very much politically, but he's one fine man, and I'll defend his\nhonor any day of the week, and we all hope he gets better soon.\nsecond reading of House bills and resolutions the clerk will read House bill 715 by\nBill Rebson, a black one of the 146,\nPowell of the 171st, Harold of the 106,\na bill relating to general provisions regarding\na specific business, not-to-patient taxes,\nHouse Bill 716, by Rebson, a black one of the 146,\nSmith of the 134th, a bill relating to carrier,\nissuing health benefit plans to pay insurance,\nagents, commissions, and regulation authority,\nHouse Bill 717, by Rebson and Mathiac of the 73rd,\nBar of the 103rd, Bayes, more of the 63rd,\nBonner of the 72nd, Richard of the 97th and others,\na bill relating to health, House Bill 718,\nby Rebson, $1.45, a bill to provide a charter\nto the city of East Cobb.\nHouse Bill 719 by Representative Silcox\nto the 52nd, Cooper, the 43rd, Newton of the 123rd,\nDrenner of the 85th, and Henson of the 86th,\na bill relating to crimes and offenses.\nHouse Bill 720 by Representative Sains of the 180th,\nabstraction of the 104th, Fleming of the 121st,\nRichell of the 176th, Montana of the 17th and others,\na bill relating to procedure for sentencing\nand imposition of punishment.\nHouse Bill 721 by Representative Kirby of the 114th,\ndollar of the 45th, Williams of the 148th,\nand watching of the hundred and seventy second bill relating to retirement\npensions House bill seven twenty two by represent Cooper the forty third\nluncheon of the twelfth House to the hundred and seventy of the thirty\nfirst Howard of the hundred and twenty fourth bill relating to actions\nagainst certain applicants and licensees House bill seven twenty three by\nrepresent Williams of the hundred and forty fifth Gallaud of the nineteenth\ncouch of the fiftieth\nyou believe the hundred thirty six Bruce of the sixty first and others bill\nrelating to elections and primaries House bill seven twenty four by\nrepresent Wilson of the eighty of trampled the hundred thirty second bear\ncarefully of the 143rd, drier of the 59th,\nbody of the 62nd and others,\nbill related to conditional discharge\nfor possession of control substance as first defense,\nand certain nonviolent property crimes,\ndismissal of charges and restitution to victims,\nHouse Bill 732, by Representative Jones of the 25th,\nwelcher of the 110th carpentry of the 4th,\nultimate of the 81st,\ngravity of the 67th,\na bill relating to imposition rate,\ncomputation, exemptions from state income tax,\nHouse Bill 733, by Representative Sains of the 180th,\nper check of the 176th, Wilson of the 80th,\nof the 179th mix of the 178th and others,\nbill relating to the Georgia Judicial Retirement System,\nHouse Bill 734, by reps of Welch of the 110th,\nStevens of the 164th, Newton of the 123rd,\nBar of the 103rd, Jasper's of the 11th and others,\na bill relating to commerce and trade.\nHouse Resolution 791, by reps of Watson of the 172nd,\nRoads of the 120th, the Ricky of the 169th,\nRinders of the 150th, Laud of the 175th and others,\nResolution encouraging the Georgia High School Association\nto perform a thorough assessment of its operation and practices as resolution 811 by\nrepresenting the night of the 130th Roads of the 120th Resolution recognizing the unique\neconomic and natural resources of coastal Georgia and the need to carefully study and consider\nthe impacts of a commercial spaceport may have on such resources through second breeders.\nCouncil come to order, we're moving on to morning orders and I should clarify it's a morning order today. There will just be one.\nThe chair recognizes Speaker Ralston for a morning order.\nThank you very much Madam Speaker.\nOn November the 26th, this house lost one of its best.\nSo I thought it only fitting and appropriate that we pause on this first day of session\nto remember a very special colleague.\nJ. Powell loved this house.\nHe regarded it as a place where good sound policy was formulated, not a place to be burned\ndown.\nFor members who sincerely wanted to understand the legislative process, there was not a better\nmember of this body.\nAnd it didn't matter if you were Democrat or Republican, rural, urban or suburban, female\nor male, didn't matter the color of your skin or whether you have been here for a few\ndays or several years.\nJay was incredibly generous with his time and talent.\nYou know, we were truly blessed that he passed our way in that for a season we had the\nthe benefit of His brilliant mind, His wise counsel, His kind heart, and His humble spirit.\nJ. Powell had a strong and deep-seated conviction about right and wrong, and he could be a\nlittle stubborn.\nYou know, we live in an era, I never thought we would get to, where there are some coming\ninto the political process and they self-advertise themselves as being principled.\nAnd sometimes it helps that they do that, because otherwise you might not know.\nJay listened to and followed that inner voice of conscience and the political consequences\ncould be damned. He never had to tell you about his principles or his righteousness. You just knew.\nNothing made him happier than discussing and analyzing policy options to advance a particular\nobjective. And one of the objectives that was most important to him was the revitalization of\nof rural Georgia, because J. Powell was truly a son of Southwest Georgia. Wherever the\nroad led, it always came back to Quitman, Camilla, or Valdosta. As a founder of the House\nThe Role Development Council back in 2017, he brought an intense passion and unrivaled\nwork ethic to the goals of the RDC.\nAnd I want to tell you today that because of Jay Powell's leadership, Southwest Georgia,\nand particularly future generations of young people there will have greater opportunities\nin a better quality of life. This house will miss Jay Powell. His passing leaves us with\na void. He was a model of legislative leadership and that model is now gone. A public servant\nwho believed that civility was a virtue and not a sign of weakness. One who believed that\nThe power of ideas could be expressed\njust as effectively in a normal conversation\nas by loud or angry.\nI will miss J. Powell.\nI will miss seeing those reading glasses\npush back on his head.\nThat ever present cup of coffee.\nThe countless hours we spent discussing legislation and I'd love to go to one more Georgia football\ngame and watch him sleep through it.\nJay Powell had no problem in telling me no.\nHe did not hesitate to let me know when I was getting off the track or how I could do something\nbetter.\nAnd you know, he did that because he was my friend for as much as I hurt over his\nloss. I can't even wrap my brain around the pain and loss of Deedra and the\nfamily. And Deedra, we're honored that you're here this morning. But we will and\nAnd we are moving forward because he would not just want us to, he would expect us to.\nAnd we can take comfort knowing those of us who did not get to tell him goodbye that\nwe'll see him again.\nSo to the chairman, thank you my friend and I'll see you down the road.\nMadam Speaker, I yield the will.\nThe clerk will read a resolution.\nHouse Resolution 877 by President Burns 159th resolution to notify the Senate that the House\nof Representatives has convened and for other purposes.\nChair recognizes the gentleman from the 159th\nthe majority leader of the house, Mr. Burns.\nThank you, Madam Speaker, and Mr. Speaker, thank you for that\nremembrance of our dear friend.\nThis morning we have to make sure that the Senate\nand those were here and I heard they had a little technical difficulty over there this morning.\nUnlike house members who know how to roll up their sleeves and go to work as it was demonstrated\nwith representative Williams yesterday as our colleagues moved chairs around and got everything\nready for the Tillman Convocation. The staff was not in this morning and the senate didn't\ndid not know where the light switch was. So they were a little slow, they were a little slow getting\ngoing but um finally the staff came in and they were able to get started with\nthere so as as our duty is to um notify the Senate HR 877 does just that\nand mr. Speaker I would ask that we are favorably adopt house resolution 877\nnotified the Senate that we're here and we're ready to go to work mr. Speaker I\nyield the well you have no questions the majority leader has moved that this\nHouse Adopt House Resolution 877 Notifying the Senate that the House of Representatives\nhas convened.\nIs there any objection to the adoption of the resolution?\nThe chair here is none in the resolution is adopted.\nThe chair appoints as a committee of notification the following members, Representative Gaines\nof the 117th Representative Weed Hour of the 119th Representative Fry of the 118th Representative\nBershit of the 176th Representative Earhart of the 36th and Representative Prince of the\none hundred and twenty-seven.\nClerk will read House Resolution 878.\nHouse Resolution 878 by Robson to Burns in the hundred and fifty-ninth.\nA resolution calling a joint session of the House of Representatives in the Senate for\nthe purpose of hearing a message from the governor.\nInviting the Justice of the Supreme Court and the Judges of the Court of Appeals\nbe present at the joint session.\nChair recognizes the majority leader of the House to explain House Resolution 878.\nThank you, Mr. Speaker.\nAs is our tradition each year, we hear from the governor on the state of the state, and\nThat will be this Thursday at 11 a.m. January the 16th.\nMs. Speaker, I would ask for the favorable adoption\nof House Resolution 878.\nYou have no questions.\nThe majority leader has moved that House Resolution 878,\ncalling for a joint session of the General Assembly\nto receive the State of the State\nfrom his Excellency, the Governor of Georgia,\nbe adopted. Is there any objection? Is there objection that chair here's none in the resolution?\nIs adopted. House will be at order. House will come to order. We have one more resolution,\nBut before we get to that, I want to introduce to you the doctor of the day.\nIt would not be the first day of the session if Dr. Bobby Kaufman weren't our doctor of\nthe day.\nHe, I know he's a friend of many of you and he is a friend of mine, follows in some great\nfootsteps of his father who I think I actually established the doctor of the day program,\ndidn't he?\nDr. Kaufman is board certified in internal medicine. He earned his medical degree at Morehouse School of Medicine, and has practiced here in Atlanta since 1989 at the Kaufman Clinic, which has offices here and in Woodstock.\nHe's a lifelong resident of Atlanta,\nwhere he resides with his wife and 17-year-old twins.\nI can vouch that he enjoys golf\nand is very involved with the Alzheimer's Association.\nAnd for the last 18 years has served as chairman\nof the James A. Kaufman golf tournament,\nwhich has raised over two and a half million dollars\nfor the Alzheimer's Foundation.\nPlease give a great house welcome\nto Dr. Bobby Kaufman.\nApplause\nIt's quite an honor to be here.\nI think back over the years that I started as a six or eight-year-old following my dad\ndown to the Capitol and then served a day, then would come down as a page.\nyou're a kid, it was a great way to miss a day of school. But this is my 30th year of\ncoming down here, which is hard to believe. So many familiar faces and so many friends\nthat I have down here and I'm very grateful for that. My office is right around the corner\nand I'm always glad to help and I'm also easy to reach and it's quite an honor. But the\nThe doctor is important, but the single most important person for the medical aid station\nis our nurse, and that's Ms. Julia Mack over there, so make sure you all know her because\nshe's the one who's really important.\nAnd again, thank you, and hopefully I don't have to see any of you of y'all, but I'm always\nhappy to.\nThe House Resolution 879 by Representative Burns, 159th, a resolution relative to meetings\nand adjournments of the General Assembly.\nChair recognizes the majority later to explain the resolution.\nThank you, Mr. Speaker.\nThis is the one y'all want to know something about, I think.\nSo if you will, it's on the board.\nMr. Speaker, as they look at the, as if there's any questions on this first adjournment resolution,\nI do have a question for you.\nI was wondering if in the dictionary, when they explained the meaning of tenor, I'm wondering\nif there's not a name there of Timothy Miller.\nnot there should be. Absolutely should be. No doubt about that. As y'all see, you can\nlook through it. We're in four days this week. Certainly out for Mr. Chairman is\nthat correct. We're out for budget hearings on Tuesday, Wednesday and block on Tuesday,\nWednesday, Thursday morning and block grants Thursday afternoon. And then we come back\non the 27th, which of course is Monday, and we're in five days, then the first week\nof February, we're in those four days and this resolution carries us through Monday, February\nthe 10th, Legislative Day 14.\nThere are any questions I'll be glad to try to answer them, Mr. Speaker, but I think\nit's pretty self-explanatory.\nYou do not appear to have any questions.\nMs. Speaker, I would ask for the favorable consideration of House Resolution 879, and I will also say that\nwe work very closely with Leader Dugan in the Senate, and as we work on this resolution, we appreciate\nthis cooperation in that of the Senate.\nMs. Speaker, again, I would ask for the favorable consideration of House Resolution 879 and I yield\nthe well.\nbefore the body is only adoption of House Resolution 879, all those in favor of the adoption\nof the resolution will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the adoption of House Resolution 879.\nThe eyes are 174, the nasa zero.\nThis resolution having received the requisite constitutional majority is therefore adopted.\nI don't know how many times this will happen this session, but today we have no announcements.\nWe have no birthdays, and we will be doing page photographs\nat the rostrum immediately upon adjournment.\nNo other business to come before the house.\nThe chair recognizes the majority leader,\nleader burns for emotion.\nThank you, Mr. Speaker.\nLet's speak, I move that this house stand adjourned\nuntil 10 a.m. Tuesday, January the 14th, 2020.\nThe majority leader has moved that this house be adjourned\nuntil Tuesday, January 14th at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it and this house will be adjourned\nuntil Tuesday at 10 a.m.\n",
  "updated_at": "2026-02-12T16:49:17.573367+00:00"
}