{
  "video_id": "qzBaIuQnWT4",
  "url": "https://www.youtube.com/watch?v=qzBaIuQnWT4",
  "title": "Senate Day 37 of the 2025 Legislative PM  Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 37,
  "video_date": null,
  "duration_minutes": 88,
  "summary": "Here is a structured markdown summary of the Georgia Senate Day 37 of the 2025 Legislative PM Session based on the provided transcript:\n\n## Overview\nThe session focused on insurance-related legislation, with the Senate considering amendments to House Bill 348 regarding captive insurance companies. There was some debate around proposed amendments that aimed to restrict insurance companies from easily leaving the state.\n\n## Key Actions\n**HB 348**: Bill to amend the Georgia code to expand the lines of insurance and reinsurance that limited-purpose subsidiary and captive insurance companies can engage in.\n\n## Bills Introduced (First Reading)\nNone mentioned in the transcript.\n\n## Notable Moments\n- Senator from the 20th spoke in favor of HB 348, arguing it would modernize Georgia's captive insurance laws.\n- Senator from the 2nd introduced two amendments to HB 348:\n    - Amendment 1 would prohibit insurance companies from leaving Georgia if they made a profit in at least 4 of the previous 5 years.\n    - Amendment 2 would prohibit insurers from transferring funds between affiliates with intent to mislead regarding profitability.\n- The Senator from the 20th spoke against both amendments, arguing they were anti-free enterprise and would restrict insurers' ability to manage their finances.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "Amendment number one to House Bill 217 has been distributed.\nSenator from the 50th, do you wish to speak to your amendment number one?\nYour choice.\nOkay, I think the Senator from the 50th has already spoken to amendment number one to his bill,\nwhich is House Bill 217, which is the measure we're now considering.\nSo, question is, is there objection to amendment number one?\nwithout objection.\nDoes any other senator wish to speak for against the measure?\nChair here is none. Is there objection to the agreeing to the report of the committee which is favourable to the passage of the bill?\nChair here is none and the report of the committee has agreed to. Is there objection to the main question being ordered?\nThe chair here is none and the main question is ordered.\nThe question is on the passage of the bill as amended.\nAll those in favor of vote, yay, those opposed, nay,\nMr. Secretary, please don't lock the machine.\nOne, two, three.\nOne, two, three.\nOne, two, three.\nAll in the passage of the bill, the yaves are 44, the nays are two.\nThis bill having received the requisite Constitution of Majority is therefore passed.\nAll right, rolling right along, House Bill 348, Mr. Secretary, please.\nPlease read the caption.\nHouse Bill 348, a representative of Williamson,\nthe 112th, and others.\nBill Smith, tell an act to amend chapters 14 and 41\nof Title 33 of the Efficient Code of Georgia Ante,\nrelated to domestic stock and mutual insurers\nand captive insurance companies respectfully,\nso as to expand the lines of insurance and re-insurance\nin which a limited-purpose subsidiary\nand captive insurance company may engage\nto rival definitions, rival-related matters,\nrival-in-effective dates,\nto repeal some looking laws and further purposes.\nMr. President, the think you're making on the insurance\nlabor recommends that this bill do pass,\nrespectfully submitted.\nSenator Walker, chairman, Mr. President,\nSenator Mallow of the second off with following amendment number one to amend House Bill 384 by replacing two online one with\nTo amend code section 33-3 of the official George annotated with two qualifications for transactions of insurance generally\nTransaction of insurance by insurance owned by states and for other purposes\nMr. President of the center mayor of the ninth offers the following amendment number two to amend House Bill 384 by inserting after definitions\non line for the following to mention every 24,\nTitle 33 of those CTA by two interns generally,\nso as to prohibit an insurer from transferring funds\nbetween affiliates with intent to mislead\nregarding the insurer's profitability,\nMr. President, that completes the order.\nThank you, Mr. Secretary,\nthe chair recognizes the hard-working senator\nfrom Houston County,\nSenator from the 20th to speak to his bill,\nHouse Bill 348.\nThank you Mr. President, good afternoon, I know we are all enjoying being here on a Friday\nafternoon a beautiful Friday afternoon sunshine about 80 degrees outside and we're sitting\nin here and to add insult to injury I'm bringing you an insurance bill which I'm sure\nwill be thrilling and captivating.\nSo this bill deals with captive insurance companies, and it deals with a wholly owned\ncaptive insurance companies that have a limited purpose.\nand the men's chapter 14 of the chapter 41 of the code to allow companies to accept investor funds to supplement reserve\nsurpluses. These are investment vehicles that are commonly used by reinsurers. The bill will allow the\ncommissioner to approve the formation of insurers that are in part directly funded by investors.\nIt retains with the commission of the full authority to approve or disprove of the formation\nactivity finances and plan of operation capitalization and assets.\nOur current captive law limits the lines of coverage that these captives can write to\nfive lines of coverage which are casually excluding accident and sickness, marine, transportation,\nproperty, and surety. This bill would remove that limitation which would allow the possibility\nof these captives to write other lines of coverage such as cyber insurance or group term\nlife insurance for their employees or inland marine insurance. But all this would have\nto be approved by the insurance commissioner just like he has to approve traditional insurance\ncompanies that would have to have sufficient reserves and be financially solvent to do that.\nSo this was, this is a department request that we do this to modernize our cabinet statutes.\nWe have companies in Georgia that are doing this now and they're having to go to other states that\nhave more open laws to do it to form these captives and we want to make it where they can\ndo this in Georgia and bring us into the modern era on that.\nI'll go ahead, Mr. President, and speak to these two amendments from my good friend,\nfrom the second, center from the second, and I'll tip my hat to him.\nare very clever and creative and interesting amendments. I'm opposed to both of them. The\nfirst one would basically not allow a carrier and insurance company that came into the state\nof Georgia to do business to leave unless they had a net loss of income over the past five\nyears, so even if they made one dollar of profit in five years, putting billions of dollars\nat risk, and they only made one dollar net over five years they would never be able to\nleave Georgia. That's an anti-free enterprise anti-capitalism bill if I ever saw it.\nAnd then the second amendment, I'm going to have to look up what Artifice means, but\nIt doesn't allow them to engage in a scheme or artifice, which transfers funds between\naffiliates or subsidiaries.\nWell, insurance companies have to maintain a certain amount of surplus and reserves is\ncalled surplus to be able to make sure that they can pay current claims and future claims.\nAnd a lot of our insurance companies, of course, are national.\nI have various subsidiaries, various entities\nthroughout the country and they need to be able\nto move money around as their surplus needs change\nfrom state to state.\nSo I would oppose amendment number two also.\nI ask for your federal consideration of the underlying bill\nand I will be happy to try to answer any questions\nor I'll just get out of the well and we can move on.\nThank you, Mr. President, I'll yield the well.\nYou do have one question, if you want.\nThe senator has yielded the well.\nAll right, Chair recognizes the senator from the second.\ndistinguished senator from Savannah to speak to amendments one and two which are both authored by well speak to amendment number one\nsenator\nThank you, miss president amendment one is a very simple amendment\nAs we've heard\nInsurance companies are losing money hand over fists their bleeding out of every pocket and every which way they're taking on so much water\nThis bill simply says that if all that's true\nThey're free to leave the state\nBut if that's not true, and out of the five years they've been in this state, if they've\nmade money in this state, in at least four of the immediate previous five years, the\nsum of such insurance total net profits from the combination of all policy lines and investment\nincome, attributable to Georgia are greater than $1.\nWe heard time and time again that insurance companies don't make any money in Georgia,\nand if that's the case, colleagues, if you adopt this amendment and you vote for it, and\nthey're not making any money in Georgia, they haven't made any money in Georgia, can you\nI guess what?\nThis amendment is null and void,\nbut if they did make money in Georgia,\nand they made money for four years out of the five,\nthey've been here,\nthen they can't just leave the state\nand say that they're going broken,\ncried bankrupt.\nThat's all it does, Mr. President, very simple.\nAnd if my colleagues hold true to what they've said\nabout insurance companies,\nthen this amendment is an easy one to vote, yes, home,\nbecause it wouldn't be true at all.\nSo we can walk and chew gum at the same time,\nand with that, Mr. President, I yield the well.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nI'm sorry.\nChair recognizes the Senate from the ninth to speak to her amendment.\nAmendment number two.\nAll right, colleagues, I bring you a amendment number two, and just to what Artifices is\ntrickery, cunning and clever tricks, we want to clarify that so we know what this means\nin this amendment.\nBut this amendment is about the deceptive financial practices of insurance companies.\nAnd we've seen this in recent news.\nWhile these companies claim they're operating in a loss,\nthe reality tells a much different story.\nThey're thriving in their profiting record profits\nwhile policyholders are struggling\nwith rising premiums and probably reduced coverage.\nWe've seen this playbook.\nWe saw it play out in Florida.\nInsurance companies were claiming financial hardship\nand citing increased cost and risk\nand all the while quietly like hiding\nand padding up their bottom lines.\nAnd they do this narrative to justify the hikes\nin denying claims and lobby against consumer protections\nand it's exploited.\nIt's a regulatory loophole and it increases profits\nat the expense of consumers.\nWhat this amendment does, we don't want this happening in Georgia, what's happening in Florida.\nIt's not just a question of economics, it's a matter of ethics and it's a matter of accountability.\nWe have a duty to ensure that hard work in Georgia aren't being taken advantage of.\nUnder the guise of insurance companies claiming they're in financial distress,\nWe're false claims too many false claims out there and\nIf an industry can afford multi-million dollar executive salaries and shareholder payouts\nit can certainly provide to\nProvide for a fair and transparent pricing and\nTransparent reporting to consumers\nThat's why I'm introducing this amendment. It's gonna require greater transparency\nIt's going to require insurance to disclose their full revenue stream and\nIn the end of it we want to prevent what's happening in Florida from happening here in Georgia\nSo I'm asking for your favorable consideration of amendment two\nUnless protect Jordan's oh\nThere is a penalty hold on\nThe\nWe want to make the violation real high\nthey can afford it. I think $100,000 is that that shouldn't be much if they find\nthat they're in violation. So asking for support in this amendment and Mr. President,\nI yield the well.\nSenator, is yo to the weld, is any other senator wish to speak to House Bill 348 or the\namendment one or amendment number two?\nChair, here's none.\nIs there objection to the previous question being award?\nChair, here's none of the previous questions award.\nThe question now on the adoption of amendment number one is senator from the second.\nIs there objection?\nThere is objection.\nWe have an objection.\nIs all those in favor of the adoption of amendment number one?\nWe'll vote ye.\nThose opposed will vote nay.\nAmendment number one.\nSecretary, please unlock the machine.\nMr. President, is it not true that there's a South Georgia saying that amendment one is a good way to scratch a lie and find a thief?\nI'm sure the senator knows of which he speaks.\nChair recognizes the Senate from the 20th.\nMr. President, if we yes vote amendment one\nwould cause insurance companies to flee our state very fast.\nSounds like the senator knows of which he speaks as well.\nOn the adoption of amendment number one,\nThe yeas are 18, the nays are 32,\nand this amendment number one having failed\nto have the requisite votes is failed.\nMoving on now, on adoption of amendment number two,\nis there an objection?\nThere is an objection.\nAll those in favor of adoption amendment number two\nto House Bill 348 will now vote ye.\nas opposed to vote nay, Mr. Secretary, please unlock the machine.\nChair, recognize the center of the 9th, for what purpose do you rise?\nIsn't it true that this bill actually is designed to punish companies who intentionally\nhave high profitability, and that they can go to jail if they do it?\nSenator can state her opinions.\nOn the adoption of amendment number two, the yeas are 19, the nays are 31 and this amendment\nhaving failed to have the requisite votes has failed.\nIs there objection to the passage of the green to the report of the committee which is\nfavourable to the passage of the bill?\nThe chair here is none and the report of the committee has agreed to.\nIs there objection to the main question being ordered?\nThe chair here is known and the main question is ordered.\nThe question is now on the passage of the bill.\nAll those in favor will vote yay.\nThose opposed will vote nay.\nMr. Secretary, please unlock the machine.\nAll in the passage of the bill, the\nYays are 47, the nays are two.\nSo this bill having received the records\nthat constitute from the majority is therefore passed.\nAll right, Mr. Secretary, let's keep it rolling.\nHouse bill 351, please read the caption.\nHouse bill 351, by Roadsend of Corpett of the 174th\nand others, the bill is between Tony Knight\nto amend Part 1, Article 2, chapter 8 of Title 12.\nThe fish could have Georgia annotated\nwith two general provisions regarding\nsolid waste management, so as to modify the powers\nand duties of the Board of National Resources\nto revise definitions, to modify solid waste permitting to write for submission of written verification regarding compliance with local zoning and land use regulations to remove certain restrictions on permits,\ndry provisions regarding public comedies and notice, to remove outdated terminology, to write for a later matter,\nshould be looking for the laws and further purposes.\nMr. President, the Senate gave me a natural resources in the environment,\nrecommends that this bill do pass specifically some minutes in our Anderson chairman.\nMr. President, Senator Brass, the six and others offer the following amendment number one to amend House Bill 351\nby inserting the following after a line 320.\nThis act shall become effective on January 1,\n2026 Section 10, Mr. President,\nthat completes the order.\nThank you, Mr. Secretary.\nThe chair recognizes the distinguished senator\nfrom the eighth and the gentleman farmer on this Friday\nto speak to House Bill 351.\nThank you, Mr. President.\nWe're gonna make this quick.\nThis is an agency bill from the Environmental Protection Division.\nIt's intended to revise the Solid Waste Act,\nRemoves provisions courts have determined to be unconstitutional or unenforceable.\nThe resolves inconsistencies between different provisions of the act.\nClarifies for local governments their roles and responsibilities in permitting and\nclarify for the public their opportunities to participate in these local government processes.\nSpecifies EPD's responsibilities for reviewing local government approvals and\nverifications and provides for greater finality in permitting decisions.\nand there is a amendment that's considered\nto be a friendly amendment, Mr. President,\nwith no questions, I'll yield the will.\nYou have no questions, Senator Good job,\nMr. President, urge your favorable consideration.\nDoes any other Senator wish to speak for or against the measure?\nChair, here's none.\nIs there objection to the previous question being ordered?\nThe Chair, here's none, and the previous question is ordered.\nOh, excuse me, my apologies, sorry about that.\nthat. For what purpose do you rise? Yes, parliamentary inquiring or a point of\norder? Yes. Are we going to debate the amendment? Yes, my apology, Senator. I did not\nhave it on the desk. It was not aware an amendment had been filed.\nSenator from the sixth, do you wish to speak to your amendment?\nColle, this is simple, the amendment, there's very little, there are really no financial\nimpacts, so there's no need for this to be on the fiscal year and being such an important\nprogram, we don't want to rush it, so we're moving it from the fiscal year to the calendar\nyear January 1.\nThat's it.\nSenator from the 44th, do you wish to speak, she waves.\nDoes any other Senator wish to speak for or against the measure or amendment number one?\nChair, here's none.\nThe question is now on the adoption of amendment number one to House Bill 351.\nIs there an objection?\nThere is an objection.\nDoes the senator wish to speak to the objection?\nThank you.\nI'm only objecting because this is an unusual state of affairs.\nI don't know what it does.\nDon't understand why we would change the date on this when it's usually otherwise and just I'm not comfortable voting\nYes, so that that's why I would like to be able to vote no. Thank you. I yield the well\nSenator as yielded the well does anyone else wish to speak to amendment number one on house bill 351\nChair here's none\nAll right, we're now on to moving on to voting on amendment number one.\nAll those in favor of amendment number one to House Bill 350 and one will vote\nyay, there's a pose will vote nay, the secretary, unlock the machine.\nOn the adoption of amendment number one, the yeas are 46, the nays are 3, so the amendment\nnumber one having received the requisite vote is adopted.\nThe question is now on the passage of the underlying measure, House Bill 351.\nFor what purpose does the Senate of the 50th rise?\nMs. Consent excuse the Senate from the 19th for business outside the chamber.\nSo from the 19th is excused without objection.\nThank you, Senator.\nIs there objection to the green to the report of the committee, which is favorable to the passage of the bill?\nThe chair here is none and the report of the committee is agreed to.\nIs there objection to the main question being ordered?\nThe chair here is none and the main question is ordered.\nThe question is now on the passage of the bill as amended.\nAll those in favor of the bill will vote, yay, those nay will vote no.\nMr. Secretary, please unlock the machine.\nOn the passage of the bill, the yays are 47, the nays are zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nAll right, Mr. Secretary, let's keep going three more on the rules calendar.\nHouse bill 14, read the caption.\nHouse Bill 410, by represent of the low to the 167th and others built between town and\nact to amend Title 33, those EGA will do insurance to survive for the efficiency and\nthe practices of the Department of Insurance to rise for statutory deposit requirement for\nforeign insurers to remove fees for branch licensees to revise the application requirements\nfor domestic stock and mutual insurance to remove the publication requirement for application\namendments and surrenders for each insurer to remove such publication requirements for\nchartering consolidations and mergers of fraternal benefit societies to revise application\nrequirements for farmers and mutual fire insurance companies to remove licensure\nrequirement for agency branches to arrive for related matters to arrive for an effective\ndate to be able to convene laws and for other purposes Mr. President this thank you many\non insurance and labor recommends that this bill do pass or slightly submitted center\nwalker chairman that completes the order Mr. President.\nThank you Mr. Secretary the chair recognizes the center from the 16th to speak the House Bill 410\nThank you, Mr. President and constituents.\nThis is HB410, is a department bill for the Department of Insurance.\nWe've been talking about them a great deal and what it does, it's a cleanup bill.\nThey no longer need to get three copies of in triplicate, they're going to be doing away\nwith that.\nThat was a major as far as that.\nThey also are not requiring probate or just on their certificates that have to be done.\nThey are requiring licensing of all of the agency principals and that's on a two year licensing.\nAnd it's a basic, simple, clean up bill.\nNo question?\nYou have no question, Senator.\nI must have done a good job.\nDoes any other Senator wish to speak for or against House Bill 410?\nThe chair here is none.\nIs there objection with the previous question being ordered?\nChair, here's none of the previous question is awarded.\nIs there objection to the green to the report of the committee\nwhich is favorable to the passage of the bill?\nChair, here's none of the report of the committee's agreed to.\nIs there objection to the main question being ordered?\nChair, here's none of the main question is ordered.\nThe question is now on the passage of the bill.\nAll those in favor of the, will vote ye?\nThose opposed nay, Mr. Secretary, please unlock the machine.\nOn the passage of the bill, the yeas are fed up with the\n47 the nays or zero so this bill having received the requisite constitutional\nmajority is therefore passed.\nMoving on down to House Bill 433, Mr. Secretary, please read the caption.\nHouse Bill 433 will represent in Bollinger, the 23rd and others,\nbuilt to meet time like to men, Article 2, Chapter 3, Title 35,\nis the official code of Georgia Annotatedly to Georgia Crime Information Center,\nso I supply the Department of Human Services,\nshall be authorized to access or restricted\nand sealed information to get out employee oversight\nand circumcised circumstances,\ndrive for later matters to repeal the looking laws\nand for other purposes.\nMr. President, the same committee on children and families\nrecommends that this bill do pass or secludes minutes\nand recruit Patrick Chairman,\nthat completes the order, Mr. President.\nThank you, Mr. Secretary.\nThe chair recognizes our distinguished senator\nfrom the 32nd to speak to House Bill 433.\nThank you, Mr. President.\nThis bill adds a department of human services to the list of agencies authorized to access\ncriminal history records under the Georgia Crime Information Center, much like we did\nfor decal with House Bill 175 yesterday.\nThe records may only be used by DHS for regulatory oversight, eligibility verification for\nperspective or existing foster parents and eligibility verification for\nperspective and existing employees and contractors. This was amended in the\nHouse with help from the GCIC. With that I'm happy to answer in questions or\nyou'll the will. You have no questions? Thank you. Does any other senator\nwould speak for against the measure? Chair here is none. Is there objections to\nthe previous question being ordered? Chair here is none. The previous question is\nIs there objection to agreeing to the 40th Committee, which is favor to the past of the bill?\nChair here is none. The 40th Committee is agreed to.\nIs there objections to the main question being ordered?\nChair here is none. The main question is ordered.\nThe question is on the passes of the bill. All those in favor of the bill will vote yay.\nI'll pose nay. Secretary will allow the machine.\nI'm going to give you a\nsecond.\nSenator from the 41st, what purpose\nyou raise?\nElementary inquiry.\nState inquiry.\nIsn't it true that this bill\nwould allow foster families to have\naccess to children's records for\npolice?\nIsn't it true this is\nallows criminal record access for\nchildren who are in foster care\nwithout a judicial release.\nSenator is passionate about what she speaks.\nAll in the passes of the bill yeas are 43 in the nays are seven this bill haven't received the requisite constitution majority is there for pass\nSecretary read House bill five seven five House will five seventy five or was in a McComb the thirteenth and others\nBill's being telemedic to men tied up 32 those CGA like to highways bridges and fairies\nSo as to authorize notice of certain public hearings by the Department of Transportation by electronic publication to our related matters for legal\nlooking laws and for other purposes Mr. President of the St.\nCommandant Transportation recommends that this bill do pass by substitute\nsoftly submitted in our dollars all chairman Mr. President of the St.\nCommandant Transportation I was following substitute to House Bill 575\na bill to be set on act to amend title 32 of the fiscal Georgia\nannotated with the highway spread just in the very so as to authorize notice\ncertain public hearings whether part of transportation by electronic\npublication to authorize such department to negotiate the acquisition of\ncolumn property of a condominium association or properties owners\nassociation with a designated board for either such association and\nfor other purposes, Mr. President, they complete the order.\nWe're going to add the center from the 40-5th.\nThank you, Mr. President.\nColleagues arise today to bring House Bill 575 before you today.\nIt's the annual G Dot Statuary Housekeeping Bill.\nIt's got four parts to it.\nThe first section updates the timing requirements for\nprinting the final notice for G Dot to project our public meetings with\nlocal newspapers that do not publish daily.\nSome local papers only publish weekly now.\nIt also clarifies when a condominium association is a point of contact, when an acquisition is occurring and allowing the board to act for that condominium, it codifies existing G dot trip programs dealing with towing recovery incentive programs is sure that heavy trucks that are crashed continue to be quickly cleared from interstates and then section four underscore G dots ability.\nwhen possible to work with utility owners to relocate utilities in the right\nof way before construction of a new project occurs. Would that Ms.\nPresident be happy answering questions or yield the well?\nNo, no questions. Thank you, Mr. President, you'll be well.\nAny other senator to speak like to speak for against measure chair here's none\nIs there objections to the previous question be in order chair here's none previous questions ordered\nQuestion is only adoption of the committee substitute is there objections to adoption of the committee substitute\nHearing none the committee substitute is adopted\nIs there objection to agreeing to the poor committee which is favorable to the passage of the bill chair?\nhere's none. Forty-minute agreed to. Is there objects in the main question being ordered?\nChair here's none. The main question is ordered. Question is on the passes of the bill.\nBy substitute, all those in favor vote, yay. All opposed, nay. Secretary, I'm not in the machine.\nAll in the past of the bill, the yays are 50 and the nays are zero.\nbill having to see the regs and constitutional majority is there for pass by substitute.\nAll right, so we're done with the rules calendar. We're going to do about four special, special\nspecial rules, special actions, excuse me, and then we'll be done for the day.\nRecognize the center from the 45th.\nThank you, Mr. President.\nI ask for unanimous consent that HB 360 be lifted from the table.\nSecretary, read the caption.\nHouse will 360 by represent,\nadministration 104th and others bills being touted act to men article two chapter seven type of 48 of the physical\nGeorge annotated away to income tax and position rate computation exemptions and credits\nso as to revise a tax credit for the rehabilitation of historic structures to authorize the credits be claim in the\ntaxable year the year a certificate of occupancy\nSubtained for certain pre-approved rehabilitation is rather related matters for building laws and for other purposes that can be\nyour Mr. President? Yes, there's an objection. We have an objection. Would you like to speak to your\nobjection.\nThank you Mr. President. I object to removing it from the table because I want to see what the votes are up on the board.\nSo now when we get ready to debate this thing, I know who I need to convince. This is a bad bill. We don't need to remove it from the table.\nwould you like to speak to you you wave okay all right so posture we in is the center from the\n45th is asked for an unanimous consent that HB 360 be taken from the table the center from\nthe 3rd has objected to that so all those in favor of the senator's motion will vote yay all\nPost, Nay, Secretary-in-London Machine.\nYou\non the objection for moving it from the table. The yays are 34, the nays are 17 and the motion\nhas failed. I mean, excuse me, his motion has prevailed. Secretary, the rest is kept.\nHouse Bill 36, you are representing the administration 100 and 4th and others built between\ntime and act to men are equal to chapter 7, tie to 48. The official go to Georgia annotated\nand for other purposes.\nMr. President, the Senate Committee on Economic Development\nand Tourism recommends that this bill do pass\nor sparkly its minutes in our beach chairman\nthat completes the order, Mr. President.\nWe're gonna send it from the 45th, speech in the measure.\nThank you, Mr. President.\nColleagues, I bring HB 360 before you today.\nIn the summer of 2026, the World Cup is coming to Atlanta.\nHB360 is an important piece of legislation to make sure our capital city is prepared\nto meet the needs of thousands of soccer fans from across the world.\nThis bill is designed to jumpstart development in downtown Atlanta, particularly in areas\nthat surround the stadium where the games will be held.\nAny of you are familiar with the Georgia's Historical Tax Rehabilitation Credit, which\nis long supported revitalization of historic structures by encouraging private investments\nin historical buildings.\nHB360 encourages developers to complete their historical projects in downtown Atlanta\nprior to the start of the World Cup, allowing them to claim those accelerated tax credits\nIf they're able to get their certificate of occupancy prior to the end of 2026.\nImportantly, this bill does not increase the current yearly cap of historical tax credits.\nIt simply allows developers that have been approved to receive those tax credits in future years.\nThere is a sunset on this tax credit in 2029, so it would be 2027, 2028 or 2029.\nTo claim those credits early, if they complete those projects before the World Cup, there\nwas an interpretation question that was cleared up and been addressed by DMR.\nThis bill would allow funds to be pulled forward from the yearly $30 million cap.\nIt would not create any additional funds.\nThese have already been approved in future years.\nIt would just pull those back to 2026.\nThe total if all of the projects in this selected area in Atlanta were completed and had a CO the total cost of that would be $29 million.\nWould that Mr. President be happy to answer any questions?\nDo you have a couple questions, Senator?\nI recognize Senator from the second.\nThank you, Mr. President.\nSenator, do you you?\nI do.\nSenator, I'm trying to understand this piece of legislation and relation to the tax credits and pulling them forward\nor certify structures for tax year 2027, 2028, 2029.\nSo you're saying out of the state allocation\nof those tax credits that this individual developer\nwill be able to pull forward the proceeding years\nafter forward in the current tax year.\nIs that not true?\nThat is true.\nAnd so will the credits being pulled forward\nless than the amount of available credits\nthat already exists in the total dollar amount?\nThat is correct.\nWe're not adding any additional dollars, it just pulls those forward so you would that\n29 million.\nIf they get CEOs on all those projects, being in the construction world and timing of construction\nprojects, some do run long, but if they all were completed in this designated area around\nthe stadium, the additional funds would be 29 million that would be pulled forward.\nSo then in future years where, and it's my understanding those credits actually go out\nthe 28 that have been applied for in that particular area is 27 and 28 so it's two years\nthat would be pulled forward so no additional money it's just those future years would\nbe less.\nSo the future years would be less and it's also says not just you said up to 28 but Senator\nthe Legislation on line 16 also says that it would include year 2029 as well so we'd\nbe lessening the amount of credits available to everybody in the rest of the state but\none project.\nNo sir what and I'm glad you asked that question senator\nNo sir what what it would do is these projects have already been approved so\nThere there would be no taking away from from other folks these projects are already on the books\nThey've been approved. It's just they're approved essentially around the stadium\nBasically and it does go out to 2029. There's about a million that the million dollars worth of credits\nThat it had been applied for and given in 29\nBut these projects don't go out that far the projects around the stadium\nthey've been approved for 27 and 28 so those two years would be pulled back but\nthere would be no taking or no less credits out there for folks to claim they've\nalready they've already been approved for those credits it's just\naccelerating them so those projects would be done by the World Cup so we've got a\nnice vibrant area around the stadium. Last question Senator have we done this\nfor any other part of the state? I don't know the answer to that\nRecognize the approach in for a question. Thank you, Mr. President. Is the senator yield? I do\nSenator, do I understand that if hb360 passes\nThat those that have applied for and been approved for these tax credits for 26 going forward\nThey're all in a line and they have a position in the line for each year\nThe total of which maximizes out at the 30 million dollar cap per year, right? That is correct\nAnd that if this bill passes, no one loses their spot in line,\nnor are they pushed back or forward, that is correct.\nAnd that the amount of money that they have been approved\nfor for the tax credit will not change,\nwill not increase certainly.\nAnd but will not decrease if 360 is passed.\nThat is also true.\nSo the passage of HB360 has no effect or impact on the others\nthat have asked for and been allocated this tax credit out into the future as\nfar as 2030. That is correct. Thank you Senator. Yes and one other point of\nclarity in some of my discussions folks have asked over this jumping in line\nand it's not jumping in line the folks that are in you know 27 28 29 if you\ncan imagine of course Gwyneth's home for me so I'm imagine being on 85 you\nWe've got a peach pass lane, we've got the other lanes on 85, and they're all traveling\nin the non-peach pass lane, but their schedules will not change.\nEssentially, we're allowing for these projects around where the world couple would be able\nto get in the peach pass lane to be accelerated so that the area around the stadium is very\nvibrant for these games.\nThank you, Mr. President, with the center yield?\nI will.\nWhat's the number of developers that seek to benefit from this legislation?\nI don't know if this is 100% true but in the discussions I've had, I believe there's only one developer that I'm aware of.\nof there may be more right that's just what I've what I've been made aware of so\nthis legislation is going to benefit one developer in the entire state what I\nwould argue is that this will actually benefit the City of Atlanta it'll\nbenefit Georgians it'll benefit you know how this area around the stadium looks\nwhen we have the World Cup come and Atlanta and Georgia is showcased to the\nsoccer world. Senator will you further yield sure how do you say it's going to\nhelp all Georgians don't you think it's going to burden Georgians by having to\npay more taxes because this one person is being exempt from taxes. What I would\nsay is I mean you could argue tax credits but these tax credits have already\nbeen approved like this is not a new they're not applying this is not a new\ndeveloper coming in applying for the credits now they've already been approved\nfor these projects it's just where they've been approved around the\nthe stadium, the credits have been proved in 27 and 28.\nThis would just pull those back to 26.\nSo we can get those projects done\nbefore the World Cup comes to Atlanta.\nI'll be voting no, Senator, thank you.\nThank you.\nWe're gonna send it from 27th.\nThank you, Mr. Chairman.\nOr, Mr. President, Mr. Chairman, yield.\nI do.\nWe keep talking about the World Cup.\nBut the certificate occupancy does not need to be issued\nuntil December 31st of 2026, or think it's about six months after, so what I'd like to\nknow is that I can draft this quickly. Would you be in a amenable to an amendment that would\nchange December 31st on line 19 to June 1st so that we actually ensure this is complete\nfor the World Cup?\nI would be amenable that, yeah.\nOkay.\nThank you, Mr. Chairman.\nSenator, you have no more questions.\nThank you, Mr. President.\nThank you, Mr. President.\nIn 2022, the historic tax credit, which is meant to benefit all around the state, was\nagain passed with a sunset of 2029. It's 30 million per year. And besides the 30 million\na year, it has something in there that no project would get more than $5 million. Because\nwe want to spread it around to Augusta and Savannah and Albany and Macon and Columbus and\nAthens different cities sort of spread it around. Now what they've done, I guess creatively\nis we've got one developer that has six projects\nthat is five billion each.\nAnd they're taking the credit that's\nsupposed to be used around the state\nand consuming the rest of it through 29.\nWhat's left in there?\nAnd moving ahead of other people\nwhen they will get their money as well for this,\nI think many people are of the opinion\nthat this project would happen anyway.\nthat this credit moving in the front of the line is unnecessary.\nSo we passed a really good bill earlier today, Chairman Strickland's bill.\nWe increased the tax credit for childcare from 30% of the federal max to 50% for all the\nchildren around the state of Georgia, $28 million.\nWe've got a bill that's going to benefit one person that's more than that.\nAnd I think that we're certainly setting a bad presence when we let them exceed the\nfive million cat by having six projects and that we move them to the front of the line.\nI've going to be voting no against this bill.\nI'll yield the well.\nSenators yielding recognize the center for the excuse me not the center the treasurer of the United States\nThank you, Mr. President. I rise in support of this bill\nI want to tell you a little story. I opened a restaurant in downtown, Alpharetta about 20 years ago and the building was built in\nin 1910.\nAnd I thought it was a historic building.\nAnd I thought I was going to spend about $5,000\non electrical work.\nIt ended up cost me $15,000 because nothing was up to code.\nWhen you deal with these historic old buildings,\nyou're going to run into skeletons in the closet\nthat you weren't imagining.\nSo that's one reason I'm supporting this bill.\nThe other reason is it's going to revitalize this area.\nAnd it's not just for World Cook Cup.\nIt's a 30-year plan to have the benefits\nfor the next 20 to 30 years of restaurants and retail\nand coffee shops and bars and housing and condos\nand just all kind of mixed juice down there.\nI could see this becoming very similar to in Denver\nabout 30 years ago, you wouldn't even\ngo around Cours Field because it was such a blighted area.\nThis isn't as plighted, but it's not as vital as it could be.\nAnd I think that you take all those buildings,\nand you can really create jobs and economic activity down there.\nAnd don't forget, it's not just for World Cup in the stadium.\nWe have a thriving convention business\nat the World Congress Center, and we need nighttime activity.\nAnd I think this is going to do that with what these developers\nwant to do, and so I'm fully behind it.\nAnd I want to ask everybody to support it.\nMr. President, I'll yield the well.\nThe senator is yielding.\nSenator in 36, did you have a question?\nWould you like to speak?\nParliamentary inquiry.\nStates are inquiring.\nIsn't it true that with the, in light of the comments,\njust raised by our U.S. treasure, that this is work that will benefit the place that\nwe all come to to take care of the state's business. It's going to clean up an area of\nhistoric preservation. And it's a very minimal state dollars that are going to be put with\npaired with other dollars, and every dollar that's, that, that, that we've come to this\nproject is only after the money's spent. So it's a, it's a, it's a modest proposal with\ntremendous opportunity for, for seeing a transformed portion of Atlanta that is long\nneeded to be transformed. Thank you.\nWell, I'm a drain choir.\nWon't you, Sandra, won't you see if the the treasure there can turn on the press printing presses up there and help us just fund this thing here, so\nrecognize the\nCenter from 31st\nIs it not true that maybe many years ago if the City of Atlanta wanted to do this, the Atlanta Braves would still be in downtown Atlanta?\nWe just went straight for the belt right there.\nWe're going to have a center for the second.\nThank you, Mr. President.\nNot only does this benefit pulling forward tax credits for one specific developer, but\nI would like to draw your attention colleagues to lines 22, 23, and 24.\nAt certain capital improvements of the cabbage town historic district economic reuse establishment\nof certain additions, there are two from all city of Atlanta and Fulton County Ave,\nLorm, Texas.\nNow, Ms. President, I know my colleagues want to vote in favor of this bill, but not only\nare you going to get the tax credits, you're also not going to pay taxes on the development\nthat you're developing.\nThat's a bad bill, Mr. President, and I leave it at that.\nI yield the well.\nAs Senator from the 53rd.\nSenator from the, thank you, Mr. President.\nSenator from the 31st, we're out of the Atlanta Braves.\nYou know, I don't think the Atlanta,\nCity of Atlanta got involved on that deal with their funds.\nI don't believe they're getting involved on this deal.\nI'm kind of sick and tired of citizens from Northwest Georgia having to pay more taxes\nso citizens in Atlanta can pay less for their special projects.\nI used to live over in Cabbage Town when I was over in the house.\nCabbage Town is a historical place, but the buildings are already there.\nThe studs are already there.\nSo why should you be able to come in as a developer and have a house that's already built and\ntry to upgrade it and then get out of all the taxes for it?\nYou want to upgrade the community, tear the place down, and go build something brand new.\nThis is ridiculous.\nThank you, Mr. President.\nDoes any other Senator wish to speak for against the measure?\nSenator from the 27th Senator did you were did you have something to where you\ngo off or something amendment okay is there objection to the previous\nquestion being ordered chair here's done previous question is ordered is there\nobjection to agreeing to the board committee which is favorable to the\npasses of the bill chair here's done for the committee is agreed to is there\nto the main question being ordered.\nChair, here's the main question is ordered.\nQuestions on the passes of the bill.\nAll those in favor will vote yay.\nI'll oppose nay, secretary, and lot of the machine.\nYou\nAll the passes of the bill, the A's are 26, and the A's are 24, and this bill has failed.\nSenator from the 41st, what purpose do you rise?\nMr. President I move that we reconsider it is in order all right is there\nobjection for the reconsideration\nSenator senator senator senator from the 19th\nSenator from the 1980s for the purpose of your eyes\nJust a conversation with the Senate secretary of Senate\nSenator from the 14th for the purpose of your eyes\nParliamentary and creamist president states you inquire is it not true that if reconsideration succeeds\nThen we can table the bill and negotiate over parameters that would make it acceptable to a majority of the body. Is that not true mr\nI believe the senator is up to speed on his rules\n.\n.\n.\n.\nAll right, so on the motion to reconsider the center from the 41st, because we are in\ndate, 37 Monday, it will be the first order of business for reconsideration on Monday.\nthat you've given the notice.\nWe're going to ask the senator from...\nWe have a special message from the House.\nWe need the Secretary to read the message.\nMr. President, the following message will be received from the House\nto Mr. Riley to hook their oath.\nMr. President, the House is passed by substitute by the requisite\na constitutional majority, the following bill of the Senate,\nSenate bill 79, by Senator Goodman, the 8th, and others,\nthe bill's been toned on act to amend Title 16 of those CGA,\nwhere I do crimes and offenses.\nSo as to revise, so as to roll to announce the event,\nand all the related sentences, necessary to constitute\nthe offenses of processing, selling,\ndistributing, and manufacturing of such sentences,\nand further purposes.\nMr. President, the following methods were received\nfrom the House and Mr. Riley, the clerk that are of,\nMr. President, the House has disagreed to the Senate\namendment to the following bill, the House, House Bill 86,\nby Representative Leber, or the 123rd, and others,\nbuilt between 10 and 9 to Menco Section 48, 5-7-4.\nThe official goes towards annotated way to annual salaries\nto certain state officials and cost of living adjustments\nso it's to revise provisions related to calculating\nand setting salaries and for other purposes.\nMr. President, that completes the order.\nThose are special actions that we'll take up\nat the end of these special actions that we have currently.\nSo now I recognize the senator from the 8th.\nMr. President, I move that the Senate agree\nto the House, just Senate Bill 79.\nIs there objection?\nSecretary Reed, the caption.\nSenate Bill 79, my Senator Goodman, the 8th,\nand others, built to be in town on that to men,\ntitle 16 of the OCGA, which is crimes and offenses,\nso it's a rise to racial demands of fentanyl\nand related substances necessary to constitute\nthe offenses of possessing, selling, distributing,\nand manufacturing of such substances to revise\nmandatory minimum departure revisions\nfor defendants convicted of trafficking of substances\nand violation of code section 16-13-31\nrelated to trafficking of cocaine, illegal drugs,\nmarijuana, and methamphetamine, and penalties\nto amend various titles of OCGA says to provide\nfor conforming changes, to write for an effective day,\nto write for applicability, to write for related matters,\nto write for a short title, to repeal convolcing laws,\nand for other purposes.\nMr. President, the House offers the following substitutes\nSenate bill 79, it builds between Title IX to amend Title VII, 16 of the OCGA,\nwhere due crimes and offenses, search of vice-versa or old amounts of fentanyl and related substances,\nnecessary to constitute the offenses of possessing, selling, distribution, and manufacturing of such substances,\nand for other purposes, Mr. President, I can please the order.\nSenator Leith.\nThank you, Mr. President, Senate Bill 79, come back to the Senate.\nI want to thank Mr. President, you and your staff, for all the work that you've done on\nthe fentanyl epidemic.\nI want to especially thank the Walters family who are over there, who have been here while\nwe've gone through all these bills awaiting this special action, this bill passed out of\nthe House.\nsenator if we could have everybody's attention please we're almost done let's\ngive the attention to the senator in the well thank you mr. President I want\nto thank the Walter's family they've driven four hours up here today they were in\nthe house gallery when this bill passed earlier today and they've stayed with\nus all day mr. Gus miss Beth y'all stand up where I can see you thank you\nIt's Beth, we love y'all, thank you for all the work that you've done, really of taking\na tragedy in Olsen's death and making some good out of it.\nThis bill, when it went to the house, we agreed to the change.\nWe took out the possession language that was in the original bill, and this bill now\nwas solely focused on trafficking.\nAnd so I want everybody, if you're talking right now, I want you to listen to what I've\ngot to tell you.\nthis past week, just this past week in Sandy Springs, their law enforcement found\nenough fentanyl to kill every resident of Atlanta, Macon, Savannah, Columbus, Augusta,\nValdosta, Brunswick, Warner Robbins, Hinesville, Sandy Springs, Johns Creek, Roswell,\nOfferetta, Peachtree City, Chambley, Sugarhill, Newton,\nStatesburg, Gainesville, East Point,\nPooler, McDonough, Stockbridge, Union City, LaGrange,\nCarter'sville, Forest Park, Winder,\nand every spectator that's in Sanford Stadium\nand Bobby Dodd Stadium and Mercedes-Benz Stadium\nwhen this is a full capacity.\nJust this week in our state,\nenough fentanyl to kill two and a half million people,\nNearly one in four Georgians.\nThat's why this bill is needed.\nThese folks that are trafficking this poison in our streets.\nAgain, Mr. President, I want to thank you for your leadership\non this issue, especially for loving on the Walters family.\nAnd I want to thank this chamber.\nAnd I just asked for my children and your children\nand the children of Georgia and our fellow Georgians,\nlet's light this board up green if we can.\nI yield for questions, Mr. President, or I yield the will.\nYou have no question, Senator.\nThank you, Mr. Brett.\nDoes any other Senator wish to speak for against measure?\nSenator from 29th?\nMr. President, I ask for unanimous consent\nto excuse the Senator from the 37th.\nWell, objection to the Senator from 37th is excused.\nThe senator has asked that the Senate agree to the House substitute on SB 79, all those\nin favor will vote ye, all opposed, nay, secretary in line of the machine.\nYou\nOn the motion, the yeas of 49, the nays are zero and this motion has prevail.\nYou\nYou\nSenator from the 50th, ready when you are.\nThank you, Mr. President.\nI moved that the Senate received from its amendment to House Bill 86.\nSenator has moved that the Senate received from his amendment on House bill 86. Secretary,\nread the catch.\nHouse bill 86, where I represent a member of the 123rd and others, the bill to mean\ntell an act to amend.\nCode section 45-7-4, the official code of George Ante will lead to annual salaries, certain\nstate officials, and cost of living adjustments, so as to revise provisions related to calculating\nand setting the salaries of justices as a Supreme Court judges the Court of Appeals and the\njudges the Georgia Statewide Business Court and the judges the Georgia State Tax Court to\nprovide for effective dates to arrive for a later matter,\nshould be able to look at the laws and for other purposes.\nMr. President, the Senate offers the following amendment number one\nto amend House Bill 86 by inserting up to a core\non line five, the following to revise the compensation\nof certain other elected state officials\nby striking lines 13 through 16\nand inserting a lieu thereof the following one governor,\nstriking 175,000, inserting 250,000 and for other purposes.\nMr. President, that completes the order.\nThank you, Mr. President.\nHouse Bill 86 is bill we heard yesterday it deals with judicial compensation.\nThank you, Mr. President.\nHouse Bill 86 is bill we passed out yesterday it deals with judicial compensation for\nSupreme Court judges, Court of Appeals judges, and business court judges, there was an\namendment that was added on in our chamber that increased the pay for the governor and\nconstitutional officers.\nThat was stripped over in the house.\nThey've sent it back to us because of the importance of this bill to our judicial system.\nI ask that you go along with me to recede if there are people in this chamber that want\nto address the salary of the Governor of Constitutional Officers moving forward.\nI would encourage you to do what the judges did.\nLet's get a study committee together.\nLet's let it work the committee process.\nBut for now, instead of amending a bill at this late in the session,\nto address a pretty robust issue, let's stick with what we have.\nLet's receive from our position and let's get this bill passed.\nI'm happy to answer any questions if not, Mr. President, I'll yield the well.\nYou have no question, Senator.\nThank you, Mr. President, I yield the well.\nDoes any senator wish to speak for against the measure?\nHearing none.\nSenator, from the 50th, has moved that the Senate received\nfrom its amendment to House Bill 86.\nIs there objection?\nAll those in favor, we'll vote yay, all opposed, nay,\nsecretary, and lot of machine.\nYou\nYou\nown the motion the yeas are 46 the nays are two and this motion has prevailed\nYou\nYou\nYou\nThank you, Mr. President, I move that the Senate agree to the House substitute to Senate Bill\n69.\nThe Senators move, Secretary Reed caption.\nSenate Bill 69, by Senator Kennedy of the 18th and others, Bill Smith-Townel and Act\nto amend Title 7, Article 5, Chapter 11, Title 9\nof the fish go to George annotated,\nway to making and finance and depositions in discovery\nand with the Georgia Civil Practice Act respectively,\nso as to regulate third party litigation,\nfinancing practices in the state,\nto provide a short title,\nto provide for a later matter,\nto provide for an effective date and applicability\nto repeal some lifting laws and further purposes.\nMr. President, the House offers the following substitute\nto Senate Bill 69,\nto build between Title 9 to amend Title 7,\nan Article 5 of Chapter 11,\nthe Title 9 of the fish go to George annotated,\nreally, to making and finance and depositions\nand we're discovering the Georgia Civil Practices Act.\nRespectfully test to regulate\nthird party litigation and financing practices\nin the state to enact a new chapter\nregulation litigation and financing practices\nand further purposes.\nMr. President, I can place the order.\nRecognize the pro-tum.\nThank you, Mr. President.\nI'm gonna try to be efficient guys.\nI know we're at later in the day and it's Friday afternoon,\nbut this is Senate Bill 69\nthat you'll remember that we presented\nand voted on unanimously by this body\nand send it over to the House.\nAnd I will tell you that they made a few changes to it,\nall of which I think are fine.\nLet me tell you very briefly.\nFirst of all, this is of the two tort reform efforts\nfrom Governor Kim.\nThis is the second of the two.\nThis deals with something called third party litigation funding.\nAnd this is at its hard three measures.\nNumber one, it is a consumer protection measure\nfor those people that engage\nand need these type of financing arrangements.\nNumber two, it is a disclosure issue\nbecause it makes it more transparent\nwhen these type instruments are used.\nAnd number three is the national security issue,\nmaking sure that those that are foreign adversaries\nthat are acting in a financial capacity\ndon't continue to have access to our court systems,\nthe way that we're exposed to right now.\nSo the question is, how is this different\nthat's been offered by the House?\nI would tell you that Section 710-1 simply changed\nthe definitions to align with the banking departments\nor the Department of Banking's practices.\nthey took a closer look at it and added some exclusions that made it more in alignment\nwith current banking law.\nYou'll also see in section 7, ash 10-3 that this new code section is based on consultations.\nAgain, with the Department of Banking and Finance to clarify that they can deny a registrant\nwhere the requirements are not met.\nIt also in section 710-4 makes clearer that while the litigation financier cannot pay referrals\nor commissions, the attorneys or other outside parties, payments to litigation financiers,\nemployees do not violate the prohibition.\nAnd I will tell you, senators, that the one main change you'll find in section three\nunder discovery and disclosure simply takes the limit on third party discovery toward\nlitigation financiers does not extend where the amount of the amount being financed is\n$25,000 or less because that amount is excluded from these types of transactions.\nSo with that, Mr. President, I'm happy to answer any questions or I'm happy to yield.\nYou have no question, Senator.\nThank you.\nThank you, Mr. President.\nI move to the Senate degree to the House of the Senate Bill 69 as amended by amendment 1.\nAll right, Senator's move.\nSecretary, read the amendment.\nMr. President, Senator Hatchett of the 50th offers the following amendment number one to amend the House's substitute to Senate Bill 69 by inserting after a line 23 after a short title of following to amend Title 40, the Fisher go George annotated away to Motor Vehicle, so as to provide for the Missibility of Evidence related to Seat Safety Bells by placing lines 458 through the end with the following Section 4 Title 40, the Fisher go George annotated away to Motor Vehicles is amended in Code Section 4-H8-76.1, related to use the Safety Bells in passenger vehicles by revising Subsection D and for other purposes, Mr. President.\na complete stewarder.\nWe're going to sit in front of the 50th.\nThank you, Mr. President. I'll try to be brief here.\nAmendment 1, what this does is it relates to a evidentiary or evidence that's allowed to be brought in in the trial.\ndoes is going to change the effective date of this act so that it will not apply to pending\nactions that are in court. It only applies to actions that are filed after the effective\ndate. It deals with the admissibility of seatbelt evidence. There's been some constitutionality\nissues that have been raised about changing the evidentiary rules as it relates to this\nissue in pending litigation. This will clean that up and I'm happy to answer any questions\nbut ask for a favourable consideration.\nDo you have one question, recognize the center for in 30 second.\nThank you, Senator, would you yield question?\nI'm looking at lines 22 to 24, where it says the way I'm reading it is that if I'm not\nwearing my seatbelt and I cause an accident that the insurance company can't raise my\nrates.\nAm I reading that correctly?\nThat's correct.\nLanguage that we've already passed us verbatim language that we've already passed. Okay, thanks. Thank you\nYeah, no further questions. Thank you, miss president yield the well\nAny other senator which speak for against the measure\nAll right, so we'll take up the\nFirst most most may by the senator from the 50th\nAmendment number one\nAll those in favor of the amendment from the center from the 50, the motion, I'm sorry,\nall those in favor of the motion by the center from the 50th will vote yay.\nI would know if, he knows no objection because it could be final passes.\nAll those favour of their amendment will vote yea, I'll pose nay, say take a lot of\nthe machine.\nYou\nAll in the motion to agree to the House's substitute to SB 69, as amended, the A's are 52,\nthe A's are 0, and this motion prevails.\nMr. President, I move the Senate stand adjourned pursuant to Senate resolution number six until 10 a.m. on Monday, March 31st.\nMr. President the rules committee will meet upon a German room 450 in the capital and the agriculture and consumer affairs committee meeting has been cancelled that completes the order, Mr. President.\nAny other announcements? Any other announcements?\nThank you Mr. President. Just a reminder that on Monday will be John Bullock Day so we get to wear our jeans.\nbe the last time for this year that we'll have John Bullock Day. So, wear your blue jeans\non Monday and we'll come in and have a great day of work and a great day in the chamber\nand be a little bit more comfortable. Thank you, Mr. President.\nBring it on, Senator from Feet 3rd, the Cadillac Man himself.\nJust a reminder, the very first interstate cooperation dinner, I think ever in history\nwill take place Monday at Fogo to Chow at 6.30. So, please be there and bring us\nfast. Thanks. We have it in\ncabbage town. All right, the\nGeorgia leader has moved that the\nSenate is saying adjourned until 10\na.m. Monday, March 31st. All\nthose of you with the motion\nsignify by saying aye. All\nthose opposed. No. As clearly\nhaven't have a good weekend.\n",
  "updated_at": "2026-02-12T17:30:31.301886+00:00"
}