{
  "video_id": "R5Pmmdf3kv4",
  "url": "https://youtu.be/R5Pmmdf3kv4",
  "title": "Georgia House - Day 11 (2026-02-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": "2026-02-03",
  "duration_minutes": 59,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured a prayer by the Chaplain, followed by routine procedural matters. The key action was the introduction and first reading of HB 67.\n\n## Key Actions\n**HB 67**: A bill introduced for the first reading.\n\n## Bills Introduced (First Reading)\n- HB 67\n\n## Notable Moments\n- The Chaplain, Rev. Jimmy Older, delivered an inspirational speech reflecting on his lifelong passion for government service and leadership.\n- Rep. Richard Smith, the Chairman of the House Rules Committee, introduced the Chaplain and spoke about their close personal and professional relationship.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nThe transcript indicates a quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe transcript does not provide information on when the session was adjourned or when the next session will be held.",
  "transcript": "BI\nD\nB\nG\nAND\nB\nDo\nIt\nthe\nE\nD\nDo\nDie\nGonna\nDie\nor won't\nLeave\nенд\nanting\nhard\nSupp response\nThat\nAll right, we're about to have the morning roll call.\nWe are about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nall members voted have all members voted if so the clerk will lock the machines nor keepers will\nplease close the doors and keep them closed.\nWell, good morning.\nHope everybody is happy and healthy today.\nWe will begin our day with Scripture reading and prayer by the Chaplain,\nafter which we will pledge allegiance to the flag of our country.\nour chaplain this morning will be introduced by the gentleman from the 134th House District,\nthe chairman of the House Rules Committee, chairman Richard Smith, chairman Smith.\nThank you, Speaker. I told somebody other day that my pastor was going to be here today and\nAnd they looked at me and said, well, you know, we didn't think you had a heart.\nBut now we know, you know, it's even worse now that we think you have a pastor.\nSo it's, uh, it's kind of, if you, I talked to the little lady yesterday,\nwho had, uh, came in with her father, a pastor, and I asked her, I said, you know,\nwhat my favorite word is? She said, no, I said, it's no.\nAnd her dad said, well, that's my favorite word too.\nAnd she said, yeah, that's right.\nYou know, I know everybody in here has heard the story of the turtle sitting on top of\na fence post and that they always had to have somebody help them get there.\nAnd I think everyone in this room can identify folks in their life who met that criteria\nof helping you get to where you are now.\nAnd I dare say that, of course, now I'm a little older than most of you, our Williams.\nBut I can list four or five people that were instrumental in my life to bring me here\nand to help me in a whole lot of other ways.\nbeen very fortunate and I want to tell you about two groups. One group is a group that\nhelps me professionally and the other group is the one that helps me with my faith and\nit's a unique opportunity when you have one person who fits in both categories and my\nPastor Jimmy Older is that individual? I'm on the sit-down for you know I\nhear to listen to me. Jimmy Older pastor first bad discharge in Columbus he\ntold me just just introduce me here's Jimmy so here's Jimmy.\nMr. Speaker, you're a friend to Muscogee County.\nThank you so much.\nChairman Smith, members of the House of Representatives,\nfriends, it is my distinct honor to be here.\nI mean that from the bottom of my heart.\nThis is a place of history, a place that has inspired\nmy life, all of my life.\nThose who sat at these desks are the ones that\nhave touched my life in a very special way.\nof my host, Richard Smith, I'd say he is my friend,\nhe is my parishioner, and he's a statesman\nthat I respect and deeply love.\nHe's made an indelible mark on our community,\nboth as citizen and representative.\nHe is largely responsible for the Chattahoochi Valley\nCommunity Foundation.\nHe also is largely responsible for the Mercer\nschool of medicine, location there, and you have been so generous to fund it, and we're\nso grateful for that. Thank you so much for that.\nRichard epitomizes servant leadership. And, you know, from my childhood, I've loved\ngovernment, I've loved the governance system, I've loved being involved in any way I possibly\ncould, wanted to be as close to it as I possibly could. To the point that as a little kid,\nI wanted to grow up in the governor of Georgia.\nI really did.\nAnd it was an aspiration, a desire of my heart\nthat's been there all of my life.\nI followed the work of government so closely\nthat I've been privileged to know or to meet\n10 of the 13 people who served as governor of this state\nin my lifetime.\nI mean, I work to do that.\nI've known representatives, I've known senators,\nI've known national people in Senate and House.\nI've known a couple of presidents.\nI've had an opportunity to do this,\nbut that's the passion of my life.\nI enjoy this.\nIt's been important to me.\nIt was not a matter of power as a kid.\nI looked at it as a way to really help people,\na place where you can go and serve\nand you can make a difference\nand you can change people's lives.\nIt's a wonderful kind of experience.\nOne day somebody who, recently, who knew of that,\ndesired my heart and had known me for many years,\ncame up and said, well, you know, you're getting older,\nsaid, when you retire, you're going to run for office\nsomewhere.\nAnd I heard myself say the unthinkable.\nI said, no, I said, the dream is gone.\nI said, my childhood dream, that which I had hoped for,\nis really gone now.\nAnd it caught me off guard to hear myself say that,\nBecause over the past years, it has been dreamed out of me\nin some way or another by so many things that have happened\nand so much of the pressure that's been out there\nand the literal and things that have been in place.\nI found myself saying I wanted to go from it\nrather than toward it, but the thing that disturbed me more\nthan anything else was the feeling that I had\nthat if it could do that to a dream I'd had all my life,\nwhat is it doing to other people?\nSo I went and I read from a favorite passage of scripture and it's way too long for me\nto share with you today the whole passage, but let me just capsule it for you.\nThe story is of Eli who is the judge in Chalo, the high priest at Chalo.\nHe also was the second to the last judge before Israel had kings.\nAs a judge, as the priest, he was kind of the seat of not only government, but also the\nseat of religious influence within that place.\nHe was the kind of man who had served with distinction and was a person that people honored,\nbut he had kids who were not committed and were not called to the task.\nThey began to take power and try to seize it and use it for themselves.\nThey began to cause conflict and problems.\nthis mix add that there was a couple who wanted to have a baby. They wanted to have a boy.\nAnd so Elkina and Hannah begged the Lord to please give them a son. And Hannah said,\nif you give me a son, I'll dedicate him to the Lord. I'll always dedicate him to the\nLord. And for the Lord's service. And Samuel was born. And when Samuel was born, she did\nexactly what she said, she took him to the high place, to Eli, to be a servant there,\nand to grow up under his tutelage, to grow up under his influence, and with idealism,\nand with call, and with purpose, Samuel went to that place, and really wanted to serve.\nIt wasn't power, it was service.\nsaddest part of the scripture though is it says that in those days the voice of\nthe Lord was silent and there were no visions. It wasn't because the Lord wasn't\nspeaking, it was because nobody was listening. It wasn't because God didn't want\nto give visions, it was because no one paid attention to them. And here was\nSamuel who was in the mix, he were Eli's sons who were causing all sorts of\nproblem and he was Eli caught right in the middle of it all. And so one night\nSamuel was asleep and the Lord called him Samuel Samuel and Samuel thought it\nwas Eli so he got up and he went to Eli and he said here I am what can I do for\nyou? Eager to serve. And Eli said I didn't call you. So go back to bed and again it\nhappened and again it happened the third time that voice came and Eli and Samuel\ngot up, went to Eli and said, here I am, you called me and then Eli heard it in his\nown heart. I'm the priest. I should have known this. This should have been my first\nthought. Samuel, that's the Lord speaking to you. When you go back and lie down, if he\ncomes to you again, simply say, well, this is what he said. The Lord came and stood there\ncalling as at other times Samuel, Samuel.\nAnd then Samuel said, what Eli told him to?\nSpeak, Lord, your servant is listening.\nIn short, two things had to happen to change the path\ndown which Israel was going.\nEli, who was birded over his sons,\nknew that something had to happen with them,\nbut he hadn't been powerful enough or strong enough\nto do anything about him.\nAnd Samuel had to be inspired.\ninspired to take that idealism and those ideas and to bring them to a place where he could\ninfluence others. So when he went back to bed, Eli was essentially turning it over to Samuel.\nDon't ask me, tell the Lord you're ready to listen to him. He lay down, the Lord spoke,\nand Samuel responded, speak Lord, your servant is listening, and when he did, the Lord\nkind of unloaded at that point. The Lord spoke again. The vision was there.\nEli was judged, so were his sons. Eli was a pivotal part of this, though,\nbecause he had to inspire Samuel to do the right thing. Find the call, follow it.\nEach of you here serve people of Georgia, but I believe there's an underlying and more\nimportant call for you and for me. Instead of allowing the dream and idealism of people\nto be crushed by the atmosphere that has developed in the political arena all across the spectrum.\nWe need to rise to a level of inspiring young people to service, encouraging their idealism,\ngrooming them for service, for generations to come. We need to be a voice of inspiration that tells\nthem, have them go and say, speak, we're listening, there's something we can do, those simple words,\nSpeak, Lord, for your servant hears you.\nBecome the cry of hope for the future.\nThat's all God wants.\nHe wants to hear us, hear Him.\nHe wants us to call to Him,\nand He wants us to sit and listen when He speaks.\nIt's time for the silence to be broken.\nWe need to dream again.\nWe need to believe again.\nWe need to step up and serve again\nto offer ourselves in service again.\nNot just for the purpose of politics,\nfor offering God faithful integrity-based committed public service. If we don't, we leave the leadership\nto the sons of Eli, the ones who don't hear the voice of God. If we do, we inspire the\nSamuels to come forth. Do you know what Samuel ended up doing? He was the last judge,\nthe last one to serve in that position. He anointed two kings of Israel.\nHe's considered the first of the prophets. He was a priest. He's remembered for his prayers,\nand he laid the groundwork for the later priesthood. What would have happened if he hadn't been\ninspired? What if his dream had been drained out of him? What if he had lost that passion,\nthat desire to do something and to listen? But Eli inspired him. Speak, Lord, your servant is\nhearing. That's what God is calling out from our midst. He's calling you whom we\nhave placed in service to always consider your place in inspiring others to\nserve. Never doing anything or conducting yourselves in any manner that would\ndestroy the innocence of young people or run them from the dream of public\nservice. We need them on the local, state, federal, international level serving.\nNo matter what they're doing, they can serve and you inspire us because of the\nquality of your lives because of the wisdom and because of your dedication here.\nMy dad was fond of an old poem and I'll share it with you. An old man going alone highway\ncame at evening cold and gray to a chasm vast deep and wide, through which was flowing a sullen tide.\nThe old man crossed in the twilight. Damn, the sullen stream had no fear for him,\nbut he turned when safe on the other side and built a bridge to span the tide.\nOh, man, set a fellow pilgrim near, you're wasting your strength building here.\nYour journey will end with the ending day, you'll never pass again this way.\nYou've crossed the chasm deep and wide.\nWhy are you building this bridge at evening tide?\"\nThe builder lifted his old grey head, good friend in the path I've come, he said.\nTheir followeth after me today, a youth whose feet must pass this way.\nThis chasm which has been not to me, to the fair-haired youth may a pitfall be.\ntoo must cross in the twilight, damn good friend, and building the bridge for him.\nYou know, your highest calling of service is more than planning budgets and passing laws\nand building infrastructure.\nYou're building a spiritual infrastructure, a bridge that you can entice, inspire a new\ngeneration of people to rise up and do the right thing and do it well just like you have.\nbe the kind of people that will serve. That bridge will take them across the\ncanyons of hopelessness and anger and truly help them dream of a stronger\nbetter tomorrow and make it happen. As for me, I want my dream and passion back. I'm\nlistening. Who knows what God may call me to do to fulfill the dream at some\npoint, if not, I may be called to encourage and pave the path for others. With\na simple words, remember to say, speak word. Your servant is listening. Speak\nLord, your servant, your servants are listening. Amen. Will you battle with me as we pray?\nSpirit of God, in a moment that honors us to be able to serve, we pray the most important\nprayer of all, thy will be done. On earth as it is in heaven, through my life, as\nthrough others, in the government of this community, of this state, of this\nnation, of this world, and in it all will you plant the seed, speak the voice,\nbreak the silence, and inspire others to come toward this and to see the\nability of the service and to follow the good examples that we set in your precious\nname we offer our prayer. We join me for the Pledge of Allegiance. I pledge\nallegiance to the flag of the United States of America and to the Republic for\nwhich it stands. One nation under God, indivisible, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nChair recognizes the distinguished chairman of the Committee on Information and Audits\nChairman Hogan.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the Journal of Apprecious Legislative\nDay and found it to be correct.\nAnd furthermore, Mr. Speaker, I fear the day that technology will suppress our human interaction.\nThe world will have a generation of idiots, Albert Einstein.\nAnd the majority will want to thank you for the scenery and everything, and a great\nseat that I have up here.\nSo thank you, Mr. Speaker.\nYou keep the majority whip on edge when you're giving your report.\nChairman Hogue and the Chair of the Committee on Information and Audits reports that the\njournal, the previous legislative day, has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe Chair here is none in the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, 159, who's following me establishes the order of business that are in first part\nof the period unanimous consent, introduction of bills and resolutions, first reading\nand reference of house bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, third reading and passage of uncontested local bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day. The chair here's none in the resolution is adopted. First reading of bills\nand resolutions, the clerk will read.\nVerse 17, I'm Scott of the 76 Myriot, 135th, Hugh Glee, the 136th, Thomas of the 39th\nKendrick of the 93rd, will be tunneled, act of men, title 35, an article 2 of chapter\n21 and title 50, the official go to Georgia annotated relating to law enforcement officers.\nJudiciary non-civil House Bill E. T.\nByron of Scott of the 76th Thomas of 39th\nand McLeod of the 105th Bill B.\nTodd and Act to men title 35 with the physical\nto Georgia annotated relating a law enforcement\nofficers and agencies Judiciary non-civil House\nBill 242 byron of Chocus 138th and year to\nthe 150th second Bill B.\nTodd and Act to men and Act providing a new charter\nfor the city of America's Infra-Governmental\ncoordination House Bill 243 byron of Thomas\ntwenty-first cars in the forty-six. Smith at one thirty-third in Wasper in the\nhundred and forty-first. Bill B. Todd an act to men are two chapter thirty-six\nand title thirty-six of the physical to Georgia annotated. Related annexation.\nGovernmental affairs bill two forty-four by reps and a pogan of the hundred\nseventy-nine the low to the hundred sixty-seven saints of the hundred and\neighty-eighth. Meeks of the hundred seventy-eighth. Williams the hundred and forty-eighth.\nBill B. Todd an act to men. Code section thirty-eight eight eight point three of\nthe official code of Georgia annotated relating to funding the services.\nGovernmental affairs House bill 245 I represent of a lehu to the 175th gains the hundred and 17th Cooper the 43rd newton\n123rd and homes of the hundred twenty ninth Bill B. Todd and act to amend chapter 35 of a title 43 the physical to Georgia\nAntater laid up a tie a treat practice health and human services\n246 by represent Watson the hundred and seventy-second corporate of the hundred seventy-fourth riddley the six math is the hundred and forty-fourth and mop to out of the 17th\nwill be tunneled act to men chapter 5 or title 40, the fiscal to Georgia\nAnnotated Related and Drivers Licenses. Motor Vehicles\nHospital 247 by Representative Carson, the 46, lumps into the 12th, Collins, the\n68th, Petrie, the 166th, Hitchens, Throne, 61st, and others will be\ntunneled act to men chapter 6, the title 40, the fiscal to Georgia Annotated\nRelated and Uniform, Rules of the Road. Public Safety and Homeland Security\ndemocrats fit,\nThe committee thought it would be\n30 second Corp integral.\nVidansky the Continue\nand college 68 director\nBill Bibitat open Section 40\n14 18 the officials position\non정 Enterty relating\nenforcement of speed limit in\nschools zero.\nPublic safety and home land\nin a pile of 32nd Corp of the 174th,\nBill B. Todd will act to amend chapter 80,\ntitle 40, the fiscal to Georgia,\nand Teddy relaying equipment and inspection\nof motor vehicles.\nMotor vehicles.\nNow it's bill 250 by Representative Erhardt of the 36th,\nCarson, the 46 Parsons of the 44th,\nand Celestial of the 35th,\nBill B. Todd will act to amend Article 10\nand chapter 2, a title 21,\nthe fiscal to Georgia, and Teddy relaying absentee voting.\nSpecial Committee on Election Integrity House bill 251 where represent Glanton 75th\nfor now the 77th Neal the 74th Bayesmore the 63rd and Scofield the 60th of\nBill being Todd O'Nack to amend the NAC providing for the composition and manner\nof selection of the Board of Education of Clayton County Intergovernmental\nCoordination House bill 252 by resident of Scott of the 76th Jackson the 64th\nfor now the 77th Williams 168th and Davis the 87th Bill being Todd O'Nack to\nmen chapter seven and title 48. The fish go to Georgia\nannotated relating the income taxes. Ways and means about\n253 by resident of homes that 129th, Bill B. Todd\nand act to create the Jones County public facilities\nauthority.\nIntergovernmental coordination of about 254 by resident\nalums to the 12th Williamson, the 115 Taylor, the 173rd\nwho the 136 in Tarvern in the second, there'll be\nTodd on active men article on chapter 23, a title 33, the\nfish go to Georgia and Tadea relating the licensing of agents. Insurance.\n255 by verse and a whole come to the 81st of station 104th. Hitchens on 61st Oliver\nthe 82nd, Hugh Lee the 136th and others. They'll be titled an act to men\nchapter 24, a title 15 of the fish go to Georgia and Tadea relating to\nsexual assault protocol. Judiciary non civil.\n256 by reps. Then for now, the 77th, Mitchell, the 88th,\nWelcome to the 81st Bentley the 139 more than 95th and others will be taught an act of men part seven of article seven to chapter three a\nTitle 20 of the fish go to Georgia annotated relating to hope scholarships and grants\nHigher education\nHospital 257 by Representative Sessler to 35th\nThey'll be taught an act of men article one of chapter five a title 49 in the physical to Georgia annotated relating the children and youth services\nHealth and human services\n258 by resident of Saints of the 180th,\nwant to highlight the 17th camp of the 131st,\nportrayed on the 176th and Clark on the 147th,\nwill be tied on active men,\nchapter 6 and title 16,\nthe official go to Georgia,\nannotated relating sexual offenses.\nJudiciary non civil hospital 259 by resident for now,\nthe 77, Hugley of the 136,\nwelcome to the 81st,\nBentley the 139,\nScofield, the 60th and others,\nwill be tied on active men,\npart 7,\non Argel 7, chapter 3, you titled 20,\nthe Fiscal of Georgia Annotated Relating,\nHope Scholarships and Grants.\nHigher Education, House Bill 260,\nby represent Jones, the 25th of Building,\ntitle and act of men, chapter 1 and title 10\nof the Fiscal of Georgia Annotated Relating,\nthe Selling and other trade practices.\nJudiciary, House Bill 261, by represent Jones,\nthe 25th, Petrie, the 166th,\nThe six hatched into the 150th and gravely, the 67th,\nBill B. Todd and Active Menchapter A to Title 31\nof the fish go to Georgia,\nand Tateau relating to care and protection\nof indigent elderly patients.\nHuman relations and aging.\nHouse Bill 262 by resident Kenner,\nthe 102nd Clark of the 100th and 8th,\none of the 89th.\nCarter the 92nd Williams, Wilson of the 80th and others\nof Bill B. Todd and Active Menchapter 2,\nand Title 20 of the fish go to Georgia,\nand Tateau relating to elementary and secondary education.\nEducation.\nHospital 263 by reps of Skoggins,\nthe 14th Campbell of 15th,\ngovernor of the 19th, Williams,\nthe 145th and Campbell is 171st.\nBill Bitton, an act of men,\ncode section 47, 11, 71 of the fish,\ngo to Georgia, Antidio,\nwilling the amount of retirement benefits for judges.\nJudiciary.\nHouse bill 264 by reps of Hutchinson,\nthe 100th and 7th park of the 101st,\nLopez, the 86, went to the 89th,\nScottfield the 60th and others will be title an act to amend Article 5 chapter 11\nand title 16 chapter 5 and title 17 chapter 1 and title 35 chapter 4 and title 42\nthe fiscal to Georgia and Teddy relating offenses involving illegal aliens.\nJudiciary non-civil House of Resolution 76 by reps of Hutchinson on\nhundred and seventh Park on the 101st Lopez of the 86 one of the 89th\nMitchell the 88th and others resolution encouraging the replacement of the\nterm Illegal Alien. Judiciary non-civil. House Resolution 77 by\nReps. Prince of the 127th Nelson 125th Newton 23rd Law of the\n120th Second and Funding 121st Resolution supporting the\ncreation of a state veteran cemetery in Augusta Richmond County\nJordan. Defense and veterans affairs. House Resolution by\nReps. Scott of the 76. Mitchell the 88th Smirrey 135th. Williams\n168th, Hugley of the 136th and others, a resolution declaring racism, a public health crisis in\nGeorgia. Human relations in aging. Household, 265 by resident of 930th, Williamson of the 115th.\ntight\nI apologize\npossible to 65-visits of 9 to 130\nwith the beloved center of\n15-\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse bill 211 by Representative Williams of the 148, the bill is provided a new charter for the town of Arabi.\nHouse bill 212 by Representative Carpenter of the 4th Collins of the 68th, the frustration of the 104th gamble of the 15th in Carson of the 46.\nbill related to persons authorized to issue order to not not to resuscitate House bill 213 by represent Ruppeshow the 48th\nbase more of the 63rds go field of the 60th Jackson of the 64th hops and the 123rd\nbill relating to definitions relative to controlled substances\nHouse bill 214 by represent Ruppeshow the 48th base more of the 63rd cowshow the 50th\nto go field of the 60th hops and the 150th are bill related to public assistance House bill 215 by represent Ruppeshow the 48th\nLet's go field of the 60th Jackson of the 64th base, one of the 63rd hops, one of the 150th and\nothers, a bill relating to medical assistance, House Bill 216, by Representative Astration of the\n104th, a bill relating to general provisions regarding parent and child relationship.\nHouse Bill 217, by Representative Rupp, show the 48th base, one of the 63rd,\nLouis Ward of the 109th, let's go field of the 60th Jackson of the 64th and\nothers, a bill relating to the Department of Community Health.\nHouse Bill 218, by Representative Ballinger of the 23rd, Powell of the 32nd,\nAgain, Chaspers of the 11th, Parkle of the 155th.\nTaylor of the 173rd, a bill relating to having or carrying handguns, long guns, or other weapons.\nHouse bill 219, by representative Rubber show of the 48th Jackson of the 64th.\nGo field of the 68th phase, more of the 63rd, Kendrick of the 93rd and\nothers, a bill relating to general provisions, a bill to the general assembly.\nHouse bill 220, by representative Benton of the 31st Harvon of the 2nd,\nRidley of the 6th Mathis of the 144th, a bill relating to the Stone Mountain Memorial.\nAssociation House Bill 221 by Representative Benton of the 31st of Bill relating to zoning procedures House Bill 222 by Representative Benton of the 31st of Bill to repeal and act creating a new charter for the town of Pendergrass House Bill 223 by Representative Benton of the 31st of Bill to amend the next pre Board of Elections and Registration for Jackson County.\nHouse Bill 224 by Representative Basemore of the 63rd Hopson of the 153rd, Mitchell of the 88th\nBennett of the 94th, body of the 62nd and others, a bill relating to regulation of rate\nrate underwriting rules and related organizations, House Bill 225 by Representative Prince of the 127th\nand the bill to provide a new charter for the City of Rennes, House Bill 226 by Representative\nKinner of the 102nd Estration of the 104th, 5th and 18th, Richard the 97th, Stevens of the 164th\nand others, a bill relating to sales and use taxes, House Bill 227 by Representative Hawkins of the 27th\nwho have the 30th bar of the 103rd in Dubnick of the 29th,\nthe bill will lead to elections and primaries.\nHouse Bill C28, by represent Byrd of the 20th.\nHowell of the 32nd, Kelly of the 16th,\nWilliams of the 115th, probably the 67th,\nand others, the bill will lead into presentation\nof identification to poll workers.\nHouse Bill C29, by represent Carpenter of the 4th,\nKelly of the 16th, Jones of the 25th,\nGaines of the 170th, Kendrick of the 93rd,\na bill relating to the Fair Business Prices Act of 1975.\nHouse Bill C-30 by Rep. Scott Field of the 60th, Clark of the 108th, Beverly of the 143rd.\nHughley of the 136th, Hopson of the 153rd, and others of Bill relating to definitions relative to fair housing.\nHouse Bill C-31 by Rep. Gaines of the 117th, Ballinger of the 23rd.\nWin of the 89th, with hour of the 119th, 518th, and others of Bill relating to stalking and granting a relief by superior courts.\nHouse Bill C-32 by Rep. Jackson of the 64th, Evans of the 57th, Wilson of the 80th.\nShannon of the 84th, Taylor of the 91st, and others of Bill relating to pretrial proceedings.\nHouse Bill 233 by reps and Beverly of the hundred and forty third boaty of the sixty second spirited the hundred and thirty fifths go field of the sixtieth main or the fifty sixth and others\nThe bill relating to searches with warrants house bill 234 by reps of Hawkins of the twenty seventh lot of the hundred and twenty second spirited the hundred and thirty fifths\ncenter of the 8th, Newton of the 123rd and others,\na bill relating to insurance.\nHouse bill 235, by brems, a weight of the 9th,\nlimit of the 99th gamble of the 15th,\nwith hour of the 119th, by download of the 26th,\na bill relating to revenue and taxation.\nHouse bill 236, by brems, a meal of the 74th,\ntankers leave the 160th,\nyou leave the 136th, Douglas of the 78th,\nTaylor of the 173rd, and others,\na bill relating to granting a relief\nby superior courts.\nHouse bill 237, by brems, a Hutchinson of the 107th,\nMitchell of the 88th, Scott of the 76th,\nGofield of the 60th, Kenner to the 102nd, and others.\nA bill relating to the state's flag seal and other symbols.\nHouse bill 238 by reps of Hutchinson of the 107th.\nMitchell of the 88th, Scott of the 76th.\nGofield of the 60th, Kenner to the 102nd, and others.\nA bill relating to the state flag seal and other symbols.\nHouse bill 239 by reps of Hutchinson of the 107th.\nAllen of the 40th, Gofield of the 68th,\nBeverly of the 143rd, Mitchell of the 106th, and others.\nBill relating to general provisions relative\nto governing and regulation of mental health.\nHouse bill 240 by reps of the Hutchinson and the hundred and seven Williams of the hundred and sixty eight\nSpire the hundred and thirty-fifth by the four hundred and forty-third Scott and the seventy-six and others available relating to\nHolidays and disturbances House bill two forty-one by reps of gamble at the fifteen thums of the twelve Williams of the hundred and forty-eight\nGanges of the hundred and seventeen Smith of the hundred and thirty-third\nAbel relating to property insurance contract right requirements rules regulations and exemptions\nSenate bill six by senator Albert the fifty six have set their the fifty second models of the fifty-third\nto the 51st, Strickland of the 17th and others,\navailable relating to fiscal bills.\nSenate Bill 9 by Senator Anderson of the 24th burns\nof the 23rd Strickland of the 17th Miller of the 49th\nmodels of the 53rd and others,\nbill to create a new judicial circuit\nfor the state of Georgia.\nClear second readers.\nReports of standing committees, the clerk will read.\nRepresentative Robbertickey, the 140th District Chairman of the Committee on Agriculture\nand Consumer Affairs submitted the following report.\nAnd to speak, your committee on Agriculture and Consumer Affairs is in a consideration\nfollowing bill of the House.\nAnd it's a struck to me to report the same back-to-last filing recommendation.\nHouse Bill 153 do pass, respectfully submitted, Representative Robbertickey, the 140th\ndistrict chairman representative heath carc on the 147th district chairman on committee on defense and veteran affairs has\nbeen at the following report but speaker committee on defense and veteran affairs has said on the consideration following bills of the house\ninstructed me to report the same back to the house following recommendations house bill 105 new pass house bill 106 to pass by committee substitute\nrespectfully submitted, Representative Heath Clark\nand the 147th District Chairman.\nRepresentative Stevenson, 64th District Chairman\nof Committee and Economic Development and Tourism\nsubmitted the following report.\nMr. Speaker, your committee on Economic Development\nand Tourism has had a consideration\nof following Bill of the House.\nThis is Dr. Media reports the same back to the House\nof the following recommendation.\nHouse Bill 86, do pass by committee substitute,\nrespectfully submitted,\nRepresentative Matthew Gamble of the 15th District Vice Chairman.\nRepresentative Eddie Lumpson of the 12th District Chairman on Committee on Insurance has submitted a following report to speak to your committee on insurance\nand to consideration the following bill of the house.\nThis is structured to me to report the same back to the house with the following recommendation House Bill 205,\nDuke Pass, respectfully submitted, Representative Eddie Lumpson of the 12th District Chairman.\nRepresentative Jan Takersley on the 60th District Chairman of Committee on Intergovernment Coordination Local submitted the following report\nI'm speaking your committee on Intergovernment Coordination Locals and a consideration\nFollowing bills of the House and instructing me to report the same back to the House following recommendations\nHouse Bill 103 do pass House Bill 157 do pass House Bill 172 do pass House Bill 196 do pass House Bill 206 do pass respectfully submitted representative Tancersley\nof the 160th District Chairman.\nThat completes the reading of the Report to Standing Committees.\nWe have a local calendar today, third reading, and\npassage of uncontested local bills. For what purpose does the speaker\npro-tem rise?\nI move to recommit house. Make a motion. Yes, make a motion, sir.\nAnd the motion is. I move to recommit house bill 206 on the local calendar back to\nintergovernmental coordinates. Speaker pro-tem has moved that house bill 206 be\ncommitted to the Intergovernmental\nCoordination Committee. Is there\nany objection hearing none? It is\nso ordered. If there is no\nobjection, we will vote on the\nlocal calendar minus House Bill\n206 as a whole with a recorded\nvote hearing none. It is so\nordered. The clerk will read the\nlocal calendar House Bill 103\nour represent of Williams on 45th Baldwin County House bill 157 by\nrepresent Irwin the 28th town amount area House bill 172 by\nrepresent Dickey the 140th City of College House bill 196 by\nrepresent of Green of the 1951st Terrell County.\nIs there any objection to the previous question being ordered on the\nlocal calendar? The chair here is none the previous question is ordered. Is\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nBill's.\nThe chair here is none the report of the committee.\nIs agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar will vote aye.\nThose opposed will vote no and the clerk will unlock the machine.\nhaveosh\nhaveosh\nhaveosh\nhaveosh\nhaveosh\nhaveosh\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nwitnessed\nhave all members\nsentenced\nHave all members voted?\nIf so, the clerk will lock the machines.\nOn the passage of the bills on the local calendar, the eyes are 145, the nasal zero, the bills\non the local calendar without House Bill 206 are therefore passed, having received a requisite\nconstitutional majority.\nWe're going on now to morning orders.\nIf you have signed up for a morning order, please make your way to the front of the chamber.\nWe're going to go through them fairly quickly.\nMembers will limit their remarks to not more than two minutes each.\nChair recognizes.\nAll right, let's have a little order now for the morning orders.\nChair recognizes representative Mac Jackson for a morning order.\nThank you, Speaker.\nToday I rise for a black history moment.\nWillie Duckworth was born in Sandersville, Georgia.\nHe was working in a sawmill when he was drafted during World War II.\nHe was assigned to a provisional training center at Fort Sloker, New York.\nAs a young soldier at Fort Slocum in May 1944,\nprivate ductwork noticed that his unit was dragging\na feet while marching.\nTo help them up, he began calling the chant\nto help the man keep in step.\nThe chant was an instant hit on base.\nThe next year, the Army work were recording engineers\nto make a V-disk, a special recording distributed\nduring World War II to aid morale.\nIt was known as the Duckworth chant on bass,\nbut it was recorded as sound off.\nThe original cadence had a lead chant and response.\nSound off, one, two, sound off, three, four.\nWith these words and others,\nwillily Duckworth, unknowingly,\ncemented his plays in US military history.\nMr. Duckworth said the chant came from calling hogs back home.\nThank you.\nI yield a well.\nChair recognizes for a morning order.\nChairman Bershitt.\nChairman Corbett.\nRepresentative LeHood.\nAnd representative Sharper.\nThank you Mr. Speaker and thank you members of the House. I'm here today with our\nlocal delegation from Valdosta Lounds County. There's Dexter and we just want\nto recognize the fact that we were unable to have the Lounds County Valdosta\nbirds supper as we have done for the past 50 years or more at the at the depot\nbut instead gift boxes have been distributed to your offices. Your admin\nassistance have been very helpful in getting those to you. So we just want to thank you.\nWe want to thank about Austin Laos County for coming up today and next time you drive\nto Florida, you'll probably drive right through and stop and buy something and say hello.\nThank you very much.\nChair recognizes representative Bennett for a morning order.\nThank you, Mr. Speaker.\nI was born by the river in a little tent and just like that river, I've been running ever since.\nIt's been a long, long time running, and I know a change has come.\nOh, yes, it is.\nIf Dexter were here, I would have him sing that, Mr. Speaker.\nGood morning, members of the House and Mr. Speaker.\nThis morning, I rise for my Black History moment to recognize two of my own\nsorority sisters who have earned honors of distinction and are living the\nthe change that Sam Cook sang about back in the 60s.\nNow serving as the highest ranking female\nin the House Minority Caucus,\nhaving served as the Minority Whip,\nand now as the longest serving African-American female\nin the house today, I rise to recognize\nRepresentative Carolyn Hugley\nas one of my black history moment honorees.\nIt's been a long, long time coming, and I know my second change agent was inaugurated\non January 20th, Vice President Kamala Harris, who was born to immigrant parents, graduated\nfrom our alma mater, Howard University.\nJoin Alpha, Kappa Alpha and from there\nby way of the District Attorney's Office,\nthe Attorney General's Office in California\nand the United States Senate\nis one of American she-roads as she serves\nas the 49th Vice President of the United States of America.\nWon't you join me today and recognize\nin my Black History Moments she-roads\nRepresentative Karen Hughgley, Carolyn Hughgley, and our Vice President, Kamala Harris.\nThank you, Mr. Speaker.\nChair recognizes Representative Lot for a morning order.\nGood morning, colleagues.\nThis morning I rise to give thanks to the law enforcement officers throughout our state.\nI know that many of us remember between May and November of last year, Atlanta had an increased need because of the protest that occurred.\nHold this for a minute, Representative.\nI can't even hear you up here.\nThis house will be at order.\nIf you're busy and don't have time to listen, then please step out into the any room or the hallway.\nLady May proceed.\nMr. Speaker, I was giving just a reminder here that it was May through November of last\nyear that our law enforcement officers around the state of Georgia were called to come\nto the state capital here and to help with protests, some which turned violent, including\nthe fact that we had the Molotov cocktails thrown into our own Georgia state patrol headquarters.\nAnd so I rise to say thank you and that we recognize here the importance of the role\nthat they play throughout our state and protecting us.\nI also, as a reminder, to some and to inform some of our new\nmembers, it was in 2018 that Georgia passed one of our bills\nthat created the Office of Public Safety Support.\nThat office was a unanimous vote here in the House.\nAnd that office is a peer-driven program to assist officers\nwith mental health, any mental health needs.\nbecause of the role that they play in protecting\nand sometimes they are not treated in the kindest of ways\nand I know that there's an effect on that.\nSo there's a program here now in the state,\nthe Office of Public Safety Support,\nit's a division of public safety,\nit's available to all law enforcement\nand all first responders in Georgia,\nincluding our EMTs and our dispatchers\nand our firefighters,\nso that if they have a need,\nthey can call on the help of their peers\nto help get them through these times of trouble.\nSo again, as our governor said in his state of the state,\nhe said, Georgia backs the blue.\nAnd Georgia does back the blue,\nand I'd like to thank all of our law enforcement officers\nthroughout the state of Georgia.\nChair recognizes representative Maynard for a morning order.\nThank you, Speaker Rothsen, for the opportunity to take a moment to recognize survivors of gun violence.\nThis week is National Gun Violence Survivors Week, which is intended to raise awareness\nfor common sense gun safety measures that save lives.\nAn honor of Officer Brian Sicknick, who was killed senselessly at the State Capitol, is\nlying in rest in the U.S. Rotunda this morning until his body is taken to Arlington National\nCemetery.\nSenseless violence is not tolerated in Georgia or America.\nI encourage each of you to visit the moments that survive digital storytelling website\nwhere Americans across the country share details of their gun violence experiences.\nThe story shared are from those affected by gun violence through homicides, suicides,\ndomestic violence, and stalking crimes involving guns, unintentional shootings, and even the\nthreats of being harmed by a gun.\nSurvivors include caregivers for those wounded, those injured by guns, loved ones who lost\nsomeone from gun suicide, or those that just witnessed gun violence, who may be affected\nby a lifetime of post-traumatic stress, survivor-suffer emotional, medical, financial, and legal\nhardship for themselves and their communities.\nI encourage each of you to visit the Everytown for Gun Safety website, which is the largest\ngun violence prevention organization in the country.\nTheir mission is to educate and help us make sound policies.\nweek increase awareness by doing a hashtag GV Survivors Week. Thank you\nSpeaker Austin.\nIf you have signed up for an announcement, be making your way to the front of the chamber.\nClerk will read the caption to a group of privileged resolutions.\nCongratulations to the Fannie County High School football team for winning the 7A Region\nchampionship, commending Taiwan for its relationship with the United States and\nState of Georgia, recognizing commending merit Johnson III, commending and\ncongratulating INES S. Long, honoring the life and memory of Martha Gleason, Brian\nLuton, honoring the life and memory of Mrs. Willamina Purcell and Goldston, and for\nother purposes that completes the reading of the privilege resolution.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none and the resolutions are adopted.\nWe're going out now to announcements, so please give attention.\nPlease give attention to announcements.\nChair recognizes the chair of the Natural Resources and Environment Committee Chairman\nLynn Smith for an announcement.\nGood morning, everyone.\nWe have our natural resource and environmental organization\nmeeting tomorrow morning in presentations from DNR and EPD.\nThe room is still 606 CLOB, but committee members\npay attention if you cannot be there.\nYou can attend through the Zoom meeting,\nbut you need to contact our office staff.\nThank you.\nChair recognizes the chair of the State Properties\ncommittee chairman green for an announcement thank you miss speaker members of the state\nproperty committee will meet today at 3 30 in room 403 that's it 3 30 in room 403 thank\nyou miss speaker chair recognizes chairman Watson for an announcement thank you miss speaker\nThe rule caucus will meet today at 12 o'clock in the sloppy Floyd room upstairs.\nWe've got Georgia Farm Bureau as our host today and Tom McCall will be joining us.\nSo if you'd like to see Tom come say hello and his new rule is president of Georgia Farm Bureau.\nThank you.\nChair recognizes the chair of the Game Fish and Parks Committee Chairman Rhodes for an announcement.\nThank you, Mr. Speaker, game-fishing parks will meet today 3.30 in 4.06, 4.06 at 3.30, thank you.\nChair recognizes the Chair of the House Judiciary Committee, Chairman F. Strachan for an announcement.\nThank you, Mr. Speaker.\nThe House Judiciary Committee will meet room 132 today at 1.30, we have four bills on the calendar, please be on time.\nThank you.\nWe are recognized as representative Doreen Carter for an announcement.\nGood morning.\nThank you.\nJust want to remind everyone to wear red tomorrow for Go Red for women, thank you.\nChair recognizes representative Jason Ridley for an announcement.\nThank you, Mr. Speaker.\nRegulated Industries, occupational and license and subcommittee have a meet to that to\na clock and CLB 515.\nPack your lunch.\nWe're going to be a little while.\nThank you, Mr. Speaker.\nChair recognizes representative Earhart for an announcement.\nThank you, Mr. Speaker.\nThe House Higher Education Committee will meet today at 1 o'clock in the 606 in the\nCLOB.\nWe have one bill on the agenda, HB 67, so that's 1 o'clock in 606.\nThank you.\nChair recognizes the chair of the Banks and Banking Committee, Chairman Morris for an announcement.\nThank you, Mr. Speaker.\nFor members of the Banks and Banking Committee, we will have a meeting today in a hearing\non a bill at 12.30 in room 341 right down the hall on the third floor that's 12.30 and we will\nhave a hearing thank you chair recognizes the chair of the industry and labor committee chairman\nworkhyes are for an announcement thank you mr. speaker the industry and labor will meet today at\nthree o'clock and the CLOB five o'clock some of your requests today zoom option that is provided\nin an email this morning. Thank you. Chair recognizes the chair of the\ngovernmental affairs committee chairman Taylor for an announcement. Thank you\nMr. Speaker. The governmental affairs committee will meet at two o'clock two o'clock\nin room 606 CLOB. Thank you. Chair recognizes the chair of the human\nrelations and aging committee chairman P3 for an announcement. Thank you\nMr. Speaker, to all the members of Human Relations and Aging, we'll have a meeting today at\n3 o'clock in room 341 at the Capitol. We do have a presentation from Health Care Facility\nRegulation Division that I think will be most helpful to our members. See you there.\nAnd there's a Zoom option as well.\nappears to complete our announcements and we have no birthdays today. Chair recognizes\nthe chair of the majority leader of the House for a motion. Thank you Ms. Speaker.\nMs. Speaker, I'm moved at this House stand adjourned until 10 a.m. Thursday, February\nthe 4th 2021.\nMajority leader has moved that this house be adjourned until 10 a.m. on Thursday, February\n4th. All those in favor of the motion will say aye. Those opposed will say no. The\neyes have it. This house will be adjourned until Thursday at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T15:43:14.136059+00:00"
}