{
  "video_id": "R73FdfRrQnY",
  "url": "https://www.youtube.com/watch?v=R73FdfRrQnY",
  "title": "Lawmakers want to better track  spending in Georgia state agencies",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia legislature session transcript:\n\n**Overview:** The session focused on the potential reintroduction of zero-based budgeting in Georgia state agencies, as well as ongoing challenges with the state's defective foster care contracts and funding for the arts.\n\n**Key Actions:** No bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Discussion of the pros and cons of zero-based budgeting, with Republican Senator John Albers arguing it would lead to smarter government spending, while Democratic Representative Mary Margaret Oliver was skeptical it would make a significant difference.\n- Concerns raised by Representative Oliver about an $86 million deficit in defective foster care spending, and the need to restore contracts to provide services for abused and traumatized children.\n- Representative Oliver's comments about Georgia being 50th in arts funding, arguing that this is not fiscally conservative.\n\n**Votes:** No recorded votes were mentioned.\n\n**Attendance:** No quorum notes were provided.\n\n**Adjournment:** The transcript does not indicate when the session adjourned or when the next session would be.",
  "transcript": "Some Republican lawmakers are weighing a\ndifferent approach to how the state\nspends taxpayer dollars. The proposal\nwould require state agencies to justify\nevery dollar they spend in every budget\ncycle. We're going to discuss the pros\nand cons with our guests, Republican\nSenator John Alers of Roswell. He is\nchairman of the Senate Public Safety\nCommittee and vice chairman of the\nSenate Finance Committee. Also here is\nDemocratic Representative Mary Margaret\nOliver of Decatur. Her House committees\ninclude appropriations, governmental\naffairs, judiciary, and judiciary\njuvenile. Welcome to lawmakers this\nsession. We love having you on all the\ntime. Thank you. So, we're going to\nstart with this zerobased budgeting for\nviewers who are hearing this for the\nfirst time. What does zerobased\nbudgeting mean and what does it mean\njust in practice too?\n>> Certainly. Well, zerobased budgeting is\nwhat we all do at home each year. You\nknow, we sit around that kitchen table\nas typically as a family and you budget.\nYou don't just take what I had last year\nand add a little bit or subtract a\nlittle depend on what's happening in the\nworld. You look at what your priorities\nare and you make sure you're building\nthem accordingly and things change in\nour lives just like they do in our\nbusinesses. Uh businesses have been\ndoing this for a very long time and it\nmakes sure that we're doing a very\nproactive approach of doing the right\nthing with taxpayer dollars because here\nin Georgia, we don't have any money. We\nhave the money from our taxpayers. We\nwant to be really good financial\nstewards of those dollars.\n>> And you said Georgia used to do this.\n>> We did. We had a bill that uh expired.\nIt was a run for 10 years and it ended\njust a few years ago. Uh it worked well\nand we want to make sure we put that\nsame examination back on those dollars.\nUh and working uh as one of the most\nfiscally responsible states, we want to\nmake sure we stay there.\n>> Okay. Representative Mary Margaret\nOliver, you you were here through that\nbefore and after. Okay. Do we need\nzerobased budgeting?\n>> We did have it. Most states do have it\nin one form or another. As a pragmatic\nmatter, I think we do look at the budget\nfrom the get-go every year. I've been on\nthe appropriations committee for a long\ntime. I went and looked at OPB's website\nas to how they were reporting on their\nzerobased budgeting when the bill was in\neffect for its 10 years. There were\n100page reports after 100page reports.\nDid anybody ever read those reports? And\ncan you prove to me that that mechanism\nwas effective? Has it really changed\nmuch in other states? Would it change\nmuch here? I'm pretty sure I would have\nvoted for it at the time, but let's look\nat this this bill that has a good label\nto it, but I just don't know if it's\nchanged that much. If I were in charge\nof changing the budget process, I would\napproach things differently.\n>> Okay. Chairman Alers, you say this\napproach cuts waste. Can you give us a\nconcrete example of how that happens?\n>> Absolutely. It's not really just about a\nreport. It's about as we build the\nbudgets every year, as we work together,\nyou don't want to just take what we did\nlast year and say, \"Hey, the budget's up\na few percent or down a few percent.\"\nBecause things are changing. So, we want\nto look at that is the staffing ratio\nright as an example for uh an area where\nwe're serving constituents. Are we\nimplementing tools like artificial\nintelligence or other technology? Are we\ndoing things smarter and better uh to\nmake sure we're utilizing those dollars\nright? and and contracts change and\ntimes change and we always want to make\nsure we're laser focused on that. We\nhave a great state. In fact, fiscal\nresponsibility has always been our\nmantra and that's why we have a balanced\nbudget every year and we do so well, but\nwe need to continue to focus on it and\nthat's our job as legislators.\n>> Okay. Representative Oliver, I know you\nwant to talk about some other things so\nI want to get those in. You want to talk\nabout the crisis with defax foster care\ncontracts. There's a shortfall there,\ntoo. There's an $86 million deficit in\ndefect spending for abused and\ntraumatized children who've been taken\naway from their families, which is a big\ndeal. When the state of Georgia takes a\nchild away from a family, the law, it's\nconstitutional right they're accepting\nfrom the family. And the law says you\nhave to provide services to that family\nto reunite the family, treat the family,\nor find a permanent placement.\ncancelling contracts that provide over\n28,000 services for these 10,000\nchildren, most of which are court\nordered, is a real problem. I think it's\na crisis. And the nonprofit community\nthat has provided most of these\nplacements and services, can't afford to\nhave their budget slashed without or\nwith 10 days notice um and stay in\nbusiness. I think it's an emergency that\nI've asked the governor to use emergency\nfunds to restore the contracts.\n>> And what are you what are you hearing?\n>> Not hearing much. I know the state's\ngoing to do something. I know we're\ngoing to do something, but these\ncontracts are my top priority. We also\nneed an audit. If you we've been through\nthis will be the fourth our supplemental\nbudget and our fiscal year 27 budget.\nThis will be the four budget cycles\nwhere we've run multi-million dollar now\n$86 million deficits and defect\nspending. That's not right. We've got to\nfix this problem and serve these\nchildren as the law requires us to.\n>> Okay, we're going to keep up with that.\nI want to get back to your zerobased\nbudgeting. You say that it will lead to\nsmarter government, not just smarter uh\nsmaller government. Explain that a\nlittle bit.\n>> Absolutely. We've got a growing\npopulation in Georgia, which is\nwonderful. People have moved here from\nall over the country. Although I always\nremind them, don't vote in the problems\nyou just escaped from. But why they're\nhere, what we want to do is make sure\nthat as we need more services, we need\nroads, we need bridges. Unfortunately,\nwe need things like prisons and we need\npublic safety and we need all these\nother things that we're doing it right.\nBecause it's not just throwing a body or\na dollar at it. It's doing things smart\nand better than we did in the past.\nThink about 20, 30 years ago, how we\nused to work versus the way we do work\nnow. And techn is evolving so fast that\nwe want to harness all those things and\nmake sure we're building our budgets\njust like uh Representative Oliver just\nsaid, that's a great place to start with\nzerobased budgeting. If something\ncontinually is having a budget deficit,\nthat means we're not doing a really good\njob to planning to begin with.\n>> So you can see it from that point of\nview.\n>> I can see it from that point of view. I\nwould approach the deficit and defects\ndifferently than zerobased budgeting.\nBut I do think we have cut the numbers\nof state employees. For instance, in DOT\nby 100%. Used to be 8,000 employees. Now\nthey're 4,000. Those are rough numbers.\nWe have cut employees. We've eliminated\nour private telephone system in the\nstate. That saved,00\nemployees. The point I'm making is that\nwe have been trying as a fiscally\nconservative state. We have been trying\nto update our technologies. We're\nstruggling in the way that every\nbusiness does. I certainly struggle with\ntechnology in my small business and\nevery state does. It's not a panacea\nzerobased budget. There are other things\nI do first. For instance, we're a\nfiscally conservative state, but does\nthat mean we should be 50th in arts\nfunding? The arts are a bigger industry\nin Georgia than peanuts. It's a bigger\nindustry than many, many other things\nthat we fund elaborately. Why is Georgia\n50th? That's not being fiscally\nconservative. That's 50th in arts\nfunding. That's not fiscally\nconservative. And that's the kind of\nissue I want to talk about.\n>> Okay. I want to get to something else\nyou want to discuss before we run out of\ntime. Crisis beds. You we're we don't\nhave enough of them in this state.\n>> We don't. Georgia has been part of a\nmental health reform that is recognized\nin the nation as something a very\npositive step forward. We struggle with\nhow we deal with people in psychiatric\ncrisis modes. That's when they can be\nviolent, when they can be violent to\nthemselves. And enough crisis beds we\nproject are a great number more than\nwhat we have now. We don't have\npermanent placements in psychiatric\nhospitals. We have crisis beds that will\nserve people for three to 10 days\nperhaps to become stabilized. And we are\nfunding those more. But we have and we\nhave come out from under a federal\njustice department civil rights\nsettlement which is a huge\naccomplishment. But many of our\ncommunities kairo Georgia or adult or\nDecar Georgia or Atlanta are dealing\nwith a homeless mentally ill population.\nIt's visible. It is concerning to all\nour cities and counties and many of\nthose individuals come in and out of\ncrisis mental issues. that come in and\nout of jails and we are not managing\nthat issue of crisis psychiatric care in\nan efficient way in a fiscally\nconservative way. We need to serve those\npeople in a way that we prevent crisis\nwhen we can and prevent the kind of\ntreatment that they deserve\n>> and that is something on appropriations\nyou will be discussing I I would\nimagine.\n>> Yes ma'am. All right, before we let you\ngo on this, is there a risk that\nessential programs, especially in areas\nlike education, public safety, could be\naffected by chopping the on the chopping\nblock if we go to this zerobased\nbudgeting?\n>> Not at all. In fact, we did it for 10\nyears very successfully. And if you look\nat where we are in Georgia right now of\nhaving record surpluses, great fiscal\nconservative, it got us to where we are.\nWe want to continue down that path\nbecause if it ain't broke, we shouldn't\nfix it in this place. We're going to do\nit right.\n>> Yeah. So, you're talking about that in\nappropriations on your end and you're\ntalking about your DBH DDD issues on\nyour end. So, we thank you so much for\n>> what you both do. Thanks for coming on\nthis show to talk about",
  "updated_at": "2026-02-14T14:48:54.165927+00:00"
}