{
  "video_id": "r9NrwhT1mac",
  "url": "https://www.youtube.com/watch?v=r9NrwhT1mac",
  "title": "3/22/23 - Committee on Higher Education",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 35,
  "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Higher Education session:\n\n**Overview:** The session focused on two key bills - HB249 and an unspecified bill to dissolve the Georgia Higher Education Assistance Corporation. There was discussion around streamlining bureaucracy and potentially using funds from the dissolved corporation for higher education financial aid programs.\n\n**Key Actions:**\n- **HB249:** Bill to modify the eligibility criteria for the REACH scholarship program, lowering the completion threshold for 2-year and 4-year programs.\n- Unspecified bill to dissolve the Georgia Higher Education Assistance Corporation, freeing up $28 million to be allocated for higher education financial programs.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Committee members expressed appreciation for each other and discussed potential areas of collaboration over the summer.\n- Senator Moore jokingly invited the bill author to join the Freedom Caucus for their efforts to reduce bureaucracy.\n- Discussion around potentially using the $28 million from the dissolved corporation to fund the university system's funding formula.\n\n**Votes:**\n- The bill to dissolve the Georgia Higher Education Assistance Corporation was unanimously passed.\n\n**Attendance:** Quorum present, no specific attendance notes.\n\n**Adjournment:** The session adjourned. No information provided on the next session date.",
  "transcript": "You\nI want to first of all, I thought about this morning, is that even though this seemed\nlike a very fast session, it's been a very educational session, I'll say.\nAnd I just want to look at everybody and tell you how much I appreciate the committee\nmembers.\nI was concerned I may forget about that at the end.\nAnd I look forward to working with y'all next year again.\nAnd in the meantime, I know several of us have talked about different things that we may\nwant to work with and talk about over the summer.\nSo if you have any of those type of suggestions that will help us move things a little bit\nforward faster next year, we will be very open to doing that.\nSo please don't think about that.\nI think we've got all, I think all of us\ngot each other's cell phone numbers\nand that type of thing for communication purposes.\nSo, okay.\nSenator Burns, please do the prayer for us.\nWhat number are you?\nIf you will join me, we'll open in prayer.\nRather, this is your day.\nYou made it, you shared it with us.\nYou've given us the opportunity of making a difference.\nThank you.\nBe with this committee as we address the issues\nbefore a higher education in Georgia\nand give us your wisdom and your patience and Christ's name.\nAmen.\nSo I think we've, I thought I knew what chaos was,\nbut I think I've learned more about chaos today.\nFrom bills going back and forth,\nwhat's going to be on the agenda,\nnot on the agenda and so forth, so on.\nSo we've actually had several things\nthat have left the agenda that will be tabled,\nBut most importantly, we've got Chairman Martin here\nfor two bills.\nAnd we were ready because you got a committee meeting\nand started at 130 and we don't want to hold you up.\nYes, sir.\nSo we, yes, and we will, you tell the bill number\nand the LC numbers so we make sure we all,\nI don't think we're going to be Jason.\nI don't see Jason.\nYes, Mr. Chairman.\nWe have two before us today.\nIf if if it please the chair, I think we were waiting on Senator out of it's already to come for a portion of\n249 I'd go to 319 first. If that please chair. Thanks, sir\nAre we still working off the\nWe're still working off the as-passed house version of mr. Chairman if we're we're doing that we're working off LC 50\nzero force seventy nine is that is that correct that's what what what this bill\num we we often hear it's all just repeated again this is this is a simple\nsimple bill although it's twenty five pages long what what the the action\nportion of the bill is all in section two point one it basically dissolves a\nportion of the Georgia student finance group the Georgia higher education\nassistance corporation will be abolished but with this bill and that is a\nsection of present rallies function that is no longer needed, loans under that, the federal\nloans under that program haven't been issued for, I think almost a decade, the state\nsold its portfolio to another state and they have been collecting and remaining money.\nSo if we abolish this, we're not taking anything away from Georgians.\nThis is just a superfluous piece of bureaucracy right now.\nand by abolishing it, when it's the secession is complete, we'll be able to return somewhere\nin the neighborhood of $28 million back into the state treasury for allocation, for the\nbetterment of Georgia.\nIt's that simple.\nThe rest of the pages on the bill, two through 25, or references, as we find them in Georgia\ncode, which probably tells us that our code is a little larger than it needs to be.\nBut we're just deleting the references to the Georgia Higher Education Assistance Corporation\nthroughout the rest of the state code.\nAnd I should think our attorney for finding all those for us.\nCan I answer any questions?\nMs. Riley, you won't say anything.\nGood afternoon, Mr. Chairman.\nThank you.\nWe'll just reiterate what Chairman Martin said.\nThis is to remove bureaucracy that is no longer needed, the loans that were serviced\nby the corporation no longer exists.\nThat program was suspended at the federal level.\nThese were federal loans that no longer are in the control of the state of Georgia.\nWe sold them off 10 years ago.\nThe revenue-sharing agreement that we entered into for selling them has expired.\nAnd so now all we have left in this corporation are reserve funds that we can transfer with\nthe dissolution to the authority, which is the second piece of our three-legged stool,\nand then that would be available for higher education financial programs in the future.\nI was just going to say at the appropriate time I'll be glad to make a move to reduce\nthe size of the bureaucracy in the country.\nEmotion to be made by.\nOh, I'm sorry, all the way out there.\nSenator Moore, thank you, Mr. Chairman.\nWhen I first saw this piece of legislation,\nmy heart skipped a beat because it was so big.\nAnd then I read it and I was super excited about it.\nAnd I love the term, subperpillous bureaucracy.\nAnd you're going to remove that.\nSo my question for the author is,\nwhere can I send you an invitation\nto join the Freedom Caucus?\nSo anywhere in the 49th house district.\nThank you.\nOh, Senator, Senator Ho.\nYes, thank you, Mr. Chairman.\nCan we use that 28 million to fund the funding formula\nfor the university system?\nI understand we're a little short on those funds\non the Senate side.\nThank you for that question.\nThe funds would need to be used for higher education financial aid, oh financial aid.\nOh, so needs-based scholarships.\nUltimate decisions would be for the members of the general assembly.\nYes, thank you.\nThank you.\nYou need to discuss that in just a second.\nYes, right.\nCertainly more.\nI also was like you this morning when I started reading and I looked at 25 pages and I immediately\nand ask her what and tell me what was all about.\nThat took away a lot of pressure.\nSo we have a motion from Senator Hustler.\nDo we have a second?\nSecond from Senator Payne.\nAll in favor?\nSay aye.\nI'll read you in.\nOkay.\nPass is 100%.\nThank you.\nAnd now we can move on to House Bill 249.\nAnd I still don't see Senator Annoverty here.\nIf it please, Chair, I believe I can cover his section.\nIf I'm not sure I have the sub in front of any people,\nit's not updated.\nIf I could, is there a copy of the sub to second,\nrefer to line numbers?\nBut as we're moving toward that,\nthe original, the original bill,\nwhich I believe starts in your.\nSenator Chairman, hey, wait a minute.\nIf it please chair, I'm going to speak to you,\noriginal well first, and then I'll go back\nto the Senator Anna Vintardi's portion.\nBut the original bill that came out from the House\nis now starts in section two of this bill.\nAnd the idea, if you recall last year in House Bill 1435,\nwe put in place a merit-based means-tested program\nfor students that were 80% through their degree\nor certification program.\nAnd what this is seeking to do is right size that.\nWe found out after we had gone last year,\nthat most financial planning is done on an annual basis.\nSo the reason we went with 80% is we figured\nin a four year program, it was 25%, 50%, 75%.\nSo we wanted to help people over that last mile\nthe last year.\nSo without you'd be 80%, then you'd be 75% finished.\nWe did not think that for two year programs,\none is not likely to be 80% through,\nafter one year of a two-year program.\nSo what this seeks to do is break those into two parts,\na four-year program, and we did lower it from 70 to 80,\nI'm sorry, from 80 to 70,\nbecause there is a possibility with maymasters\nand that sort of thing that you could be on track\nfor a four-year graduation,\nbut not be quite to the 80%\nwhen you're doing your financial planning for the next year.\nAnd again, this is to make people eligible\nfor the funding, it doesn't mean they get it.\nSo if a financial advisor at a university looks,\nand you're doing a course at a time,\njust because you're at 70%,\nyou're not at your last mile.\nSo this makes them eligible.\nSo that's what we seek to do in lines 32 through 35,\nis 45% for a two year program,\n70% for a four year program.\nAnd then we were finding good results\nin the way the money was being allocated in spread.\nSo we suggest that we raise the maximum total\naward to $3,500 again, only $2,500 at max at the time.\nAnd that doesn't guarantee anybody the $2,500 at any\ntranche of the draw.\nBut our idea is to system wide across TCSG and the\nuniversity system implement what has been referred to at\nGeorgia State University as the Panther grant.\nThis is helping people to get across the finish line.\nSo that's what we're trying to do in 249 as it pass the\nhouse.\nNow, what we have done, Senator Jason Animatari had a bill that I think you all may have\nlooked at to allow military veterans that were discharged in all of the senators here.\nOh, then I'll yell to the senator if it plays the chair to speak to them.\nYou were doing such a great job, I just going to leave you know.\nI never want to get between a senator and a microphone.\nThank you, Mr. Chairman and real quicks want to say thank you to Chairman Martin for his partnership on this bill and allowing us to work on this together.\nSo you'll see in section one lines 15 through 20, I think to every senator, this should be familiar, this is the CDL training free tuition for veterans that we unanimously.\npassed out of the Senate a couple of weeks ago.\nAnd so we've added this language, you'll see on line 15, subject to appropriations by the General Assembly.\nAnd we also put a sunset on this for June 30, 2025 to work with TC SG on this, which I know the Mark PV in the commissioners office approves.\nBut this is some old language that you saw on Senate Bill 203 with that I'll take any questions.\nI think you have a question from Senator Orren.\nThank you.\nWell, thanks to Representative Martin for continuing on this journey to provide financial assistance\nto needy students that are seeking to move forward and get their degrees.\nThis is another step forward and I appreciate your leadership in that regard.\nI did for my colleague from the Senate a question I would have asked when we were dealing with\nthis bill before it and fail to do is you're talking to the technical schools leadership.\nThis includes both private programs training for commercial vehicle licensing as well as\npublic programs.\nAm I reading that right?\nSo I think the goal with this, I think is to increase the number of enrollees under the technical college system.\nI think the concern that I've heard from trucking companies across the state is that a lot of the private companies were doing training, the level of training and sustainability.\nFor example, if I go to training and I'm going to work at Senator Nanorak's trucking company in East Georgia,\nthe retention rate of that employee sometimes is 24 hours to 48 hours because they're not being skillfully trained on how to operate a truck.\nAnd I think we've seen the successes of our technical college, far surpassed in some cases.\nbelieve it or not, I can't believe I'm saying this,\nbut really the private sector,\nbecause of the level of retention.\nAnd I've heard that from trucking company owners\nacross the state.\nSo in the other part of this too,\nI know you're familiar with the Vector Center\nin Macon and Middle Georgia,\nwhere we have soldiers and airmen and women\nbeing honorably discharged from the military,\nfrom like Robbins Air Force Base,\nwanting to do something that's non-military,\nnon-law enforcement, start a company, start a job.\nYou know, do something totally different\nthan what their background is in.\nAnd a lot of that interest has also been\nin the trucking industry.\nAnd I know they opened a CDL testing site\nat the Vector Center in Warner Robbins\nbecause of that interest.\nSo that's our primary focus with this section.\nAnd I'm very supportive of the bill.\nWe were able last year in the budget\nto get some more training facilities built in\nto our technical college system in some key areas.\nI know that Coca-Cola, UPS, anybody you talk to\nthat depends on trucking in the state, the ports,\net cetera, that we have a shortage.\nAnd this doesn't strictly say that they would get\na commercial driver's license classification,\nbut this is the training that enables them to qualify for that.\nAnd so does this not apply, it does apply to the private sector as well as to our public.\nGo ahead, Chairman.\nI didn't look at the gentleman's language.\nWe just moved over his language.\nI think it's a practical matter.\nWhat we're saying, Senator, is it's tuition free?\nI don't think we can require a probability to provide a program tuition free.\nYeah.\nSo we're providing it tuition free and that's subject to us backfilling our university.\nI don't think we could.\nExactly.\npractical matter, this wouldn't apply to the private sector.\nThat's something we can get going forward.\nNo, perfectly clear about that.\nIf I may to Senator Orox first come in about the moves\nthat we made with the sport of this Senate committee last year\nand both the Senate House and the governor,\nI want to refer to this completion grant\nas merit-based means tested.\nNot that there's a problem with needs-based,\nBut it's meritorious if you're 70% through a degree,\na four year degree, regardless of your financial situation.\nAnd I think just to call it mean needs-based\nis not giving the students that would qualify for this.\nI know the senator thinks the same thing,\nbut I just really like us to start referring\nto this completion grant as merit-based means tested,\nif you will, but it may as best,\nbecause it is meritorious to put your shoulder\nto the wheel and get seven.\nAnd have I have moved up?\nI'm in many places in a very tough situation.\nAnd if I could follow up with you on that,\nand then I'm through with it.\nBut the language that's been in the law,\nthere was put in line 26 and 27, a financial aid gap.\nWho's making that determination?\nAnd is there any more clarity on what that looks like?\nIs it just simply that, well, I'll let you.\nAnd yet, yes, man, it's a bit subject.\nThere are some other things that are in the bill that are more objective, if you will.\nBut we have to, to some extent, depend on our people that are on the ground and our\ntechnical colleges and universities.\nAnd the Laundry of Flexible.\nYeah, and I would be less than honest with this committee and I never want to do that\nto say that there won't be some leakage in this program.\nThere will be some people that avail themselves of this money and do not complete a certificate\nor a graduation.\nBut we have leakage in the hope scholarship we have leakage everywhere.\nThis is a good investment.\nIn my opinion, this is a good investment on people that have gotten to this point through\nhard work and they merit the opportunity for us to invest in them.\nAnd I think being so speedy and responsive to what we've seen in our first year of the\nprogram to come with this legislation is a really important.\nWe had a lot of help from the folks at the University System, TCSG, and our financial\neight offices around the TCSG and the University System\nhave been very, very helpful to get this to students.\nAnd we need to get it out as 56 senators and 180\nrepresentatives.\nWe need to let our constituents know that it's available.\nYeah, I'd like to make a motion HB249 LC500593S do pass.\nFirst of all, I fully support the legislation and certainly completion grants have proven\nto be a tremendous asset to our students who are nearing that conclusion point and are\nprepared now to enter the workforce, totally, totally support that.\nI'd come back to Senator Orick's question a little earlier, in Section 1, just to clarify\nappropriations by the General Assembly for such purposes so that the General Assembly\nwould only support those training programs that are provided through either TCSG or\nIs that right?\nAnd in truck driving things, the TCS is not correct.\nYes, Senator.\nAnd I do agree with the authors on increasing the level of support.\nFor 25 to 3500 because at the end of the day, that's the cheapest $1,000 we could ever spend.\nAnd I fully support the bill.\nThank you.\nThank you, Mr. Chairman.\nSection one of the bill to the senator and of a tardy.\nYou know I think this committee and I think the general assembly needs to recognize where\na lot of the problem comes from when it comes to truck driver shortages and that is that\nthe federal government has mandated that in order to receive a CDL you have to go to truck\ndriving training school. And this has never been the case until the last couple years.\nSo even if somebody was in the military and they were driving a truck and they knew how\nto drive the truck, when they got out, now the state is going to be subsidizing a further\neducation of things that they may already know. Or if we've got farm kids in North Georgia\nor in South Georgia who have been driving a truck their entire lives, they still have to\ngo to a truck driving training school and then they have to pay for that education even\nthough it's not an education that they need.\nSo I think the federal government has really burdened us\nin that sense, and I think this general assembly,\nat some point, needs to consider allowing CDLs,\nas long as somebody can pass the appropriate test\nto have a CDL in the state of Georgia\nwithout having to pay $5,000 for truck driving school.\nBut I just want to make note of that to the senator.\nYeah, and my response is to my good friend\nNorthwest Georgia, and we've had plenty of trucking debates between your family, you\nknow, running trucks and my dad becoming a truck mechanic in Vietnam and running\nwriter truck shops all over Metro Atlanta. I think the goal of this is, well I do\nbelieve that that is true in the sense of, you know, those maybe that run trucks in\nthe military and are honorably discharged. I think the vast majority of those\nthat are being honorably discharged from the military, like my dad was, I think their\ngoal, I think, is to find a career that's outside of maybe what they were doing.\nSo I think if you're, for example, maybe an MP officer or something doing something else\nin the military, and you want to make a life for your family, most of them don't want\nto go into law enforcement.\nI think a lot of them want to kind of go into the upbringing and carry on kind of the\ntraditions that your family and my family kind of had the opportunity to\nexperience. So I think that's the goal and I think based on the experience of\nwhat we've seen at the Vector Center and one of Robbins and I know that another\none would just open in Cobb Canyon and at Chairman Martin and others were\ninstrumental in making that funding happen with Chad and Yutji Tech. I think\nthat's kind of the bigger picture here I think in terms of who will be\nultimately impacted by that. Yeah Senator I I support section one I just\nPhil it's an it's an undue burden on our state yeah thank you at the risk of\nwell stay my welcome I know there's a you have a motion on the floor so I'd\nlike just after after we get an affirmative vote here I'd oh you can add something\nto the gentleman's point. We had a motion by Senator Beach and a second\nby Senator Orrick so we take a vote and all the favor raise your right hand\nthat's 100%. Thank you. Oh 99% God what I want now Senator I'm not going to answer the\ngentleman's no I'm just I know I present I would recommend remind the\nSenator that this year on House bill 155 I believe it was unanimously supported\nin the House and the Senate we made licensure by endorsement easier in this\nday for people come coming from outside so I'd be happy to work with the\nSenator, I'm sure this senator and I would do something like that for CDL where you can\nbring your work from another state or from the military and get your license without\nextra seat time if you would.\nI'd be happy to work with the senator on that.\nThank you.\nMr. Chairman.\nThank you, Mr. Chairman.\nWe're going to go work on some Senate bills up in the House.\nYeah, we're going to take just about a one and a half minute recess, so y'all just hold you thought what you say.\nOh, yeah, I'm sorry.\nI'm chairman Martin.\nWe need to who's carrying the two bills.\nIt's bonkers.\nI'll take care.\nBoth of them?\nOkay, good.\nYeah.\nAnd I'm going to host committee.\nOkay.\nI got a bell over there.\nOkay.\nThank you, thank you, Brandon.\nThank you.\nYou\nYou\nYou\nYou\nYou\nYou\nI think y'all remember me telling you at first about chaos and that's kind of what happened\nthis morning.\nI think I I take full responsibility for messing some up so but anyway we move\nthem forward and all we're ready and we're going to ask Chairman Hopkins come\nforward for Senate bill I should give him a house bill 1.20.\nThat bill was about helping the disabled by moving the yard marker at a $2,000 limit\non the entire assets savings to 200,000 plus.\nWhat it did was it started at 529A,\nsimilar to the 529 Path to College.\nThey could save funds into that,\nthey could be used for the disabled needs\ntowards vans, ramps in a house.\nThey had an opportunity to move out of the house\nof their parents and live on their own\nand receive a paycheck rather than a handout.\nThis was a big thing for the disabled,\nI had a good friend of a physician in Gainesville,\nhe has a son that was run over\nand we actually raised money in the church\nthrough the community and had Randy's house built\nand Rachel's house across the street for young women.\nWhat this bill does is it completes the circle\nfor really a good idea.\nAnd the missing part of the circle was\non the house side in ways and means\nthey did not want the state being at risk of any money on this project.\nSo that means the parents had to bear the cost of the administration to set up other plans.\nDick, you know, that creates a financial hardship on people that are already behind the eight\nball financially with their loved one.\nAnd I will have to give credit to a state treasurer.\nHe came to me this summer and he said, you know what they're doing in other states?\nmoving out of Ohio where we were, where the states joined together in their program, they\nwere moving out of Ohio back to their home states, joining the 529 plans together.\nDoes it combing all the funds but uses the same board and uses the efficiency already\npresent of the outreach for the 529 Path to College and it really builds a program up.\n35-year-old last year testified that 70% of BHDD participants would qualify for this if\nthey knew about it.\nWe have an opportunity to help the disabled in this state by simple move of moving this\nback, combining the boards.\nAnd this is a bill that actually you voted on last year, passed through the House and\nlast year.\nit put on this bill that added a different subject title of a school project and even\nsome of your own centers had a hard time with that.\nI did not have the chance to get it back on the floor.\nI could have done that but we had an ailing speaker back there at that time and I recognized\nthat and chose not to get up at the 11th hour and push him to do something.\nThere's always another day and I think this is the other day you do have an amendment to this bill. It's a\nfriendly amendment\nWhen we presented when I presented the bill in the house this year\nOne of our chairman felt like the governor really wanted to be on the board the governor does not want to be on the board\nSo the amendment if you want me speak to that I think you have the amendment\nThe amendment online, the 30 strikes, the governor's a chairperson, and then online 29 after officer of the board, it says the board shall elect a chairperson from its membership.\nThat's only change. And that's the bill. We have a few people here that are in support of the bill. I know the hours late, and you may want them.\nJust have them wave at you or whatever whatever you want to do, Mr. Chairman, and you have this hand out in your book, too.\nTimes appropriate, Mr. Chairman. I'd like to make a motion do pass on LC 540201S\nYes.\nBack many substitute.\nBack many substitute.\nBack many substitute.\nGood morning.\nGood morning.\nThank you.\nDo you have to do this first or second.\nDo you have the right hand?\nYeah.\nOkay.\nWe also need to have an emotional and a mental solution.\nYou are right.\nWe are back many substitute.\nOh, okay.\nThank you.\nYou still need to go out to the mental hospital.\nYeah.\nThe mental hospital is in the middle.\nYeah.\nOkay.\nThen I'll make a,\nI'll make a change per motion to amend LC540201 with amended\nlanguage of LC540201S.\nWe can keep his original motion and then just have someone else\nmotion to amend it.\nIf you want to do that, yeah.\nOK, OK.\nOK, then my original motion stands.\nOK, so who make the motion?\nAnd I'll make a motion to amend it by substituting this language in L3P4, O2O1, I asked it.\nL121, struck the government's chairperson, L121, can I see the chancellor in L121 on an\nAfrican Ministry of Office for the Board at the board, Jolly Lefick, chairperson from the\nmembers of the board.\nVery good.\nSecond.\nOkay.\nAny other discussion?\nI'll sign out.\nDid it get signed?\nYeah, it got signed.\nAnd we need to vote.\nAll that's over.\nWe're voting on the amendment.\nWe're voting on the amendment.\nWe're voting on the amendment first.\nYes.\nRaise your right hand.\nOkay.\nAll passed.\nOkay.\nNow we're voting on the bill itself.\nThat's a minute.\nOkay.\nAs amended.\nYes, sir.\nIs there a page?\nYes, sir.\nIs there a page?\nYes, sir.\nIs there a page?\nYes, sir.\nOkay, we need a second so all in favor raise your right hand\nI saw I know do that I really want to pay attention to you\nYeah, I didn't want to give me a credit for anything. Thank y'all. Thank you, Mr. Chairman\nWell, thank you. Thank you committee this pleasure again\nAgain, just remind y'all, during the summer time at all,\nin order to make us more efficient next year,\nwe need to talk about anything.\nI'm wide open, okay, so please do.\nThank y'all, thanks.\nYou\n",
  "updated_at": "2026-02-12T12:22:02.143859+00:00"
}