{
  "video_id": "r9qODNtPRUs",
  "url": "https://youtu.be/r9qODNtPRUs?t=823",
  "title": "Georgia House - Day 16 (2026-02-07)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": "2026-02-07",
  "duration_minutes": 197,
  "summary": "Overview:\nThe Georgia House session focused on recognizing the birthday of the House Clerk, Bill Riley, and featured a prayer and speech by the guest chaplain, Pastor Mike Franklin. The session did not involve any substantive legislative actions.\n\nKey Actions: None\n\nBills Introduced (First Reading): None\n\nNotable Moments:\n- The guest chaplain, Pastor Mike Franklin, gave a speech emphasizing the importance of love and acting with love, even in the face of conflict and disagreement.\n- The representative who introduced the chaplain, Victor Anderson, praised the chaplain as a good friend and man of God.\n\nVotes: None\n\nAttendance: No specific quorum notes.\n\nAdjournment: The transcript does not provide information on the time of adjournment or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you that that really I'm Flip the script. We're going on a jumble. If the majority leader was here, we would have joined, but he's not. So I had recognizing. Sorry, Pastor. So what we're going to do, we're going to recognize our birthday boy today. The clerk of the house, Bill Riley, has a birthday today. Mr. Clerk, best clerk in America. We'll start working on a national holiday for today. I think. Door, keep us, I think, as time we close the doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Today, our chaplain, this morning, will be introduced by the gentleman from the 10th House District, representing Victor Anderson, representing Anderson. Thank you, Mr. Speaker. Colleagues, it's an honor, a privilege and a blessing today to introduce our chaplain of the day. So as leaders, it's important to have credentials. And our chaplain today has not only been in the ministry for 45 years, 23 years on his current campus that my wife and I attend in Denver, Georgia. He also has a bachelor's degree from Lee University of Masters in Education, a Masters in Divinity, and a doctorate in ministry. But you know, all of that is important, but that's not the most important thing. The most important thing is a man's action. Two years ago, today, my father passed away. My father's first cousin is a pastor at a local church, very successful, and had volunteered to offer his services for my dad's service. Literally at the 11th hour, the day before my dad's internment, my cousin came down with a bad case of COVID and was not able to do that. The night before my dad was buried, I called my friend, Pastor Mike Franklin, without hesitation, without preparation, he came, and he attended the service, preached to our family, and consoled us during that time. That's all the introduction I need to provide for my pastor and my friend, Pastor Mike Franklin. I'm privileged and honored today to have the opportunity to speak to you. I can tell you, Representative Anderson, I know him extremely well. He's not only my representative, but he's a good man. He's a great family, does a great job, a huge blessing for our community, and I know I shouldn't say it here, but Vic, I love you, man. I thank God for you, the Representative Anderson is a tremendous man of God. And more than just being his pastor, we are friends, and I know him and know him well. So also Lauren is good to see you, my friend. I appreciate you, brother. Thank you for for you. He's a knucklehead. Don't belittle for your dad. To all of you here, let me just tell you thank you for the opportunity, Mr. Speaker. I'm honored to be here, and I thank you for the opportunity to be here. Now let me turn my attention to why I'm here, because I'm going to stay within my bounds of time, at least I'm going to work very hard at that. How's your love life? Now I ask that question, not meaning to take your mind to a bedroom somewhere, or to some quirky evil thought that might come in your mind. What I mean is, how are you right now working and demonstrating and receiving and giving real love to the people around you? That's what transcends everything. I mean, these howled halls of charged conflict that we have, often productive and sometimes unproductive, a place where sometimes frustrations can boil and attitudes can go awry and emotions and feelings can get the best of even the best. Can real love still be found, even in the heat of the battle? Even in the heat of the moment, the controversy, the challenged values, the differences of opinions, the great decisions, the difficult dialogues, when approached by a lawyer. Jesus, the greatest teacher of all time, was asked a question. What's the greatest commandment? He responded in the imperative, he gave a direct command, you must love. It's in the imperative tense in the original language in it. It's very direct, ardent, strong, you must love God, love your neighbor, love yourself. So how are we doing with that? I mean, you know it well, Matthew 22, 37, and following. This is the first command of all. You must love the Lord your God with all your heart, mind, soul and strength. You must second slide into it, you must love your neighbor as yourself. I mean, we understand the greatest command of all. What I want you to notice today is that as he responded, he revealed the true nature, the true behavior of love. Notice that direction and that intensity of command says this. He's making a profound demand and saying act in love. Love can be commanded. And what you have to know is it's more than an emotion. Love in fact is not even rooted in emotion. Love is more than a feeling or some set of feelings, though it will produce feelings and at times will produce emotion loves the choice. You either do it or you don't. You either obey the command of the master or you ignore his voice. Genuine love, real love, true love is a decision. It's a matter of your will. It's a deep commitment from deep within you and it produces decisive action in your day to day life. Love's a commandment and it requires commitment and action. I know feelings and emotions are important. Don't ever forget that. But true love, true love functions regardless of how you feel. True love functions as an action based on a deep commitment and I'm going to tell you, off times it's hard to do. Off times it's challenging when someone has confronted you at your core. And someone has in some senses faced you down in maybe an emasculating way. Some way that messes with you differently. Each person is that way. In my life I've learned some things. I've learned that liking people and loving people are two completely different things. In my life I've learned that I can like someone but I can only like someone because I have an emotional response that's positive toward them. Feelings and emotions, we can't control them. They just are. I'll tell you what we can't control how we respond to those feelings and those emotions. That we can control. We can't stop the way we feel but we can choose to behave. We can choose to be angry and still act in a loving manner. A feeling is a reaction but a behavior is a choice. Don't react, respond with a choice. Maybe that's the reason Christ did not command us to like our enemies. What Christ did is He said, love your enemies. Loving and liking are not the same thing in any sense of the word. In fact liking someone is off times not even under your immediate control. But acting in love is always under your immediate control. Sometimes you can't control how you feel about somebody when they do specific actions but you can choose to control and love in your response. We haven't learned that love is an action chosen by us regardless of circumstance, regardless of the context, regardless of the treatment we've received, we'll never effectively love. We'll never love as Christ taught us to love. Yes, we can actually love people we don't like. Yes, we can actually love people we don't agree with. Yes, we can act in a certain way just because it's the right thing to do. Yes, we will feel warm and fuzzies but if we don't we can still treat others rightly. What's odd about this is this. You act in a loving way towards somebody else regardless of your feelings, emotions will begin to line up with your actions. What's funny about this is your feelings will begin to change if you first control your actions. Told thousands and thousands of couples who come to me in trouble facing down divorce and say, well, do you love each other? Well, yeah. Okay, the battle's won. Just start acting like it. You know what happens when they start acting like they love each other. It's only a few days before they feel like they love each other. It's a fact of life shown again and again, psychological. Few days later, a little bit of time passes and Jesus is speaking to his disciples in John 15 and here's what he says, without me, you can do nothing. I'm divine. You're the branches. Abide in me. I will abide in you. See, therein lies the key to being able to make the right choices, making this lesson work in our lives. It comes when we choose regardless of who we are, regardless of where we are, to let the God who is love abide in us. And if we choose to abide in him, then love is possible. Without it, sometimes loves hard. Harder than you want to follow through him. But when he's with you and in you and part of your psyche, then what happens is our flesh, which often overwhelms us with self-focus, our feelings, which get frayed, they're late at the feet of Jesus. And the person inside us, the God, the incarnate God, who revealed love to humanity, that God, stops us from lashing. He stops us from lashing out without warning. If we abide in him.\n\nHe's in us and he's love and you have everything you need to love everybody around you, no matter what's going on. Nothing else will produce this kind of love. The kind that's unconditional. It's always forgiving that keeps no record of wrongs. That is not proud. That is not puffed up. That is not easily angered. That kind of love comes from something about him in us. So today I challenge you. Allow him to be by you. Allow him to forgive you. Forgive me. Redeem you and me. That means to buy you back to the purpose for which you designed you. Allow him to be the savior of your life and then crown him as the Lord of your life and walk with him daily. Then you can about him. He'll about him you and then you can act in love. I'm going to say one more thing and I'm going to pray. The wisdom you need today. The integrity you'll have to display today. The love that needs to be on display in your life today. It's immense. Some of the battles over budget. There's some issues you'll deal with. And all these struggles that you'll fight with you need wisdom and integrity and love. Difficult dialogues will take place. Difficult decisions will fill your day. What I pray for you today is that God would grant you the grace to open your heart and say, I'm going to choose to love no matter what. And I'm going to ask God for wisdom to guide me so I can accomplish the task. I'll ask you again, how's your love life? I've fought our battle before you right now in the name of Jesus. And God has these representatives stand before you and ask you for guidance. As they come into your presence and ask you to touch them with grace. What may they be enthused with a love that allows them to love themselves and forgive themselves? That allows them to love others? I forgive others. That allows them to love you with all their heart and to make their mind, soul and spirit yield to your voice internally, abide with each one of us today. But all the personnel in this place need your touch. And may we commit to love like we have never loved before. May your grace guide us. May your grace guide us. May you give wisdom to these representatives. May you give integrity to their words, their actions, their thoughts, their deeds. May you fill this chamber with love. These are amazingly talented, blessed leaders whom you have placed in this house for such a time as this. Help them to rise to the occasion, have to do what you have ordained them to do in Jesus' name. Amen. Would you face the flag, please? It's smooth. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, individual with liberty and justice for love. Thank you so much. Thank you. Thank you. Thank you, sir. Thank you, sir. I appreciate that. Thank you, brother Mike. We appreciate that. Door, keep your sheep may unlock the doors. Members you can join brother Mike in the south any room for a photo and telling him how much you appreciate him being here and bringing us that message I love. Pastor, that was timely. Great message. Thank you for being here. Our doctor of the today is brought to us by Representative Stacy Evans of the 57th House District. Dr. Patel, we appreciate you being here and if you get a chance, members certainly stop by downstairs until how much we appreciate you. Appreciate her being here. Chairman Tarvan, the chair of the Committee on Information and Audits has recognized. Mr. Speaker, your committee on information and audits has read the journal from the previous legislative day and found it to be correct. On another note, if you can't fly, then run. If you can't run, then walk. If you can't walk, then crawl. But whatever you do, you must keep moving forward. No true words were ever spoken, Mr. Chairman. I think you got it again today. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct, is there an objection to dispense with the reading of the journal. Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none. And the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day, Mr. Clerk? Representative, frustration to the 104th Moose filing me establishes the order of business term for as part of the period unanimous consensus. Introduction of bills and resolutions for as reading and reference files, bills and resolutions. Second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there an objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none. And the resolution is adopted. For as reading of bills and resolutions, the clerk will read. House Bill 1135 by Robson, a patched in the 150th Bill B. Tottlinack to provide a new charter for the town of Dexter. And for governmental coordination. House Bill 1136 by Robson, a mayor of the 56th gull of the 19th lever, the 123rd person here, the 19th, Cameron of the 1st and others. Bill B. Tottlinack to amend Article 7 of Chapter 5, Title 16 in the Fischer Go to Georgia annotated, relating to stalking. Judiciary non-civil. House Bill 1137 by Robson of Kendrick of the 95th Bill B. Tottlinack to amend Code Section 17754 of the Fischer Go to Georgia annotated, relating to form of indictment by grand jury. Judiciary non-civil. House Bill 1138 by Robson of Kendrick of the 95th Bill B. Tottlinack to amend Code Section 10, 1014 of the Fischer Go to Georgia annotated, relating to fund administrator investments. Economic development and tourism. House Bill 1139 by Robson of gull of the 160 second Oliver, the 82nd Miller, the 62nd Bill of the 75th Bill B. Tottlinack to amend Chapter 2, Title 20 of the Fischer Go to Georgia annotated, relating to elementary and secondary education. Education. House Bill 1140 by Robson of Smith of the 18th Bill B. Tottlinack to amend the NAC to provide a homestead exemption from Harrelson County School District at Valorum Taxes. Intergovernmental coordination. House Bill 1141 by Robson of Hagen in 156 in Mathis in 149th Bill B. Tottlinack to amend Chapter 1, Title 43, the Fischer Go to Georgia annotated, relating to general provisions and professions and businesses. Regulated industries. House Bill 1143 by Robson of Hagen in 156th and Mathis in 149th Bill B. Tottlinack to amend Chapter 1, Title 43, the Fischer Go to Georgia annotated, relating to general provisions and professions and businesses. House Bill 1143 by Robson of Hagen in 156th Bill B. Tottlinack to amend the NAC to Regulated industries 1143 by reps and a pagan and 156 in math is the 149th There'll be Todd on active provide a home state exemption from Telfer county advalorum taxes Enter governmental coordination house bill 1144 by reps and a martin of the 49th gullet of the 19 Jones the 25th hilton of the 8th 48th mom to honor the 17th and others He'll be Todd on active men chapter one of title 43 the fish go to Georgia annotated ruling the general visions and professions and businesses Regulated industries 1145 by reps and a scog into the 14th and gamble the 15th bill be Todd on active men and act to provide a home state exemption from certain Bartow county school district ad valorum taxes Intergovernmental coordination house bill 1146 by reps and a Stevens the 164th Hitchens 1161th and P3 and 166th He'll be Todd on active men part two part of the three chapter five of title 12 Money fish go to Georgia annotated ruling the groundwater use Natural resources and environment with mr. Clerk would you hold it this one? Members if you can hold it down to a low roar I'm having trouble here in the clerk and I'm standing right here beside him Roam was a built to the day and y'all want some all these problems in the next five minutes, but if you need to Go into any room Miss Clerk House will live in 47 my reps and a mom to honor the 17th Kelly the 16th Smith in the 18th new the 64th gullet of the 19th Bill be Todd on active provider for new homestead exemption from Paul and county ad valorum taxes Intergovernmental coordination house bill 1148 by reps and a mom to honor the 17th Kelly the 16th Smith in the 18th new the 64th gullet of the 19 There'll be Todd on active revive for our new homestead exemption from Paul and county school district ad valorum taxes Intergovernmental coordination house bill 1149 by reps and a major the 56th ain't to the 180th Thomas the 21st Bill be Todd on active men article 1 of chapter 81 a title 36 of the fish go to Georgia annotated relating to local government budgets and audits governmental affairs 50 by reps and of columns the 71st Corb of the 174th saints of the 180th percol of 169th crore of the 118th Bill be Todd on active men code section 48 73.1 of the fish go to Georgia annotated relating to tinting of windows motor vehicles 1151 by reps and a McLean to the 109th prince of the 130 second Alexander the 66 Gladney the 130th part of the 5th and others They'll be Todd on active men code section 42 86 the fish go to Georgia annotated relating special license plates motor vehicles 1252 by reps and a camp on 35th Carson the 46th all the 33rd person girl the 119th gull of the 19th and others Bill be Todd on active men chapter 3 title 46 the fish go to Georgia annotated relating electrical service energy utilities and telecommunications 53 by reps and a Jones the 25th Martin of the 49th C ball 34th Anderson of the 10th huddleston of the 72nd Bill be Todd on active men title 44 the fish go to Georgia annotated relating to property Judiciary House bill 1154 by reps and a can of the 58th all over the 82nd Beverly the 143rd Williams of the 37th glaze the 67th Bill be Todd on active men article 7 chapter 4 title 49 The fish go to Georgia annotated relating to medical assistance generally public and community health House bill 1155 by resident Canon of the 58th all over the 82nd Beverly the 143rd Williams of the 37th glaze the 67th Bill be Todd on active men code section 33 24 58.2 of the fish go to Georgia annotated relating to the new born baby and mother protection act Public and community health House bill 1156 by reps and a Jackson of the 68th Holly the 116th base more of the 69th and glaze of the 67th Bill be Todd on active men article 1 on chapter 7 to title 44 the fish go to Georgia annotated relating the landlord and tenant in general governmental affairs House bill 1157 by reps and a Jackson of the 68th Holly the 116th base more of the 69th and glaze the 67th Bill be Todd on active men part 2 of article 15 to chapter 1 to title 10 of the fish go to Georgia annotated the fair business Practices active 1975 Judiciary House bill 1158 by reps of Jackson the 68th runner of the 85th bars of the 86th Taylor the 92nd base more of the 69th Bill be Todd on active men article on chapter 6 title 19 of the fish go to Georgia annotated relating the general provisions regarding Alamonia and child support Judiciary House bill 1159 by reps of Jackson the 68th Bruce the 61st Holly the 116th Clark of the 100 and a three hundred and fortyth Bill be Todd on active men chapter 2 title 21 of the fish go to Georgia annotated relating elections and primaries generally governmental affairs House bill 1160 by reps and a Jackson the 68th Holly the 116th Evans the 89th more of the 91st vapor the 90th Bill be Todd on active men part 3 of article 4 chapter 11 of title 16 of the fish go to Georgia annotated relating to carrying and possession of firearms Public safety and homeland security House bill 1161 by reps of ballad of the hundred forty-seven saints the hundred and eighty of the featuring the 166th Reese the 140th bonner the 73rd and others Bill be Todd on active men chapter 7 of title 4080 the fish go to Georgia annotated relating income taxes Ways and means 62 by reps of 9 to the hundred and 34th Williamson and 112 black men and the 146 Carson the 46th Martin of the 49th Bill be Todd on active men title 48th fish go to Georgia annotated relating revenue and taxation Ways and means 163 by reps and a 90th the hundred and 34th Williamson of the 112 black men and the hundred and 46th Carson the 46th Martin of the 49th Bill be Todd on active men title 48th fish go to Georgia annotated relating revenue and taxation Ways and means House bill 1164 by reps of the Miller the 62nd Smith the 18th will hold at the 175th Buckner the 137th Fleming the 114th and others Bill be Todd on active men to article two chapter 7 of title 16 of the fish go to Georgia annotated related to criminal trespass and damage to property Judiciary non-civil House bill 1165 by reps of the main or the 56 reads of the 99th episode 13th parish the 158th Hilton of the 48th Bill be Todd on active men code section 356a 3 of the fish go to Georgia annotated relating relating to membership vacancies and memberships Public safety and homeland security 166 by reps of Jones the 60th of Bill be Todd on active provide a homestead exception from the city of Atlanta at Valoram taxes Intergovernmental coordination House bill 1167 by reps and a thousand the hundred seventy-nine third one of the thirty second Lumps into the twelfth year to the hundred and fifty second chokas of the hundred fifty first and others Bill be Todd on active men title 20 of the and title 48 of the fish go to Georgia annotated relating to education and revenue and taxation Ways and means 168 by reps of towns and the 179th to Lowe to the 167th Saints of the 180th fanc of the 133rd Reves of the 99th and others Bill be Todd on active men title 40 of the fish go to Georgia annotated relating to motor vehicles and traffic Public safety and homeland security House bill 1169 by reps of towns of the 179th Smith the 138th to Lowe to the 167th fanc of the 133rd Reves of the 99th and others will be Todd on active men go section 12 to 2 with the fish go to Georgia annotated relating to environmental protection division Natural resources and environment house resolution 996 by reps and Williams the 148 Resolution honoring the life of deputy Tyree Ty Brown And dedicating a road in his memory Transportation Senate bill 189 by senator Burns in 22nd Dolos Allen the 27th brass the 28th and a barter the 31st more of the 53rd and others Bill be Todd on active men chapter 2 title 21 of the fish go to Georgia annotated relating to primaries and elections generally Governmental affairs Bill 332 by senators Robertson the 29th Kennedy 18th goods the 51st hatch of the 50th brass the 28th and others Bill be Todd on active men code section 158 32 the fish go to Georgia annotated relating prosecuting attorneys qualifications commission Judiciary non-civil 344 by senators and it of our day to the 31st goods the 51st Kennedy the 18th brass the 28th hatch of the 50th and others Bill be Todd on active men code section 48 8 3 the fish go to Georgia annotated relating assumptions from sales and news taxes Ways and means Senate bill 373 by senator Walker the 20th anniversary of our day to the 31st her Patrick the 32nd strictly to the 17th How pern of the 39th and others? Bill be Todd on active men code section 43 10 a 13 of the fish go to Georgia annotated relating requirements for licensure and marriage and family therapy Regulated industries Senate bill 405 by senator sticks into the 45th goods the 51st pickman of the 4th Kennedy the 18th Still of the 48th and others will be Todd on active men article 31c at chapter 2 titled 20 of the fish go to Georgia annotated the completion Special schools act Education That completes first readers Second reading of bills and resolutions the clerk will read House bill 1113 by represent reads with the 99th country of the 8th with the 18th lever to the 123rd still cocks of the 53rd and others Ability to state printing and documents house bill 1114 by represent weighted the 9th gamble of the 15th hung of the 103rd McDonald of the 26th Jones of the 25th and others to build relating to insurance House bill 1115 by represent Williams of the 148 Kelly the 16th crow the 118th black one of the 146th corner of the third and others bill relating to sales and use taxes House bill 1116 by represent bugs there of the 137th Stevens of the 164th house and of the 170th black one of the 146 Hulking with the 81st a bill related to imposition rate computations exemptions and credits relative to income taxes house bill 1117 By ribs to the hitchens of the 161st loves none of the 12 columns of the 71st fans of the 133rd Neil of the 79 A bill related to requirements for appointment or certification of persons as peace officers and pre-employment attendance the basic training course and employment But related information as well 1118 by represent draper of the 90th gallery to the 160th second memory of the 143rd Miller of the 62nd Powell of the 33rd a bill relating to elections and primaries House bill 1119 by represent Carson of the 46th Hilton of the 48th the bill relating to general provisions relative to motor vehicle Equipment and inspection House bill 1120 by represent Taylor the 173rd Airheart of the 36th Matthew at the 74th Smith of the 70th Thomas of the 21st and others a bill relating to ascertainment of taxable property assessments against red return Personal property for on return property changing real property values established by appeal prior year or stipulated by agreement House bill 1121 by represent ballad of the 147th washburn of the 144th power of the 33rd new of the 64 stains of the 180th a bill relating to general provisions applicable to counties and municipal corporations House bill 1122 by represent helping with the 48th Jones of the 47th Dominic of the 29th followed the 147th and the Of the 110th and others a bill relating to secondary and elementary education House bill 1123 by represent bearer of the 24th to per the 45th silcox of the 53rd Oliver of 82nd a bill relating to protection Disabled adults and elder persons House bill 1124 by represent Martin of the 49th Hilton of the 48th Jones of the 47th silcox of the 53rd and gains of the 120th the bill relating to needs based financial aid programs House bill 1125 by Rumsacouper the 45th Carpenters the 24th Daniel the 117th Hilton of the 48th Smith of the 18th a bill relating to labor and industrial relations House bill 1126 By represent park of the 169th jasper's of the 11th gullet of the 19th Dickey of the 145th Collins of the 71st and bill relating to speed detection devices House bill 1127 by represent park of the 169th Corbid of the 174th roads of the 124th and lot of the 111st a bill relating to agriculture House bill 1128 by represent a lot of the 111st Hagen of the 156 new of the 64th house of the 170th followed the 147th and others Abil related to general provisions House bill 1129 by represent park of the 81st and work highs are the 157th Abil relating to responsibility relative to defenses to criminal prosecutions House bill 1130 by represent a park of the 81st and work highs are the 157th Abil relating to responsibility relative to crimes and offenses House bill 1131 by represent towns of the 179th followed the 147th Sains of the 180th glaze of the 67th vans of the 130th third and others Abil related to health of students in elementary and secondary education House bill 1132 by represent a manor of the 56 Jackson of the 128th Lim of the 98th Abil relating to building and housing commerce and trade insurance and labor and industrial relations House bill 1133 by represent a manor of the 56th and lim of the 98th Abil relating to staff development of the Quality Basic Education Act House bill 1134 by representors evens of the 164th sands of the 180th Buckner of the 137th Abil relating to imposition rate computation exemptions and credits relative to income taxes House resolution 979 by representant draper of the 90th Mitchell the 88th dredder of the 85th Crawford of the 84th impeded of the 94th the resolution recognizing Reverend Dr. William E. Flipp and senior dedicating a bridge in his honor Senate bill 333 by senator Dixon of the 45th and still of the 48th Abil to incorporate the city of Mulberry Senate bill 377 by senator Hillary of the 19th Kirkpatrick of the 32nd birds of the 23rd pain of the 54th Straitland of the 17th and others Abil related to courts and social services Senate bill 386 by senator Dixon of the 45th hatchet of the 58th Butler of the 55th beach of the 21st Mallow of the 2nd and others Abil relating to state government through 2nd readers Yes Reports of standing committees the clerk will read Perhaps I'm Jordan Ridley of the 22nd secretary of the committee on Energy utilities and telecommunications submitted the following report and speak to your committee on energy utilities and telecommunications Has had a nerd's consideration following bill of the house instructor midi report back the same To the house with the following recommendations house bill 300 Do pass by committee substitute respectfully submitted represent Jordan Ridley of the 22nd Secretary President Beth Camp of the 135th district chairman on Committee on intergovernmental coordination locals submitted the following report Miss speaker committee on intergovernmental coordination local has had under its consideration Following bill of the senate so struck to meet a report same back the house and following recommendation Senate bill 333 do pass respectfully submitted represent a Beth Camp of the 135th district Chairman That completes the reading of the reports of standing committees Thank you, mr. Clerk members if you will take your seats. We'll move on to morning orders We have some Georgians in the gallery. We need to recognize Here's what I'm going to ask you to do If you have a morning order that um I'm going to try to pick the ones out that maybe some folks in the gallery to recognize if you have a morning order that can Move into afternoon orders that would be awesome because you're going to have one minute Max one minute max To let us hear about your morning order So we'll begin our morning orders with Representative Dr. I'll and representative chairman doctor Newton and chair lady silcox for a morning order Good morning, everyone Today we're honored to welcome members of the medical association of Georgia for doctors day at the capital if you're looking So if you're lady wants to spend just for a minute If you're looking to have a medical emergency today is the day to do it Thank you all for all that you do for our patients and thank you for your advocacy um You really make a difference in the lives of our patients. Thank you all Thank you good to have y'all we appreciate you. Thanks for being here hey doc Well, that guy's a lot of y'all didn't hey doc Good to have y'all appreciate what y'all do for our people Representing glorious phrasier and representing val weems Recognize for a morning order Thank you mr. Speak mr. Speaker good morning colleagues Today is sickle cell day at the capital We are so honored to have i constituents that have traveled from a cross-droider to be here today To advocate for this dreadful disease that many of them have and that we are here today to support them and at this time They will be in room to 30 Downstairs and i would like for all of you all to please drop in because you do have constituents that are here in your district And drop in and tell them and just say hello to them, okay? And so at this time i would like for representative al Williams to see a few words Take mr. Speak. I've got about 30 seconds at the most just want to recognize the CEO Miss Tabita make uh McGee McGee and dr. Power and his staff. Thank you all for what you do Thank you what you do you have an important calls we appreciate you And thank you too for y'all's advocacy and we appreciate y'all's hard work chair and doom nick and representative David Clark Recognize for a morning order you Colleagues if you will this week\n\nis National School Counselors Week and we are very blessed to have dozens and dozens of school counselors from around the state who are here to join us today. Hopefully they will be asking you to step outside and say hello to them, but we just wanted to welcome them to the people's house. I know they are trying to get in the door right now, but I hope you will see them talk to them and join me in welcoming them and represent it to Clark if you will. Just want to say to the school counselors, thank you all for what I do for our children. They do so much love on them, care for them, listen to them, and that just means a lot. So thanks to the school counselors and let's congratulate them during their school council week. Great, thank you. Good job, school counselors. Thank you, ladies and gentlemen. Representing my to hand, recognize for a morning order. Please give the gentleman your attention. Thank you, Mr. Speaker. Members today, I want to recognize a very special group. Today we have the Georgia Association of Voter Registration and Election Officials with us today. If you all would please recognize these folks. The Association plays a huge role in making sure that our elections run very smoothly and that every vote gets counted. It's not a small task in this house. Thanks you for the work that you do day in and day out to serve our constituents. Thank you all so much. We see you in the bag. Thank you. Thank you for that morning order. Our election board does great work. Chairman Martin has a special group here. Chairman Chuck Martin. Thank you, ladies and gentlemen. I want to recognize the greater North Fulton Chamber of Commerce. I know some colleagues will join me up here and I'm going to be more brief today than I would given our time. But I want to especially recognize Jim Teo, the current chair, Rich Johnson, the director of legislative affairs or the chair of legislative affairs and the incoming chair, Mr. Dean Collins, the access companies, Kelly Boatride and the greater North Fulton Chamber of Commerce. They make things go up there. We appreciate you all. Welcome to the House of Representatives. It was good to see you all earlier this morning. You'll have a great group here. Appreciate what you'll do. Thanks for giving your time. Chairman Jasper's recognized for a morning order. Thank you, Mr. Speaker. I don't see my folks up in the gallery at the moment. We've had a lot of people here to see us today. But Chairman Ballinger and I have the honor to recognize a couple of special families in an organization that's changed their lives. Today we recognize this day as congenital heart defect awareness date. And what that is is someone's born with a defect in their heart muscle. You can imagine how tragic and stressful it is in their lives and really life threatening for sure. You know, children's health care at Melana or Choa, as we call it here, is a leader in repairing these hearts. And we have two families here that their children might not be here if it worked for them. The one from my county had his first heart surgery at five days old, five years and then at 15. And so he's doing great. The Jenkins family is from Pickens. And also we have the Reese family from Cherokee. So as you see Choa, the little animals and their folks around in the white, just congratulate them and we glad they're there. Thank you, Mr. Speaker. Thank you, Mr. Chairman. And I'm pressing through great work they do at the Chorale. Let's see. Oh, buddy, we got a distinguished group coming now. Chairman Bush Parrish, Chair Lady Dempsey, Chair, let's see, Representative Hagan. Leslie, is that all of you? Yeah, that's awesome. Good group. Chairman Parrish, you know how to bring good friends with you. Let's hear from you. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I want to thank you all for passing a resolution earlier in this year, recognizing February the 7th as children's advocate centers of Georgia today here in Georgia. These centers began establishing some 37 years ago and these centers provide a natural child-friendly environment where trained professionals and agencies utilize a multidisciplinary team approach to investigating and treating alleged child abuse and exploitation cases. The advocacy centers are statewide. There are some 48 centers across the state. Some of them are here with us today and I would ask you to help me recognize them. We have some in the gallery and some who are trying to be here. They're trying to come in. Would you join me in thanking them for what they do in our state and recognizing them on this special day? Thank you all. Thank you. Thank you for what you do, ladies. We appreciate that. Support it. We thank you for being here. Thank you, Representative Parrish. Representative Tanya Miller recognized for a morning order. I think I mean, it's your first day of the judiciary. Representative, if you all hold up just for a second. Members, if you'll give the lady in the well, your attention. Presented, Representative Miller. Thank you, Mr. Speaker. Good morning, colleagues. If you would please just help me welcome Fulton Leadership Academy. These wonderful scholars are here today. Stand up, guys. Fulton Leadership Academy from East Point, Georgia. This is a wonderful school that provides rigorous academic environment for young men between the ages or grades of six and twelve. Their focus is on science, technology, engineering, and mathematics, and also aeronautics. For values of Fulton Leadership Academy, fortitude, leadership and achievement, please join me in welcoming them to the people's house. Welcome, guys. Love you. Thank you. You're welcome. Good to have you all. We appreciate you taking time to come. Good luck. Good looking group. I like your jackets. You look sharp. That concludes morning orders. Here is our posture. They couldn't find any matches to light the lamps over in the Senate this morning. So they're a little bit behind us. But they'll catch up. Don't worry. They can see now. The sun's up a little bit higher. They opened the curtains. So we're going to stand at ease for a few minutes. Don't leave. Hang around. We're going to want to hear from our judiciary. So this house will stand at ease until the Senate concludes their work and gets ready to join us. House will stand at ease. House will come back to order. Members will please take your seats. Members please take seats. We need to clear the Senate aisle. Please. Please members in the Senate aisle. Members will please come into the chamber. Members will please come to the chamber. Take your seats. Members that are standing in the center aisle. That's the aisle right in front of me. That's the one in the center. That one. I know nobody here likes to be in the center. I like to be on the. I won't go there. So members will clear the Senate aisle. Mr. Doorkeeper. Mr. Speaker, the President, the President of Pro Tem and the members of the Senate await entrance to the House chambers. Allow the President, the President of Pro Tem and the members of the Senate to enter the House chamber. And will the messenger please escort them to their designated seats. Thank you. Members of the General Assembly. This joint session will come to order. All members please take your seat. Mr. Sergeant at Arms. Mr. President, the honorable Michael P. Bogg Chief Justice of the Supreme Court of Georgia, the Justice of the Supreme Court of Georgia, the honorable Amanda H. Mercer, Chief Judge of the Court of Appeals and the judges of the Court of Appeals await entrance to this chamber. Mr. Sergeant Arms, please allow the honorable Michael P. Boggs, Chief Justice Supreme Court, the Justice of the Supreme Court, the honorable Amanda Mercer, Chief Judge of the Court of Appeals and the judges of the Court of Appeals, entrance to this chamber. The House doorkeeper will escort them to their seats. All members please take your seats. The clerk will read a resolution. House resolution 805 by Representative of the Administration of the 104th. A resolution calling a joint session of the House of Representatives and the Senate for the purposes of hearing a message from the Chief Justice of the Supreme Court inviting each other, justices of the Supreme Court, and each judge of the Court of Appeals to be President of the Joint Session. I would like to take this time to recognize some very special people here today before we get started. It's always a pleasure to be in this House and it's always a pleasure to be beside\n\nThe speaker of this house, Mr. John Burns. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Can't mention the speaker without mentioning the first lady of this chamber. Miss Dale Burns. Miss Dale Burns. Mr. John Kennedy. Thank you. Also like to recognize the President, Pro Tem of the Senate, Mr. John Kennedy. And the speaker of Pro Tem is Jan Jones. I'd like to recognize that they can all stand at once. Our Constitutional Officers, our Constitutional Officers, please rise and be recognized. You all stood at once. Did you? How about our members over at Judicial Branch? How about they stand and be recognized? Is it a Judicial Branch? At this time, it gives me great pleasure to introduce our great Georgia and longtime friend to this body, the Honorable Michael Peaboggs. Chief Justice Boggs was appointed to the Supreme Court in 2016 by Governor Nathan Diel. Previously Justice Boggs served as elective office and judge of courts of appeal as the Spirit Court Judge in White Cross Judicial Circuit. As well as being a member of this body for four years here in the Legislative Branch. Justice Boggs was raised in White Cross, Georgia and obtained his undergraduate degree from Georgia Southern University in 1990 earned his Juris Doctoring degree from Mercy University, where he distinguished himself on the Versus Moot Court team. He was a graduate from Law School with Chief Justice Boggs, Practice Law at Atlanta until returning home to White Cross, Georgia. And White Cross, he maintained a general trial practice while also serving as a county attorney and special assistant general. In 2000, he won the election in Georgia House representatives. Four years later, he was elected Spirit Court Judge of White Cross Judicial Circuit Chief Justice Boggs served as a member of the Georgia Special Campus Court. Georgia Special Counsel on Criminal Justice Reform in 2011 and was co-chairman of the Georgia Criminal Justice Reform Council. He currently serves as a member of Governor Kent's Georgia Behavioral Health Reform and Innovation Commission. He also serves as a pointee of Governor Kent to the Georgia Judicial nominee, nominating commission. Chief Justice Boggs lives in Pierce County with his wife Heather, kindergarten teacher for many, many years in the local public school system. I will also add, a personal note to Chief Boggs, is he presided over my baby sister's wedding about a month ago. So of all these accolades he has right now, we're going to find out how good her pretry was here in a few minutes. So, well, please, well, well, well, join me in welcoming our Chief Justice, the Supreme Court, Justice Michael P. Boggs. Thank you. Thank you. Thank you. Thank you. Lieutenant Governor Jones, Speaker Burns, Madam First Lady of the House, Dale Burns, President Pro Tem, Kennedy. Speaker Pro Tem, Jones. Members of the General Assembly. Constitutional officer. Officers. Presiding Justice Peterson, my colleagues on the Georgia Supreme Court, Chief Judge Mercere, Vice Chief Brown and Judges of the Court of Appeals, other judges that are here with us today in my fellow Georgians. I'm honored. Good morning, and thank you for the opportunity and invitation to be back before you all today to update you on the ongoing work and commitment of Georgia State Courts to uphold the rule of law and serve the citizens of Georgia. I'd like to begin by acknowledging all of the hardworking folks who keep our state courts operating during these enormous challenges that we face. Please know that while Georgia's court system is one of the busiest and most efficient in the nation, our judicial system, and in particular our trial courts, do not operate in a vacuum. Efforts of our judges to improve the administration of justice and uphold the rule of law would be meaningless without all of our valuable judicial system partners. These include civil lawyers and prosecutors, defense attorneys, victims advocates, court administrators, court clerks, administrative assistants, court reporters, court interpreters, bailiffs, deputies, IT staff, and even our janitorial staff. Consider if you will that these professionals are all spokes on the wheels of justice. If any one of them is missing in any case, the wheels simply won't turn. Instead, without each of them, our courts would not be able to function and our courts would be unable therefore to meet their constitutional duties. They are truly the foundation of the judicial branch of government because many of these people largely work behind the scenes. They probably do not hear our thanks often enough. So, to all of these judicial system professionals who make our judicial system work, thank you on behalf of all of the judges of this state. Last year, I stood before you and told you that the state of Georgia's judiciary was strong. It was true then and it is true now. But like other areas of government, Georgia's judiciary also faces significant challenges. I'd like to take the opportunity this morning to discuss the work of our courts and to highlight some of these challenges. I want to assure you, though, that despite challenges, our courts remain steadfast in applying and interpreting, not making the laws and constitution of our state. And, as always, I want to again express our appreciation for the trust and support that you all in the legislative branch have shown each of us as we seek your partnership in addressing a wide array of issues affecting our courts. I begin by expressing the gratitude of the entire judiciary for the financial assistance that Governor Brian Kent granted our judicial system at the height of the COVID pandemic. At a time when trial courts quickly had to pivot, adapt and innovate to meet the unique obstacles created by unprecedented times. In some courts, we're still feeling the aftershocks of backlog cases, but our judges across the state are working hard and we are making progress. As a result of the ARPA American Rescue Plan Act funding allocated by the Governor's office to the judicial branch, you should know that every circuit that requested help was awarded some amount of relief and many of them, many of them multiple rounds of awards. To date, that's 46 of Georgia's judicial 50 judicial circuits, circuits represented by nearly every legislator in this room. Grants to those circuits have allowed them to hire temporary personnel, update courtroom technology, rent larger venues and procure additional resources to help them move their case backlogs. And, a recent study objectively validates the use of these funds and demonstrates that the funds are indeed working. We're proud to report that the number of pending serious felony cases continues to decrease statewide. While overall jury trials have continued to increase, this progress has not been easy. In 2021, at the height of the pandemic, circuits reported an average increase of 24% in their pending serious felony cases. Some circuits reported even more than 100% increase in those cases. Fortunately, managing cases has been greatly assisted by the ARPA Grants. Since the initial awards were made, judicial circuits across Georgia are now reporting an average 11% decrease in pending serious felony caseloads. This is significant progress, particularly given the growth of our other ongoing and interwoven challenges affecting our judges' efforts to move dockets. I'd like to offer you just two examples of how our courts are using ARPA funds and moving cases. The Chattahoochi Judicial Circuit in Columbus made very creative use of its grant money to come to a temporary solution. They outfitted the Columbus Ice Rank in Columbus Civic Center as jury selection and trial venues. Also, during that time, their then-chief judge, Gilman Bride, said that more than a dozen new employees, including three assistant DAs, two superior court clerks, part-time and full-time deputies, and one part-time and four full-time assistant magistrates, were added to the circuit to handle specialized court objectives. As a result, within the first eight months of 2022, that circuit held more jury trials than in its pre-pandemic capacity. And, speaking of Columbus and on a personal note, all of Georgia's judges joined in expressing our condolences on the passing of Chairman Richard Smith, a great friend and a great American. On another note, and as another example in the Stone Mountain Judicial Circuit into Cab County, pending serious violent felony cases increased by 2,220 cases between 2019 and 2021. Since the implementation of its very first grant award, that circuit, though, has significantly reduced this felony caseload. They too have increased jury trials, holding 77 jury trials in 2022. Chief Judge Latisha Deer Jackson reports to the ARPA committee that her circuit effectively established a separate division within its superior court to handle backlog cases. They had weekly trials and pleas clearing the most serious of those cases. However, she also reports that the circuit continues to struggle with attracting certified court reporters and interpreters to return to court house proceedings after becoming comfortable with working from home for several months. Despite the enormous progress that courts are making in moving cases with the assistance of ARPA grants, our judicial system simply cannot fulfill its obligation to deliver justice without a full array of professionals beyond those available by the resources offered through the ARPA grants. Across our state, there are deficits in the numbers of court reporters, prosecutors, public defenders, court staff, and even sheriff's deputies. Just as it is critical to have enough doctors, nurses, and teachers to adequately deliver health care and education services to our citizens, so too much Georgia having enough law enforcement and public safety officers, lawyers and court staff professionals to effectively and efficiently keep the wheels of justice turning. You were recalled that during his state of the state address just last month, Governor Kemp noted workforce development challenges in state government as a really serious issue in Georgia. I truly appreciate the governor's focus on this critical issue as these challenges also significantly affect the judicial branch. You were recalled the governor saying that it is no secret that most state government jobs pay less than private sector opportunities in the same line of work. He went on to say that, but many of our employees do it because they feel a sense of public service. They want our state to succeed. This devotion to public service is certainly true with our state judicial branch employees who are committed to the important work of the judicial branch. However, even within the Supreme Court, we have experienced significant staff turnover at a rate of over 57 percent since 2019. We're seeing experienced staff attorneys leaving for more lucrative positions in private practice or moving to other government entities. What's more, this is occurring at a time when approximately half of our court staff attorneys are set to retire over the next five to 10 years. The Court of Appeals is likewise not immune and has seen similar attrition, with 10 law clerks in administrative assistance leaving for better pay or retirement over the last 18 months. Of course, we don't blame them. Today's rate of pay is not as competitive as the state salaries offered by the courts in the 1980s and the 90s. And this compensation landscape adds yet another layer of difficulty to our efforts to attract and retain top tier talent. We must reckon with the fact that this trend depletes our pool of seasoned legal professionals and necessitates time consuming recruitment and training efforts for their replacements. Others have long recognized our states of pellet courts as among the busiest in the nation, taking in thousands of appeals and other matters and issuing hundreds of opinions each year. All within our constitutionally mandated deadline of two terms of court, the equivalent of about six to eight months. For comparison, the US Supreme Court issues only about 70 to 80 opinions a year. And I'm not aware of any other states of pellet courts that have this kind of deadline. So, filling staff vacancies in our courts is especially important to handling the workload, making sure we are performing at the highest caliber while also meeting our constitutional mandates. And the challenges related to pay parity are not limited to just law clerks and staff attorneys. It is also critical that the state compensate the state's judges sufficiently to attract good ones and keep them. A Judicial Council Committee led by my colleague Justice Charlie Bethel and Superior Court Judge Rusty Smith from Ticoa recently completed a comprehensive compensation study regarding state paid judges. And the recommendations of that committee supported unanimously by the Judicial Council of Georgia have been introduced for your consideration in House Bill 947 sponsored by Chairman Rob Leveritt. We respectfully ask for your careful consideration and support of this initiative. And even beyond the challenges we have in the appellate courts to retain clerks and staff attorneys, notable other workforce challenges for the courts persist. The Prosecuting Attorney's Council of Georgia, which is tasked with training and supporting the hundreds of elected and appointed prosecutors across our state, reports that as of the start of this year, there are a total of 41 assistant DA position vacancies statewide. Eight judicial circuits out of our 50 have assistant DA vacancy rates of 25 percent or higher. You wouldn't be surprised to find that many of these are in our rural areas of the state. And you don't have to be a lawyer to know that judges alone cannot move criminal cases without prosecutors. Unfortunately, our trial courts workforce challenges aren't challenges aren't limited to just the deficit of prosecutors. As I previously mentioned, many other judicial system professionals play important and necessary roles in trial court proceedings among them are court reporters. While the overall number of certified court reporters in Georgia seems to have gone up in recent years, that apparent growth lags far behind the ever growing demand our state courts have for those legally necessary to take down every word and a court proceeding to preserve the record. In some circuits across this state, circuits are resorting to the issuance of emergency judicial permits to allow non certified court reporters to temporarily stand in for a limited period of up to one year when no other certified court reporters are available. Adding to that situation, the average age of court reporters before the pandemic was 54 years old, with a full 70 percent of certified court reporters being over the age of 50. Today, frankly, many of them are facing retirement if they have not already decided to retire. Making matters more dire, fewer new reporters are going through the process to become licensed. This means there won't be new ranks to replace the outglingles. And without enough court reporters to meet the demand, trials and other proceedings will slow once again. Let me paint you a picture as a judge of what that actually means. Imagine if you will a courtroom ready to try a serious violent felony case. The judges on the bench, judicial staff is present, the bailiffs are there, the defendant has been brought from jail, sheriff's deputies are providing security, and interpreter is present. Victims and victims' advocates are present. Witnesses have been subpoenaed, and jurors have been subpoenaed, and have taken time off from work and are present. But there's no court report ready to transcribe the proceedings. So, despite the seemingly full array of judicial resources, nothing can be done without the court reporter. Indeed, one of the wheels spokes on the wheels of justice. And because court records are also a vital component of appeals, a deficit of court reporters can also slow matters after trial from reaching finality in my court and in the court of appeals. The delay is not only affect the party litigants, but in criminal cases, the delay also affects closure for victims of justice. And we would all agree I hope that justice delayed for anyone is justice denied. And to be sure, our state court judges alone have little means to manage these particular challenges, although we are exploring potential options and we hope to have some solutions for you all to consider next year. On another front of Judiciary-related challenges, a recent report by the Georgia Sheriff's Association shows that there are over 1,000 unfilled full-time and part-time sheriff deputy positions statewide. While the judiciary does not have oversight of public safety and law enforcement personnel, this number does affect us deeply because deputies play a very critical role in our judicial system, not least is keeping our court houses and court rooms safe. What's more, on top of the security they provide, many law enforcement officers are also called upon to be witnesses in criminal proceedings. Without their vital work, it is much harder to prosecute and move cases and our court rooms are much less safe. In sum, all of these interrelated judicial branch challenges affect the resolution of court cases. I'd like to now turn your attention to an issue that no judge in any society ought to have to address, and that is the issue of growing threats to judges. Over the last few years, there have been several alarming attacks on judges in the U.S. that have made national news. Least you were unaware, in June of 2022, retired Wisconsin Circuit Court Judge John Romer was murdered in his home by defendant, he had sentenced the prison. In October of 2023, Maryland Circuit Court Judge Andrew Wilkinson was murdered outside his home by a litigant involving involved in a child custody dispute. In December, just a few months ago, a man was arrested in Nevada and charged with solicitation to murder two state court judges. And just a month later, a county district court judge in Nevada was tackled while on the bench by defendant after she denied him probation. No doubt these attacks and threats are meant to intimidate and influence courts away from serving as fair and impartial arbiters of justice. Georgia judges will not be threatened or intimidated into abandoning their constitutional duties. But incidents like these are repugnant to the rule of law, and if left unchecked, they threaten the very independence of our judiciary. These attacks prompted the conference of chief justices on which I served and the conference of state court administrators to write a letter calling on federal government and federal lawmakers to bolster judicial safety. In that letter, they state that for our legal system to function properly, judges must be able to administer justice free from threats and violence. They need to know that court staff and family members are safe. The public needs to know that the people overseeing their cases do so professionally and objectively unhindered by intimidation and free from a puzzle. In short, for the rule of law to mean anything, the very bedrock of our society, judges, court staff and their families and the public must be protected. On behalf of our state court judges and their staffs, I greatly appreciate your attention to this issue in Georgia. A little over a year ago, the Supreme Court created the Judicial Council Standing Committee on Judicial Security, which is led by my colleague, Justice Sean Ellen LaGrouw, and Judge Brian Rickman from the Court of Appeals. And I greatly appreciate their work. In addition to the Judges serving on this committee, we have many vital law enforcement leaders serving in advisory capacities, including Richard Hyde, John Hyden, Chris Wigington and Stan Cooper. These leaders are monitoring judicial safety issues in Georgia and are actively working to identify steps to protect the safety and security of Georgia's judiciary. Importantly, the Security Committee's work and recommendations hold promise for improvements. Both for judges and for you. We know that y'all are dealing with similar challenges, which have become all too real for too many of you in recent weeks. So while some of our security measures are specific to the Judicial Branch, many are more broadly applicable. This includes, for example, proposed legislation to require state and local governments to keep confidential, the personal identifying information of judges. A proposal already passed or in the works in 31 other states, and a protection that could easily be expanded to cover other elected officials. The committee work also includes training that director Chris Wigington and his staff at the Georgia Public Safety Training Center have developed along with representatives from all classes of courts. Later this spring, they will present that training and will also make available this training to any member of the legislature who would like to attend. We all hope that you will find these recommendations responsible and responsive to a growing threat. Changing gears a bit, I'd like to reiterate my concern that our courts continue to experience significant challenges when it comes to civil cases. Although, as you know, indigent criminal defendants receive publicly funded legal representation. Low income civil litigants are often on their own. Instead, where civil litigants can't afford a lawyer, the burden of representation falls to the litigant to represent themselves, or rely on a far too small and under resourced patchwork of volunteers or organizations who take cases for a little or no fee. The Georgia Legal Services Program, which arose in the 60s to address the dearth of lawyers in rural areas where legal help was less available, is fortunately still going strong today. But even these services face challenges, as that program currently has more than a dozen openings in places you know, places like Albany and Vowd Austin Columbus, and Dalton, making in Savannah and even in their Piedmont Regional Office. And while there are numerous attorneys in and around Atlanta willing to step up, there's still a need for locally based lawyers in these further outlying cities and towns. Without them, it's more difficult to provide civil legal services to survivors of domestic violence. Those in desperate need of housing and other law abiding people with critical legal needs. I bring you to your attention that both the Judicial Council amended fiscal year 24 and fiscal year 25 budget request contains contained several proposals to help address this problem. And while we have more than 34,000 active license attorneys in the Piedmont State, please recognize that the severe deficit of lawyers we have, especially outside of the Atlanta metro area. Many of us, myself included, often chuckle at the occasional lawyer joke. But when you really need a lawyer, not having one can be deadly serious. The ugly truth is that many people in Georgia simply do not have access to a lawyer at their most critical time in their lives, either because of where they live or because they can't afford one. Last year during my first state of the judiciary address, I told you all that there were seven counties in Georgia with no licensed lawyers, zero, none. Sadly, that number has not changed and remains the same. Of course, Georgia alone is not alone in wrestling with the problem of legal deserts data from the American Bar Association reveals that in the year 2020, 1300 counties in the United States had fewer than one lawyer per 1000 residents. Many had no lawyers at all. And we know that the lack of legal advocacy can make it harder for folks to access other needs such as housing, medical care and child support. Seeing this challenge in Georgia will not be easy. On the one hand, we still have a relatively steady stream of prospective attorney seeking admission to the bar. 732 new lawyers passed the July 23 bar exam. But it is highly likely that most of them plan to practice in and around the Atlanta metro area where the private sector jobs tend to pay higher salaries. Pay is also a compelling consideration for new lawyers who are facing sizable student debts. Whatever the causes, there is much work to be done to recruit lawyers who can meet the basic needs of those dealing with adoptions or child custody matters, business disputes, evictions, contested wills in the states, and more in our currently underserved parts of the state. One way the Supreme Court is addressing the lack of lawyers in rural areas is by removing unnecessary barriers to practicing law in our state. I am proud to announce that last fall my colleagues and I on the Supreme Court voted to revise the rules governing provisional admission to the practice of law, which included for the first time a provision and a process for spouses of active duty service members. This change was part of our ongoing review of the recommendations of the Georgia lawyer competency task force and under these new rules that went into effect on January 1st of this year, the lawyer spouse of an active duty service member who is currently assigned to a post in Georgia may obtain a provisional license to practice law here in Georgia under certain conditions without having to sit for the bar exam. This new provisional admission will offer them greater certainty, it will save them considerable time and cost also as they continue their legal careers. It also recognizes I think the significant sacrifice the spouses making to serve our country. A sacrifice made all too real this past week as three Georgians lost their lives and many others were wounded while serving our country in Jordan. Let me now turn briefly to some other emerging challenges facing the judiciary. New advancements in generative AI present new opportunities and risks for Georgia courts. Our Judicial Council standing committee on technology is studying the issue and I'm one of three state chief justices currently serving on the national conference of chief justices, AI rapid response team. A team created to examine some of the immediate issues related to the use of generative AI in courts and the impact it could have on court proceedings and the integrity of the judicial process. You are all undoubtedly aware of the increasing challenges generative AI is causing across society and the courts are not immune. Just like any tool AI can be implemented in ways that enhance and indeed improve the administration of justice and even improve access to justice. But it can also be used unethically to threaten the veracity and integrity of court proceedings. So while our court is not quite ready to make any sweeping rules changes, we are keeping an eye on this emerging technology and are prepared to ensure that the operation is.\n\nthat the court are not adversely affected. Another critical issue facing our trial courts relates to case management and case data. The value of having access to reliable, accurate judicial data is paramount to informing judicial decision making and improving public safety. Just this past week, we've seen the Atlanta Judicial Circuit dealing with enormous challenges due to the hack of their IT system, which included their judicial case management system, which highlighted the need for information security as well. We assure you that we will continue to explore new ways to address this issue to improve judicial case management in Georgia. I'd like to end by saying what a privilege it is to be a judge. And while I often like to remind lawyers that dedicated professional counselors are necessary to an independent judiciary, so too are judges. And any, I'm sorry, and independent judiciary grounded in faithful adherence to the rule of law is critical to upholding our country's foundational principles of freedom and democracy. And adherence to these principles necessarily helps build public confidence in our courts. Not as partisan weapons or super legislatures, but rather as judicial officers who have taken an oath to administer justice without respect to person, to do equal rights to the poor and the rich, and to faithfully and impartially discharge and perform all of the duties incumbent on us as judges of the courts of this state, according to the best of our ability, and understanding, and agreeably to the laws, the Constitution of this state, and the Constitution of the United States, so help us God. My good friend and former colleague, retired justice Robert Benham, has said many wise and notable things in the decades he served our court and our state. But one that sticks out most in this moment is his belief that throughout history there have been three great professions. Medicine because it preserves the body, theology because it preserves the spirit, and the law because it preserves civilization. I concur. Thank you all for inviting me here once again to speak on behalf of Georgia's judicial branch. I continue to be optimistic about what is ahead, while also remaining realistic about the challenges we are facing. May God bless you all and your families, and may God bless the great state of Georgia and the United States. Thank you. Thank you. Good job. Good job. A wonderful job. And thank you for your service, Justice Bugs, and thank you Supreme Court and Justice of Appeal. Thank you for your service. We so appreciate that. Mr. Dorkey, please escort Chief Justice and the Justice of the Supreme Court, as well as the Justice of the Court of Appeals. Please escort them out of the chamber. Thank you. Let's give them a round of applause. Thank you. Thank you. Thank you. Thank you. I recognize the seamless protein for motion. Thank you, Mr. President. Mr. President, I move that this joint session of the General Assembly be dissolved. The protein has moved that this assembly be dissolved. All those in favor of sanctify by saying aye. All those opposed, no. I ask that they have it. Have a wonderful day. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. House will come back to order. Former House members, we're not taking you back. Former House members, we're not taking you back. Senator Josh, I met you. That's always good to have you back in the house for brief times, right here. Brief times. No extended times. Members will please come to the floor and take their seats. We're going to move on to the rules, calendar. Removing on to the rules, calendar. Mr. Clerk, will you read the caption to House Bill 915-915? My reps and a burns, the 1509 Jones and the 47th, the 145th, to be titled back to amend the act, making and providing appropriations for the state fiscal year, beginning July 1, 2023 and ending June 30, 2024, known as the General Appropriations Act. This bill I'm referring to the Committee on Appropriations, that committee recommends that this bill do pass by substitute. Ladies and gentlemen of the House, the chair resolves the House into a committee of the whole House for the purpose of considering House Bill 915, the Sub-Militar Appropriations Bill, the chair appoints a gentleman of the 104th, the Majority Leader, frustration as chairman to preside over the Committee of the whole House. Chair recognizes the gentleman from the 155th District, Chairman Hatchett, to present the bill. Thank you, Mr. Leader. You all is only about a half a bottle. But I've cheated. I've already had lunch. Last year, with many of you, put together my first budget as the brand new chairman of the Appropriations Committee. I was incredibly proud of the budget that we had agreed upon with the Senate. And the priorities that this House had championed like enhanced law enforcement salaries and expanded the mental health services through 988 and behavioral health crisis centers. Adjusted ranks for many of our health care providers and funding dental as a covered service for our adult Medicaid population. Is it perfect? No. But I was proud of it. And I wasn't just proud of it because after serving in this chamber for 12 years and seeing the budget process from the outside, I got to go behind the curtain and participate in all the long hours, the thoughtful reflection, robust conversations, and the difficult decisions that are all part of making a budget work. I was proud because it was a good budget. Georgia had endured a great recession and the uncertainty of the COVID-19 pandemic. And through good conservative management had come out on top. For more than 10 years, Georgia had grown. But agency budgets had largely remained flat with the exception of workload adjustments. We listened to the agencies and advocates and did the best we could to address the incredible backlog of need across the state with the constraints of the revenue estimate that we're given. It was a good budget. Now I'm not going to rehash what happened next. We already know. And I like you waited until January to learn the final fate of many of the priorities that we had funded in the budget that were disregarded. I would like to point out that upon further review, there were a number of items that the General Assembly funded in the budget that were eventually released to agencies this fall, including salary adjustments for staff at the state's psychiatric hospitals to increase bed capacity. General staff at the GBI Crime Lab to address the crime lab backlog and faculty positions at UGA to support the peach blueberry and citrus industries. Since the beginning of this current fiscal year, I've enjoyed the open lines of communications with Governor Kemp, Lauren Curry and Rick Dunne regarding the budget. We may not always agree on each issue, but I do appreciate their willingness to listen to our concerns and priorities. One final note on the district guards, while some budget items were released to agencies, others were repurposed in the budget that you have before you now, and used to fund other agency priorities, many which we agree were also needed. By the time we put the finishing touches on this amended budget, the fiscal year will be nearly three-fourths done. While there were some items that we could implement mid-year, like reinstating a $2 per DM increase for county correctional institutions, most of the disregarded and redirected items did make sense to try to address in the middle of the fiscal year. For these items, please note that we aren't done with the discussion. The conversation will continue as we look at the FY25 budget. We are the appropriators, and we absolutely have the authority under the Georgia Constitution in setting policy in this state, and the budget is the most direct way we do that. We will continue to use the budget in FY25 to reflect and restate the priorities of this house and the people we represent. With that being said, I'd like to walk through the key changes in the budget. The amended FY24 budget is an historical one. We've been saying this the past few years as we emerge from the uncertainty of the pandemic and revenues continue to climb. We've used the past two amended budgets to make strategic investments in the technology projects, replace an aging fleet of state vehicles and school buses, make much needed repairs and updates to state facilities, and invest in human capital, the people who provide services to our citizens daily. This amended budget will be no different except the magnitude of the impact will be much greater. For the first time in many years, agencies were able to ask for 3% enhancements in both the amended 24 budget and next year's FY25 budget. Agents were also allowed to ask for strategic one-time enhancements that move the needle on program outcomes, improve customer service or provide a significant improvement on how services are delivered to our citizens. The request that were submitted highlighted great need across the state agencies. Many agencies requested continued investment in human capital to maintain the state workforce. An infusion of dollars was also requested to address aging buildings across state agencies, including the states, psychiatric hospital network, state prisons and colleges and universities to replace IT systems used by various agencies that are more than 20 years old. I applaud the governor's response to these requests. In addition to revenue growth, the governor's revenue estimate for the amended 24 budget includes $2 billion in surplus funds for a total infusion of $5 billion or an increase of 15.6% of the original revenue estimate. $5 billion. You know a lot of good with $5 billion. Not every item in this budget is glamorous, but I can tell you that it's needed, like. A $1.5 billion investment in transportation projects above the normal motor fuel funding for construction and maintenance. The House agrees with the governor's infusion of funds for DOT and targets $659 million to expedite the department's existing pipeline projects, including those dedicated economic development. $599 million for infrastructure projects that promote freight and logistics. $200 million for one time infusion of funds to support our local roads. $100 million in capital maintenance to continue resurfacing projects for the rest of this physical year. And $53 million in airport aid and additional $4.2 million in rail to continue upgrades to our state-owned rail system. An unprecedented $500 million strategic investment in the employee retirement system to improve the funding ratio and the long-term financial viability of the system. Last year the House led the way with an investment of $27 million, not only as a one-time ad in the amended 23 budget, but put that same amount in the base budget to provide a small one-time payment to address the short-term needs of our state retirees. This infusion begins the long-term needs of the plan. And the desire to return to an 80% funding and healthier COLA for our retirees. Over the summer many conversations were had about how to make one-time and pack full investments that will benefit the state for years to come. I appreciate the open conversations had with the employee's retirement system, OPP and the Governor's Office and our Senate colleagues about which scenario would have the most stabilizing impact on the system and I fully support the Governor's recommendation. In another investment in human capital, the Governor's budget included and the House supported the more than $300 million to provide a one-time salary supplement of $1,000 for state employees and teachers. The steady increases that the Governor has been providing for teachers and state employees in previous budgets, this budget and for FY25 have been moving the needle to stabilize the state's workforce. Turning to public safety, $450 million is appropriated to continue the construction of a new state prison in Washington County. We're all aware of the safety and security concerns within the state's prison system and the desire to keep both inmates and correctional officers safe. This new facility features a separate staff as an aim for access and observation, pre-cast cells and rear pipe chases to prevent the introduction of contraband and weapons. The correction budget also includes a nine-million-dollar infusion in safety and security projects and existing facilities, with an emphasis on putting an end to the use of cell phones by prison inmates. $135 million to address a backlog of need for the maintenance and repairs in existing prison facilities, and $5.2 million to housing makes at private prisons while these repairs are made at the state facilities. There are two more items under the public safety umbrella that I'd like to note. First, county correctional institutions. Last year we attempted to adjust the daily per day we pay counties to house 4,500 state inmates. I've continued to hear from many of youth throughout the fall that this is an urgent need for our state to address. We're currently paying county correctional institutions $22 per day. This adjustment brings them to $24 per day. God no math. We know it's costing many of these facilities as much as $50 per day to house these inmates. The state cannot afford to lose this bad capacity or wait until July to address. The house version of the budget reflects this $2 increase for county correctional institutions effective April 1, 2024. The house budget also includes $315,725 to the Criminal Justice Coordinating Council for a dedicated sexual assault nurse examiner coordinator in all state-funded sexual assault centers in Georgia without a full time saying beginning April 1, 2024. This funding will ensure the integrity of critical forensic medical examinations needed for the prosecution of a sexual assault. Human coordinators are trained in trauma response to handle victims with care and integrity while gathering evidence. The house has led the charge on funding for mental health support and this budget is no different. This budget includes $60 million for the Department of Behavioral Health and Developmental Disabilities to address regional state hospitals urgent and significant capital needs. This summer I visited one of these hospitals and I saw the need first hand. I mentioned this need for a significant investment to Rick Dyn from OPP. Rick thank you for listening. Forensic bad capacity continues to be an issue and the house supports the Department's request for alternative treatment by funding $664,000 for a new 30-bed jail based program in Dodge County that would provide services to restore inmates to competency and address the forensic services backlog. The house also added $2 million to DBA HDD for a pilot program to implement transportation alternatives for individuals experiencing a mental health crisis. This pilot can provide relief to local sheriffs who currently are providing this transportation. We all know that the demand for services by those in crisis are not diminishing, especially for our youth. The house version of HP 915 repurposes $10.4 million in unutilized funds to provide for the construction of a child and adolescent crisis stabilization unit in Savannah. There are currently only five other facilities in the state to serve children in youth in crisis. This 15-bed facility can open and begin treating youth in the spring of 2025. Additionally, House Bill 915 provides $93 million for skilled nursing centers to reflect the 2021 call reports and $120 million for increased humanization among the Medicaid population. As Georgia is redetermining its Medicaid population due to federal instructions, the amended FY24 budget recognizes the savings of $181 million due to a decline in enrollment. It is the hope that some of these savings can be utilized in the FY25 budget to advance the priorities of the General Assembly from last session, including much needed provider rate adjustments. The House restates its supports for several items, including $148,250 to support new and existing housing for medical students with the Area Health Education Centers. $50,000 to further support Lupus Research Data Collection Awareness and Education, and $153,000 for the long-term care on budget and program to reflect an increase in the cost of their services. In higher education, the Governor recommends in the House supports $178 million investment to design, construct, and equip a new dental school at Georgia Southern University in Savannah, and $50 million for the design and construction of a med school at the University of Georgia to meet the growing health care needs of Georgia's. HB915 includes $81.2 million for major renovations, repairs, and demolitions at University System of Georgia Institution statewide, and $15.8 million for B-Unit projects to address a backlog of need. When we left this chamber last session, there was a $66 million dollar hold in the Board of Regents Teaching Program, which disproportionately impacted non-research institutions. I, like many of you, was not happy leaving those funds out of the budget. I'm thankful that the Governor has restored those funds, and the House version leaves them intact. The House supports the Governor's recommendation for infusion of funds for TCSG to support workforce development and the Quick Start program, including $15 million to complete the Rivian Training Facility and to meet existing training obligations. In a $19.5 million dollar for specialized technical programs to support growing workforce needs and the electric mobility industry across the state.\n\nThe housing budget provides $2 million to support the construction of the Anne Frank Education Center. I know this project is near to many of you and has been for several years. The house looks to the Senate to add the initial $2 million to match the $4 million raised privately. Moving on to K-12 education, the amended FY-24 budget includes more than $145 million in formula earnings. And nearly $1 million to meet our obligation to fund AP STEM exams based on an increased utilization. Many of you are familiar with the communities and schools and its tremendous track record of success in meeting the whole needs of a student and improving academic success. The house has included an additional $1.57 million in the amended FY-24 budget for communities and schools to leverage. A three-year grant to expand the program to 10 additional school districts. By the 2025-2026 school year, CIS will serve 46 districts, 240 schools, and 140,000 students. The Governor's Honors Program had requested and the house has funded $65,000 for technology updates to further their efforts to an increasing rural participation in the program. Finally, with a general assembly's focus on literacy, the house version of the budget includes $8.9 million in lottery funds to allow decal to continue the summer transition program at its current level of service. The summer transition program provides rising pre-case students and rising kindergarten students with an extra support in language literacy and math to close the achievement gap. This additional funding would allow the program to continue providing these needed services to 396 classrooms and over 4,600 students. Turning to general government services, the house agrees with the Governor's Edition of $250 million in the Department of Administrative Services to address workers' compensation settlements, growing liability expenses, and increases to the property insurance cost. Shoring up those funds helps avoid deficits and allows the Department to settle claims to promote savings and cost avoidance. The Mended FY24 budget provides $158 million to the Technology Empowerment Fund at the Georgia Technology Authority for new and unmoving projects including the Next Gen Project, which will replace the state's aging time management and human resources system. Funds are also provided for the Department of Labor to migrate unemployment insurance applications to a cloud-based system and replace the antiquated U.S. software. The software currently used for U.I. program was created in 1982. The Board of Regents also receives one-time funding to replace its 20-year-old financial human resources and student information system. The House version of the Mended FY24 budget includes $5 million for third-party ballot text auditing technology to allow the Secretary of State's audit to audit and verify the validity of any election in the state without the use of the QR codes. The agency also receives $1.7 million to account for increased postage expenses when mailing new precinct cars and $110,000 to improve election security by adding visible watermarks to all ballot paper. HB915 also includes $6 million for the Secretary of State's Office to replace uninterruptible power supplies for $16,000 voting machines statewide. The Mended FY24 budget also includes $145,600 for the Professional Licensing Division to hire temporary employees to address the program's backlog related to licensure applications. Finally, the Governor's made a number of strategic investments in economic development agencies that promote the long-term business growth of our state. This includes $100 million to the One Georgia Authority to support rural economic development projects and expand grant opportunities for rural site development and $100 million to regional economic business assistance program for economic development projects. This program helps to make Georgia more attractive to businesses seeking to expand or relocate here. The House supports the Governor's recommendation to provide $250 million to GIFA, the Georgia Fund for low-instrush loans for water and wastewater infrastructure development in local communities. I've heard from many of you about the needs in our community and these funds are sorely needed. Finally, the House provides the Department of Agriculture with $500,000 in planning money and $35 million for innovations and improvements at the Atlanta Farmers Market and $2 million to implement the Georgia Farmland Conservation Fund. The Fund will award matching grants to support farmland conservation, food and farming production or the purchase of agricultural conservation easements. While I didn't hit every item, I hit the highlights and there are a lot. The budget is a process and it certainly takes a team of people working together to pull this off. I'd like to thank the subcommittee chairs, Secretary Meeks, the staff of the House Budget Research Office for all of their hard work and Rick Dunn and Lauren Curry for the open-air budget. I look forward to working with the Senate to put the finishing touches on this budget and move to the FY25 budget. There's much to be proud of in this budget and much good that can be done with it. I urge your favorable consideration of House Bill 915 and Mr. Leader, I'll attempt to answer any questions. Thank you, Mr. Chairman, for your presentation. Do you yield for questions? Yes. Chair recognizes Leader Beverly for a question. Thank you, Mr. Chairman. This is your gentleman Yeal. Yes, first of all. You mentioned during your presentation, thank you, thank you, guys, for doing a budget. But you mentioned in your presentation, there's $180 million that because of folk who didn't enroll on the Medicaid unwinding that you're going to repurpose that $180 million. The question that I have for you is this is people who lost their insurance through no fault of their own beauty unwinding. There's a bunch of people, 100,000 people have lost their insurance last year. How do we use a part of that money to make sure that those folk get back on the roles? And I didn't see how you would staff that out within the budgetary process to make that happen. He recognized that savings. We added a little more 28.2 million actually to recognize that savings. There's a surplus currently of about 130 million above those savings. So that's, we did those. The funds, so let me think to describe define this or say this right, you have up to 90 days after you supposedly are off and ability to reapply in you are eligible for benefits in that 90 days. All of the numbers that you're looking at will Medicaid or projections, they change and that's said there, they're being conservative in allowing the spending of some of that money in the budget because they know there are those that could still come back and reapply and requalify for those benefits they had 90 days before. Thanks. Thank you. Do you yield? Yes. Chair recognizes represented Jasmine Clark for a question. She waves. All right. Chair recognizes representative more for a question. Good afternoon. Is it gentleman you yes. Thank you. Do you recall in this particular budget if there was any money set aside for the the burial resting place for veterans in Savannah or in South Georgia? Do you recall if that's in that particular budget? We can you get with me and I'll answer that afterwards there there is some money out there, but I don't know specifically where it which area of the state it went to for a cemetery. Yes. Thank you. Chair recognizes chairman Perkel for a question. Yes. I did understand correct. Does it get gentleman you for a question? Yes. Is it true that I understood that you said that we have additional $1.5 billion in fusion into the state's transportation network? Correct. Is it also not true that this will provide much needed current and long term growth of the state in our transportation infrastructure? Yes. I would like to add that the total investment in our transportation network by us this state over this fiscal year is $3.9 billion. One final question. Yes. Would you repeat that last number was that was that would it be? 3.9 billion. Thank you so much. Thank you. Mr. Chairman thank you to the governor that's greatly important work. Mr. Chair I know I'm what's standing between everyone in here and a little thing called lunch. So I'm going to yield the well and ask for everybody's favor of consideration of HB915. And you have no further questions. Mr. Chairman I want to thank you for your hard work on the budget. I want to thank director Christine Murdock and the entire house budget research office staff for the tremendous work here and thank you for your thorough presentation here today. At this time Chair recognizes Chairman Hatchet for emotion. Thank you Mr. Chair I move that the house bill 915 do pass by committee substitute. At this time the chair recognizes chairman David Knight. Mr. Chairman I'd like to second that motion we pass house bill 915. Chairman David Knight seconds the motion made by chairman Hatchet. At this time we'll call the question on house bill 915 all in favor at this time will signify by saying aye. All opposed will say no. The eyes have it and house bill 915 passes by committee substitute. The chair recognizes the gentleman from the 155th district chairman Hatchet. Mr. Chair is chairman of the committee of the whole house. You're instructed to report the action the committee of the whole house to the house. Chair recognizes the gentleman. Chair recognizes the gentleman. Mr. Speaker the committee of the whole house has had under consideration house bill 915 and has instructed me as its chairman report the same back to the house with the recommendation that house bill 915 do pass by committee substitute. The report of the chairman of the committee of the whole house is received the committee of the whole house has had under consideration house bill 915 and have reported the same back to the house with the recommendation that the whole house that house bill 915 do pass by committee substitute. The committee of the whole house is hereby dissolved. The chair has done the previous question is ordered is in objection to agreeing to the report of the committee which was favorable to the passage of the bill. The committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine. All members voted. All members voted. I see a couple more coming in. All members voted if so. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. All members voted. members and members of the public. This was especially the case in some South Georgia counties where health drestics include multiple counties in several hours of drive time for certain members. The members appointed to serve on these boards are busy professionals that can step away from the job for one or two hours but not three to six hours. House Bill 883 amends Code section 501401 relating to public meetings and will authorize county boards of health and community service boards to conduct these meetings to conduct these meetings via teleconference as long as they are accessible to the public and meet all other requirements of the open meetings law. This change does not replace in person meetings but does provide the option for a full teleconference meeting or a hybrid meeting when required to meet a quorum. Without Mr. Speaker I'm happy to answer any questions. You have no questions. Thank you. I yield the well and ask for your favorable consideration. Good job. The gentleman is yielded the well. Is there any objection to the previous question being ordered? Chair has done the previous question is ordered? Is there any objection to adopting the committee substitute? The chair has done the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair has done and the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill will vote green? All those yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. If so, Mr. Clerk will you lock the machine on the passage of House Bill 883. The yeas are 162. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to House Bill 1035. House Bill 1035, I represent a coup or the 45th and others to be entitled to amend Article 3, Chapter 13, in Title 16 of the fiscal to Georgia annotated relating the dangerous drugs. So to expand the exemption of Naxalon from the definition of a dangerous drug to include any opioid antagonist when used for drug overdose prevention. This bill I refer to the committee on public and community health that committee recommends that this bill do pass. Chair Lady Cooper is recognized to present the bill. Chair lady. Thank you, Mr. Speaker. I want to start by saying a great big thank you to those in this chamber that were here 10 years ago. It's hard to believe it's been 10 years when we passed the 911 Amnesty Bill that said if somebody was doing drugs with a group of friends and they got into real severe medical emergency that if one person would call 911 and stay with them until help arrived that we would not charge that person even if they had been doing drugs or drinking too much on if they were under age. Of course there was an exception that did include if they were the drug dealer. Since that bill passed thousands of young lives in this state have been saved. There's a group that's been keeping counted the ones they know about where they have given out Norkham and they're over 7,000 lives that they know that that bill has saved and it's partially saved because it was the first time that we started letting people use Norkham and began to make it more available. Well unfortunately in the 10 years that have passed a lot has changed and not for the good. Our drug overdose deaths it's the leading cause of people ages 18 to 45 and at the epic center of that are our colleges and so what this bill does it allows the public health commissioner to expand her standing order for the new drugs that are coming out that are opioid antagonist. We have to have stronger drugs now because the drugs that people are taking are stronger so we have new antagonist coming and the only one that the law currently allows is Norkham so it gives that it gives the public health person a commissioner the ability to do that. It also does another thing but I think you're fixing to see on college campuses across our state. Emory came to me asking to change the law that kept pharmacists from being able to put Norkham and these type medicines into a vending machine because they want to put the vending machines throughout their college campus so that students can go there without being identified and get Norkham perhaps for a friend perhaps just to have it at their outpouring but for whatever reason and so this bill removes that exemption. You know some people said well you know are we encouraging drug? No drug use is happening what we're doing is as long as somebody's alive there is hope that we can get them off drugs if they're dead there no hope. This bill expands our ability to give hope to people who are doing drugs and get into medical emergencies. With that Mr. Baker thank you for letting me take a little extra time I know it's only staying the well this long.\n\nand I would ask for your favorable vote on House Bill 1035. And I will yield the well. Thank you. The lady has yielded the well. Is there an objection to the previous question being ordered? Chair Hesnund, the previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill that Chair Hesnund, the report of the committee, is agreed to. Shall this bill now pass, all in favor of the passage of the bill will vote yes, all those opposed will vote no, and the clerk will unlock the machine. Have all members voted? All members voted. If so, the clerk will lock the machine. All in the passage of House Bill 1035, the yeas are 163, the nays are zero. The bill, having received a requisite constitutional majority, is therefore passed. Thank you, members. That completes the rules calendar for today. We'll move on to afternoon orders. Members, we have, we only have about five afternoon orders, but members, I want you to pay close attention and give your respect to these first two especially. Representative Crow and the Henry delegation. Representative Crow and the Henry delegation to recognize for or an afternoon order. Members, feel stand. All right, thank you, Mr. Speaker. Colleagues are rise with heart rate and news for my district in Henry County. Last Thursday morning, the beautiful little eight-year-old girl pictured here was struck by a vehicle on Jackson Lake Road as she was attempting to board her bus by a vehicle that had failed to stop for the red flashing lights. She was flown by helicopter to Children's Healthcare, but Atlanta, where she sadly succumbed to her injuries on Saturday morning. The following statement was posted online from the family. It is with the broken heart that we are announcing that Adeline Christine Pierce has been welcomed into heaven in the arms of Jesus. Her shoulders with him, but her sweet little body is being prepped to save lives. Adeline has the ability to save eight lives with the organ donation and help 75 children with tissue donations. Her life's mission was to help and pray for others. She now gets to do that in the most heroic way. As for now, we ask for privacy and prayer as we will be with her the coming days to prepare her for her gift of giving life and healing to other children. Please try to understand we need to have peace during this process. We have seen all of the prayers and can never express how much we appreciate all the love and support. We will notify everyone when a service will be held pending her surgery for transplants. The statement also included two verses scripture from the family. Brothers and sisters, we do not want you to be uninformed about those who sleep in death so that you do not grieve like the rest of mankind who have no hope. For we believe that Jesus died and rose again. And so we believe that God will bring with Jesus those who have fallen asleep in him. First, that's all onions for 13 to 14. And God is our refuge and strength and never present hell been troubled. So I'm 46, verse one. I pray for God's mercy and comfort for this family as they grieve the loss of this precious angel. Please join me in a moment of silence in honor of this heroic little girl. Amen. Thank you, Mr. Speaker. Members, if you remain standing for a moment, we will remember what a beautiful child a life ended way too soon, but what a heroic family for blessing so many people with their disgift. Now we're gonna go to someone who served this state well. They form a member of this house, the Chairman Rodden Stevens will bring to our attention and recognize the contributions of this great man to our state and to the area around Savannah and Chattanova County. Chairman Stevens. Thank you, Mr. Speaker. And I'll be joined by the coastal delegation along with folks that have known the gentleman. And this man that I'm about to tell you about probably touched all of your lives in some way or another. He's served in this body for a very long time. His name was author Jen Lat. He was a person that passed away yesterday with leaving behind him after 69 years as wife, Molly Barnhart, two children, Treeson Mat, both of which I know, six grandchildren. And of course you know what that means. He's best known for the 40 years that he served as chairman of the board for the Georgia power, excuse me, the Savannah Electric and Power Company and he retired there after 40 years. They then combined and joined forces with Georgia power. He was also elected and served for eight terms here in the House of Representatives, where he served as chairman of the university system of Georgia and now higher ed. And then he was also appointed by different governors to the board of regents where he served as chairman and then to the Georgia Ports Authority where he served as chairman. He was a member of the Metropolitan and this is gonna be a good one for you. He was a member of the Metropolitan Atlanta Olympic Games Authority, those of you that might remember the 1996 Olympic Games. And the Georgia Board of Industry, Traderon Turism, now the Georgia Department of Economic Development and Tourism. He was a member of CEDA in Savannah, the Savannah Economic Development Authority. And he was a man that chaired and ran the United Way in a way without having to pick up the phone and ask people to give. They just did because it was art. He was a member of the Armstrong State College Foundation and a member of the Georgia International Maritime Trade Center Authority. Ladies and gentlemen, would you bow just for a moment of silence as we honor this man and his family? Thank you ladies and gentlemen and thank you Mr. Speaker. Thank you Mr. Chairman and delegation. I'm sure all of you in this room that I was able had the great honor to know Mr. Arthur Genlat personally. We laid the rest a good man over in Columbus on Monday and I can assure you Arthur Genlat was a good man as well. He will be sorely missed and appreciated. He will be sorely missed and appreciated in that community and our state. Representative Jasmine Clark is recognized for an afternoon order. Representative Clark. Thank you Mr. Speaker. Today I want to recognize that it is national, black, HIV and AIDS awareness day. 14% of the U.S. population are black or African-American yet black people make up 40% of new HIV infection. Most of these new cases occur right here in the South and a recent report even stated that Metro Atlanta has the highest rate of new HIV infections in the world, not just the country in the world. But it's not all bad news. Case numbers are dropping as we put forward policy that promotes prevention and HIV intervention. And so I want to encourage us to continue to do that so we can move closer and closer to eradicating the HIV epidemic in our state and in our country. And with that, I want to just say thank you all for sorry losing my train of thought. I want to recognize those who have succumbed, have succumbed to AIDS. Just a quick moment of silence. Sorry about that. And I want to thank you for your time in recognizing national, black, HIV and AIDS awareness day. Thank you, Mr. Speaker. Okay, we have a good one coming up now. Representative Hagen, Chairman Paris, Chairman Workhizer. They have a recognition here. Come on up here, Chairman Paris. We need you up here to recognize this gentleman and just great accomplishment. The reflex on us all in a very positive way. Is he still here? Do you leave? I'm not sure. We're going to do this anyway. Well, I wonder if you all knew that this happened last week. Did we have it? There it is. Is Representative Franklin here? There he is. Okay, well, he is a very humble man, a member of our caucus. So you may not have heard that out of 49 nominees, our own representative, Lavin Franklin, was named one of the five finalists for Time Magazine's dealer of the year for the entire nation. Mm-hmm. It's one of the auto industries, highest honors, and although he wasn't ultimately chosen as the dealer of the year for 2024, we're certain Time Magazine will correct that mistake next year. So congratulations, Representative Franklin and Franklin Toyota of Stakesboro. Thank you. That's a lot of Cadillac GMC Chevrolet's and Toyota's that went out the door there. I guarantee you that. Congratulations, Lavin. Mr. Clerk, you read the caption to a group of privileged resolutions. Honoring the life and memory of Sergeant Kennedy Ladon Sanders. Recognizing February 7th, 2024, Stan was survivor's day at the State Capitol, recognizing February 20th, 2024, is Clark Atlanta University Day at the State Capitol, commending Taiwan for its relations with the United States and the State of Georgia, commending the Professional Association of Georgia Educators in recognizing February 20th, 2024, is a page day at the State Capitol, recognizing February 8th, 2024, as then a high genus depreciation day, recognizing commending, or he more is upon his selection as head coach of the Atlanta Falcons, recognizing commending the urban league of greater Atlanta young professionals in the urban league of the River Valley young professionals, recognizing commending Tony Cocharam. Recognizing commending Charles Bailey upon the occasion of his retirement, recognizing commending the NAACP, National Office, commending Georgia Community Service Boards in recognizing February 13th, 2024, is Community Service Boards Day at the State Capitol, commending Richard Postell on being named Henry County Public Schools 2023 Teacher of the Year, recognizing commending Joe Yeager on his outstanding public service with the Georgia Department of Natural Resources, recognizing and commending Dan Castan, recognizing and commending Ivan Shamas, recognizing and commending Travis Malloy, and for all the purposes, I can please the reading of the privilege resolutions. Is there any objection to adopting the privileged resolutions? Chair, here's known in the resolutions are adopted. We're moving on to announcements. Chairman Corbett, there you are. Recognize for the announcement. Thank you, Mr. Speaker. The rule caucus will meet over in the Ag Building upon adjournment. Lunch will be served. Y'all come join us. Thank you. Representative Crowe is recognized for the announcement. Thank you, Mr. Speaker. Public Safety and Homeland Security Committee will meet upon adjournment in room 506 of CLOB. Public Safety and Homeland Security room 506 upon adjournment. Chairman Chokas is recognized for the announcement. Thank you, Mr. Speaker. The small business development committee will meet at 3 pm today in Capitol 403. I need as many people to attend as possible. We've got one bill. Thank you. Representative Ballard in Hilton are recognized for an announcement. Thank you, Mr. Speaker. The Education Committee on Policy will be meeting in room 515 at 2 o'clock. 515 at 2 o'clock. Wait a minute. Thank you, Mr. Speaker. The Education Curriculum Subcommittee will meet immediately upon adjournment in 515 CLOB. Thank you very much. Thank you very much. Chairman Sains is recognized for an announcement. Thank you, Mr. Speaker. The Economic Development and Tourism Subcommittee on Sustainable Economic Development will meet tomorrow for a lunch and listen from our friends down at the Okie-Fanokie Capitol Room 216, 12 to 2 pm. Drop-ins of all members are also welcomed. Vice Chair Gaines is recognized for an announcement. Thank you, Mr. Speaker. Tomorrow is dogs at the Dome Days. There'll be a lot of UGA students here tomorrow and you're invited everybody for breakfast, from 8 to 9 in the rotunda and then from 11 to 12 in the morning. There'll be a strawberry ice cream pie social. Great strawberry ice cream pie is the best dessert and all of Georgia. So y'all come down and visit tomorrow with UGA students and enjoy breakfast in strawberry ice cream pie. Where will that be? In the rotunda we'll make sure you get a special delivery, Mr. Speaker. Thank you. Go dogs. Go dogs. Everybody, where are you red and black tomorrow? I can do that for that ice cream pie. I can do that. Chairman Billy Mitchell recognized for an announcement. Thank you, Mr. Speaker. There will be a Democratic caucus meeting tomorrow morning 9 a.m. in room 216. Breakfast will be served. Thanks a lot, Mr. Speaker. Members, we do have pages today. So if you have a page, come down front. Mr. Majority Leader, did I mention today is the clerk's birthday? Did I mention that? Bill Raleigh's birthday today? Did I mention that? No, yeah. Yeah. Bill Raleigh has a birthday. We're going to celebrate it all day long. And I hope Pranee's coming down. Great. Majority Leader is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Thursday, February 8, 2024. On the motion of the Majority Leader of this house, that this house stand adjourned until 10 a.m. Thursday, February 8, 2024. All those in favor will say aye. All those opposed will say no. Y'all are clearly misled. The eyes have it. We are adjourned.",
  "updated_at": "2026-02-13T21:46:27.525441+00:00"
}