{
  "video_id": "RDho8v5-sjw",
  "url": "https://www.youtube.com/watch?v=RDho8v5-sjw",
  "title": "Child Custody, Sentencing Reform, and Housing: Georgia Lawmakers Debate Key Legal Issues",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Here is a structured markdown summary of the Georgia legislative session transcript on child custody, sentencing reform, and housing:\n\n### Overview\nThe session featured discussions on key legal issues facing Georgians, including child custody laws, sentencing reform for certain non-violent crimes, and housing-related matters. Lawmakers debated proposals to reform the state's approach to child custody in divorce cases and allow judges to revisit certain life sentences without parole after 20 years of incarceration.\n\n### Key Actions\n**SB 404**: Legislation to establish a presumption of 50/50 child custody in divorce cases, with judges retaining discretion to deviate from this default based on the best interests of the child.\n\n### Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n### Notable Moments\n- Republican Senator Ed Settzler argued that SB 404 would help keep both parents involved in children's lives after divorce, reducing domestic violence and improving child outcomes.\n- Democratic Representative Scott Hulkcom discussed a bill to allow judges to revisit certain life sentences without parole after 20 years of incarceration, focusing on non-violent offenses.\n- Lawmakers debated the potential impacts of these proposals on families, domestic violence, sentencing policies, and criminal justice reform.\n\n### Votes\nNo recorded votes were mentioned in the transcript.\n\n### Attendance\nThe transcript did not include any information about quorum or attendance.\n\n### Adjournment\nThe session adjourned, but the transcript did not provide details on when the next session would take place.",
  "transcript": "We're going to talk about legislation\ninvolving the legal issues Georgians\nsometimes face. Joining me is Republican\nSenator Ed Settzler of Aworth. He chairs\nthe Senate Science and Technology\nCommittee and his vice president of\nState and Local Government Operations\nand Secretary of Health and Human\nServices in the Senate. He's also on\nSenate Appropriations. Also here is a\nmember of appropriations in the House,\nDemocratic Representative Scott Hulkcom\nof Atlanta. A few of the other\ncommittees he serves on include Defense\nand Veterans Affairs, Judiciary and\nPublic Safety, and Homeland Security.\nWelcome back to lawmakers to both of\nyou. I appreciate this. Thank you.\n>> Yeah. Chairman Sler, I'm going to start\nwith you. Let's start with your bill SB\n404. It flips the traditional approach\nto child custody in divorce cases. Tell\nus about it.\n>> You know, Don, if we're gonna if Georgia\nto be the best place to live, work, and\nto raise a family, we've got to make\nsure that no one's left behind in that\nprocess. We think about the the\nchallenges we face. You know, more than\n40% of kids in Georgia are born out of\nwedlock. Um, in all those cases, there's\ngoing to be a child custody arrangement\nthat's put in place by our court system.\nAnd then, of course, as you see, even\nkids who are the in families where\ndivorce happens. What can we do to set\nconditions for both parents to be\ninvolved in those kids' lives to make a\ndifference in their lives? We recognize\nthat that both parents have an important\nrole in parenthood. And in Georgia, um\nthe average kid spends only 20% of the\ntime with their non-custodial parent. We\nrecognize the importance of having both\nparents in their lives is very\nimportant. And when this has been done\nin other states from Kentucky to\nFlorida, even Massachusetts has done\nthis for years, we see domestic violence\ngo down and we see the outcomes for kids\nbe dramatically better.\n>> So child the defaultest child is a joint\ncustody and then the judges would make\nthe decisions from there if they wanted\nto be one parent or the other.\n>> Judges will always make the decision for\nwhat's in the best interest of the\nchild. But what we're doing in Senate\nBill 404 is we're simply saying that the\ndefault would be a 50/50 sharing between\nmom and dad. Um that if there's if\nthere's evidence that suggests one\nparent shouldn't have as much time as\nthe other, then the judge can make that\ndetermination exactly like they can\ntoday. But the default the starting\npoint would be 5050 sharing of time. And\nwe've seen again we've seen in other\nstates that have done this a real uh\nbenefit for kids um a reduction in\nviolence and just overall better\noutcomes for the family.\n>> Okay. I'm going to get back with you on\nthat a little bit. Representative\nHulkman, you have a bill that would\nallow a Georgia judge to take a second\nlook at certain life sentences without\nparole and after 20 years, but it's kind\nof narrow in that certain defined cases,\nnot considering murder or rape or other\nviolent crimes. So, talk about that a\nlittle bit.\n>> That's right. It it's something that I\nthink is worthy of a conversation. And\nit was brought to me by Kelly Burke, who\nis a former district attorney from Hston\nCounty in the middle of our state. And\nhe was a very accomplished prosecutor,\nbut he's um very much committed to\ntrying to fix a case that he worked on.\nAnd specifically, there was a young man\nwho committed an armed armed robbery,\nvery significant offense. It was at the\ntime that George was moving to a tough\non crime approach and he was caught in\nwith statutes of recidivism. His other\nincidents weren't particularly severe\nand grave, but because he was caught\nunder that statute as a recidivist, he\nreceived life without parole. Uh the\nother individual, and nobody was hurt,\nthere was no violence that was part of\nthis. Um the other individual received\n10 years. So this person is now served\n28 years in prison for a felony that did\nnot involve violence, that did not\nresult in a death. And the idea is to to\nopen this up so that an individuals can\npetition the court and potentially have\ntheir sentence relooked at. And I I\nthink it's important both from a\ncorrection standpoint and from from a\nmorality standpoint. We know things\ntoday that we didn't know 20 years ago\nwhen we had the policies that he was\ncaptured under and it preceded a lot of\nthe good work that the state has done\nwith criminal justice reform. So I\nreally hope we can. Right now, judges\ncan't revisit those cases.\n>> They can't\n>> not even at the 25 year mark, which is\nconsidered life.\n>> And and there's limited activity that\ncomes out of the board of of pardons and\nparoles. And I think if you think about\nthe criminal justice system as a system,\nit's a fair conversation to have of\nwhether or not we want to spend state\nresources on the great cost of\nincarcerating older inmates as opposed\nto potentially putting more resources at\nthe beginning solving crime um deterring\ncrime. And so for those that have have\nreally served consequential terms of 20\nyears, it just gives a potential path to\nhave a second look at it. And certainly\nthis is one instance, but there are\nothers out there.\n>> Okay. I'm going to talk to you a little\nbit more too, Chairman. Settler, back to\nSP 404. How would it address conflicts\nin marriages that lead to divorce? Um,\ndomestic violence, maybe problems with\nthe child abuse.\n>> Yeah. What we find is that when you look\nat states that have done this before, we\nsee a decrease long-term domestic\nviolence of about 20%. U and during the\nperiod in which u custody is in dispute,\nwe see a decrease in family violence of\nabout 33%. So there's a big step down.\nWhat it does is it deescalates some of\nthe conflict between mom and dad because\nthere's they're shared time. You know,\ndad's able to pick the kids up at\nschool. Um mom drops them off, dad picks\nthem up. It's it's a more harmonious\nrelationship with respect to managing\nthe kids as opposed to dad having or mom\nhaving a just a very narrow amount of\ntime. So we've seen a deescalation in\nviolence. But again, as we said before,\nDon, it doesn't change the standard.\nJudges are still going to make decisions\nbased on what's in the best interest of\nthe child. It just gives the judges a\nstarting point of 50/50 from which they\nwould have to find facts and say, \"But\nbecause of this fact or this fact, we're\ngoing to award more custody to one\nparent or the other, but the starting\npoint is still 50/50 to again deescalate\nsome of that conflict. Would child\nsupport be involved at all in terms of\ndetermining who gives child does the\nchildhood support or helps one family\nside of the family or the other?\n>> Yeah, the the time the kid spends with\neach parents can have some impact on\nchild support. But interestingly, what\nwe found is that um you know the the\ncustodial parents that that bear the\nbrunt of the cost uh in shared parenting\narrangements, we've actually seen their\ncareers and incomes do quite well\nbecause they're because they're sharing\ntime with the kids. they're able to have\nthey're able to be able to pursue career\nopportunities for themselves. So\nlong-term the financial outcome of both\nparents is better. Um but it does it\ndoes that through the parents means not\nthrough you know a court ruling. Um it\ncould take one parent that maybe maybe\nhas another family, another marriage\nthat's that's having to send send money\nback and forth. It just creates a lot of\nconflict and the kids don't benefit from\nit.\n>> Yeah. But the judge in the end makes\nthat decision.\n>> Judge makes the call.\n>> Okay. We're going to get to another bill\nyou have. You have a bill that deals\nwith improving data tracking for crimes.\nTell us what that's all about.\n>> I'd be happy to. We live in a big data\nworld. However, when it comes to the\ncriminal justice system, we do a\nterrible job of tracking arrests,\nindictments, um prosecutions, is that\nthere's uh a real void of information,\nwhich is important for us to understand\nhow we're doing in terms of the trend\nlines and solving crimes. We really give\na lot of attention rightly to murders\nand we have very high clearance rates of\nmurders meaning that they're solved and\npeople are held accountable for it. But\nso many crimes below that we have\nclearance rates of less than 10%. Like\nrape, sexual assault and a lot of\nproperty crimes like people their\nneighbors get robbed and then nothing\nhappens. We all know about that. So what\nI want to do is really get the data out\nthere so we can see where the incidents\nare happening and also longitudinally\nhow are we doing in terms of addressing\nit and reducing it because we really\nwork in this void that's unacceptable.\n>> Okay. I want to get to something real\nquick with you. You you have um you want\nto protect home ownership through\ncreating incentives for Wall Street to\nsell homes to original to the original\nfamilies through single family homes. I\nguess you want to do that. We don't have\na lot of time. So D, we've seen an issue\naround the metro area of big corporate\ninterests, Wall Street interest buying\nup single family homes, especially in\nthe lower half of the price bracket so\nyounger families can't find a home.\n>> We're I'm going to have a bill this year\nthat's going to create both kind of a\ncarrot and a stick approach to encourage\ninvestors to sell their homes to\nfirst-time homeowners to get people back\ninto the housing business so folks can\nown their own homes again, particularly\npeople at the the lower income levels\nwho want to own their first home and get\nin become a first-time home buyer.\n>> Now, we're going to get you back in when\nyou get that bill. um ready and we'll\ntalk more about it. I do want to get\nsomething in real quick. You guys have\nknown each other for a long long time.\nYou were very excited that he was going\nto be on with you in the uh talk talk\nabout what what the connection is. It's\nat the infantry.\n>> Senator Setsler and I served together\nmore than 20 years ago in the third\ninfantry division down at Fort Stewart.\nAnd so we have a bond that goes beyond\npolitics and uh while we're in different\nparties, we have a close friendship\nbecause of that. Yeah, that it's amazing\nthat you guys did you stay connected all\nover those years?\n>> We did. We kind of reconnected through\npolitics, but you know, it's it's just\nfunny how how life kind of brings you\nthrough the the people you run into uh\nno matter where you go. It's been been\nkind of fun to watch that.\n>> Yeah, I bet it has been. I appreciate\nthat. We did put a picture up of what it\nlooked like for the 15th Infantry\nRegiment. Thank you so much. Thank you.\nThank you for serving and in the uh\nmilitary and in the G Georgia\nlegislature.",
  "updated_at": "2026-02-14T14:43:09.521192+00:00"
}