{
  "video_id": "RgINIFZho0E",
  "url": "https://www.youtube.com/watch?v=RgINIFZho0E",
  "title": "11/1/2023 - Senate Committee on Ethics",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 191,
  "summary": "Here is a structured markdown summary of the Georgia 11/1/2023 - Senate Committee on Ethics session:\n\n**Overview**\nThe Senate Committee on Ethics held a session focused on understanding the software component of the Dominion voting system used in Georgia elections. The Secretary of State's office and representatives from Dominion Voting Systems provided information on the security and integrity of the voting system.\n\n**Key Actions**\nNone. This was an informational session with no bills passed or referred.\n\n**Bills Introduced (First Reading)**\nNone.\n\n**Notable Moments**\n- The committee chair expressed confidence in Georgia's voting system but acknowledged not everyone shares that view. The goal is to continuously improve election integrity.\n- The Secretary of State was unable to attend due to a prior commitment, but his staff provided updates.\n- The committee heard from the Director of Elections and a Dominion Voting Systems representative on the security and certification process for the state's voting technology.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, though some members were still arriving as the meeting began.\n\n**Adjournment**\nThe session adjourned. No specific date for the next meeting was provided.",
  "transcript": "November, a brisk morning in Atlanta. What? So, but we're glad you're here at one we apologize for the slight delay. We had a press conference over in the Capitol in the secretary of state's office was doing a press conference we wanted to attend that and then and then join you here we appreciate that. I want to first ask Senator Harbin if he would open our meeting with our implication and the mic number please sir. Lucky 13. Thank you. All right. Let's pray. Lord, we thank you for the day that you've given us and life is a precious gift and we thank you for it. We ask that you would bless the proceedings that are here that father truth would prevail in all that we do and all that we say and ask that you would just give us a spirit of discernment of wisdom and knowledge and understanding in the events that are before us. And she does name amen. Thank you, Senator. We have a few members who are still negotiating traffic and some other commitments so they'll be joining us as we proceed with the with the meeting but I want to start by welcoming you here and making sure that we all understand that the purpose of the meeting is to have a dialogue conversation with multiple entities to understand. And well, sorry, microphone is not on. Wow. Okay. Hold on. The little red lights on. Okay. We'll try that one more time. That better. Thank you. So I want to make sure that everyone understands why we're here and I want to start by saying why we're not here. We're not here to second guess. We're not here to point fingers. We're not here to attack. Okay. We're here to understand. We're here to partner and facilitate election integrity and Georgia. That's why we're here. We're going to focus strictly on the software component of our dominion voting system and we'll limit our our testimony and our input to that function. And I want to go on record as saying I have complete confidence in the Georgia voting system as it exists today. I choose to vote utilizing the standard system. I recognize that not everyone shares that level of confidence and I also recognize that we can continuously improve the environment in which we work in. So we want to continue to do what SB 202 initiated and that was to make it easy to vote and hard to cheat. And we don't want to suppress any voters right. And I think if you look at the results of the 2022 election and we acknowledge the results of the 2022 and the survey it was done by University of Georgia and MIT. We had record turnout and we had record confidence and I want to acknowledge that and I want to thank the Secretary of State's office for fully implementing that system and making sure that people utilize it effectively. What we want to do today and I'll kind of lay out the ground rules first and then I'll introduce our first folks. We have three different entities that are going to share some information with us today and what we'll do is to do a similar format. We're going to ask the Secretary of State's office. I'll start by saying I'm disappointed. Certainly the Secretary is not here. I communicated this meeting a month ago and unfortunately he's not available. I understand. I think Mr. Starting said he's in Thomas tin or somewhere south Georgia. Hold on. Yes, the Secretary is in South Georgia today. This was a long standing commitment he has had on the calendar and and while you advise us of the date. Unfortunately, we weren't able to consult with you on when he was available and to to mutually pick the date. I appreciate that. Again, we just want to acknowledge the fact that the Secretary is not here. The fact that we think that he can bring a lot of insights to the table and we do appreciate a staff being here. Thank you and we'll ask you to kind of share those as we move along. The format is going to be we're going to ask the Secretary of State and I appreciate Mr. Gaoan being here, Mr. Blake being here and forgive me. So with us, we have Bob Giles with Dominion voting. So Bob, that's why I don't recognize the face right now. Mr. Giles, you may choose to participate in conjunction with the Secretary of State office or we may ask you to do that more independently, whichever makes sense. But we had originally set it up where we would do. 10 or 15 minutes or whatever you want to share with us and then we'll ask the committee to ask you questions that they may have concerns about. And we would do the same thing for Dominion and the same thing for America first policy institute, which will be joining us via zoom. And then we will have a limited amount of time for input from a public as we move forward. I would hasten to say that this is not the last time. Anyone will have an opportunity to have input into these issues. This is a process and we will continue this process after the session starts in January. So I will turn it over to Ms. McGowan and ask her to share with us the insights and Secretary of State's office. Well, thank you, Mr. Chairman and thank you to the members of the committee and senators that are here today. We appreciate you inviting us to talk about these important issues and Mr. Chairman, I appreciate your kind words and support for the hard work that our office is doing. I would like to thank the public Evans here who is the director of elections for the Secretary of State also with us today is Bob Giles who is the vice president of certification for Dominion voting systems. He has not only experienced with as our voting system vendor but also prior experience and administering elections as the former elections director for the state of New Jersey. So he brings that experience to the table as well and can speak to what it takes to run elections statewide. I would like to thank Mr. Evans for being here as I'm sure the members of the committee are aware we do have voting going on right now and November is of what is the 22 counties is that correct that is correct. So, Mr. Evans and his team are extremely busy right now and we appreciate our hard work. I also want to acknowledge the hard work of our local and county elections officials who have dedicated a large amount of time to making sure that all of us can exercise our right to vote and the secretary certainly supports the dedication and hard work that our local election officials bring to table. Mr. Chairman you did invite us here to speak about our current voting system and so I would thought I would start out by providing the committee and the senators that are here today some background on that system. The state uses Dominion voting systems democracy suite 5.5 a this is a paper ballot system that is verifiable by the voter and auditable. There are choices on ballot marking devices that print a paper ballot marked with that voters choices. The voter can read and verify their choices that are written in text on the ballot before that ballot is scanned and tabulated. Because we use paper ballots and because the general assembly made that policy decision back in 2019 when it passed House bill 316 we do have a paper trail of these paper ballots that we can use that the voter can use to verify their choices before their vote is cast and then also after the election we have that paper trail to allow us to go back and do an audit and ensure that the votes were tabulated accurately. When the House passed or when the general assembly passed House bill 316 it enacted the requirement that any voting system that Georgia uses statewide has to be certified and go through rigorous certification procedures. It has to be certified at the federal level by the US election assistance commission. It also has to be certified at the state level following independent rigorous testing. Because of this rigorous testing that our system goes through it is safe and secure as the chairman expressed earlier and the primary reason it is safe and secure is because the voting system is not connected to the internet it is never connected to the internet. And cyber security and election and law enforcement officials all agree that there is no evidence that Georgia's elections have ever been compromised. Even President Trump director of the cyber security and infrastructure security agency called the 2020 election the most secure election in American history. But it is not an accident that we had the most secure election in American history. This is the direct result one moment. You may hold different opinions to the speaker. I would ask that you refrain from your non verbal or verbal responses and give her the respect that she deserves. If you choose to abuse that I'll ask that you be removed from the room. Thank you continue. Thank you, Mr. Chairman. It is not an accident that we had successful elections in 2020 and 2022. That is the direct result of the hard work of the secretary of states elections division. We have put rigorous measures in place to both identify risk and to detect and prevent it. We have had these measures in place since we adopted the paper ballot system and we will continue to implement those measures as well as enhance them for 2024. The members of the legislature receive the secretary secure the vote plan, which talks about the things that we have been doing since 2020 and that we will continue to do and enhance into 2024. And this includes measures that are implemented at every phase of the election cycle. And before our elections, we have rigorous logic and accuracy testing to test the equipment to make sure that it is functioning as intended and that is recording the paper ballots correctly. During elections while voters are voting again they have that paper ballot where voters can verify their selections and make sure they are accurate before that paper ballot is cast and tabulated. And then we have a roll out for 2024 that will also provide additional security measures while voters are voting is parallel monitoring. And what that means is during a live election, we will have staff going into counties taking out BMDs and making and testing them right there at the polling location to make sure that they are operating as intended have not been tampered with and are properly producing the printed paper ballots. So that is what happens during the election following the elections, we have risk limiting audit requirements that the general assembly put in place in House bill 316 and actually enhanced this last legislative session where we now have requirements that risk letting audits be conducted after every election and primary with state and federal races on the ballot. You may have heard the claim from some that are voting system does not comply with Georgia law and this is not correct and then Georgia court of appeals has actually recently weighed in on that that case is a voter GA versus state of Georgia which we cited that case in a written testimony that the secretary provided to you. The Georgia court of appeals did hold that the system and the use of the QR code on the printed paper ballot does comply with Georgia law. There is a new version of the democracy suite software version 5.17 that has recently been released. It was certified by the EIC on March 16, 2023. This is a brand new software that has not yet been used by any state in a major election. I mentioned before Georgia requires that any voting system that we use on the software that we use not only has to be certified by the EIC but also certified at the state level. And there is a rigorous process that we have to go through for state certification, Mr. Evans can probably speak to that in more detail later on if you have questions about it. But we began the state certification process immediately the day that the EIC certified 517. We began the process by doing our own evaluation and testing to not only test what the software does but what it's going to take to implement at a statewide level. Our state certification process also includes independent testing by an independent lab that is our state certification agent. Now we have completed that part of the process so we did get approval from our state certification agent that 507 does operate as intended and meets the requirements of Georgia law. So what we are now is that the secretary has provisionally certified 517 for use in a pilot program in the municipal elections for 2023. So we have that pilot program currently underway and we have five counties in Georgia that are running municipal elections on 517. Those counties are appling, brave and heard Lee and Rockdale. So this pilot is critical to the state certification process because it will give us the opportunity to test 517 in a real election setting. And this is critical to our understanding that the software operates as intended and is suitable and practicable for use in Georgia. Once the state certification process is complete, the undertaking of installing 517 statewide will be a massive logistical undertaking. We're all familiar with our iPhones and that we can push a button and have it install a regular update overnight. That's not what this is. So we have to push a button and send an update out. We have to physically touch every single piece of election equipment. And I will go through what that entails. We have VMDs of the ballot marking devices deployed across the state. We have thousands of scanners that tabulate the ballots. And then we have the election management servers in all of Georgia's 159 counties plus our central state server. So we have approximately 40,000 pieces of equipment that we must go in and physically touch and install 517 on each piece of equipment. Just based on our initial evaluation, we estimate it will take about 20 to 25 minutes per piece of equipment. So per ballot marking device and for each scanner for the EMS. And we will take even longer probably several hours or more depending on the size of that particular county. So we're talking about thousands of man hours that will be involved in this undertaking, which will take a significant period of time. So once the installation is complete, we then have to go back and do acceptance testing again on every single piece of equipment to make sure that the suffer was installed correctly and is functioning as intended. So when people might reasonably raise the question of why if this upgrade is available, have we not moved forward with already having it done. I have given you the 40,000 reasons why we have not been able to do it up to the state because there is a process that we have to follow that we are working through that is required by law. And I feel it is the responsible and reasonable course of action because what is critical to us is that we set up our local election officials for success. And by employing a rush process, we're not doing that. There is always a risk that is involved whenever you have changes to your election system, especially a major systemic change like this. And we don't want to needlessly induce introduce more risk when we want our local election workers to succeed and we want our elections to continue to succeed. So it is our plan to do things the way we have to do them by law to be responsible and methodical when it comes to making major changes to our election system. Again, Mr. Chairman, we thank you for having us here today and we're happy to answer your questions. Thank you for your input. I want to I want to start a couple of questions and I want to turn it over to committee in the pilot that you're currently involved in how many machines were had to be physically modified in order to do that. So you had you named five counties municipal elections. So what in your pilot, how many different advice did you have to address. It's right around 100 ballot marking devices for all five counties for all five counties combined, around a hundred ballot marking devices. And I can get you the exact numbers, but I believe it's about 15 to 20, about 20 ICPs or the precinct scanners. So about 20 precinct scanners. Is that right? I believe so. So in 20 precincts statewide in these five counties. Since they're municipal precincts, it's not necessarily the entire county that's involved in the election. And then the other element of it is for each county their election management server, which is one per county. And then their high speed scanner or central scanner, which is one per county. Okay. And I realized we're only 10 days into this early voting. That I was at the conference that the press conference that Mr. Sturding provided. How would you assess that process so far? So it's been a learning experience. You know, Ms. McGowan mentioned the certification process that we're going through the pilot is a key part of it. So I don't want to give a final summary because we still have election day to go. But we've, we've learned some things, learned some things that'll be useful when we do end up taking and up greater and new installation statewide. So I would describe as a learning experience. You have some municipal follow up. Yes, some municipal elections that are still on 5, 5 a is that correct? Yes, sir. And then the next question is, how are they, how are they coexisting? How are they working in two different versions of software? That's the question. That's a good question. So municipal elections are a little bit different than kind of the statewide elections. But essentially, the way that we're structured in Georgia is that we construct the election projects or the ballot projects at one central location right around Atlanta, Marietta. And so we have a ballot builder. And we set up an environment. We coordinated with dominion and set up an environment where we could build election projects in 517. And then we had a ballot builder construct those election projects in the 517 environment for those counties, which and then we had training before they're able to do that. And then distribute those projects out and then the other election projects we built in a 558 environment. Is there any county that's using this two different versions of the means of in a single county are you seeing two different versions are only a single verse either oh, they're on 5, 5 a are you on 517 is that right correct. So they're either on one or the other right about those would there be any. Any restriction to using 517 for countywide elections. So part of that part of that question I'll defer to legal counsel now that is something that that we have considered is you know running some counties on 517 running some counties on 5 5 a. And so depending on the outcome of the pilot and if there's compatibility and if it's something that we're able to operate with that is you know one thing that's on the table is you know potentially conducting the training to be able to have the staff to be able to create those two election projects which is a challenge but it's something that can be you know that we can overcome. So that's potentially do so that's under consideration. At the end of the day I think I hope we're making progress in five municipal elections. But yeah, I see the secretary is only given provisional certification through December 31st. And I don't want to take a step forward and then take step back. And so that's my that's where I'm going with this. And so that question Mr. Chairman and just to clarify under Georgia law. Counties all have to use the uniform system and so it's a useful. Well, because it's a municipal election. And so the the statute that I'm referring to OCA 21 to 300. So that counties have to use an EAC certified system as well as a state certified system. And so the reason that we are able to do the municipal pilot is because that particular requirement doesn't apply to our municipal elections. And so that's why it is county election officials that are running the pilot. It's for municipal elections. So what you heard us to do is to change the law so you can continue to use county elections on five one seven. I think what we would recommend is that we are able to complete the state certification process and move forward with our plans for five one seven. Okay, I'm going to I'm going to release this to the committee for a second. I want to follow back around a one key point. So I think I'm going to have this morning that the the ballot marking devices. Are not connected in any form or fashion to the internet. Is that correct? That is correct. So there is no ability for a person from dominion. So to access that device remotely and make a necessary adjustment or maintenance or fix, if you will, on a remote basis, is that correct? Yes, that is correct. So if I have a problem in a precinct with a machine. I would have to dispatch a technician. If it is a ballot marking device or a standard, then you would have to dispatch a technician or be able to give instructions over the phone to a poll worker. Or you know, poll workers are trying to be able to troubleshoot problems and. The poll worker or the poll. The election supervisor. Could make adjustments if required. So it's a good thing to have that. On the on the on the location. So, you know, depending on what the issue is. I mean, if we're talking about ballot jams and stuff like that, they're trying to be able to. Yes, right. Yes, sir. Okay. Let's start with. Who's on Mike 10. All right, Senator Williams. Vice chairman. I just printed on the ballot. Can my QR reader in this phone read it? No, no, sir. Can't read it. Okay. It can only be read by a dominion machine. It can be read by the minute machine. And I'm not sure if Mr. Jowls wants that anything to that. Yeah, it's designed to be read by the dominion. No other QR reader can read it. I have to let him go there. Yeah, I'd like to know that question if you could follow back up. Or if anyone else is voting equipment or QR readers can read it. That's all. Thank you, Mr Chairman. One comment on that that I'll make. Because this is a really good question. There are other. And you know, other vendors and other solutions where, you know, a jurisdiction may run a ballot or run an election with QR code ballots. And then they'll have a separate system that's an auditing software essentially that can read those ballots and verify those. So it wouldn't be an uncommon thing if there were multiple. You know, multiple solutions to read a QR code. Thank you, Senator Harbin, 13. Thank you very much. I appreciate that. Let me ask a question is I understand this is that the machines are the ballots currently are printed on a security type paper. Is that a correct statement? They're on security paper procured from the minors are from dominion. And it's also my understanding that the machines have the ability to detect the paper but are not turned on to be able to detect whether it is a real ballot or a copy of a ballot. And then they're turned on under the current scenario of the machines operation. Is that correct? That is correct. Currently we use this security paper for for all ballots and it's used more for auditing purposes on the back end or investigations that needed. So it has to be it actually can take a ballot that is not a true ballot, a copy of a ballot and the machine will accept that and run that through the system. Am I correct? That is correct. It's okay. So that's a that's a security issue under the QR code issue versus reading the ballot. Is the scanner not able to read and I mean I do a lot of OCR type technology in my office and other things that the QR code is it more secure than just being able to read the ballot because I think more than anything is the trust capability of the of the voter. I said that he reads it but the QR code is what's get capturing the data. It is not his actual ballot input that's capturing the ballot. It is the QR code that's capturing that in my correct. So the the voter reviews the text on the ballot and the scanner reads the QR code now the the text on the ballot is the the control that's that's what matters. That's what we audit at the end. Then if there's ever any question that's what we refer to the last part risk limiting audit what triggers a risk limiting audit and is that then a paper when I say a manual count when we have something like that or is it actually another machine count that occurs in this risk limiting audit. So you're going to turn on the end you're going to turn on the switch to detect whether it's a true ballot or a security paper or a non security paper. That would be one of the things that's done in my correct. So that that's a great question. I think Senator Williams for this in a recent bill that he passed that increases the with the help of others obviously that increases the number of audits that we're going to have next year. Because next year we'll have risk limiting audits following our presidential preference primary general primary and our general election at a minimum. And so those are all conducted by hand is a statewide risk limiting audit or one of the few states in the country that do it we usually set a risk limit that's one of the lowest in the state or one of the lowest in the country. But it's completely done by hand is where county election officials will pull randomly selected batches. They will manually tally those batches. Then at the end of it will post the machine count from those batches along with the hand count from those batches. And if you go up and look at the November 2022 risk limiting audit information on our website you can currently see the two tallies compared to each other in itself. Okay, last question is this absentee balance. Are they on security paper or non security paper that are are mailed out or mailed in what kind of a track is that is that I just plain piece paper or is it a security paper. It is a secure piece of paper and I.\n\nBelieve and I'd be happy if anybody has heard of another state to follow up with that other state. I believe we're the only statewide jurisdiction that currently uses Security paper for all types of voting. Okay. Thank you. Thank you. I just followed up to send a harvest question. On the absentee ballots, is there a visible security mark on that ballot? It is not a visible mark. Now if you take it and you compare it to a regular piece of printer paper, you'll be able to tell the difference. But it looks like a like a piece of card stock. Again, my colleagues in the House suggest that the Secretary's office was willing to provide a visible security mark on all absentee ballots. Is that accurate? That was a request they made and that is something that we are researching and but you've not yet committed to providing that option. It's not yet a certainty. However, it is something that we're actively researching. It could be a little bit dumb. I think the colleagues in the Senate would support their request. Senator Dozal. Thank you, Mr. Chairman. Thank you all for being here today. I want to follow up on a couple of questions that Senator Harbin asked you said that we have the requirement for security paper. The scanners are capable of detecting security paper, but we have that turned off. Why? That's a good question. And I'll tell a quick story. So one of the basically every situation that I have as a lecture director in the state, I run through kind of the lens of my experiences at the county level before I was in Georgia, I was working in Pensacola, Florida. And one of the things that we would do is obviously conduct poll worker training and in city of Pensacola, there's a hockey group there that we would use for poll worker training. And we would use one of the rooms and we had some ballot stock that was there sat there overnight. We conducted poll worker training one day came in the next day and about three or four of every 10 ballots, what it's going to And what we found is that there was so much moisture because it was an ice rink that it affected the paper. So it's kind of a similar thing, especially in South Georgia, we have high humidity levels. That there's a concern that you're going to start rejecting proper ballots. And so has been tested in the real world, such as you deserve this concern or is this due to your experience in a hockey arena in Florida that we've made this decision to turn off the Well, that was that was partially one of the things that that informed that informed my decision. However, like I said, I think we're the only state in the country that uses security paper for all types of papers. So we're already ahead of the curve many ways as compared to our other state. However, you know, that that is a concern that we have had in consulting with people that have knowledge of the security papers. So in other words, you have an experience this problem in the real world with these scanners, but you've projected this problem on to the Dominion Proxmasters. Giles, would you like to opine and you're you're testing of your internal systems and your scanners using your security paper that we buy from you. Have you all ever seen an issue with your security paper being detected by the scanner? I would say my knowledge is limited on that because only a few jurisdictions utilize that paper. And again, I can follow up and get your answer on that as well. I can just add something Senator to your concern. We do have ways to test to make sure that it is the security paper that the ballot is printed on. We do have detection ones that election officials can use. So it's not only the scanner that can provide the check. We do have other technology that election workers can utilize to are they utilizing it. They have the equipment that they need to do that. We would certainly we certainly train them to do that and ask that that be the best practice. So one of the things that came up and I forget if it was in conversations with members of the Senator members of the House, but are ways that we can increase their the way that they that they use those ones and that functionality. For example, one of the easy ways would be when we conduct those risks coming in on it, you're already pulling that batches out. So why not, you know, just go ahead and wand it. So that is something that we're looking to for for 2024. Why are the taxpayers in the state of Georgia paying for security paper? Because it's a requirement that was implemented with SB 202. Under your office's recommendation, I believe is that correct. I was not with the office when that legislation was going through, but I'd be happy to. I want to ask my question very specifically because I've asked it twice and it hasn't been answered. Have we tested this, are the scanners that we have paid for with the security paper that we are paying for and we have seen problems with them. Or we have essentially out of speculation decided not to check the every ballot as it is scanned to ensure that we have no security paper. To my knowledge, we have not tested it. Okay. As it relates to the risk limiting audits. What's the remedy if it fails? If the risk limiting audit were not successful, I don't think we the election would be certified. There are legal recourses under the Georgia code for election contest to be filed. Thankfully, we've never had that scenario, but there is a process and we can probably speak more. It isn't our code silent on what isn't the code silent on what would happen if an audit were failed. So I want to clarify what you mean by fail. We have our 10% threshold. Let's say that we go to that 10%, which by the way is in my opinion lower than what it should be Colorado. I think as you know, I started at 10 and moved to 3. I would like to at least be at what Colorado is that. But let's just say hypothetically we pull it. We test it. The results don't match up up to the threshold that we have not codified law. I believe the state election board has set that. And essentially the risk limiting audit says no, we have an issue because that's part of your four point plan. Is that we have risk limiting audits, but really if it fails, there's no remedy. So that's a great question. So in 2020, the risk limiting audit that we that we run as a full hand audit. So it was a zero risk limit. In 2022, we chose a 5% risk limit. And then if the first round of sampling comes back and it supports that, you know, we're not able to verify that the correct winner won at the confidence level selected, then it tells county election officials, okay, you got to go and you got to pull more batches. And so it just keeps going. And then if you continually do not meet that confidence level, then you eventually go to a full hand count at which point we would not certify if it showed that there was a correct winner or that there was an incorrect winner, we would not certify that result at the state level. Mr. Chair, we have just a few more minutes for I want to get to the CISAR report because I think it's very important. I think it's probably the primary reason why we're here today. It was released in June of 2022. When were you all made aware of the nine vulnerabilities identified in a report where you made aware by the Dominion prior to that or did you become aware when that report was released to the public? I'd have to go back to see what you know at any point in time. I remember becoming aware of it around the time that it came out. Okay. These four remedies that you all sent to us, I think you believe that they're essential. Gabe Sterling spoke earlier today about this secure the vote plan. And this is essential essentially to mitigating the nine vulnerabilities since we're choosing not to update the software. Is that correct? Yes, that is part of the mitigation measures and the measures that we have in place to ensure that there is security and also that we can detect and prevent risk. There are additional things that we are doing for 2024 and that includes the health checks that we have been doing statewide. What we're doing is going into every single county, testing the equipment to make sure it is functioning as intended and hasn't been tampered with. To date, I think this this week we're going to finish up 90 counties and all of those health checks have been successful. We also have completed site inspections to ensure that our election equipment is being physically secure and Mr Evans can can talk more about what those have revealed. So the secure the vote plan, the testing that we do before, during and after the election, the health checks that we do to make sure that the equipment hasn't been tampered with. And then making sure that our election equipment is physically safe and secure so that no bad actor can access it. So my question is given given that this report was available last summer and we had election last November. Why were these steps not in place for the 2022 election? They were. The the parallel monitoring is new and the decision to do the health checks is new for 2024. But we have always had your answer was they were but then you had just identified two things that were not. But this is a report that you're specifically referring to identified physical security monitors that jurisdictions can take to mitigate the identified possible scenarios. And we in Georgia has. Thank you. All of those. You identified two things that were not done. My question is why were we not doing the parallel testing in the November 2022 election if it's if it is necessary to ensure that the machines aren't tampered with? Well, again, the 2022 election was secure and successful. It might have been a resource issue. You'd have to talk to Mr. Starling. He would be able to provide some more insight into that. But he'd be attending today. He has other commitments today and we brought Blake who is our elections operation. And we talked about the health check real quick. Can you walk our committee through what the health check process is specifically? Yes, sir. So as part of the health check, we have members of our secretary of state staff that is going to every storage facility in the state. And every location that has an election management server. And one of the things that they're doing is performing a hash validation check on the election management system on the democracy suite 5.5A application. How? So they're they're running a hash validation that checks to make sure that there are 300 files over 300 files there. Nothing's been added. Nothing's been taken away. Is it a self attestation from the equipment? It I believe so. So you're not using a third party hash check in this process. You're essentially asking the software to tell you what version it is, which if the software has been hacked, it can still provide an invalid hash statement, which is why states like California and other states use third party hash checks to ensure that that specific hack has not been implemented. Is that something that you guys have thought about doing? I'd have to I'd have to check. Okay. Is there a, are we doing any post election hash validations? We have done those before. We did those post November 2020 in a couple of counties. And that is something also that we have looked at doing again. Okay. And last question of share because I know you have a lot of other people that probably have questions. And this may be a question from Mr. Giles or to the secretary's team. Can you walk us through the penetration style testing? In other words, not the functional testing, but white hat testing, black hat, hat testing that that happens through the process either in the internal development process at Dominion or with ProVNV. So the penetration testing is something that's relatively due. It's just the EAC requires it under their new 3.0 manual. So we will be going through that the first time when we bring in our next solution. But we have run versions through through ProVNV and basically I can get you the information as to what they look for and what the process is. So internally, you all aren't, Dominion is not doing any penetration style testing on the security of your systems before they go to certification. That has been done internally. We do certain testing and I can get you what gets what testing we do. Right. Okay. So given the fact that these nine vulnerabilities were found after your internal testing, can you help us understand what processes have been put in place or additional measures that you have taken to ensure that you're doing everything that you can before the shop software ships off for certification such that it is as secure as possible? And again, we do our internal testing and the way it's going to work moving forward is when you make application to the EAC prior to acceptance of the application of PENTES will be done. So moving forward, that is part of that will be part of the process. And we've used labs to do internal testing as well prior to releases. I don't have the specifics on that. But yes, penetration testing has been done. And penetration testing will be done via the EAC moving forward. Do you have any idea how these nine items were missed then and has there been any turnover to your team or internally? And this is a question I have for you all. Leave this has my last question. I'd like the secretary staff as well to describe us what your cyber team looks like in terms of numbers, scale, etc. and any testing that you guys do because I've expressed this privately. But to me, the most shocking thing in this whole thing and this is for the Dominion gentlemen as well from Mr. Giles is that we're your largest customer. And we use the knowing pull pads. And everybody knows that we use the knowing pull pads. And you submitted a version of software to federal testing that didn't work with our pull pads. And I don't and that to me would basically mean that there's no internal testing happening at all as it relates to your largest customer. That set us back months. Ohio was able to certify in March. Washington was able to certify in April. Florida was able to certify in May. Michigan certified in May. Colorado certified in May. We're still not certified. And part of the reason we're not certified Mr. Giles is because your company set a software that was incompatible with Georgia election. That's unacceptable by any measure of professional standards in the software business. I would like to know A, how that happened and B, what is going to be done to ensure that doesn't happen again because if my math is correct, had we been able to certify in March, the software update could be installed. And so it was really this knowing pull pad issue that put the secretary's back against the wall. And in the questions I've asked privately and now there doesn't seem to be a sense of urgency around this issue that doesn't we're not standing up separate test sites. We're not dramatically changing the internal testing to dominion. It's kind of like we're just going to pass it off to the EAC. What as you all know, there's only 11 states that require EAC testing. We're one of them. So I wonder if we shouldn't be implementing our independent testing to exceed EAC standards like Florida, like Texas, like California, so that we're not sitting around waiting on the feds. And that's a little bit of a rant. So I'll let you all respond to anything you wish to in that statement. Thank you for this comment senator. And I wanted to first address your comment that the certification process of Georgia has been slowed down. That's actually not correct. We are moving forward as planned. We had always planned to have our state certification agent do independent testing. We had always planned to do this municipal pilot. And thankfully working with our vendor, we were able to come up with a fix relatively quickly for the pull pad issue. And it did not delay our municipal pad. You're telling me that you planned on provisional certification through the end of the year. And this was part of a plan. And it was a plan that it wouldn't work with the pull pads. I have an email here. Do you know who William Duffy is? Yes. I believe he's on the chair of the state election board or was he sent an email on February 21st that says I've been told by the elections division of the secretary of state's office that they expect to begin updating the dominion system beginning later this year, which would be this year. The update is intended to address the concerns in this in this advisory from last year. The planned update is to dominion 517. I've been told it's not yet fully certified by the EAC, but they hope that it will be by March. Was Mr. Duffy misinformed that the intention was to fully adopt this later this year? One thing I do want to correct, I got a message from my deputy director of voting systems. So it is an independent hash verification tool that's wrong. Right. So to go back a little bit, mentioned June 22 when the advisory report came out. Right after that, one of the things that we looked at doing that, the minion was working on developing 5.13 at the time. And we had coordinated with at least one of our counties. We were going to run pilots of 5.13 last November to the point that we actually had new printers come in because it would support a newer printer that would run with the ballot marking device. And then at some point, it was decided, okay, that was not going to be pushed through to EAC certification. So we didn't go forward with that pilot since that wasn't going to be certified. If we moved to January of this year, we had a training conference for all 159 of our counties. And the chair of the United States election assistance mission, Mr. Tom Hicks was there. And I knew that 5.17 was undergoing certification. So I talked to him, our team talked with him, and was like, hey, whatever you can do to get this through, please help us out here. And then it ended up being March when it came out. We got the copy in March. And as part of our internal testing, we began putting it on ballot marking devices on scanners, testing compatibility with with Polpad and that sort of thing. We also knew that we wanted to that we wanted to run pilots with it. And so that is when we found that there was incompatibility with the poll books, which was what calls issues, obviously. And so we still wanted to move forward with those pilot counties. So we, you know, that knowing can diminish, I know, start working and we're able to get the issue resolved in time for us to be able to do it. Mr. Goss, when did you all become aware of the incompatibility issue with the with the pull paths? We became aware after certification in Ohio that there was an incompatibility issue. Are you all doing any internal testing at all that should have caught that? It was just missed? Or was that, or were you guys not doing any testing with the pull paths? And I'm assuming you will now. But moving forward, yes. So the, because the the pull pad is an ancillary device to our system, we build our system and then we bring, then their system becomes compatible with our system. And that's what we worked on once we realized there was a compatibility issue. It's since been resolved, moving forward those, those type of discussions will happen much earlier if there's a potential incompatibility. Mr. Ardens last question for you. Thank you, Mr. Gosson. Sure. We'll come back. We'll give you a break in the committee, right? As you can tell, he is very passionate. So we'll come back, Senator. I'd like to recognize Erbeach. Erbeach. Evan, for holding this meeting. Thank you all for being here. Miss McGowan, you talked about parallel monitoring and you're going to go to some sites and do some parallel monitoring, parallel monitoring. If they're not connected to the internet, what are you going to be monitoring, tampering? What you said you go monitor tampering? If they're not connected to the internet, what kind of tampering are you looking for when you're doing your parallel monitoring? Another very good question. So this is something I'll say that we're actively working with our Georgia County election officials are awesome. They do great work. If you have them are here. And for the parallel monitoring, if the concern is looking at, okay, that any potential issues, if they could potentially be exploited, if they could potentially be exploited, if somebody's worried that, hey, there's an insider threat at this state level, then what we do is we are a state that I mentioned earlier that builds all of our election packages and then we send them out the counties, right? So we're able to have a very controlled, very secure environment over our staff to make sure that what they're doing is proper. Then when that election project goes out to the county, they conduct logic and accuracy testing to make sure the equipment is functioning as it's supposed to be. That way if there's any concern that somebody in our office is doing something that they shouldn't, the county's going to catch that. The one question that we got was, okay, how do you know there's not somebody at the county level, which is a hard question to ask, right? Because I have complete faith and trust in our county election officials. So for them, it's hard to hear that. But the parallel monitoring, what it's looking for is, okay, has somebody at the county level done something and to deploy something into the field that is not acting as it should. And so that's what the parallel monitoring test for to make sure that what's what is being deployed is the correct election project that the equipment is operating and functioning as it should. Another question, kind of piggybacking on the software upgrades that Senator Dolezal was talking about. Stanton Gatewood, who is a cybersecurity expert, I don't know if you know who he is, but he's given several presentations. He said, if we would use AI, we could upgrade this software immediately. What are your thoughts on that? I want to go back to some, not 100% sure what he means about that, but what I'll go back to is that the system's not connected to the internet. And so it has to be a manual process to be able to do it. There are no results that are ever uploaded to the cloud at all. It never goes to the internet. Nothing. Great question. So what happens is that the on election night, the way that we're able to report results publicly is county election official can download a file on their election management server, put that file onto a fresh thumb drive and then transport that thumb drive over to a laptop or a computer that is connected to the internet. And then that's how they're uploaded that. And then that's how we're able to project results. Can Mr. Chairman, my final question, because I think it's a trust issue with the voters is the QR code. Louisiana doesn't have it, Florida doesn't have it. What is the purpose? I can never get an answer of what the purpose is of the QR code. Can we not just scan the ballot with the votes on there, who you voted for without having a QR code? What is the purpose of the QR code? So one thing I'll note there is Louisiana, I believe might be the only state in the country right now that's not fully paper. They still have some jurisdictions using the R.E. machines. But I'll also add that we are working with a vendor to develop a technology to deploy into every polling location. Its intended use is for voters with disabilities to be able to independently verify their ballot. But essentially what it would do is be able to look at the text on the ballot. So if I'm a voter, I got my ballot, I can put it under this machine and it can look at the text on the ballot and read back to me what I have selected to confirm it. So that's something that we're worked on. It could also be used not just for voters with disabilities, but also for anybody that needs it. So could we make the QR code off the ballot and still scan the results from the x's that you voted for, the folks you voted for? Just very similar to when you take the CT test and you have a two of pencil and you put in the question answers and you run it through the machine. There's no QR code. Could we do that without a QR code? So 517 does give the option to, if you want to bring in new printer hardware. And so all the counties would have to have new printers to be able to support the length of the ballot and potentially double ballot and duplex ballots. There would be increased cost, but 517 does have that capability. Thank you, Mr. Chairman. Thank you. And just clarification, that capability is for mark sense. Is that correct? Is that a mark sense ballot or OCR? A optical scan ballot with the ovals that you could build on. Thank you. Mark March. Looks like an accident. I want to shift over to the left. Senator Jones. Right? Senator Jones. I'm coming back to you guys. I promise. Trying to get over to the other side. Give me a chance. Sure. Yes. There was a question about um, complying with after report came out in June, but then there was a lack of acknowledgement that maybe two things were not done. So my question is just trying to expound on it because it seemed like you were saying there was compliance, but then there was a question about two things that maybe we're not done. Can you kind of go back into that? Was there compliance at the report? What was the secretary able to do after that 2002, 22 report came out? And then number two, is there going to be any requirement for any kind of retraining of poll workers if you shifted over to 517 and if so, what would that encompass? So those are great questions. I mean, one of the things I want to do is, you know, state the obvious, like any other, you know, director and government, like one of the things we have to do is, okay, assess risks and what parts of our, what parts of our agency are areas that we need to focus our limited time, our limited resources on. And you know, if you go back to 2020, we had just gotten this new voting system, voters are getting adjusted to it and county election officials, by the end of that election cycle, we're doing a great job and this is not not an, this is not an easy solution. It is complex to be able to roll these different components out and then put it out there and it's a great, it's a great experience for the voter, but it's a learning curve for counties and they did a great job coming to that. So we really felt confident, especially after having three counts in November 2020 with the voting system. The one system, and I'll get to your question just a second, but I want to provide a little color around it. So the, the one system that we knew that was aging and that was going to present some risk potentially to us down the road was the voter registration system. And so to kind of sure up the, the security of our election processes of the whole, as a whole, we spent the last two years upgrading our voter registration system and it's been a very challenging process, but it's now on a FedRAMP compliant system and and and and you know our county election officials are adjusting to it, we're adjusting to it, but it's been a lot of change in that area over the past over the past couple of years. But in terms of in terms of the voting system though and kind of going back to what I was saying is assessing risk, I'm not during my time with ballot marking devices when I was at a county in Florida, when I was at a county here, and now at the state, I've never had one single election official call me up and say, Blake, I've got a problem with my ballot marking device flipping votes. Never once have I had that. And so, so you know, we, when we got that report and\n\nsummer of 2022, because we're, you know, we're looking through it. And the good thing about it is I felt very confident in looking at that report and saying, okay, these nine issues that are out that are outlaid here. We've already mitigated them because our county election officials do a good job. We have good state election board rules. We have good laws. We use seals. And none of this, you can't gain access to the election management server. You can't gain access like Alex had in his report to be able to, to be able to make adjustments to about market advice. You can't gain that level of access. So when we talk about the assistive advisory, you know, I felt very confident that the what we had in place mitigated those risks and kept our system secure. So while, you know, our team was focusing on voter registration and making sure that our security across the board was increased, you know, we felt very confident that that our voting system was in a good spot. We just come off a good, good election in 2020. And again, in 2021, and is there any new training that would have paid place? Oh, yeah. So as far as the training, so I mean, election workers and poll workers have to get trained before every election. And so the training would adjust some because it is a different application. Just like we would have to train our staff, the training would adjust some, but, but not for the poll workers themselves, not, you know, too much. Thank you. Senator Everett, Tarte. Thank you. Thank you, Mr. Chairman. Thank you all for being here this afternoon. Couple questions I have. I want to go back to a question that Senator does all ask and I didn't hear an answer for what is the staff make up and who at the Secretary of State's office is in charge of cybersecurity? So we do have so we have our Secretary of State agency and then we have different divisions. So we have our elections, division securities and then we have an IT division that IT division supports all other divisions across the agency. So we have a chief information officer there. His name is Mayor Beaver. We have a securities officer, his name is Kevin Fitz. And then so he is our security officer. And then we also have my deputy director that I referenced earlier of voting systems who, you know, as far as elections, security side is able to provide a lot of context and knowledge to our team. His name is Michael Barnes, which by the way, he's, we're very fortunate to have him. He's been an in Georgia elections for 25 years and just as a tremendous job for us. But that's the general makeup. Right. So kind of going backwards in your response. Is Michael Barnes here today? No, Michael Barnes is not here today. Is there a reason why he would not be here today? So we are actively running in an election. And so he's focused on that. Okay. How often or what is the amount of time that your chief security officer is involved with the elections division compared to the rest of the things that the Secretary of State's office has required, you know, all the various things you do. What is that percentage of time that he allocates to this conversation in terms of cyber security on elections? Good question. I would say just because I don't know exactly what he's doing when he's not supporting us. But I would estimate that it's somewhere around a third of this time that gets devoted to elections. Now I'll also say that I know in an upcoming budget, ask we're making a request for a SISO. As far as the Secretary is making a request for a SISO for the agency, which would be helpful in ensuring that up. But that's the answer. Do you know, I mean, so great segue. So do you know in the last time the Secretary of State attended a legislative appropriations meeting? I will be happy to follow up on that and provide you an answer. Okay. My understanding, I hope, provide some color to that. He's only attended five of 12 House or Senate meetings. And my understanding the last hearing he attended was in 2020. Again, I will follow up on that and provide you an answer. We did recently present our budget to the governor's office and the Secretary was present for that. Okay. Well, I know when I sat through appropriations of committee, we never saw him in the Senate. My next question real quick, also piggybacking off of that is knowing that there was an advisory in 2022. With all the cyber concerns that I know the Senate, the House have had robust conversations on cybersecurity. I think we actually passed a cybersecurity bill out of the Senate in the most recent session. And we know that times and issue resources are an issue. I think we're hearing that today, why during the last budget process said this past session, did we not receive a cybersecurity request or any security request from the Secretary of State's office? I can't speak to the last budget request. Again, I'd be happy to follow up with you on that issue. But I do want to distinguish between when we talk about cybersecurity, a lot of the times we're talking about cybersecurity for internet connective devices. And again, this system is not connected to the internet. So what we don't have is we don't have a risk of outside actors hacking into our system remotely. The risks that we have identified all involved physical security risk where someone has to gain physical access to the system in order to manipulate it. So we're looking at assessing different type of risk than when we're talking about internet connected equipment. But you would agree though that even though that may be the case that any vulnerability to the Secretary of State's office could create a vulnerability to the elections division, the work, potentially, you know, secure, you know, compromise data could be a problem. Oh, absolutely. And that's why we have the measures that we do have in place to detect assess, evaluate and prevent those types of risk with all of the things that we have. So this afternoon. So knowing that there's a risk. And now I think, you know, I hear that there's a, you know, if you're asking for money for a system, I think you're recognizing that there's an issue. I guess my concern is that like most organizations, public private that have experienced massive cyber security attacks and some of those in Georgia. It seems like the cyber asks from a budgetary standpoint has not been made a priority. You know, prior to I guess today. So one thing that I'll note is that is that we have been spending a significant amount of our time the past two years upgrading to a new voter registration system, which has been had an extreme amount of staff time and resources put towards it. I was up till 3 a.m. Sunday night working with the team on different things because we have to we have a team of people that work, you know, during the day. I mean, Senator. Y'all y'all know this that that working the technology world, you have to work during the day, but then you also have to work at night when nobody else is working to be able to work on the system. And so I would say it's been an extreme priority to make sure that our system is where it needs to be, especially just looking back, you know, the. The time that we spent on upgraded voter registration system over the past two years. Yeah, I mean, Mr. Chairman, my final comment is I just hope that going forward as we go through the budget process. The Secretary of State's office is going to. I think just make sure they're communicating with us with their budget requests and hopefully. You know, I hate to say this, but no disrespect to I know the governor puts the budget together, but also the Senate and the House have our own say because we represent I represent was 200,000 constituents. And I hope that I'm not hearing from the Secretary of State's office that my citizens don't matter in terms of our input into the budget when it comes to another constitutional officer, especially when I know the president of our Senate is a constitutional officer. So I hope that respect is given to the body on this side of the building. Thank you, Mr. Chairman. Yes, absolutely. I appreciate your comments, senator. Thank you. As a follow up to Senator Anvatarte, the garbage development project, been going on for a couple of years. Yes, everything going on for. Right at right at almost two years. And can you estimate the man hours or dollars invested in garbage. So the initial implementation cost of the Georgia registered voter information system is right around a little over $5 million. But that isn't, you know, that isn't package in the staff time and resources staff resources. So we basically had to utilize resources in garbage and not address concerns in our voting system. One thing I want to say is, you know, any any director, you do have to assess where the risk is. And like I said, I'm not had one single elections director say that they saw a BMD that was actually flipping boats. Just for point of clarification, I'll get back to our colleagues. The pole pads. Yes, sir, the registration systems use of pole pads. Are they connected to the internet. They are. And one thing I want to note there as well. Is that, you know, one of the things as far as assessing risks like back in in 2020 and even through 2022. The way that we ran advanced voting was that we would have poll workers over a thousand poll workers. Who would be at advanced voting sites and they would be logged in to the voter registration system checking in people and that's that's fine. But if there's a way we can improve that if there's a way we can make that more secure, we want to be able to do it. And so what we've been working to do is say, okay, instead of giving poll workers direct access to the voter registration system, let's give them direct access to a poll book like they do on election day. And this election that we're conducting right now is the first one that we're using poll books for instead of giving poll workers direct access to the voter registration system. And so that's that's a way that we are sharing up security that we're keeping the the number of people that are in our voter registration system down by giving them access to poll books like we do on election day. Thank you. We'll turn to Senator Robertson. How you demonstrate and so I appreciate you coming in. I want to ask a simple question again that I mean, I think you're getting hit with shotgun blast and so I'm going to put one round down range and ask you what is the purpose of the QR code. So the scanner reads the QR code. That's the way that the I understand the scanner reads QR code. What is the purpose of the QR code? What information is contained in the QR code? So the information contained in the QR code is the voters precinct and combo and the voter selections on the ballot. Okay, precinct. Well, second thing you said precinct the comp, I said combo on which is in listen, if I if I threw a shot in the dark, I probably close to right. And what you're what we're identifying is the ballot that that particular voter is allowed to vote on correct in case there are certain say like if you go to a combined precinct where there are multiple counsel elections and all that, you make sure that Senator Robertson who is a one district who votes next to Senator beach that they each vote in the election they're supposed to vote in and that we do not cross vote correct. And they've certainly voted on one of his ballots and he votes on my ballot. So that the the poll book that you would check in on is making sure that is telling, you know, hey, Senator Robertson needs this ballot and in that ballot is going to show you're going to indicate your precinct and that is included inside that QR code correct. Yes, okay. And what was the third thing you said that was included in your selections. Okay, so once I make my selections on the ballot marking device and once I hit that the final button, you're saying my selections go inside the QR code. Yes, sir. Okay, so my selections are also printed in text at the bottom of my ballot also correct where I can look at them because I can't look inside the QR code correct correct. Okay, so if if the QR code is there is have y'all discovered any possible way that anybody can manipulate the QR code. I would say that our system mitigates any concerns that somebody in a lab environment might be able to create. Okay, so is that a no. I would say that our system mitigates the concerns that anybody in a lab environment might be able to set no, and I understand I was a P.O. for a for a large law for tonight. So I understand, you know, you want to get the same message out consistently. So what you're saying is is that yes, there are ways, but but y'all have families to mitigate the threat. You all have a threat assessment has been conducted threats have been discovered and you'll have discovered a process in which you can mitigate those threats. Would that be correct. Yes, okay, and see and that's something we get at and I know everybody sitting up here and and you know sometimes it comes across like we're challenging and in this. We represent 200,000 people that we see on a consistent basis who have concerns about these types of things and there's only one group of men and women that are out there giving the message. And that are the men and women that I work with in the Georgia State Senate. There's a lot of times that we look around the Secretary of State's office and when I say Secretary of State's office, I'm talking about the individual who's elected to hold that office is a ghost. And today he's at a rotary meeting to speak down in South Georgia. And he knew about this, the chairman notified him this of this a month ago, but I'm going to be honest with you. I'll give you the benefit of the doubt. If that rotary meeting was more important than coming up here and speaking in front of the Georgia citizens that are watching this. Then that's his burden to bear. And the questions that we ask are not for your benefit or for our benefit as much as they are for the many women who lost confidence in the Georgia election system. And look, Nancy born is an incredibly close friend of mine and she does a phenomenal job in what she does. And I support her and respect her tremendously. And I think it's every one of those election workers in those counties, along with all of us on a very slippery mountain as we try to figure out the answers and to come up with answers that the average Joseph and who rolls out a bit every morning goes to work, makes 11 pays taxes and wants to go out for free and fair elections to give an answer that is somewhat ambiguous or somewhat convoluted. I just don't think that's that's the proper way to serve the public. And I promise you I'm just being honest, not critical. Thank you. I appreciate your interest, but applause is in a prove. I want to recognize Senator Williams, Senator Williams. Thank you, Mr. Chairman. I had written this question down earlier and how to be hinted at. But if if you stop renting the QR code, would that reader read the ballot? You mean if you only had the printed text on the piece of paper? No, because the scanners are computers computers read code. And the barcode is the code that it reads. Before going further, I think we have some election officials over the state here. I would like to thank you for the job that you have done that you continue to do. And the climate of elections in this state is unlike anything I have seen. People are taking abuse. And I'm sorry. I know you're highly trained, you're highly ethical and you work very hard. And I want to say it publicly, I appreciate the election officials in these counties. I came along with up to scan. I did not have the time to do that. I wanted to thank you again, these absentee ballots. And you have the humidity and Georgia does affect the paper. And Baldwin County, we would have to lay out some of the ballots and let them drive before we could rerun them and get them to be read. Michael Barnes, I know him well, he does a great job. The QR code, if it is storing that information for the ballot style, it could also identify the voter, couldn't it? That's something that's very important is the voter anonymity. And that's why we have to be careful to not divulge how people are identified, and they have the secure ballot. But when that poll, and maybe a lot of people don't understand what a poll pad is and how it operates. But when that poll pad reads that code on the back of your license, it also has your name and address in that code. And that's what tells the poll pad what style ballot that you get. But it could also put your name on that ballot. It doesn't it doesn't do that, but it could it can't. It could be programmed so it could though. And but and I bring it it up. Because that might be a way to identify. Because I know you're you're given credit for voting when they give you your card. And then you go to the machine. Does everybody understand how a poll pad works to you to all? The poll pads are hooked up to the internet. They download the voters of information in that county for that election. And then they're unplugged from the internet. Is that correct? And they're unplugged from the internet at that point. And then you have the election. And I'm talking about early voting. Yeah, you're having your early voting. So you go through early voting. And in real time when Rick Williams goes up and votes, it gives me credit for voting. So I can't vote again. So then after early voting closes on Friday, then you start uploading that to the main server in Atlanta. At the office or wherever it is now. So those people are given credit for voting. So they can't show up on election day and vote again. And so the list and the poll pads are updated at that time. And then they're unplugged from the internet. So they're not plugged back up to the internet again. So that's why I'm talking about the poll. And so that's why I'm talking about the poll. Until after the election is officially over. To make sure everyone is given credit for voting. Is that correct? So there's been one recent change. This is part of. Part of our efforts over the past year. To be able to reduce the load during advanced voting on the voter registration system and have people operating. So that's why I'm talking about the poll. I'm talking about the poll. And so that's why I'm talking about the poll. And so the things that in order to use poll books on advanced voting, because you have multiple locations. Is that you have to have ability for those pads. To be able to communicate. So they use cellular connectivity. To be able to as you know, Senator Williams checks in. Now every pad within 10 to 15 minutes and when your county knows that OK, Senator Williams. So you know, I'm talking about. Do you sell your connectivity during advanced voting period. And then they can also use cellular connectivity on election day as well. OK, with that technology. precincts and go to voting centers so that you don't have to, if you work in Atlanta and you're trying to get home and you're stuck on our 20 and it's getting close to the polls closing that you could get to the stop at the first. Precinct polling place in my county and vote rather than having to go home to the other side of the county and another 10 miles, 15 miles to vote, could we go to that? The technology presents that opportunity. Okay. Good, thank you. Thank you, Mr. Chairman. Thanks, and we have Senator Jones. Thank you, Mr. Chair. I was just asking. We're closing in, guys. Yes, I just wanted to ask, State Women's made about, we'd have to have gain physical access to the system. What is the system and don't tell us how to hack anything, but what would that tell us when you say physical access, kind of walk us through that to gain what happens there? So that's a good question. So if you want, so Alex in his report that he developed was in a laboratory environment. He was given a ballot marking device and he was giving passwords and he was giving cards. And from that, he was, he wrote his report with the hypothetical scenarios that he did. And I call them hypothetical because it doesn't take into account the entirety of the election system of the elections process, where we have state laws that are very good county election officials follow to make sure that their election management server is locked and that they monitor access to that environment so that nobody can get to that system and have unauthorized access to it. Same thing with the ballot marking devices, that those are locked and sealed and secured so that nobody can get access to them except for the people who have sworn a note and who have taken trainings to be able to use that equipment and if for somebody, if somebody breaks in that that is detected and that equipment can be pulled out and not used. So that's what I mean when I say unauthorized access to the system. I'm talking about the election management server. I'm talking about the ballot marking devices, the precinct scanners, the central scanners. That's what I'm talking about. Thank you. One more time. Senator Doza. Be a little quicker this time. Mr. Giles, the CISAR report lists a number of mitigations. It looks like there's about a dozen of them here, but the first one from the Department of Homeland Security says that specifically for each election, election officials should contact a menu voting system to determine which software and or firmware updates need to be applied. Dominion voting systems reports to citizen at the above vulnerability has been addressed in subsequent software versions. When states contacted you after this report was released, what software or firmware updates did you advise them need to be applied? And as you I don't have the report in front of me, but in that report it also says by utilizing the mitigations that most jurisdictions were already using, those nine CISAR hypothetical scenarios or issues whatever you want to call them are addressed. So our conversations with our customers were, they didn't need to update at that point as long as they were following the mitigations that were given to them through this CISAR advisor. One of the, it doesn't say that actually. Can you repeat what you say that it says, relative community? You're saying that basically what you're saying is that if they follow all of these mitigations before the first mitigation they can ignore the first mitigation. At the time that if you, if further on it talks about that 558 and again, I don't know. Exploitation of these vulnerabilities require physical access to individual image cast X devices, access to the management system or the ability to modify files they are uploaded to image cast X devices. Jurisdictions. Jurisdictions can prevent or detect the exploitation of these vulnerabilities by diligently applying the mitigations recommended in this advisory, including technical, physical and operational controls that limit unauthorized access or manipulation of voting systems. So in there, in their opening summary, they, their first mitigation, the first mitigation is that something needs to be updated and that we should contact you. So you're saying that after this was released when Georgia contacted you or not you personally, but Dominion, the answer was don't do anything. Yet, yet you were releasing software that would, you'd already released software by the time the support came out. 510, the California was using that had resolved seven of the nine vulnerabilities. This, that you then released version that, that fixed number eight and nine. So when Georgia contacted Dominion, what did Dominion tell them that they'd need to do? As it relates to your software, we, we instructed them to follow the mitigations that were in the assisted advisory. And as it relates to the, the company's constantly upgrading systems and constantly and depending on the states and jurisdictions, many jurisdictions have different versions of our software, depending on what either their state laws are or, or particular requirements that they would like to have. So, so, SIS itself says it right there, what I read that, that by doing the steps in the mitigation section, um, you can prevent these, uh, but again, the first step in the mitigation section is to ask you what to do as it relates to updates. You're constantly developing software, as you just said, but you're constantly developing it without the intention that we need to ever update it. No. So when do, what, what, when Georgia contacted you as it relates to us using 5.5 A, there's, there's a number of things you could have said, we need to do one thing you could have said was we could follow California's lead and get rid of our state requirement for EAC certification and conduct our own certifications such that we can apply these updates faster rather than waiting for the slow federal government process, which is partially what has caused this problem. And as you know, only 11 states require actual EAC certification. So we're in a vast minority of states in that regard. And you, you raise a good point concerning the time it takes to get certified. So part of that, we knew that it, to address all these in the version 517 was going to take time to get, to make sure we developed it. We did our internal testing. We brought it to the EAC in October and it took until March 16th to get it certified. So you're absolutely right when you, when you're talking about the length of time and that is something in the industry, we have been discussing how, how do we get system.\n\nthrough faster when something like this happens. When if there's a coordinated vulnerability disclosure and you want to update your system and you need an EAC certification, you're absolutely right, waiting six to nine months for that to come out is an issue that needs to be addressed. Let me ask the question this way. Is it Dominion's position that we need to ever update to 517 or is it your position that we can skip it all together? Our position is 55A is secure. We constantly upgrade our system and we constantly produce new products for our customers. We then present those to the jurisdictions and then it becomes their decision if they want to update the system. But based on this, 55A is secure. It's been federally tested. And I might add that in conjunction with the SIS advisory, the EAC also wrote that they concurred with the SISA that these mitigations will prevent these from happening. In addition, during their own review of not only the SIS advisory, they also reviewed the researchers report and said that they did not identify any non-conformities to the voluntary voting system guidelines. So the guidelines, the federal guidelines that we all follow, these did not produce any non-conformities. Thank you. Real quick, Senator Dolez, all do you mind if I had a little color to the explanation as well? When we would have been, we go back to last year, summer 2022, the version that we thought would end up getting certified was 513. We were taking steps to be able to pilot that last year that's when we brought in the printer hardware to be able to run it in some jurisdictions. And then it turned out that, okay, that was not going to be what was certified there. The only other thing beforehand it back, I do want to just say is, just be cautious when we're drawing comparisons to other states just because structures are vastly different. I know because I transitioned from one to another. You know, Florida, a county that might have 215,000 voters has 85 ballot mark devices because it's only used for voters with disabilities. So if something goes wrong there, if an update doesn't go as right, really doesn't matter because you have less than 1% of the number of voters or less than 1% of your voters that show up that use that machine. Here, if something goes wrong with an update, everybody uses it. And so it's, you just have to proceed differently when that's the case. Thank you for your time. I want to ask. Yes. From that, sister advisory. I just want to add one other thing they put in there. While these vulnerabilities present risk that should be mitigated as soon as possible, sister has no evidence that these vulnerabilities have been exploited in any election. And the follow up in October last year, the FBI and sister both put out a PSA again saying that no systems have been, none of these kind of vulnerabilities have been exploited and no systems have been attacked or attacked. Sure. I kind of want to talk about that. Jordan, I think we all know that. But prior to this, these vulnerabilities had not been broadcast to the world. And I think the concern that we have is that there's a fix that's available that addresses all nine of these vulnerabilities. And we're not going to install this fix for a presidential primary or for primaries next year or for the general election. And then our answer is, well, we know and I use this privately, the same analogy. We know that everybody has a copy of the key to the front door. We're not going to change the locks because we can catch them before they get out the back. And I think the worst case scenario is that the mitigations that you provide here succeed. And what I mean by that, I think the worst case scenario is that there is a, there is a hack on a, even if it's not a single machine. And then we catch it, either in parallel testing or we catch it in the RLA or wherever we catch it, but we catch it. That means that we had an actual hack that has happened. So rather than then changing the key on the front door, we're hoping that we catch them before they get out the back door. And I think that that hope is is actually, if it were to play itself out that way, would be a negative. I think that the fact that the no-wing pull pad issue set us back months, frankly, is enough that it would make me want to cancel the contract if you were any other vendor that was doing business with my company. If you want, please be respectful. Yeah, you're the largest customer. The fact that that was never tested before it left your shop is, is, is unimaginable, frankly. And it has prevented, based on the timelines that they've given us, us being able to action and do what Mr. Duffy stated was the plan. Or even this year, which is to actually install your software that fixes 9 out of 9 vulnerabilities. So we keep pointing to this, this reality that the vulnerabilities have not been exposed, but out of vulnerabilities have been broadcast. And the fact that we have a fix for them, but we can't apply it largely due to the incompetence of your company. In terms of their testing is highly troubling. If I could just respond. Welcome to. Thank you. So, so going getting back to 558, the mitigation today are 517, gives you additional mitigations. So, and as far as the, the pull pad issue, I think the secretary's office said that did not delay the certification process would. It moves forward. And it is currently resolved. So we have, we have addressed that, that the connection that occurred. And we are now, we're now able to, to utilize the pull pad. And just if you don't want to eat earlier, just I want to make sure the records clear you listed off several states that we were certified in. I don't know if that was accurate. A Florida, we're not, we're in certification in Florida. I was one among, but we have not been certified in Florida yet. We're in the middle of that certification. I just, I just want to make sure the records clear. I don't know if you had the other ones. We'll, we'll ask you to clarify that if you have some issues with us. Let me say, first let me thank you. Thank Secretary state. Thank the Dominion voting systems for joining us and sharing your insights. We share the same objective. We want secure safe elections in Georgia that our voters have confidence in. That is not the differences we have here. We would hope we will do continuous improvement to our systems. We feel that's vital. We feel that. And we can't ignore it year over year because we'll find ourselves at some period of time. Unfortunately in a position that makes it difficult to catch up on. And maybe we're, we're there at least in part and part because of the lag between five five A. And five one seven. I would like to ask the secretary and his staff to work with the committee in three key areas. Please put a visible security mark on all ballots at a minimum absentee ballots. Number two. Let's look toward incrementally. And we're going to look at the data that we have here. Updating five one five. And not delaying until some time frame in the future where we have to do every camp. We've done five. Perhaps we could do 50. Perhaps we could do 100. Perhaps we could get closer to that goal. If we can effectively work in a mixed version environment. I understand you say. There's a log against that. The good news is we can make necessary adjustments if that's appropriate. Okay. And finally, and it's come up multiple times today in our conversations. QR codes are concerned. And we have legislation currently in this committee. SB 189, which calls for the elimination of QR codes and going to a human plus machine readable format so that we could continue to use the tabulation equipment. But print the ballot in a way that the person can actually see how they voted. So I think those are kind of the takeaways. I am concerned about garbage a bit. Not the fact that you're doing it. But how did we get from from needing it to where we are? Was there any any discussion with the legislature about garbage and its development and the resources needed for that that project. That's a question. So, like I said, it's been in development for over. For about two years now. And the decision was made by the secretary's office. As part of the agency wide modernization initiative. And I'm probably not the best person to provide, you know, this is the agency wide decision and I'm elections director. But I just say as you as you review our conversations, I think it would be helpful because I think that the fact that we pursue the need. In the registration environment that maybe put us in a less positive position on the election side because we had to allocate resources to that project while we were not able to move incrementally from 2019 to 2000 and 23 soon 24. I'm grateful for your time again. We're all on the same team. We're on the team to support Georgia and I'm grateful for your participation. I would ask that the secretary join us in the future so we can hear directly from him and what his perspective is on this. We're going to conclude this portion of the hearing at this time. We're going to take about a five minute break because we've got another another presentation from American America first policy institute. And then I'm going to take some public input. So we'll take about five minutes and stretch our legs. It's 250. We'll reconvene at 255. Thank you. You You You You You You You You You You You You You You You You You You You You You You You You You I You You You You You You You You You So have with us today remotely. Mr Milke. Mike Valente. Mike is the director for elections integrity at the America First Policy Institute. You'll notice that he is, via Zoom this afternoon, is that right, Mr. Valente? I am Senator. Yeah, well, I want to just preface this by saying we're grateful for Mr. Valente and his insights. And the purpose of his being here this afternoon, even though he's in California, the purpose of him being here this afternoon is to kind of share how perhaps other states conduct their elections and whether or not Georgia is unique or different or similar or what have you. So I'm going to turn it over to Mr. Valente and let him continue the discussion. Mike, so you're... Thank you, Senator. May I just say a beginning from a personal point of privilege, if you will. You could tell that states are different because in California, if you opened a committee meeting with a prayer, we all probably would be in jail by now. So it's wonderful. It's wonderful to be someplace where you can do that. So I'm grateful to be here and thank you for having me. It is at the chairman's prerogative and I'm happy to do it. Well, as you said, my name is Mike Valente and I'm the director of the Center for Election Integrity at the America First Policy Institute. AFPI is a 501C3 non-profit, nonpartisan organization which focuses on policies in several areas including the economy, foreign policy, border security, education, and elections that puts the interest of American people first. The Center for Election Integrity specifically focuses on policy related to creating elections where it is easy to vote, but hard to cheat. The chairman of our Center is the Honorable Kenneth Blackwell, the former Secretary of State of Ohio, and the former chairman of the International Foundation for Electoral Systems. I want to provide some brief testimony this afternoon concerning general practices adopted by other states when it comes to various types of voting machines and their use in the context of the issues that you all are facing in the state of Georgia. First, I think it's important to understand the intensity of these issues of ballot and election integrity. A recent poll by Rasmussen shows that nearly a quarter of the people in this country believe that Hillary Clinton won the 2016 election. Eight years later, nearly a quarter of the people believe the wrong person was elected. So this isn't something new, but it is something that remains on people's mind because another recent survey showed 58% of American voters believe that voter fraud is a serious problem. At CEEI, we also believe that every state is different. And one of our core principles at the Center is that each state legislature should decide the laws with which their elections are run. We are against federal intervention and state elections and believe that the U.S. Constitution is clear in this regard. The legislature makes and the governor signs the laws that the individual state must follow. There are, however, some general practices we have seen that help foster confidence in elections, regardless of whether you're in a blue state or a red state. The first, and I think we saw a demonstration of it today, is transparency. Voters want to see how the sausage is made so they know what's going on. Making rules, procedures, QR codes, counting ballots in the back room without people being allowed to see what's going on without U.S. legislators knowing what's going on, foster's distrust. Even if nothing is going on, it makes people think there is something going on. Transparency creates trust. The second is accountability. And again, a perfect demonstration of that within the last two hours. When something goes wrong, as it sometimes will, not necessarily for nefarious reasons, but it just happens. Voters and taxpayers want to see their election officials be honest and straightforward about the problem, what caused it and what is being done to correct it. Elected officials owe that to voters and to taxpayers. The third general thing that we have seen is the chain of custody of a voter's ballot. The more hands on that ballot, the more opportunity for something bad to happen. That's why laws against ballot harvesting, allowing someone to carry another person's ballot are so necessary. And by the way, that's also why having clean voter rolls is so absolutely important. Now, they're in Georgia. I want to congratulate the legislature and the governor for passing laws that make elections more secure and transparent. And I offer my admiration and that of those of us that work in the election integrity network, to all of you for withering the attacks you had to suffer from the current leadership of this country for taking the action to make your elections more secure. You continue this work to build Georgia's confidence in their election system through your work and hearing such as the one that you've had this afternoon, which is exactly what needs to be done. Now, as it relates to the current state of voting machines here in Georgia and comparison to other states, let's start with one very big red flag. And it's ironic because it was only brought up at the very end of the testimony that we just heard. There are multiple types of voting machines and use across the United States. The most common are the ballot marking devices such as those that you have in Georgia. There's also direct recording electronic systems, optical scanners and hybrid systems. Georgia is the only state in the country that uses ballot marking devices from Dominion as its only system for all voters. The only other state that uses one system for all voters is South Carolina and they use a different vendor. Now, in 48 other states are using the different system. That's a legitimate and concerning red flag. And as the legislative body representing the people of Georgia, you have every right to be on guard into question what is happening, what upgrades will cost, how long it will take. More importantly, you should be in the loop every single step of the way because you are the ones that have to answer to the voters directly. Many other states do use Dominion ballot marking devices, as was mentioned, but mostly only for voters who have disabilities providing extra accessibility to these people. In fact, the ballot marking devices were developed after the help America Vod Act of 2002, specifically to accommodate these voters. About 69% of registered voters in the U.S., which is the vast majority, reside in jurisdictions that use hand marked ballots in combination with scanning and offer the ballot marking devices available for voters with accessibility issues. About 25% of registered voters in the U.S reside in jurisdictions that use ballot marking devices across the country, across the county or the state. And about 5% of registered voters reside in jurisdictions that use solely direct recording electronic devices. So while ballot marking devices are not uncommon, using them statewide for all voters very much is. This method of conducting elections poses issues such as the challenges you find yourself in now. When security issues arise, it is difficult to implement software updates statewide as it requires incredible time and resources because you must update every single machine as you heard this morning as opposed to other states that only use the ballot marking devices for voters with accessibility issues. A recent report released in a court document shows that the Department of Homeland Security, as you all discussed, recommends updating your system. What's more, Georgia legislators who make the election laws and approve the funding for election machines, we're not made of where this fact until after court documents were unsealed. That's not acceptable. You need to know this stuff because you have to be the ones that make a decision and get things right. Common sense says if you have a cell phone and an update to protect the security of that phone comes out, you immediately take action to update your phone with the security. And that's what needs to happen here. Voters in Georgia have every right to expect that that kind of activity and you as decision makers on budgets should have been notified directly and immediately once this occurred because you're the ones that have to take the time and the money, find the money to make this these upgrades possible. It should not take an action from the court to unseal a document that makes you aware of something so important. While we realize that this update may not be feasible for 2024, it is incumbent on the Secretary of State and the legislature to quickly come up with a long-term solution that protects the security, the data, and the vote of each and every eligible voter. And one of the alternatives to look at, and we would just done in other states, is to have hand-marked paper ballots that can be scanned rather than universal ballot marking devices. At the very least, jurid's stictions across Georgia must maintain paper trails that can be audited from the 2024 election on Dubai Partisan supervision in case issues do arrive.\n\nAnd as we heard from earlier today in the testimony, I would especially flag as you already have the QR code. Because even though a voter may walk away with a ballot or a piece of paper that says how they voted, it is possible that the QR code that is sent in that actually does the counting may not necessarily reflect that paper ballot. If, unless you can definitively say that there is no way that that can happen, that QR code, QR code is a question mark. Transparency and accountability must be insured. People should not be attacked or labeled election deniers when they ask the reasonable questions of why something was not done, or why legislators were not told about something that impacts Georgia voters. You know, after 2020, Georgia State legislators had a weather and national media firestorm when you rightly passed election integrity laws to protect every legal vote and every legal voter. In the 2022 election, the State experienced record turnout among all demographics. The law passed, the laws passed and proved the electoral process restored some of the faith in the system and helped make Georgia a nationally recognized election integrity leader. Georgia has been a leader in stopping the use of outside money to fund elections, a tactic which undermines confidence in our elections. In fact, the recently passed legislation signed into law this year by the governor is model legislation that other states around the country can follow. The positive actions that the Georgia legislature and the governor have taken to improve your election system should not be undone because the report is not made public and action to update the security of your voting machines does not happen. I would say that to continue the progress you all have made and you have made great progress, it's important that transparency and accountability are the watchwords for the decisions you make going forward and that substantive changes occur to make Georgia voting systems better. I would finish by just saying after listening for the last two hours, which was very enlightening to me, don't stop asking questions, don't stop holding people's feet to the fire, your voters, your constituents, your taxpayers expect that. And I would just say, you know, ask this question. Again, after listening for the last two hours, do you feel more confident and comfortable with your election system in Georgia than you did two hours ago? I'm not sure I'd need a QR code to know the answer to that question. That's why it's so important you continue on this journey and continue to make that effort to get people to work together to make your voting system better. Thank you for your time and I appreciate this opportunity to speak to all of you today. Thank you, Mr. Balente. I'm gonna ask a couple of questions and I'll let the committee share as well. We're gonna lose a few members because of the time we've taken, or early on we've got some other meetings going on around the Capitol, but I'll be here as long as you're here, okay? And so we'll get a chance to get that. But first of all, let's go back to the experience that you have seen in other states. As far as what I'll call mixed use approaches to voting. So you see electronic voting, you see BMDs, ballot marking devices, you see henmark ballots, you see what other variety of options are more common than perhaps the one size approach that we have. I think the most common approach is what you'd call the hybrid system, where you have the, you have the system where you mark the ballot, you get a paper trail audit of that ballot. It's kept in a device that is transported or sent across to the count. I think that is probably the one that is most used across the country. I would also say though that the idea of having ballot marking devices as a backup is great because it also gives you the opportunity to help for accessible voters. I think the problem becomes when you put, in essence, all of your rigs in one basket, and you're suddenly in a situation that if one thing goes wrong, it impacts the whole system. I think that is really the kind of quandary you found yourself into right now, but I think the most common thing is the hybrid system where you have the hand mark ballots and you have ballot marking devices that are also used as a backup system, especially for voters that have accessibility issues. Questions from the committee? As we look moving forward, and we recognize that we are currently in an environment where we have a standardized approach, a standardized system. What remedies or recommendations might you share for us to enhance the already secure environment that we enjoy? I would say you've perfectly identified one key question that needs to be addressed. I'm not sure it was answered, but it still needs to be addressed, which is the QR code. I don't, in just listening to the testimony, one of the problems you have there is, when people walk away, they should know that what was transmitted is what they actually voted, and they don't know that when they walk out of the polling place, because they don't have access to that QR code. I think it's very important that that is one of the things that needs to be addressed going forward. It's the kind of thing that give people the confidence that they know what they did is what is being counted down the road in the official ballot process. It feels good to have a piece of paper that says this is how I voted, but it's another question when you have this QR code that, as you all pointed out, isn't necessarily used in a lot of other states that use this system. I think that's one thing. I think another one is an auditable, a paper trail that's auditable that you can look at, because you want to be able to show if anything does happen in 2024, you want to be able to have that audit trail available. Again, I think it's something that gives people confidence in voting. I think the third thing is to take a look at whatever may have happened in 2020 or 2022, and make sure that those things are addressed. I think one of the things that cannot happen, or should not happen, I should say, is that people who bring up issues that may have, that they think may have caused something to happen the election to be just automatically dismissed by labeling people as one thing or another. I think we're in a situation here that it is so important that people of expertise and professionalism take a look at everything that people bring forward to make sure that there is nothing there. I think that's also a very important thing. To just summarily dismiss people by labeling them, I think is a very bad approach in this environment. Nervage. Yeah, thank you, Mr. Chairman. I don't have a question, but I'm gonna have to leave in about 15 minutes to get to an appointment up in my district with traffic, I'm gonna have to leave about 3.30. I just wanna make a closing comment, and it piggybacks a little bit on Senator Dolosal. The Halderman report showed we have nine vulnerabilities. We know there are bad actors out there, and his analogy was great. They got a key to the front door. And if we're gonna let these bad actors know that we're not gonna do anything, every one of us sitting up here is up for reelection. Our names are gonna be on the ballot. We got a presidential election, and I can just tell you, my constituents don't trust those QR codes. I hear it every time I go to a meeting. They don't trust the machines, the scanners, or the software. And we sit here as a state with a $5 billion surplus. And if that means we need to get people together to install this latest version that addresses these nine vulnerabilities, let's do it. If it means whatever we need to do to bring trust back, there's nothing more important than the elections. We can't wait till after 2024, in my opinion. I can't if you want. I would stress. This is not a pet rally. So I would just stress Mr. Not a political grandstand. This is a hearing. Yeah, so I just would say this Mr. Chairman, we've heard a lot of testimony, and we do know that they have a key to the front doors the Senator Dolisaw said, and I don't like that. I don't want anybody having a key to my front door. So anyway, I think with the surplus we have, we can do what we can to fast track this through technology, whether it's AI, or just getting extra people working on this to get these machines and get these vulnerabilities addressed. Thank you, Mr. Chairman. Thank you. Thank you, Senator. Mr. Chairman, could I say something? And just quickly in response to that. Yes, sir. I would say you hit it right on the button. Forget left right, red, blue, common sense. Says you wouldn't allow knowing someone has a key to your house. And the hope that you'll catch them before they run out the back door with the television makes no common sense. I mean, you want to take every precaution that you can. And I would just say that that's a good approach to take. Does it make common sense in real life to take this particular approach that might be suggested? Thank you. We concur with that assessment, Senator Williams. Your pass, okay. Other comments in the committee? We're dwindling. Thank you so much, Mr. Belente. We ran too long to keep the fire burning here. So that's okay. Thank you for having me. Thank you for doing this. And yet recognize we've had discussions with multiple national entities. I want you to understand that this is November the 1st. We became aware of the challenges that we dealt with about the 1st of July, right after the reports were unsealed. And since that time, this committee has been, has had multiple meetings in July and August and September and October culminating in a discussion today. But at the end of the day, we have been addressing this concern for the last four months, five months. And we don't have a quote unquote resolution, but we're working toward actions that can hopefully get us to a much better place. We're going to shift down and I have 18 individuals who would like to address this concern. I want to lay a couple of ground rules down because I'm going to allow all 18 members to address the committee. First and foremost, you must address the issue at hand. And the issue at hand is the current status of the Dominion software version. We're not talking about an alternative A or an alternative B or some other challenge. And there are many and I acknowledge that. We're specifically addressing ways in which we can address the problems from the Dominion vulnerability report, or the Dominion systems where the vulnerability have been addressed in 517 and how do we get there? So that's number one. So you've got to be very, very focused on that topic. Second thing is because of the number, we're going to limit your verbal comments to three minutes, three, you're welcome to submit written testimony beyond that. But we'll have a quick timer and we'll try to work through this as judiciously as we can. So any questions from the committee? We're happy to hear from those who have joined us today. We're going to start with Joseph Kurt. Joe, are you still in the house? All right, I thought he might be. He's the elections supervisor in Bartow, Georgia, and has been a strong asset to this committee over time. We're grateful for your input. Very much. I appreciate all hearing from me. As you said, my name is Joseph Kurt. I'm a supervisor in Bartow County. The first point I want to make is our system is secure. I agree with you Senator Burns. Thank you very much. It takes physical access to anything to it. You can't get into it on one and the upgrade would make it more secure. I wish we could do it. We ran out of time, unfortunately. But it's not necessarily less secure because of the report that came out. There's things we can do to make the situation better without doing the software upgrade. We can focus more on things we already do of chain of custody and secure storage and polling place security and training and increased audits would be great. But that all takes funding and money. And I appreciate the point made earlier that you all have that ability. And we're going to need money next year to make this better going to that next butterging cycle. That funding would help the person out the secretary of state's office is just understaffed. They cannot get out everything done. We need to get done. We can't get the resource we need out of them because of the short staffing. We more secure, quote, and for security supplies. And then the state election board has the ability to make rules. That would again really help with security with the process. But you know, they are still getting the funeral and they have funding now. But I'm sure they could use more. The other things I wanted to say is a few points from earlier. One, the QR code does store the votes for tabulation. But just because you bubbling it looks like somebody's name doesn't mean that the machine knows you'd bubbles next to the name. It looks the bubble is a coordinate, not as a name. So in either case where you hand mark a ballot or you machine mark a ballot, you still have to audit it to know it was tabulated properly. And I wonder where we're putting so many resources in this one area. But we're not actually looking at what would make the thing more secure. The remedy for an issue with the RLA is a recount. If you go if you go into our RLA, you discover a problem. You go through the whole process. And that sparks our recount statute or recount rules, which can be done by hand if you pre if it's shown that the skaters are not trustworthy. So that would that would be how that would go if we just discovered a problem. There is no voter info in a voter access card. It's the ballot style. Nothing else. That's where that the distinctions made. Once you get that green card, your name's not on it. It's not on the ballot. And they can't go on the ballot because it's not on the card to transfer between two systems. Printing full face balances and nightmare from the MDS. There are huge that the trade goes off the end of the table. I would look at that very carefully before you went down that path. Again, no matter how you print the ballot, you start to audit it to make sure it's counted properly. And what we have right now is easier to audit than a 18 inch double sided ballot that prints out so long. And we verify the balance of legitimate through the process, not the paper. You know, we want to be sure the person who's casting the ballot is eligible to vote. They got the ballot from us. We just don't count ballots because they can't handle it to us. So having a security mark would add in confidence, but wouldn't necessarily make anything more secure. We already have procedures in place for that. Thank you. Thank you for your input. We have a couple of questions from the committee. Senator Williams. Sir, you know, I want to thank you, Miss Kurt, for all your years of hard work. I know you do a great job, but they're only people lucky to have you. What I understand. There's four different software platforms that you're operating on. E poll, easy vote, the Jarvis system. And there's one more is that they're giving the meeting system. It may be, but you know, you got so many different platform set. You've got different and I know Senator Dolezal, you're more knowledgeable on the software stuff than I am, but you've got that many different platforms. And they're all trying to enter mingle. And I also understand that sometimes when you call the Secretary of State's office, you've got an issue that you can't get a direct answer. They have been told they tell you look at the code, but you're calling and you're asking their attorney and their legal counsel there to give you a ruling. And I understand that there's some breakdowns and some communication problems and not quickly to get an answer to some of your questions. You have a question, Senator. Just just just asking for his input on those things. If some of those are issues with that many different platforms, and is it really that difficult getting communication from legal counsel from Secretary of State's office. So, things they're very briefly on. The system you described are in place easy, but was a third party system that we used to supplement same things, but you should not leave them forward with the new changes to the office to. So that we use the process significantly. I see if I have that back tonight. I think I have more than one spy in the game. And those systems do have to connect to each other. We're working through some stuff with that right now. As far as the Secretary of State's office goes, I think some of the issues we have with communications with them comes down to again, how many people actually work there. It's hard. I used to work for Secretary of State, Mrs. Cippy. It's hard to support a large number of counties. We have a few people in the unit. And as far as their attorney goes, you know, my board has its own attorney. I think very highly on him. He does a great job for us. And if we do something that's illegal, that's he's going to defend me in court. So when we call us for a state's office, yes, there are times that I wish we get a more direct answer from them. And I think that there will be a lot that could be addressed rather than answers to questions through step by step training on certain topics. But when if I'm not going to call the Secretary of State's office for a ruling on something, because that's not who's going to be in court with me. I'm going to call my journey. Thank you for your response. I'd ask my colleagues to make your questions to sink and witnesses similarly. Senator Arby. Yes, sir. Thank you. Quick question. We came up with and we're talking about the security paper. And what we're seeing is the security papers are used. The machines do not have the security settings turned on. I was we had had testimony from the Secretary of State that you were given a wand that you could scan the paper and look at it. I text message one of my commission people with elections in our counties. He says we got one. It was broke. We have requested it. Had requested several times. And he says we find we have got the second one, but it didn't work either. My question to you is are you provided the wands to be able to check the paper and do you use them and if they were do they work? Mine does work. It's not so much a wand is a small device you push a button. There's a light on the bite. So it's a piece of security paper. So the text of the fibers in there that constitute the security paper. The point I'd like to make about that is the only time I use it is one have a question about whether or not the ballots. I'm looking at our legitimate. At a pointless election day that person comes in we check them in. They go through the process all in front of us. They print the ballot in front of us. They see in front of us. At no point are we concerned that they are creating a new ballot while they're there. Through the mail we're verifying your identity. Your eligibility not only when you apply for your ballot, but when you turn your ballot back in. Again, we're not going to count it because you handed to us. So there's been. I think one time that that I went back through as it's almost like additional steps to to check for security paper and I've also used it to make sure that the paper I'm dealing with was keeping the first and that. Because I wanted to be sure I was everything was sorted out properly. But as just a matter of course, no, because we already verify those things a different way. Thank you. Thank you for your input. I would hope that we can get a visible mark than that would not be a requirement. Administration, administration, this dialogue took almost nine minutes. That will take us meaning we'll be here about another four hours. If we continue at this pace, Ms. Cruz Victoria Cruz voter GA. You she here. Well, Ms. Cruz, please be prepared next up is 10 minutes. Ted, be ready. Three minutes. We'll try to make better use of your 10. I think we only need one cheer here now. Thank you. My name is Victoria Cruz. I live in Athens, Georgia. I'm a retired word certified. Pathologist, one of my first jobs when I started working was being an assistant medical examiner. And my first case was going to be called by the police to go to a home. Please direct your comments to the issue at hand. And that is Dominion system 5.5 a versus 5.17. Very specifically as a pathologist as someone who's trained to look into lots of information before I make my diagnosis. I have looked at these voting systems and all the reports out about them. And I I'm sorry, I do believe they're connected to the internet. I'm sorry. Specifically, what is your input on the software? I think the system is insecure. I do. Even though it's been certified nationally, even though it's been audited multiple times. I appreciate your opinion, but I'm trying to get to. I am not sure that that software has been audited many times. It is a closed source, not an open source software. There has been no independent auditing. The actual people who do the auditing for the secretary of state or who do the auditing for the EAC of these machines are paid by the vendors. They are paid by the vendors. They have a vested interest in certifying the system, whether it is secure or not. My other problem with it is of course the QR code. Dr. Halledman has said that that can be changed. It will not reflect the printed ballot, the readable portion of the printed ballot. Dr. Halledman is well respected, I believe him. The biggest problem if we are made to stay with any electronic voting system is that we are not allowed to audit that system. There has yet to be a citizen audit because citizens are kept from looking at the ballots. How does that relate to 5.5A or 5.1SF? We do not have transparency with these electronic voting systems. With no auditing capability, sealed ballots that require a lot of expense to get to, we have not yet been able to look at the ballots in Fulcum County because of all the legal challenges. Criminal defense attorneys being brought in to prevent the case from going forward. Judges just violating precedent by saying that voters don't have standing. That is my problem. I appreciate your input. Thank you. Let me say I recognize this is a very passionate issue and I share many of your concerns. But we are trying to focus on improving the current software environment. We will have 10 matches with the Libertarian Party of Georgia. Next is Sandra. Here. That is right. I am sorry. Ted, I am from Cobb County. I represent Libertarian Party of Georgia and several other groups who are very vested in making sure that our elections are clean, fair and truthful and honest. Addressing specifically any software upgrade, we have the original problem in that the QR code actually violates several sections of the law. There is no legal authorization to put a QR code under the rules and regulations 143.1.14. The QR code causes the spoilation of the ballot. It is an extraneous mark. It is not legislated. It shouldn't be there. That is one thing I can say about all that. Another thing I can say first and foremost about the whole system in general is that the law says 21 to 300 says that the uniform system shall be used by all counties. But it doesn't say in there and it is implicit that if the county chooses not to use any system at all, they don't have to use any system at all. They determine the number of machines that they need and the number can be zero. So the Georgia code title 21, everything in it says that the ultimate fashion of the election is up to the election supervisor and the county board of elections. They can choose to use paper ballots. All of this money we're throwing at fixing a broken system is just a boondoggle. It kind of reminds me of the Vietnam War. We spend money. People, contractors make lots of money on it. We just go on and on and it never gets solved. Same way with 285. I've been here 20 years. This is a situation. The issue of updating a software for a system that doesn't work anyway. It will never work as a waste of taxpayer money. It's a waste of our time. And it is not going to build any confidence in anyone who has any information in their head about how computer systems actually work. Nothing is not hackable. Anything with the computer code in it is hackable. Vicing the software is not going to fix the original issue, which is we should be on paper ballots like we had been for like 250 years prior to the implementation of the electronic voting machine. I will ask that you refrain from expressing your positions. You're welcome to testify. Sandra, help me please, Bearded. Bearded. I didn't see the end. And then after that, Ms. Battles, Cindy Battles. Thank you. Okay. The Dominion election software is causing us to lose our votes to a hackable system. And it's called, I'm here to speak on the or appeal to you on behalf of the senior citizens. I resemble that remark. Exactly. Well, most of us live on low income. Indeed. You haven't seen my site. And we are suffering because of this election software that they won't update. But even if they did, many people have said it's not going to work. These machines are connected to the internet. I work to pull the floor. And it is.\n\nThe tale is connected to the internet. I don't care what the meaning says. Our struggle is very real. And our struggles can pretty much be laid at the feet of this general assembly because you're able to protect us, protect our votes. We are watched on public TV when votes were switched from President Trump to Biden. We watched again in the Senate race on live TV where votes were taken from one candidate and put on the other candidate. You need to address the topic. This is related to the elections software of dominions. It's causing us horrible consequences. I mean, the inflation economy were on the verge of World War III. I mean, look what I was going on. We had a president of World Peace and this software. We got this software out there. We have this software. Thank you, Father. Well, we have got to do something about this. This is why we're here. I think this is too... Listen to these people up here that made billions of dollars off of this. We paid for this building. We paid for all of this. Listen to us, please. Thank you. That's why I'm here. Thank you. All right, Ms. Battles and Ms. Marina. That's a little hard to follow. All right, Chairman, you ready? It's good to see you, Ms. Battles. Good to see you as well. I'm always fearful when Ms. Battles and I might agree on something. My name is Cindy Battles. I am the policy and engagement director. I know you're just grinning and this is almost killing me. So I am going to say at the beginning of what I'm about to say that I firmly believe that the election results of 2020 and 2022 were valid that the elections were secure. All of those good things. But I do want to talk a little bit and you're going to have to give me a little bit of leeway because I'm going to talk a little bit about HB316. I'm going to talk about the election. I'm going to talk about the election. I'm going to talk about the election. The election. When it was 18 was ancient history now. But it's 5.5 a. It's directly. It is the. All rising legislation for electronic voting. So in 2019 when HB316 was passed, a lot of the things that we're talking about with this software. I actually stood before y'all and gave the same concerns and I was told that I was, you know, creating distrust in the election system. I also told that those concerns that we had would be addressed by the upgrade that if you look at the contract, we paid extra for that upgrade by the way was 5.5 B. And it was certified September September 10th of 2019. We acknowledge that the secretary has not chosen to upgrade the software since this initial implementation to 19, which is one of the reasons why we're here. Right. Exactly. So are we also talking about the fact that because we're getting the same excuses that we got in 2019 when I had a conversation with Chris Harvey and Decatur County about the upgrade and we've had upgrades in July 9th of 2020 and June 8th of 2022. So there's been time to do this, which is my point. We are in a situation now where there is distrust in a system and I don't know about y'all, but I just had to go through a training about security and my passwords and the thing that I was told is every time there's an upgrade, I'm supposed to do that upgrade immediately because that's how we protect against viruses and threats to the security of our laptop. I'm just, I don't know, I don't know like what we need to do now, but I appreciate the Senator Beach's comment that we have the money that we can put into our elections because that is a serious concern. Y'all already know I have that. So starting the RLA 316 and the state election board allows the Secretary of State to choose the race. Not anymore. Okay. You need to look at Senator Williams's bill SB 129. It requires that every local jurisdiction do a federal state race. Right. Right, but. But the Secretary does not choose which race. The RLA the RLA is still not a random choice and it's supposed to be even the race that the initial race is supposed to be a random choice because the randomness is part of what makes an RLA the best audit for this system. I hear you and I have to review 129 and Senator Williams I've discussed this because he was all for that fantastic and we will review that but thank you. I appreciate your input. Thank you. Thank you. Miss Marina. And then David cross, Mr. Cross. Hi, I was you know I've sent you guys a quite a bit of documents and I have a summary of this and I'll hand out to. But basically the first. Go ahead and state your name and your and your original email. Thank you. And that one page chronology of the times that we violated. The size of the EIC the Tottenbergs ruling and everything you've received that. But one of the things that's interesting if you look at the chronology. What happened in 2019 and 2020 there were three versions to me and pushed out. And I have Texas review here Texas twice try to approve it. Oatden I didn't have a huge list. Colorado banned the QR code in 2019. The million is based in Colorado. The reaction of upgrades was driven by several states for somehow Georgia didn't find out. The other thing that it concerns that while we know that there is a room that requires the A.C. to certify it any voting system. I was really shocked that okay certified if five years ago. Is that it? Are you done? I have a research that in 21-2-324 does say that no kind of voting machines are approved. Shall be used upon if upon reexamination of any voting machine previously approved. It can it is deemed no longer safe and accurate. I'll give you this. If the size of report the 31 cyber security special is the E.A.C. the Tennessee air I can go on and on. If all of those examples about inaccuracies by the machine are not enough. I do have a link there which I hope you all seen the de cab. Voters spears who apparently was given the least votes to all candidates and turns out she had won. I was actually voting for the Cal election. I hear the secretary of state blame a human error on everything. As far as one thing actually not here. Are you familiar with that vote of our paper audit trail? I have dominions of certification here which I can give you a copy and I can send as well. I think that is the R version is the only one even before ours that does not have VVPAT vote over five paper audit trail. And here it is. I have downloaded all of them and that's one of them. The one last thing I want to make is I think I'm running out of time. Thank you for your input. We're welcome to. Can I say one more thing? I appreciate the update which I know. I appreciate you. I appreciate you coming and sharing but submit that additional information in form and written form which we've already received quite a bit and I'm grateful. And I have. Well, I have them on the party you have for it. Oh, just don't we have. Okay. Mr. Cross. What? Can I ask what list you're using because several of us thought we were further up on the list. I'm sorry about that. I'm using the list that was given to me in order. I apologize. Okay. I'm just. Yes, sir, thank you. I'll be. I'll be brief. My name is David Cross. I'm the second vice chair of the Georgia GOP. Americans use hand-marked paper ballots for 200 years. We turned to machines because we wanted instant results and we thought the machines were accurate and safe like a scantron at school. The mountains of it. Of evidence that we found have suggest that we've all been duped. Professor Hallerman wrote that the touchscreens can subvert all security mechanisms. Not a few, not some not many all. All right. He also wrote that Georgia voters should have no confidence that their votes are counted correctly. So let's take a look at what Dominion says about Dominion 5.5A. Dominion says in a deposition that Eric Coomer gave he said just weeks before the 2020 presidential election. Dominion's. Dominion's director product strategy and security Eric Coomer acknowledged in a private. And private email that our. Stuff is just riddled with bugs indeed Coomer had been cascading Dominion's failures for years and in 2019. I would ask that you specifically address Dominion system 5.5. This is this is we are using 5.5A. This is what he's talking about. Okay. Indeed Coomer had been cascading Dominion's failures for years and in 2019 Coomer noted that our products suck. He lamented that almost all the Dominion's technological failings were due to our complete f-ups and installations. Right. He also said he identified a critical bug leading to incorrect results. He hadn't been three minutes. Would you buy a car from a manufacturer who said our products suck. I would not. I appreciate your quotes, but the language is inappropriate. Okay. I'm. I just answered the quote. All right. So what is the law say about the acres of the machines? We found my group has found duplicate counted scan ballots all over the state. Thousands were up to 13,000 right now. The law says 212365 says that it shall and properly operated record correctly and accurately every vote cast. 212368 says that the approval of the same system shall be immediately revoked by the secretary of state if it does not record votes accurately. It's okay to admit that we made a mistake in ditch Dominion or at the very least allow counties to opt out and use paper ballots. Thank you. Thank you. Appreciate your input. Miss Harp, Dorothy Harp. Miss Harp. And then I think I may be on the right page next Gabriel Sanchez. Miss Harp. Hi everybody. Hi. If you would share your insights, please miss aren't briefly. My name is Dorothy Harp. I'm from Putin County. I want to say about the main machines. I don't trust those machines and those machines does flip those votes. And how I know those machines flip those votes. Because I voted on one of those machines and that machine. I saw it with these two eyes. I want to say that I want to change my vote. I want to say it to the. I want to say it to the. I want to say it to the. But I think I would be out of order to say it to him. But I'm saying it to you all because you all can do something about it. We should get rid of those machines and go to paper ballots. Thank you. Appreciate your input. Gabriel Sanchez. Hello. My name is Gabriel Sanchez on the policy associate for pro Georgia nonpartisan voting rights organization. I do agree that we really need these software updates as soon as possible. And it's disappointing that we don't have the time to do it. And I do wish hope that the secretary states office and the legislature can work to try to find them. The best possible solution we can to make sure that we have. Secure elections and secure machines, especially a big concern because we have seen these being breached in coffee. And we have seen these being breached in coffee county when there was an illegal attempt to overturn a 2020 election. And so that is a clear example. And a real example of a potential fraud that we have to be careful of and we have to make sure we mitigate that is anything like that happening again as much as possible. It's also important, I think in regards, I think one of the solutions that we can have to try to mitigate risks next year as one of the former election directors from Bartow County mentioned is funding. And so there's a lot of unfunded mandates that have been passed by the legislature in the past few years. And I believe that if we're going to increase the mandates on all these counties, we have to make sure we have the funding to back it up, especially since there was a ban on counties taking third party funds. But there was never any talk about replacing those funds in a sufficient manner so that the counties can actually afford their elections. So we could accept third party funds, but had to go through the Secretary of State, State election board so that it would not be selective distribution or resources, but I appreciate you. Right. And you know, I think, you know, one thing that we definitely need to do as well is that when we, when we're talking about improving our elections with a software update and all the other things as well. We want to make sure that we're using common sense and objective facts to create solutions and not basing things on conspiracy theories and false claims of election fraud from previous elections. We're making our solutions. And last thing I do want to say as well. And last thing I want to say as well is that I was also working in legislative session in 2019. And I do think that it is interesting that there were some senators who are very critical today who supported the implementation of these machines back in 2019. And you know, there were the same very similar comments from being made by them were being made back in 2019 against these machines. And so I think what we should have been doing is listening to what's happening in 2019. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Jenner. Sure. Help me rely on her permits. Permits. Thank you. And then Eugene. Gabriel. Okay. I'm going to make good use my two minutes. I'm going to her man. I'm from Lincoln. Lincoln County Georgia. First. Yeah, Lincoln. Thank you. Thank you. Thank you, you're welcome. Thank you. Thank you. Thank you. There were 14 people up here beginning when dominion was here and the SOS was here. Now look who's left. Four. Four. And you. I don't know why you guys are still here, but anyway. When the US ditches court found in 2020 that the voting system violated two of Georgia statutes, the secretary state simply ignored it. I'll get to the update. The updates won't work. This is the reason why we don't trust our voting systems. We don't trust the vendor who's hold it to us. And we will never trust the secretary to her state. state who purchased it and covered up the problems updating it won't solve the problem. The people of Georgia deserve honest transparent elections. We need hand-counted hand-marked paper ballots publicly recorded, hand-counted at the precinct and the tabulating centers. Nothing else will secure our 2020 elections. Emergency ballots can serve this purpose. You will listen to us, but probably not. Kind of like the movie, have you all ever seen the movie, Matt Agascar, when the penguin said smile and wave boys, smile and wave, that's about what you guys are doing. We the people are in charge. Thank you. We need to remind you of your constitutional duties to uphold your oath. You serve us. You need to uphold your oath. And if you don't serve the people of Georgia, you might as well resign. Thank you. Thank you. Thank you. Sam, in Carlin, Chris Carlin. I'm sorry Eugene Gabriel is. Yes. I'm sorry you're Eugene and now you're Mr. Carlin. Sorry, go ahead, Mr. Gabriel. My name is Eugene Gabriel. I'm born and raised in Georgia. The term of whole life. Good. Short to take graduate. No jackets. Yes, sir. Now, no dog fans in the room. Come on, dog fans. I'm just briefly. You're right. Yes. I'm just briefly. We, this committee is looking to other sources of maybe what's going across the US as American First Policy Institute did. I just want to make three points that the Republican National Platform are returned to excellence in American voting elections in their 2023 summer meeting. They laid out three national platforms. And that's all I'm going to say. Okay. So resolve the Republican National Committee boldly opposes. You don't need to read that you referenced it. Okay. Summarize it. Your own words. They were pretty much agreeing with AFPI. Let's go with hand count of paper ballots and then not go with the ballot marking devices. Discussion day is not about hand mark ballots. But you need to get the ballots. You need the 5.5A and 5.17 to go with the ballot marking devices. So they agree to get rid of the ballot marking devices. And that's the gist of it. Thank you. I appreciate your input. Now Sam, Carlisle, Carlisle, and then Kevin Parker, Mr. Parker. You're up next. Thank you, sir. And I'm a little bit disappointed in who we have left to hear our. Well, it is. But the biggest problem that I appreciate, Senator, I do appreciate being here. And we did we did run a bit longer than we had. We did. But I want to thank you first off for having this hearing at all and allowing some public comment because I think some public comments needed. The big thing that we're missing here besides all the updates that should have been done is we don't have the secretary of state here. And I'm very disappointed that secretary of state is not here as a citizen of the state of Georgia. I've expressed my same sentiment. And then earlier in the day, sir, you you mentioned that the University of Georgia had done a survey and everybody was happy with their. No, not everyone, but a large percentage. A large percentage. I've got a copy of that if you'd like to see it. Well, how about the Rasmussen report? Have you heard it? I believe you heard that report from 62% of Georgia voters all both sides of the wall, Democrat and Republic and do not trust voting in the state of Georgia. So here's my point about the upgrade to the new electronic machines. If you're going to get the trust back to the state of Georgia voter, you're going to have to change the way we're voting. And I can tell you that it ain't going to be from an upgrade to the ballot market device. We're going to have to go to hand-mark paper ballots like I live in Grady County. That's all way down on the Florida line. We grow corn and cotton down there and we kind of simple. We like paper. Matter of fact, we grow a lot of pine trees and we cut them up into paper and we got plenty of pine trees down there to make paper ballots. And so I suggest that this bird and oil of y'all making a dress on this in this calendar year because in January when the session turns in, I'm not sure you'll be able to get in the door if you don't and that's my respectful spot. Thank you. Thank you for your input. I would acknowledge that I'm from Stryford County, Georgia and we grow peanuts, cotton, corn and pine trees. And I appreciate your input. Mr. Parker, welcome to this opportunity of a lifetime. Thank you, Chairman. Thank you, Mr. Parker. Thank you, Committee, what's left of it and folks that are online. And thank you for extending the same grace and liberty to me that you extended to the Secretary of State's representatives, Dominions representative and the expert witnesses on stain on topic. But the first thing I wanted to bring up, because we are before the ethics state ethics committee, is according to the dictionary, ethics is to study and practice of what is good, moral and best. Ethics helps us make decisions that create positive impacts and steer us away from unjust outcomes. It is truth, honesty, virtue and justice and it regulates our way of living and helps us live in a society with peace and harmony with others. And my prayer today is, Mr. Chairman, is that the state Senate and the state house representatives and hopefully our governor, they will actually take a hard look at our election cycle and do the moral ethical thing. And that is make the people of Georgia have trust in our election systems. The Raspews and Poles say 62% of Democrats and Republicans are not happy. In regards to the software update, I am from Appling County and we are one of the five test counties. And as of yesterday, we had 72 backslings vote on the ballot marketing devices in our race to date on machines that were provided by the Secretary of State's office, six BDMs or BMDs and two tabulators, one which is of the old software system and one new. And the one with the new software system on it, five one seven is incapable and unable to tabulate the ballots. So if five one five or whatever the other number is and five one seven are not adequate, then I agree we need something to change. Are you referring to Appling County backslings? Yes, yes, sir. I'm the matter saying is currently they're using that for municipal elections. Is that correct? Currently in the municipal elections. As of yesterday, 72 people had cast their ballots votes on the BMD on a five one seven upgrade. Five one seven upgrade and the tabletter with that software was incapable of counting the votes. So there was an issue there. That's information that this should have been provided to you today, but they were either unable or unwilling to give you that information. The second thing is I'd ask you to take your phone out and go to your code. Yeah, take a picture of it and take a rotation because here's the definition of a QR code. A QR code is a 2D barcode that gives consumers access to a URL or a website to provide them information on products and services of their interest. It is also used as a product identifier so it can it can provide information. According to the dictionary, a QR code takes you to a URL that provides product services, informational product services to consumers of their interest. I've lost my technical expertise. There you go. No, I'll say I can't I can't comment. So I'm going to take you back to 2000 and you're going to need to wrap it up. I'm wrapping it up. 2013. I bought a deer player deer slayer game for my 12 and 13 year old boys and my God signs. And they laughed for two weeks because I couldn't kill deer on my computer and they did in 30 seconds until I overheard them talking about the cheat code that they downloaded on the website. Ah, so I'm not saying that's a cheat code. All right. But if the Secretary of State's office, the voter and election officials have no idea what's in that code and the only people that can read his dominion. Amanda. Then it could be too much power in one person's hand. I hear you. Thank you. I'll take questions now. Thank you. Any questions? Donna, part of your election is there a sentence I learned? No, she's not. All right, Shonda is. Thank you, Mr. Farah. Thank you. Amanda. Amanda. Pretty man. Pretty man. Oh, pretty man. I'm sorry. I was trying to make it pretty man. But it's pretty pretty. Thank you, Mr. Pretty man. Fair. Fair with us. You're in size. All right. I'm from Bibb County, Georgia and Senator Kennedy is my Senator. Yes. And we've had many conversations about this topic and Senator Williams is one of our Bibb County Centers as well. As far as the code goes, yes, we should upgrade. But fundamentally, you cannot have a secret count. That really what gets to the heart of everything is that this software counts our ballots, accounts the vote, and it is secret. And that is not fundamentally not a democracy. That would be a third world country. That would be a corrupt government. It is a no, no one can see the count. No one can see it. And we have to be able to observe the count. And one famous communist, I think it was Stalin, but it could have been someone else said, it's not who cast a vote. It's who counts the vote. And if that's the case, then the people should be counting the vote, not those trying to get elected. And not private corporations who are invested by who knows, you know, I don't know if it's with the State Street Capitol or I can't remember, but who owns dominion, they might have different interests than the interests of the American citizen, the interests of the single mother, then the interests of the family whose children are on peach care, right? And so fundamentally, the vote count belongs to the American citizens. It belongs in the precincts to the Democrats and Republicans and Constitution Party people sitting side by side counting the vote, not to the government. And are you arguing for a software upgrade or your hardware for a hand can I am arguing that I that we must hand count. However, we can keep the machine because I do like the idea of having in it because we know people have cheated with hand counting too. We can keep not the BNDs. I'm capable of marking my own circle. Our high school students do it. We don't need to be elitist and patronize the American people anymore. They can mark their own ballot. We should keep it for those who have disabilities to help them. But otherwise, I can mark my own ballot. And we should have the machine to scan the ballot through the hand mark ballot. But at the same time, the tabulator, thank you. But at the same time, we should be hand counting at the precinct level, not centralized. Centralize is another way to cheat. And it belongs, that is why the federal government is supposed to be out of it other than making sure that people are not discriminated against. But otherwise, it belongs to the state. Right now, it's highly centralized by who programs the machines, the Secretary of State and Dominion, and our Dominion Tech and Bibb County in 2020 admitted to the poll watcher that yes, you can cheat with these machines. You would do it when you're programming them. Now, that's only one way. But that's from the Dominion Tech. Thank you for your input. So I have 20 seconds left. So anyhow, I grant you your award and second. All right. I have to do to hold more of these. Oh, that's right. I petition you to have more of these and to hear from the people because they're not telling the truth. And the BMDs, it is true. Watchers, we did have people report that their vote was flipped. They had to get a new card program. So they did not report it correctly, T. Today. Thank you for your input. We appreciate it. And I'll give Senator Kennedy your your regards. Yeah, you're giving Senator Kennedy. He is in a is in a mediation today. And that's the only reason he could not join us. Mr. Ferguson. Earl Ferguson. Come on, chair. Here with share with us your insights, Mr. Earl Ferguson. I'm a folk in County resident. We got 200 plus precincts. The only reason we need to queue our code is to identify the correct ballot. We need to get rid of the QR code. I don't trust the rest of the machines either. I want to go to paper ballots. Thank you very much. I appreciate Mr. Ferguson's been here before we recognize him. And we're down to only only two individuals. And I'll ask Mr. and Mrs. Faberito to come to the mic and jointly provide your input. And I'll grant you the four minutes. That way we're not to go through it twice. Oh, six. I want to cut it to four. All right. This is Mr. Faberito Garland and his wife. Thank you. Thank you, Mr. Chairman. Let me see if we got any frame. I want to, I press all left everybody on the commission, the committee meeting a press release from June 28 that explains why a patch will not solve this problem. If you'll patch the voting system is going to cost hundreds of millions of dollars or at least maybe one hundred tens of millions. And the room is still going to be full of people because it's not going to solve the problem. But that's not what I want to address. I'm foregoing my comments to talk about some of the false information that you got during the session. I want to talk about the internet. The system is not connected to the internet. I've heard this several times. I want to give you three. We ask that multiple times. I'm going to give you three examples of who enjoy this voting system once connected to the internet. Yep up.\n\nOne, first of all, the election preparation server in Secretary of State's office was found to be exposed to the internet. This was in 2017 by a Batsteel cybersecurity researcher who notified the Center for Elections System of that vulnerability in the CES never did close the vulnerability. And then they ended up wiping the servers without mitigating that risk just after Crowley and V. Raffinsburg who was filed in the US District Court. When they presented their information and claimed that that was normal procedure, the United States District Court said that the Secretary of State's office was, quote, flatly not credible. That's number one. Number two, we have sworn affidavits in court right now. Do you support the upgrade of the domain yourself? Well, no. So you're going to leave it the way it is? Correct. For the reason, but I've already given you the reasons why. Dr. Hall-Dumann has said that this cannot be fixed. So if I may, is the best it can be? It's at the 5.1.7 has not been proven to resolve any of the issues that Dr. Hall-Dumann's report points out. And these people do not tell you that. But let me give you two other examples. And thank you for the question. In there are sworn affidavits in court right now that show that the Dominion remotely patched a QR code rejection error in the 2021 Senate runoff race. I'm happy to give you, I can probably value one of those. Is that evidence been validated in court? It is going to be part of court proceedings. I've tested it. But it has not. I have already testified to that in California at the John Eastman's trial. And my testimony was not rebutted. And I was on the stand for three entire days. So I think you can say in the south. God bless. Okay. We're enduring it. Okay. The final example I wanted to give you is that forensic exams and other states. This is why we need to have forensic exams. They have found that the exact same Dominion election management server that we use here in Georgia. In the 5.5, when it's installed, it updates the wireless chipsets and profiles on the elections management servers that the counties used. So you've got examples of the election management server and the precinct standards being connected to the internet. And if that one precinct scanner was connected in one county, it is very likely that all the precinct standards were connected to the internet in the 2021 Senate runoff. Mrs. February, would you like to make comments to this? You've got the other 30 seconds. You put a time wrong. But I get more than 30 seconds. I'll grant you a minute to hand. All right. Well, I probably will, but yeah. So I just want to make some quotes out of Dr. Halterman's security analysis report. We've heard a lot about that. That's the one that was released in July. It was sealed into July. Yes. Yes. There's not many subsequent reports to my knowledge. Is that true? Correct. Thank you. Yes. He said that this system was developed without sufficient attention to security during design, software engineering, and testing. And it would be extremely difficult to retrofit security into the system. I think simply stated, it's broken. And the patch is not going to address the problems that he uncovered. And I know we keep hearing today that there were nine issues and this upgrade addresses those nine. Not just general abilities identified, but you are not comfortable with the fact that the upgrade addresses those vulnerabilities. Right. We're not seeing that. That's system. That's system. She's talking about Halterman. So another thing that Dr. Halterman had, he addressed testing. He stated that there's no form of testing that will ensure the security of our elections. That was when he was addressing logic and accuracy. And he detailed why. And there were a lot of different reasons why logic and accuracy testing before elections is not going to make us sure that the system is working correctly. The voting system in 2020 and coffee county, it never produced the correct results, even after they recounted three recamps. And the accounting elections director was trying to help obtain a forensic exam to try to protect her voters in that county. And then we've heard also today about the race for the DeCab District to Commission primary, the hand count proved that the system declared the wrong winner, and no other races were counted. And I think again, the DeCab issue was related to a unique situation where a candidate dropped out and there was a mis. And that could account that could have accounted for her being his her votes, Michelle's votes being given to one of her opponents, but there were 1400 votes, who was at 1800, 1800 votes, that just weren't counted at all. And that was not properly addressed in the DeCab report. So we have some issues here that I think the bottom line here is, these are reasons enough for us as voters not to trust this voting system. We're not going to trust the vendor. You've been hearing that today over and over. And we need to go to hand mark 10 counted paper ballots. I appreciate your input. Thank you. Many of us have been down this path for a while. Those of you who are new to this environment, welcome. It is a challenging and difficult issue as you are aware, as we work through it. We have to address these issues methodically. And at this point, I'll reiterate, this is our own word. I will reiterate the fact that we would like to see security marks on the ballots, visible security marks on ballots period, that seems like a straightforward thing. We would like the system, the dominion system, to be at a current level of release. We think that's important. Does it solve all the problems? Perhaps not. It does address some of the concerns. Perhaps it does. And then, and then finally, I think we are in agreement on the fact that QR codes are troublesome at best. And we need to find options to adjust that. I would say that I would hope that the voters have the same level of confidence in the voting system that I do. And I will vote. And I will vote and I would encourage you to vote. And I would, well, let me say if you have a concern, I'd encourage you to vote absentee. Absentee is a, as a ballot, is a paper ballot that is handmarked, that does not have QR codes. It is tabulated electronically. It is tabulated. However, there is nothing in Georgia code that I am aware of that would limit a community from, from hand counting those ballots and confirming the tabulation. Right now, it can't be the other way around. So you can't do a hand count and not do a tabulation. You do a tabulation. And then you can validate that if you choose with a hand count. I'm sorry. I did say that. The, my understanding of the code is that the electronic voting environment is the current standard. And that hand counting is an optional step. It's really just an audit, a full count audit of an election. So local jurisdictions can choose to do a hand count. However, they would do the hand count in addition to the tabulation, which is reported. If there is a discrepancy, just like if there was a discrepancy with a risk limiting audit, there would be an investigation and there would have to be a potential resolution to that problem. But at the end of the day, our goals and our objectives are the same. Our goals and objectives are safe and secure elections that I have confidence in and that you have confidence in. And I would, I would suggest that I recognize and accept the reality that we don't share the same level of confidence. And that I'm trying to provide options to give you the choice to vote in an manner that you have confidence in. And I'm grateful for the committee. I appreciate Senator Harbin, Senator Williams. And the others who hear I will acknowledge that. Mr. Rainy does. I'm just saying, Mr. Rainy, Bill Rainy, are you here? I just want to be on the email. All right, we'll be glad to put you there. I want to make sure that you, you had a chance to have input if you like. You may stand and take 30 seconds. Okay. I hear what you're saying and I appreciate you give us the opportunity. However, I did work that the incident hotline. I did work as a poll worker. I did work the poll watcher. Thank you. People that did call in, they were so many discrepancies. There were, there were, um, the balance that were people that formally go call in said, oh my God, I tried four different times to get this, to get this to, to flip. And it, it flipped on the wrong person and she had to go over and over. And other people said, oh my God, I didn't look at it. So there were a ton of things about the news from being on. And then, then, then, so always be elections that I work on. And I would say if you have a concern, Georgia provides you the option of voting absentee. And I would, I would remind you, I would remind you that that's a handmarked ballot without a QR code. Thank you for a wonderful afternoon. Thank you for a wonderful afternoon. Uh, dinner is at the varsity. We're all going to have chili dogs and onion right now. This is all Dutch. That's all to thank you. Meeting is adjourned for it. Thank you.",
  "updated_at": "2026-02-13T16:49:42.501329+00:00"
}