{
  "video_id": "Rhm3Zlx0cdo",
  "url": "https://www.youtube.com/watch?v=Rhm3Zlx0cdo",
  "title": "Sen. Tillery Press Conference on Eliminating State Income Tax | 07-24-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "## Overview\nSen. Tillery announced his plan to introduce legislation in the 2026 legislative session to eliminate the Georgia state income tax. He will chair a study committee to determine how to responsibly achieve this goal while protecting the state's priorities. The senator emphasized this is not a debate about whether to eliminate the tax, but rather how to do it.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Sen. Tillery stated his commitment to eliminating the Georgia state income tax during the 2026 legislative session.\n- He will chair a study committee to determine the path forward, working closely with the Lieutenant Governor.\n- The senator argued that eliminating the state income tax is about competitiveness, economic freedom, and allowing Georgians to keep more of their money.\n- He pointed to 9 states that have already eliminated their state income tax as examples Georgia can learn from.\n\n## Votes\nNone detected\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment details provided.",
  "transcript": "Well, thank you all first of all for being here today. I appreciate that.\nIn the 2026 legislative session, I will introduce legislation to take the Georgia State income tax rate to zero.\nLet me repeat that for you one time. During the Georgia 2026 legislative session, I will introduce legislation to take Georgia's income tax rate to zero.\nThis may not happen overnight, but I'm committed to delivering on this goal in a way that protects\nour state's core priorities, health care, education, infrastructure and public safety.\nMy mission is simple, eliminate Georgia's income tax and its entirety.\nAnd over the next several months, I will chair study committees, work closely with my\ncolleagues, and of course consult with Lieutenant Governor Bert Jones to chart a realistic\nand responsible path to eliminate Georgia's income tax.\nLet me be clear, my role as chair is not to debate whether we do\naway with the state income tax, it's to determine how we will do\naway with the state income tax.\nGeorgia's state income tax was started roughly 80 years ago\nduring the Great Depression, and for a large part of that time,\nit remained at 6% largely unquestioned.\nIt's only been in the past decade under Republican leadership\nthat we've seen that percentage rate finally begin to trickle down.\nAnd while that's progress, it's just a start.\nBecause we don't operate in a vacuum, you see our neighboring states like North Carolina\nand South Carolina are quickly working to reduce their state income tax.\nAnd nine states in our nation have already completely done away with theirs.\nAnd these aren't just red states and they're not just blue states.\nYou've got Wyoming, Washington, New Hampshire, Texas, Tennessee, and of course Florida.\nAnd when folks mention Florida, the first thing they do is say, well, that's because of\ntourism, but tourism doesn't explain how Tennessee did it.\nAnd it doesn't explain how New Hampshire did it.\nAnd while some credits will warn you that doing away with the state income tax will be catastrophic,\nI want to point out that all those states that have already done away with the state income\ntax, none of them are clamoring to create one.\nYou see, this is about competitiveness.\nIt's about economic freedom.\nAnd above all, it's about allowing hardworking Georgians to keep their money in their pockets.\nIt's about you keeping your money in your pockets.\nI believe Georgia can get this done.\nAnd I'm not gonna stop until we do.\nAnd I'm happy to take any of your questions.\nSome of the things you mentioned\nthat I'll test it all so that I have a higher self-experts\nthat I can have in the hard work,\nwho is the one back of the other.\nYeah, I think that if you are moving from one text\nto another, which again, I'm not gonna set that\nas the premise yet of, that's what we're gonna do.\nBut if you are, you're obviously gonna be looking\nthat are you widening or broadening your tax base?\nIf you're bringing more people through,\nlike those who are traveling from Tennessee to Florida,\nand they're helping pay Georgia's former state income tax,\nI think that's a win for Georgians.\nWell, if you do away with one stream,\nyou're making it less diverse,\nbut you're not doing away with all streams.\nIf you had nine streams to begin with and now you've moved to eight, we'll have to ask\nthe credit agencies how they feel about diversity that remains.\nBut again, I can't accept that as the premise when we still are in the process of developing\nhow we will get this done.\nYeah, a little awful in that number, it's $16.2 billion in revenue if you look at our\nnumbers.\nYou also look at our sales tax numbers.\nIt brings in $9 billion, right?\n4% brings in nine.\nYou could be looking at those items,\nbut I think we're premature to jump out\nand talk about that yet.\nRemember, we've got a study committee that's set up.\nWe have a lieutenant governor\nwho's brought his ideas to the table.\nSo I think it would be a little unfair\nfor me to prejudice the committee\nby telling you what the chair thinks that we should do\nbefore we hear from the other members\nof the committee to do that.\nMy thoughts on this process are well known.\nI'm not new to the idea of doing away\nwith the state income tax when I was chairman of the county commission we reduced property\ntaxes every year I was there.\nThis is my positions are well documented and you don't have to look too far in the records\nof your different articles to see this.\nI don't think that 2026 is necessarily the year that you finalize it as I said I don't\nthink this happens overnight.\nMy goal would be that we move in this direction.\nYou've seen us move in this direction over the past three years.\nI think that this is the year that we show that we are going to go to zero.\nIt's not a debate anymore about if we go to zero.\nThe question now is how we go to zero.\nI think some people will make that argument, but I would go to those families who were\npaying that state income tax and ask them if they could would be happy with a 5% increase\nin just keeping their own money.\nWe could literally give them a 5% pay increase by simply allowing them to keep the money\nthey've already earned.\nYeah, I think the committee, the committee's work will start immediately.\nThere are provisions of Senate rules that don't require it to go away.\nOn December 15th, we set a deadline for the reasons that I think most businesses set\ndeadlines.\nYou know, you got a date to get something done by.\nNow, I am glad for that deadline.\nI know that there is an extension.\nI don't want to have to hit it.\nWell, clearly, we would want to hear\nfrom the nine states that have already done this.\nThey're not clamoring to create one.\nSo they've done this in a way that was able to be\nfruitful for their citizens.\nWe want to study their ideas.\nThere are national brands that are tackling the same issue.\nThis is not something that's even,\nthis just Georgia centric,\nor even just southeastern centric.\nI think it's a national odd movement,\nand it's one that we'll be able to tap into.\nSo there's not seats on the bed.\nFor the probability that we'll go all the time soon,\nbeing on sale today for the taxes to fall in the lower,\nbut the lower percent of the units\nI think that if you're dealing with nine states, 20% of all the states in the nation that\nyou're going to have some on the high side and some on the low side, I don't think that\nyou're going to see, look at a state like South Dakota, I don't think anyone's saying\nthat their cost of living or their taxes overall are high and they've done away with their\nstate income tax.\nNow, New Hampshire, Washington State, probably on the opposite ends, not sure we're going\nI don't want to copy their ideas, but we have plenty of ideas to choose from.\nI do think again that it's way premature for me to prejudice the committee about saying\nthe ideas that the chair thinks he supports.\nYou know those very clearly already.\nI believe that we can handle this through things that you've already reported.\nthe members of the committee there on the committee for a reason to bring their ideas\nand clearly also we want to hear from the lieutenant governor his ideas as he's obviously\nmade this a major part of his policy platform.\nI think Georgia can lay out a plan to be at zero in 2026, a plan that we will reach zero.\nIt does not mean that the state income tax is zero in 2026, but the plan to reach zero\nI believe can be finalized in 2026.\nIs anything else? Thank you. I appreciate y'all a lot. Have a good one.\n",
  "updated_at": "2026-02-12T18:44:29.549502+00:00"
}