{
  "video_id": "RJz66Cemlrc",
  "url": "https://youtu.be/RJz66Cemlrc?t=822",
  "title": "Georgia House - Day 12 (2026-01-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 12,
  "video_date": "2026-01-30",
  "duration_minutes": 102,
  "summary": "Overview:\nThe Georgia House of Representatives held a somber session to honor the life and legacy of Chairman Richard Smith, a highly respected and long-serving legislator who recently passed away. The session featured heartfelt tributes and reflections from lawmakers, as well as the attendance of Governor Brian Kemp, who spoke fondly of his friend and colleague.\n\nKey Actions:\nNo significant legislation was passed or referred during this session.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Lawmakers shared personal anecdotes and memories of Chairman Smith, highlighting his integrity, compassion, and dedication to public service.\n- Governor Kemp delivered a moving tribute, praising Smith's character, loyalty, and positive impact on the state of Georgia.\n- The House held a moment of silence to honor Chairman Smith's memory.\n\nVotes:\nNo recorded votes were taken.\n\nAttendance:\nThe session maintained a quorum, with lawmakers present to honor their late colleague.\n\nAdjournment:\nThe House adjourned after the tributes and moment of silence, with the next session date unspecified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you You you you you what he wanted to do here on this earth every day was also prepared to move on when his time came. Good Lord knows when that is and it was Richard's time last night this morning. We're certainly going to miss that gentleman his father, the Shannon Ashley Justin and of course the pride of his life, his grandchildren but that person who's been by his side that he's cared for and cared for him Clara. Clara we love you we love all of y'all we love your family. We will miss Richard Smith his community that he loves so dearly Columbus his neighbors will miss Richard Smith and I certainly will miss Richard Smith because I know that we all will. Chairman of rules, pretty important position in this house you never had to wonder what you stood with Richard Smith did you it's pretty clear. I'm gonna tell you when he told you I got you back you could continue to look forward because you're not worried about your back it's the kind of man he was it's kind of personally was many ways to me larger than life now if you've done what I've done all my life and involved in agriculture you learned very soon that you loved and trusted and worked with your county agent so when I first met Richard Smith 20 years 20 plus years ago I knew he was a county agent I knew he was my kind of guy I also knew that he was one of those things I think which sometimes in life I know I have I become more like my parents in some ways and I'll say this again for finish my daddy didn't say someone was a good man about very many people and I'll tell you I'm the same way but in every every sense of the word Richard Smith was a good good man and he was a friend and however you want to describe that word would be an honest with you telling you know sometimes but encouraging you to do better and be better and do better for your neighbors that was Richard Smith as we all strive to be statesmen stateswomen Richard was a great example have you do just that counselor to us those in the hall that came to see he was always honest but he was a compassionate person about his honesty because his honesty was always based on what his vision was and what our vision will be there's been shaped by our presence and his lies about our future for this state and we came to this house 20 years ago a couple of us have still here Charlize was in that connect crowd David Knight Mike Chokus Sheila Jones head satchelor and of course another former member who's back here servicing with us with us Terry England our bond grew from those years good times bad times great joy great disappointment as we lost other members that we've all been close to over the last few years makes me think about who I want to be friends with how many friends I want to have but I can tell y'all this family these friends in this house is worth the sorrow sometimes a great great remembrances we have of good times and people's service to their neighbors as he's simplified by Richard Smith I want to be more liking today we'll be tough for all of us and the days that come will be difficult times for Clara and the family I know as mine I know yours will the prayers will be offered up to a loving God thanking him for allowing Richard Smith to be a part of our lives I was with him last week and I'll say this the command came we're doing something for Columbus I need you there I'll tell you what I was there when Richard spoke I listened because I knew what it was about it was about his community and our state it was a great meeting great announcements the Richard was awfully proud of Columbus he'd worked there many years Caroline I remind you this then I won't have a special guest this house that come forward but I'll remind you all of this a story seldom told is soon forgotten I know y'all will all join with me telling the story the remembrances of Richard Smith the good times let's don't forget a good man don't forget a man who contributed to the well-being of his neighbors and to Georgia with that a special friend of chairman Smith happens to be the governor of this state governor Brian Kemp first lady we appreciate your relationship with the Smith family with chairman Smith governor Kemp I know Richard Smith thought the world of you he was a great support of yours and he believed in you and your vision for Georgia if you would if you would come up we would love to have you remember Richard Smith governor Brian Kemp well thank you mr. Speaker it is a sad but honorable day to be in this chamber I want to thank you for the opportunity to address the body on such a somber day I had my staff reach out and just tell them to see if there's any way I could just be in the chamber for a moment of silence for the chairman not to speak or anything else but just to pass along my condolences I felt called to do that and the speaker called me and said Richard Smith would want you to say something and so that is what I will do as you all know this has been a difficult week for our state we have lost some of our very finest as we continue to mourn trooper Jimmy Cindercar our brave Americans and we lost in a drone attack in Jordan Jordan Sergeant William rivers of Carrollton specialist Kennedy Sanders of Wakecross especially Brianna Mothett from Savannah and now our value friend and colleague and a great leader in chairman Richard Smith on behalf of a grateful Georgia we appreciate their service to our state and nation ours reflecting on Richard Smith he has been my friend and my colleague for 20 years and as the speaker said when he was your friend you knew it there were times when he was standing with me when others were not but I didn't bother him he just did what he thought was right and I know he did the same thing serving as committee chairman and as the rules chairman what you all know is a very tough job that he was a great legislator but as the speaker said he was also a good man and a good friend a good husband a good father and a good grandfather I know Marty and I had the opportunity to go down and help Richard with in the van and Columbus and got to spend some time with him and Claire and it was just you know you can tell the guy was well loved there were people that are out in the halls and now they drove down there to be at that event there was people in the local community and you can tell it wasn't that just they had to be there they wanted to be there because they appreciated his friendship they appreciated his service how he handled himself his loyalty and they knew he was making our state better he did that for a long time and his legacy will continue to do that in the future while talking to Marty downstairs and as tough as this day is and the rest of the session will be without his leadership and the rules committee and sitting in that chair he would want us to continue our work speaker on behalf of this great state and in his memory that's exactly what we will do thank you all God bless you thank you governor camp first lady we know you both care deeply for Richard thank you for being his friends and standing with him governor's right we talked about it this morning what's next you get on with the business of this day that's what Richard Smith wanted to do that's what he's encouraging us to do right now as he looks down with us his friends in this body he knew you all he cared for you all he appreciated you all and out there say he loved us all we will miss him but we will remember him he will be a part of us he will be a part of me he will continue to influence my service to the people of this state the people I represent as I hold him up as an example to myself and hope to you all how Richard cared for us all and the people you represented and the people of this state if you will join me in a moment of silence and then we'll get on with the business of the day thank you God for allowing us to walk with a good man\n\nRichard Smith. We know he's there with you now. Bless his family, Lord. He loved them dearly. Remember the good times. And don't be afraid to celebrate those good times and remember those good times. His legacy of service, his legacy of love will last forever. Thank you, God. Amen. Thank you, members. Thank you, Governor. Thank you, members, for allowing us and myself to the part of the day. From the regular order of business for the day. So, members, the hour of convening having arrived. All members will please take seats. Mr. Clerk, I could see Richard smiling right now from right over there to me when you ring that bell. So ring that bell, Mr. Clerk. We're going to have the morning roll call. All members present will vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? Come. office as the Have all members voted? All members voted if so, the clerk will lock the machines. Doorkeepers, will you please close the doors and keep them closed? Because this is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 121st House District. The representative Marcus Wiedhauer. Colleagues, I come before you this morning heavy-hearted, but I do have the distinct honor to introduce my friend, Joel Shimpo. Joel graduated from the University of Georgia before attending Liberty University, where he earned his masters in religion and masters in divinity. He began his career at first Baptist Snellville and then spent nearly 16 years at Watkinsville Baptist Church. But recently God called on him to reach out to a new community and last year announced the launch in just this month, launch five points church where he is the lead pastor. As I prepared for today, I decided to check out the five points church website. I clicked through various topics, topics covered on the page, and I came to one that said family. Knowing the history of their family, I was immediately curious. The first line read, God has ordained the family as the foundational institution of human society. It is composed of persons related to one another by marriage, blood, or adoption. See Joel and his wife Jennifer live this statement. Together they have been a force for foster care reform and support. They have fostered and adopted two of their five children from the foster care system. My personal passion for foster care is ignited by Joel and Jennifer. I will be forever grateful for their godly love of these children and their spiritual leadership Joel has brought our community. Please welcome Joel Shimpo, my friend lead pastor, five points church. It is my honor to be here with you today. My condolences to members of the house. The Psalm 34 says that the Lord is near to the broken hearted and saves those who were crushed in spirit. So be assured that the Lord is near you today. On this difficult day, I would like to take you back to a difficult day that I had in my life eight years ago. It seemed like it was an ordinary Saturday. Well, in the sense of ordinary for our family, at that time we had a pretty chaotic ordinary, a household of four children aged four and under. Yeah, you heard that right. Four children aged four and under. And life was loud and crazy at our house. But otherwise that day was ordinary. My wife was overdue for a break from the house. She left that morning for a therapy. I mean a hair appointment. No worries, my love. I assured her confident in my ability to manage all four children who constantly were on the move and constantly looking for food. She left that morning. There's five of us there in the living room. I found a little respite on the couch just to be disrupted by our little one-year-old redhead Caroline who delighted and crawling all over me whenever I did find comfort. And a spot to rest. Then in a second, everything changed. Little Caroline convulsed, fell silent. Her breath ceased and her skin turned alarming shade of blue. I scooped her up into my arms. I was frantic to discern the cause while at the same time instructing our four-year-old to urgently seek help from our neighbor while I dialed 911. Paramedics arrived with astonishing swiftness. And as they walked in, Caroline still laid in my arms completely lifeless. They started work immediately and soon we were in route to the hospital. That day upended our life for a while. But it has a happy ending. Sweet Caroline survived thanks to the skilled intervention of the medical professionals and astute diagnosis. And a critical blood transfusion. Today she's an incredible, vivacious, beautiful, nine-year-old and I think God that he protected her. But there's one part of the narrative that I left out and you might have been clued into already with the introduction. At that time, Caroline was not my child. Caroline had been placed in our home as a child and foster care. And what this traumatic event brought out for me was just how much I loved this little girl. It did not matter that she was not my child. I loved her. And in those moments of her sickness, those harrowing days, I knew in my soul I would do anything to protect her and take care of her. And I was able to improve, became well again, and a few years later, in a moment of both grief and a menstrual as adoptive parents know, Caroline became a permanent member of our Shimpo household. And I'm now the proud daddy of this beautiful girl. I share this story this morning, not to convey just the love that I have for my children, not just the love I have for my daughter, this daughter who was not my daughter at that time. But I share this story to point you to an even greater love, a love by a heavenly father. It was this experience and all the moments that led to the adoption that helped me grasp just how much the creator God loves us. In Galatians 4, we read these words, when the fullness of time had come, God sent forth His Son, born of a woman, born under the law, to redeem those who were under the law, so that we might receive adoption as sons. And because you are sons, God has sent the spirit of His Son into our hearts, crying, oba father, so you are no longer a slave by the Son. And if a son, then you are an heir with God. As an adoptive parent, those words resonate deeply. With five children now, two of which are adopted, including Caroline, the love I feel for them is immeasurable. Yet as a parent, and as an adoptive parent, I understand the significant cost, both financial, emotional, physical, involved in bringing children into our family. And reflecting on those sacrifices, I recognize that God sacrificed to welcome us into His family, far surpasses any sacrifice we've ever made. For God to welcome us into His family, it meant the death of His Son. His love was so great and so boundless that He sent His Son to endure the punishment we deserve for the sins that we had committed, offer the sake to bring us into His family. To make us sons and daughters. You too can become a part of God's family, a cherished child through belief, and I sincerely hope you will, because there's nothing more profound than knowing the love of a heavenly father. Let us bow our heads in prayer. Gracious Heavenly Father, it's in moments like these today that we understand that life is very short. And the difference between a moment here and a moment there is quite significant more than we could imagine. And so we call on you, the Creator of all things, to help us, and to speak to us, and for us to truly know you. I thank you for this opportunity to share of your love this morning, and I pray all these in this chamber would know your love. And especially, would fill your comfort today and your nearness. We thank you Jesus for bringing us into your family for those who believe. And it's in your name we pray these things. Amen. And by you to join me in the Pledge of Allegiance. I pledge allegiance to the flag of the United States of America, and to the Republic of what you stand, one nation is under the number of individuals who are the labor of justice for all. You can just come right here just for a moment. Brother Sam, thank you for that message. Good luck with that new church. And Jennifer, thank you for what you, the care that you have for the children of our staff, and for your own children. And we appreciate both of you what you did, what you're doing, and what you've done. And we look forward to work with you on foster care. Doorkeepers, you can unlock the doors, members. You can meet the chaplain in the south any room and have a photo and greet them and welcome them to the house. You members, our doctor of the day is brought to us upon the request of Representative Roger Bruce. Our doctor of the day is Dr. Cassandra Barnett Donnelly. You can find her down in the aid station if you so need, but we appreciate her being here and providing this great service to the members. Members, here is our posture. I'll go ahead and let you know this. If you have your attention, we will proceed with the regular business of this day. We've had discussion with those who wanted to present morning orders. They will be put off until tomorrow. We're going to have a special time for the Columbus delegation to come up doing morning orders time. We'll take up a couple of bills and then we'll postpone several of them until tomorrow. That'll be the order of our business for the day. So I appreciate you working with us and understanding as we all deal with the loss of Chairman Smith. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information and Odits. Chairman Tarvan. Mr. Speaker, your Committee on Information and Odits has read the journal from the previous legislative day and found it to be correct. Mr. Speaker, if you'll indulge me, I will say as I said at home last night and heard the news of the weekend, the off for killing the 1080, then the Department of Defense comes out that we had lost three Georgians. And this morning is especially tragic, saddening day for me. I'm going to continue with what I had planned. Our flag does not fly because of the wind that lifts it. It flies with the last breath of each soldier who died protecting it. Amen, Mr. Chairman, so true. So true. We'll recognize that even more tomorrow is wind bites and special guests to this chamber. We owe a deep debt of gratitude to those who protect us. Chairman Tarvan, the Chair of the Committee on Information and Odits, reports that the journal of the previous legislative day has been read and found to be correct, is there an objection to dispense with the reading of the journal? The Chair here is done. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? The Chair here is done and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Representative, the registration of 104th Moose Fount壁 establishes the order of business under first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The Chair here is done and the resolution is adopted. Mr. Clerk, first reading the bills and resolutions, the clerk will read. The Chair here is done and the resolution is adopted. The Chair here is done and the resolution is adopted. The Chair here is done and the resolution is adopted. The Chair here is done and the resolution is adopted. Judiciary. House Bill 1060 by Residence. Scott of the 76th, Gofield of the 63rd, Davis of the 87th. Bill B. Todd will enact a comprehensive revise. Elections in voting by repealing act number 9. Governmental affairs. House Bill 1061 by Representative Lomston of the 12th. Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. Intergovernmental coordination. House Bill 1062 by Residence. Lomston to the 12th. Bill B. Todd will enact an authorize the governing authority. It should do good county to Levy and next size tax. Intergovernmental coordination. House Bill 1063 by Residence. Gofield of the 63rd, Scott of the 76th, Davis of the 87th. Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. Intergovernmental coordination. House Bill 1064 by Residence. Gofield of the 63rd, Scott of the 76th, Davis of the 87th. Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. Intergovernmental coordination. House Bill 1065 by Residence. Gofield of the 63rd, Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. Intergovernmental coordination. Public and community health. House Bill 1066 by Residence. Gofield of the 63rd, Beverly, the 143rd, Scott of the 76th and Davis of the 87th. Bill B. Todd will enact an authorize the governing authority of the city of Somerville to Levy and next size tax. House Bill 1067 by Residence. Gofield of the 63rd, Bill B. Todd will enact an authorize the governing authority of the town of Trion to Levy and next size tax. Intergovernmental coordination. House Bill 1068 by Residence. Gofield of the 31st, Gaines of the 120th, or one of the 32nd, and 1st, or the 119th, Bill B. Todd will enact a men-and-act providing homestead exemption from the city of Jefferson Independence School District advolorum taxes. Intergovernmental coordination. House Bill 1069 by Residence. Can in the 172nd, Perkville, 169th, Corporate of the 174th. Roads of the 124th, Williams of the 148th. Bill B. Todd will enact a men-go-section, 485, 7.5th, the Eviscola, Georgia, and annotator relaying an assessment of standing timber. Ways and means. House Bill 1070 by Residence. Sharper, the 177th, Bill B. Todd will enact a men-arlicable in the 1st, Title 40. Roads of the Eviscola, Georgia, and annotator relaying the general provisions relative identification and regulation of motor vehicles. Public safety and homeland security. House Bill 1071 by Residence. Chokus, the 151st, Bill B. Todd will enact a provide that the judges of the Pro Bay Court of Terrell County shall also serve as the Chief Magistrate Judge of the Magistrate Court of Terrell County. Intergovernmental coordination. House Bill 1072 by Residence. Cooper, the 45th, Newton, the 127th, Perkville, 158, Jackson, the 128th. Stevens, the 164th, and others. Bill B. Todd will enact a men-article 10-a-chapter, 8-a-tittle, 31 of the Eviscola, Georgia, and annotator relaying the Georgia Repository Program. Hilt. House Bill 1073 by Residence. Washburn, 144th, Cooper, the 45th, Oliver, the 82nd, Work Heids, the 157th, Evans, the 89th, and others. Bill B. Todd will enact a men-code section 36, 66, 4. Bill B. Todd will enact a men-code section 36, 66, 4. Bill B. Todd will enact a men-article 10-a-chapter, 8-a-tittle, 31 of the Eviscola, Georgia, and annotator relaying the hearings on proposed zoning decisions. Governor Minal Affairs. House Bill 1074 by Residence. General of the 25th Barrett of the 24th Cox, the 28th McDonald, the 26th, Clark of the 100th and others. Bill B. Todd will enact a men-the-four-south county civil service system act creating the four-south county civil service system. Andrew Governmental Coordination. House Bill 1075 by Residence. Hilt with 48th, gull out of the 19th, person, other, the 119th, and new, the 64th. Bill B. Todd will enact a men-article 1 on Chapter 17. Todd with 45, the fish go to Georgia, annotator relaying the general provisions regarding notaries public. Judiciary. House Bill 1076 by Residence. Way to the 9th, Perkle, the 169th bottle, the 73rd. Carper to the 4th, Fry, the 120th, and others. Bill B. Todd will enact a men-subpart 1 on Part 4 of Article 2, Chapter 2, the title 8 of the fish go to Georgia, annotated. Relating the general provisions for manufactured or mobile homes. Thanks and thank you. House Bill 1077 by Residence. Cooper to the 48th, Newton to the 127th, Hawkins to the 27th, Silcox to the 53rd, and Perish to the 158th. Bill B. Todd will enact a men-the-10, the title 49 of the fish go to Georgia, annotated relating the Georgia Board of Health Care Workforce. Public and Community Hilt. House Resolution 919 by Residence. Green to the 154th. Resolution recognized Mr. Charlie Curry Senior in dedicating a bridge in his memory. Transportation. House Resolution 937 by Residence. I have leveried to the 123rd, Apollo 33rd, Irwin to the 32nd, gains to the 120th, and Don Who the 31st. Resolution to dedicating the Georgia-grown trail. Transportation. Senate Bill 337 by Senator Krapattrick of 32nd, Alvers to the 56th, Kennedy the 18th, Cows to the 46th, Hickman to the 4th, Ability to the NAC to a men-code section 382, 111 of the fish go to Georgia, annotated relating the personal AIDS decad. Special rules. Senate Bill 342 by Senators. Robertson to the 29th, Krapattrick to the 32nd, Jones to the 22nd, Alvers to the 56th, brass to the 28th. Bill B. Todd on NAC to a men-article 2, chapter 5, and Title 49 of the fish go to Georgia, annotated relating the child abuse records. Governor Justice. Senate Bill 353 by Senator Donald Zell of the 27th, and Dixon to the 48th. Forty-fifth, Bill B. Todd on NAC to amend, Title 32 of the fish go to Georgia, annotated relating the highways, bridges and ferries. Transportation. Senate Bill 354 by Senator Walker of the 20th, Strickland of the 17th, and in a barcade of the 31st, Krapattrick of the 32nd, Jackson to the 41st and others. Bill B. Todd on NAC to amend, chapter 10 of the Title 43, the fish go to Georgia, annotated relating to cosmologists and barbers. Regulated industries. That completes First Readers. Second Readers, bills and resolutions, the clerk will read. House Bill 1049 by Representative Williamson of the 112th Thumbs, and of the 12th Taylor of the 173rd Park, Kaiser of the 157th, the Bill relating to Assumption and Reassurance Agreements. House Bill 1050 by Representative Matthew K. of the 74th, Hawkins of the 27th, the screen of the 154th, Powell of the 33rd Hutchinson of the 160th, and others, the Bill relating to licensing, provisions relative to professional counselors, social workers, marriage and family therapists, House Bill 1051 by Representative Brinnell of the 77th, Schofield of the 63rd, Jackson of the 68th, Evans of the 57th Scott of the 76th, the Bill relating to foreclosure on mortgages. House Bill 1052 by Representative Cannon of the 122nd, Dickey of the 145th, Huddleton of the 72nd McCollum of the 30th, Meeks of the 178th and others, the Bill relating to bonafide conservation, use property, residential transitional property, application procedures penalties for breach of covenant, classification on tax digest and annual report. House Bill 1053 by Representative Barrett of the 24th Williams of the 148th, Persinger of the 119th, Clark of the 100th, Cali of the 16th and others, the Bill relating to state government, House Bill 1054 by Representative Neal of the 79th Hitchens of the 161st, fans of the 133rd, Hulkham of the 81st Reaves of the 99th, the Bill relating to signature on citations required effective failures, assigned exemption of average state drivers, electronic capture of signature. House Bill 1055 by Reps of Neal of the 79th Taylor of the 173rd Stoner of the 40th, Leopard of the 123rd, a Bill relating to demand for possession procedure upon attendance refusal and concurrent issuance of federal lease termination notice. House Resolution 918 by Reps of the 149th, Chaspers of the 11th, Perk, Old 169th, Bomb Town of the 17th, Colled of the 19th and others, the Resolution designated golden aisle, Greenway as an official corridor in Georgia. The Bill 355 by Senator Robertson of the 29th, Burns of the 23rd, Williams of the 25th and Advarity of the 31st, dollars all of the 27th, Bill relating to general provisions regarding elections and primaries, Senate Bill 358 by Senator Burns of the 23rd, Guged to the 51st, Robertson of the 29th, dollars all of the 27th and Advarity of the 31st and others, they bill relating to the state election board, Senate Resolution 158 by Senator and Advarity of the 31st, Doug and of the 30th, the brass of the 28th, more of the 53rd, Huffstead, Ler, the 50th, Hucket and others. Resolution designated the Northwest, Georgia, Logistics, corridor as an official logistics, Growth, corridor in Georgia, 3-second readers. Thank you, Clerk. Reports of standing committees, Mr. Clerk, we'll read. Representative Hawkins of the 27th District Chairman of the Committee on Health submitted the following report. In respect of your Committee on Health, as editor, it's consideration following bills of the House, and it's instructive media reports saying back to the House of Fine Recommendations, House Bill 576, Deutepass, House Bill 809, Deutepass, House Bill 874, Deutepass by Committee Substitute, respectfully submitted, Representative Hawkins of the 27th District Chairman. Representative John Corbett of the 174th District Chairman of the Committee on Motor Vehicles submitted the following report. And to speak to your Committee on Motor Vehicles, as Adonmer, it's consideration following bills of the House, and it's instructive media reports saying back to the House of the Fine Recommendations, House Bill 907, Deutepass by Committee Substitute, House Bill 959, Deutepass, respectfully submitted, Representative John Corbett of the 174th District Chairman. I can please the reading of the report's outstanding committees.\n\nMembers will please take your seats. If you're in the any room, we have a special morning order. We're moving on to morning orders. Members will please take your seats. I'm going to recognize the Columbus delegation here in just a moment. Members will please come into the chamber and take your seats. And those over in the end of the chamber, if you will, take your seats and cease any and all unnecessary conversation. The Columbus delegation is recognized for a morning order. And Higgly, Representative Reese, Representative Smith, and Representative Buckner. Members, if you'll come into the chamber, spend just for a moment, members. Members, if you would join me in standing, Representative Vance Smith is recognized to begin this morning order. Thank you, Mr. Speaker. What a great guy. I appreciate everything you said and your article this morning, Mr. Speaker. Appreciate the governor. Appreciate my family members here. We had a great delegation. All I can think about is, well, I think it's rich. Some of y'all have heard me say this. Spread the good news of the gospel. And sometimes you just word. He lived it. He was truly blessed by his family. He'll be missed by our family, by this family. A great George and a quarter tremendous loss for all of us. But I appreciate y'all and he appreciated y'all too. You know we all have own personalities and Richard had his. But you just had to step past that because, oh, what a big heart he had. And he loved his community. He loved his state of Georgia. And you better go tell him something good because if not, he was going in a trash. But that's what made this state even better, y'all. Thank you each and every one of you. I'll love you. Thank you, Mr. Speaker. My colleagues in the house, Columbus has lost a giant of a man in the loss of Richard Smith. We were all satan and heartbroken to hear of his passing. But when I think of Richard, I think about the fact that a friend never really dies. As long as you keep their memory alive. I want you to know that our delegation is going to continue and work in the honor and the manner that Richard has set out for us. He will always be remembered by the citizens of Columbus because not only was he a county agent, but when called on to serve, he stepped in to be our city manager. And then when called on to serve, he came to this capital to represent the citizens of Columbus as a state representative. So he always kept the citizens of Columbus before him. And lastly, I'm going to just share what my dad says. My dad says you can judge a man by the way he treats his family. And by that measurement, Richard was a giant because he loved his wife, he loved his family, he loved his community, and he loved all of us as his family as well. Well, I asked a young one of the group here, newest member to this delegation. I was kind of rough this morning. This is my second session of my first term. And unfortunately in both sessions, I have experienced the death of a colleague. Richard was very close to me. Richard was the type I could always go bend a knee by his desk and ask him a question. He would be patient. He would work with me. And even one time he told me, one man, you're a young man, you're learning pretty fast. So I said, here to serve the people of Columbus. When we used the word delegation in Columbus, we sincerely mean it. We're truly fighting together for the people of Southwest Jordan and Columbus, Georgia. That was important to him and it's important to all of us. This past Friday, as many of you know, that Hearst Ambulance Tag Beal came through. And I asked the gentleman representative C. Barby would yield for a question. And my question was in regards to how did he get that tag deal through rules. Mr. Speaker, you and I both was looking for that answer, but apparently representative Misha Mayner received that answer. She shared it with me this morning. And she said, Richard leaned over to her and said, well, that be all God do because if I gotta go out in the ambulance, I don't want it to say Hearst. But when I do have to go out in the Hearst, I wanted to mean that. My friend went out and styled. We need to make sure even if we manufacture tag, that tag needs to only say Hearst for him. We need to make sure that happens. I want to wrap up with a quick quote from the gentleman I had the representative, the pleasure of replacing and currently services representative, that's representative Calvin Smirie. He said, this time words can't adequately express my pain and sadness this morning when I learned of the passing of my dear friend, Chairman, Richard Smith. He was a steady hand and trusted colleague for me over many years. We shared a great friendship. My prayers and thoughts are with Claire and the entire Smith family. He will be dearly missed in the Columbus community, the General Assembly and the State of Georgia. Representative Smirie, I echo those words. Thank you. We've already said that Richard served as a county extension agent in Columbus. Richard and I had a relationship where we teased each other, sometimes unmercifully, but I would tease him about being a urban or city county agent. And did that mean he wasn't good enough to be one in the counties or the country? And so he got me back because for years we sat next to each other, what was known as the Columbus Road for many years. And we were at home in a town forum and he said, you know, I have to sit by her. And I try real hard to keep her straight, but it's just impossible. And as the years have gone on, he's moved up into bigger and better and higher ranking chairs. But he continued to tease and he continued to be a friend and he was a huge advocate for Columbus and taking care of it. He was my mom and dad's city councilman. He was my mom and dad's state representative. And when he rode by their house and there were too many cars in the driveway, he would call and he'd say, you mom and dad are right. He could act gruff and almost scary at times to prove a point, to share his feelings, but underneath, he was a really good man. His family at home needs our thoughts and prayers. But he also thought of all of us as family too. And he would want us to be prayerfully, remembering each other. Not just for his loss, but how to move forward and carry a piece of him with him to keep doing good. And he'd want us to remember people like Pamela Lewis in his office and all of the staff that he works with. Because he was not someone that forgot what a lot of people refer to as the little people. He was good at remembering everybody. I'll miss him picking on me. I'll miss him for lots of reasons. But I am so grateful that he's been in my life. And I am so grateful that Georgia had him as a representative and as a rules chair and as a friend. Thank you, Mr. Speaker. We yield well. Thank you, Columbus delegation. Y'all worked very well together. And that fifth member of the delegation will be sorely missed by Saul. But not forgotten. Thank you members. As Chairman Smith would have wanted us to do, we'll move on with our business of the day. And we had a very special invite resolution that was going to be presented today. And it will be presented today. So if Florida Wade will come up and bring your guests with you, we will ask the clerk in just a moment. Ladies. Trophy. Members of your give. I will guess your attention. I will ask the clerk to read the caption to a resolution. House resolution 892 by Rosewood of Wade and the ninth dupe nick of the 29th Cox, the 28th, bear to the 24th, McDonald, 26th and others. A resolution. Congratulations, a University of Georgia women's softball team for winning the 2023 NCAA championship. Mr. Clerk, just clarity, when you read the university, what did you say? University of North Georgia women's softball team. I just wanted to make sure there's a little bit of difference there. One's much better institution than another, right? I already got it. So with that, thank you, Mr. Clerk. Then we will recognize representative, we'll wait to speak to the resolution. Thank you, sir. Thank you, speaker and thank you, colleagues. And on this somber day, I can't help but think of our friend, Richard Smith. If I came up with one word to describe him, I would actually describe him as a person that's just excellence. And what better way to showcase excellence than when folks in this state achieve a great feat of excellence. And that is what my alma mater University of North Georgia brings, and that's excellence to the state. And this team that is here today, we have three of the seniors that have gone on to graduate that are here today. And I'm excited that you'll get to hear briefly from the president and I believe one of the players is going to speak briefly. But this is an awesome opportunity to showcase that the University of North Georgia brought home the Division 2 national championship for college fast pitch softball. And these are amazing students, amazing athletes, and they're all gainfully employed, providing for their communities and carrying on the excellence that is being a University of North Georgia graduate. I'm honored to be here and welcome President Shannon to briefly. Thank you, sir. Good morning, ladies and gentlemen. I bring you greetings from our nearly 18,000 students. Today walking towards their purpose on one of our five campuses in DeLonica, Gainesville, Cumming, Acone, and Blue Ridge. And today's a celebration of leadership. At first, we want to thank this body and all of you for creating the conditions for the greatest state in America, where we can attract young women like these to North Georgia to beat world champions. And leadership is sacrifice. Leadership is about dedication to one another. And leadership is about not only being national champions in sports, but in life. Ladies and gentlemen, this is what college athletics is all about. And these three ladies embody that. They just graduated and they are leaders. This is Hannah that you're going to hear from in a second who is working at Kennestown Hospital in preparation to be a physical therapist. This is Liv who is a fifth grade middle school teacher in Fulton County. And this is Maddie who is in the healthcare profession recruiting in the HR field. Ladies and gentlemen, this is what college athletics is all about. These ladies are your ladies. These are ladies in your communities that are serving you. So with that, I want you to hear from one. Hannah, you drew the short straw. You get to be the speaker. Come and share about your experience. Firstly, thank you so much for allowing us and honoring us. This is an honor we know to be on this floor. So we thank you for that. We are proud UNG students and we're also proud Georgia residents. Liv is actually from Alabama, but she is not teaching here. So we got her. But we are for a team that was mostly Georgia residents. Not just scholarships, but also the hope scholarships. So we proudly accept those and we thank you guys. So thank you so much for having us here. We are very honored. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Oh yeah. Four shells. Four shells, record. 64 and seven. 64 and seven. 64 and seven. Wow. A lot of games. Look at that trophy. Congratulations, y'all. Another national championship coming to Georgia. No off Georgia University. Thank you for what you do, Mr. President. Ladies, congratulations for the win. For the great honor and congratulations on being employed. That's pretty cool too. Thanks. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. How fast do you think that ball comes in there when they have to hit it? Wow. They can sling it. If you would like to meet the folks from North Georgia, I'll invite you to go out to the south any room and have a photo with them and congratulate them on our great accomplishment. National Champions. Thank you. Thank you. Thank you. Members, we're moving on to the rules calendar. We've been on to the rules calendar. But if you allow me to make one more mention, Mr. Leader, Leader Beverly, I'm going to give you a few more questions. You're fine, Chairman Perkel. I wanted to let you know and acknowledge that Senator Warnault's was here this morning and we had a meeting schedule. Certainly he understands and tell him how much I appreciate him allowing us to reschedule. I will reschedule it at a time in place that suits him. I want to sit down with him and have a great conversation. We appreciate him being here at the Capitol today. And certainly, and explaining to him what his situation is, if you will. Thank you so much, Mr. Leader. I hope you had a good meeting with him this morning as well. Thank you. Chairman Yard, are you ready to go? We were going to take a here she is. You'll be next, Chairman Yard. Mr. Clerk, are you ready with HB884? House Bill 884, our representative Alexander, the 66 Bruce, the 64th and others, to be entitled back to amend Code Section 1562 of the Fish Code of Georgia. I annotated really the number of judges and superior courts those who provide for a fourth judge of the superior courts of Douglas and Judicial Circuit. Ms. Bill Lambert, for the Committee on Judiciary, that committee recommends that this bill do pass by Committee substitute. Chair, recognize the representative Alexander to present the bill. Representative? Thank you, Mr. Speaker. HB884 is legislation to add a fourth judge of the superior courts of Douglas Judicial Circuit. The reasons for this legislation are this legislation was requested on behalf of the Chief Judge of Douglas County. Douglas County ranks number three for new judgeship. Currently, three judges are doing the workload of 4.5 judges for the past several years. Douglas County have not added a superior court judge since 1998. Also, the governor has included this fourth judge in the budget. The verbites in the language mirrors other judgeships previously passed in the body. I want to talk specifically about Section 3 line 22 through 30. The verbites staggers the term in a last election in 2026. We have two judges currently on the ballot this year, and the third judge will be added with the third judge in 2026. And wrapping up Chief Judge McClain retires at the end of the year, and we thank him for his services to Douglas County. Mr. Speaker, that is the bill, and I will pause for any questions. The lady did an outstanding job. She has no questions. Thank you, Mr. Speaker. Ask for your favorable consideration of House Bill 884, and I will yield the well. May get you to present a lot of bills to this group, if it goes like that. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the Committee's substitute? Chair, here's none. The Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the Committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. For what purpose is Chairman Collins rise? Parliamentary inquiry? State inquiry. For what purpose is Chairman Collins rise? Parliamentary inquiry? State inquiry. Is it not true that Representative stated that Judge Bo McLean would be retiring at the end of this year? Yes, the gentleman says so. Is it not true that Judge Bo McLean is probably one of the best men that I've ever had the privilege of knowing and that I represented that to area for a short while when I first came to this house. And we're going to miss Judge McLean being on the bench there in Douglas County. Sounds like with your relationship and your knowledge of Judge McLean in his service, he will be greatly missed. Hope he will certainly consider coming back as a senior judge status and continue to serve the great people of our state. Have all members voted? If so, the Clerk will lock the machine on the passage of the bill. The A's were and R 168, the NA's or zero, the bill having received the requisite constitutional majority is therefore passed. My comments probably led to that applause you did do a good job. Mr. Clerk, will you read the caption to HB 906906? House Bill 906 by a repson of year to the 150 second, housed in the 170th, Berkel 169th. To be entitled an act to men code section 1562, with the fiscal to Georgia annotated, relating the number of judges this period court, so as to provide for a third judge with the spirit courts in the Tifton Judicial Circuit. I would refer to the committee on judiciary that committee recommends that this bill do pass by committee substitute. Chairman Yerda is recognized to present the bill. Chairman Yerda. Speaker, the colleagues I'm bringing you, House Bill 906. House Bill 906 would provide for a third judge of the spirit courts of the Tifton Judicial Circuit. Four counties make up the circuit, Erwin Tift Turner and Worth County. The judge workload is 1.41, which is the highest workload by a requesting circuits. The Tifton Judicial Circuit last received a new judgeship 43 years ago in 1980. At that, since that time, the circuit is grown by a population of 25%. In 2023, Superior Court judges spent an average of 16 working days in court, and they're currently scheduled to spend that same amount of time in 24. There are five accountability courts in the district or the circuit. Currently, there are 31 murders pending in the circuit and 94 serious violence felony spending. They also have 2951 open felony cases on top of that of the serious murder and serious violent felony cases. The Judicial Council met this summer to address the critical need for additional Superior Court judges, and the Tifton Judicial Circuit was ranked number one in that evaluation. So I ask for your favor consideration on adding a third judge to the Tifton Judicial Circuit. You have no questions. I yield the well, Mr. Speaker. You do the marvelous job as well. Sounds like you have a need down there. Is there an objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there an objection to adopting the committee substitute? Chair, here's none. The committee substitute is adopted. Is there any agreement? Any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Are you voting a speaking? I think you're voting, right? Have all members voted? All members voted.\n\nIf so, Mr. Clerk, will you lock the machine on the passage of the bill, HB 906, the Yades are 168, the Nays are zero. The bill having received a requisite constitutional majority is therefore passed. We have several other bills on our rules calendar today, but we will postpone those bills until tomorrow. There are House Bill 878, House Bill 905, House Bill 976, and House Bill 985. Postponed to the next legislative day. I appreciate y'all working with us. There are several important afternoon orders, and we will postpone them as well, so I appreciate y'all willing to work with this on this day. That is important to us all. Mr. Clerk, will you read the caption to a group of privileged resolutions honoring the life and memory of Nora Wood Goodman? Recognizing commending Georgia Military College, recognizing commending the Georgia Academy of Audiology, naming April 1-7, 2024's Global Minority Entrepreneurs Week, recognizing commending Carol Crawford, recognizing the week of February 5-9-2024 as National School Counseling Week, and for other purposes that completes the reading with privileged resolutions. As there is an objection to adopting the privileged resolutions, Chair, here is known and the resolutions are adopted. Members, we have a few announcements that we need to hear. And Chocos and Chair and Representative Martinez. We will understand the referencing Martinez. This should be interesting with you two coordinating on it. Chairman Mark. Thank you, Mr. Speaker. We have a small business development meeting tomorrow at 8 a.m. in room 406. Thank you. Well, curious minds are answered now. Small business meeting. I like that. I should have figured that out. I'm sorry I didn't. Chairman Meeks, recognize for announcement. Thank you, Mr. Speaker. Just want to remind everyone of the album of Bacon County Cookout tonight, the IBW Building Auditorium beginning at 5 o'clock until Cookout they've done every year since 1992 with exception of the last couple of years of the pandemic. But everyone's come out to have dinner tonight. I'm on Bacon County Cookout over at IBW. Thank you, Mr. Speaker. You're the well. I will tell you all, that's a good one isn't it, Chairman Hitchens. There's added to your waistline over the years. I can guarantee you that. I've seen him in action over there. Hey, time of day. You better get to the table before he gets there. It may not be much left. Because he loves that time. Representative baseball is recognized for announcement. Thank you, Mr. Speaker. I'm calling all women. Women's legislative caucus, I'm reminding you today at 1130 in room 230 in the capital. We will be having our weekly meeting. So please attend. There is an option for Zoom also. But please come get your lunch. Thank you. Which room did you say? 230. 230. Thank you. Chairman Parsons, recognize for announcement. Oh, thank you, Speaker Burns. Members of the Energy Utilities and Telecommunications Committee, the EUT committee, you should have received a notice on this a little bit earlier that we will not meet this afternoon. That committee will not meet this afternoon. Thank you, Speaker, I yield the will. Representative Franklin is recognized for an announcement. Thank you, Mr. Speaker. You have a piece of paper on your desk about the Hyundai plant. This is an update immediately after a session. It's a lunch and learn. So you're going to find out what's going on with the construction also. There's going to be a workers report in there as well. And the DOT is going to give a report. So I encourage you to go to it. You're going to learn a lot. It's going to affect the state of Georgia. It's 328 CLOB, 1130 to 130. Thank you. 328 CLOB, Chairman Dickie, recognize for an announcement. Thank you, Mr. Speaker. I just want to remind the agricultural and consumer affairs. We will have a committee meeting in the morning at 606 CLOB, 8 o'clock in the morning. We're hearing four bills. Thank you. The representative Anderson has recognized for an announcement. Thank you, Mr. Speaker. I just want to make everybody aware that governmental affairs will have two subcommittee meetings today. The general government subcommittee will meet at 1. The election subcommittee will meet at 1.30 both in 4.15 CLOB. Thank you. Thank you, sir. Chair Lady Cooper, recognize for an announcement. Thank you, Mr. Speaker. House public health will meet today. We will meet in room 606. Our usual place at 2 o'clock. So, House public health at 2 o'clock in room 606. Thank you, Mr. Speaker. Chairman Carson's recognize. Carson is no sons. Carson. Thank you, Mr. Speaker. House retirement committee at 2 o'clock. We've got a couple of bills and possibly hearing a third bill. House retirement at 2 o'clock in the CLOB 406. Thank you, Mr. Speaker. Thank you, singular Carson. Chairman Bauder, recognize for an announcement. Thank you, Mr. Speaker. Two quick announcements at 1 o'clock and 1.33 cap. We're going to have informational meeting for the American Irish caucus. And then this afternoon at 3 p.m. is the defensive veteran affairs committee meeting in 506 CLOB. Thank you. Thank you, Mr. Chairman. Chairman Lomiston, recognize for an announcement. In the morning, Full House Insurance Committee, 8 a.m. CLOB 406. Please be there. Thank you. Chairman Williamsson is recognized for an announcement. Thank you, Mr. Speaker. I want to remind the majority caucus of your lunch in fellowship in room 403 at noon today. Lunch in fellowship in room 403 for the majority caucus. Thank you, Mr. Speaker. Thank you, Chairman Williamsson. Chairman Gunther is recognized. Representative Williamsson, you can't hackle people in the well, even if they are your cousins. Chairman Gunther. Thank you, Mr. Speaker. Judiciary Committee will meet this afternoon at 1 o'clock in 1.32. We have a fairly full calendar to go over. So thank you. That concludes our announcements. Members, if you'll give me your attention for one minute before we call on the majority leader. Members, there are two special people that work very closely with Chairman Smith and his loss is impacting us on and it will. But I want to ask, as we remember the family in our prayers, we also remember Pam Lewis, who's worked with Chairman Smith many years as his administrative assistant and as a personal friend. So let's remember Pam and Leo Chantzi, who's worked very closely with the rules, Chairman. And I'll tell you, just like other jobs that we have here, we can't do our jobs without those folks who work very closely with us. Leo's very talented and Richard felt the world of Leo. And I'll tell you what I'm going to do to rest of the day. It's been a hard morning for Y'all, for all of us, for the family. We will remember the family the day and the days that come. And after this week, we will continue to remember the family. But I'm going to do something. Put it back up there, please. I want to remember that smile. And I'm going to rejoice to rest of the day. And I'm going to have a little fun, because I remember Richard Smith and think about the really good times. Because he loved his community. He loved his family. He loved all of us. And he loved his Lord. And he's here with him. Richard Smith, a dear friend, and a great Georgian. Love your brother. And we go smile with you, because we know you're smiling now. Majority leader of this house is recognized for a motion. The speaker, I move that this house stand adjourned until 10 a.m. on Wednesday, January 31, 2024. All those in favor will say aye. All those opposed will say no. And the late chairman rules would say that no matter we are adjourned. Thank you, members. The late chairman rules would say that no matter we are adjourned. Thank you, members.",
  "updated_at": "2026-02-13T19:45:29.639014+00:00"
}