{
  "video_id": "roBPvdwl3v0",
  "url": "https://www.youtube.com/watch?v=roBPvdwl3v0",
  "title": "10/24/2023 - Senate Study Committee on Rural Medical Personnel Recruitment",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 185,
  "summary": "Here is a structured markdown summary of the Georgia 10/24/2023 - Senate Study Committee on Rural Medical Personnel Recruitment session:\n\n## Overview\nThe session focused on discussing recommendations and strategies to address the ongoing challenges of ensuring access to healthcare services for citizens living in rural and underserved areas in Georgia. The discussion highlighted the importance of a team-based approach to healthcare delivery, leveraging state-level legislation and funding, as well as advocating for federal programs to increase the supply of healthcare providers.\n\n## Key Actions\nNo specific bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- The chair emphasized the need for legislators to be \"super intentional advocates\" for Georgia residents with the Georgia congressional delegation, as some of the proposed programs require federal-level action.\n- Examples were provided of successful programs at Andrew College and Wiregrass Georgia Technical College that aim to recruit and train healthcare professionals, particularly from rural areas, with the goal of retaining them in their local communities.\n- The chair of the Department of Family Medicine and Community Medicine at the Medical College of Georgia provided an overview of their efforts to train and place more healthcare professionals in rural areas.\n\n## Votes\nNo recorded votes were taken during this session.\n\n## Attendance\nThe session maintained a quorum, with legislators and other stakeholders present.\n\n## Adjournment\nThe session adjourned. No information was provided on the next scheduled meeting.",
  "transcript": "So I wanted to let you guys that are in the audience look up and see the white microphones. I've been told that they pick up everything in the room. So if you're having even quiet conversations, it will pick it up and put it out on the bathroom. So be careful. All right, Synergents. But let us pray. Holy and loving God, we give you thanks for the beauty of the same things for our hosts for the students who are gathered here and for learning into studies that they might bring healing and help to Georgians and people across this nation world. We ask that you bless each of us and you guide us to give us wisdom. We might be able to make decisions so that everyone can receive the care they need. All right, so we're going to get right to it. My goal was to have a side of your life. So. The chat time. Thank you, Mr. Chairman and members of the committee and staff. I'm going to ask you to. I asked you to. Turn to the last page of that as you will know that the bottom of the last page addresses for and contact information for me and doctor Amanda Brown. Doctor Brown is a governor of fairs chair of the GMC. And she is responsible for a much of the research and consideration of these sensitive recommended. I have been in a bug and did not have a pleasant day yesterday and will not be here today. So I am doing my best to fill for her. So the GSA is an organization that's comprised of physicians, residents, physicians, certified and new knowledge, medical students and food and. Members of the GSA advocate for position, land medical care so that every patient with arborist of studying benefits from a team approach with skilled, training and education and multiple practitioners are indebted in patient care. GSA, the medical association, the board here, and any other medical specialty sites throughout the state are committed to ensuring that patients have access to safe, high quality physician, lead medical care. Georgia, like many states, states that ongoing challenges and ensuring access to peer services for the citizen, living in rural and unreserved areas. Over and many members will understand that when we refer to rural areas, we consider our recommendations to be also pliable to underserved areas in the urban areas. So patients who have been both of these citizens deserve access to the same level of health care is patient in urban to urban cities. So when we speak of position-related health care, we are talking about a team approach which allows trained health care professionals working together to invest their several skills and various training to work. Now, these recommendations, I will not even attempt going to all of them, but they have come from various sources and I hope that you will especially take note of what other states are doing to inset the production of health care professionals at all levels. So what I would like to do to start is just hit some past spots. Clearly, the state, even legislature, needs to do some things. And what we have put together here, you will have to work it by your staff, or after you do. To really drill down to all of it. But I'm not going to mess words because we don't have a lot of things are not improving in the rural areas as fast as we want, nor as fast as citizens and taxpayers, no areas to burn. So what I will say to you today and what you will read is there are basically two pathways for you as legislators to do your part to help improve conditions for rural and underserved areas. One, are the things that you can do on the state level with state legislation and state funding. And the other thing that we are asking you to do is to become super intentional advocates for Georgia residents with the Georgia community. And I want to say that I want to sit alongside Jimmy on that one and say that it will take money for some of these things, but the benefits in the enormous. And the reason why I want to sit with you today is to become super intentional advocates for Georgia residents with the Georgia congressional delegation. Because some of the activities that are listed in this document are being considered at federal level. And if anyone in the room or listening or you all the panel, the thing that you can avoid the opportunity to work with our congressional congregation on some of these. And if you do, if you miss that opportunity, then many of those programs are not likely to come to fruition. And I want to tell you that our organization and I'm sure many of the people in this room are working with congressional delegation on the federal legislation and legislation like it for other health care providers to increase, to create federal programs that increase doctors, nurses and other health care providers. I have not attempted in this document to include legislation at the federal state level for nurses, especially their participation or any other. However, some of the claims at the federal level and at the state level certainly apply and should help in sent the production of more health care. So one of the things obviously is we're going to encourage you to. In sent existing programs to train more. And I'm sure that we have learned from experience, recent experience, and I'm sure the health care professionals such as Dr. Seth and my knowledge will use this shortly. No, is that when you draw residents and the health care training programs from the rural areas that tend to stay. I give an example of this. So what are some of the current ends of the set that we've seen. Andrew college in comfort George is a very small private nonprofit school in Southwest of our state. So it is the biggest industry in that and then ran on and like the bottom. Andrew started a nursing program at the associates level just a few years ago. They also started the rest of the therapy program. And what that institution does is intentionally goes into the high schools and and generates induced gas and components in those high school students to then enter health care related to. And so the program has turned out a number of associates leveled versus and rest toward their. And I've confirmed the test of that 75% of those graduates remain in Southwest Georgia and are serving their neighbors serving the folks in the counties where those students were raised. And the second possible in all men works intentionally to pass through some queer can use to recruit possible students to train a certified nursing assistant. While the students are still in hospital. And I'm going to commend to you that if you have not watched the video or helped some of your peers. Go and listen to review the Senate and House study committee on dual enrollment for highly skilled students and younger adults that's so much brass and represented math, dude, that's a study committee. And there first meeting in all many is impressive. And the content of that meeting is impressive. So that program provides clinical experiences in hospital facilities, exposed hospitals, the environments where students and actually envision a collider health care. And there's some wrap around services that feed in this program are going to help support the students and the health maturity. And then of course, I want to mention birth or universities medical school, which is all the hand in its health care programs, which are all about helping in more position, we're hilarious. That's that is a mission of that medical student. There's a federal opportunity here that you can read about what I like to do now is ask stuff, step in my mind, who's the chair of the parts of fantasy technology and carry out medicine here medical college and the tell you a little bit about what in CG is going to train and place more health care professionals in our studies. Good afternoon. My name is so remind I am the chair for the part more in the Cology, health medicine, get the medical college or that. So kind of department faculty for the last few years. Very much appreciate meeting the community chair of your committee insights data and position brand programs. In their contributions to the decision and it's done before course in the same Georgia. The Minnesota resident program functions under the umbrella, the states only public medical school in this one of only two resident programs in the state and we're being a lot of program. Our in the city of our in the city of residence program is only integrated for year program, which includes the catacore code for each year, all of my three years of clinical in the city of rain. So we're going to do our residence program to provide fellowships on special training and the evidence. You critical care, you find pain and we are in the process of adding the key to the fellowship. For the purpose of this presentation, we reviewed annual graduation statistics following to your residence program dating back to FY 13. So during the security of the graduated 160 and a seat of residence, 22 or roughly 19% of these residents came from Georgia. The other residents joined us on other states for other countries. 45 graduates will approximately 38% of the 16 graduated. The resident state in Georgia. Of these 45 graduates, 15 joined our faculty in 30 joined by the practice. Of notes, out of the 22 resumes, we came from Georgia, 19 for 86% ended up practicing in Georgia, which is more than twice the pension rate in comparison to the total heat average of 30%. Like most states, Georgia is facing the severe and the seagulls of short-term shortage. Nationally, the numbers are very similar in Georgia, 57% of practicing ncdologist at 55 years for older. Our specialty stuff are from the great resignation, following COVID-19, the four years of the time is occurring in one year. Following this in the future waves of the time is here confronted with a serious supply deficit of ncdologist in the prime years, due to low ncd of as in training for the 19 months. The American Society of Ncdologist Center for Ncd workforce is a security order of these issues and is actively working on several proposed solutions. In the supply category of summation, CMS, the major fund of graduate medical education conditions. Unfortunately, this funding has been closing the future section since the 1997 balance budget act. Advocating for increased CMS funding and building five partnerships supported by private funding, will increase residents of income on the community farm on the higher priorities. Locally, we have the following opportunities to add ncdologist in the state's workforce. First, increasing the size of our ncd training program. Second, increasing the percentage of ncd residents from Georgia. And third, and very importantly, adding our department to the group of departments and specialties that have already been approved for the MCD-3 Plus program. Enrollment of ncd medical students either the ncd-3 Plus program would mean that new students were trained with us. And following graduation, it served the rural anesthesia needs for minimum of units. Finally, I would like to comment on the ncd repair model in our department. Our residents support on board to grow up witnessing near daily training the benefits that the position that ends to your care team brings to our patients. We're fortunate to track a very talented group of CNAs from Augustine University's College of Nursing Year up the year. Under the medical direction of the position and the cdologist, our CNAs are critical components of the care of our civic locations. We have excellent relationships with our CNAs. Our CNAs work hard and have excellent skills and support the clinical training mission of our department. In the third year, set, I have practiced my specialty. I have not only enjoyed, but my experience has taught me that the position led in the seizure of care team on provides by far the best care environment to serve the ncd of our patients. In addition to the position to knowledge guide the anesthesia plan, accounting for the critical nuances of underlying illness and the surgical needs. Updating anesthesia plans based on new research findings and participating in this research. There are many examples of uncore events in the ncd. The last year, the unexpected massive lead, a life-spiting and a black, allergic drug reaction, potentially fatal heart-written disorder. Our Monday examples were a position for the team response will always pass the emergence of the response of the single anesthesia provider as would be the case for the independent practice in CNA. Based on my long-standing experience, I'm very clear that the position in the seizure of the cellar and cedar care team protects each member of the patient care team. The CNA, the anesthesiologist, the surgeon, most importantly, reduces the risk of avoidable harm to our patients, as well as the liability risk to our health systems. It is my hope and strong recommendation that our innovations for both solution for focus on what is the best thing to start certain patients. It's easy to secure the same standard of care of the position that anesthesia care team model would outfine us as to whether this care is provided in the burden for rural society. Thank you, everyone. Thank you, Dr. Mauer. I want you to page two of the document in your three sessions, three and four. These gives specific opportunities in which you can work with our federal legislators, the dog programs that solve problems and remove impediments from medical school graduates both in this country and an international medical schools to find residency programs that are necessary for those students. And there are some startling statistics in here about how many international medical students were at once. Many of them are probably not in studies, probably from Georgia. Simply get up high and arrest, so complete training. So we're missing an opportunity to be effective that there's a staggering number of medical students in our country trained here that do not match that figures in this document. So, as Dr. Mauer stated, residency programs on funding is generally and largely through the Medicare Medicaid program through CMS. It's an athlete. It's highly inadequate and if we want to make progress, we create more practitioners and to incentive a push to those graduates to the rural and un-served areas. And we've got changed way with doing that. There's information in this document about legislation that will remove the stranglehold that ACG and many pass on residency programs. So I'll leave you to read that and in an interest of time, I'm going to kind of look through this, both of the information. You'll see that there are low and repayment programs that say, you know that are available and could be enhanced scholarship from medical students. You, someone you have voted for, state level incentives for rural and un-served here. Those were listed here with some recommendations. Now, I want to point you to what has happened in Alabama in Mexico and other studies to increase production to print professions. Now, one of the problems that comes when a medical school graduate does not match into a residency training program is the medical student is in what I call a neutral position. So there has been a great deal of thought by some folks in other states on how to make productive the time of the medical students while they're waiting to match to a program. And it's called a position licensure. You see that in Alabama, Arizona and Idaho, his name a few, the states are doing something to try to create productive time. Where those residents that do not match are able to go and work with positions. So that the student is matured is learning further is getting clinical experience. And so we commend that problem to you. You'll also note that there are programs that Louisiana Tennessee and Washington say. I'm not going to deliberately get an actual medical graduate. Curls and impediments that I would ask you to read that. So what can the state of Georgia be where you can emulate what California Texas or Minnesota and Michigan and sponsor more medical as. As I said, largely medical is these are sponsored by CMS. So we're at the mercy funding of the federal government. We know how difficult that is. So I asked that you consider these seriously. I think one of the biggest problems in anesthesia that that distance sense and anesthesia is all of this to go through the rural area is what is known in the anesthesia. You know, it's the 33% problem. It's now the 24% problem because of recent reductions in medical care and financial. When I say reduction in funding, I mean significant reductions in funding and the Medicare program, which is as you know, is a huge population in Georgia. We've had that discussion and we'll continue to have that discussion about Medicare funding in our study. And so what happened in the 19.9s was that when the federal government changed the funding formula for reimbursement of anesthesia services, I'll just going to be blunt and say anesthesia and anesthesia practices got screwed. And that has never been corrected because of the way that Medicare and Medicaid fund, I mean, CMS funds, Medicare services on a neutral basis. So why would why would a position want to go to a rural area where it's almost probable that the patient is going to be all medical care. And we all know here in the mediate with very little private. Because the position and the visit the anesthesia practice is only going to receive a reimbursement that by comparison to other medical specialties is 24% and I know Dr. Patrick knows very well all the time this. So we're asking you to be intentional with our federal legislators and look at the slide that we've left bills that are being considered federal level. And to ask our federal legislators to act for the benefit of our rural and rural and rural communities. And the interesting time I'm going to get down to the lit vlog and we're going to shut some porn the last day. I actually forgot one of the corn pops I wanted to put in this. So I'll give that to you. You face challenges and recruiting both the personal rule and uncertain areas. But the increasingly difficult challenge for you and for George public policy makers in the health is keeping the few health care personnel and have not. Dr. Bonner reference the post coded retirement positions we have seen significant retirement in an season. And it will take years. Even if you act on all this recommended recommended here it will take a decade or so for anesthesia providers of different types to be close forward with the final. That post coded retirement. And it occurred in the nursing is what I think you know. So here are the 10 things that I think you can do. Right now and encourage your colleagues at the state level to do. Surprise billing is not working. We just not working. The state level on the state's across building platform. We're seeing in pairs. Simply review. I know that you passed two bills last year that are intended to address. Surprise bill and challenges for medical practices and we hope and look forward to working with insurance, return you. And it's not just laws implemented and in fluids. But I'll tell you that medium size and stage of practice say in New Georgia. That has a 750,000 dollar accounts receivable from the massive insurance. Because they have 750,000 dollar receivables from one insurance. They probably have jumped as much from other insurance players. And those anesthesia practices are part of our pain. They're CRNAs. They're anesthesiologists, assistants and all the team members that are required by safe anesthesia and period. So we're not finished with. And I will say on the federal level that that law is completely broke completely broke. Texas Medical Association and other organizations have soon won three times to stop the regular for the agencies that created that quality record for its broker to the streets and to. And so I'll be a Congress credit. They passed a pretty good sparse billing off that properly enforced at regular for low would begin to see money flow to medical practice. Number two, a God Lake Placid Reclires adequate position and similarly networks by health care fund. And this will be hospital based positions like anesthesiologists, radiologists, pathologists, and to a great degree. ER docs have no leverage against insurance in contracting because those insurance know that those positions, that are those. And they take every patient to walk. I know that Senator had to add is well aware of some of those laws and requirements in the burden that places on the finances of the medical. So number three, demanded towards federal lawmakers, things, faulty regulatory implementation, those files back, which I'm. Number four, a thought medical ability and premises liability legislation, which you fair protections for patients and reduce our edges and unsustainable burdens, which are running more facilities and their personal out of the profession. And we know that the governor is leading on this and we look forward to working with them. Senator Hatchett, I'm as you do have a little soft to do with that.\n\nYour role is for you. From five, adequately, the phone, the Georgia Post medical board, the Georgia Board of Nursing, and all other licensed boards which struggle to process an issue common licenses to qualify health care personnel. A position that a distinguished anesthesiologist who has run major medical practices throughout this country is taking over direction of an anesthesia practice. I will not name the city. His license removal in Georgia has been delayed for months, and he needs the own job right now. Four months of four months. FLR. It would matter if it was for or for because that's all that it's too long. And I know that nursing board struggles because there are thousands of nurses seeking or moving. And I know that there has been the disciplinary and compliance activities by the boards. But in my impression, most of you know I've been around for years that the boards are completely inadequately set and funded. And frankly, I'll say that that's only alright. The number six, consider recommendations of the Senate study meeting on workforce 12 and Senate studies meeting on occupational licensing, which short the time the license of qualified, of qualified personnel. So I know those two Senate study committees are doing the work. I certainly haven't seen their recommendations because they have a post with them. But I imagine there's some good stuff there and look for the problem with you about that when you see those recommendations. Like Georgia do also we increase the rate for physicians, especially those providing surgical and procedural service and these all just a part of that certain. Number eight. The man that George Spenelon, all makers, adequately done Medicare service, this is our 24% problem. Number nine that I've asked you to insert there is to urge the Board of Regents to start an anesthesiologist assistant, framing from at the medical college of the board. Embry and South College in Savannah produce a number of aAs. I think together like to these ADAs and many of those things. It's time for the first system to join the occupancy to produce more A.W.A students. And then finally, I ask you to maintain the quality of health care in rural areas by keeping position led health here in a team approach available to all Georgia citizens regardless of the setting. And with that, I just want to share with Dr. Mollon our happy that you think you all want to say thank you for coming. We're going to try to get your show under it. Hope questions anybody had. Yeah, I just like to clear up something. I know something about this from being a position, but it's confusing that there are serenades, PAs that are anesthesia, and then there are anesthesia assistants and it might be helpful for people who just briefly sort of who does what. Now, in Georgia, PAs, position, assistant to anesthesia are comparable everywhere else in the country to certify anesthesia, I'll just sit. And you passed legislation last year that had a glitch in it, governor, that would establish anesthesiologists separate from positions. And you'll see that legislation again, hopefully will pass that with the required change in it personally. Does that the work of Dr. Mollon would you address the work that we're in called responsibilities are same for us, serenades, the awful a's, you see, definitely the same thing in our department, which is what we've seen other health systems as well. Also from a clinical perspective, you know, identical in the way they're deployed in a lot of ways as part of our teams, the education pathways are different. And it's obviously going to perhaps a nursing degree for us, what is a is to a pre medical pathway and so there is a correct separate the other difference between a a's and serenades, say a is completely directly by us. Thanks very much for the excellent information with a lot of detail of my background. Top line question is this around the supply building the Georgia bill, the sprang bill and federal bill. And I'm saying that in both places, we have a good at least bill, but when it comes to regulatory enforcement, the way the regs are, you know, the regs have been done. And and the way they are are not so you have a big insurance company, stepping medical providers because that is in a word. So I want to be a parent, a missionary, John team, right, he has been involved in legislation that she passed to strengthen his authority to hold insurance responsible and to make the arbitration process fair to both sides. Right now, it just isn't working at federal level, it's not working at all because the free regulatory agency is never responsible for writing the way to all the federal bill just some early change to mechanisms and all the changes are enhanced the position of the papers. Which in case that the players have been very fabulous behind the scenes with the regulatory agencies. We don't have any ideas. So that's so that is a, that's a real factor that I'm taking from from your presentation. Because that's that's legislators, ice laws and governor's appointments, the sign, the bill, that's put into law and then it's going to be converted by the insurance industry, and the rules and regs and the enforcement. That's that's it. That's it. Thank you for your description of our challenge. Mr. Chairman, I know that our time, well, when we first talk about this state committee, I committed to you that the GSA would come forward with solid recognition. We believe that this is 85% of the best recommendation opportunities that are available right now. And there are other good minds in the in the room. Others will testify. And again, I say that many of the activities in here can be duplicated for nursing and other medical personnel until here first and then those incentive projects. I want to assure the committee that in every one of the room that we are going to make this available to this for a need of summons, our latest update version, which I needed to cut off that will send it to her and it will be available to be. And Mr. Minstress, hard copies of the VSA presentation available if anybody wants to. Okay, now I think Senator Walker joining us on soon. As a quick question. Yes, sir, can you hear me? Yes. Appreciate it, Mr. Chairman. And yet appreciate your comments. Certainly, I think I could agree with several of your recommendations that I look forward to seeing your document. I think we need to increase the funding to the composite medical board. I'll give them the resources they need to do their job. I'm in favor unless I'm. I'm not going to be able to do that otherwise that nurse protocol agreements ought to be able to be just submitted to the composite medical board and kept on file and not require action by the composite medical board. Unless there's a problem. In other words, submit it. If you're going to have a job that's approved. That would take some of the workload off of them and speed up the process for getting our advanced nurses working. I do, yet, don't want to miss this opportunity to and I don't mean this in a adversarial manner at all. I'm wondering if you could speak to your concerns or your clients concerns on the legislation I tried to pass last session where rule hospitals are struggling to hire surgeons. Because the surgeons are these hospitals don't have an anesthesiologist on staff and they're using CRNAs in the operating room. I just wanted to change the language and the law to make it clear that the surgeon was not supervising the anesthesiology, the administration of anesthesia that the CRNA was responsible for that. What's your as your position changed and if not, can you explain your concerns so that I understand that better. Thank you, Senator. The GSA position has not changed both the GSA as I said in my opening remarks. Promotes and educates toward a position led health care team approach. And that is a team approach that is replicated across all medical specialties. If I were a patient with an urban or rural, I would want as many responsible parties adding their training, their brains and their hands to a rescue effort as can be. CRNAs are highly trained anesthesiologists, assistants are highly trained. But when a patient needs recovery, when the very things that Dr. Miler outlined in the testimony begin to occur, you want as many heads and hands involved in that rescue as possible. Senator, there is nowhere in Georgia that an employable anesthesiologist, CRNA or anesthesiologist, assistant is not working if the practitioner wants to work. That is to say that everybody that wants to work in anesthesia and is qualified in this state is working and we need more. And that's what our testimony has been about today to produce more anesthesia providers so that they can be pushed down into the underserved areas. But I will say this and this is me, this is not a position of a GSA but I've worked with GSA since 1992 and this conversation has occurred every year since then. I would not want a surgeon that is not willing to take responsibility for the total care of me. Thank you for coming today. I appreciate you for bringing us your recommendations. I know you'll have a lot of time in here and we'll look at it once you get it available to bring it up. We will make sure you're bailing and thinking. Thank you for your time today. And Mr. Chair, I want to say that I have a meeting in Gainesville in just a few hours and I don't want anyone to think that I'm disrespecting the testimony that will follow. Some of my co-workers are here and I'll also be able to listen to this in my dorm. So I look forward to hearing. I'd say I need to go. I went a little over on that one. So I'll try to get us back on track. Maybe grass. Mr. Chairman. And may you perhaps I am the immediate path president of the Georgia Association of nursing one. So I want to talk to you guys today about what is the RNA is and what we do. And I am very happy to be here today for representing the over 1700 CRH that we have practicing and we're not going towards a great here, great care of their patient. So what is a CRNA? 35 registered nurse net visits or CRNAs are advanced practice registered nurses who specialize in training and anesthesia. CRNAs like my practice is every day. In each transportation dial in today is the only permitted at need admissions to these disabilities. These were the most flexible aid of professionals compared with AA's and physician anesthesiologist with required critical care experience before beginning their formal anesthesia education. And I want to highlight that for a minute because what we've mentioned earlier when we talk about the absolutely detrimental things that can and do happen in surgery, things like the cardiac arrest or a massive need or something. Hopefully for most anesthesia practitioners that will be a once or twice in a career sort of a meringue. But what is the special about the RNAs that are time spent at that fact in the ICU dealing with patient. We're dealing with those on a daily basis. So we are very easily able to recognize someone who's small or my new clinical sign that tell you and give you a good tell tell find that something is about to happen here. So that is what really conditions us to be able to take right here at this patient and surgery when those unfortunate events do happen. CRNAs are of course among the nation's most trusted professions, according to the Gallup. So let's talk about our education and training. Today, CRNA couple practice authority in every branch of the military and we are the predominant providers of anesthesia care to US military personnel on the front line. Maybe shifts in aircraft evacuation teams around the globe. If we're good enough to stabilize the patient on battlefields, we're good enough to care for your left. A CRNA month complete seven to nine years of education and experience and all students entering an accredited CRNA program must be enrolled in a doctoral program after 2025 all CRNA graduates will have a doctorate in nursing practice. CRNA graduate have an average of from 9,000 hours of clinical experience, including 733 hours of nursing over 6,000 hours as critical care nurses and almost 3000 hours during their anesthesia program. So I talked to you, you're going to hear a lot of facts about clinical experience and you know hours on the job and these hours that were counting our hours spent in operating room. We feel like it is unfair for other specialties to claim that they have exponential amounts of clinical hours when those hours actually sent a sleep in a call room. That's not really on the job experience. So in the first position, CRNA must be board certified to practice and they are actually required to report that to repeat that board certification every eight years. So we are staying up to date on the newest and latest innovative technologies and we hold ourselves to a very high standard. Also, I wanted to talk about the students that are going through these programs. These are a student, their education is privately funded, meaning that they're taking out student loans like I did or they're paying for themselves. Unlike position residency programs, which are tax payer funded, these don't create any sort of a burden or any sort of a tax burden on my residents here in Georgia. So I mentioned to the AA program, the AA programs, they have more of a fast tracking plan. And so if you are not producing these and it's these theology at Stinson, they require position supervision as we mentioned to you earlier when we already have a lot of positions that can supervise those people who's for which is to provide them. So the benefit of CRNA is that we actually work under the direction and supervision of a duly licensed position, which is the opposite serving. So how can CRNA help rural medical first now? CRNAs provide an institution service in rural areas so we can increase access to surgical procedures and reducing the need for patients to have a long distances for care. So we can also provide a place to collaborate with other health care providers to develop comprehensive plans for patients in rural areas, ensuring that they receive the necessary medical attention. So one of the things that we heard about in the first study, many was talking about trauma stabilization and the trauma network. And that's something very much that we do any more to work at the patient needs to be transported to a higher level here will be put up to the emergency room help start central line going for IVB start food with an patient blood, get that patient's stabilized with that they can get out and get to a higher level of care. And if you're a doctor, you're not going to be able to do that. And if you're a doctor, you're not going to be able to do that. So best practices from other state action about updates to the slide, we now have 24 states that have enacted legislation that allows the governor to inform them that their state will now opt out of allowing to be earning to practice without position to probation. This allows hospitals and facilities to collect funds from CMS or CR and aid provided health care and anesthesia services, giving much needed revenue to these real hospitals. These statements increase access to care and through patient outcomes and cost savings. Statement display and aid and governors to opt out has proven to become an effective solution to addressing rule medical staffing challenges. And what's interesting now is that of 24 states that have opted out not it's being a one has revered it because the patient outcomes are issued for that opt out. So what do we do here in Georgia? I shall follow this bring S. E. One and two and H. B. Four forty five for both interviews and these bills simply updated the out of it language this language was previously updated back in 1994. So we have that we worked under the direction supervision of a really licensed position with training and anesthesia so that have in that thing one before ratio working directly under a position and these colleges when that position and the geologists was struck from that language it allowed us to go into Georgia where there are not position and see the geologists and work directly with the servants to help increase the access to care. So what we've essentially was attempting to do was trying to take some of the burden some language where you see direction responsibility a lot of these attorneys will be liability and think that the serving is going to be liable for the CRN action. We actually have the same medical now practice. That position and this these all just you and so the law that would show me change and responsibility if there is some sort of people action. The governor's workforce commission recommendations this is the direct vote rule area can often operate on skeleton crew of health care workers that must redirect advanced procedures to better equipped facilities. For instance, this is especially true of surgical procedures that require anesthesia because while a real ability may like surgeon they may not have an anesthesiology. In many rural areas demand for anesthesiology is filled by an air synaptic to much currently operate under the life of a physician even if that position does not have expertise in the industry. Providing the highest quality of the year. The R&A operating as the sole anesthesia provider had the track record of a state delivery model and numerous reviewed state that have shown that zero needs are state high quality and cost effective and use of professional who should practice to the whole extent of their education and ability. In a 2010 state published by the Journal of Nursing Economics that indicated that CRN is acting as the sole anesthesia provider is the most cost effective model for anesthesia delivery and there's no measurable difference and the quality of care between CRN only and other anesthesia delivery model. The Georgia's opportunity Georgia has the opportunity to adopt legislation to address its real medical personnel. By allowing CRN 8 to provide anesthesia service without supervision by a doctor who may not have any experience and an anesthesia we can improve access to care in rural areas. Many hospitals in Georgia, including people and Brady and hometown help were all in support of S.B. when to to allow for the facilities to deliver an anesthesia without the outdated and expensive position supervision. Also, I hope you guys were able to get one of our folders today. If we have some over there left that exact some really interesting infographics here about the efficiency driven anesthesia model. If you really want to get into questions about staffing. We also have a map for you that shows the no physician or direction requirement of CRN 8 and law that you can see. It's it's most of the last actual. This one covers the distribution of anesthesia providers during Georgia and you'll see and why there are no anesthesia providers in those county and then on the flip side of that it has broken down by county to tell you how many anesthesia providers are there. Then there's a couple to about the different policy and benefit of CRNA. There are also some studies in here that showed the facts about the RNA and how you think of what we do. And then there's more on the education and training of the CRNA. Your question. I think you so much for your presentation. One of the issues that was raised guy. My earlier. Was that things can go wrong in operation right to protect and happen. I don't know. I don't know. Is that running it right? Also, you're going to have more people and more providers kind of available. If it's just a run of the milk, we're taking out your gallbladder sort of surgery. You're going to have an operative surgeon. Here she may have a first assist on the field as well. There's at least one circulator who's registered nurse in the room. And then there's an anesthesia provider that's providing that anesthesia. Now, depending on how big that facility may be. If you're in an outpatient surgery center, you may have two, three, four, five sticks or more room that are stacked in a similar manner. Or here in a large hospital, especially a large teaching hospital, you can have an upto-their-be-off rating or instead of all similarly stacked. And so to be clear, there is someone. I did go to medical, all I learned was from a raisin out of me. Well, that was on the player's channel. The surgeon operator, whatever you got here for the number. The operative surgeon. The operative surgeon. Yes. It would also be trained in massive leads, heart attacks, like addressing these types of issues as well. Is that true or not? Yes. Yes, they are. And again, if there is a situation in the operating room where a patient is suddenly not doing well and we are doing life-thidding metrics in there, it's a all-hand-thalentic situation. So if you are currently allocated with a patient on the table, you are in there helping. You're starting an extra IV. You're sending someone to blood, to get the blood. Someone from pharmacy is showing up to help assist in a code if needed. There's multiple hand contact. That's one of the questions. And so one of your pieces of educational materials says that this bill is trying to do what we already do. So can you just paint the picture for me? You have a CRNA who's in the operation room with the operative surgeon. Yes. Where is the anesthesiologist? Well, that would depend. There's multiple places in World Road or Road Work for their... It's in anesthesiologists at all. So if Dr. Bohatchic here wants to do a C-section on someone, he'll say, Hey, Megan, we've got a C-section that we're going to do in 30 minutes. Yes, sir. I'll be right there. Although I'll see the patient. I'll do a free-office supplement. Make sure that the patient can have a spinal or the thing you put all the way to sleep for it. That's all my decision and my call. And then I take care of that patient. So I actually don't have a DEA license. So that's why this is not DEA license meaning that I have prescriptive authorities. So I can write off a piece of paper and give you a prescription to take home and get filled. So you can get your pain filter, blood pressure medicine, whatever it is that you need. Because, as we've mentioned, we'll pretend this bill is not a scope issue. So this bill didn't allow me to do anything I didn't already do. So I actually used the facility or the surgeon's DEA number. And that allows me to pull the drugs that I think are acceptable for that patient to get them through that anesthetic. And there's no anesthesia on the screen. Correct. Today, right now. If I would, yes, if we were down there, this is the Hawkinsville, Georgia. I used to work down there at Taylor Regional for years, covering call.\n\nAnd I would get called to the ER. I would properly bring delivery and cover anything that you know, it's like an emergent surgical case that needed to go during the event. No, it's these all just there. You have to put on a presentation. That's that questions, but I don't know if you're finished. You're doing session. Yeah, I had two questions. First of all, I'm trying to understand about the opt out. Yeah. If that's something that the governor can use after consulting with the medical board of the nursing board. Where is that in Georgia? Or is that conversation happened because if that happens, then why do you need legislation? Right. We, we have been discussing that and when the best time to approach the governor is for an opt out. Historically in the past, he hasn't always been eye to eye with nurses. And so it's been a difficult conversation in the past. I think we have created a much better environment to have these conversations with them. And so we're very much looking forward to speaking with them about it. Okay. Yeah. My other question is, are you in support of, you know, when, when I first got out of school, I knew a lot less than I knew five years later, or, you know, as time goes on, you get experience. And so you guys in support of any kind of experiential requirement for people that are wanting to practice independently in a rural area, let's say, versus urban area, where there's more back up. Well, all of our students that graduate from our doctoral preparatory program spend a lot of time in rural Georgia. They see exactly what more of an independent practice is and then they also spend time in urban areas and see what a more medical direction type model is. So these students are very well prepared to go out and to go to work and to work independently. I did it out of school and I worked with that in the space group for about 12 years. I just wanted to clarify the off-gold versus like legislation. What's the bar here also come. So I've been on this complaint into the issue. So opt out of what our legislation one last session or our two separate thing opt up yields circular bill. So it doesn't deal with the day they service the anesthesia. What our legislation was trying to do is take away that we're really responsibility. That is misleading to surgeons that say, I don't know what I can see. I don't want to be responsible for any procedure. Why should I be responsible. They should and in many states, I think they'll see there's 30 states now, super vision direction, and take law. I'm trying to exactly just make a change to help open up those areas for an outskirts. I quit told all the past. The federal prison up here isn't doing certain reason for a half out because the surgery won't work with. They don't want to take responsibility to see our next machine, the prisoners do hospital here to have treatment. Because they can't do them without a prison. So that's it one way to affect the us, but opt out of the strictly. The bill is not going to do anything to do with care. Yeah, unfortunately, billing and care can't really be separated, particularly in rural areas where the pair mixes. My trial governor pairs. Yeah, and now that this opens up, basically the fact that rural facilities need to pay for C.R. Annie air without having to have a. I'm not going to position to provide her as having the image. But it wouldn't affect how we. Well, I just was. So you're. There's a situation that exists over operating like another system. The situation in the real world is that they're not honesty and the allergies in a lot of these rural states. I'm not about the 33% 24% and that is what it comes down to the dollar and cents. To attract people out of certain areas and be fair rural areas and think special person to live out and go there you've worn air or. You really like those areas. But you pretty much. These rural hospitals, they work on a very, very thin line of dollars. They have to keep open are from certain cases. Really no other department also really raises money so the hospital can say open. So that anesthesia without search for care. Those hospitals can close. And then you get the care and that's that would be why I'm delivering delivery. And increase in maternal mortality and longevity. That's no ball. I think the. The statistic is 80% of rural anesthesia done this country is CR. The approximation so. Very few times I find it. I'm asking the artists to over where is this because that he just won't make enough loans. I mean. Yeah, don't want to fall. It actually maybe better question for you. I'm not really that. I'm not really concerned about something wrong. And knowing that my love for one gets optimal care. But any event that that does not happen. And there's a dad. Is it everybody that will be sued no matter what. And the hospital. And so one of these physicians that they don't want to take responsibility. Of the anesthesia. And they're all going to be sued anyway. Correct. Yeah. I would point out the case law from. Gosh. All the way back to 30s. As pointed out that. The RNA is liable for their actions. Yes. And in our practice case. Everybody gets sued and then they sort of air down. Who's really responsible. As long as they operate a surgery that's not inject themselves. And to my answer, especially if they told me to give a medicine or get something. And I gave it. And it was hard to be patient. Then that surgeon could be alive. But there is no case allow they're showing that a surgeon. Supervised in BC RNA is liable. For actions. Thank y'all very much. Thank you. Thank you. We got in and out of the next. And I would. Thank you. I'm going to take a break and then come off with. Thank you. Can we prepare it? I appreciate the opportunity to be here today. I feel like the two free speech speakers do a lot of. A lot of work for me here and so I will not read. But I am an adult with a virtual hot photo. I can't wait to see you. I will be here. I am the deputy vice president of external families there at GHA. We represent at 145 hospitals across the state of Georgia. Ranging inside from fall all the way up to March or many systems. And today I am honored and thrilled to get to talk with you about the specific challenges that many of our roles are having with recruiting medical personnel and support. with a detention at full the opening today in the state of Florida for clinical position in hospitals and it currently fits at 14,1018 clinical positions open in our hospital and the state and I'll add and have the opportunity to that hospital in particular are not going to pose 16 ITU nursing position if they have an open. I'm going to go slide. I'm going to take applicant for sick people. So this number is very likely a much lower amount than what hospitals are currently recruiting. Another statistic, Georgia is actually a net extroder of nursing so many of our nursing practices in the state are leaving to go to other states but I would continue to put resources into our nursing program often graduate additional staff. We're having to leave the state of Georgia and we're not able to keep them in our state. Blackologist brain inflection and to the practical point in GHA can add us to your list what's the port of a Senate 112 in health bill 447 to allow hearing aid that extra ability to practice in a rural area without fear of surgeon can be pushing back a little bit and this is so important in vital to our rural hospital especially to the practical point because their margins are so great to spend and surgery that they're able to do our spend time for every human-negative margin and a positive margin. It's a we want to make sure that hospitals have the ability to hire staff and it's a highly trained and offering quality care and we do feel that hearing aid that we have in play are able to do that and we trust that. Many of our hospitals as they are hiring staff members through our clinical not just hearing aid but nursing staff do a intensive training as a hospital site itself outside of what they're getting in their school planning so if you have concerns about quality patient safety, self-directed, because our hospitals are sending in that extra work nation that they have that extra training. So GHA supports efforts to ensure that clinicians can provide care to the public then and their training and education. This means the maximizing public practice which also controls all. So that is our current position and we want to be clear that GHA is not necessarily advocating for additional public practice for free-standing disability for certain providers to hang their ensure but we do want to make sure that in the hospital planning particular providers can maximize that public practice. And as you're thinking about charges especially from a hospital standpoint having lower level providers who are not physician provide that care allowed for hospitals to hang out on the park. So if they have the ability to do it, you're getting the way that they want to be able to let them offer that service. It's easier to recruit some of the providers from all areas and it is for physician. So we made the point earlier that some of these physicians don't want a comfortable area to feel the delivery investment. It is very difficult for rural hospitals to have adequate reimbursement from our insurance especially. They don't have an additional standing power. They're offered very low rate and that continues to fall here every year. And so without the ability to be re-aversed and there's services that are providing hospitals have had to come up with creative ways to offer their services. Labor delivery, I think this is excellent. I think this is a good example of that. I keep reference to Amy Braff that she talked about labor in the library earlier. We're staying hospital especially rural hospitals making decisions close to the labor and weathering events. And we often get the question why is that so? Labor and even weathering is not traditional when you serve it where hospitals are making more minimums and having to spend to offer that service within their community. But one thing that makes a lot of people forget what's under the library is that you don't just need a labor and delivery rate. You need all the anti-racurricular services which you serve as a anesthesia lab. And so if you can't recruit those providers to rural areas, you can't offer that service of labor and delivery. So it's one of the examples of their sort of data. You can evolve all of that. You can't recruit one, you can't offer that service that they support. So we continue to keep our finger on the fault from members. One thing that you're having challenges is in your community. One of the things we can help you advocate for. And from a workforce perspective in particular, when we ask them, what are the challenges that you have to recruiting? You can help your professional. Number one is not that graduate. And I think we are all aware that our schools are at capacity. They're graduating with new students at hand. But there are still some barriers there. It's the number of students that they can graduate. One of them is an issue that we have with the board of board of directors and I think they are working to try to correct that. But there is a current requirement from the percentage of full time, those part time staff members, faculty at these institutions and many of our hospitals that have partnerships with those local institutions. So we'll have to be able to offer some of their own clinical staff at part time faculty. The current part time versus full time ratio doesn't allow for that. So that's something that the civil will change at the board level that does our requirements that we have a city-based impact. As long as the school has the funding to employ that. Another challenge that we are hearing from our membership is that the workforce is not always very qualified. And I think as we've pushed through some of the nursing students, especially during COVID, when they have to do a lot of virtual training, they may not be at fall-fight or may not be ready for some of the hospitals, which is why so many of our members have implemented and are hearing outside job training for those clinical services. Another challenge is that the workforce is unwilling to locate civil areas. It's touched on that a little bit that that's time to thrive. And then finally, from a moral perspective in particular, they find that they can't compete with other hospital facilities when it comes to reimbursement for the clinical providers and certain other incentives that they can offer them. We'll just don't have the margin to be able to full staff into those areas. And so therefore they often find themselves understaffed relying on agent who's staffing, which is far more sensitive. And when faced with those challenges, again, another question every guest on members, what decisions do you make when we have this significant workforce challenges? They are signing closing beds, closing services, like labor and delivery, increasing shifts for the nurses that they already have, which leads to far out and overwork, and then their personal responsibility leaving. They're offering a benefit for the can and they are again turning to capital agency. So these are just some of the solutions that they're having to employ that really is impacting active scare, especially in those rural areas. And so we want to do everything that you can to make sure that they feel supported and that that comes down in a lot of cases to fund it. And so we would encourage you as legislators to consider additional funding opportunities for nursing students, loan forgiveness opportunities, potentially incentives for hospitals to be unteaching for everyone. Those are just the options to think about if you want to get that workforce out into the rural areas. There are a couple of recommendations that came out of the governor's statewide health care workforce commission that have not yet been implemented that we would still be one of them as a quick starter patterning for clinical staff. This is very similar to what happens in the state at big new industry kind of state of Georgia. And you need to train a lot of people very closely. But you could do that for the NA, certain other clinical providers that are lower level, but it fits our arm in. It would be incredibly helpful. And for me, they have a scope of practice to match that. So that's an option. And burns a learner's scholarship, burns a learn program that these clinical providers can work while they're in school and go ahead and earn a wage while they're continuing to get that training. And then again, we mentioned scholarships and loans for gifted. When asked what clinicians are hospitals need, the number one answer is that I've never said after that, and it's the ally health professional. They're asking for a CRNA specifically. They're asking for medical technology, medical lab technology, little auto-men. So they forget all the anti-inflammatory services that we need to be able to offer to danger of hospital care, inpatient, professional, etc. And then food services, environmental services, things that are not clinical in nature, but are in dual health hospital operations. So this is a challenge. I'm doing a couple of recommendations and I'm happy to have you. Thank you. Just one quick one. I just a couple days ago, we're at an article about a big study that more than half a million RNs are projected to leave a profession in four years, not just change jobs or their position, but it seems to be understaffing as a contributor and also far now, which is like with understaffing. Did you all have any specific recommendations regarding that? It's really a double-aged sword because the problem is also kind of the solution, right? So we we do see a lot of nurses retiring. It's a lot of people that have earned out this to them. There have been some more out challenges for some of our hospital staff as well when they have to work alongside staffing agency staff who come from our state and they may not necessarily be familiar with the hospital's EMR or the hospital's throat health procedures, instead of the in-house nurses are having to then train the agency staff, which are inherently making more than they are. And so we are continuing at the hospital level to try to listen to our nurses, try to make them feel important and try to make sure they understand how valuable they are to the organization. But I think the question that you're asking, how does those hand in hand with the question of why are nurses that are graduating, going to other state and not staying here in Georgia? And then we have been nursing agencies and association-wide sites that are proactive on that. And so I do think that from the measured changes, to allow for the providers to operate in a more efficient way in the hospital thing in particular, it would be helpful. Just one for all, Mr. Truth. So in terms of retention of nurses that are already trained on the ventilon job, keeping them, I'm very interested in that and people who are nearing retirement, if you could find ways to convince them to hang in there for another two or three or five years, that might really help, this short call that we're trying to build a workforce thing, so whatever, are you guys working on that at all? The hospitals are doing kind of their own things in the vigil and what we're finding is that for each facility is a little bit of a different approach. But I do think for those nurses that are nearing retirement, they have such a wealth of knowledge. And so even having them have the ability to partake that at the facility to train new nurses, it's really helpful, I think, to keep them in the workforce for a couple of years on their own part of knowledge on the next generation nurses. We are open to projections in the journey. I know many of the hospitals are asking their nurses through nurse's second committee, the center of what does it mean, how can we help you? But it's carrying life ability. So if you speak about people bridging the gap by having staffing agencies come in to encourage the gap, can you talk to me about what's the difference? Is it simply pay? Because obviously, if you have a staffing agency, there's able staff over the hospital, that means that person has relocated when they're a single calendar for months and time, but they're living in rural Georgia. So you overcome that hurdle. Is it just because they're getting paid well money that they're willing to work in those places? Is that a bet to get? You know, that's a good question and we've asked ourselves that same question over and over. I think that there are different generations of workforce now that life's the ability to have a 12-week contract, it does some work. I mean, it's exciting to travel, exciting to see new places. And you know, I'll add to that that it's really in front of a experience to see those different types of abilities from a nurse perspective. When they do go to a community under contracts, they're often living in a long-term housing, which is a part of their contract. If they're payage, narrowly, two to three times that of the directly employed nurse. And so the hospitals just simply can't be dealt with that. Now, I'll say that what we're paying from a hospital perspective to the agency is more than what the nurse that is getting itself. So there is, there's an overhead there. It's a significant overhead. But it does sometimes be 3. So the nurse has done a sales then. How much more are they getting? Like, what is there to take on? Okay, so K is a settle. This is my hospital where I work nurse. And I and the I will end the very 12-weeks nurse. What's our defense of take on? Okay. It's going to depend on the hard level of education. How long should benefit the ability? But generally speaking, I'm going to say at least double. And I'm not paying for house I'm interested. Here we go. I have a panel. So I'm following a question. So a number of the hospitals have been told that have multiple locations, right? So if you work in FEMA, if you work in Atlanta, if you work here, are there shared networks? So there's just that you know, get to have the travel experience by staying within the state of Georgia. Is that something that we do? I think some of our hospitals, especially the time, like, they're meeting with that to be if they're, you know, they're saying, um, back or willing to do that. I don't know how well that's working. I don't have any dead homes, data or our story back and looking back. So that's how we're going to do that. One thing you said is the bedside nurses, number one, that each all are looking for. What do you see? Is I guess an issue that not been able to get a number of nurses to the hospital, that you need is in a recruitment education. I guess what would you suggest us looking to help solve that? The Georgia San Juan in the Albuquerque Act. So every day, I'm trying to deal with the problem right now. First, I promise they're not enough people to do it. And so we find a way to practice a more people to get people interested in providing some of the care to get people interested in the bedside nurse. And one, number two, we have to make sure that our school has a proportion to be able to increase their pathology and that they have the ability to hire faculty and pay faculty so they can accommodate those pathology. But I'll add that one of the issues in not having enough staff we talked about that in closure. When bedside has to close on an inpatient basis, it means that patients who are in the emergency department can't be admitted because those beds are not everything. Which means that our EMF workers who are bringing a new emergency patient for standing there, waiting for an emergency department to open, which means that there's not an ambulance avenue to respond to the additional hall. First thing that's same work for challenges in nursing home, which delays our ability to discharge the situation. So the workforce shortage is impacting all of health care, face-to-face, um, thank you, and here, and it's creating to know all of that, that I think has many of the nursing family are overwhelmed and feeling a little bit hopeless, frankly, that if there's just no infant, I think so we've got to have more body. Earlier, something that's been about Andrew's health, how they're occurring from law school. Is that a unique thing that school to do in case of my questions as you hold? Right now, in the state of Georgia, the number of nursing programs are they full? It might actually be what they are full. We need more to be trained. I think there's also delay in the licensure process, like there are in the many but other licensure processes, etc. There is an amazing delay in the spot, but I think that we have an issue not too long ago with nurses, um, who were trained up by the United States, who had, um, actually not thinking the name of life. So they have what was not a valid license, and a couple of those kind of rooms in Georgia and so we're trying to sit through those new applications to make sure that they are in fact valid, they take the name of life, etc. So there are some challenges at the nursing board level for things like that, the candidate, the volunteer, and it's helpful for nurses to have that interstate life. Because the professional care agent can stack it easier to use them in and have them get a job and work in an hospital. The way of licensing from graduation, from nursing school, the regular license for a company on one stage or another is just costable. I think it's better. Okay. You want to start? I just want to follow up. I'm just about the big start for the room. You say more about that. How quickly and theory can we get, I don't know, a bedside nurse, since that's going to be one of our, I'm not going to share, how quickly can we get a bedside nurse that's large? So I don't, from an RN perspective, I don't think about something that you can act with, but for an LPN, we've got somebody that helps nurses with one patient's practical button, or helping them with tasks that they need help with in their room. That would be my factor. And it would certainly help free at nurses that they can be more in the right patient care and in patient care. So again, is one, 30, 30, you're asking a quick break and we'll start back at 1.25. Sorry. Sorry. You know, you know, you you you you you\n\nyou you you you you you you you you you you you you you you you you you we can second thank you committee I will read the you That's the ceremony where everybody gets their white permanent conditioning for the digital profession. We had 264 students and that's in front of the picture. We didn't do the white club ceremony there, the picture is the old medical college, that was back at the 18th or 13th. So we've got great history and great tradition now. Thank you. So I think most of you know this is from our Georgia board for healthcare workforce and everything that's really yellow and blue is short, short of positions. These are primary care physicians. Dr. you've heard from anesthesiology and Dr. Stepnamala. There's also a short of specialists, but typically anesthesiologist and neurologist, etc. But we'll focus initially on primary care physicians. You can see how many counties don't have an OB-2IN, 82 or in half the counties. We rank, I think, 49 in the country and maternal mortality, I think only Louisiana is higher. So we have a lot of colleagues with health outcomes, particularly stout Georgia, but really all of Georgia. And as you can see, there's early accounting that isn't short in some way. Next slide. And MCG is all over the state. We can say Georgia is our campus. All those white dots. Because we have medical students rotating. Also we're literally all four corners of the state. We're Atlanta. We're in, you know, the Southeast campus, Savannah and Brunswick. Southwest is all many. We have students all over the Southwest and the North Bay of Rome and Dalton. We have an atmosphere of campus with UGA. And then we call this here in the Middle East. We have a lab here in the Middle East. I thought we're out in the Middle East right now. But we have students all over these areas. So we have 200 and four students that do all four years here and 60 and happens. And students in Savannah will have 40 students there. So medical school is like trading five or five. It takes a long time. Fortunately, we have really good applicants of the medical school. We get really good ingredients. Next slide. So we can probably change our curriculum in 2019 to 2020. Unfortunately, the pandemic has changed our curriculum. We didn't plan it that way. So our students went through a little bit of turmoil. So we changed our medical school to basically be done in three years instead of traditional work. You know our friends at the first are having three or medical school. But all of our students can potentially finish in three years. And the ones that do and want to go into residency will be pathway one. They could do a residency, but they have to do it in short. And I'll get to why that's so important. Other students that maybe want to go and work for the surgery and see theology or when neurology will probably take the advanced residency proper. They spend their fourth year doing enrichment days. Elected time, you get a dual degree, you get a master's business administration, you get a master's diploma, or you can do research. So there's a lot of options. So there's a lot. This is like a restaurant with a great menu. So many things to do. It would really have to counsel and the direct our students early. What do you think you want to do? And then there's some elective choices. You kind of have to guide them next slide. So that is a very innovative curriculum. So thank to the Georgia Legislative, the Senate and the House, Governor Camp, and all of you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. I'm doing a job here at the Hollywood at anytime long to give him the holidays in December off. So it's pretty much straight through. And we've had our third class. The third class, we just have nine of them that are down at the bottom, excuse me, eight of. And I can't count nine. The previous year's we've had about six per year. So these students in the first year of medical school, we go through a rigorous interview process, and decide if they want to practice an under-certed Georgia. to serve Georgia because the deal is, well pay your tuition scholarship or service, if you do your residency in Georgia, and then you practice two years, you get two years of tuition in an underserved area, but there's a lot underserved areas, but that's the deal here. And it's really, really important is we are a net exporter of medical services. And so I'll get to the end, and we have a shortage of residents in slats, so we educate medical students, we do a really good job educating them, and then they go to Harvard or Stanford, that's great, but we want more of the state here, where they go there, come back. So this keeps them here, because they do their residency here, and they got to practice. Or how many years? Or as many years as they get scholarship, and presently they get two years of scholarship, so there'll be two years in underserved Georgia. When we get this bigger this town, and we can maybe enroll people in the program at admissions, we could do three years, you know, but right now it's two years. And thanks to the state of Georgia, we got a $5.2 million gift from the sentient, each state health, years back. You guys match that, and then you match that the next year in our foundation paper, and that will continue to get gifts, so then you have a state match. So we now have an endowment to do about 25 in experience, you know, every year, forever. Trip on back, a firm that does economic analysis said, for every dollar you put in this program, this is a third party, it's not us. You get $70.50 back, you know, to the economy of Georgia and such, it doesn't go to us, it doesn't go to the doctors, it just goes to society and the state, by, you know, avoiding complex care, avoiding people going to the hospital, etc. So it's a huge return investment. Thank you, thank you, thank you. So in our third year, Eric Lezista, director of the program, she's an OB-GYN, and they get to choose from the following specialties. Primary care is to find very broadly, by the Georgia Department of Healthcare Workforce, it's almost everything, the work of ethics and anesthesiology are off, but it's family medicine, internal medicine, pediatrics, OB-GYN, general surgery, psychiatry, emergency medicine, but Dr. Milo will love it to be anesthesiology, he's got a good argument for it. So in the future, we can expand it because there's shortages and specialists in this state, because there's shortages in every country. Next slide. And here's our first graduate student, now in residency here. Here's our first five years of program that we've programed a few years ago. Clawed over there on the left, there's some Columbus, the Lezista's from Techton. And so that's just an example. They're doing very, very well. They're in our residency, so we keep track of them close, track them. And so these students will be out anywhere from three to five years. So residency is anywhere from three to five years. So it does take a while for these students to get out there. Next slide. But it's the way to keep these one-door. So we have a very large medical school for the ninth largest in the United States. How can we do that? Because we use the whole state. All right, we have a partnership campus with UJN Act, and that's 60 students to four years. 204 here. And next year, we're gonna have 40 units of them. So we're gonna have another partnership campus. But that's the growth of our medical school there. So most medical schools are, you know, about 150 students, 160, we're large. You know, we have to be because sort of this population's growing, growing very fast. Next slide. And so here's our, we have a very strong relationship with St. Joe's family. What we do is try to get relationships with healthists. That's the most important thing. So Paul Henshey, who I think, I don't think I'm wrong on this better fact check, is the longest range, continuous-reading CEO in Georgia. And we became friends in a different way until we developed health strokes and in Savannah. And Dr. Michael is an MCG graduate. And she's the CMO there. So we had students there for about 12 to 13 years rotating at Camer Hospital in St. Joe's Hospital. It's a popular place. You know, it's kind of like on a Savannah. But when they're at Savannah, don't think they're not in the rural areas. They go out to St. Joe's, they go to a lot of rural counties and rural practices. They go to Liberty County, they go down to Brunswick, they've got a Camden, Georgia, they just saw South and being getting Georgia. So they're literally all over the state. So this has been a great relationship. And we're really thanks St. Joe's Camden. It works so well that Paul Henshie would always see you and say, when are you gonna have before your medical school? And I said, well, you know, let's just think about it. So we kind of talked about this for a number of years. Next slide. And then this past year, thanks to Chancellor Perdue, and Governor Ken Speaker Burns for Travis, the General Assembly, all of you, you have through $1.7 million to renovate on the Armstrong campus of Georgia, Savannah, just so happens. This worked out really well. St. Joseph's hospital is right across the street from the Armstrong campus of Georgia Southern University. And on the Georgia Southern University, they built this beautiful school there of health professions. They're not actually has some capacity, but there's training nurses there, they're training now. They're gonna be trained pays or not yet for government. Occupational families visible therapists, they went down there, we talked to their president, Cal Marrero, we talked to their provost, and they were very, very gracious, and you can have this space. So without having to build a big building, this is a really economical way to build a medical school, $1.7 million. We did some renovations, from some of the four new students down there in July. Okay, we already have the third and fourth years figured out. So it's been putting that first couple of years now, when we compressed our medical school, medical school, you remember Dr. Kilpatrick, you probably spent two years, that's what I did. Now it's 18 months. So again, you just go straight through to 18 months, but it makes the curriculum very exploitive. So we're hiring some faculty there, getting some Georgia Southern faculty, and we have a lot of physician faculty at St. Joe's Canward. So this is really an ideal situation about a conventional campus. And the students love this campus because there's, you know, here we have kind of a food desert, if I can say that, we need to send a lot of food options. But Georgia's Southern, there's a Starbucks, a Chick-fil-A, and a Southern cafeteria, a kitchen in the Bronx, and there's parking, and a bunny house, and a city's savagre. I mean, which I can go to medical school again. Next slide. All right, so this is one of the things you have to be aware of. So I think, you know, the medical school is here, we all collaborate. I think we do a pretty good job putting out medical schools. But the trouble is we export them because we don't have enough residence to slice. So this is a huge problem. This is a real big problem. So if you look at this slide, and this is the shallow enough, so I can't even see that happens, this becomes an expert in dreaming. The state has done a lot in the border regions, try to increase the number of residents. But look where we run. You know, I hate when Georgia's always 41 and below. And that's where we are. Where we are 41 in 2010. We increase the number of GME slots that the population grew that we didn't really catch on the remaining 40. And so we export as soon as the South Carolina for our Alabama everywhere. I mean, so that's a real problem. And the problem, GME is complicated. There's cats. So the federal government cats the number of positions we have. So Emory and us, we could really love to expand with cats at a certain number. So any residence we increase the health system, or somebody else that they got. So there's some ideas we have. We could talk about later about what we could do with that. Florida has a program where they pay the hospitals certain amount of money to have an increase the number of residents. But this is a problem. But the great committee, we increase the number of slots and in Northeast Georgia, they don't great job increase the slots of people that do the works of in Havishin. And well starts increase the number of slots. And there's been some other small increases. But you know, building a residence that's complicated and expensive. And a lot of hospitals aren't ready to do it. It's really hard to develop a new anesthesiology, right? That takes a tremendous amount. So most of the new residents that have been developed, our family medicine, internal medicine, we need that, but we can't forget about all the other illnesses. OBGYN has been proven difficult. Psychiatry, you know all the mental health to it, really, really difficult. So those are some of our problems. Next slide. So here's just to tell you about, we have a great GAB program here in the talk to Savings thing, we call it a DIO designated institutional official. We have 51 ACGV approved programs. We have about 518 residents. Now the good news is the federal government did allow for the Consolidate of Opioations after 2021 for you to apply for a residency above the cat. So we applied and we got 2.44 positions. So that's not a lot. But there's only 1,000 for the whole country for year. So if you pick at a 50 states, you know, that's not many of the around. So at least they got some, so it's the least a step in the right direction. But we really have to do something more about that. So the state has to decide who you want to be. Petsy consider GMA. We're going to produce a lot of medical students. They're going to do a residency up in the Northeast. They're going to marry somebody up here and they're going to talk about the physical health. Now, many have happened. That's not going to be sure if we call them. No, that's yours. That's New Jersey. Right, right. No, that's the problem. So more we can keep in the state the better. Next slide. We've got to just, the question's, hey, I want to thank you for what you've done for undergraduate medical education in GMA. Thank you for expanding the medical college in Georgia. I think all the medical school is grateful for what you did. But we got to tackle GMA. And we've got to tackle this problem we're getting. So even when we get these positions out, there's a lot of these places that position doesn't. It's hard to get doctors to stay there. So we got to think of more creative ways of keeping doctors there because we don't want to all lead after they've been, hopefully I do their commitment, they'll sort of family, they'll be happy there and they'll stay. So back when you showed the map at the beginning of where all of your students are, I didn't see any around Columbus area. Yeah, go back to the side. That's a good question. We actually have students in Columbus, but because Mercer and Morehouse develop campuses there, we kind of don't want to override it. But there is that one way, thought I think that's must be counted. I don't have this hand, this list on here, but we do have some scogee, excuse me, how can you be sure to do my accent's terrible? But we do have some students there. You do have some students there, but we try to, you know, since the Mercer's got a campus there, we've decided to go down to Morehouse Albany and Thomas Phil and Tipton, where most of the competition and Thomas will support us today, so they're, you know, even coming above the border. But all of them, if you've been a great partner for us, and we've had students there, as you can see when we're in these cities, we're all over, we're all in those white dots, we're all over, and some of the smallest towns. So there's evidence to show that if you have a regional campus, students, students trained at a regional campus, they're all like a practice. We have a lot of hand-written, you know, regional campuses is only 10, 15 years old, so it takes a lot of your data. But we have a lot of anecdotal data that it does work. So a path to federal cap, that's the ACCGME. Yeah. And that's not really a governmental, as you see, is it, or is it kind of cloud-solid? The ACCGME is not a government agency. It's kind of like the LCME, the credit, credit's resonance. But the CMS funds most of the residency positions, you see the Medicare or Medicaid, which are Medicaid funds quite a bit. And then, you know, we have some military people that train here to get funding from them, but our cap, so we have a cap about 300, all right? That's about our cap. And the total with the cap is, they broke us. That's for the state. The Dr. Sper MCG. How just fine. Yeah, we're about 399.300. And we were frozen at 1996 levels in the balanced budget act. So our costs will low. So what we pay, what we get from the federal government is low. Now, we do not get many positions, but the cost we get for position is pretty well. So if you're a newer program, if you're a newer program, let's say you're northeast Georgia, you're starting a new program. We call that a virgin program. They never have residence before. They have five years to run up their numbers, they play a new cap. So the Milgate cap had five years. So after five years of his frozen. So in the population, of course, moved staff, but the GME positions didn't move with them. And so it's going to be very, very difficult to get the federal government to change that. And there's been a lot of move. The El Medicare funds, GME, should they fund it? You know, why doesn't the problem ensure something? You can ask, there's a lot of things you could ask, but it's all Medicare and Medicaid that funds it. So that's been, you know, there's been a lot of fake tax that have looked at GME. Is this the best way to fund it? And most of them say Medicare is not the best way, but they don't have a solution. So it's a problem without a national solution. But the state is the potential to kick in and help. So the state of Georgia could do something like to say to Florida those. Now, we can look at some other models. California's done some things. Florida's done some things. Good Florida. Bring it to us. Bring it to us. We'd be happy to bring it to Florida. Yeah, Florida's gonna close and they've done it. They've done a really good job. It said Florida roughly just pays, but look for shorted and doesn't they'll pay a hospital, say, $100,000 to train a resident. That's roughly what it costs to train a resident. When you look at salary benefits and then the educational support you need. So if you, you know, it sounds like a lot of money. It is. Well, I'd like that. I think she would like it to go. That's it. Yeah, you can be looking at long term, you know, look at the return of the rest of it. But $100,000, you know, you could pay, I'm sure, step a mile would be willing. You know, you pay it in $100,000, and the hospital and then you can hire more residents. Because right now when we do something, we're over the cap. So the host system has to continue to pick it up or somebody has to. And, and, and, Florida's got a huge Medicare population. Yes. That's a factor in how they're have financial. Well, it's, that's probably some of it. They also have a lot more cities with a lot more academic medical. So the other problem here is Georgia only has two academic medical systems. We got Ameri and us. Those are really the only two academic medical centers you can train, specialize residents. You look at, look at the state of our population. Ohio. They have, you probably five or six the way you can. And then they got a high of the state. They got Cincinnati. They got Case Western. They got Cleveland Clinic. They got Toledo. So they have a lot more positions and a lot more things that historically were funded. So here, again, it's a victim of circumstances. We're growing fast. We don't have a lot of academic medical. As frozen in time. Yeah. Yeah. Yeah. I'm sorry, the lights are nice and nice. Yeah. Yeah. You're exactly right. This fact in 1997 and then they throughout the St. Solid Act, we got 2.44. And we're clapping, but that's a drop in the book. Right. So. If you were to look at it, I guess, obviously, there's a shortage of health care professionals in the middle of your early shortage process today. You were to look at the, I guess, the formula from getting someone from high schools that get in that way where it's a slumbering position. How about a licensed position? Where's the, I guess, the limiting reagent here? Where is the monthly reactant? Where is it? The number of students that could be trained in Georgia is the number of residencies. We're just looking at positions right now. Where would you see the most needs of, I guess, open up more slots or pay the most attention to help grow the number of positions Yeah, well pipeline programs are important. We have a pipeline program seeking those back home in through near as most have disadvantaged populations. But there's a long way for that. So pipeline programs, you have to probably start in the end.\n\nmiddle school, right? But in quite a way, the biggest bad for up would be GMA, because right now, when we listen to so many medical students that go out of this day, or GMA opportunities, right? So I think creating more GME programs is the fastest way. And that's what kind of forwardings other states learn. In fact, you know, you can get a good GME program, you bring people in and you say a lot of time. And so the George Report for Healthcare Workforce has statistic, and there roughly is, Margin Miller can correct me if I'm wrong, I think if you go to medical school here, you're chance to stay in Georgia, it's about 30 to 35 percent long-term. If you do, your undergraduate and GME in Georgia goes at about seven percent. So that's what you got to do. You need more GME slides. And have to be good GME slides, because our students, I'd say our students, we get great ingredients, as to the other medical schools in Georgia. They know it. And you know, don't forget, some of these people grew up in Georgia, went to UGA or Georgia Tech, and then they went to MCG. They just want to change. There's something wrong with that. But then we got to bring them back. And we got to think about how to bring them back. Do we have enough residency programs, and do you think you have enough slots at medical schools to train the workforce? I think we need more slack than medical school. But I think we've got to combine, we also have to have more GME slides. If we just create more medical school slides, like we're behind in the nation, but we're worse probably GME is just bad. And so if you don't do them in tandem in parallel, you know, what you could do is just send more kids out of state. You know, I think this each day scar program is going to help. And when that's finally mature, we want to have 30 to 50 students. And I don't help. I'll start making a difference. But we need more than that. Definitely more than that. Two questions. One, what does limit that? Why is that program able to start with first year? Why can't I see the sign in role as each of the scholars? There we go. They're first year, right? So they graduate from UGA and they apply to the I'm staying in answer behind you. That's a really good question. We're smart enough picking them out as well. We're trying to find out we get the first year to see one again in medical school. And first of all, they have to know kind of what they want to get into. When they come to medical school, if they decide they want to do orthopedic surgery or neurosurgery, you know, then they have to say, so we have we have all frames and honorats to get on. But we're not quite sure yet how to, we don't have a lot of people dropping out. So they thought it would be safest to wait the first year, go to an interview process, let them get used to medical school, really see what they wanted to do. Maybe in the future we'll be smart enough to be able to do that. And it's going to be in one especially. But chances follow. It's a little difficult when you are in medical school. You don't get into your clinical rotation until you're really a couple years in. First two years, so mostly lectures who have surround stuff. So you don't get a sense. And there's sort of a fork in the road that clinical students get medical school. You're either a procedural surgical hands-on type person or you're more of a thinker or cognitive person on the hands-on case. But that part you figure out. So where that takes you, you don't figure out to later. But it's very hard to do the first two years because you're not really around patients. We open up to more specialties. You could take them in a row. So that people work on it's kind of potentially open up to more specialties. My second question. One of the proposals that we received earlier this morning talked about students who don't match. And so I'm curious how many students that are graduating, either not matching. And then one of the proposals was that have basically this kind of intermediate life syndrome where they can practice more in year or so until they've matched somewhere else. Yeah. How does that reach you? So a really, really small number is usually a couple, two or three. And usually there are often people that want a certain really competitive specialties like Dr. Kropatric, special orthopedic surgery, dermatology. So sometimes the students don't want to do that. So they they'll do an extra year of research or some of them prepare for it. So it's such a small number. I'm not sure it's worth having a program for it. But you know, it's a good question. I've been able to license at that point. I mean, yeah. But you know, once you get through a day, yeah, you have a license, but it's hard to get really can't practice with our king of raps. On other evidence. So generally what they do is a year of research or tuning up or but it's a really small number. So thank you. Thank you. All right. Thank you. Thank you. All right. Next we have Shannon Broxton. I think it's actually Dean Carvall. What is it? Oh, okay. It's just. Yeah. Go ahead. They switched. Sort of. You want to switch? Yes. Okay. All right. John. I'm fine. Well, I. Exactly. Good afternoon. I'm very nice to see all of you. And thanks for coming over. Good luck, jumping. Okay, can we go right through the first slide? Because of the well, it's not. I wanted to just first of all, let me start by singing a college valile health science. Let's create it about 55 years ago. And the purpose that we were created for was really to support the positions and nurses here at Augustine University in college was actually created really at that point by positions to actually build and fill all the health professional programs or skills that they did not have or could not do position. Next slide, please. And so we are 55 years old this year and we are made of seven undergraduate programs right now. And we are going to have seven graduate programs soon because we have a new program on the way that I will probably about. So we are a college that absolutely supports the work of great our great colleagues in nursing and our great colleagues in their. For example, one of our undergraduate programs, clinical advocacy or science, you know, the nursing and position for the work that they're doing they can't do the lab work. You can't take the specimen, you can't draw the specimen, then take them to the lab, and then analyze for glucose, analyze for cholesterol. General Hyde, you can get another one of our profession. Thank God. I don't know about you guys, but you know for my my dentists, I've had the same dentist for about 15 years, maybe he spent an hour in my mouth. But dental hydrates has spent hours and hours. Very important to have dental hydrates. Health Information Administration, a program that is struggling for us right now. But it is absolutely the kind of information that helps the automation needs to be able to tie a clinical information with coding and all of the gram of the patients around churn and pavement. Very important for health information. Health Services, the new undergraduate program that we have right now, has 208 degree students painted actually. So it's one of our biggest programs right now. Newfluencent technology, another program if you ever had a gastric emptying study or a cardiovascular stress test you would have worked with the newfluencent technology. Radiation therapy is another undergraduate program, which of course, the program who is going to administer the radiation patients when someone has has cancer, certainly the nurse is not going to administer that radiation. The position is not for that radiation. Verifluencent is one to do that. And then of course we can all find out how important keeping an airway open during coding and those in my respiratory therapy professional that we must have in the ICU and in the emergency books. The next slide please. My graduate programs are very proud of our medical illustration program. I'll show you a few slides on that later, but our nutrition program. And then we kind of have the three are three very highly sought after graduate programs, which is Occupation Therapy, Position Assistant and Physical Therapy. Then we have a graduate program, actually clinical laboratory, some hands in the program that we have coming in fall 2025, his speech and language for colleges. We hope to have our first school for the students. We can actually really start and reset those students by fall of next year to enter and follow and fall to their first. So y'all next slide and actually, we can go to the next slide. Okay, thank you. So this is probably the most important slide that I have in here for you all to see. And actually this is the number of job openings and job postings for allied health professions in Georgia and South Carolina. I'm going to project it and we'll openings. And then in the last 12 months, the number of postings you see there for allied health junctions. And as you can see, that allied health junctions are going to be needed in Georgia and in South Carolina. And this is just for this forum, you know, annually coming up. But you can see how hard these jobs are to fill from the number of postings and but compared to the number of openings that are. So they are very hard to fill out. Now we have students who of course are all over Georgia and in every county of Georgia and all of our our profession. So what I want it you all to see about this slide is how important it is to have health health professional program and what we are doing for Georgia in South Carolina. And you go back to the previous slide. And so these are our graduates over the last five years. So you can see the numbers of graduates and we aren't talking huge numbers of graduates with the number of openings that they have. And that's one thing that I think will be important for you all understand. Just like Dr. Hes is talking about the complications of accreditation and federal regulation over his program. I have the same complications with clinical finding clinical provide for my student who has the same complications with accreditation for our program. All of our programs also have internships that are associated with them. For those students are out in hospital learning how to how to apply their profession. And there are always a limited factor that we can have the kids to be in same schools in addition to hospitals. So and certainly as I continue to talk I want to show you maybe some areas that I think that we could probably grow in but I also want to talk a little bit about the limited factor. So you can go to the next slide. All right clinical laboratory science. What I wanted to bring so these are actually called these these slicks. I thought it would be good for you guys to see how we what we take out with us to recruit students. And you will see for our bachelor's program and in clinical laboratory science we only get about 39 applicants a year for that program. Our co-points about 28 students and you'll see at the bottom of the slide you'll see average pay and what we think will be the job market growth from the Bureau of the English such as the pro-group and the pro-group and positions and clinical after-site. There is a central thing for undergraduate programs that I want you to see and if you would forgive me for those programs are not the sexy programs that I have at graduate school that have bigger salaries that people really are graduating to. All right so these high-at-these needed professions are not because honestly they are really hard science. Clinical laboratory science is hard science and so we need people who are interested in that. So applicant numbers are small and we are recruiting all over Georgia. We have a very expensive digital campaign where we're recruiting trying hit students to come into these health professions and you can see how much they are needed all over Georgia. Next on head play. Our master's degree program so clinical laboratory science is a program where we have a bachelor's degree as well as a master's degree. We also have a distance cohort of these students in law and skills Georgia as well. So we are training students in two sites for our clinical laboratory science program. It's the 19 applicants for our master's degree program and what we develop the master's degree program we develop it because they relax of biology majors who had no place to go. They're a chemistry major who had no place to go. So we develop our master and we have been able to get some recruitment in the program. Next on head. So you have questions. How does it work on how low that plays? Not and that's one of the issues. Part of the last that you get paid there. You're going to get paid the same as the people who get a bachelor's degree because there's no differentiation. Next slide please. Dental hygiene about 61 applicants last year we have 6 to 56 total enrollment and you can see dental hygiene pays a little bit better than one of lack of a sign but they're needed. 18% growth market growth. Very much needed. Next on health information administration market growth is 1527 total enrollment right now. 30 applicants again. One of the issues with health informatics is that it's still relatively hard sign. People have to have anatomy and physiology. They have to have anatomy and physiology and anatomy and anatomy and anatomy and anatomy and anatomy and anatomy and anatomy and anatomy. So people are not gravitating to that as they were used to and so the numbers are speaking to that right now. Next slide. Technology is also a program that is struggling and then I apologize and don't have all the data for that program on that slide yet. There is enough we have a distance program for that one also in law enforcement. So there are two cohorts are those students and they're training students in law and still learning it. So the two that you can't hear are both run by the nursing university. Both run by the university. So for our clinical lab for science program as well it is the campus faculty that are taking care of the most program. Next slide. Great Nation Therapy. Total enrollment is 19 right now. We have about 32 applicants 32 applicants of that program fairly robust. We have program again not sought after and it is one of those programs where the accreditorial is very strict requirement. For example if they go to a radiation therapy clinic if that clinic has two beam accelerators I can only want two students okay they have three beam accelerators then I can have two students. So many of our programs and that kind of restrictions put on them by accreditation by accreditation. Next slide. I'm respiratory therapy again found out how important that was during COVID 42 enrolled right now robust applicant number you know if you all have any ideas how I can increase those that but certainly if we are still going out professionals and actually since COVID our dental high records of children in the program attached to you and so we are the moment that rolling out applicants and you can see the salary for those folks there as well. So not high dollar salaries in any of these undergraduate programs but absolutely. Next slide. El services as a new program. El services is a program where all of our undergraduate programs students you typically are spending two years getting their prerequisites and they're core completed at the end of that two years they've applied to our undergraduate programs and then they come into the in they come into clinical laboratory science or respiratory therapy or you know or nuclear medicine. The students who don't make it into those other health potential programs the VSA just becomes a place where those students can lead to the work that we like to do so they they will have a degree in health services you know our bachelor's jobs available for them in health services and they are getting job as well but they are not traditional health professional. So they're not traditional health professional in that program but it is for all of our future health professionals and in the undergraduate programs all right and there are 283 of them enrolled right now program so we have a lot of students who are actually planning to either come to the health professional side or they will get that. So these are students who like don't get in the next school is that what you're saying? Never. These are just students that have it beside what kind of... No nursing has a whole other cohort I don't know what we need to be for their degree program they're actually in but they have a whole another cohort where their students who are pre nursing are in these really are students who are not who have no interest in their degree program. Next slide. Occupational therapy and one of our highly sought after graduate programs you know there's more competition in the state of the state of the Georgia state that just opened up a new program and so it has called a bit of a dip in our enrollment main strong and our students main strong in the occupation therapy program. Next slide. Physical therapy happened to remain very very strong with this therapy on salaries and this is a therapy of our quite time and even though I'm sorry that it's not up there either but it may be quite... That's what that answered. That's what I'm going to say. You've done it right. Next slide is our PA and you can see PAs hours are fairly underman-less. The job is going to be great typically we're having three to four hundred applicants for our PA program so the PA program is very hiring sought after program. Next slide. Just I wanted to just throw this in here just to make sure you know that state of language is coming, state of language there is a huge shortage of state of language pathologists all over Georgia and we want to be able to help do our part right now that there are only 250 seats in Georgia for state of language pathology education we're going to be adding about 44 more seats to that cohort until we both be earning big and tiny little therapists have our first plan and not that 4027 is what we were called for. So we are filled with this is going to be a very important program and I actually think it will also be a very high-risk sought after program. Next slide. We're very proud of our medical illustration program. There are only four in the country for accredited programs and in country it is a program that competes against John Tocken's all has the nearest program that's and I'm very proud of the work that we have stood up and answered how nine students as you can imagine very intense interactions from faculty or students so they're enrollment on that part of the multiple adventure and let's be able to do that. I want to put that back. So, Jessica, is there a whole lot of spread of the programs like this in the country? The country and one in Canada. Yeah, next slide. And as part of that we've got a robust training in our medical illustration in an anthology and in anthology. You can see the gentleman up here who had an eye missing. There's an artist in our program and there who was able to do this kind of work where she could sign his eyes, unsinvited eyes and then to look at the gentleman at the bottom of his class as an hit to the eye or even looking at my ear and you're giving the other talent to be missing. For static eye. Not a little bit of that. Yeah, so I have to delete. Next slide please. And that's it. No one can last me. I want to say if you could talk about the limiting factors for my program. I'm sorry. I don't have a problem with space as all the way to the issue. And so you saw that there were about 730 of so annual openings for TAAs every year. I mean, I am pretty much done with about 48 that I can admit every year. I mean, I would love to double that number and get new and but I can't do it in my current state. So space is all the limiting factor. Faculty also is there is a big limiting factor a lot of times. My faculty make more money in here in clinical and clinical position. Especially for TAA and PG and OT and it's very hard to convince those people that come over to this side of the phone. Clinical sites are all of this an issue for us sometimes many times. We were competing in the positions for kind of sites. TAA needs some positions. So those that come to the environment is for us. As you all saw from my undergraduate or net faculty numbers in the above. We're reaching the people who do not have a very robust digital campaign that we are recruiting all over the state. If it comes really difficult to reach a population. And then, okay. Okay, the new report is all of it. I have a question. Okay, I mean, that's it. But the Health Services Program, that seems incredibly important because when we were hiring people in Ohio because we're hiring people up the street who just finished all of them. And they went out a lot of funding, they're running on their job. So I think it's really valuable what you're doing. Do they, what are the prerequisites for that? So the Health Services is our only opening degree program. So for the other 13 programs, there is an admissions requirement for all of our programs. They are selected. Our Health Service Program is not selected. Students can declare that program when they come in. And that's why it has 200. One of the big things. Just one of our things, Jim. I'm curious about, we've grown a lot of money at the technical college system with regards to workforce, especially health care workers. I'm just wondering if you're interacting with them in any way with the technical college system. I, at one time, I had more interaction with the technical hall. I had much more robust recruiting that they have with some of the two-year schools. That was a lot of center here with some of you. I have much more of that. But many of those schools were combined with, for example, consolidated with other schools. And so when that happened for some of my planning grader programs, I know long-term recruit, we know long-term recruit at some of the places that we used to recruit. All right, that we used to have a very strong recruiting relationship. This seems like there'd be some value added there. Well, there was that when I could, you know, comfortable about recruiting. I mean, I'm not recruiting as I should with the two-year school. Let's say that. Because the public, the ones that I were recruiting with are going now. They're going now. All right, so. All right, we still have a lot of colleges who are doing programs. It's similar things. They're at one of the two. If there's cities in the community that we can use, how about this? I'm sure you're going to get to get all the British back out again. Well, maybe there is something that I have not looked at. Those two-year technical schools. That could be quite possible. Thank you very much. I can't come to this. I just think we're going to be a bit better. All right. Now. And then you can't tell me I'm going to close and you put me in the middle. People are like, I'm sort of, I'm going to put those things. I have faith in the world over all. You know, I don't want to spend $200. I'm going to put the person for you. They've been using the virus for a while or CD. I don't know. I don't know. They've got on their mind too. They're a couple of hours. Okay. Thank you, Brian. You thank you, Chairman. Go ahead. Thank you for the rights of your attention. We started the day together. I'm excited. We ended the day together. When you go to concerts, you have open an accident. So I was been planning all day. I was going to close or I was quite intimidated. But then thought that having the opportunity to not close will be good. And then when I had it, I was like, not really. I'm just going to be so good. You know, they share what everybody's share what information today. So I pardon you. Pardon me for anyone done that. See, you don't exactly know what you're what you're going to get with everyone's presentation. But maybe the more times we hear it, the more time little stick. So I'm Shannon Brostin. I'm a nurse in S.S. by trade. I am born and raised here in Augusta and spend the last, oh, you're welcome. 23 years being a nurse. And the last 13 years of that, I've been on nursing that's it's the last 10 years of that. I've been an instructor in nursing and senior program. Well, after your associate professor since 2018, I've been programming you. So I prefer literally sharing a couple of things with you guys about our college in general. There's just a few slots here. Just to discuss, you know, our mission, our vision and how we see ourselves fitting into the crises we're seeing across the state. So these are our mission and vision and the decision. What it says is that our goal is to provide quality, health care professionals in the nursing field across all those from the entry-level nurse, B.S. and prepared all the way up to the doctoral pair. So like, like the others that came before me who are leaders in the college, and she reported about accreditation, we certainly have those same situations here. We are under the governance of the joint board of nursing. We are sacks accredited. We are CCD accredited. And we are accredited under a special accreditation body that specifically only accreteds CRNA training. So this is a little bit of a busy slot. Any act, three departments in the college in nursing, and one of them is the Department of Prelicence of Programs. And under that, we have an accelerated B.S.M. program. We have a traditional B.S.M. program. And we have what we call the clinical nursing year, which is an MSN. It's still an entry-level into nursing. Because these are for folks kind of like you would be too, with me, Brett Lowe, who said, you know, I really wanted to grant sociology, or maybe in the rest of the day, that there are a lot of rest of the sort of therapists that have a career, and then they interact with nurses, and then they make a decision like they want to go into nursing schools. That's our prelicence of program, the department, I'm sorry. And then they have a department of B.S.B. programs, and there are seven programs in there. This is where APR is on. It's called DNP, and I want to kind of explain you what that is. There's different types of doctoral preparation that you can get across this, and you're saying you have a choice of DNP or APHG. So everybody's familiar with what a PhD is. The DNP is, it's a clinical doctorate. So these folks have to go in and do their typical extent of their clinical training.\n\nwhen they're not back to preparation, while completing their doctoral project and doctoral preparation, you know, multiple processes that they have to take to that. And what that helps them do, they do deep jobs and systems like micro macro and meso-lovel and looking at problems and healthcare being a part of that solution. By the way, I like to explain to my students is you have wonderful PhD researchers that go out there that are creating new clinical knowledge in the B&P provider is a bridge that closes the gap between clinical findings and research and actual clinical findings. So then in our department of nursing we have our doctorate loss to be a nurse like the SLAM. So we are known as Dordis-Laxxia nursing school. Back in 1913, we were the first state Dordis state and nationally accredited at the Lorient nursing program and that was actually in the UGA campus for adults. And then later on it actually became tucked under MCG, MCG here on this campus, it became part of one of their programs. And then many, many, many years later we went into some name changes and now we are a guest viewers. We've read a book here that's 2000 versus and they've been there 80 years that we've been doing this kind of business. And we produce about 400 graduates annually just in our BSN and MSN programs. And then we have probably close to 110 doctoral degrees, maybe more than that, maybe close to 115 doctoral degrees. So looking ahead, what are things that the college nursing can offer or growth potential that we have? One is for the growth potential in Athens. We just go completely and really nice remodel of our satellite campus in Athens as MCG kind of highlighted with an ethnic misal infographic, and where it was a word in the state. What I can say is that we have one satellite campus from the college nursing. That is in Athens and we do pre-licensed nursing training there and some of the other types of being future nursing. We do have growth potential in Athens. We recruit a lot of nurses from Athens and they want to be in that same area, both the EDA. The other thing is just to increase enrollment initiatives across program. There's been a goal of private appeals to increase enrollment by 2030. And we've been moving in that direction. All the programs to see growth from some of them exponentially over the last several years. But we suffer the same kind of issues that others in health care suffer as funding for faculty and concepts. If you think about it, it's a little bit of a trickle down fact. If you have a shortage of nurses, you have a shortage of nurses at training lunches. So it's a pretty bad negative thing, faculty. One of the things that we're looking at moving forward would be the addition of the B&P nursing and with-reprogrammed. It's going to take a little bit of effort to get that all off the ground. But we know that the George's and dire need of increased access to health care, especially in that population. And then we're explored and also stored on mask different qualities. Yes. So a little bit more about that nursing with recurrent ground. There's over 70 counties in Wonder where there's OVG land providers. And there's a statewide crisis. We know that we are very low. Well, unless that's why unfortunately we're very, very high in the numbers of infant and the final mobility and mortality. So this program is going to go and live under the B&P program and the Department of the B&P programs. And just like the CRNA program, they carry their own special accreditation, which is what we got there. It's almost a year, but in the doctorate of nursing practice of nursing practice. Next. Some of the other gains, this is kind of a wrap-up slot that I want to share. Maybe just some pictures of nurses in action and training. One of the things that I wanted to share is I kind of alluded to some of the challenges we have as a college. One is faculty. You're kind of told when you come into academia that your salaries are not going to be administrative with what you make in clinical practice. The clinical practice salaries are escalating at a rate that USG has not been able to keep up with. So we can't recruit enough faculty to train more nurses. So one of the questions you might have is how do we train more nurses? We need more faculty. If we get more faculty, when we get better budget, we can get better some money. We can hire more faculty to maintain the faculty that we have, which is super important. Because we'd rather invest in the good people that we know instead of trying to find additional people. Right now we have about 55 full-time faculty and that's across all programs and that's considered with the consideration of that being somewhere between 900 and 1000 students. We have equal to that, maybe even a little bit more part-time faculty, but it's nice to have the full-time faculty have that engagement, have that commitment, and we have better outcomes when we're able to use the full-time faculty that we have. All right, so that has been my hour. All right, so my job today is in my capacity. It's the talk specifically to you about how we train CRNAs here at Augusta University. And the good news is, is that trickles right over to in-reviewed diversity. We have stuff that can be done in the university as well. So next slide. I do have a disclosure statement. I am a member of Georgia Association of Nursing Netsis. I'm also the president of the award relation. But today, Shannon Roxton, program again. Okay. So here's history. This is a picture of my grandmother giving anesthesia back to her. I bet you guys didn't know how old CRNAs are as far as a profession. They're very old. Okay. Over a well-rounded year, in fact, the first person to administer anesthesia or nurses, it's kind of the model, you know, it's just the model that everything else was kind of built on. The one that people talk about in those is Alice McGall, who was known as the mother of anesthesia. She began, she began as with the title of nursing us this, we're back in May of back in 1893. Open drop. Open drop ether. If anybody in the year has experience with open drop ether, you have my, you have my other set, and that was a long time ago. I'm not in. Okay. Next slide. So a little bit about CRNA statistics in the United States. There are over 130 accredited CRNA programs. We're working to get up to probably 155 because programs are popping up all over the place. Why supply them in? So, you know, there's a need. So the COA, which is our accredited client, I'm excited that, you know, if you, if you can, can show the need, then we're going to grant you access between more CRNAs. So, in race states, don't have, the race states don't have CRNA groups. There's nearly three hundred, sorry, three thousand new board certification aid. So that's about how many in the country new CRNAs were producing anyone. And there's over 61,000 CRNAs in the US right now. Here in Georgia, as far as contributing to the workload, of course, we have two accredited CRNA programs, a suggestive university and, and Emory University. The number of graduates, A, U, up to 40, and the reason I say up to 40 is as recent as 2018, we had 20 students per cohort. We accelerated that up to 10 students, about 10 to 30 students. And two years ago, we were approved to go up to three. If you want to know about constraints on our program growth, it's specifically the same thing one eight earlier, access to clinical sites and faculty. That's, we have no short supply of nurses, how we train, how to walk on nurses and want to do smart aids. We just don't have the capacity to train them because of faculty and clinical sites. That's what I said. We're a state college school. So we are at the mercy of what funding the USG has and how that funding is allocated specifically to a ghost university and then how that budget at a ghost university trickled down to the college. There are over 1,600 practices in the Sierra, Sierra and Georgia. One of the things I'll say is, and we don't have to go back to the previous slide, but I'll mention that one of the testimonies earlier just said that there are 14,000 things, maybe more, for nurses in Georgia and we're able to see the work to be to graduate about 400 a year. So when you think about the great retirement and you think about people's dogs should think, you know, the CRNAs were kind of in the same boat and we could get more all there. All the health care providers where you're in the age of the great consortium. But the age better time. And we can't keep up with what we're losing. So, you know, the health university is trying to be their due diligence to increase in the moment and I have a personal strategic plan that you can advance us by another 10 slots, certainly in the next two years. And, you know, we can get that graduate number a little bit more to help you about that. So some good news. Regarding the Council of Accredivation, I've not been sharing this. We recently got news just last week that our program has been re-created for the Maxine Tenure Accredivation. So we're very, very happy to have you. So for the next 10 years, we're good to go. We're going to keep up and out. I'll call the sandals. You'll look in the pictures here and some of us look the same as we did before. So, this is our faculty. Many of them are in the room. I have three part-time faculty and I have including myself five full-time faculty. And then I have in the lower left corner. They're looking at a slide is our program manager Nicole and she's been helping us a lot today. So, thank you. Thank you all for being here and helping out for this week. So, I'm going to finish out here with the next few slides. Just talking specifically about the program on what we do and how we train CERN. So we're the first CERN program in Jordan. We're sort of about 1995. We are the longest running program. We've been opened since 1995 for a different period of time throughout since 1995. We're the only program you now share that title of CERN. I'm referring to the Zlogil with Emory. But we have produced nearly 500 CERNAs since we opened the doors. And the number sees a little low. If you mean, you know, you've been a little bit of math and you know, like a math isn't math and if you put out 30 to 40 CERNAs, that's not right. When we first started, we started small. So, for the first several years, it was made five CERNAs. And it grew very quickly. When I graduated from this program, I graduated a class of 15. And now I'm the director of a class of each cohort at 40. So we have been and trying to answer in growth. Good news. 9% of my applicants are from Georgia. 9% of them come here and say in New York. So that's really good news. I can't help it that they come here from out of state because they attract new candidates and decide they want to go back. But I think 90% say in Georgia is pretty good. Up to 30% are what you know the community is an active student. Some of that to the fact that we acquired in the real estate through rural communities. They go through the state dodge, Habersham, Taylor, Diffin. I mean, there's a map over here that one of my colleagues put together and each one of those pens, each one of those sites are listed that we go to in Georgia with the exception of three out of state sites that we expand and teach so that we can grow the program. But the majority of them are in Georgia and you can see where the push pens are right there that kind of identifies exactly where we are across the state in the answer is everywhere. Okay. So our admission criteria like I wish I had what Dr. Pettlin called a D-pearl and called a slick. I need a slick. So I'm going to show you we're going to get slicks. But our admission criteria is pretty lofty because we have nearly 300 applicants for those 40 spots every year. There's no shorts of five people who want to be C-R-N-A's. I could reasonably, you know, based on what the criteria that we're looking for, I could reasonably probably accept 100 of them, but I can't train one. I can teach them kind of like Dean has said I can teach all the all the resident and not all the medical students you want. I just can't train them anywhere. That's the same kind of situation. So our admission criteria are that you have a BSN or an MSN in or say it's unencumbered. You don't have any restricted RN life zones. Your license ends state either through a compact life zone or through Georgia. You have at least one year of ICU experience that's current accreditation. But I'm going to give you averages in a moment. You have a minimum of three-way overall GPA. You have C-R-N-A shadowing that stands in the professional application. That gives your application through the games. Now statistics on our most recent accepted class average ICU experience is three years. Average GPA for the last class was 3.8 on. Average experience was a shadowing experience was somewhere around 16 to 20 hours that they just spent on on. It's making sure they wanted to be C-R-N-A. So these nurses that are convenient to our program are the top best of the best in ICU. So as far as training requirements, some of these things are going to vary. Like my credit hours might not marry up with Emery's credit credit hours, but our requirements are the same. Bars are 113 credit hours of 36 months. Back in, say, probably about 10 years ago, we've been away decided that all C-R-N-A programs, about 20-25 will gradually be thoughtful of preparing. So the minimum that they would allow your program to be, the minimum length is 36 months. So we are a 36 month program. You get your holidays, you know, your academic calendar, you get the holidays off, other than that, or 36 months, 113 credit hours. We give them, prior to going to clinical 100 plus hours of life in simulation, and you guys have a benefit of seeing some of their dedicated labs faces in the shared lab spaces that we care with MCG over at the ISC. They have over 2000 hours of clinical training. Most of them, and this is faith that's a factual clinical training that they're not allowed to account sleep time and they like that. But I say over 2000 because it's kind of, it's all of them out, but 2000 is the minimum. They're allowed to have the sickly board certification. Minimum was 615 anesthetics. We average above 900. I think I had over 1000 when I graduated, not patting on second but. And then we have required specialty rotations. So whereas Dr. Miler, I think, spent a little bit of time talking about some fellowships that MCG has for specialty rotations, specialty types of anesthesia, we have those embedded in all cloverings. So they have a minimum number of open hearts, they have to do a minimum number of OB cases, regional anesthesia, acute veins, finals, epidermis, lungs, neuro pediatric cases, PE patients under two, preemies, trongs. They have a minimum number of cases that the CNOA requires in complete to complete before their board eligible. So in the diabetic training, the cool thing is that anesthesia textbooks are multiple, multiple disciplinary. The textbooks that we use to train our students are the same textbooks that are used in medical education in the physician's side. We, we make them go through their foundation of science courses, chemistry, they have cadaver lab, we have tennis and cadaver lab and MCG uses for our next opportunity. They study physiology, pathology, physiology, pharmacology, and then we get into anesthesia just with types of anesthesia procedure, it's equipment. They have our own simulation labs and then we share those spaces over in the interdiscinerary center. And then again, I talked to you before, I shouldn't glazer the doctoral project. The students behind me are probably saying you're not putting that emphasis on the Dr. AR, I say it. Sometimes it's a very big, lots of low-file depth, I mean, of this, you know, that they have to earn, you know, to be able to say that they have the knowledge and the ability to go in and do an assessment of a situation or a learning or practice environment and make a clinical change. So some of the things about simulation, we started in simulation and want to talk a little bit more about that when the creditors came to review us back. I was like, February, one of the things that they really enjoyed our program was how much simulation time that the students were getting. And when they went to visit our students in clinical, they were just really surprised about how ready and acclimated they were to be in the OR because of all these spaces that we've been able to offer them in the ability, they have to train these spaces that you got stored right out here with our mid-pability ORs in our regional lab spaces. They have access to those 20-pilots. The high-pability OR that, you know, we took the walk-in tour tour two or earlier, those are just getting a little bit, they still have approximately one and a half hours each week in there in addition to what they do in the year. Simulation with Broughtson Universe in the Byter City in 2008. And in 2000, and we opened the Interdisciplinary Center in, shared those experiences with other programs, and then we moved our equipment over to the ISC and explained it. So for the clinical requirements, there's kind of a two-step program right here, for the first type of program for the three years, the students are in di-actic and lab and send them in a little bit of observation in the actual OR. Then we blessed them and sent them out to all over Jordan to view clinical rotations and that's where they go. The Lagrange for OB and CISP, put me for hearts and clean chog for beads and all over for regional and to actually use the D for neuro. And when I worked for Dr. Miler about 10 years ago before I came over here, I was the clinical director at NSUG that ran the programs SRNAs over there and we were in neurodiscite and that's primarily where we're out function. We had a lot of rule rotations. All over Jordan, can't name them all, but they're on that map and I have a handout to give you that I'll make sure Bernita has. That's just the same as just the people could of that. And we actually have them in the RNA-only programs. So there's areas throughout the state that are hospitals marked in rural facilities for hospitals that are functioning in an independent model with the just numbers. So there's that picture I'll tell you about. That one doesn't have the pins in it. What I thought would be fun to get your own pins. And the ingredients. You can't really do that in a five. Exactly where all those are, but the nice thing is is that we did put in parentheses the county that they're located in. So you can find your family in your region and come see where we are. And we are in Guinnette for sure. We can work again. So how do you get to be a CRNA after the train? We've let you put your hands on all the things. We've talked to all the things that we can teach you in the book. You get to go to graduation and you have to separate a very, very big test. Different than other disciplines and certainly one of the things that separates us from some of the other APRRans that we talked about as we have to be certain. We must take a certification exam pass it in order to practice. So all CRNAs as in their CRNA title are certified. Well, that's not enough. So you don't get to just be certified and go out and practice in a session. You actually have to be reaccredited or not reaccredivated, re-certified. And that's an eight-year cycle where you have to come up and be trained by CEU. So that's kind of normal for nursing and medicine and everything. You have CEU education that you get. And then after you do a certain number of CEU use at the end of that second floor, you're cycling. You've got to take the test again. So you are required by our certified body to play in the know on the knowledge that you have to have the current impact on our body. So one of the things that we need in particular in my program doing to try to tackle some of the problems around any rule of health care. I don't really want to think of it as accessing the quality of health care in rural places. It's really accessing care everywhere. There, I mean, just in the well-star system alone, there's almost 50 CRNA openings just in the Atlanta area. So everybody means health care providers. So the more we can increase enrollment, as long as we're not reducing the quality, the better that we're going to be as far as being healthy for them. And then recruiting how to qualify candidates from the role and underserved areas, being mindful of that when we're accepting our class. What we do is we do try to target certain areas. We have partnerships with people in Columbus and in other areas, some of them will be able to enroll. But we have partner in the Cross of State that say, hey, this has been great. Grace and our candidate for you guys have highly qualified and fifth person wants to come back and work for us. So we try to reciprocate those relationships. The other thing is, as always at 2016, I've been the PI first one investigator for HRSA funding. And we've brought in for the nursing industry, the internship grant of about $300,000. That money does not get to the program though, that money goes to the students. So that helps fund their travel. So we offer that to the students because when they travel, these locations are always in the state. Most of those places don't have housing. So they're working with everything, with the been our own budgets to try to find places to stay. And we made a commitment from the go to those places so they can see what practices look like and what we're doing and maybe a different commitment to them. And I think that's all I have to share. So thank you so much. Thank you. Thank you very much. I was thinking about your money issue. And one of the questions that I have was, are you guys, you've got a lot of things, they've produced that for a product program that we oh, yeah, my end. We had not been in the past and then we actually had somebody from some of your new men do a reach out to us as a presector that you know, and said, hey, there's an incentive for us to do this. Can you start tracking it? And then we decide to start tracking it. It's a lot, a lot to track. But we have opened that up to all our presectors across the state of Georgia to incentivize them to train. Then still on the money piece, I noticed that there's a pretty robust foundation that got us with a GST and Mercy Medical College. Are you guys able to participate? So it's done with it all. So they don't share much other bank accounts. We are married with several accounts. We are salsa, I guess, in nursing. Anybody from philanthropy that wants to help me? We are working on that. You know, with all colleges, all these, you know, the University of Orange has an expectation to reach out to those people that we've been good students to, when we provided such good training and alumni connections with, we're constantly looking for gifts for endowed chairs and endowed pressure shows. And that's something that we could be better at that role of working. And then just one more. When I was in medical school, I spent a lot of time not sleeping in a call room, but taking a emergency call where nothing good happens after midnight, right? So that's on a lot of learning tips. So I'm just wondering if you guys have any kind of a call program set up? Yes, we do. So one of our big players is in Macon. So there was a Merchant Program there for the CERN Attorney Program, the Social Emergency Emergency Program, flows. We assumed that major clinical site at Madison. And we sent 10 students at a time there and they're on a call rotation. But even more so when we sent students to one of our dedicated, reduced sites, which is in the rain, it's sending on some. I have a pretty question about the clinical sites. You said that you need more. What is the, I guess what's stopping you guys from growing? Is it the lack of, I guess, willingness to participate or is it truly fun for your own? I guess multifactorial. So training sites used to be a hand yard, it's getting a little bit better now because there's a shortage. And now it's really, it's a really valuable time because I can create a pipeline for them. So that is shifting a little bit. But when we go into sites that are also, as you've saw, it will be hesitant to map. There are even more two. So if we're going into sites and there are other learners present, they're working for getting rid of them online. So having to do that across the state makes it kind of difficult. And there's got to be room for everybody. You got to have room to train residents. You got to have room to train the sirens. There's a dental, the dental college, the board of scents, learners over two are aware to learn how to do things and innovate. And the OEMFS guys can go over and do an anesthesia rotation. So there's a lot of learners especially here at this university that we have to cater for. So you know, we can't do our dedicate training here in the US, but there's not in no space. So we branch out just like the other other places that branch out. But some of those places are small. I mean, you're talking about maybe half of the hospital that I had had had less than 601's. So, you know, I can't, can I listen one or two students there and then actually get a regular amount. I'm getting a quick story. I would have been, um, gosh, cordial. I need to call them out. I love cordial. Great rotation. They ran approximately one to two ORs a day and have OB suite. I was only student there. I showed a three days in the road to the case of a cancer within the certain one. So, gotta be careful, you know, I mean, it's just a little site. So sometimes they, they make, they make the rules up and you, you know, I can't send them to the students there. So even though I have that many sites, the vast majority of them have one or two students. And that's what's allowed me to have my capacitance to be a whole new year. That's what I was going to ask is that our represent to nine counties in one district. I don't think it looks like you have one home. That's it. Is that, um, players with more players? Yeah, I'm in danceville. And I will tell you, I will tell you that we got some call from the chief and Cigiala's there. About a month ago, I was saying, hey, I can't recruit. I can't hire any help in there. They won't allow them to send one student at a time before. They said, uh, you can send up the four five. And we're opening up all the specialties to you. We've got to have a pipeline to hire Cigiala's. So we're, we're making moves, but, you know, it's nice. It's a great time to be a Cigiala neighborhood. I mean, it's in high demand. It's at the very, very profitable, um, profitable, market for scenario right now. And if I could produce a hundred a year, I still don't think that that would be enough to kind of, kind of, enjoy the green for whenever we're both, we're trying to do this. In this, in the mouth, what's, what's typical? I mean, I, I had a vision of, uh, understanding that, CR and I came in, but didn't reside there at that facility and, and, and report to work there, they put this little bit in a round on the ass need places. Correct. I'm sure that's a misintention. So what is said about what the understanding for your shame is not, there might be a CR-MA that's not dedicated to one of those hospital with the kind of travel between them. Uh-huh. That's similar to what\n\nSenator Jackson was talking to you with the test upon, the test was very earlier about the hospital and the systems and locoums. So what happens is, is that there's not enough volume, say that might get surgery center or a hospital that only has the work to operate one or two days a week. So then a provider will go in and do cases on Monday and Tuesday and some of you know, do Wednesday, Thursday, and then do Friday work. And that provider is doing that as a solo act as an individual that has relationships with these different institutions and is moving around. You guys know, so you're basically running your own business? Yes, ma'am. But there are multiple witnesses in the state of Georgia and Georgia.org CRNA witnesses that are either small or large. And then the other model is institutions that are, I mean, I'm part of the plan. So you know, we're a well start close down to the hospital. Yes, you are. I'm going to be the only day. I'm going to go to the hospital. Yeah, I'm going to be talking to you about the well center question. You know, I was saying, I'm in an area where I'm in, I'm in the floor. There have been two level one, and I'm in Toronto center. But in that area, you know, in the hospital, the model of the great big place like Henry Ford Sam, the stereotypes there that are there every day. But they've got from the outside or they part of the structure of the work. The work process is different on the particularly in those ordinance. A year with the model team, he has, he has his regular compliment of full time CRNAs or AAs. Right. And then he has a staff of what we call PRN for ad needed. Yes, they'll call upon those folks to fill in the gaps. So at the combination of the two, it depends on the size of the institution. And the time of the surgeries and procedures that. Yeah, it's not that most of it is about the need and the volume in the place. So you know, there's a very high volume exact hundreds of cases they're doing, you know, I'm not over there. Whereas you moment maybe 100 cases a year, some years more. So, you know, that's where you have to be careful with that work for space where. So, you know, it's a small hospital might not be able to afford to employ from a full time every day or week. So they cut that they cut that out and they say, hey, I'm just going to contract the week for two days. And I'm going to pay that two day. Well, so I can't afford to pay you. Or five days to be here, repay a little bit more to those two days and what probably work. If you cut the name of five feet, then it might get you two of them. But it's because I'm incentivizing you to make the ground. So it gets more kind of those two days. And then I'm cutting it loose and you know, you know, going to get some oil. That's not. And I know I didn't find any harm. Thank you. The closing is done. Dr. Russell. Yes. You want to say yes or no. As a chairman, Senator Lawrence in perpetuates, your Jackson is my app of rhythm. I'm going to do it on our entire day. And I appreciate it. Thank you all for being on our campus today. I understand y'all are tackling some very serious problems that plague our state. And just as part of. I mean, just university and the university system. We see ourselves being part of the solution between our partners. And we thank you for your support of the university and of the university system. Just to add to the question on our partners, the mcg foundation. And the Augusta University foundation are very much. And in the trenches with us helping us partner to bring the mcg 3 plus programs you all heard about today, but also nursing scholarship to help serve the states that were very grateful for our private partners and our public partners. Thank you for your service. Thank you. It's been a great learning experience. I'm going to change my hair. I'm going to change my hair. You don't recognize. I just want to say thank you members of the committee. Thank you to the university and for need a john. Thank you. Thank you for doing things you can do. I'll put these all together. Thank you to everyone that test five day showed up. We've got a big task from us. Obviously this was an easy solution to work. We'll say. We're going to do the best we can and hopefully. We'll do the best we can. We'll do something good. I'll tell my dad on the way down here. He's graduated medical board and I had to give his child to the class. 99. Tell my knees back. Well, that's you. Thank you all very much for your time and look forward to work. Thank you. Thank you. Thank you.",
  "updated_at": "2026-02-13T17:18:44.652074+00:00"
}