{
  "video_id": "roE1b6b9xuw",
  "url": "https://www.youtube.com/watch?v=roE1b6b9xuw",
  "title": "Georgia House 2026 - Day 3 AM Session 1",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": null,
  "duration_minutes": 53,
  "summary": "Here is a summary of the Georgia House 2026 - Day 3 AM Session 1 in structured markdown format:\n\n## Overview\nThis session focused on opening remarks and a scripture reading and prayer from the House chaplain, Rev. Benny Tate. There were no significant legislative actions taken.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Rep. Clint Crowe introduced Rev. Benny Tate, the House chaplain for the past 36 years, and shared a personal story about Rev. Tate's ministry to Crowe's family.\n- Rev. Tate gave a sermon emphasizing the importance of encouragement, noting that \"if they're breathing, they need encouragement.\"\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, as members responded to the morning roll call.\n\n## Adjournment\nThe session adjourned. No information provided on the next session date.",
  "transcript": "All members, the hour of convening has arrived.\nAll members, please take your seats.\nAll members, please take your seats.\nMr. Clerk, how about ring that bell?\nYou\nGood morning members, while the last of us are coming in, I hope you had a chance\nvisit with some home folks, eggs and issues with our local chambers a lot of\nhome folks are here today last night today and that's why we want to get started\na little bit later so everybody would have a chance to visit and so we'll see if\nwe can get through our work this morning and I'm sure you still have some\nfolks in town and maybe you want to visit with them again so we'll just get\nstarted here so we're gonna go ahead now and have the morning roll call\nSo all members present will please vote green to signify their presence in the chamber.\nMr. Clerk, will you unlock the machines?\nhave all members voted.\nhave all members now voted, all members have voted this so, Mr. Clerk, will you lock\nthe machines. Thank you members for being here today on this chilly damp morning.\nDoorkeeper, please close the doors and keep them closed. As is our custom. How's the sound?\nIs it pretty good?\nCan you guys in the back?\nOh, it's not the back's working in front, it's not.\nSo work in progress, as many of us are,\nworks in progress.\nAs is our custom, we will begin our day\nwith a scripture reading in prayer by our chaplain,\nafter which we will pledge allegiance\nto the flag of our country.\nOur chaplain this morning is no stranger.\nHow many years now?\n36.\n36.\n36.\nHe's come to this body and served as chaplain.\nAppreciate him and his ministry,\nBrother Benny Tate, but I'm gonna let Clint Crowe introduce him\na little bit better than I did.\nSo with that, the gentleman from the 118th House District\nRepresentative Chairman Clint Crowe\nis recognized to speak to our chaplain of the day.\nRepresentative Crow.\nThank you, Mr. Speaker.\nI heard that they had gotten the sound system.\nThey were almost had it fixed.\nThen they found out I was coming up to talk so they thought they'd wait and\nleave it turned off while I was up here.\nNow, good morning colleagues. It's a pleasure to once again welcome back\nPastor Benny Tate.\nMany of you in this chamber have been here and heard him and met him\nand been blessed by what he's had to say.\nPastor Bitty has been at Rock Springs Church for 36 years now.\nAnd he does a lot of things.\nHe's an author. He has a new book that's on your desk.\nI got a copy for everybody, so I hope that you found it on your desk this morning.\nI hope you'll take some time to read that.\nI think it's a wonderful book and I think you'll be blessed by it\nand I hope you enjoy that.\nThe Pastor Benny does that.\nWe have multiple campuses, several missions.\nHe's the founder and chancellor of Rock Springs Christian Academy,\nwhere my kids get to go to school,\nand I'm honored to get to serve on the school board there.\nWe have a group of our kids here today.\nWe have all of the eighth grade,\nand a lot of the seventh graders here,\nincluding my son, Jason, sitting up in the gallery,\nso we want to make them welcome.\nI'm glad to have them here.\nPastor Benny has also been the president of our church\ndenomination. He's done a lot of things.\nBut I want to tell you what I tell people when they ask me\nabout Benny Tape.\nAny time asked somebody asked me about him,\nI tell him a story.\nAs many of you know, five years ago,\nas we ended session, 2021, right at the end of session,\nmy dad was sick, we brought him home from the hospital,\nand we knew we had a short time with him.\nWe got to talking one day, specifically\nhe and my wife, who is a much better Christian\nthan I am than Pastor Benny can attest to that.\nBut my wife got to talking to my mom and my dad about their salvation and\nwanted to make sure they were prepared.\nAnd they said that they weren't sure.\nThey weren't convinced.\nSo my wife, being who she is, got on her phone called Pastor Benion, his cell phone\nand said, would he come and talk to them?\nThat evening, he and his wife, Ms. Barbara, drove from their house in Versailles,\nGeorgia to the north end of Butts County to my mom and dad's house,\nbrought some banana bread that Barbara had made. I may have eaten the banana bread. I shared it with\nthem, but he came up there, sat with my parents for nearly an hour and prayed with both of them to get saved.\nNow, I don't care what else anybody ever does for me. There will be nothing that will mean more\nthan that for me and what he did for me and my family. So when people ask me about him,\nThat's who he is. He is a pastor. He is reaching people for Jesus. That is his mission. That's what he\ndoes. And I am honored to have him be my pastor. And I'm even more honored to have him be my friend.\nPlease welcome back, Dr. Benny Tate.\nWell, good morning and thank you so much for being here. Thank you for the client,\nfor those kind words. As he was introducing me, I was praying. I was praying for a\nclient, and I was actually asking the Lord to forgive him. I said, God, forgive brother\nclient for overpraising me. And then I prayed to prayer and I said, God, forgive me for enjoying\nit so much. Amen. A good good morning. Good to see all of you. Just I honored to have the\nstudents just have a curiosity. How many would say Pastor Benny? I've never heard you before.\nI've never heard you before. Could you raise your hand? I've never heard you before. Just a few of\nyou. Just a few. Well, I'll say to you few, what a list of Taylor said to her eighth husband.\nI'm not going to keep you long. Amen. Not going to keep you long. I want to talk to you this morning\nin a scripture that's found in 2 Timothy, chapter 1, verse 16. This is what the scripture\nsays. The Lord give mercy unto the house of own Cypheras, for he often refresh me and\nwas not ashamed of my chains. He often refresh me and was not ashamed of my chains. I want\ntalk to you this morning about what every person needs, what every person needs. I\nremember a few years back, a few years back, I was with Mr. Truitt Cathy. And Mr.\nTruitt Cathy said to me, he said, Pastor Benny, do you know how you can\ndetermine whether or not a person needs encouragement? I said, no, no, Mr.\nHow do I know if a person needs encouragement?\nHe said, Benny, if they're breathing, they need encouragement.\nIf they're breathing, they need encouragement.\nDuring this time, we've got a lot of people running for office.\nI heard about a guy the other day that was running for office\nand he was making a speech.\nAnd while he was speaking, a heckler stood up and the heckler said,\nI wouldn't vote for you if you was Saint Peter.\nAnd the politician spoke back and said,\nif I was Saint Peter, you wouldn't be in my district.\nAmen?\nEverybody needs encouragement.\nI heard about him, Mrs. Johnson.\nShe was a teacher, Mrs. Johnson.\nAnd she had Johnny in her class.\nAnd Johnny would literally make these ugly faces.\nAnd Mrs. Johnson said, Johnny, when I was a little girl, the teacher told me that if you\nmake ugly faces, your face will literally freeze that way.\nHe said, Mrs. Johnson, you can't say you wasn't warned.\nAmen.\nWell, here's what I know about every person.\nThis is what I know about every 80 members of this body, 180 members of this body, every\none of you need encouragement.\nAnd if you don't own day three, you will, by day 40, every one of you need encouragement.\nAnd what's so encouraging to me is every one of us can do it.\nEvery one of us can encourage other people.\nYour surpasser helped me out, I will.\nHow can I encourage somebody today?\nFirst of all, you can encourage people with your praise.\nWith your praise, Proverbs 18 and 21 says,\ndeath and life is in the power of the tongue.\nFolks, this world that we get to live in,\nI believe, was spoken into existence.\nSpoken words created this world.\nThat's what I believe.\nhope you do too. I don't want to be like the guy that said once I was a tadpole\nbeginning to begin and then it was a frog with my tail tucked in and then I\nwas a monkey in a banana tree and now I'm a professor with a PhD. I don't believe\nthat. I believe that God spoke this world into existence. Friend listen to me\nclosely. If words created this world, your words can create somebody else's\nworld because death and life's in the power of the tongue. How can we encourage\npeople? We can encourage people with our praise. Let me tell you a second way\nwe can encourage people. We can encourage people with our presence. Notice what\nit said, the Lord gave mercy into the house of Ohm Cypherus for he often\nrefresh me and was not ashamed of my chains. Proverbs 17 and 17 says a friend\nlove it at all times and a brother is born for adversity. Said Pastor Benny I\nwant to I won't encourage somebody I'll tell you how you can do it. I'll tell\nyou how you can do it. You can encourage somebody with your presence just be\nthere for that person. We encourage people, we encourage people with our praise, we encourage\npeople with our presence, but I'll tell you a third way. I've been the pastor and he said 36\nyears at Rock Springs Church. How do you stay at a church 36 years? Well, when you want to leave,\nyou just stay. And when the people want you to leave, you just stay. I just figured it would be\neasier for them to move their membership than me to move my furniture.\nAmen? I just stay.\nI'm speaking a few weeks ago on a lady walked out the door and she said that was a warm message.\nI thought what does that mean? Don't do that today.\nThe following week I'm standing at the door, she came out the door and she said that was a warm\nmessage. I said, wonder what that means. The third week she came out the door, Mrs. Speaker,\nand she said, that's a warm message. I said, ma'am, what does that mean? She said, not so hot.\nWe encourage people with our praise. We encourage people with our presence, but let me tell you\nthird way you can encourage people. You encourage people with your pen. I know we're in the electronic\nage. Sometimes it don't work elsewhere, am I man? I do believe when the devil's not bothering us,\nI believe is in sound equipment. But we're in the electronic age and everything's digital today,\nbut folks let me tell you something. Politicians listen to me closely. There's power in picking up\nyour pen and writing somebody a handwritten note. I don't save a lot of stuff, but I save\nhandwritten notes that have been written to me. Look here. I'm almost finished. If you get finished\nbefore I do, just slip out. I'm almost finished. But we encourage people with our praise. We encourage\npeople with our presence. We encourage people with our pain, but there's one other way we can\nencourage people. We can encourage people with our prayers. You say, well, I'm praying for people.\nYeah, but here's the thought. Let them know you're praying for them. Because if you live long enough,\nif you live long enough, you'll get to the point sometimes it's hard to pray for yourself.\nWhen you've got somebody who comes alongside of you and says I just want you to know I'm\npraying for you.\nOne of my heroes in the political arena and first of all I want to say thank God for every\none of you.\nI came today to encourage you.\nI want to say thank God for every one of you.\nYou say I'm a Republican, I'm a Democrat.\nfolks, we're Americans. We're Georgians. That matters not. But I want to come and say thank you\nfor what you do. But I'll tell you who I really wish I could speak to. I wish I could speak to your\nmates and your children. Because I'd like to say to your mates and children, thank you for the\nsacrifice. Thank you for the sacrifice you give, for your\nmate, your husband, your wife, your mom, your dad, to do this\nservice to our great state. Abraham Lincoln was was\nkilled tragically. And when Abraham Lincoln was killed\ncongregation, they started looking at what he had on him when\nwas killed. He had a pair of glasses, he had a pocket knife, he had a handkerchief, he\nhad a $5, $5 Confederate $5 bill. Then they noticed something else. He had a couple\nnewspaper articles. And then these newspaper articles were tattered. But in these articles\nthe writer had spoke complimentary of President Lincoln and so from time to time he'd get\nhim out and he would read them because Mr. Truett was right. Everybody including you needs\nencouragement and everybody around you needs encouragement because listen, I'm done.\nIf you treat everybody, if you treat everybody, that means you, that means you, that means\nyou.\nIf you treat everybody, if you treat everybody, you'll be treating 90% of the people correctly.\nLet's pray.\nwe bow our heads and hearts in your presence. I spoke of Abraham Lincoln. Abraham Lincoln said\nthose words, I've been driven to my knees by an overwhelming conviction that I had nowhere else\nto go. My wisdom and all about me seemed insufficient in the day. I pray your wisdom upon this delegation.\nI pray your wisdom upon this house. I pray God that every member of this house, Lord,\nthat you would give them your goddess, that they would be led by you. Not only do I pray for them,\nbut I pray for their families. Keep them safe. Protect them, Lord. Meet the needs of their families.\nI pray for traveling mercy. Many travel from North Georgia, South Georgia to be here and serve.\nThe coast to be here, serve this body. I pray that you will keep them safe on the roads.\nGod, I just ask you to bless them and keep them, make your face to shine up on them, be gracious\nand to them, lift your countenance upon them, and may they experience your peace for I pray\nthis prayer, respecting all faiths, but I pray this prayer in the name of Jesus Christ, amen.\nThank you brother Benny door keepers you may unlock the doors brother Benny thank you for being here and providing those words of encouragement\nYou\nYou\nmembers, well, members, you may agree, brother Bini in the south any room if you'd like\nto speak to him and give telling him thanks for being here with us today.\nYou\nYou\nWell, good morning again, we want to thank Representative Sheila Jones of the 60th House\nDistrict for bringing Dr. Organ to us as our doctor of the day, Dr. Graffin Reed Organ.\nThank you.\nShe's been here before.\nWe appreciate her service.\nChairman Hilton the chair of the video and information on it says recognize good\nToo much\nThey fix that's godly\nYeah, thank you miss speaker your committee on information on it says rev the journal the previous legislative day and found it to be correct\nChairman Hilton, the chair of the Committee on Information and\nAudits reports, and a very powerful voice, that the journal of the previous legislative\nday has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nHearing none, the reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nvery none. The journal is confirmed. Mr. Clerk, will you read the resolution establishing\nthe order of business of the day?\nRepresentative, that's face in the 104th Moose following me establishing the order of business\nunder the first part of the period unanimous consensus. Introduction to bills and resolutions.\nreading and reference of House bills and resolutions, second reading of bills and resolutions morning orders.\nIs there an objection to the adoption of the resolution establishing the order of business for the day?\nHearing none, the resolution is adopted.\nFirst reading of bills and resolutions, Mr. Clerk, will you read?\nHouse Bill 950 by reps of Cajanian to the 81st on who was 31st, Cally the 16th, and Gullet of the 19th.\nBill B. Tyler, an act to amend Code Section 22771 and the official go to George Annotator relating the immunization of students.\nEducation House bill 951 by reps and of carcola 100th and methiac the 82nd silcox the 53rd Kelly the 16th\nScofe due to the 63rd and others\nWill be taught an act to amend chapter 24 title 33 the fish go to Georgia annotated relating to insurance channel\nHelp\nHouse well 952 by reps and Franklin the home 60th perish with a hundred 58th and burns the 159th\nwill be taught an act to amend the act creating a board of elections and\nregistration for Bullock County.\nIntergovernmental coordination.\nHouse Bill 953 by Brooks, but Franklin in the 160th parish, the 150th and burns the\n159th, will be taught an act to create the City of Statesboro Public\nFacilities.\nIntergovernmental coordination.\nHouse Bill 954 by Brooks, and a bell of the 75th, Gistley of the 121st Jones, the 25th,\nSharper of the hundred and seventy-seven billion and hundred sixty-second and\nothers will be taught an act to a part of two chapter five a ton of fifty the\nFisher-Coda Georgia annotated relating the issuance exploration renewal of\nlicenses motor vehicles hospital 955 our represent of stillcocks the 53rd\nJones of the 47th Hilton of 48th Evans the 57th down to two she the hundred and\nfifth and others will be taught an act to amend chapter four title one of the\nFishercoded Georgia Annotated relating to holidays and observatives.\nSpecial rules.\nHospital 956 by reps and a quarter to the 174 Smith and 70th of Canon in the\n170 second.\nThere'll be a ton of active and code section 12, 8, 27.1 of the\nFishercoded Georgia Annotated relating the Solid Waste Trust Fund.\nNatural resources and environment.\nHospital 957 by reps and a clifton to the 131st\nCorporate of the 174th, person near the 119th, camp of the 135th, new with the 40th and others,\nwill be taught an act to amend Title 40, the Fisher-Coder Georgia Annotated Related Motor Vehicles and Traffic, Motor Vehicles,\nHospital 958 by Ripson, Ohio, the 50th Stevens, the 164th, green to the 154th, Hawkins, the 27th, Buckner, the 137th,\nThey'll be taught an act of men chapter 11 and total 40 80 fish go to Georgia and it's a related taxes on tobacco\nWays and means house will 9.59 my words and a vow of the 50th Stevens the hundreds\nGreen to the hundred and 54th Hawkins the 27th of the quakner the hundred and 37th\nThey'll be taught an act of men chapter 11 and total 40 80 the fish go to Georgia and it's headed relating to taxes on tobacco and vaping products\nWays and means house\nResolution 109 by Representative Canada, 170 second and 4 to the 170th resolution honoring the life of Mr. John L. Williams\nEducating an interchange in his memory\nTransportation that completes first reader\nSecond reading of bills.\nSecond reading of bills and resolutions, Mr. Clerk, will you read?\nHouse Bill 933 by Representative Hopkins of the 27th, I know who are the 31st Cox of the\n28th, clerk of the 100th Dominic of the 29th and others, a bill relating to the Lake\nLinear Islands Development Authority, House Bill 934 by Representative Williams of the\n148, frustration of the 104th, Williamson of the 112th Jones of the 47th percent of the 176.\nThey bill relating to banking and finance, commerce and trade, public officers and employees.\nHouse bill 935, by represent Canada of the 172nd Taylor of the 173rd.\nA bill to authorize the assessment and the collection of a technology fee by the probate court of Thomas County House bill 936, by represent Canada of the 172nd.\nThey bill to authorize the assessment and collection of a technology fee by the municipal court of the city of Berlin.\nHouse Bill 937,% 4 of the 170th anniversary of the 169th, Whoever tercerize the assignment,\ncollection of a technology fee by the magistrate court of barian county tank spend 938.\nWhen it was reported, 170th or 169th, it billed\nthe assessment and collection of the technology fee by the larger court of\nat the State Court of Tift County, House Bill 940,\nby reps of 4 to 170, 13 to 169,\na bill to amend and act creating,\nestablishing the State Court of Tift County.\nHouse Bill 941, by reps of 4 to 170,\nif the bill to authorize the assessment and collection\nof a technology fee by the private court of Tift County.\nHouse Bill 942, by reps of per now of the 77th bill\nof the 75th, Illinois of the 74th,\nScott of the 76, a bill relating to property exempt\nfrom Admiral Arm Taxation.\nHouse Bill 943, by reps of sale cocks of the 53rd,\nHawkins of the 20s have a Cooper, the 45th Franklin of the 160,\nis Gofield of the 63rd.\nA build up relating to programs and protection\nfor children and youth.\nHouse Bill 944, by reps of McDonald,\nthe 26th, grow of the 118,\nTitchens of the 161st, Lumps of the 12th,\na build relating to safe operations of motor carriers,\ncommercial motor vehicles, drivers,\nand safe transportation of hazardous materials.\nHouse Bill 945, by reps of Williams,\nand the 112, Williams of the 148,\nChastain of the 7th, a build relating\nto banking and finance, House Bill 946,\nby remissive clipped into the hundred and thirty first roads of the hundred and twenty fourth ridley of the six Kelly of the sixteen Canada the hundred and seventy second others a bill relating to game and fish\nHouse bill nine forty seven by represent and mop the hand of the 17th Canada of the hundred and seventy second carbon of the second Jones of the twenty-fifth Kelly of the sixteenth and others a bill relating to general provisions of public assistance\nHouse bill nine forty-eight by represent camp the hundred thirty-fifth part of the hundred and eighteen mathiac of the eighty-second\nSecond, Powell of the 33rd, levered at the hundred and twenty-third.\nA bill relating to mortgages, conveyances to secure debt, leans, and tax sales.\nHouse bill 949, my reps of camp of the hundred and thirty-fifth,\nesteem of the hundred and sixty-nine, canon of the hundred and seventy-second.\nDickey of the hundred and thirty-fourth, four to the hundred and seventy-fifth,\nand others, a bill relating to general provisions regarding aviation.\nHouse resolution 999, my reps of cocks of the twenty-eighth,\njaspers of the eleventh hatches of the hundred and fifty-fifth,\nfinish of the twenty-third, bear out of the twenty-fourth,\nand others, resolution urging all Georgia citizens and cities and counties\nto remember an honor of the sacredness of America's 250th anniversary and the Declaration of Independence on July 4th, 2026 House Resolution 1000 by Representative of the 104th Williams of the 148 Dickey of the 134th Williams of 168th\nof the 137th and others resolution proposing a amendment to the constitution so as to eliminate the ad valorem taxis assessment of certain timber at sale and harvest house bill\n1,000 and one by represent bell the 75th and chances of the 42nd remand of the 97th holiday of the 116th between the 61st and others resolution expressing support for ethical investment of all state funds and public resources house bill\n1,000 and seven by represent Jones on 25th Oliver of the 84th Scott field of 63rd density 13th and 169th and others resolution technology and the effectiveness of arts for health initiatives in improving mental health\noutcomes House resolution one two thousand eight by represent Smith of the hundred of the 70th\nDickey of the hundred and thirty fourth quarter this hundred and seventy four thousand one hundred and seventy nine Smith of the hundred and thirty eighth and others resolution to ratify amendments of certain\nComprehensive statewide water management plan through second readers oh\nSenate bill 214 by senator Burns of the 23rd Williams of the 25th more of the 53rd Harbour of the 16th due to the 51st and others\na bill relating to elections and primaries generally through second readers.\nWell, we have no reports of standing committee, so we'll move on to morning orders, Chairman\nMilton, Jim or if you'll hold just for a minute.\nAll right, members, we are moving on to completing our day.\nWe have members that want to share with us that have,\nwe have some visitors here.\nI'm sure each and every one of you would like to have your message heard when you come\nto the well as we honor some visitors we have in the gallery so members please take seats,\nthis conversation, or take it to the any room.\nPretty simple equation.\nLet's do it one more time we got close that time members please take seats.\nThank you members chairman Hilton recognize for a morning order careful the mic all right\nthank you mr. Speaker I am honored members to welcome to the Capitol today the best girl\nScout Troop and all of Georgia. Troop 18176, can you please stand up and have the members\nrecognize you here. Thank you. They are in a join us. They are in seventh grade or a\nlittle upset with me about cell phones, but their parents love me. Thank you girls. Have\nHave a great day.\nNo comment.\nIt's good to have y'all in the house with us.\nHe is a pretty good guy.\nI have to vouch for it.\nThank y'all for being here.\nAppreciate the Girl Scouts too.\nWe're looking forward to some cookies when that time comes around.\nYeah.\nWon't be long with it.\nThank y'all.\nFirst clerk, will you read the caption to a group of privileged resolutions?\nRecognizing and commending Bishop Dr. Eddie Lee Stevens, commending the Seminal County Youth\nPoll Worker Initiative, recognizing commending the executive director staff and members of\nthe Golden Triangle Resource Conservation and Development Council, commending and graduating\nClara Dawson-Baxon.\nRecognizing commending,\nGaraldon County Chief Ranger Roger Todd\nof the Georgia Forestry Commission\nis a recipient of the 2025 Directors Award\nand for his outstanding servant,\nState George,\nrecognizing and commending Dr. Anthony W. Smith,\ncommending and congratulating Lucille McMulloch,\nrecognizing and 26, 2026,\nthis Georgia Association of Broadcasters Day,\nand commending 2025, 2026, 4-H leadership teams,\nand award recipients in recognizing February 26th,\n2026 is 4-H day at the state capital,\nand for other purposes, that completes the reading\nof the privilege resolution.\nIs there any objection to adopting the privilege\nresolutions here in none the resolutions are adopted?\nOkay, we have some afternoon orders in the morning, but before we start, in case some of you\nneed to leave early before we adjourn, of course we all know the state of the state is tomorrow.\nWe will get started promptly at 10.\nThe governor would like to get started promptly at 11.\nThe Senate will be coming in.\nI think some of them already tried to infiltrate.\nI saw Senator Burns in here a while ago.\nSo they'll be coming in about 10.45.\nSo that kind of gives you a time frame of what we need to be doing.\nSo we'll be ready to get started with the governor.\nIt is our year to host, if you will, and we always do a great job doing that anyway, but\nit is our year, so we will be on time and we will be prompt and we will be welcoming\nto our friends from across the hall and certainly welcome Governor Kimp here for his last\nstate of the state of the dress.\nThank you members.\nI hope all of you will be able to be here tomorrow.\nWith that, we will go on to afternoon orders.\nWe have a number, I'm sorry, I can cover it up there now, we have a number of afternoon\norders we're going to start with representing the claim. Before you get started my\nfriend, representing doing the claim, I'm going to adhere to a time schedule as we\nwork on through this session so don't have a little bit of flexibility today so\nwe'll ask everyone to complete their afternoon orders in two minutes. Two minutes.\nI mean, did you think you need 20 or, well, let's see if you can do it in two.\nI mean, you are a former football player, so I don't have to, this is a two minute warning.\nWe'll give you two minute warning when that gentleman's recognized.\nThank you, Miss Speaker.\nColleagues, I just want to make sure all you are aware that the working families,\ncaucus, lunch, and will be tomorrow.\nOh, Miss Speaker, this is a wild, this is a great, this is pretty good.\nAnd working on that thing is working better in there.\nYeah, you need to kind of hold it down, son.\nCan I start over with speaker?\nYeah, we reset the clock for you.\nAgain, thank you, Mr. Speaker.\nColleagues, I want to make sure, just you all\naware that the working family caucus will meet tomorrow.\nThursday, January 15th, upon adjournment after the governors.\nThe Georgia FLCO will present their legislative priorities and will be in room 310 and CLEB.\nAnd that is tomorrow.\nThank you, Mr. Speaker.\nThank you, Representative McClain.\nI think the equipment is starting to be more normal, so I know I've tried it very close\nto the microphone and then back in a way.\nI think now you can take your normal distance from the microphone and it seems to be working\nproperly.\nLet's try that.\nI don't think you have to get close to the microphone.\nYou did a great job, by the way.\nThank you so much.\nRepresentative Moore.\nRepresentative Angela Moore is recognized for an afternoon order.\nThank you, Mr. Speaker.\nI was a little busy trying to find my 10W30 to get out of my chair today.\nYou can bring some for everyone tomorrow.\nHello, colleagues.\nThank you all for giving me your attention.\nI put on your desk today the flyer about our young girls\nwho are in need of gowns for their graduation dance\nand their ball that will be coming up soon.\nSo I'm asking each and every person that can hear us.\nIf you all would please donate a gown for their prom,\nwe would love to have it.\nWe are in association with Princess and a pad\nto help children in high school who are graduating\nto be able to take their gown to the prom this year.\nThose who cannot afford a prom gown\nwill be afforded one through this program.\nIf you, your wife, your aunt, sister,\nnext door neighbor or friends have a gown,\nplease drop them off in my office\nin the club building 4-1-1.\nThank you so much.\nThank you representing more. That's special I'll come over and check that chair out\nRepresentative of DINIA, there you are, I couldn't find you.\nGood morning, how are you?\nRecognize from afternoon order, my friend.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday we have on your desk your beautiful flyer and it's for the Georgia Legislative\nBlack Caucus meeting today, the weekly meeting, will be held at 3 p.m. CLOB 310. Today's\nspecial guest is Georgia Alliance. We look forward to hearing from them. In addition,\nthere's a letter attached, welcoming all members back, and we're getting ready for a very\ninteresting session. Thank you, Mr. Speaker. Which room was that? CLOB 310.\n310. Thank you, sir. Thank you. Mr. Chairman, Dickey, what are you up to this afternoon?\nYeah. I want to wait and find out. Well, the gentleman's recognized for an afternoon order.\nThank you, Mr. Speaker and colleagues. I want to take a quick moment of personal privilege.\nToday is my and Cindy's anniversary. And she is a great partner with me. And I just put her back home at the farm taking care of my\nbusiness and our family. Thank y'all. That is very kind. I got to introduce to her\na long time ago. We were teenagers at high school and she stuck with me through\nthick and thin for a long time and I just want to tell our loved one and thank\nyou for all she does for our family. I wanted for wife, mother, and grandmother so\nHappy anniversary.\nA beautiful lady.\nAnd we appreciate her and what she's done for Georgia as well.\nAnd what she continues to do for Georgia.\nNot just your family, but all of our families in Georgia.\nCindy, we love you too.\nThank you.\nGood job, Mr. Chairman.\nYou're back in good graces.\nI'm not sure if you're out of them, but you're in good graces now.\nNow, Representative Bale is recognized for an afternoon order.\nRepresentative Bale.\nGentlemen's recognized.\nGood morning, colleagues.\nAnd what a joy it is to be back with you today.\nBefore I start, I would just like to know,\nlet you all know how much I love you.\nI love this state, and I love this nation.\nSo in our nation, a mother, a wife, a daughter,\nwas killed on American soil.\nHer life had a purpose.\nHer life had value.\nAnd her life mattered.\nDr. King reminds us that the measure of a nation\nis not found on the strength of his forces,\nbut on the depth of his conscience.\nWhen the mother is taken from her children,\nwhole country is diminished. When the power is exercised without restraint, liberty\nitself is at risk. Now let us say it plainly. As someone raised to respect the law, order\nand the rule that stands for all of us and that no one stands above it, America is the\nstrongest, the authority is disciplined and accounted for. The government that acts\nfor our very trust is niece earned every day.\nBad actions by anyone wearing a badge\nor holding the title is dishonor\nand dishonor to the good men and women\nthat serve our nation faithfully daily.\nWe can believe in both borders\nand still in human dignity.\nWe can stand for enforcement\nand still stand against injustice.\nWe can put America first.\nWe can put America first\nwithout putting compassion down.\nRenée Nicole Good should still be alive today.\nHer children should still hear her voice.\nIt is the republic that must endure.\nIt is our democracy that must endure.\nAnd with her death, it must not be ignored, excused, or buried.\nAs a great Georgian once said and taught us, the arc of the moral universe bends towards\njustice, but only with patriots that are brave enough to bend with it.\nLet us honor, let us honor Renée Nicole Goodman, not with empty words, but with truth, accountability,\nand renewed commitment to our nation\nto protect life, liberty, and justice for all.\nBecause that is what America means to put America first.\nThank you, colleagues.\nGeorgia first.\nThank you, Representative.\nThank you Mr. Speaker ladies and gentlemen I'll be brief I know that this session has gotten\noff to a quick start this year it feels.\nMember of law enforcement myself is an assistant district attorney knowing the judicial process\nlike I do.\nI just feel compelled to come here to this well to say that the rule of law is what rules\nin this country that there's an opportunity for review.\nAny time that national politics are going to influence the debates and discussions that\nwe have here at the state capital, potentially we may be doing so with more of a political\nslant than policy-driven approach.\nAnd what I would just say is this, we back the blue here in Georgia, the caucus that\nI lead has been very clear about that, that we have no intent of doing anything differently\nand it's proud as a proud member of the caucus that I serve as majority leader for, intend\nto do so here in the future.\nThere's an opportunity for discussions and investigations to take place, but at the end\nof the day we cannot allow the rule of law to be criticized or influenced in such a way\nthat it gets us off track from focusing on the needs of Georgians here in our state.\nWith that in the speaker, I yield the well.\nThank you, Representative.\nThat concludes our afternoon orders.\nWe'll move on to announcements.\nsince you've Chaz Cannon.\nRepresentative Chaz Cannon is recognized for an announcement.\nThank you, Mr. Speaker.\nYou got an invite on your desk yesterday, an email from me\nyesterday about keeping Georgia wild tomorrow.\nIt's in the South atrium steps from 8 to 11.\nThe governor will speak around 9 o'clock,\nspeaker will speak about the same time.\nLieutenant Governor Jones and among others,\nCommissioner Ray Buns, invite you to come\nto keeping Georgia wild day tomorrow, eight to 11\nin the South atrium steps.\nHope to see you there.\nThank you, Mr. Speaker.\nNot about wildlife, that's what I thought.\nAnd the coast, absolutely.\nGood spot.\nNeed any frustration you have an announcement?\nNot that announcement, but an announcement.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House,\nthere is a committee chairman's lunch today\nupon a German in room 403 of the state capital.\nUpon a German room 403 of the state capital.\nThank you.\nThank you, Chair Lady Lynn Smith has recognized\nfor an announcement.\nWell, good afternoon colleagues.\nTomorrow morning, the House Natural Resource\nand Environment Committee will have a hearing\non House Resolution 108.\nIt is a hearing only and also an emphasis\non a little bit of education.\nIt's been a long time since we've addressed issues\nsuch as this.\nSo it's a full committee meeting tomorrow at 8 o'clock\nin room 606, CLAB.\nThank you.\nThank you, Chair Lady.\nThat completes our announcements.\nComplete our announcements.\nThank you members for your attention today.\nHope you have an opportunity to visit\nwith some home folks if they're up here.\nSo with that, I'm going to recognize the majority leader for a motion.\nThank you, Mr. Speaker.\nI move that this House stand adjourned until Thursday, January 15th, 2026 at 10 o'clock a.m.\nTimes flying on the motion of the majority leader.\nThis House stands adjourn until 10 a.m. Thursday, January the 15th, 2026.\nAll those in favor will say aye.\nAll those opposed, no.\nYou guys with no's are getting closer.\nThe a's clearly have it.\nSo it sounds up here.\nThis house is adjourned.\nThank you, members.\n",
  "updated_at": "2026-02-12T01:28:34.336534+00:00"
}