{
  "video_id": "rqC-ej9A-EE",
  "url": "https://www.youtube.com/watch?v=rqC-ej9A-EE",
  "title": "Georgia Appropriations Subcommittee 2026  - Day 8 PM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a summary of the Georgia Georgia Appropriations Subcommittee 2026 - Day 8 PM Session:\n\n**Overview**:\nThe session featured an update from the Georgia Department of Transportation (GDOT) Commissioner on transportation funding challenges, including federal budget uncertainties and the rising costs of construction materials and labor.\n\n**Key Actions**:\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- The Commissioner praised the dedication and hard work of GDOT crews who responded to the recent winter weather event in northeast Georgia.\n- The Commissioner provided an overview of the complex federal transportation funding process, noting concerns about potential federal government shutdowns or delays in passing a budget.\n- The Commissioner presented data showing significant increases in the costs of highway construction materials and labor over the past several years.\n\n**Votes**:\nNo recorded votes.\n\n**Attendance**:\nA quorum was present.\n\n**Adjournment**:\nThe session adjourned on time to accommodate the next committee meeting.",
  "transcript": "Good morning. This is the uh\nsubcommittee on transportation\nappropriations uh meeting uh jointly\nwith the uh transportation uh policy\ncommittee. So appreciate everybody being\nhere. Feel free committee members to\nmove up to the front where the packets\nare out on the table if you don't have\none in front of you. They're on the\nfirst three rows or first two rows it\nlooks like. appreciate our staff uh\nDavid and Danny getting those making\nthose available to all of us. And um\nlike I said, I'm John Leood, chair of\nthe subcommittee on appropriations. Uh\ngood to be with you. We're going to hear\npresentations today uh from the DOT and\nuh and SERTA\nand uh I've got uh chairman Rick\nJasper's uh with us and I'm going to ask\nhim to uh if he has any remarks\n>> just real quickly. Thank you members for\nbeing here so early. Thank you chairman\nLe Hood for putting us together. I know\nit'll help Russell Janine with their\ntime not have to come to another\ncommittee meeting if we go ahead and\nknock this out. I just want to recognize\nuh we have a DOT board member, Joe Stein\nfrom for South County. Joe, you stand up\nso they can see and welcome you being\nhere this today.\nAnd members, I want to also let you\nrecognize Danny Nichols.\nDanny's right down here on the end. You\ncan stand up so they can see you. You\nknow, she's our policy analyst, you\nknow, this year and we're glad to have\nher. Thank you, Mr. Chairman. back to\nyou.\n>> Thank you, chairman.\n>> Thank you, chairman. Uh I second what uh\nChairman Jasper has said. Uh you know,\nwe lost Abby Day, who was had been here\nfor uh for I I had to call her out.\nYeah,\n>> she was a wealth of knowledge to me as\nmy first year in this this role last\nyear, but uh but Danny and uh David have\nreally picked the ball up and I don't\nthink we skipped a beat. Abby, you you\nprepared us all very well. So, thank\nyou. Uh we will go ahead and get\nstarted. We have an hour. Uh we're\nalready seven minutes into it because\nrules is meeting in here at 9ine. So uh\nCommissioner McMurray, if you'll go\nahead and come up and uh present your uh\nshow us your presentation\nto both chairman, thank you for\ncombining this. We do appreciate that.\nNothing like efficiency. So thank you\nall for pulling this together. But I do\nwant to take a point of privilege just\nfor a minute to thank the women and men\nof God do and of all state government in\nfact for the work that's been going on\nsince uh last Thursday to Friday where\nwe started getting ready for this winter\nweather and u and uh they did a\nfantastic job. Dedication and commitment\nof the men and women of GA is just\noutstanding. Uh we had people that left\nhome on Friday morning and uh some of\nthose are just going back home today. Uh\nso uh we bring up our crews from Tiffan\nand Jessup districts. Uh anytime there's\na winter weather event across metro\nAtlanta, they come up and they're\nthey're actually, you know, uh brining\nand plowing the interstates here in\nmetro Atlanta and our other districts\nwork our way north. So uh they did a\nfantastic job. I've yet to get the final\nnumbers, but we put over two two million\ngallons of brine out and uh at one point\nwe were about 3,500 tons of salt, 2500\ntons of aggregate spread and again 12\ncontinual 12-hour shifts. This morning,\nthere's still I believe uh as of the\nreport I had this morning, I think seven\nstate routes that are still closed at\nsome point. Those hardest hit counties\nstill are Haberssham, White, Union\nTowns, Raen, sort of that northeast\nGeorgia corner. U we call it the Golden\nTriangle from where I'm from. A\nbeautiful place, but still uh still\ndealing with that power lines, trees and\npower lines, but uh working to get those\nroads open. And also a big shout out to\nour GEMA team who leads they're the\nquarterback GEMA for leading this and\nthe Department of Natural Resources and\nGeorgia Forestry Commission for their\nchainsaw strike teams. they've been\nworking very hard to get the trees out\nof the road so we could uh get the roads\ncleared out. So, just wanted to\nacknowledge that. Uh what I want to do\ntoday is uh walk you through some\nimportant data points uh relating to\ntransportation and the cost of doing\nbusiness because we really need to\nunderstand those cost as it informs us\nin the budgeting process. And I want to\nalso share some of the uh outputs and\nsome of the outcomes from a couple of\ntwo budget years. the current budget\nyear and last budget year to show you\nhow we're deploying the resources that\nyou have afforded us when you approve\nthe budgets. And then finally, I'll just\njump into this budget this uh amended\nbudget year FY amended FY26.\nAnd when I spoke here to joint\nappropriations, I talked about\nacknowledging some realities. So, one of\nthe realities I need to acknowledge is\nwhat's happening on the federal front\nbecause the federal funding to Georgia\nDOT is still very important at somewhere\naround 1.5 to 1.6 billion a year and we\nall know that the federal budget year\nbegins on October 1st. Uh, and I think\nyou everybody is aware at the federal\nlevel that we're operating under a\ncontinuing resolution to January 30th.\nAnd when we walk when we work under\ncontinuing resolutions federally, the\nway it hap the way the money flows from\nthe federal government is they give you\na daily prata share of your total\nbudgeted amount. And so you get 100 one\n365th share for the days to get us\nthrough January 30th. Well, that's\nreally not a way to run a business\nbecause when we do a project, we need to\nfully fund a project. I can't daily give\na daily pro prorated share to a project.\nNow I think everybody has seen at\nCongress uh last week the house passed a\nmini bus that had four big budget\nprograms in it and uh that included the\nUS Department of Transportation which\nhas the federal funding in it. Uh that\ndid pass the house. I think you've seen\nthe headlines recently. Uh the Senate\nseems to maybe want to decouple one of\nthose budget programs out of that mini\nbus that's passed. And so uh I'm not\nsure what that means, but it means we're\ngetting really close to Sep I mean to\nJanuary 30. Uh and if it doesn't happen\nthen there potentially again a a\ngovernment shutdown or the stop of\nmoney. Uh so we're watching that very\nclosely. The other thing we do every\nyear is the federal government allows\nyou to do a IOU. And so basically, you\ncan pay it forward with a Georgia dollar\nand when the federal budget passes, the\nfederal government will reimburse you\nfor the money that you expend it. They\nthey they approve everything along the\nway except the money. They just say,\n\"Here's an IOU.\" And it when we get to\nthis point of the calendar year, we pay\nit forward to keep projects moving. We\nwant to keep projects moving as fast as\nwe can and not delay projects, but we're\nusing our state budget to do that. And\nat this point of the year, we've used\nand consumed our state budget, which\nshould be federal uh in our state budget\nto do state funded projects. So, we're\nabout to we don't want to get ahead of\nour skis and uh expend all our money uh\nwaiting on the federal dollar. So, it\ngets to be a tricky point of delivery.\nVery complicated budgeting process. uh\nuh certainly accounting process, but\njust wanted to highlight that because if\nthere's a shutdown at this point or this\ngets delayed more, it will impact our\nability to advance projects either uh\ndesign right away and certainly for\nconstruction phases on federally funded\nprojects. Uh, so if that's not good news\nenough, on this next slide, I'm going to\ntake you a deep dive early in the\nmorning into some into a chart here that\nI've I've shown I've shown both the uh\nsubcommittee and the transportation\ncommittee over the last few years and\nit's really the the inflationary costs\nrelated to transportation. So this\nchart, this complicated chart comes from\nFederal Highway Administration and the\nred line tracks actually the cost of\ndoing business from around the nation\nfor highway construction. So they index\nthe cost of highway construction from\nactual bid data from every state. And so\nyou can see that's the red line and\nsince 2021 it's increased by about 70%.\nSo the index has gone up 70%. So you can\nsay there's 70 it cost 70% more on\naverage across the nation uh than it did\nin 2021. The CPI that we all everybody\nyou know knows about and understands is\nthat blue line. So I think it's pretty\nstaggering when you see what CPI is\ndoing compared to what the cost of\nconstruction is. The other index here is\nthe dashed sort of yellow line across\nthe bottom. Sort of gold maybe sort of\norangey looking. That's the employment\ncost index. So that's another index of\nthe cost of employment. And then the uh\ngreen line is called the producer price\nindex which is a key indicator for\ninflation uh based on the production of\nlevel of goods uh like from mining,\nmanufacturing and agg. So those again\nare sort of an indicator. But what's\ninteresting about this is you can see\nthat the red line, the highway\nconstruction cost index outpaced all\nthose others, especially from about 2022\non on. So what does that mean locally\nhere in Georgia? Uh we're we're probably\na little better than average on a few\nthings and worse than average that red\nline on some. And let me just talk\nthrough a couple of those. This is this\nchart looks back to FY21 to FY25.\nAnd just simple resurfacing a two-lane\nroad has increased in cost by 51%. So\nright now to do a two-lane road, it's\nabout $251,000\na mile to do two lanes, one lane in each\ndirection. Widening from two lanes to\nfour lanes, either if it's urban or in a\nrural setting, our actual low bid\npricing has increased 99% for urban and\nabout 90% for uh rural widening. So\nbasically doubled practically doubled in\ncost over those last four budget years.\nRoundabouts, we talked about\nroundabouts. Uh Chairman Powell and I\nwere just talking about roundabouts. You\ncan see that they've increased by about\n47% and we just we compare that to the\npave surface. Uh so you know over those\nlast four years in bridges, bridges are\nimportant to everybody. I'm going to\ntalk more about bridges. Uh bridge\nreplacements increased by about 93%. So\nyou can just see in those four years\nthis really increased cost. Down at the\nbottom of the small table at the bottom\nis some of the breakouts of the\ncomponents of these projects such as\nasphalt, aggregate, you know, storm\ndrain pipes, bridge beams, and\nguardrail. And you can see they range\nfrom 90% on pipes and things like that\nto a low of about 35% for guardrail\nmetal. And uh that number actually has\ncome down. steel steel prices were\nreally high back began after co and uh\nthey have retreated some back. So again\nI just show you this to show you as we\nthink think about budget is how far does\nthe money go, what are we using it for?\nYou can sort of see the realities of\nthat. This next chart is we took that\nred line from that first chart I showed\nyou and then index the budget our state\nbudget compared uh over that same time\nframe. And it's no surprise but\nbasically what I told you is the\nconstruction costs have gone here and\nour and our budget has increased thank\ngoodness for that uh over the years. Uh\nso the the inflation nationally has\nincreased by for construction about 70%\nour budget about 30%. So that gives you\nthe difference of the loss of buying\npower if you will to do what we need to\ndo. So what does this really mean and\ntranslate and I showed this at joint\nappropriations uh and Janine Miller's\nhere who uh you'll hear from in a little\nbit but working through the planning\nprocess in her role as the planning\ndirector we have to live in a four-year\nphysically constrained budget process of\nphysical constraint versus project. So\nwhen project costs go up, what happens\nis we have to take a project and move it\nfrom the current year it's in to a ne to\nthe next year is usually what we do. And\nso then when you do that, you just\npushed another project out of the next\nyear because you were already constrain\nphysically constrained. That that line\nacross the middle of those boxes is\nphysical constraint. So this increased\ncost is just caused us to cascade\nprojects out. And I sort of joked around\nat joint appropriation saying I'm pretty\nsure each of your projects is the most\nimportant project in the state in your\ndistrict more so than your counterpart\nnext to you. So uh y'all can debate that\nlater but uh I got a fill in your\nprojects number one. So it's never fun\nwhen we have to come say tell you that\nwell we're having to shift your project\nout a year or two uh and simply because\nof the funding situation of these\nincreased cost uh with even again\nincreased revenue at the state level um\nfederal level is a whole another story I\nwon't get into at this moment but that's\nsort of the process we have to go\nthrough which is never fun and we of\ncourse anything we can do to advance\nprojects sooner than later now here's\nthe good news story I want to go back\nbecause again with a sincere thank you\nuh to both the house and the senate and\nthe governor's budget the last two years\nwith the state general fund infusion in\namended 24 of uh $1.5 billion and $1\nbillion last year's amended budget. You\ncan see now that our budget line went\nabove the national highway construction\ncost index for the last two, which means\nwe're we didn't lose ground that we\nactually maybe gained a little bit of\nground on those last two budget years.\nBut the difference between there on 2020\nto about 2023 where we're below means we\nstill have more projects uh ready to go\nthan we have budget for. But I just\ncan't say enough about those last two\nbudget years from leadership from the\nHouse, Senate, and the governor to put\nthat money in the budget to do what it's\ngoing to do. So, let me show you what\nthat money's done. Again, trying to set\nthe table as we look forward on the on\nthe amended 26 budget. We look back at\nthose amended budgets, uh, 24 and 25,\nand this is where the money went. Uh,\n$98 million went to airport aid. Uh we\nalways have about three times more\nrequests than we have funding for\nairport aid. And so this was a big big\nstep. About half of that money though\nwent to a replacement airport down in\nGriffin Spalding County that if we did\nnot have the money, the Federal Aviation\nAdministration was going to take back\ntheir commitment of funding which was a\nbig part of that. So, we were able to\nget secure that FAA funding and leverage\nthose state dollars and also do a\ntremendous amount of work around our\nlocal airports across the state. The\nlocal roads funding is that money to\ncities and counties that's Elmig like\nthat most of you are familiar with the\nElmig money. We send this money out by\nformula to cities and counties based on\npopulation and road map road miles 250\nmillion and 265 million respectively\nwhich basically double their LMIG amount\nand again putting it in this budget\ncategory called local roads admin uh\ntook away the match component because\nLMIG has a statutory match component\neither 10% if you're in a tier region\nwhich many of you are in and if you're\nnot in a tier region it was a 30% but\nthe local roads admin did not require\nmatch patch. We got that money out very\nquickly in both years. Uh and most all\nthat money was used by cities and\ncounties for resurfacing. Again, state\nof good repair. Their reality has been\nthe same as ours, increased paving cost.\nThe next uh bucket there is the freight\nprogram which is a big program at 500\nmillion each year uh which was a new\nprogram uh that was stood up just a\ncouple of budget years ago coming out of\nthe freight uh and logistics plan that\nwe did which uh came through uh chairman\nJasper's committee and basically move\nforward to establish a new freight\nbudget program for us. I'm going to come\nback to that one in a moment. Uh, next\nis the capital construction. Uh, 593 was\nin amended 24 to address the very thing\nI just showed you where we're had to\ncascade projects out into the future\nbecause we didn't have money. In fact,\nout of that $593 million, we were able\nto advance 44 projects. 25 of those\nprojects of the 44 were ones that were\njust delayed that we we they were ready\nto go. We just needed the money. And in\nfact, when we did those 25 projects from\nwhere they were budgeted at, we sped\nthem up by 40 project years. So if a\nproject was sitting in two physical\nyears out and we moved it in, we call\nthat two project years. So 25 projects\naccelerate it by 40 project years, which\nis amazing. And we know the longer you\nwait, the more it cost as well. And we\nalso added 19 project phases that we\nknow we needed to be working on, but we\njust didn't have money to get started.\nSo that's where that money went. capital\nmaintenance was 50 million and amended\n24 to address that resurfacing numbers I\nwas telling you about it being 51% more.\nUh so that helped us there. And last and\nvery importantly,\num as I talking about Representative\nTaylor just ago, the 200 million for\nHurricane Helen and Debbie cleanup and\nthe storms we had in southeast Georgia\nwent into our maintenance budget. And\nwithout that money, we would absolutely\nhave been devastated in hurricane\ncleanup. In fact, still I dealt with uh\ntalked to Columbia County just yesterday\nwhere had a request from Columbia County\nstill deal we're still dealing with\nthose impacts or those costs that are\nstill out there. And as I told Joint\nAppropriations, uh so far we've had\nabout $48 million from FEMA\nreimbursement. And so it's it's you know\nhere we are a year a year and a year and\na half or so post that and still you\nknow working on reimbursement. So this\nmoney was very very important. Now,\nthat's what you appropriate it and\nthat's where we're going to use it. Let\nme show you how it's been utilized. The\nmaintenance money we've this is\nexpended. So, these are dollars in and\nactually paid out to contractors. 100%\nof that money has been done. The capital\nconstruction that 593 69% of that outlay\nhas gone out, meaning work has been\ndone. And then the last two categories\nare the freight that 500 million in each\nyear. As you can see, those numbers are\nsort of lagging a little behind, but\nthere's a reason for that. Uh, again,\nthat was a new budget program, and we're\nadvancing a lot of projects there that\nwere freight ready. And then several of\nthe big ones on the next slide are what\nI call the big three out of that uh are\nprojects that we will bid this calendar\nyear. So, these projects will come to\nbid this calendar year. First one is\nI16, which is roughly $516 million,\nuh, which is a combination of amended 24\nfunds and amended 25 funds to widen 31\nmiles of I-16\nfrom I95 there down in Savannah, at\nleast up to the Hyundai Meta Plant. Our\ngoal is to do a a variable, a fixed\nprice, variable scope contracting. So we\nsay this is how much money we have and\nthe contractor bids how far they can go.\nSo a very innovative way to try to make\nsure we maximize these dollars. Uh as we\nall know uh I16 has tremendous amount of\ntrucks 23% trucks in that area and we\nknow adding this third lane down there\nwill reduce uh delay by about 56% uh now\nand in the future. So again, very\nimportant for our economic uh economic\nopportunity that comes out of the port\nand everything that's moving that\nfreight moving up I16. So that's that's\none project. The next one is I95 uh four\n$74 million to wide I95 from uh I16 to\nSouth Carolina. South Carolina is\ncurrently under construction to build\neight lanes on their side. We have six\nlanes on the Georgia side. So, we're\nsinking those up again with traffic\nvolumes down there that are continue to\nexpand and grow due to all the freight\nuh commerce that comes out of the port.\nAnd lastly, out of the big three is 135\nmillion to complete the last segment of\nState Route 96, which is that connection\nfrom I75 to I16 south of Mon uh there in\nHston and Twigs County. We have this\nproject ready to bid. Uh it's uh the\nabout nine miles with a major river\ncrossing in there, too. So, those are\nsort of the big three that consume most\nof that freight budget. That's why those\nnumbers were lagging a little further\nbehind, but you can see that this\ncalendar year we'll be getting getting\nthat work out the door and uh seeing\nthose num seeing those dollars used.\nNow, Mr. Chairman, let me get into the\namended 26 budget from the governor's\nrecommendation. And again, I'm uh super\nuh excited and very grateful for the\ngovernor putting in roughly $2.3 billion\nof additional state general fund money\ninto the G DOT budget. And so, let me\nwalk through sort of the big buckets of\nwhere that's going, starting with hund00\nmillion to address rural bridge\nreplacements. And so, uh, we have\nliterally, uh, you know, hundreds of\nmillions, if not more, of bridge\nprojects that we know we need to do, but\nwe don't have the funding to do. And so,\nthis $100 million is going to be used\nstrategically to support a and timber\nindustry in the rural parts of the\nstate. So, we're going through the\nprocess now of doing a triage of where\nare these bridges? We're trying to make\nsure they're tied directly to some a\nproduction or some timber facility\nproduction uh that we're replacing\nbridges strategically. So, it's taken us\na little bit of time. I know I wished I\ncould give you the list of what that is\ntoday, but we're working through that\nbecause we're we're doing several saves\nand analysis and saying, \"Okay, what\ndoes this one serve? What's this\nbridge?\" So, this will be a combination\nof county bridges and state route\nbridges, but really try to again uh\nstrategically advance those. And our\ngoal would be that we would deploy these\nbridges either in this budget year or\nnext budget year to be bid, not put them\nall out at one time, but make sure we\ncould be strategic about getting these\nbridges $100 million of strategic bridge\ninvestment out over the budget year and\nnext. Next is uh was 200 million to the\n316 corridor. For the last six to seven\nyears, uh, we've been really focused on\ntrying to improve safety along State\nRoute 316 in Gwynette, Barrow, and Okone\ncounties, roughly 40 some odd miles, uh,\nbetween Athens and sort of metro Atlanta\nthere in Gwynette. What we've been doing\nis trying to address the the safety\nconcerns that exist, I'll get into that,\nby replacing intersections that have\ntraffic lights with either interchanges\nor overpasses or making some kind of\nother access improvements along this\nvery critical corridor. And uh our focus\nat first was where the traffic signals\nare because that's where the most\ncongestion is. That's where you have a\nlot of crashes. And so we've been\nunderway. And on this next slide, you\ncan sort of see all the intersections\nfrom left to right. 30 32 some odd\nintersections along 316 where the\ntraffic really varies greatly from about\nalmost 30,000 vehicles per day up to\n108,000 vehicles per day with 12% of\nthose being trucks. So it is a freight\ncorridor. But the staggering number here\nis there's about 1,300 crashes per year\non these on this segment. In our 10\nyears of data, we went back 10 years. So\nthere's there's been 65 fatal crashes on\nthis corridor in the last 10 years. If\nyou do that math, that's six and a half\nper year. That is not where we want to\nbe. In fact, the crash rates, we look at\nrates. So that sort of equalizes things\naround the state. Uh six of the\nintersections are in the top 50 worst\noffensive intersections for crashes and\nthree more are in the top 100. So you\ngot nine out of the top 100 worst\nintersection locations on this corridor.\nAnd then the other thing we look at is\ncrash severity. So you have a crash, how\nbad is it? So the most severe crashes,\nthe ones you don't want to have uh for\nthe intersections are higher than the\nstatewide average and one is double the\nstatewide average. So you can see the\nthe crash issue we're dealing with from\na safety point of view. The good news is\n18 of those intersections are actively\nbeing addressed or have been addressed.\nUh but this last $200 million, this $200\nmillion would go a long way to continue\nsort of the 12 to 13 remaining\nintersections that we just really didn't\nhave funding for. If you look down at\nthe bottom right for the legend, I know\nit may be hard to see, you have yet sort\nof the yellow is intermediate and\nlong-term. The yellow intermediate means\nthat we may have like design underway,\nbut we didn't have construction funding\nor rideway. The the black uh is\nlong-term, meaning it's just not funded.\nSo, you count those up, there's, I\nthink, 12 or 13 of those that this $200\nmillion will absolutely allow us to\nstart addressing. So, we end up with a\ncore the entire corridor that is not\nonly improved safety, but also mobility\nin a growing area, especially in in the\nBarrow and Okone County areas.\nNext out of the state general fund in\nthe governor's budget was the $250\nmillion of local roads administration.\nAgain, that elmiglock money. Uh I can\nabsolutely tell you that I've heard from\nACCG and GMA. They're fully supportive\nof this. Uh cities and counties and I've\nhad no city or county complain about\nthis money, by the way. So, I think you\ngot unanimous consent that everybody\nlikes cities and counties. Again,\nthey're they're facing the same\nrealities we face with increased costs.\nAnd the other thing is we we get this\nmoney out very quickly. We would open we\nwould open the portal as probably as\nsoon as the budget is passed and then\nshut it off right before uh July 1 so\nthat the money is committed in this\nfiscal year and the cities and counties\ncan have use of it immediately.\nAll right. Next, this is a really big\none. I shared this same slide at joint\nappropriations. Uh these are state\ngeneral fund monies uh that is listed\nunder our budget item payments to SERTA.\nYou're going to hear from Janine Miller,\nthe executive director of SERTA in just\na little bit, who will provide a lot\nmore detail about some of the data\npoints on I75 South Express Lanes. But\nwhat I can say about this is this\nprobably been the most po popular budget\nitem uh that I've heard about from many\nof you and many of my friends uh from\nthe announcement the governor made at\nEggs and Issues. It appears that\neveryone is really a big fan of this\nproject because I do think it has such\nstatewide impact. It affects everybody.\nIf you live south or north, uh it\naffects you one way or another. You\nknow, I asked during joint\nappropriations, uh, did everybody, did\nanyone ever think the express lanes was\ngoing in the wrong direction? And it got\na pretty big chuckle. Uh, so I'm\nassuming that meant yes. Uh, but what I\ncan tell you when the direction that\nthey're going in, uh, most people\ncriticize us saying those lanes don't\nlook like they look like they should be\ngoing the other way. Well, when you open\nup two more lanes where it's two lanes\nwide, you add it 67% more capacity,\nwhich then makes the normal lanes look\nmore empty than they were because that's\nthe benefit of having those two\nadditional lanes. So, uh it's amazing to\nsee the difference and they are always\ngoing the wrong direction from you if\nyou're going the direction when they're\nnot open. Correct. And oh, by the way,\nit does take us some time to reverse\nthem. It takes takes an hour to two to\ngo through to make sure there's nobody\nin them, make sure it's safe, and then\nyou have to flip them around. So, that's\nsomething we have to deal with. Well,\nthis funding absolutely does some\ncritical things. It says on the slide,\nit's going to one, we're going to get\nrid of the directional the uh reversible\nlanes and make two lanes barrier\nseparated, mind you. Meaning there's a\nconcrete barrier between you and the\nother lanes the entire the entire 12\nmiles. that that's found foundationally\nwhat this money is going to do which\ngives us the money to do the design work\nthat we have to do to do the rideway\nacquisition that we have to do the\nenvironmental work that we have to do.\nThis will be a federal environmental\ndocument uh and then it's going to go uh\nto help support the overall construction\ncost which will still need a form of\nfinance uh and through SERA and that\nform of finance can come in many forms.\nIt can come through a US DOT tifia loan.\nIt can come from toll revenue bonds, but\nit's going to take more money uh to do\nthis and uh to get that objective of two\nlanes in each direction. Not only that,\num Chairman Hatchet asked, well, how far\nwill these go? And I'm not sure I\nanswered appropriately. I said Dublin's\nprobably a good place, but uh the point\nis I think you all know that you get\nstuck if you're coming north, you get\nstuck down in Locust Grove at Bill\nGardner Parkway. That's where traffic\nstops. And so we know that uh we need to\ngo further south with these express\nlanes. So, this amount of money is what\nwe need as a minimum to make sure that\nwe can leverage to do two lanes in each\ndirection uh in the 12 miles, but also\nlike I mentioned on I16, we'll make it\nvery innovative that we're going to make\nsure the money goes as far south as\npossible to try to again because we know\nyou're stopping before you even have the\nopportunity to get in the express lane.\nSo uh that's going to be our that's\ngoing to be our uh tact and strategy uh\nto do that. So um just again Janine will\nhave a lot more data points about how\nthe system operates today and the and\nsort of the data behind it and we can uh\nwe can talk about that one a little bit\nmore uh after she does her\npresentations. Now let me just jump into\nthe budget itself. So, you've got your\ntrack sheet in front of you. Uh, and but\nI before you get there, if you pull that\ntrack sheet up, you're going to see the\ntotal uh back on page three of the\namended budget. And so, I always like to\nremind everybody in the amended budget\nyear, the $71.6 million increase in\nexcise comes from the audited\ncollections from last year's uh motor\nfuel collection. So, that gets into our\namended budget. So motor fuel is uh is a\nis uh forecast but then adjusted in the\namended year for the actual audited\ncollections from department of revenue\nthat comes into us. That's why there's\nno change in transportation trust fund\nfees or the transit trust fund fees and\nthe amended budget. Those two budget\nitems look back two years. What it takes\ntwo-year look back is what we get\nappropriated in the year. So those those\nwill be an adjustment next year. And the\nstate general funds $2.3 billion. I just\nhighlighted the biggest part of that.\nBut that shows you that brings our total\nbudget to $5.2 billion. Again, very\nthankful for that state general fund\nmoney. This table is sort of a summary\nof what's on your track sheet. We've\naggregated a couple of those budget\nprograms together to show you where the\nfunding is actually used. And so I\nalways like to show this chart. Of\ncourse, the payments to SERTA is the big\none there at 1.8. There's a few other\nthings in payments to SERTA beside the\n1.796 billion. Then capital projects,\nthat's capital construction and capital\nmaintenance uh at $1.77 billion. Then\nyou have our routine maintenance budget.\nThat is that is hey that's snow and ice\nright now but uh uh preparation and\nresponse but that's the taking care of\nthe roadsides. I always say that's the\ntaking care of the house if you will uh\nof doing that in including a lot of\nmaintenance contracting. that's our\nstaff but also a tremendous amount of\nmaintenance contracting to do what we\nneed to do. Then you can see the LMIG\nand LRA uh combined there. Uh and then\nour general operations of the department\nwhich in this case we've aggregated many\nbudget programs together like department\nadmin traffic operations program\ndelivery administration planning and\ndata collection. So that that's sort of\nrun the department altogether. There is\nsome of the traffic operations that do\nthings. We have bond debt I'll talk\nabout in a minute. Uh we have our inter\nmodal which is aviation rail waterways\nand um that's like aviation rail\nwaterways transit. Uh so that's that's\nwhere that money is and then payments to\nthe ATL. So on the next slide if you\nwant to get your track sheet we've just\ntaken your track sheet and put it in\ntable tabular format here for the for\nthe presentation. Again, I want to start\nby saying a big thank you for the\ngovernor for recognizing the one-time\npayment of $2,000 for state employees.\nUh we certainly appreciate that. I'm not\ngoing to go line through line on those\nitems, but that totals about 8.6 million\nto G dot across all the budget programs\nwhere people are and that is so\nappreciate it. We really do appreciate\nthat. So, let me start at the top of\nthis table and I'm just going to\nhighlight a few things. Uh the geo bond\ndebt I think it's very important to talk\nabout. The good news is you can see that\nwas about a million $1.1 million\nreduction in bond debt meaning that our\ndebt is reduced uh for geo bond debt but\nour total bond debt or excuse me our\ntotal debt from various kind of bonds is\nstill $1.13 billion. So we still have a\npretty good credit card balance there\nthat we're paying down from previous\nbond packages. So I just want to make\nsure you're aware of that. Next is\ncapital construction. And I'm going to\nhighlight that one because again that's\nwhere that's where things get built. Uh\nthat increased excise number that you\nsaw on the last slide, we put 36.9\nmillion of that into the capital\nconstruction. And then the other plus up\nwas to 200 million in state general fund\nmoney uh for 316. So that that increased\nthat $236 million ad that circle. The\nnext circle there is capital\nmaintenance, which is line 47.3\nuh on your track sheet. Uh in capital\nmaintenance, uh there's the $100 million\nadded for the bridge replacements uh\nrural bridge replacements I talked\nabout. We'd uh asked for your support to\nactually get that in budget alignment\nwith the capital construction program.\nSo if we could shift that up into the\ncapital construction program, that would\nbe in alignment with the budget uh\nrequirements there. Uh and then uh that\nwas the big change there. Uh\nwhere we put that into capital\nmaintenance. Uh going down to LMIG. Uh\nLMIG is a minimum of 10% of the excise\ntax. So with the increased excise for\nmotor fuel collections, we made that $7\nmillion adjustment to the Elmig program.\nAnd then of course the big circle there\nis local roads admin that I've already\ntalked about at $250 million.\nIf you want to jump on your track sheet\nover to line 47 um\ntwo um or so uh then you can see routine\nmaintenance. I want to talk about that\nagain. Very important. uh taking care of\nthe house as I said uh we increased took\nsome of the excise 21.8 8 million of the\nX size we added into routine maintenance\njust to deal with the increased cost.\nSame those increased costs on\nconstruction go right into maintenance.\nIt's the same materials and also to help\nwith some of our equipment uh keeping\nour equipment up to date uh as it ages\nout. And so that's where that's going\nand plus some money for the $2,000\nsupplement. Uh so that that gives us the\n$26 million ad in routine maintenance.\nLastly, circled there is payments to\nSerta that we've talked about as it\nrelates to the I75 South Express lanes.\nSo, with that, uh, both chairman, thank\nyou for this opportunity. Again, I want\nto thank Governor Kemp for his continued\nthird year in a row for leadership of\nincreasing the transportation\ninvestment. Uh, that absolutely keeps\nGeorgia moving ahead. Uh, trying to keep\nour stance of the number one state to do\nbusiness going on the 13th, try to go\nfor the 13th year in a row. And this uh\nadditional funding absolutely will make\nlives better for Georgians all across\nthis bath state not just in metro\nAtlanta but across the entire state. So\nwith that be glad to entertain any\nquestions. Uh at your pleasure.\n>> Thank you uh commissioner. Very thorough\nreport u and appreciate you stewarding u\nyou know the these resources for the\nstate and keeping us safe on the road\nand uh 2.4 billion dollars added to your\namended budget. That's a lot. Yes, sir.\nuh and uh most of it looks like it's\ngoing to the u express lanes and uh\nwe're we're a little bit tight on time\nso we're going to be brief on the\nquestions and just ask you to be\navailable to the committee you know.\n>> Yes sir. afterwards. But uh if you could\njust explain you briefly um the the\nexpress lane the original project when\nwas that when was the peach length the\nuh express lanes put in and um how does\nit relate to today's u this new project?\n>> Yeah. So thank thanks for that question.\nUm it was bid in 2013 and opened in\n2018. Seems like yesterday, but it's\nbeen it's been a minute. So, uh, going\non eight years this summer, uh, being\nopen, uh, the original cost, uh, was\npretty good bargain as, uh, about $216\nmillion sort of all in. Uh, but I remind\nyou that what we had then was a median\nthat we basically filled in. Uh, and\nthere was only a couple of over there\nwas one interchange overpass, uh, that\nwas redone and one bridge over I75 that\nhad to be redone. Everything else\nsqueezed in. So, uh, so you go back to\nthose numbers and you say, \"Wow, why\ncan't we why can't we do it for that\ncost?\" Well, I look back at the that\nnational highway construction cost index\nnationally. Uh, and uh, over that time\nfrom 2013 to 2024, there was 111%\nincrease in construction cost. Now, if\nyou multiply that out, it's still south\nof the total dollar amount, but these\nare two very different projects of what\nwe are trying to eventually accomplish.\nUh, again, where that we've already\nfilled up the median that means we're\ngoing to have to go to the outside, buy\na rideway, you know, do more\nconstruction, and then I remind you too,\nthe south end of that project is only\none lane and it's squeezed in the middle\nand it's only one lane wide. So, we're\ngoing to have to do be very innovative,\nwhich means probably more bridges, more\naerial to limit rideway impact on a very\nconstrained corridor. You get into more\nbridges, high level kind of things, fly\nbridges that fly over and back into the\nmiddle. So, our goal is again to use the\nexisting rideway and real estate we\nhave. And there's some wide areas there\nat Eagle Land Eagle's Landing, Hudson\nBridge down uh sort of on the south\nside. There's some there's some or\nexcuse me on the northern side there's\nsome wide rideway that we absolutely\nwill use, but there's a lot that will\njust be re total interstate\nreconstruction. It' be a very complex\n>> and if I understand right, the 1 roughly\n1.8 billion added to the amended budget\nis just getting you started. Uh you\nthere there will be more money borrowed\nand that debt will be serviced through\nthe fees. Correct.\n>> That's correct.\nOkay, chair Jaspers, do you have\nanything for the commissioner?\n>> You know, I know you you're y'all got\nyour guys are very available to us. I\nknow a lot of members have get texted\nquestions, but one that comes up the\nmost, commissioner, is on resurfacing\nand you know, it's what we all in here\nsee every day. We get the complaints\nabout and I guess what is the pent up\ndemand? I know that we check our roads\nevery other year. We know the grade of\nthem and you know we got increased money\nfor paving but I think members want to\nknow what's the demand because you know\nI would I'm always trying to ask for\nmore money and sometimes don't have real\naccurate numbers but I'd sure like to\nknow what's demand. I don't know if you\ncan answer that right now.\n>> Yeah I let me let me give you sort of\njust a ballpark answer there is I go\nback to that data point of resurfaces\nincreased by 51% over the last four\nyears. So, we we got I think you'd agree\nthat most of our conditions are pretty\ngood. We've we've sort of we have we\nhave key performance indicators for all\nour roads and we're we're almost hitting\nsome of the targets. Uh some of the\ntargets we're right on. So, we're we're\nsort of close to where we need state of\ngood repair in a system, but that we got\nthere\nseveral years ago. So if you've got if\nyour money is going half as far, that's\ngoing to tell you that's about what we\nneed. So on average, we're somewhere\naround 370 to $400 million a year to\nresurface state routes and interstates.\nThe sort of the other concern though is\nour interstates. I like to say all of\nthem are uh have a knee replacement, a\nhip replacement, and and are eligible\nfor social security. A lot of the\noriginal interstate pavement has lived\nits life and we're having to spend\nsignificant amount of money. Just as a\nword of warning, we are rebuilding I I\n285 from the airport on the west side up\nto Cobb County up through Cobb County\nthis summer. So don't go don't go over\nthere. All right.\nStay away.\n>> Yeah. And and but the point the point is\nit's that pavement is worn out. We're\nhaving to rebuild it. But I think that I\nthink the antidotal answer is pretty\neasy. 51% cost increase. We were pretty\ngood on our state of good repair sort of\nwhere we are but that means you about\nneed to double the budget right I mean\nso you need you need that you know where\nwe are 375 or 400 you probably need to\nbe like you know 800 million a year.\nThank you,\n>> Commissioner. Appreciate you. And\nmembers, uh I'm sorry we're just short\non time. So, I'm going to uh ask uh\ndirector of planning Janine Miller to\ncome up and uh give us her presentation\nand and probably just hit the highlights\nso we can make best use of this last 10\nminutes.\n>> Yes, sir.\n>> I've got a lot of data points, but I\nwill go through them quickly.\n>> Good morning. It is great to be with you\nall here today. Thank you for your time.\nuh and your attention to to\ntransportation which uh we know is the\narteries of our economy of our\ncommunities uh and our families. Uh\nquickly uh the SERTA budget\nthe 2026 budget included money for the\ninfrastructure bank as it does every\nyear through the transportation trust\nfund. Um we are uh excited to have uh\nreported that we have awarded all of\nthose dollars to 13 projects around the\nstate uh including uh the northwest\ncorner Cherokee and Cumberland C around\nuh Truist Ballpark to support movement\nthere around that economic center all\nthe way down to Seol County uh and the\nand Iron City there as well as Twin City\nand Emanuel County and up and over to\nAthens Clark County. So we have been\nable to award 13 projects around the\nstate uh thanks to your investment\nthere.\nWe also have our current round is open.\nSo there is a card on your desk uh with\nwith a QR code there for your local\ncommunities to apply for for those\ndollars uh through February 13th. So\nwould love to get more applications uh\nfrom around the state again this year.\nAs the commissioner said, I'm going to\ntalk about the I75 south corridor, but I\nalways have to start with in\ntransportation uh our logistics enabled\nuh businesses. Since Governor Kemp took\noffice, there have been 113 billion\ndollars of in announcements in of\nprivate investment throughout the state\nand 88% of those announcements have been\nin logistics enabled companies. In other\nwords, there is a requirement for\ninbound cargo for the company to operate\nand employ Georgians and outbound goods\nto market uh and consumers. 74 billion\nor 65% of the total dollar amount that\nis uh over the past six seven years um\nhas gone towards logistics enabled\nbusinesses employing overtime as these\nuh projects roll out 157,000 jobs\nthroughout the state. So this is a\ncritical uh a critical industry for for\nthe state of Georgia that relies on our\ntransportation system all day every day.\nI want to talk about congestion in metro\nAtlanta. I think you all have probably\nfelt it uh if not on your way to and\nfrom the capitol here but but throughout\nthe year. In fact, last year the most\nrecent publication of a a a company\ncalled Enrich, this is a world-renowned\ndata analytics company with for\ntransportation ranked Georgia as number\nseventh in the country for worst trans\nworst uh traffic and delay. That is 16th\nin the world is Atlanta. Uh that's\nincredible. That's a 23% increase in the\nhours lost to traffic in the past two\nyears. The third most increase in the\nUS. And the other state, the other metro\nareas that had worse traffic growth than\nAtlanta were Baltimore and Philadelphia,\nand those were for one-time events. You\nmay recall that the unfortunate uh uh\nbridge collapse in in Baltimore caused a\ngreat deal of congestion there, as well\nas there were um issues with the\nPhiladelphia's transit system, uh\nsafety, significant safety issues that\nshut that down. Were it not for those\nvery unique one-time events, Atlanta\nwould have had the worst traffic growth\nin the country since 2023. Last year,\nuh, people sitting in Atlanta traffic\nlost 75 hours. That's 50% higher than\nthe US average.\nWhat does that look like on our\nroadways? In the on the left is red to\ngreen. Since 2019,\nuh, we have had basically the population\nof the city of Newark, New Jersey moved\nto metro Atlanta and the roads got\nworse. Uh, some of them got better.\nThey're in green on the left, but all\nthe rest of them got worse. On the\nright, you can see the degree to which\nthey got worse. And this corridor, I75\nin the in south metro area, the lifeline\nto northern Georgia uh through metro\nAtlanta, uh had the worst traffic. And\nthis is midday. This is middle of the\nday. This is not rush hour. Uh and these\nare the times as the commissioner\nmentioned when we are reversing the\ndirection of the lane.\nUh express lanes are a choice, great\nchoice for metro Atlanta or anyone\ntraveling through Georgia. Uh since 2011\nwhen we opened the I85 corridor, we have\nhad uh significant growth. In fact, in\nthe last two years since we've gotten\nthat those uh really bad traffic numbers\nand data, we've had a 12.6% increase in\nthe use of our express lanes. That's\nsystemwide. A little zoom in here on the\nI75 south corridor, 5 million trips. Uh\nwe've had an 84% growth in trips since\nfiscal 18 when it opened. It is\ncurrently 12 miles long, although as the\ncommissioner said, it's um only two\nmiles uh for uh for portions of it and\none lane in each direction for a couple\nof miles on the south. This is what it\nlooks like to to the the uh average\ntraveler who's doing a Google map\nsearch. How long is it going to take me\nto get through the corridor? In the\nmorning, northbound, the lane is going\nin the northbound direction. And using\nthe toll lane, it would take 10 to 16\nminutes to get through there. 80%\nincrease, though, if you're trying to\nget through that corridor in the\nafternoon. And you you might say, well,\n10 minutes is not that big of a deal.\nWell, actually that lane provides a\nwould have would provide a 21 mph\nincrease in speed through that corridor\nif that lane were going in the\nnorthbound direction. And you multiply\nthis, this might just be what you see on\nyour phone uh for your trip, but you\nmultiply this by the number of people\nevery day who cannot get into the lane.\nUh average about a 100,000 people every\nday who cannot get in to the express\nlane.\nSo we have a uh have something in uh in\ntransportation analytics. This is how it\nlooks to us as transportation\nprofessionals professionals. A road\nreport card levels of service. It's it's\nan A, B, or C, you're doing well. If\nyou're an F, you are failing. And this\nuh these general purpose lanes are\nfailing Metro Atlanta uh travelers. And\nby 2050, this is all day. Do you see\nthat red? All day long. This is an all\nday model. There is not a way to get\nthrough this corridor at any hour of the\nday in 2050 uh with uh with any ease or\nspeed.\nThat is all what we can predict. But of\ncourse we cannot predict crashes. So\ncompound onto those data points uh the\ngrowth in traffic and the delay. What is\ncaused the by the slowdowns that are\ncaused by unpredictable crashes is is\nquite severe throughout this corridor\nparticularly on the northern side. So\nthere is no way to get around these\ncrashes when the lane is going in the\nother direction.\nUh by the numbers, this is the real\ndata. Okay, this is the roll up of a\nmost recent month of data we were able\nto to gather in December of 2025. Time\nand money lost uh by the numbers.\n193,000 average vehicles per day. That\nis 334,000\nvehicle hours of delay in just the month\nof December. uh every person lost 9.3\nhours that month to traffic on that\ncorridor. And so you have to budget 80%\nadditional more time to get through that\ncorridor on schedule. And the cost to\nthe economy is real. 15.5 million is the\ncost of that unreliability. But what's\nvery interesting is where those um cars\nand trucks are coming from and going to.\nthe darker the gray, uh, the the more\ntrips originate and depend on that\ncorridor there in the center of the\nstate to get through. So, it's not just\nthe express lane, it's all of the\ngeneral purpose lanes that are dealing\nwith this traffic. And, uh, once we have\na lane going in both directions, there\nwill be 70% more vehicles that can pass\nthrough this corridor. And I say\nvehicles, it's not just cars. uh 18 to\n20% of the vehicles getting through this\ncorridor, attempting to get through this\ncorridor, are trucks. They carry two\n$620 million a day of freight value. In\na year, that's $226 billion. That is up\nroughly 25%\nof the value of freight moving in\nGeorgia goes through this corridor and\nsits in that traffic.\nThis corridor has also been named by the\nAmerican Trucking Associations as the\nworst freight corridor bottleneck in the\ncountry. It's number 12. 1 through 11\nare all interchanges. This is the number\none worst corridor in the country for\ntrucks.\ndirector. Um we're getting some looks on\ntime at the back door and uh and rules\nchairman has has come in and so we're\ngoing to clear this room. But thank you\nfor that quick presentation and we may\nwe may ask you back uh to either this\ncommittee or chairman Jasper to thank\nyou\n>> so we can have time to ask you some\nquestions.\n>> Thank you.\n>> All right. Thank you. Hey, uh members,\nif you would take your packets with you\nwhen you go to",
  "updated_at": "2026-02-14T14:45:09.040822+00:00"
}