{
  "video_id": "RTVLKi-WuQM",
  "url": "https://www.youtube.com/watch?v=RTVLKi-WuQM",
  "title": "Energy, Utilities and Telecommunications  Meeting Day 31 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 31,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "Here is a structured markdown summary of the key points from the Georgia Energy, Utilities and Telecommunications Meeting Day 31 of the 2025 Session session:\n\n**Overview:**\nThe session focused on a discussion around a bill that aimed to provide certain protections for manufacturers regarding disclosures and warnings. There was debate around the extent of these protections and how they would impact the ability to bring claims against manufacturers.\n\n**Key Actions:** \nNo bills were passed or referred.\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- There was discussion around whether the bill would prevent claims for wrongful death or personal injury if the manufacturer was found to have knowingly withheld, concealed or misrepresented information about health risks.\n- An amendment was proposed to clarify that the bill would not eliminate common law negligent failure to warn claims, allowing consumers to hold manufacturers accountable if they failed to inform consumers of known issues even after reporting to the EPA. The amendment was not adopted.\n- There was debate around the timing of when manufacturers would be required to disclose information to consumers versus the government.\n\n**Votes:**\nNo recorded votes were taken.\n\n**Attendance:**\nNo quorum issues were noted.\n\n**Adjournment:**\nThe session adjourned, with the next session date unspecified.",
  "transcript": "Thank you Mr. Chairman and Senator, it's my reading of this beginning with the respect\nof the questions that were asked previously, that if it determinations made by the EPA\nthat a manufacturer knowingly withheld, concealed, misrepresented, destroyed, material information\nregarding human health risks, that the earlier part of the bill would not apply.\nSo any concern that the manufacturer may be have this information be aware of this information that's specifically excluded from the legislation that you're presenting here today is my understanding that's correct, correct.\nThank you, Mr. Chairman.\nAnd I just want to make sure I'm understanding Mr. Senator.\nIf you're saying the companies are not allowed to hide the truth or mislead and I understand\nthat part, but how do they tell the truth if they don't warn?\nI mean, you know, it's one thing for someone to ask you and then you tell the truth because\nyou've been asked.\nBut I guess it doesn't this sort of prohibit or discourage warning people by giving\nthis sort of not-immunity but certain protections.\nWell, first of all, they're going to do research themselves as the owner or manufacturer of\nthe product.\nThey're not going to, they know the consequences, they're not going to put anything on the\nmarketplace that can cause harm.\nNumber two, EPA is also going to be testing it with their 500 scientists and researchers,\nand they're going to do research on that.\nSo I mean, it may take 13 years for them to verify that the product is safe and okay\nto put on the shelf for people to use.\nSo again, if they fail to warn about something,\nif the science is not there to back it up,\nthen they should not be held liable for that.\nThere has to be science and research\nto prove that there's something that causes that problem.\nAnd if they don't have the research or science to back it up,\nthen it's just hearsay.\nBut when you say there, are you talking\nabout the pesticide company or the EPA?\nTalking about the consumer or whoever's concerned\nabout the issue that they have.\nOkay, whoop, appreciate.\nThank you, Mr. Chairman.\nThank you, Senator Watson, for bringing the bill.\nIs there anywhere in here that says\nyou cannot bring a claim for wrongful debt?\nYes.\nIs there anywhere in this bill that allows,\nor disallows the ability to bring a personal injury claim?\nYes, sir.\nAll right.\nIn the event that I think our colleagues\nare mentioning that there is a determination by the EPA\nthat the manufacturer was in bad faith hiding something\nthat would hurt somebody.\nWould they be covered under this bill?\nNo.\nThank you, Mr. Senator.\nOK.\nChairman Martin.\nSenator, and the leader covered my question on line 42, the car belt for knowingly will withhold information.\nLet me see if I can provide a scenario and you tell me if it would apply.\nIf there's a product out there, the EPA has approved the label and everything's going fine.\nLater on at some point they found out that that product caused something and nobody knew about it\nYou say that happened in 2020 and in 2025 2025 that label that product caused something that nobody knew about\nAnd it injured somebody they would still be able to bring a suit for that injury or haven't forbid that fatality\nOr any damages, right?\nBut they wouldn't be able to bring a suit for failure of Warren because they didn't knowingly conceal or misrepresent\nCorrect. So the difference there is this does not isn't not true. This does not\nKeep the company does not reward the company for being dishonest with the public, but instead\nDoesn't penalize them for not being able to look into the future. Correct. Thank you. Yep\nOkay, that exhausts all the questions I see here.\nEspecially Evans, I have a proposed amendment I think that I got when we walked in and I think\nthat's yours and it hasn't been printed because we just got it and normally what we'd\nlike to do is get these at least 24 hours before so we can have a chance to get them printed\nand get it to it.\nBut out of an abundance of caution, if you want to explain it, if you can do it shortly\nWe'll hear from me on that. Okay. Yes. Thank you, Mr. Chairman. And not knowing that we were going to meet today\nI I didn't have any ability I didn't didn't foresee that I would need to get this and this bill just passed out of its\nCommittee of purview yesterday morning at 8 a.m. Okay. I have been working with\nAt least the author in the house and and some folks in the hall with the amendment\nSo I do apologize for for not having it here\nBut it's one page. I think it could be printed pretty quickly, but it just simply states that\nBut this will be a regulatory that the amendment just makes clear that it doesn't take out the common law, negligent failure to warn claim that consumers may have, recognizing that this bill requires the steps for a company to make sure they're doing their regulatory compliance and reporting to the EPA.\nBut if they know something and they've told the EPA but they haven't told their consumers,\nI don't think it's right that we cut off the consumer's ability to hold the industry\naccountable for not sharing that information with them because the EPA could sit on it\nfor six months, for a year, for two years.\nWe just don't know and that's true with any federal administration, Democrat or Republican,\nthey are slow.\nIndustry is faster and if industry is going to continue to sell their product, they should\nhave a duty to inform consumers the same as they have the duty to inform the government and that's\nall the amendment does it would not step on any regulatory aim that we're seeking here and I'm\nsimply asking Mr. Chairman and members of the committee that this amendment be able to be considered\non the floor. I'm not asking this rules I mean I'd love it if the committee wants to pass it in\nthe men the bill in here but I'm simply asking that the members have a chance to exercise their\nright as members of legislators to make amendments to a bill on the floor and\ncomplying with the way you have to do that as a modified structure bill.\nAppreciate the consideration. Okay well it's offered here in rules so we're\ngonna vote on it right here in rules right now. Those in favor of adopting the\namendment say aye. Those opposed no no no's have it. It's not adopted. Okay now on\nSenate Bill 144 is presented without the amendment.\nDo I have a motion on that that that be a meant or to be added to a supplemental calendar\nthat we'll do for today when we go back in.\nHave a move in a second in the opposition.\nThere is an objection all those for putting them on supplemental calendar today say aye.\nAny opposed?\nThey are opposed.\nIt's on thank you.\nMr. Chairman, and compliance with House rules\nwe file a minority report on House Bill 144.\nCould you clarify to ensure that that will be recognized?\nThank you.\nThank you, Mr. Chair.\nYou\n",
  "updated_at": "2026-02-12T17:56:26.750643+00:00"
}