{
  "video_id": "S671Kef9G9U",
  "url": "https://www.youtube.com/watch?v=S671Kef9G9U",
  "title": "04/01/2025 Sen. Setzler RFRA Press Conference",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 48,
  "summary": "Here is a structured markdown summary of the Georgia 04/01/2025 Sen. Setzler RFRA Press Conference session:\n\n**Overview**\nThis press conference focused on advocating for the passage of the Religious Freedom Restoration Act (RFRA) in Georgia. The speakers emphasized the importance of religious freedom and urged the state legislature to follow the example of 39 other states that have already enacted similar protections.\n\n**Key Actions**\nNo specific bills were mentioned in this transcript.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Pastors Frankie Vega and Garland Hunt gave opening and closing prayers, respectively, invoking religious freedom and calling on legislators to pass RFRA.\n- Thomas Hammond, representing the Georgia Baptist Mission Board, encouraged the House to vote on and pass the RFRA bill.\n- The speakers framed RFRA as a crucial protection of religious freedom, a fundamental right granted by God.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nNo adjournment details given.",
  "transcript": "Welcome everybody, thank you so much for coming out to this press conference in support of religious freedom by passing RIFRA\nThe Religious Freedom Restoration Act Senate Bill 36\nWe're at a pointy at moments where we are\nReally one one and a half steps away\nFrom protecting religious freedom for everyone in our state\nIf you're not aware of this\nAnd you're going to hear this, you're going to hear this multiple times.\nThere are 39 states, now 39 states that offer these protections for their citizens without\nincident.\nAnd in addition to those 39, the federal government has these protections.\nGeorgia does not need to be an outlier outlier in the fight for religious freedom.\nTo get things started, we're going to ask our dear friend and pastor Frankie Vega to open\nus in prayer.\nAmen.\nLadies and gentlemen, I stand before you in the proud tradition of our spiritual forefathers\nwho bathe the foundations of our freedom in their own blood.\nWe stand as the modern vests of tried and true forefathers of our faith as the black\ngovernment of pastors and ministers who fought for the religious freedom of our country\nand the founding of our First Amendment. I encourage you today to stand with us as we\nare moving forward in our faith courageously, foraging forward because of our pureed\nand predecessors who fought to have religious liberty in our nation. And we're calling\nupon, we're calling upon Georgia to stand together as 11 million people are standing\nfor faith in our nation, and we're calling upon our honorable legislators to stand courageously\nto pass RIFRA this day to our honorable speaker of the House to our elected representatives.\nWe're calling upon you today to do what is right and to have courage in your heart to\nstand for what our nation has been founded.\nOur First Amendment clearly says Congress shall make no law respecting the establishment\nof religion, nor prohibiting the free exercise thereof, or abridging the freedom of speech\nor of the press or the right of the people to peaceably assemble and to petition the\ngovernment for redress of grievances.\nSo we're calling upon our legislators to honor the founding of our First Amendment and\nreflecting that on our state and that we would be the 40th state, the epicenter of civil\nrights that has affected the entire nation in 49 states as our fight to stand and arise\nfor freedom, that again all the eyes of our nation are looking upon Georgia to do what\nis right and to stand.\nLet us pray.\nFather in the name of Jesus, we come before you now thanking you for this opportunity\nto stand and as Christian constituencies and people of faith and faith communities, all\nalike we stand, Father, and ask you to supernaturally grant us according to Proverbs 21 and\none that you said the heart of the king is in the hand of the Lord and you're able to turn it\nwhichever way you wish and we thank you Lord that our elected officials father\nprovidentially have arisen to a place of political prominence father so that they would be able to\nuse their influence and even their affluence to affect what is morally right and just and true\nand Father we know that you've established this nation and bathed in the foundation of freedom\nfather, freedom to worship you and to seek you. And we thank you, God, that as people of faith,\nwe have fought in every major battle and forefront, Father, to turn our nation into what is right.\nAnd without the voice of moral clarity, Lord, we cannot guide our nation as we have done so many\ntimes in many instances in the past toward the right moral direction and path. And, God, I thank you.\nWe pray right now for our legislators. We pray for the speaker of the house. We pray for our\nhonorable governor Brian Kemp we thank you that they're influenced and in this\nmoment in this hour is arising to be able to support what our founders have\nbled and died for so that we can stand without any prohibition against our\nability Lord to proclaim your gospel or to be people of faith and God I ask you\ntoday that you would touch their hearts today even as many of them are\nlistening right now that you would touch their hearts father to remember how\nfaith has forged our Declaration of Independence, how the Word of God and the\nfaith has forged our Constitution and even the Bill of Rights that we\ncherish and hold today. And I thank you God that as they convene and come\ntogether they will pass. Rifra, even on tomorrow there will be no delay God\nwe're asking you no delay but it would go forward God even as men of\nprominence politically have given their word to stand and support the\na riffra and our support for religious freedom. We thank you for this God. We know, Lord,\nthat you said the effectual, fervent prayers of righteous men and women make tremendous power\navailable, dynamic in its working. And you said, blessed is the nation, whose God is the Lord.\nand we thank you for that now.\nIn Jesus' mighty name we pray, amen.\nAmen.\nGood morning, I'm Thomas Hammond\nand I'm representing the Georgia Baptist Mission Board.\nI'm the executive director there.\nAnd on behalf of 1.4 million Georgians\nwho attend 3,500 churches across our state,\nI would strongly encourage our house representatives\nto put forth tomorrow the Rifford Bill to be voted on.\nWe want our house of representatives to vote for our freedom.\nThis is one of the most basic rights we have as Georgians.\nAnd that is, of course, the freedom of press,\nthe freedom of assembly, the freedom of speech.\nWe want this equally as enforced by law.\nWhen you think about the fact that Georgia\nis the only state in the South that doesn't have a riftra,\nit's time to move now.\nWhen you also think about the fact that we might have\nlittle in common politically with states like California, Nevada, Oregon, New York, New Jersey,\nbut one thing we do have in common with them is we don't have Arifah. We strongly encourage\nour representatives to bring this to a vote tomorrow. Let's pray together. Father, your word tells us\nthat if we lack wisdom, we can ask for it and you would give it to us generously. And I ask now\nthat you would give wisdom to our leaders. Your word also tells us that we are to pray\nfor our political leaders. And we're doing that right now, Father, that they would have\nboldness and courage to do what is right. I prayed, Father, that this vote would be taking\nplace tomorrow, that we, all across our state, might experience the freedom of enjoying\nthe protection that is so desperately needed.\nAnd Lord, I pray for our governor, governor Kim, and all of our leaders.\nI'm grateful for them and the sacrifices that they make every day.\nBut I pray now, Lord, that your will be done.\nAnd we pray this in Christ name.\nAmen.\nHello.\nMy name is Bishop Garland Hunt.\nand I'm the senior pastor of the Father's House,\nin peace-tree corners, and also serve\nas president of the Douglas Leadership Institute.\nI was born here raised in Atlanta area.\nMy parents were in the aftermath\nand was very segregated south.\nAnd they experienced white-only fountains,\nrestrooms, and dining facilities.\nI grew up in this, and one of the children,\nI guess, of the civil rights movement.\nBut let me just say this.\nthat I believe that religious freedom is more critical\nthan even civil rights legislation\nbecause religious freedom is not a civil right,\nit's an aliable right.\nIt's a right that comes from God.\nAs a man of God, I do understand\nthat religious freedom restoration act\nis very important for the government,\nnot to discriminate against believers or Christians\nor any one of any religious faith.\nIn order for that discrimination not to take place,\nthere needs to be a compelling evidence of the government\nin order to restrict the person's religious freedom.\nWe as Christians, as believers, as religious people stand,\nand we say that this is an alibi right from God,\nand we're saying that Georgia should not\npreclude believers, Christians as myself,\nthe freedom to have the expression\nof what I believe I shouldn't be able to do it in the marketplace,\nI should not have to be able to exercise my belief in just\nin the church, but also in the marketplace.\nSo today, we ask that this particular legislation\nwill approve refer in this nation, the 40th state finally,\nso that religious freedom is not discriminated against\nin our state.\nLet me pray.\nLord, we thank You now for Your goodness and mercy in this place.\nWe can only call on Your name.\nFor Your name is great.\nYou are truly the Alpha and the Omega.\nYou're truly the beginning and the end.\nAnd we look to You for You, the author of our faith.\nAnd therefore, O God, we pray that for government, O God, is under Your hand.\nSo we cry out to the government of God now that you were employed, that you were inspired,\nthat you were moved by legislation even now, and according with that, with our governor,\nto approve refer in this area, that we were out of the pre, the freedom to preach the\ngospel and declare the gospel without any inhibition, that we are the freedom to have the\nexpression of the gospel and live the gospel no matter where we are in this state.\nThank you for your blessings on Georgia and we thank you now for your truly grace upon\nus now.\nIn Jesus' name we pray.\nAmen.\nAmen and amen.\nI am Dr. Alvita King and I stand here before you today as the chairman of the Center for\nthe American Dream with the America First Policy Institute.\nI am here with friends from the Spiritual Legislative Council, the Douglas Leadership\nInstitute, Senator Ed Seltzer, and so many others.\nI was a state legislator here in the 70s and 80s and was able to help pass some good\nlegislation.\nAnd I'm praying today in the name of Jesus as a scripture in 1 Peter 4 and 10, each\nof us and each of our elected officials should use whatever gifts we have received to serve\nothers as faithful stewards of God's grace in its various forms. Well, Rifer is a good,\nvarious form. Let's vote yes right now. Red and yellow, black and white, all are precious\nin God's sight. We are one blood, one race, male and female, of course, Democrats, Republicans,\none voice and one vote. We must vote yes together now. Jesus said in John 17 that they all may be\none. Let us show here in Georgia that that is possible. Please join me in the last few notes\nof glory, hallelujah. If you know it, sing it with me. Glory, glory, hallelujah. Glory,\nglory, hallelujah. Glory, glory, hallelujah. God's truth is marching on. God give us the\nthe courage, give our leaders the courage to vote what's going to help and serve.\nYes for a religious freedom, yes for riffa.\nGod bless us all in Jesus' name, amen.\nThank you.\nYou're morning.\nThat's a tough act to follow.\nYou have heard it said that elections have consequences.\nElections also have expectations.\nAnd for those that came out and pounded pavement and cast their vote in November to elect\nthe people in this building, there was an expectation.\nThere was an expectation that our values, that our faith and our religious freedom would\nbe protected, and it would be stood for.\nAnd so as we stand here with that expectation that we delivered on Aryan, we're asking this\nbuilding to deliver on its end. And the folks in this room and the folks around this\nstate with 13,000 evangelical churches and faiths that abound, there is nothing that\nunites us more than our faith. And as we look ahead the next year, whether it's primary\nseason or general election season, we have long memories and we have expectations. And\nAnd we expect this to be done now, as we...\nApplause\nIt is hard as I are to stand with the people of this building.\nI have taken shots from numerous folks over the years,\nbecause I have said that the people in this building are good and noble people.\nAnd I believe that to be true.\nAnd I expect that over the next few days they're going to prove that to be true.\nThey're going to stand strong, but let me say this.\nThis is not a moment that counts for great courage.\nThis is an easier moment than we've allowed it to be.\nA few years ago, there was a bunch of saber rattling\naround this issue.\nWe knew that it was just saber rattling.\nBut as we stand here today, I don't even\nhear the sabers rattling.\nThere is absolutely no reason to stop this bill now.\nAnd there's every reason to press forward.\nbecause if you want to hear the grounds shake\nwith the pounding of pavement by faithful Georgians,\nif you want to see victories at the ballot box,\nif you want to see our culture in state grow stronger,\nvote this thing through now.\nNow.\nYeah.\nYeah.\nYeah.\nAnd now I want to introduce my good friend, Ed Setsler.\nAnd I'm going to say, I normally say very nice things about it.\nBut Ed is an ordinary guy being used by a great god.\nand he's written an ordinary bill\nthat is similar to what's in 39 other states.\nIt's the exact same thing that's in federal law.\nThere's no nuance to this legislation.\nIt has been tested in the courts.\nThere's nothing all that special about it.\nIt is to make Georgia just like what our founders intended.\nSo I'm grateful for the sponsor's bill.\nI'm grateful for the Senate that's already passed it.\nThe House Judiciary Committee that's already passed it.\nWe look forward to the House passing it this week.\nThe author of this bill, Senator Ed Setson.\nThank you, Cole. Thank you, friends. I'd like to thank the folks that have joined us today,\nthe speakers, the dozens of people behind me, the representatives and senators. There's too\nmany to count behind me. People from all faith backgrounds. We've got Christians, Jews, people\nfrom a wide variety of faiths and perspectives because no matter what faith background you\ncome from, no matter what your faith tradition is, the ability to practice it openly outside\nthe walls of your church is as Pastor Vegas said earlier exactly what our founders intended.\nEvery Georgian should be free to exercise their faith without unfair federal state and\nlocal government intrusion.\nSenate Bill 36, the Religious Freedom Restoration Act protects ordinary people from unfair state\nand local government intrusion by exactly mirroring the language, by exactly mirroring\nthe language from the federal referral law that protects people from unfair federal\ngovernment intrusion.\nAfter the federal referral law has passed in 1993, the United States Supreme Court in\nThe surprising decision ruled in 1997 that the federal law and the United States Constitution\ndid not protect people of faith from state and local governments without state legislatures,\nwithout state legislatures specifically acting to put those protections in place.\nThis is a whole on the Constitution.\nSince then, 39 of 50 states have adopted their own state riffer laws or have seen their\nStates Supreme Courts Act with binding rulings that their\nconstitutions nationally protected these rights, protecting\npeople from unfair overreach by state and local governments\nin 39 states.\nIn 2016, Georgia passed a state bill that included language\nvery different than the federal referral law.\nIt was passed in 2016.\nIt was very different than what was proposed today.\nAnd that very different language was vetoed by Governor Nathan Deal.\nIn 2017, our Republican Attorney General wrote in an opinion,\nrecognizing that our state statutes and our Constitution do not provide these protections\nto people of faith in Georgia, that people of faith in Georgia under the current state\nof law have the lowest possible level of legal protection that exists in our system,\nthat constitutional protections that folks expect to have and we have at the federal level\ndo not exist to protect people under Georgia law.\nSince just 2021, however, eight states have passed state-level rifer laws, most with bipartisan\nand many with near-unanimous majorities.\nRifer simply puts the First Amendment right to free exercise on the same level as the\nThe First Amendment writer Freedom of Speech, Freedom of Press, and Freedom of Assembly,\nnot by providing any kind of guarantee, but by providing a fair judicial balancing test,\nwhere courts can weigh the duties of government with the basic rights of people.\nSo there's balance in fairness.\nUnder RIFRA before government can force a person to violate their faith, they must show\na compelling governmental interest and demonstrated they've accommodated the\nperson where they can and and they're impacting their their rights in the least\nrestrictive means possible. What does this mean? A couple examples we've seen\nacross the country. There was a boy out west, a Native American boy who was going\nto be entering kindergarten. He stayed had a riffer law. Well the local school\nboard and his community told him I'm sorry boys can't have long braided hair.\nWell, his family said, wait a minute, it's our, it's part of our Native American religious\nheritage.\nLong-rated hair is what boys have, it's our custom.\nWell, school said, cut your hair or you can't enroll in school, with a family brought\na case, and the courts ruled, you know what, there's really, because they have a state\nrougher along that state, they ruled there's not a compelling governmental interest to make\nboys cut their hair if girls don't have to.\nThere wasn't a compelling interest for that.\nAnd then the young man, the Native American,\nyoung boy got to enter kindergarten\nwith his long braided hair,\nbecause that's what that balancing test\nwas applied and it brought about a fair outcome.\nHowever, it doesn't always rule on someone's behalf\nin Florida.\nThere was a Muslim woman that was from the part of the tradition\nwithin Islam that had where people were a full,\nwomen were a full face veil in public.\nShe made the claim that she shouldn't have to remember\nfull-face veil for a photograph.\nWell, the government said,\nbefore we can issue a driver's license,\nyou have to remove your face veil.\nWhen she brought in a speut,\nshe sided the state's riffle law, went to court.\nYou know what the court ruled?\nThey applied the balancing test.\nAnd they said, ma'am,\nyou're gonna have to remove your full-face veil\nto take your driver's license to throw that.\nSo there isn't compelling governmental interest\nto have your face on your photo.\nYou're taking it in a photo\nand put on your driver's license.\nBut the other part of the balancing test said,\nwhat's the least restrictive means\nthat we the government can accomplish this?\nBecause the state of Florida had a RIFR act,\nthe government had to ask her,\nhow can we work with you to do this?\nAnd the woman said, well, my real issue is\nI don't want to have males that I'm not married to\ntaking my photo and I don't want to be exposed\nin a room full of people.\nSo the RIFR law simply said, you know what?\nMa'am, we'll take your driver's license photo\nthe female photographer in a private room.\nYour illicit right can be recognized, and our need to have your photo and your driver's\nlicense can be recognized.\nThis balancing test, the delicateness and the fact-specific nature of riffer, takes a wide\nvariety of cases from people cutting their hair to living their faith, defeating the poor,\nto covering their face for a driver's license.\nIt takes these circumstances and applies the law fairly so people of faith can recognize\nenjoy their faith practices as much as possible while the government's duties can still be performed.\nLadies and gentlemen, there's 32 years of case law behind this. This is not new language. The\nlanguage we have in Cinnable 36 was, takes the federal language word for word,\nGovernor Brian Kemp's legal team worked to craft two clarifications to make sure that the\nframework under Georgia, even more closely mirrors the federal framework by saying that\nthat Georgians, if we pass into Bill 36,\ncan't sue judges, seem like common sense.\nBut we want to state that in the bill\nbecause you can't sue at the federal level.\nWe shouldn't be able to do it here.\nIt matches the federal law.\nAnd he also included something that the previous\nopponents of Riffer asked for, this clarification\nthat this does not establish a state religion.\nIn no way does Riffer do that, but Governor Kim's teams,\nand let's just put that in the bill.\nThis is in no way establishes an efficient state religion.\nCommon sense stuff.\nThat bill has 32 years of legal history behind it.\nAnd it's really the reason we can be very confident\nthat what we have before us today\nis not going to create this parade of terribles\nthat the opponents of RIFRA claim.\nI've got a chart here I'd like to,\nif you could bring that in for me, Nathan.\nI'm going to show you,\nbecause this is breast conference\nand because opponents of RIFRA have made wild claims\nin front of you, the media, I want to come today\nI want to lay these things out for everybody.\nI told the business community here in town in Atlanta\nand around the state, this is commonscent stuff\nthat applies across the nation.\nWe've kept the controversy down,\nbecause this is not a controversial bill.\nThis is a simple, basic protection\nthat we're looking to put in place.\nWe've not been holding rallies,\nwe've not been having protests,\nbecause we've been reckoning,\nthis is a simple, basic stuff.\nWe're having this press conference today\nSo I can explain to you the Atlanta news meeting,\nthe details, once again, of exactly what RIFR does.\nAnd speak to the falsehoods you're hearing\nin the hallway, in the halls of the Capitol\nthat are dramatically misbetraying this bill.\nI'm here because the business community\nasked me to speak to these things, clearly.\nWhat you see before you hear in this chart\nis you see the four prongs of the United States First Amendment,\nfreedom of religion, freedom of speech,\nfreedom of press, and freedom of assembly.\nBecause of the 1997 Supreme Court ruling,\nBernie V. Flores, you can see even though speech,\npress and assembly receive full constitutional level\nprotections, which is called strict scrutiny level\nprotection, the freedom of religion\nhas the lowest level protection in Georgia.\nThat's the state of the law in Georgia.\nWhile our civil rights laws cover just about everything,\nThe one place, the one hole, the one hole our United States Constitution does not protect\nis one thing.\nIt's the freedom to practice your faith as individuals' faith comes into contact with\nstate and local governments.\nOur U.S. Constitution and our Bill of Rights protects everything else, but this one thing.\nThat's why we have a river bill.\nThe gap you see right here, next slide, please.\nWhat you also see here is, is you see within Georgia.\nYou can see all the states around us have full protections.\nIn fact, 39 of 50 states have full constitutional protections for the right to practice your\nfaith at the state and local level.\nWhat you see in Georgia is you see these dots.\nWhat do you think those are?\nThese weird shaped areas, those are military bases.\nIf you're on a military base in Georgia, you have full constitutional protection for\nright to practice your faith. What do you think those dots are? Those dots are\nour state prisons. There's a separate federal law, the Aralupa law that\nprovides specific protections, religious protections to people who are\ninstitutionalized. So if you are in a, if you're a convicted felon today in a\nstate prison, you have full constitutional protection for your right to\npractice your faith.\nBut law-abiding Georgians do not.\nIf that's not an absurdity, what is?\nLaw-abiding Georgians should have the same level of basic\nprotection to their right to practice their faith that\nconvicted felons in our prison system have.\nThat's the state of the law today.\nThe last slide is a very simple one.\nYou can see America overwhelmingly.\nEvery area in green, citizens have the full right\nto practice their faith and have protection\nwith respect to state and local governments.\nExcept for the states in gray.\nYou can see Georgia stands alone.\nAs Thomas Hammond representing 1.4 million Georgia\nBaptists said earlier, New York, New Jersey,\nCalifornia, Oregon, they don't have it,\nbut notice Georgia.\nWe are the only Republican-led state in the nation\nis not have these basic protections,\nand many decidedly blue states, like Massachusetts,\nConnecticut, Illinois, have these same protections.\nThis is not controversial, friends.\nAll we want is the basic right to protect our faith\nthat we enjoy with respect to federal government intrusion,\nto protect us from cities, counties,\nand public universities and public schools.\nThis is all we're asking for.\nFriends, we share these things with you because this is solid law.\nI have with me here, I've shared this, this was shared with House Representative Members\nyesterday, the Senators have seen this.\nThis is a letter from 11 Law Professors.\nIt's sent to me from Doug Lackock.\nDoug Lackock is a professor emeritus from the University of Virginia.\nHe is the attorney that wrote the federal referral law in 1993.\nDoug Lekock sends this letter specifically with respect to Senate Bill 36.\nHe's joined by ten other law professors from Georgetown University, Princeton University,\nStanford University, University of Virginia, Notre Dame, and Harvard, sitting professors\nand professors emeritus from these schools sent this letter to me saying we support Senate\nBill 36, because Senate Bill 36 does exactly what federal law does for people.\nNothing more, nothing less.\nThe claims you've heard in the hallway, the political claims that are levied against\nthis bill to try to influence elections and deceive the public and deceive the media,\nis debunked by this letter.\nAnyone want to see this letter?\nI've got plenty of copies.\nAnyone in the media, I give you a transcript of this.\nIn that, ladies and gentlemen, Senate Bill 36 is Governor Brian Kemp's language.\nWe passed a river bill out of the Senate last session that mirrored the federal language\nexactly.\nGovernor Brian Kemp said, you know what, guys?\nGood work.\nLet's add these two clarifications to make sure there's no misperception about the two\nthings we alluded to earlier that you can't sue judges and that you can't, that we're\nnot somehow establishing a state religion by doing this.\nclarifications that really don't require legal language, but Governor Kempsel, let's make\nit crystal clear for all Georgians.\nThis is the same protection that exists at the federal level, we're simply replying\nat the state and local governments.\nLadies and gentlemen, I love to conclude with you now.\nI will address a couple things.\nI know our people in the back, their legs are probably getting a little wobbly sitting\non these stairs, but there are eight questions I'm going to address.\non this debate, people in the news media have tried to weaponize mass media to accomplish\npolitical goals by saying things that were simply not true. I want to, as I told members\nof the business community here, I will come and talk to the Atlanta news media and address\nevery single one of these issues head on and very clearly that's what we're here to do today\nto address these questions. The first question I will address is that you're going to hear\nin debate, as this is debated on the floor of our legislative\nchambers, one claim will be made, which is outrageously false.\nPeople say, Representative Susser, why do we need a referabill?\nAren't we protected by the United States Constitution?\nWell, ladies and gentlemen, as we said earlier,\nthe United States Constitution protects every single civil\nright in our Bill of Rights and our whole framework\nof federal civil rights.\nIn the 1964 Civil Rights Act, 1965,\nfear of housing, all of those are protected\nby the federal law except for this one thing.\nThe chart that I showed you,\nthe whole and our law, our federal law and constitution is,\nbecause of this 1997 Supreme Court decision,\ncitizens cannot openly practice their faith\nand they can enjoy their right to free exercise,\nwith respect to impacts by state and local government\nunless a state legislatures specifically\nand acts a bill exactly like Senate Bill 36.\nThat claim is demonstrally false.\nAre there any questions from the Atlanta media\nabout that fact?\nAny questions?\nDoes anyone dispute that fact in the Atlanta media?\nAnybody?\nOkay, so it's established the Atlanta news meter\nrecognizes that for this basic right\nto be protected from state and local government impact\nAnd I thank you for that.\nThe Atlanta news media wants to play this fairly.\nIt's very clear.\nSo there's no dispute that federal constitutional and\nstatutory protections don't apply to protecting people of\nfaith with respect to impacts from state and local government\nunless the only protections we have for that is unless we pass\na state-level refer statute like Senate Bill 36.\nSecondly, I hear this wild claim that it was said, the other than our rules committee\nwill probably be said in this debate as we move forward, unfortunately.\nIt's sad to hear.\nPeople have said, well, Senator Sessler, Riffer is just a license to discriminate.\nOne of the things I've told our businessmen is, guys, it's not helpful when folks tell\nthese lies, they agree.\nI'm here today on behalf of business leaders, community leaders to dispel and debunk these\nfalsehoods, the claim that rifres a license to discriminate, friends, rifres a balancing\ntest, rifres not an exemption, rifres doesn't exempt people from any laws. It simply recognizes\nthe powers that government has for important interest have to be performed. We doesn't\ntake those away. But rather than giving citizens the lowest level protection, almost no\nno way to their rights, it simply elevates the rights of people to full-level constitutional\nprotections so that the courts can weigh the duties of government with the basic rights\nof people so that the balancing test works like it's supposed, that's all it does.\nThis, if there's any question about that, and there's any question about what our federal\ncourts think about that, I would direct you to a 2012 Supreme Court decision, it's called\nthe Hosanna Table Lutheran case, the United States Supreme Court, in a 9-0 opinion.\nHow many opinions of the U.S. Supreme Court are 9-0 opinions these days?\nAnd a 9-0 opinion where Justice Alina Kagan joined Justice Samuel Alito in their position\nsaid that just because there's a established civil right in the federal law that's enumerated\nand clear, it doesn't wipe out and invalidate someone's religious claim that the two have\nto be balanced against each other.\nThe idea that rifer should be discarded and we don't need any right because it's going\nto somehow work against people's civil rights and a non-zero opinion.\nThe U.S. Supreme Court said, basic rights are balanced against other rights.\nIn any right that's enumerated a law, the Constitution is weighed against others.\nThis is not about discrimination.\nIt's about giving every right under the umbrella of rights.\nThey're appropriate level wage.\nThey can be balanced by the courts.\nThe idea that refers to discrimination law was made nonsense that is at a table 2012 Supreme\nCourt case.\nAll rights are simply balanced against each other fairly.\nWe just want to make sure that religious rights don't win every time, but they get the\nfair away they're supposed to have.\nThird concern, this is something that a good friend of mine\nfrom our Metro Chamber brought to me and said,\nEd, can you please be very clear about this?\nAnd as a good friend, I've known him for years,\nas I'm happy to.\nThere are 18 municipalities in Georgia\nthat have passed local non-discrimination ordinances.\nNow back in 2015, some national groups came to the state\nand said, hey, we're gonna come in with,\nand I don't know what authority some national group has\nto even say this.\nThey were talking about what they're gonna do\nlocal non-schrimination ordinances. Guys, this bill leaves in place those 18 local\nnon-schrimination ordinances. It does it purposely. Now there are three states\nthat wipe out local non-schrimination ordinances. Tennessee, Arkansas, and Utah.\nLocal non-schrimination ordinances are not legal in those states they've been\nprevented by their legislators.\nGeorgia doesn't do that.\nThis referral all leaves those 18 nondiscrimination ordinances in place,\nso that as a person of faith, if we can take the rights which are not recognized\nnow and give them full religious rights, those nondiscrimination ordinances and\nthose communities, which raise the interest in the protections\nfor people from the LGBT community and from other communities,\nelevates those rights higher than the other parts of the state.\nWe're okay with that.\nThe local ordinances are passed to do that.\nBut as courts weigh these interests,\nthe citizen of faith shouldn't have no rights.\nIt should weigh these fairly.\nThis is a down-the-middle fair bill that allows those local communities\nto enact those ordinances in the past and in the future.\nMore communities will probably enact those.\nRiffer doesn't seek to change that.\nIt leaves those in place.\nAnd to my good friend on the chamber\nwho asked me about this,\nthe groups in 2015 that said they're gonna wipe\nthose laws out, I don't know who they were.\nI know now who they were, but they wasn't me.\nThis building specifically does not do that.\nClaims the contrary or trying to deceive you\nas the news media that say that we leave those in place.\nAnd because of that, I tell people,\nriver travels well.\nThere's a higher interest, higher protection\nfor certain groups.\nThe one community recognizes we welcome their ability to do this.\nThe people of faith should not be hobo with no rights.\nPeople of faith, their rights should be recognized fully\nand let courts weigh these things out\nin this balancing test as they should.\nThe friends I know are, our time is moving on.\nI know it's hard to hear me talk.\nI just want to address these issues\nbecause these are flat-out,\nmyth-shoots that have been told in this process.\nThe fifth question.\nIt was asked of me and our rules committee last week,\nwhere have these problems been in Georgia?\nShow me problems in Georgia where we need this.\nThis is just a solution looking for a problem.\nThe enemies are ripped for say.\nWell friends, there's a young man named Chike.\nHe was a Boonham.\nHe was a student at Georgia Clinic College.\nAnd in 2017, he followed the instructions.\nHe was gonna share his faith in the student center\nand was told to stand over the free speech zone.\nHe actually went to his free-speed zone and actually we're sharing his faith.\nHe was told by the school administration, you can't say those things.\nThe content of his speech, they said, was not okay.\nThey shut him down.\nHe brought a case.\nHe said, wait a minute.\nFirst of all, I tried to work it out with the administration.\nThey wouldn't listen to him.\nHe shut him down.\nHe had no choice.\nSo he brought a case.\nThat case, as it was working with the system, he made a claim on free exercise.\nEven a claim on free speech.\nOur current attorney general, who is friendly to the concept of religious liberty, said\nI'm sorry, your free exercise claim won't stand.\nYou don't have constitutional level of strict scrutiny protections for your right to free\nexercise.\nYour protection is the lowest level possible.\nThe school can shut you down for any rational reason they choose.\nAnd they said that you're upsetting some other students that they can shut you down.\nThat's completely legal because the current state of the law in our state is that government\ncan shut you down for any rational reason you choose because he does not have constitutional\nprotections for free exercise.\nNow fortunately, GK had two claims.\nHe had a claim for free exercise and he had a claim for free speech.\nHis free speech claim actually on speech grounds and went all the way to the United States\nSupreme Court and he actually went his case on speech grounds.\nBut it was very clear, our current Attorney General confirmed you do not have\ncautious protections for your right of free exercise, and in she case case was a\nshocking example to prove that for everyone. Number six, to pass Rifford, Georgia\nneeds a comprehensive civil rights bill. People say, we're one of only a few\nstates that doesn't have a comprehensive civil rights framework at the state\nlevel. Well, you know why we don't? Because federal law protects all of these\ncivil rights very, very well. The robust protections of our federal law and\nconstitution provides better protections than we could provide at the state\nlevel. We talked about earlier, the robust protections in our federal courts\ngive more protection to people than any state statute could and would and\nIt applies to every single case of law that could be raised into a whole umbrella of\ncivil rights law, federal law already protects you for it.\nEvery single thing except free exercise with respect to state and local governments.\nWe are filling this hole.\nIf this hole wasn't needed, we wouldn't have a bill.\nWe wouldn't be having a press conference today because there would be no need to do it.\nthat federal law provides robust protections.\nIn fact, in the federal system,\nif your civil rights are violated\nand you win on the merits,\nyou get full attorneys fees.\nIt is a way better system for people\nthan anything our state could provide.\nThat's why we leave it at the federal level.\nAlso prevents extra lawsuits,\nprevents venue shopping, unequal justice.\nOur federal system provides one level of justice\nacross our state,\nwhereas 159 candidates could create\na massive patchwork that would be K.I.\nThat's why we don't need a federal civil rights statute\nto pass RIFRA.\nThe state in the future is used to do that at some point,\nbut it's not needed for RIFRA.\nWe're simply patching a whole.\nA couple more claims.\nWell, Representative Setsler, RIFRA only protects Christians.\nFriends, I have Christians and non-Christians behind me here.\nI like to thank folks from the many communities\nthat join us today.\nIf you look across the nation,\nRIFRA laws have protected people primarily\nminority faiths. We talked about the Native American boy. We talked about the\nMuslim woman. We talked about, we talked about folks in other states who were\nChristian business people. We also have Mary Steinmetz from Kansas, a Jehovah's\nWitness woman who believed in her faith she couldn't take blood transfusions.\nShe died because her state didn't ever refer law and she was not willing to\ntake a blood transfusion for a medical procedure she needed in 2008. Her\nFor years, law and court letter to lose her life through cirrhosis of the liver because\nshe wouldn't take a blood transfusion and there was no referal on her state when all\nthis started.\nFriends, it helps mostly minority religious groups.\nIt's not just a Christian thing.\nFolks, I will have an ed, you know, refer's just an extreme law.\nIt's, it's, it's, it's, this, this, this, this light system discriminate.\nWhere are you?\nWe've covered that.\nYou're going to hear these wild claims again and again, friends.\nWe've covered these things.\nAll we're doing is to take the same protections that protect\nfolks from federal government intrusion and unfair federal\ngovernment action and apply it to our state law.\nFriends all conclude today.\nI'd like to thank the folks that joined me.\nBut if we can pass, Senate Bill 36,\nthe Legislative Freedom Restoration Act tomorrow\nand our statehouse.\nI'd like to thank somebody that would be a hero of that\nprocess. The hero, if we pass Senate Bill 36 tomorrow into law, the hero of that\nprocess would be Governor Nathan Deal. In 2016, when the Rifer bill and other things\npassed through the House, there were some concerns, there were some bad language in that\nbill, that other things added and some other things that really muddied up the federal\nframework. If we pass Senate Bill 36 tomorrow, Nathan\nDeel is a hero for religious freedom for vetoing that bad bill in 2016. It was a bad\nbill in 2016. It had extra stuff in it that wasn't the federal language. We simply want\nthe federal protections to protect folks in Georgia and Nathan Deel will be the hero\nby vetoing that bad bill and leading the way for the federal language that would be\nsigned by Governor Camp, support about the House and Senate going into law to dad. I\nlike the folks to hear that, like to thank him for that,\nbut we've got to complete the drill.\nThis is our finished and raised press conference.\nWe had people with faith with us today,\nthere's gonna be some praying,\nand they're a ton to after our press conference.\nBut friends, I'd like to thank the media for being with us,\nand I'd like to offer you the opportunity\nto ask some questions if you have some.\nAre there any questions?\nYes, sir.\nYeah, that language that was offered in committee doesn't provide with their states have with\nthat language of committee was going to do was going to exempt a claim of discrimination\nfrom refer even applying.\nWe're talking about the balancing test.\nWhen you have any claim of discrimination\nversus another claim, they have to be weighed by the courts.\nWould those, without amendment would have done,\nwould have invalidated and wiped out\nRIFRA completely.\nRIFRA couldn't be weighed on behalf of the person\nof faith against those claims.\nThose claims would have completely exempted RIFRA loss.\nIt was a Trojan horse that would have not\nhave created a balancing test, who would have made any one of these claims of discrimination\ncompletely exempt from even consideration of the person to faith, it was a Trojan horse.\nYes sir?\nYeah, I'm confident the House of Representatives will support this.\nI'm confident the votes are there. I think there are people in both parties who'd like to support\nthis. I think with recognition that when you look at Utah passing their\nRiffer Law a little over a year ago, it was unanimous in one of their\nchambers. It was voted with overwhelming majorities in most states. We had\nbipartisan support in Wyoming, other states. It's really up to the decision of\nindividual members for themselves and in the minority party here. I think\nThere are many who recognize this is right.\nI would welcome a large bipartisan vote,\nbut I know we've got the votes in the floor\nwith the House to do this.\nIt's just a matter of making the decision\nwe need to do it this year.\nI thank the leadership.\nI thank the leadership that's deliberating on this.\nCarefully, they're friends of mine.\nThey believe in this deeply.\nIt's a matter of timing.\nI think it's important to recognize the timing\nrespectfully is now.\nAny other questions?\nAny other questions?\nI have any other questions.\nGuys, I've covered a lot of ground,\nbecause specifically members of the business community\nhave asked me how to address these questions head on.\nWe've talked about these in committee.\nI talked about these a couple of years ago.\nWe first presented this bill,\nbut I wanted to go head on to the falsehoods\nyou're hearing out there in the political,\nin the political speak in committee.\nYou might even hear him in the well\nof some of our chambers,\nbut the federal law applying to city, county,\nin state governments it's common sense not controversial as some of our\nspeakers earlier said and because of that I would encourage Georgia leaders to\nact tomorrow day 39 to pass the Legislative Freedom Restoration Act this is\nno demand this is it's a request guys this is this is a process we're not\nstanding here in protest we respect the leaders in this chamber deeply they\nagree with this legislation. We're just urging folks to see the urgency of now.\nLast year, there were some concerns about just some of the cast of election year.\nThis is the year to do this. We can do this with substance. We've taken questions.\nWe've had the debate. We've answered the questions. And the time is now.\nI'd like to thank members of the business community who support this. We're standing behind me.\nand let's pass the British Freedom Restoration Act in 2020. Thank you.\n",
  "updated_at": "2026-02-12T18:53:39.150764+00:00"
}