{
  "video_id": "sAcyuUN3iLM",
  "url": "https://www.youtube.com/watch?v=sAcyuUN3iLM",
  "title": "11/28/23 Senate Study Committee on Certificate of Need Reform",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Certificate of Need Reform session on 11/28/23:\n\n**Overview**: The committee discussed recommendations for reforming or repealing Georgia's Certificate of Need (CON) laws, with a focus on addressing the anti-competitive effects and barriers to healthcare access, especially in rural areas.\n\n**Key Actions**:\n- No specific bills were passed or referred.\n\n**Bills Introduced (First Reading)**:\n- None detected.\n\n**Notable Moments**:\n- The committee chair thanked members for their thorough recommendations, noting that 9 out of 12 members supported a full repeal of Georgia's CON laws.\n- The chair opened the floor for discussion on the recommendations, inviting committee members to unpack their views.\n- One member, Chairman Watson, expressed the need to balance the rigidity of the CON laws with the operational realities facing healthcare providers.\n\n**Votes**: \n- No recorded votes.\n\n**Attendance**:\n- Quorum was present, as the committee members were able to discuss the recommendations.\n\n**Adjournment**:\n- The session adjourned, with no specific date provided for the next meeting.",
  "transcript": "We're going to go ahead and call this meeting to order and the Dean of the Senate is going\nto open us up in a word of prayer on number eight.\nThank you, Chairman.\nAnd if you're about with me for a moment, Father God, we thank you for the blessings of\nthis day for safe travel to and from this occasion. And let us be mindful of the fact that we're\nhere representing all the people of Georgia and health care. Big issue not only here but throughout\nAmerica. We thank you for the many blessings of coming and going safely and things we don't\nremember and think of every day. These things we ask in Jesus name. Amen. Amen. Thank you, Mr.\nChairman. Good morning, everyone. Hope everybody had a fantastic Thanksgiving to the members\nof the General Assembly. Thanks for coming back a day early to the working members of\nthis committee. Thank you for all the time that you have taken to help us in this endeavor\nand to those people that have participated either as expert witnesses or just providing\nyour own experiences as well. We're extremely grateful. We're going to go over our findings\nrecommendations today. Before we do that I do want to thank everyone from\nSenate Press to Legislative Council especially to Mackenzie in our office\nfor all the work that you've done getting the reports together and then\nJocelyn who worked through the weekend I think up until about 10 o'clock\nlast night and then again at about eight o'clock this morning getting this\nreport in front of all of us. I would like Jocelyn in just a minute for you to\npresent the recommendations to the committee. All committee members should have\nreceived an email this morning with these recommendations.\nAnd so hopefully you've had a chance to look those over if you\nhave not.\nThey're on page 14 of 15 in your report.\nJust going to give you a state of play for the meeting this\nmorning.\nJocelyn's going to walk us through the recommendations.\nI'm going to open the floor for any and all discussion\namongst the committee.\nThere was a lot of, and I'll speak a little bit more into\nthis when she's done, but there was a lot of synergy in the\nrecommendations that you all sent.\nSo thank you for sending those.\nThe recommendations were thorough.\nA number of members sent in multi-page recommendations,\nhighlighting things that they learned through this process,\nand then kind of that came to their conclusions\nof those recommendations.\nAnd what I would call the main recommendation\nthat you're gonna see today that we'll talk about,\nnine out of 12 members responded in favor\nof that main recommendation.\nSo we have large consensus among this board.\nAnd there were a couple that I didn't hear from,\na couple of members that did not provide those,\nwhich is fine, and they may be addition to the nine.\nso we'll obviously see that in the discussion today.\nAfter that discussion, we will vote on adopting\nor amending the report that is before you\nwith the findings, and then that will conclude\nour work as a committee.\nSo I just wanna thank everyone again\nfor your role in this process, and with that,\nJocelyn, I'm gonna turn it over to you\nif you can walk us through the recommendations\nthat begin on page 14.\nSo, I'll just go ahead and kind of read it off.\nBased upon the testimony, research presented, and information received, the study committee on Certificate of Need Reform has found that the problem which Georgia's con laws were intended to combat no longer exist.\nThe con process is used by market incumbents to prevent competition and deny patients the benefits they're from.\nThe con laws prevent the citizens of Georgia from benefiting from advances in healthcare delivery, especially in rural communities.\nIn accordance with these findings, the study committee recommends the Georgia's con laws should be repealed in their entirety.\nRepealing Georgia's con requirements would eliminate the anti-competitive effects of and abuse practices under this law.\nMost recently, South Carolina repealed its con law, the study committee members and the Senate will utilize South Carolina's model for potential legislation for the 2024 session.\nSince the General Assembly is unable to enact a full repeal in the upcoming session, the\ncommittee recommends that the Georgia General Assembly pursue the following changes to the\ncurrent con-loss.\nNumber one, repeal con requirements for obstetric services, neonatal intensive care birth centers\nand all services related to maternal and neonatal care across the state of Georgia.\nat requirements for hospital-based CON on January 1st, 2025. Reform CON laws to eliminate\nCON review for new and expanded inpatient psychiatric services and beds that serve Medicaid patients\nand the uninsured. Repeal all cost expenditure triggers for CON. All medical and surgery specialties\nshould be considered a single specialty including cardiology and general surgery. Multispecialty\ncenters should be allowed, particularly in rural areas,\nremove con for hospital bed expansion,\nrevise freestanding emergency department requirements\nsuch that they must be within 35 miles of\ninaffiliated hospital and remove con requirements,\nand remove con for research centers.\nGreat, thank you, Jocelyn.\nAs I mentioned earlier, nine out of you\nin your recommendations to us or in conversations\ndirectly with myself have recommended a full repeal of Georgia's con law.\nAnd that's really the high level recommendation here.\nThe secondary recommendations, because we recognize that may or may not be achievable.\nIf that is not achievable, we thought that it was worthwhile to go ahead and dive a little\ndeeper and make some specific recommendations on ways that we can enhance and improve\nthe current statute.\nThe first recommendation here, as it relates to repelling requirements for OBS, NEO-NATLE-ICU's,\nBIRS centers, and all services related to maternal and neonatal care, that came from me.\nThat was the only recommendation that came exclusively from me, and even that recommendation\nis kind of bundling together pieces of different recommendations from members of this committee.\nThe last three on here, number 7 through 9, were from one member of the committee, but\nnumbers two through six were all from multiple members of the committee.\nSo I think for me having the benefit of reading through all of these recommendations, what\nwas very interesting, instructive, and encouraging was that unless you all were colluding in some\ncapacity that I was completely unaware of and discussing this, and I'm sure that you\nwere discussing, however, in the extensive recommendations that you all sent, there\nis definite consistency around the recommendations\nthat are in this report, and that is why,\nand how they made their way into this report.\nWith that, I would like to open the floor\nto any discussion and commentary from members of the committee.\nIf you wanna unpack any of your recommendations,\nif you wanna unpack some of the thoughts\nthat you put into your recommendations to us\nas it relates to the overarching recommendation\nof a complete repeal, I think it would be beneficial\nto have that on the record.\nAnd so with that, if any of you have any comments\nthat you would like to make, I'd be happy to recognize you.\nChairman Watson, are you reaching for number five there?\nThank you, Mr. Chairman.\nI have not had a chance to look at this\nand it's relatively new, so I want to make sure\nI'm reading exactly what it says\nand the purpose of it, obviously,\nto look at a very important issue for the CON issue\nthat has been back and forth over many, many years.\nAnd my inclination is after listening\nto doctors and Columbus and Savannah and all\nof the places we've gone in organizations and hospitals.\nIt seems to me that there's something\nthat needs to be done as it relates to the rigidity of it.\nPerhaps as a word, I'm looking for maybe to the,\nit may be too rigid to deal with current operational situation\nas it relates to people who want, who can offer the service\nbut are not being allowed because of the restriction\nof CON.\nSo I don't want to just jump off and say,\nI'm supporting a complete lifting of it,\nbut I'm open to, based on some information I've heard,\nas I said from around the state to look at some things\nthat we can do to deal with the current,\nthe ability of people to, in that medical field,\nto deliver services that they're capable of\nand provide that valuable service\nfor the people of state of Georgia.\nGreat, thank you, Mr. Chairman.\nI hope that you are able to digest these in this meeting,\nand then also I hope that other members of the committee\nto maybe shed light on or offer their own commentary\non recommendations one through nine\nbecause I believe that these recommendations\ncan accomplish exactly what you're talking about.\nChairman Watson.\nThank you, Mr. Chairman.\nThank you for the meetings that we've had\nand I think very informative for all of us.\nI wanna mention one letter that Dr. Beatty\nwanted to make sure that we included\nAnd I have not had a chance to look through the final version here,\nbut it probably is included, but I wanted to bring special emphasis\nto his letter from Augusta.\nIn review of that, just the clarification,\nI think maybe we'll need some clarification on line nine\nwhen it talks about research centers.\nAnd we talked about that ahead of time.\nDoes that mean those that see patients,\ndon't see patients that which may be what that alludes to and or are we talking about\nteaching hospitals and so forth and then that's number nine and then in number on number\nfive and six are we talking about ambulatory surgery centers is that what we're talking\nabout when it's just centers I just you know I'm not a lawyer but we do pass legislation\nand definitions many times makes a difference so just want to make sure we're clear what\nwe're talking about.\nMr. Baker, I remember incorrectly that you were the one\nthat highlighted Mark, were you the one that highlighted\nthe research center piece, were there research centers\nin the state that do not see patients, do not accept\ninsurance, there are strictly doing research\nthat were denied acts that were told by DCH\nthat they needed to file a CON for a PET scan machine.\nAnd so the intention of number nine is to capture that\nand just hopefully clean up that language\nsuch that DCH is clear.\nI don't think that that's an extensive broad brush across the existing, I think it's probably just a capture, what we probably would all say is the true intent of the law.\nI think that was just overreaching.\nSo I mean, to be clear, so these are research centers that are doing research and need a CT scan or PET scan or something like that.\nAnd they were having to go through the CON process and obviously that was not the intent of it.\nit and DCH is ruled that apparently and so that's that's a clarification there okay that makes sense\nsure thank you great and then to answer your question about five and six yes we're speaking to the\nSCs there\nDr. Wordon are you on 11? Yes okay you're recognized\nFirst, I just have one point of clarification, number four, which is repeal all cost expenditures\nthat would apply to L&R rules too since that's under CON.\nCorrect.\nA previous draft of this had that in for hospitals, but the current recommendation, I think\nthe spirit of what the recommendations were from the committee was for that to be a broad\nelimination of the expenditure thresholds.\nAnd I would just like to say that, you know, I've really enjoyed listening to all the\ntestimony and having approached this in the past purely from a point of a private practice\nphysician.\nIt's been very interesting to me to listen to the testimony about the hospitals and all\nof these other areas and reading the things about which I was not as familiar.\nAnd I would agree that repeal certainly seems to be the most logical and conclusion that\nI could draw, but certainly these recommendations would address a lot of the access problems\nthat happen in rural areas and the ability of physicians to deliver care in the appropriate\nsetting.\nSo I want to thank you for the opportunity to participate.\nThank you, Dr.\nAny other commentary from the rest of the committee?\nChairman Harrison, would you like a few minutes to continue to review?\nI see your reading over there.\nI want to make sure you have time to digest this before I call for a vote.\nNumber four that someone just dealt with that one and they looked at that one. I thought that number six\nAbsolutely number six. I think that's something that we've all been trying to deal with\nNow, I'm not so sure about the ramification number five, all medical and surgery specialists\nshould be considered a single, especially including cardiology and general surgery realm.\nI'm not sure a medical person gives me some idea of how that.\nSure.\nThat was part of a recommendation from Dr. Watson, so I'm going to go ahead and let him unpack\nthat a little bit for us.\nOr do you think that I should have a better data worth on?\nYes.\nSo I think that there's been a lot of controversy\nand changes in the rules of what is a medical special.\nLike orthopedic surgery could have a surgery center.\nCardiology has been, are they considered\na single specialty for L&R rules,\nor if the pedics had some overlap with physiatry.\nSo this would say that cardiology is a specialty,\nGI is a specialty, psychiatry is a specialty,\ninternal medicine is a specialty.\nI don't know what they would use as a center\nof each specialty would have the ability\nto do a L&R center.\nIn part of that had to do with what,\nthe definition of general surgery was,\nwhether or not they were a single specialty\nand that was having to do with the Eleanor Rose.\nSo if you were in your internist,\nbut you're not certified as a cardiologist,\nbut you practice cardiology\nand have the license to do those procedures,\nyou would be able to be as a cardiologist.\nChair Lee, your Patrick.\nYeah, just to either clear that up\nmake it more confusing. I'm a hand surgeon and you can be a hand surgeon if you're an orthopedic\nsurgeon, a plastic surgeon or a general surgeon. And so we specifically put an exception in the CON\nin the L&R law for hand surgery. And I think also for physiatry because there's so much overlap\nbetween the specialties. So that's, I think this would help clear that up.\nAny other commentary from the committee?\nAll right. With that, I'd like to entertain a motion on the totality of the findings.\nAnd then we will take a vote.\nMotion to adopt the report, Mr. Sherman.\nWe have a motion to adopt the report and the findings.\nDo we have a second, Mr. Baker, all those in favor of the motion or any discussion?\nAll those in favor of the motion, please signify by raising your hand.\nGot one, two, three, four, five, six.\nAll those opposed like sign, see one.\nand carries six to one.\nI'm going to recognize Jollison.\nWe didn't have all the members present voting.\nWe need to have all the members voting on the report.\nOkay.\nThere's no abstention.\nOkay.\nDid you have a vote, Mr. Chairman?\nOkay.\nWhat?\nYou can't abstain from voting.\nI'm going to refer to Council on that.\nOkay. You need to vote Mr. Chairman. Okay. So that moves then if my account is correct\n6 to 3. Is that okay. Motion carries 6 to 3. I'm going to recall the vote. All those\nin favor of the motion is presented please signify by raising your hand. I see\nthese six years, all those opposed like sign.\nAnd I see two, you're correct.\nSix to two, correct.\nI've voted to break a tie, which we do not have.\nMotion carries.\nOnce again, wanna echo my thanks to this committee members,\nall those who worked hard in support of this committee.\nYou are our honorary members and to all of those that\ntravel with us around the state and offered your input.\nIt was very valuable and helped us get to the conclusions\nthat we got to use to thank you all.\nAnd with that, this meeting, this committee, our adjourn.\n",
  "updated_at": "2026-02-12T01:50:59.347151+00:00"
}