{
  "video_id": "SbawhQHbHB4",
  "url": "https://www.youtube.com/watch?v=SbawhQHbHB4",
  "title": "Sen. James Press Conference on HOA | 02/10/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 22,
  "summary": "Here is a summary of the key points from the Georgia Senate session on HOA oversight on 02/10/2026:\n\n**Overview**: This session focused on addressing issues with homeowner's associations (HOAs) in Georgia, with several state representatives and senators discussing proposed legislation to increase oversight and accountability of HOA boards.\n\n**Key Actions**:\n- **HB 1222**: Bill to create an HOA oversight commission and require training for HOA board members\n- **SB 107, SB 120, SB 406**: Bills addressing various HOA-related issues like payment allocation fraud, elections, and transparency\n\n**Bills Introduced (First Reading)**: No new bills were introduced, the focus was on the existing HOA-related legislation.\n\n**Notable Moments**:\n- Representatives shared numerous constituent stories of HOAs unfairly foreclosing on homes or seizing assets over unpaid fees/assessments\n- Calls for the legislature to pass \"real\" reform to protect homeowners' rights and the \"American dream\" of home ownership\n- Frustration expressed over years of advocacy with little action taken by the legislature\n\n**Votes**: No recorded votes, this was a press conference and discussion, not a legislative session.\n\n**Attendance**: No specific quorum details provided.\n\n**Adjournment**: No formal adjournment mentioned, this was an informal press conference.",
  "transcript": "I'm State Representative Sandra G. Scott, Server District 76 out of Clayton County.\nToday we are here for HOA, COA, and POA Day at the Capitol.\nThe reason that we have come together is because we have received countless of calls and\nemails from constituents across the state of Georgia,\ntalking about the unfair and unjust treatment\nthat they are receiving from the HOAs.\nNow, I have introduced four bills that\nis only calendar for this year that\ndeals with HOA in a variety of ways.\nBut the main thing that I am talking about in these bills\nis that no one, I mean no one, should lose their home\nbecause of fees and assessments trash our water.\nNo one should be losing their homes.\nWe have people that are losing their homes to HOAs\nbecause of fees and assessment.\nAnd we all know that when we bought a house,\nthe two things that we must pay, and that is our mortgage,\nand our property tax, we should not be losing our homes\nbecause of fees and assessment.\nAnd that is what my bills are looking at,\nbecause this is our American dream.\nThis is the American dream is home ownership.\nIt is the largest purchase you will make in life.\nIt's in home ownership, it's your home.\nAnd you should not be losing it\nbecause of taxes, fees, water bill, trash bills.\nAnd now, I'm going to turn it over to Michael Shepherd.\nCome on, Michael Shepherd.\nMichael Shepherd.\nThank you, Michael.\nThank you all.\nMy name is Michael Shepard and I started the watch project which means working for accountability,\ntransparency and control for homeowners and that's something that's been lacking in the state of\nGeorgia. Everyone behind me has been coming to the Capitol for years. We've been reaching\nout to our constituents on the Republican side, on the Democrat side. I'm sure they're tired of\nhearing us. I'm tired of having to repeat the same problems that we've had in our community\nand I'm just thankful that we've reached this day where Georgia stands on the forefront of the\nthe nation of potentially passing one of the strongest HOA oversight in the nation and\nthat makes me proud resident of this state.\nRight now we are looking at SB 406, SB 107, SB 120, HB 1222, the whole alphabet.\nWe have a number of different laws right now which looks at creating an oversight commission\nthat looks at holding HOA boards accountable with training,\nthat's something that the state desperately needs and it's been lacking.\nAnd I just want to state too that we have a numerous issues with,\nwe have numerous issues with HOA's committing payment allocation fraud,\ntaking people's check, returning it to them and forcing them into foreclosure.\nIt's absolutely criminal and it needs to be stopped.\nWe have HOA boards refusing to hold elections, refusing to hold meetings.\nThat's why I got in this fight.\nI have a property at Peyton Place and the HOA refuse to have a meeting,\nrefuse to hand over insurance paperwork, refuse to close on homes\nbecause the HOA board wanted those homes for themselves.\nI decided to fight my lawsuit costs $40,000.\nI'm still not done paying for that.\nNo resident in Georgia should have to pay $40,000 to have an election to get what's\nowed to them.\nThat's not the American dream.\nIt's the American nightmare.\nAnd I'm proud that all of these people are behind me right now.\nAnd there's many people who unfortunately had to work who couldn't be here.\nFor those people, I'm glad I could show up today and say, we want change and it's on\nthe cusp.\nAnd I demand legislators past that change to make Georgia the strongest state on H.O.A.\ncorruption, H.O.A. front, and H.O.A. abuse.\nGood morning, I'm Representative Viola Davis and I serve House District 87 in Stone Mountain,\nthe Great County of the Cal. I'm standing here to explain to you why we had to have an\nHOA, COA, POA, day at the Capitol.\nAsk yourself if your constituent came to you and asked you,\nwhat should they do?\nThey were laid on their assessment.\nAnd somebody came and told away their car in punishment.\nShould an HOA have the right to take a home on his car\nbecause they're late on paying their assessment.\nThe average person would say, no.\nOh.\nWhat would you say to a constituent\nwho's an elderly woman, have paid her assessment\neverything on time and so much so that she gave you\ntwo years of bank statements to prove it?\nYet she was still charged, lay fees,\nshe was still sent had to go to court over 20 times to keep her property. Should that elderly woman\nlose her home? No. What about a disabled veteran who finally reached a time that he can retire?\nAnd he's going to retire right here in Georgia only to have his home burned down and the insurance\nmoney which was over 1.5 million was taken by the board and put into their personal account.\nShould that homeowner lose their property?\nThese are some of the nightmares that we have been bombarded with.\nAnd we are telling the people that we have to work together to protect and promote the\nAmerican dream of home ownership.\nWe have to remember that this is a massive, massive problem.\nAnd the misery alone is producing a lot of money for those who do not want to operate\nwithin the law. Let us move forward with representative\nScofield. Good morning. I'm State Representative Kim\nScofield representing District 63, Fulton County. Listen,\nthis is not just a political issue. This is a people issue.\nAnd for over eight years, we've been fighting and standing to\nthat acts and demand that people pay attention to the people that are behind us, that want\nthe right to not lose their house because of lack of oversight and accountability.\nWe are speaking to the members of this body and this general assembly.\nDon't just give the people fluff.\nLet's get some real legislation that's going to protect homeowners that's going to protect\nthese egregious actions.\nListen.\nknow that there are some of the HOA, COA and POAs that think they're doing great jobs\nand some of them are.\nThis message is for us to strengthen everything that make it right for the people of Georgia.\nThis is not an urban issue, this is not a suburban issue or a rural issue.\nThis is a people issue that needs to be addressed in this house now.\nWe are the people, and we demand action from this legislative body on not just putting\nmeasures in place, but making real change.\nSo the people that have traveled to the people's house get some resolve, accountability, and\noversight.\nNow we're here from State Representative, State Senator, Donzella James, State Senator.\nI'm going to try to get up anyway, hey, I got you, okay, thank you, okay, you did look\nYou're going to get some of that more brown sugar, aren't you?\nHow did you get your hands raised?\nI like it.\nYou look like a little boy anyway.\nSorry.\nGood morning.\nGood morning.\nAnd it is a good morning because we have come together to solve our own horrible problems that are right here in the state of Georgia.\nNot just in metropolitan Atlanta, but all 159 counties.\nWe have heard from everyone.\nWe've had five hearings that were official.\nWe had other hearings that we just all came together\non the House and Senate side.\nI'm sending to Jones, all the James representing District 28,\nbut I'm the chair of the Urban Affairs Committee for the Senate.\nThank goodness on that committee,\nwe've been able to address the problem\nof predatory HRAs, not all HRAs.\nBut we found out that there are\nno stipulations, no rules about it.\nThey can do whatever they want to do\nand write their covenant.\nSo what are they doing? They have no integrity with many of them. They don't follow their own rules and\nbylaws and consequently people are losing their homes. They can sell your home on the courthouse steps\nwithout even telling you we're going to do it. If you know that you have at least $2,000 worth of\nleads and finds they can do that. And when I stand don't pay your H.O.A. dues in fact about\n85% of the people who have problems the dues have nothing to do with it. It's other things like\nthe grass is not it's more than six inches tall. And then if you don't fix it within a week\nthen they can add a hundred dollars a day and they're doing this. So people have\nworked so hard to buy their homes and to take care of their families and now\nthey have this horrible H.O.A.s that are stealing their homes right from\nunder them. So today I'm proud to speak about three of the bills that we have\nhave already introduced. Someone asked me why you have so many bills. Well we have so\nmany problems with HOA. We don't have any HOA reform. Most of the people who gave me suggestions\nthey wanted us to abolish HOA completely in Georgia because they have so many problems.\nof course there are good HOAs, there are some who follow the rules.\nSo we are working today on many bills and the House members have mentioned there's already\nbut the House and Senators together on this.\nWe have to work together to solve this problem because it's not a state representative or\nSenator or a Republican, a Democrat, a Black or White.\nThis is happening to everybody, all of us.\nSo I have good news that one bill finally is moving.\nAnd last year I was able to pass the bill for a study\ncommittee, and they put that study committee\nin Senator Brass's hands.\nAnd he saw all the people from his cow weta county\nand other places having some serious problem,\neven worse than some of the ones that we've been talking about.\nSo he was the chair, and he made me his co-chair.\nWe came up with many bills, but House City Bill 406\nis the one that he authored.\nAnd we call it the Georgia Property Owners Bill of Rights.\nAnd it creates a state board for review of complaints regarding property owners' association\nunder the Secretary of State's office.\nIt will be in the nonprofit office.\nAlso, we've gotten clear on doing that if this bill passes.\nIt requires all POAs to register with the Secretary of State.\nIt gives the Secretary of State the power to suspend,\nrevoke, modify, limit all POAs and POA orders\nfines assigned to the Senate.\nAlso, it covers all the COAs, kind of minions,\nand all of the HLAs.\nSo we will finally, yes.\nWe will finally be able to, once this is passed,\nyou have fines against you and you already have problems,\nbut if you don't take care of that fine,\nthen they will multiply.\nAnd also, they have the power not to even take any more\nof your HOA fees.\nSo then that's another disaster,\nbecause you're getting more and more,\nyou're climbing up the fence for a foreclosure\non your property, on your dream house.\nThis is not acceptable in the state of Georgia.\nWe are going to pass these bills I hope this year.\nIf not, we need to appeal to not only the governor\nand the attorney general, we need to go all the way up\nto DC and have them come down here and do something.\nSo this is just an answer from the five HOAs that we've had and the hard work of a lot\nof the legislators in the House and the Senate.\nSo hopefully we will pass it.\nI'm claiming the victory.\nHow about you?\nOkay, are there any questions?\nYes.\nSo you mentioned Jeremy's press.\nYeah.\nWhy isn't that mean you mentioned this?\nYou may have heard of one.\nBut in general, I have some legislation.\na lot of people don't understand what is going on. They don't realize that when\nyou they say well they sign the contract. You sit down to buy your home then you\nget this thing you have to sign for the HOA. You know many people don't even\nknow what they're signing and they want to know why am I paying extra money.\nThey're sitting in the closing right then. It's not anything you they told\nthem before that so a lot of people don't really understand and some of the\nlegislators say that their people are calling them saying don't pass this\nbecause it's gonna hurt the landlord. Landlord, we have corporate investors who\nare coming down and buying these houses and they are already in with the\nmanagement companies and it's only about three management companies that really\nown all these other and over these HOAs. They might have another name but\nthere's a subsidiary of that one so that that's the main reason but I hope now\nmany of the people on the other side have started listening and coming to me\nand saying tell me more about it so I'm we're trying to educate and\nand motivate them to please look at this legislation.\nWe have so many people here today,\nbut we have rallied this morning.\nWould even more people have to go to work.\nSo we are here.\nWe are coming together,\nand we are gonna pass this legislation.\nAny other questions?\nThis is a special win.\nAnd HWA can start for closure from Monday,\nmine from $10,000 to $4,000.\nIt's been some pushback and making that change\neven if it's saved $4,000.\nThat was different after all.\nWell, yes, this question was,\nthere have been suggestions of moving the $2,000 worth\nof fines where you can, your house can be\nfull closed on to $4,000, but whether it's $2,000, $4,000\n100,000. It doesn't matter. We need to not use that as as a reason to foreclose.\nYou want to say something?\nThat's what it takes to get the bill passed, to be able to do this year.\nYou know, we do need to chip away by doing some of these bills and passing them, but we can't,\nI'm unbought and unbought and it's no way that I can say oh yeah let me just get\nthis part we need something strong and I'm so proud the senator who is the\nchairperson of rules has this bill that is strong he has teeth in it already\nof course a lot of them could be a lot stronger but maybe anything is going to\nstop the foreclosures.\nAny other questions?\nLet me say that Senate Bill 406, adding the $4,000 threshold,\nI would say that it is not bill efficient to the people.\nIf they couldn't pay the $2,000, they\ncan't pay the $4,000.\nAnd we should not be charging any fines or fees that\nwill take a person home away from them.\nBecause that is the bottom line.\nPeople are losing their homes through HOA,\nCOA is a POA because of fines and assessment.\nAnd they have to write the charge you what they want to charge you.\nAnd people don't really have to write the fight them\nunless they go to court.\nSo I say that the bill need to be amended\nbecause we should not have any type of threshold\nand of fee, where a person can still lose their home.\nAre there any other questions?\nYes, okay, yes sir.\nWe don't have the minds in there,\nso we like to very clean our property\nand then say, what do you clean it up?\nBecause they never come and do it.\nWe have like a fire used and we have to find it.\nAnd we will work with you that, the bills that we have.\nDo you see the fence?\nYes.\nThey never advance this in 1971, when they knew that.\nThey never paid that, they knew this.\nIt's many, it's many COAs and HOAs that promise the world.\nBut they never give you that bike trail or that not even\nclean up.\nIt goes to them.\nAnd that's what we're trying to do now.\nPut some procedures in place.\nSo this won't happen.\nI would love to talk to you right after this, okay?\nAny other questions?\nOkay, thank you all for coming.\n",
  "updated_at": "2026-02-12T01:32:42.943449+00:00"
}