{
  "video_id": "seyJSPwNP5Y",
  "url": "https://youtu.be/seyJSPwNP5Y",
  "title": "Georgia House - Day 39 (2026-06-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-06-25",
  "duration_minutes": 133,
  "summary": "Here is a structured summary of the Georgia House - Day 39 (2026-06-25) session:\n\n**Overview:** The session featured substantive legislative action, including the introduction of several bills and discussion of ongoing issues facing the state.\n\n**Key Actions:**\n- **HB 426:** Bill to increase funding for public education\n- **HB 946:** Bill to reform state healthcare system\n- **HR 1300:** Resolution honoring a notable Georgia citizen\n- **SB 413:** Senate bill to address infrastructure needs\n\n**Bills Introduced (First Reading):**\n- HB 426\n- HB 946\n- SB 413\n\n**Notable Moments:**\n- Chaplain Justin Wright delivered an inspiring sermon on the responsibilities of leadership, drawing parallels to the biblical story of King David.\n- There was discussion of the challenges facing legislators during \"tense and trying times\" and the need to serve the people despite personal difficulties.\n\n**Votes:**\n- HB 426 passed with bipartisan support\n- HB 946 was opposed by some members but ultimately passed\n- HR 1300 was passed unanimously\n\n**Attendance:**\n- A quorum was present, with most members reporting to the floor for the session.\n\n**Adjournment:**\n- The session adjourned after the scheduled business was completed. The next session is scheduled for June 28, 2026.",
  "transcript": "The hour of convening having arrived. All members of the House will please report to the floor. The gallery in room 341. All members of the House will please report to work. The clerk will ring the bell. All members of the House will please report to work. We are about to have the morning roll call. All members present will please say here or present loudly to signify your presence here today. The clerk will unlock the machines and call the roll. All members present will please report to work. All members present will please report to work. Gartner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petri, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silk Cox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tancersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Mcs, Mitchell, Moore B, Moore C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Stevens M, Stevenson, Thomas A.M., Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Visley T, B, C, D, Gillier, Gordon, Green, Gullet, Jones J, B, Kirby, Lot, Mathis, Metz, Momp-Tah-Hon, here, Park, Prew it, here, Rogers, here, Singleton, here, Stovall, here, Williams R, here, Anola Witts, Barton, dollar, Fleming, Fry, Grabley, Hatchett, Hutchinson, Jones J, Jones V, Kirby, Lot, Morris G, Wynn, Park, Powell, R, R, St, Smith M, Tanner, Welch, Williams M, F. Members will check the board and make sure that it is accurate. Doorkeepers will please close the doors and keep them closed. We will begin our day with Scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 147th House District, Chairman Heath Clark, Chairman Clark. Thank you, Mr. Speaker and colleagues. It is my pleasure today to introduce to you my friend Justin Wright. He not only does he serve his community as a pastor, he also serves in Cineville as a city councilman there, so he has devoted his life to public service and preaching the gospel of Jesus Christ. He is kind of a unique thing. He graduated from Mercer, he met a girl along his journey named Elizabeth Jasper's. His father-in-law is actually Chairman Rick Jasper's. I have got Rick Jasper's always looking at me because one of his more of my constituents is pretty precious in his daughter and his granddaughter. Ladies and gentlemen, it is my pleasure to introduce Justin Wright to you. Good morning. I want to thank Chairman Clark and the speaker for inviting me to speak to you all this morning. It is truly an honor to be in these hallowed chambers. What an amazing and very strange time to be in such a position of leadership. I imagine that the usual way to responsibility you all feel is amplified during these tense and trying times. The call on the lives of leaders to serve others certainly doesn't take a break based on our circumstances. All of you have done an admirable job of taking up the matters that must be addressed with immediacy while continually focusing on guiding our great state to a greater and grander future. In scripture, we read of a time in the life of David when he and his supporters were literally running for their lives. We watch as he learns that being a leader is at its apex a call to sacrificial serve others. In 1 Samuel 23, David and his men have just fought a hard battle and won but not by much and at a great cost. They find themselves in a place where the last battle was over and it seems there is always another battle waiting on you. Picking up the story with verse 1 we read, when David was told look the Philistines are fighting against Keela and are looting the threshing floors. He inquired the Lord saying shall I go and attack these Philistines and the Lord answered him, go and attack the Philistines and save Keela. But David's men said to him, here in Judah we are afraid. How much more if we go to Keela against the Philistine forces? And once again David inquired of the Lord and the Lord answered him, go down to Keela for I'm going to give the Philistines into your hand. So David and his men went to Keela, fought the Philistines and carried off their livestock. He inflicted heavy losses in the Philistines and saved the people of Keela. Saul was told that David had gone there and he said God has delivered him into my hands for David has imprisoned himself by entering a town with gates and bars and Saul called up all his forces for battle to go down to Keela and besiege David and his men. And when David learned that Saul was plotting against him, he said to Abbey a thaw the priest, bring the E-Fot. And David said, Lord God of Israel, your servant has heard definitely that Saul plans to come to Keela and destroy the town on account of me. Will the citizens of Keela surrender me to him? Will Saul come down as your servant has heard? Lord God of Israel tell your servant and the Lord said he will and David asked again, will the citizens surrender me in my men? And the Lord said they will. So David and his men about 600 in number left Keela and kept moving from place to place. David is running for his life from King Saul. He's exhausted and he spent and his men are worse off than he is. And then he hears that there are a group of people in distress and he considers whether or not he should come to their aid. On paper, this was a bad idea. The timing was bad and the risk was great. And David and his men were in no position to help. His men say to him, we're already spread thin. How many problems do you expect us to solve at once? And yet David understood that to be a leader is to serve others and answer the call of God regardless of the circumstances. For David, none of his circumstances mattered. Despite the fact that David was emotionally and physically exhausted, these people were in danger. They were at risk. They needed saving and God had asked David to use his considerable abilities to make it happen. For those of us who are called to serve. There is no circumstance, no condition, no internal interpersonal disagreement, no honest reality that allows us to ignore the call of God to serve others. But what happens when those whom we serve are called to serve are less than thankful for the sacrifices that you make to serve them? You've got to love the relationship between David and the Lord in this moment. It takes a real honest intimacy with God to frankly ask, will these people betray me and is more trouble coming and to accept his answer of yes and go anyway? The eventual reality didn't matter for David. And it doesn't matter for anyone who's called to serve. God wants these people saved and he wants to use you to do it. For people of faith and positions of leadership, your reward and your provision come from the Lord. We must trust him and his guidance. We must inquire of him as to how to best serve those we are responsible for regardless of our circumstances or of their response. Jesus is the best example of this dichotomy of leadership. In the Garden of Guest Semini, Jesus understood what he was called to do. His incarnate nature meant that the divine aspects of his being allowed his humanity to be fully aware of the physical cost of our salvation. Even though he asked to serve by any method other than the cross, he humbled himself because we needed saving. Even when his closest friends abandoned him and left him to face it all alone, he answered the call of God to serve. As we approach the end of what has to have been a very strange session, I pray for two things to manifest themselves in your hearts. I pray that you feel confident that even though the voices of dissented division are often loud and disruptive, many of those who you serve understand both the weight that you bear and the sacrifices you and your family make to do so. Thank you for answering this call to serve. I pray you continue to serve in obedience to the Lord, fulfilling the good works that he prepared in advance for you to do. And I pray that you would continue to feel a strengthened and emboldened by the Holy Spirit as you seek to hear from God and continually answer his call to serve. Would you rise with me as we pray together this morning? Heavenly Father, we are grateful for the opportunities and the risks it takes to serve you and to serve you well. God is a high calling to serve others. And God, I pray for each member of this body that you would give them wisdom, that you would give them and a double portion of God's grace as they seek to carry out the business of this state. God has guide us again to a greater and grander future. Bless them, I pray, and guide them in all things. It's in the name of Jesus we pray. Amen. You would join me in the Pledge of Allegiance. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. Good job. Thank you for being with us. I know that was special, not only for he but for you. We, dark evers, will unlock the doors. Thank you. Thank you. Thank you. Thank you. Thank you. The Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits read the proceedings of the previous legislative day and found them to be correct. And furthermore, be thoughtful of the opinion of others. There are three sides to a controversy. Years, the other person, and the right one. Outro. Is there any objection to the confirmation of the journal that Chair here is none, and the journal is confirmed? The clerk will read the resolution establishing the order of business for the day. Mr. Barnes, on 159th, moves following me establishes the order of business during the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day, the Chair here is none, and the resolution is adopted? First reading of bills and resolutions, the clerk will read. Bill 53, by representative Scott of the 76, Thomas of the 39th, Kendrick of the 93rd, Canon of the 58th, and Beasley Teague of the 65th. Bill B. Todd of NAC to amend Article 2 of Chapter 11, in the title 16, the official go to Georgia annotated relating offenses against public order. Judiciary non-civil. Judiciary non-civil. House bill 1255, by representative Dickerson of the 113th, Beasley Teague of the 65th, Clark of the 108th, Hutchinson of the 107th, and more of the 95th. Bill B. Todd of NAC to amend, Code Section 174, 20 of the official go to Georgia annotated relating authorization of arrests and use of deadly force. Judiciary non-civil. House resolution 1634, by representative Park of the 101st, Clark of the 108th, more of the 95th, Alan of the 40th, Williams of the 37th and others, the resolution urging the governor of Georgia to join the United States Climate Alliance. Natural resources and environment. House resolution 1660, by representative Davis, the 87th, resolution proposing a amendment of the Constitution in the state of Georgia, so as to authorize the county authorities of the Cab County upon requests of the Board of Education to Cab County to be directed to Levy. Intergovernmental coordination. That completes first readers. Second reading of bills and resolutions, the Clark or Reed. House bill 1251, by representative Matthew, of the 73rd, and bar of the 103rd, the bill relating to health, House bill 1252, by representative, the 76th, Kendrick of the 93rd, Tom, so the 39th Shannon of the 84th, Canon of the 58th and others, relating to general provisions regarding coroners, House resolution 1621, by representative, of the 94th, Hugoly of the 136th, Hutchinson of the 107th, the cloud of the 105th, Carter of the 92nd, and others, resolution supporting the policy recommendations set forth by the Georgia legislative black caucus regarding election reform. Senate bill 502, by senator Beecher, the 21st, to bill to amend an act reincorporating and recreating the city of Woodstock, to the bill 508, by senator Strickland of the 17th and Anderson of the 43rd, to bill to amend an act creating the state court of Rockdale County. Senate bill 518, by senator Strickland of the 17th, and chosen to the 10th, to bill to authorize the assessment and collection of a technology fee by the magistrate court of Henry County. Senate bill 527, by senator Harveston of the 15th, to bill to authorize the governing authority, the unified government of Sadduck Chattahoochi County, to love you and excise tax. Senate bill 531, by senator Orrick of the 36th, Jordan of the 6th and 8th of the 38th, to bill to provide for a new home study exemption from city of Atlanta, add for the warm taxes. Senate bill 533, by senator Kennedy of the 18th, to bill to amend an act providing a new charter for the city of Fort Valley through second readers. We have no reports of standing committees. We have no local calendar. We do have a motion on the local calendar which we will take up later in the day. We will now have morning orders. Morning orders, chair. And it's going to ask the members to please take your seats. Let's maintain decorum and respect to the members in the well. Now, here's the deal. 10 minutes total for morning orders. And 12 people have signed up. So we're not going to get there everybody today and we're going to do the best we can. But members that are recognized will keep that in mind. The chair recognizes the will of the majority caucus representative Kelly for a morning order. Thank you, Mr. Speaker. These are unprecedented times that have placed unprecedented strains on our budget, on our businesses, on our families. And I think on each and every one of us personally, this place is a tough place to be in good times. It's easy to lose our emotions when we're finding over issues that are important to us. It's even more difficult in times like these. Somebody told me in my wife when we were engaged and looking to get married, a key to good marriages, loving each other when you don't feel like liking each other. I think that's true to being a good house member too. I also know that sometimes I don't do the best job showing that. I'm going to make a commitment to this house because I care about it. I care about what we do here. The members of my caucus and to the minority party. That is we finish up this session. You have a commitment from me. For us to not let our temporary differences, on issues we're going to have disagreements, overshadow the great things that I think we've already accomplished for Jordans and things we still have left accomplished for them. Mr. Speaker, I love this house and I love every member in it and I will yield the way. Chair recognizes the Dean of the House. Dean Smirrey for a morning order. Mr. Speaker, ladies and gentlemen of the house, I just wanted to come and the other day when we passed HB426, you acknowledged myself and others and the chair of the administration and I thank you for your support on HB426. I have an old saying that if you ever see a turtle sitting on a fence post, you know that he or she didn't get that by himself. Somebody helped put them there. I just wanted to acknowledge a couple of people because in all earnest, well chair of the administration and I worked together, there were others that assisted in this process and I feel the need to share that. I just want to thank two of my colleagues from the minority party. I'll call the Jordan and Chairman of the legislative black caucus, Karen Bennett. I'm proud to come back this session if you would give them a round of applause. I'm proud to come back to the legislative session. I asked Karen Bennett to hold some Zoom calls and the representor Bennett did and we talked and discussed HB426 and was able to assist in this process. The night of the vote, I just slept well and I felt a sense of pride to be a Georgian. I felt a sense of pride in this house that I've served in for 46 years and it's a testament to when we want to do so, what is right that we have the will to do so. I just wanted to make that acknowledgement and it's a great state. The day was a defining moment in the state of Georgia and I think it gave us one of our finest hours. So please thank you all again and I thank the chairman and I thank all of those, all the y'all who voted yes, all of those who changed their mind. Just in its entirety, it was just a good day for the state of Georgia. I just want to make that acknowledgement and say thank you to all of you all and God's pleading this have a great day to day. Thank you Mr. Speaker. Chair recognizes Chairman Stevens for a morning order. Oh, I'm sorry. Chair recognizes representative Al Williams for a morning order. I get him confused sometimes. I'm going to speak to the chairman. Take it to speaker. I understand it. That's real easy to do. We look so much alike. But listen, it's with a heavy heart and I've asked Representative Stevens to be so kind and to join me since this person met so much to both of us. But with a heavy heart, I come to really memorialize the passing of former chairman of the county commission in Liberty County and long time civic and community leader, M.L. Coffa, from a little community in Liberty County called Fleming. And there's so many things you can say about him but time will not permit it. I would like to share with the family before just a few brief remarks that I'd like to share this with the family. I've always gotten strength from this scripture. It's Psalms 116, 15 that said, blessed in the sight of the Lord is the death of one of the people. And M.L. Coffa was the death of one of his saints. And M.L. Coffa was that. He met so much to my county and his evolving years and 16 years as chairman, he met a lot. He set the course that we're on now for the progress we enjoy. We went from a sleepy back with county to county of 70,000 that has a lot to be proud of. M.L. served on many boards. He was chairman of the development authority. And I played a very small role in getting a role named for him in our development park on the east end of Liberty County. But I can't thank my friend colleague and delegation member of North chairman Stevens for standing because Mr. Coffa actually lived in his district. So many times he did things that were so out of your ordinary as a young black kid growing up in Liberty County. And sometimes difficult circumstances. M.L. Coffa never ever treated me or anybody I know with anything less than respect. He was a man of great character when you can be good to people when it's not required. You don't have to. Then you're truly somebody. That was who M.L. Coffa was. And I, my heart goes out to his two daughters, Angie and Amy and to their husbands, David and Commissioner Pat Bowen. You have our prayers.\n\nAnd thank you members of legislature for showing the thunders to ML over this morning. And if we could, let's share just a few moments of silence. Amen. Chair recognizes Chairman Don Hogan for a morning order. Thank you, Mr. Speaker. This is an update on the removal of the golden ray from the, runs the carber. The golden ray of 600 and 60 foot 72,000 ton auto transport was went down on September the eighth. It was built in South Korea with a maximum of 7,700 cars. And it capsized with 4,200 cars. And as you already aware, the entire crew was saved thanks to the Coast Guard, runs the Harbor Poly, Jonathan Tennant, Georgia Port Authority, the Georgia Department of Natural Resources, the Glen County Government and many other local and international, international responders. In the past four days of vessel VP 10,000 has departed Louisiana for its voice to Bronvik to execute its delicate salvage operations to remove the golden ray from the harbor. For months, hundreds of experts have been preparing the golden ray to be cut into eight separate sections and are removed independently. Each of the eight sections weighs between 2,770 and 4,100 tons. And it will be lifted onto barges of by the VP 10,000 and removed for salvage. The cutting action for each section will take 24 hours to continue. It is anticipated the operation will be complete by the end of this calendar year. If you happen to be in the golden hours this summer, it won't be difficult to see the operation because VP 10,000 crane performing the removal will be 80 feet taller than the highest part of the roadway on the city and near bridge. Thank you, Mr. Speaker. I yield the whale. Chair, we have 30 seconds left. Representative Kennedy. Tomorrow. Okay. Anybody can get theirs in in 18 seconds. Okay. We'll carry over till tomorrow. All right. We're going on now to the rules calendar. Going on to the rules calendar. Clerk will read the caption to Senate Bill 211. Senate Bill 211, my senator Harper, the 7th Wilkinson, the 50th black of the 8th Anderson, the 24th Walker, the 20th and others to be entitled to enact to amend Article 4, Chapter 2, Title 26, the fiscal to Georgia and the senator relating to advertisement and sale of meat generally, so as to render unlawful the representation of non animal products. This bill I refer to the Committee on Agriculture and Consumer Affairs. That committee recommends that this bill do pass by Committee substitute. The chair recognizes the very distinguished chair of the House Agriculture and Consumer Affairs Committee, Chairman Tom McCall. Thank you, Mr. Speaker, for letting us do the S and favor the thing else you've done for Ag over the years. Senate Bill 211 is simply a bill to make sure that consumers know what they are getting when they purchase their food products. We fortunate in this state and this country to have the food supply that we do very inexpensively offered to us and the choices that we have for explain the bill on a tell you a little bit. When this thing first came over here and the opposing sides wouldn't hardly even talk to each other. I was scared to let them in my office because I didn't want to fight breaking out. But I want to thank the cattleman, the Georgia food industry, the impossible birth of people, Georgia Farm Bureau, or Agribinist Council, and Pulture Federation for all sitting down down in 228 like we all are supposed to do. And coming to an agreement on how to handle food labeling so people will know what they're getting. We are not trying to restrict any choice. In fact, they did a survey a while back. And some people that go to the grocery store have anxiety over the fact that they have so many choices of the food that we provide till they don't know which one to pick. And several years ago, I used to do a little talk and I forgot in all the numbers. But if you go to the sandwich meat part of the grocery store, there's somewhere around 140 something different choices of different kind of means, different sizes, different packaging, this available to you to buy. There's 60 something different kinds of green bean choices as far as cuts, kind taste, side of canned, side of the frozen or versus the canned stuff. So what I'm trying to tell you is we have this many choices and we're fortunate in this country to have that many choices. And this bill absolutely does not try to restrict any of those choices. All it does is make sure that when people buy a meat product that they know they are getting a meat product from an animal or a meat product that may have been made from a plant. And it's kind of hard for the chairman of agriculture to stand up in and I'm not picking one against the other because whatever you put in your mouth comes off a farm. Whether it is a plant based hamburger or a cow based hamburger, it all comes off of a farm and we pretty much grow them all in Georgia. We grow everything from apple to zoo kins in this state. So I don't want you to think that we are trying to pit one ag industry against the other. The some of the grass fed burgers is probably around 20 different ingredients that it takes to make them taste like a beach. There's only one ingredient in a beef hamburger and that's a cow. And it's the same with pork and chicken and we just want to make sure consumers are getting what they pay for. There's also on the horizon a petri dish grown meat product. Folks want to eat something coming out of petri dish, more power to them. We just want it labeled that it was grown in a petri dish. Now I remember biology class back when I was at eight back and what looked like was in a petri dish and you just don't want to eat it. But if you want to eat it that's fine. Tom not going to eat something came out of petri dish. But to finish up and if you read up on the line language all the saying that whenever a product hits a shelf it has to be labeled what it is. But to give an example of why somebody needs to know what they are getting say it's fried late Friday afternoon in Douglas Georgia and representative LaRiccia is enjoying his smoothie made out of pal meta bears. And he's wanting to grill a hamburger and his wife went to the grocery store that afternoon and all the grocery stores are closed and she accidentally because it wasn't labeled right came home with a plant-based hamburger. I'm guessing no one representative of LaRiccia that that plant-based hamburger might spoil the whole move of what the pal meta bears smoothed it doing. So I would appreciate all of y'all voting for half-me-off to 11. Thank you. You have some questions if you care to yield. I'll take a couple sir. Chair recognizes chairman Stevens to your left for a question. Thank you Mr. Chairman. Yes sir. I am looking all over this rules calendar now. I don't see you on here again. Is this because this possibly be your last time in the well? Well you know I told somebody this morning I don't like coming down here but I will for important measures and I think this is one and probably yes yes sir. Can I follow up with one more? Yes sir? I know it's not a further call but I just think you deserve a round of applause but what you love for our heavy sagen... By the way, this is not your last time in the well. Just. Y'all don't get me where I can't tell, but thank you. Does that mean you don't want any more questions? I'll try. Okay. Chair recognizes representative Lerickia to your left for a question. Thank you, Mr. Speaker. My friend in the well of you. Yes, sir. I guess I need to now, right? I just have to go on the record saying this not so much a question as a comment, but I want everyone to know that it will take much more than a plant-based further mislabel for me to lose the mood. I think he's going to brag in a little bit now. Chair, you know for another one? It's up to you. One more. Chair recognizes representative Bentley to your left for a question. Thank you, Mr. Speaker. Does it mean you? Yes, ma'am. And I hope things are going good for you. Is it not true that I have thoroughly enjoyed working on the agriculture committee as you as the chair for the past eight years? I hope so. Is it not further true that I cannot let you leave the well without asking you how's house field Senate field 211 going to fake the fuel industry? Well, if folks buy something that's not labeled right, it will improve the funeral business. Mr. Baker, I'm going to give you a well after everybody's vote. Yes, thank you, sir. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is not in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is not in the report of the committee. Is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 211, or vote aye, those opposed to vote no, and the clerk will unlock the machines and call the roll? Senator Alexander Onolaweitz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Debsi, Dickie, Dollar, Drenner, Dubnic, Neftaration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathiac, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Marvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Beesmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Vincent, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Morbby, Morris C, Morris M, Nelson, when Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Steven's M, Stevenson, Thomas A.M., Turner, Wilensky, Wilkerson, Williams M.F., Williams N, Wilson, Beasley T, Yes, F prolonger, Fuckner, Borchette, Colwell, Campbell, Cantreul, Dickerson, back Yes, dooks dooks Gamble Gileared Yes, Gordon yes, Green Yes, Gullet Yes, Jones JB Yes, Kirby Lot Mathis Yes, Mopthon Yes, Park Yes, Pruitt Yes, Rogers Singleton Yes, Stovall Yes, Williams R Yes, Bar Yes, Bar Clark J Clark J Davis Dress Dress Dukes Duse Frazier Howard Jones T Jones V Kelly Kirby Kirby Lopez Romero The Claim Newton Welch Williams A Williams A Williams MF Williams Williams Williams Williams Williams Williams Members will look at the board and make sure that it is accurate. Clark Clark Clark will lock the machines on the passage of Senate Bill 211. The eyes are 156. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clark will read the caption to Senate Bill 341. Senate Bill 341 by Senator Robertson of the 29th, Dougan of the 30th Miller of the 49th, Guch of the 51st, kind of the 18th and others. Being titled an act to amend chapter 8 of Title 35, the official go to Georgia, annotated, relating to employment and training of peace officers. So it's time to provide for re-employment of retired peace officers. This bill I've been referred to, the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. Chair recognizes representative Berchett to present the bill. Thank you, Mr. Speaker. Good morning, colleagues. Today I present to you Senate Bill 341. And this is a very practical bill, and it pertains to some of the events we've researched. Some of the events we've recently had, what this bill will allow is law enforcement agencies within the state of Georgia to supplement their workforce with retired correctional officers and police that have maintained their post certification during a time declared emergency such as we have now. That's the essence of the bill. It gives them a supplemental workforce that is still maintaining the post certification. And I'm asking that you favorably consider this bill, passed unanimously in the Senate 54 to nothing. I think this is good policy for the state, and I'd appreciate your favorable consideration. You did not appear to have any questions. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. The Chair here is none. The Chair here is none. The Chair here is none. Alexander Aneloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harrell, Catchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M. Jasperce, Jones J. Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G. Newton, Nick's, Allerer, Parish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stephens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Bayesmore, Bernal, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Hollin, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McClan, McLaren, McLeod, Meeks, Mitchell, More B, More C, Morris M, Nelson, Hwynn, Paris, Prince, Pullin, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley Teague, Bonner, Yes, Buckner, Yes, Verchette, Call Well, Dickerson, Dukes, Campbell, Gillier, Gillier, Yes, Green, Goat, Jones J, B, Kirby, Lot, Mathis, Meets, Momp-Dah-Hon, Park, Pruitt, Rogers, Singleton, Stoweball, Williams R, Annulloets, Beasley Teague, Campbell, Williams, Cantrell, Yes, Clark J, Drenner, Dubnik, England, Howard, Jones S, Jones B, Kelly, Kirby, Lot, McLeod, Oliver, Paris, Smith M, St, Welch, Wilkerson, What purpose does representative cannon rise?\n\nNot true that my concern with this bill is that during a state of emergency, this could bring retired peace officers who have outdated training and qualifications. Well, if the lady reads the bill that way, I'm sure that that's the way she understands it. I don't know that the chairman of that committee would allow such a bill out of that panel. Further inquiry? State your inquiry. Is it not true that if the post certification requirements are fulfilled that they would be able to be brought back in the forest, but that does not necessarily include the most up to date 21st century policing training? I'm sure the lady believes that to be true. All right, Mr. Clark, members will check the board. Clerk will lock the machines. On the passage of Senate Bill 341, the eyes are 145, the nays are seven. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 413. Senate Bill 413 by Senator Martin of the 9th Cropatric of 32nd, on Zell of the 27th and Alvers of the 56th. Being titled an act to amend Chapter 67A in Title 36, the fiscal to Georgia annotated relating to conflicts of interest and zoning actions. This bill I'm referred to the Committee on Government Affairs. That committee recommends that this bill do pass by rules committee substitute. Chair recognizes Chairman Andy Welch to present the bill. Thank you, Mr. Speaker. Members of the House, with the permission of the senator, we have removed his language concerning the conflicts of interest, but we have dealt with the issue that is a great concern across the state for local governments that deal with zoning hearings and any other hearings including their own budgetary hearings. As we all passed the Senate resolution yesterday to allow for teleconferencing or remote sessions for the General Assembly, if the voters of the state approve it, this measure would also allow and make sure it's clear that public hearings can be conducted by teleconference during an emergency for local governments, agencies of the state, and the committees thereof. This language has been vetted through the committee process in the House and has also been reviewed by members of the press in terms of their concerns, and we think we've reached some language that would be beneficial to the local governments of our state. With that, I'll take any questions that the members may have. You do not appear to have any questions. Thank you, Mr. Speaker. With that, ask for your favorable consideration of the Rules Committee Substitute on SB 413. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The Chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee own rules? The Chair here is none. The Rules Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye, those opposed will vote no, and the clerk will unlock the machines and call the roll. Alexander, in all of its bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Efstrace, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasperus, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Steven's R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holley, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClan, McLaren, McLeod, Meeks, Mitchell, Morbby, Morris C, Morris M, Nelson, Hwen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wilensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Bonner, Buckner, Richette, Yes, Callwell, Campbell, Cantrell, Dickerson, Dukes, Yes, Campbell, Gillier, Gordon, Yes, Green, Yes, Call it, Jones J, B, Kirby, Lot, Yes, Mathis, Yes, Meets, M, M, M, M, M, M, M, Park, Prew it, Rogers, Singleton, Stoog, Yes, Williams R, Blackman, Richette, Clark J, Cook, Dollar, Drenner, Dreyer, Dugnic, Earhart, England, Jackson D, Kendrick, Kirby, McLane, Park, Parsons, Powell, Ridley, Stevens R, Tancersley, Members will look at the board and make sure that it is accurate, and the clerk will now lock the machines on the passage of Senate Bill 413. The eyes are 158th and the eyes are zero. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes Chairman Knight for a motion. Thank you, Mr. Speaker. I'd like to make a motion that the House agree to the Senate substitute the House Bill 946. Chairman Knight has moved that this House agree to the Senate substitute the House Bill 946. The clerk will read the caption. HB946 to be entitled back to amend chapter 64, Title 33, the fiscal to Georgia annotated relating the regulation and licensure of pharmacy benefit managers. Chair recognizes Chairman Knight to explain his motion. Thank you, Mr. Speaker. Just a few days ago, I got it before you, and we passed out the House Bill, the House substitute the Senate Bill 313. And if you remember, I told you that there were two versions that were coming together to be identical bills. So the version that we sent over there, 313, which by the way was adopted and passed by the Senate, I think yesterday or two days ago, this is our bill that they amended that makes the two identical bills. I can't tell you enough how much I want to thank you, this House and the legislature for the stand that you have taken as we have addressed the problems. And I think some of the problems at the heart of the health care crisis, this nation in this state face, and how significant it is that the House and Senate have identical bills that make a huge, huge statement as to where we stand in regards to patient outcomes, and more so, the middleman that are putting profit above the health care of our citizens. Again, this bill, as you see it, is the exact bill that we passed the other day, Senate Bill 313. I would ask for your favorable consideration on this. Let's continue to work at this. I think this is one of the most important things that the state has done and can continue to do. Mr. Speaker, are there any questions I'll stand for them if not. I'll ask for this body again. There are unanimous support for this measure. You do not appear to have any questions. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 946, all those in favourable vote aye, those opposed to vote no, and the clerk will unlock the machines. Alexander Anolaowitz Bar Barton, Belton Bennett, Bentley Benton, Beverly Blackman, Bodey Bruce, Burns Carpenter, Carson, Chocus, Clark H. Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, L. A. L. Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Gravity, Harrel, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M. Jasperus, Jones J. Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, McCall, Morris G. Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Erhard, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Hollen, Holley, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClean, McLaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, when Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams Mf, Williams N, Wilson, Beasley T, Yes, Bonner, Yes, Fuffner, Yes, Farchette, Yes, Calwell, Yes, Campbell, Yes, Cantrell, Dickerson, Dookes, Dookes, Campbell, Gillier, Yes, Gordon, Green, Yes, Gullet, Yes, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Metz, M, M, M, Tahan, Park, Yes, Yes, Rogers, Singleton, Stoke Hall, Yes, Williams R, Yes, Dickerson, Yes, Yes, Drenner, Dukes, Yes, Duna Hoo, Gilligan, Gordon, Yes, Yes, M, Tahan, Paris, Scott, Sharper, Turner, Williams A, Williams A, Des 기bert, 데 Young Mill, Yes, Anderson, Yes, Anderson, Flav king, with under the rights ofgas. This is the bill that forms the health care transparency and accountability oversight committee The Senate had to amiable amendments to the bill and With that I would like to ask for your favor consideration and we'll answer any questions I do not see any questions. Thank you for your federal consideration On the gentleman's motion that this House agreed to the Senate's substitute to House Bill 991 All those in favor of the motion will vote aye those opposed to vote no and the clerk will unlock the machines Alexander on all of which bar Barton Belton Bennett Bentley Benton Beverly blackman Vody Bruce Burns Carpenter Carson Chokus Clark H. Collins Cooper Corbett Dempsey Dickey dollar Drenner Dubnic Eftration England Irwin Fleming fry games Gardiner Clanton Grabley Harrell Hatchet Hawkins Hitchens Holkham Holmes Hausten Hugley Jackson M. Jasperson Jones J. Kelly Kendrick Knight LaHood Larickia Lomston Martin Mathiac McCall Morris G. Newton Nix Oliver Parsons Petrie Perkle Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox Smith L Smith R Smith V Smirie Stevens R Tancersley Tanner Tarvan Taylor Thomas E Tramble Washburn Watson Welch Workhizer Weed Hour Williams A Williamson Yerda Allen Bayesmore Vernal Cannon Carter Clark D Clark J Cook Davis Douglas Dreyer Dunahue Earhart Evans Frazier Gilligan Gertler Tenson Hill Hogan Holland Holly Hobson Howard Hutchinson Jackson D Jones S Jones T Jones V Couch Kennard Lopez Romero Marin McClean McLaren McLeod Meeks Mitchell Morby Morris C Morris M Nelson When Paris Prince Pullen Robeshoe Saints Scofield Scott Shannon Sharper Smith M Thomas A.M Turner Wollensky Wilkerson Williams MF Williams N Wilson Beasley T B-C-T Yes Bonner Yes Fakner Yes Farchette Yes Farchette Calwell Calwell Yes Campbell Yes Cantrell Yes Kendra Dickerson Dickerson Duke's Duke's Yes Campbell Yes Gillier Gillier Yes Gordon Yes Green Green Yes Goat Yes Goat Jones J.B Jones J.B Kirby Yes Lot Mathis Mathis Metz Yes Mopthahan Mopthahan Park R Yes Pruitt Yes Rogers Yes Rage Singleton Singleton Yes Stoweball Yes Stoweball Yes Williams R Williams R Yes Vaysmore Yes Vaysmore Bennett Carter Hard Dempsey Dickerson Dickerson Duke's Drenner Drenner Earhart Earhart Holland Haward Haward Jones V Jones V Kelly Ken Kenner Ken Lopez Romero Lopez Mathis Mathis Yes Mopthahan Mopthahan Ridley Rogers Ross Skofield Yes Smith M Smith M Tarmann Thomas E Wilkerson Wilson\n\nyou you you you you you you you you you you you you you you you you you you you you you you you Williams N. Wilson, Beasley Teeve. Yes. Bonner. Yes. Fah. Yes. Fuckner. Yes. Fah. Yes. Varchette. Varchette. Carl Well. Yes. Campbell. Yes. Yes. Cantrell. Yes. Can you try? Yes. Dickerson. Yes. Duke. Duke's. Duke's. Yes. Campbell. Yes. Gillier. Gillier. Gillier. Yes. Gordon. Yes. Gordner. Green. Green. Yes. Gullet. Yes. Gull. Jones J.B. Jones J.B. Yes. Kirby. Yes. Lot. Yes. Lot. Yes. Mathis. Yes. Mathis. Metz. Metz. Mophtahan. Mophtahan. Park. Park. Park. Park. Park. Yes. Through it. Yes. Through it. Yes. Rogers. Yes. Singleton. Yes. Stovall. Yes. Williams R. Williams R. Yes. Cannon. Cook. Dickerson. Dixon. Drenner. Dreyer. England. Gaines. Gorgies. Hatchett. Hopson. Kendrick. Kenner. Mathis. Mophtahan. Yes. Pullin. Reaves. Scofield. Scofield. Yes. Kenner. Mathis. Mophtahan. Yes. Pullin. Pullin. Reaves. Scofield. Scofield. Scofield. Yes. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Thomas E. Members, we'll check the board and make sure it's accurate. Clerk will lock the machines on the gentleman's motion. The eyes are 157. The nasors zero. This house has agreed to the Senate substitute to House Bill 781. Chair recognizes Representative Birchett for a motion. Thank you, Mr. Speaker. I motion that this house agreed to the Senate substitute for House Bill 897. Representative Birchett has moved that this house agreed to the Senate substitute to House Bill 897. Clerk will read the caption. House Bill 897 to be titled an act to amend Code Section 12624. The fiscal to Georgia annotated relating the notice of timber harvesting operations. So it was required the State Forestry Commission to create a standing timber notification website. The chair recognizes Representative Birchett to explain his motion. Thank you, Mr. Speaker. Thank you members. Earlier this year, we passed House Bill 897 out of here. And what this bill did was create a website for timber harvesters to notice the counties in which they're harvesting in. The simple change that was made to this bill in the Senate was the effective date was changed from July 1st to October 1st of 2020. Simply because that the likelihood now that if it was signed by the governor, it would most likely be signed after July 1st and it would bridge our prohibition on retroactive laws. So that is the only change it was made to this bill. And I appreciate again your favorable consideration for this bill. And I will yield for questions if there are any and if not, I'll yield the will. You don't appear to have any questions. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 897, all those in favor will vote aye. Those opposed to vote no and the clerk will unlock the machines and call the roll. Alexander Manoloids, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H. Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveling, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parish, Parsons, Peter, Peatree, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stephens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holley, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClellan, McLaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Gwen, Paris, Prince, Poland, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, B, C, T, Yes, Bonner, Yes, Fuckner, Yes, Barchett, Calwell, Campbell, Yes, Cantrell, Dickerson, Yes, Dukes, Dukes, Campbell, Yes, Gillier, Gillier, Yes, Gordner, Gordner, Green, Yes, Gullet, Jones J, B, Jones J, B, Kirby, Yes, Mathis, Yes, Mets, Momp-Tahan, Park, Pruitt, Yes, Singleton, Stovall, Yes, Singleton, No, Stovall, Yes, Williams R, Bennett, Carpenter, Cooper, Drenner, Duna-Hoo, England, Fleming, Gordon, Yes, Holmes, Momp-Tahan, When, Scofield, Yes, Washburn, Members will check the board and make sure it's accurate. Clerk will lock the machine on the motion that this house agreed to the Senate substitute house bill 897, the eyes are 161, the nays are 1, and this house has agreed to the Senate substitute to house bill 897. Chair recognizes a representative percol for a motion. I'm sorry. I had one other item I needed to do before I recognized you. What purpose does Chairman Parsons rise? Speaker, I rise to make a motion. State your motion. I move that Senate bill 464 be moved from the House Judiciary Committee to the Energy Utilities and Telecreas Paces Committee. Both Chairman agreed. Chairman Parsons has moved that Senate bill 464 be withdrawn from the Judiciary Committee and committed to the Energy Utilities and Telecommunications Committee to the Clerk will read the caption. Senate bill 464 by Senator Kennedy, 18th to the 30th, Gouge, 51st Jones, 25th and Moles, 53rd to be entitled to amend Title IX of the Fish School to Georgia, annotated relating the civil practice those to provide for uniform laws governing mediation and participants in the Senate. On the gentleman's motion, that Senate bill 464 be withdrawn from the Judiciary Committee and committed to the Energy Utilities and Telecommunications Committee is their objection. Is their objection? The Chair here is not and it is so ordered. Now Chair recognizes representative percol for a motion. Thank you Mr. Speaker. I would request that this House accept the Senate substitute to HR 1300. Representative percol has moved that this House agreed to the Senate substitute to House Resolution 1300. Clerk will read the caption. House Resolution 1300 authorizing the change of use of certain property located in Glen County currently dedicated as a heritage preserve. Chair recognizes representative percol to explain his motion. Underlying bill as it came to you, we passed 164 to 1. This actually changed the designated use of a property so that we can widen the road and replace the bridge. The Senate made a friendly substitute to this to rename a State Park in Reed's Hill, the Jack Hill State Park. That's the bill. You do not appear to have any questions. On the gentleman's motion at this House agreed to the Senate substitute to House Resolution 1300. All those in favourable vote aye. Those opposed to vote no and the clerk will unlock the machines and call the roll. Alexander Lenello, it's Bar Barton, Belton, Bennett, Bentley, Abenton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Paris, Parsons, Petrie, Perkel, Powell, Reeves, Rose, Rich, Ridley, Rutledge, Scoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Alan, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Hollen, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClauren, McLean, Meeks, Mitchell, Vorby, Morris C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, Robo Show, Saints, Scofil, Scott, Shannon, Sharper, Smith M, Thomas A, Turner, Wolensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Yes, Connor, Buckner, Yes, Richette, Calwell, Campbell, Yes, Saint-Trell, Dickerson, Duke,\n\nYes. Gamble. Gilear. Gilear. Yes. Gordon. Yes. Green. Yes. Gullet. Jones, JB. Jones, JB. Yes. Kirby. Yes. Lot. Mathis. Yes. Metz. Metz. Mopthahan. Mopthahan. Park. Park. Pruitt. Yes. Pruitt. Yes. Rogers. Yes. Rogers. Singleton. Singleton. Yes. Stovall. Yes. Williams R. Williams R. Bennett. Beverly. Blackman. Cannon. Cantal. Carter. Cook. Cooper. Davis. Dunahueus. Frazier. Howard. Jackson M. Jones V. Kelly. Kendrick. Kenner. Lopez Romero. Lot. Meeks. Pullenbees. Rogers. Schofield. Thomas E. Thomas E. Watson. Members will look at the board and make sure it's correct. Representative Schofield. Schofield. Any others? Paris. Any others? Clark will lock the machines. On the adoption of the resolution, the eyes are 159. The nasor zero, this house has agreed to the Senate substitute to house resolution 1300. Chair recognizes Dean Smiley for a motion. I must speak, I move that the house received from this position on Senate bill 20. Dean Smiley has moved that this house received from its position on Senate bill 20. The clerk will read the caption. Senate bill 20 to be entitled to amend chapter 60, 306. The fiscal to George annotated relating the general provisions relative to provisions. The applicable counties and municipal corporations chose to provide for the establishment of banking improvement zones. Chair recognizes Dean Smiley to explain his motion. I must speak in removing us from sending from our position. What we did earlier on, we passed, we were considering the establishment of banking empowerment zones to encourage of banking in unbanked communities of our state. What we did, we as a body, we amended it on a bill dealing with fertilizer and lime materials and soil amendments. I spoke with the members of the agriculture committee and the chairman. That issue has been taken care of. At this time, I'm back at the house to receive from our position and go back to the original bill which is established as a banking improvement zones for the bank for the uninservate areas of our state. I do not think you have any questions. Thank you, Mr. Speaker. You're the well. On the gentleman's motion at this house received from its position on Senate bill 20. All those in favourable vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Lallowitz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubneck, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Grabley, Herald, Hatchett, Hawkins, Hitchens, Holcomb, Holms, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nix, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens, Tancerslead, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, for now, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Coush, Kennard, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, Morec, Morris M, Nelson, Hwenn, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wilensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Connor, Yes, Fuckner, Yes, Furchette, Call Well, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Dukes, Yes, Campbell, Gilliard, Yes, Gordon, Yes, Green, Yes, Gullet, Yes, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Meets, Mop Tahan, Park, Yes, Yes, Yes, Rogers, Singleton, Yes, Stowe Ball, Yes, Williams R, Yes, Bar, Bowdie, Dicky, Dullard, Dupnic, England, Hitchens, Hollen, Hopson, Jones J, Kelly, Mop Tahan, Newton, Perkle, Powell, Rogers, Scofield, Yes, Steven's R, Steven's R, Tarvin, Turner, Members will check the board and make sure it is correct. Clerk will lock the machines on the motion that this house received from its position. And on Senate Bill 20, the eyes are 159. The Nays are zero. This house has receded. Chair recognizes, Chairman Parsons for an announcement. Thank you, Speaker. One of the members of the House Energy Utilities and Telecommunications Committee know that we are going to have to have a quick meeting this afternoon. I am not sure exactly what the schedule is going to be, but I have a meeting scheduled for two o'clock. It is going to be in the LOB. It should be quick. And we will text you. I don't have a room number. We will text and let you know the room number. We plan on two o'clock. Thanks, Speaker. Chair recognizes, Chairman Beverly for an announcement. The Georgia House Democratic Caucus will meet at 130 via Zoom, same meet night D and password. 130, so that gives you time to eat, depending on what time we come back and speak. Thank you. Chair recognizes, Chairman Hatchett for an announcement. Thank you, Mr. Speaker. The House Republican majority caucus will meet momentarily in the Floyd Room, 20th floor West Tower of the Twin Towers, lunch will be served. This House will be in recess to 2 o'clock PM.",
  "updated_at": "2026-02-13T23:27:40.737917+00:00"
}