{
  "video_id": "SGxs6K0tPg8",
  "url": "https://www.youtube.com/watch?v=SGxs6K0tPg8",
  "title": "Sen. Donzella James' Press Conference on Midwife Support | 02/21/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Here is a structured markdown summary of the Georgia Senate session transcript:\n\n### Overview\nSen. Donzella James held a press conference to highlight the importance of midwifery in Georgia and advocate for greater recognition and access to midwife services. She emphasized the role of midwives in addressing racial disparities in maternal health and providing cost-effective, community-based care.\n\n### Key Actions\nNo specific bills were mentioned in the transcript.\n\n### Bills Introduced (First Reading)\nNo new bills were introduced.\n\n### Notable Moments\n- Sen. James spoke about her family history of midwifery and the biblical significance of midwives.\n- She called for Georgia to follow other states in facilitating easier pathways for midwives to practice.\n- Sen. James indicated that she would be presenting 2024 midwife-related legislation on the Senate floor.\n\n### Votes\nNo recorded votes were mentioned.\n\n### Attendance\nThe transcript does not provide any details about quorum or attendance.\n\n### Adjournment\nThe transcript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "Good morning. Yes, community midwives are here. Right here in Georgia. They're\nwell trained community midwives practicing their ancient craft. Midwifeery is a\nproven model of care for safety and needs to be more accessible in Georgia. So I\nSo I say hello and good morning to you all.\nI extend my gratitude to my friends, family, colleagues,\nconstituents, and everyone gathered here today.\nEven in the spirit world, my grandmother was a midwife.\nAnd my great grandmother were both midwives.\nSo I'm proud and honored to stand here with our modern day\nmidwives and I want to shed life light on the valuable role of midwives and\nthe pressing need to recognize their significance in our healthcare system.\nYes, midwives are compassionate caregivers, advocates for health care,\nguardians for mothers and newborns and pillars of support during one of\nmost beautiful journeys. To do this, they undergo rigorous training, often spending three to five years.\nThey are equipped to handle countless emergencies during childbirth, offering care,\nthat prioritizes maternal well-being and safety.\nThis is crucial in addressing racial disparities\nin maternal health, where black women face\nalarming rates of complications and mortality,\nsuppressing even some nations in the world,\nStudies show that midwifery led care results in lower rates of interventions like sea sections\nand infant mortality, offering a cost-effective alternative to hospital-based care.\nHistorically, communities rely on midwife expertise, particularly among black and immigrant\npopulations. However, the shift towards hospital-based care in the 20th century led\na decline in the number of midwives from 43,000 in the 1980s to around 14,000 today.\nWe need more, not less, so in 2015 Georgia granted the board of nursing, the authority\nto regulate mid-wifery practices, mandating a nursing license for mid-wifes.\nThis decision mirrored across the southeast, limited the scope of mid-wifery, and hindered\naccess to care for many communities leading to less than 200 midwives in Georgia today.\nHowever, 40 states, including recent additions like Mississippi and Alabama, have moved\naway from such restrictive measures, recognizing the unique expertise of midwives beyond nursing\nqualifications. Revitalizing midwifery not only addresses health care disparities, but\nalso alleviates shortage shortages in rural areas. Now midwifery education is more accessible\nand cost effective than traditional nursing programs offering a sustainable solution\nto workforce shortages.\nYes, it is time for Georgia to follow the lead of other states\nand facilitate easier pathways for midwives\nto provide the expert care that they are trained for.\nAs the Bible speaks to us about the importance of midwives,\nand their immense value in the childbirth process\nIn the book of Psalms, chapter 22, verse 11, it says,\ndo not be far from me, for trouble is near.\nAnd there is no one to help.\nIt's true, we would be lost without the help\nof so many Georgia midwives, right?\nYes.\nSo once again, thank you all\nSo being here today during this very special occasion, we thank you and may God bless you all.\nWe are presenting a 2024 legislation on the floor today of the Senate.\nSo I look forward to seeing you up in the chamber and remember in room 125 and room 125 there's\nfood.\nYou know, that's always a good thing, right?\nSo come and share with us and partake in the vitals this morning.\nWe thank you.\nWe thank you.\nAre there any questions?\nAny questions?\nNo questions?\nThat means you're doing an awesome,\nan honor to point it and accept the job.\nThank you for the midwives who judge everyone.\nMidwives, thank you very much.\nSo who wants to come and say something?\nAs I go upstairs, thank you.\nThank you.\nThank you so much.\nThank you.\nThank you, thank you so much.\nLet the say something.\nWhy don't you come say something?\nand I will yield the mic right now and go back on the Senate floor.\nI'll see you going inside there.\nWho's coming?\nWe're going to go sit in the gallery.\nOkay, go tell them.\nOkay.\nSo Senator James is going to recognize midwives from the Senate floor.\nSo we'll go to the gallery after this.\nBut thank you everyone for coming.\nPlease support Midway Free and support the midwives that are here today.\nwise that are here today will be in 122 after the gallery and after the\nsenators get out of the floor or get off the floor but basically everything\nthat she said I think she she said everything that needed to be said community\nmidwives have been here they're not going away and we need all the support we\ncan get thank you\n",
  "updated_at": "2026-02-12T19:28:58.720154+00:00"
}