{
  "video_id": "ShZRVMcIL0s",
  "url": "https://www.youtube.com/watch?v=ShZRVMcIL0s",
  "title": "Sen. Jackson | Press Conference | 02/07/2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Here is a structured markdown summary of the Georgia Sen. Jackson | Press Conference | 02/07/2024 session:\n\n## Overview\nThe press conference focused on supporting HB 1014, a bill that would prohibit the execution of individuals with intellectual disabilities in Georgia. The bill has bipartisan support and is seen as an important step towards a more just criminal justice system in the state.\n\n## Key Actions\n**HB 1014**: Prohibits the execution of individuals with intellectual disabilities in Georgia.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Senator Kim Jackson, Representative Workhizer, and other co-sponsors of HB 1014 spoke in support of the bill.\n- Faith leaders, including Bishop Ned Slesinger from the Archdiocese of Atlanta, also voiced their support for the legislation.\n- Representatives Deborah Silcox and Matt Reeves, who are co-sponsors of the bill, made brief remarks.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum was present, as evidenced by the number of legislators and faith leaders in attendance.\n\n## Adjournment\nThe press conference concluded, but no information was provided about the next legislative session.",
  "transcript": "So I'd like to introduce Senator Reverend Kim Jackson.\nWell, good afternoon.\nToday we stand to say no to executing people who have intellectual disabilities.\nToday we stand to say we recognize that people who have intellectual disabilities\nare not able to make conscious decisions that should lead to their execution.\nAnd today we stand together as a collective, as clergy, as people of faith,\nand people of simple, good moral character, who are saying no more in this state.\nThe state of Georgia has worked really hard over the years to be a forefront\nand a leader around certain issues within the death penalty.\nBut this is one place where we fall in short.\nWe continue to execute people who simply should not be on death row.\nAnd so today I am proud to work alongside our House Representative Bill Workhouseer on\nthis bill that will change the tide for Georgia and help move us to a more just society.\nA society where we recognize that people who went to special education their entire lives,\nwho we know have been documented as having intellectual disabilities, that we are going\nto be a state that has good moral character and that we will not execute them.\nSo I am grateful to my colleague for sponsoring HB 1014 and I look forward to getting across\nthe chambers to the Senate where we can support it and get it all the way across the finish\nline.\nWith that, I'd like to introduce Representative Workhizer.\nThank you Senator Kim, and thank you for those, all those folks behind me who have traveled\nand come to our capital to advocate.\nAnd has been said, Georgia, there's only 27 states that allow executions.\nAnd Georgia is the only state that has beyond a reasonable doubt for determination of those\nwho are intellectually disabled.\nThe only state, there are also the only state that that determination is made during the\ninnocent guilt phase after the facts of the case have been made, so it's very biased.\nbill fixes both those issues so that we're no longer the outlier in the country.\nAnd so it's a narrowly defined part of our death penalty code and looking forward to\npassing it and thank you for Senator Kim and her work.\nWe'll get it through both chambers and look forward to this becoming law.\nAny questions from the media?\nThe difference in this bill, thank you.\nWe have had bills in the past that have been total repeals of the death penalty.\nThis is not that.\nThis bill narrowly is focused toward those who are truly, intellectually, developmentally\nwould be proven in a court of law\nthat they would pass that standard\nby a preponderance of evidence.\nThat great question.\nThis bill was actually given to me by leadership.\nSo yes.\nSo that's the exciting part.\nI think we've got a good headway.\nThe other seven sponsors on the bill are all attorneys and judges.\nIt's a very bipartisan, half of them are Republicans, half Democrats.\nAnd so I think it's a bipartisan issue that we can all agree on.\nGreat question.\nelse. Well thank y'all for coming and thank you for this group for your\nefforts. I am Kathy Harmon Christian and I am the executive director for\nGeorgians for alternatives to the death penalty and I wanted to mention that\noh wonderful let me just pause that for now and I would love to introduce a\nrepresentative Deborah Silcox who is one of our wonderful co-sponsors for this\nlegislation. Representative Silcox. Thank you so much, Kathy. I so appreciate you. Giving\nme just a brief moment here. I don't want to take much time, but I just want to say that\nI think that House Bill 1014 is the right thing to do. And I know that we still have some\nmore work to do on the bill, but I'm very hopeful that we can give people with intellectual\ndisabilities, a break in the courts, certainly when faced with the death penalty.\nSo thank you for your attention and support of this issue.\nI think it's very important to accomplish justice in Georgia.\nThank you.\nAnd we also want to leave time if any of the other co-sponsors are able to come.\nBut I did want to draw your attention to this one\nAnd we're happy to share that so you can look more into the legislation.\nAnd I wanted to also draw your attention to two of the logos on the piece of paper.\nAnd that's from the New Disabled South.\nWe have the community, disabled community with us on this legislation.\nAnd we also have conservatives concerned about the death penalty with us.\nSo there's a broad consortium of people who are supporting this legislation.\nand now I would like to turn to some of our faith leaders to speak about their\nsupport for this bill. May I introduce? Let's start with Ms. Joya Aaron Thornton\nplease. Thank you Kathy. Good morning everyone. I want to send a special thank\nThank you to Senator Kim Jackson, our sponsors, Representative Workhizer, and also Representative\nStillcawks.\nThank you so much for believing in this bill.\nThis is something we've been trying to do for a very, very long time.\nI am Joya Aaron Thornton.\nI am the Executive Director of the Faith Leaders of Color Coalition or Flock.\nAs one of the national partners on this effort, I can't say thank you enough to our partners\nand also all of the supporters behind me for this bill,\nface leaders matter.\nFaith leaders can move mountains.\nI urge policy leaders to continue to engage faith leaders\nin the participatory policy processes\nthat are needed to make this country\nand this state more equitable.\nThank you, Kathy.\nGood afternoon, I'm Bishop Ned Slesinger for the Archdiocese of Atlanta, and I'm here\ntoday on behalf of my brother, Bishop's in both the Archdiocese of Atlanta and the\ndiocese of Savannah.\nOur clergy and the growing number of Catholic Christians who now number roughly 1.3 million\nin the state of Georgia.\nI want to personally thank Representative at Work Heiser for his work and the other\nGeorgia House co-sponsors with House Bill 1014 for their leadership on this issue.\nAs an auxiliary bishop of Atlanta, I share with you many belief that the dignity of every\nhuman life is never to be played down or under emphasized in the case of someone who has\ndone great evil. No matter how heinous the crime, if society can protect itself without\nending a human life, it should do so. When the state, in our names, and with our tax\ndollars, ends a human life, despite having non-lethal alternatives, it suggests that society\nHe can overcome violence with violence.\nWhen Cain killed Abel, God did not end Cain's life, instead he sent Cain into exile, not\nsparing his life or protecting it by putting a mark on Cain, lest any one should kill him\nat sight.\nCatholics believe in prioritizing the protection of the poor and vulnerable, and those\nThose who are vulnerable in a special way are those who have intellectual disabilities.\nWe see that a person with an intellectual disability in this state faces the threat of execution\nbecause he or she cannot meet the highest standard of proof of their intellectual disability.\nGeorgia was the first state to pass a law intended to prevent the execution of people with\nintellectual disabilities. Sadly, we are now the only state whose laws make it so difficult\nto prove that intellectual disability that no one can meet that burden of proof.\nMy dear brothers and sisters, let us not neglect our role as our brother and sisters keeper\nand advocate with our representatives\nfor that dignity of every person,\nespecially those who have intellectual disabilities\nby showing our constant support\nfor a fast-passing house bill 1014.\nOnce again, thank you,\nRepresentative Workhizer, for your great work,\nand all of you.\nThank you, Bishop Ned, and I would like to now introduce another one of our wonderful\nco-sponsors, Representative Matt Reeves.\nWell, do you want to say anything?\nOkay.\nAll right.\nYeah, yeah.\nCome on.\nI am honored to support this good bill.\nI appreciate Chairman Workhizer, Representative Silcox,\nand the faith community for working hard on this issue\nfor many years.\nIn addition to the moral concerns that were expressed\neloquently, my reason for being involved in this bill\nis there are some US Supreme Court warnings on this issue\nthat we need to clean up here in Georgia.\nSo I'm proud to support this bill to make sure\nthat we fully comply with the US Supreme Court,\nthe highest court in the land.\nThank you.\nAll right, I'm going to try not to be on the other end, I mean, I mean, I mean, it's all the most exciting together.\nHere we go.\nThank you.\nOkay, thank you so much, representatives. We so appreciate you. Now I'd also like to welcome\nReverend John Vaughan, who will also speak in support of this legislation.\nSo the representatives of this bill, thank you. This is the right thing to do, as has been\nsaid, and this is a step in the right direction. I bring you greetings on behalf of the historic\nThese are Baptist Church and our senior pastor, the Reverend Dr. Raphael G. Warnut.\nSo this is a step in the right direction.\nWe're clear where we stand in relationship to the death penalty for, we worship a God\nof second chances and third chances and fourth chances and we believe the transformation\nis possible.\nSo we stand here in support of this as a good next step.\nI want to thank my clergy colleagues and lay leaders\nfor being here and standing up for this important legislation.\nThank you again for your leadership.\nAnd indeed, this is a step in the right direction.\nAmen.\nThank you so much, Pastor Vaughn, and now I'd like to introduce Reverend Carol Maddox.\nI'm Carol Maddox.\nI'm Executive Director of the Georgia Interfaith Public Policy Center and Archdeacon for\nthe Episcopal diocese of Atlanta, I bring greetings on behalf of my bishop, Rob Wright,\nand on behalf of many people of faith and clergy who have stood up to say, one of the most\nimportant gifts God gives us is our lives. I think we all understand that and we all believe\nthat. One of the big responsibilities that come with that gift is the\nresponsibility of taking care of the vulnerable, the children, and the\ndisabled. We don't execute children and we can't execute the disabled\neither. I thank you for all the clergy who have signed the faith leaders\nletter over 150 from across this beautiful state have stood up and said it is wrong to\nexecute the intellectually disabled. Thank you very much and thank you Representative\nWorkhouse for your work and for your leadership.\nAnd now I'd like to introduce Emily Mendoza-Waters from the Catholic Mobilizing Network.\nGood afternoon.\nMy name is Emily Mendoza-Waters and I work at Catholic Mobilizing Network where a national\nCatholic organization to end the death penalty and promote restorative justice.\nI'm so grateful that Georgia was the first state to pass law exempting people with intellectual\ndisabilities from the death penalty. It made a statement that Georgia cared about the\nmost vulnerable people in the community. However, because of the required, higher standard\nof proof beyond a reasonable doubt, we know that most, the most vulnerable people were\nnot protected. Georgia stands alone in the U.S. with this burden of proof.\nAs a person of faith and many of the people behind me are people of faith, we believe that\nevery life is sacred and we have the responsibility to protect the dignity of all people, especially\nthose most vulnerable.\nThe past two weeks, speakers who have been directly impacted by violence traveled all around\nthe state to share their lives with Georgians, many of them are behind here.\nIt is so appropriate that the journey of hope is ending here at the Capitol.\nIt has been a long journey and will continue to be, however, it is filled with the possibility\nof hope and change.\nYou can be a part of this change by ending this injustice.\nYou can be a part of this change by encouraging your leaders to support legislation that will\nprotect the constitutional rights of people with intellectual disabilities.\nYou can be a part of this change by helping to prevent more executions of the most vulnerable\nin the community.\nYou can be a part of this change and give hope.\nThank you so much for your leadership and for all of your work and organization.\nAnd one of my colleagues is here from Tennessee, who's been doing work there on intellectual\ndisabilities and the death penalty.\nRafia, Mohammed, McCormick, welcome.\nThank you very much, Kathy.\nI just want to say that I'm happy to be joining Georgians in this fight to remove intellectual\ndisability as being a precursor and allowing those people to be executed. Tennessee was able to pass\nthis in 2021 and we are happy to see that Georgia is included as well. This is extremely important\nlegislation and we are glad to be here. All right we're going to wind up now and I just want to\nto suggest you're welcome to join us for more lunch here in room 216.\nPlease join us have further conversation and support 10 House Bill 1014.\nThank you so much.\n",
  "updated_at": "2026-02-12T19:32:14.532465+00:00"
}