{
  "video_id": "sjGpfZNfdeg",
  "url": "https://www.youtube.com/watch?v=sjGpfZNfdeg",
  "title": "Sen. Jackson | Equal Opportunity for Women's Sports Press Conference | 02 - 03 - 2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the Georgia Sen. Jackson | Equal Opportunity for Women's Sports Press Conference | 02 - 03 - 2025 session:\n\n## Overview\nThe press conference focused on addressing the inequities faced by girls and women in sports in Georgia, even decades after the enactment of Title IX. The speakers discussed various issues such as unequal treatment, lack of resources and funding, and media attention for girls' sports teams. The main legislative focus was on SB 41, the \"Equal Opportunities in Girl Sports Act\", which aims to address these disparities.\n\n## Key Actions\n- **SB 41**: The \"Equal Opportunities in Girl Sports Act\" introduced to address inequities faced by girls' sports teams in Georgia.\n- **SB 1**: The \"Fair and Safe Athletic Opportunities Act\" introduced by Senate Republicans, seen as a \"bully tactic\" targeting the trans community.\n\n## Bills Introduced (First Reading)\n- SB 41: The \"Equal Opportunities in Girl Sports Act\"\n- SB 1: The \"Fair and Safe Athletic Opportunities Act\"\n\n## Notable Moments\n- Speeches by Sen. Jackson, Rep. Oliver, and a female sports advocate highlighting the ongoing challenges and inequities in girls' and women's sports in Georgia.\n- Calls to address real issues facing girls' sports teams, such as lack of resources, funding, and media coverage, rather than focusing on the \"non-existence of girl trans athletes\".\n- Celebration of progress made, such as the inclusion of women on the Georgia High School Sports Association board, and the addition of fast-pitch softball to the high school sports system.\n\n## Votes\nNo recorded votes mentioned, but SB 41 and SB 1 were said to be making their way through the legislative process.\n\n## Attendance\nNo specific quorum notes provided.\n\n## Adjournment\nNo information on when the press conference adjourned or the date of the next session.",
  "transcript": "Well good afternoon everyone. Good afternoon. I want to begin by thanking you all for taking the time to be with us this day to show up and to show out for Georgia's girl athletes.\nI want to especially thank and recognize Jeff Graham from Georgia Equality and Bentley\nHuggins from the Human Rights Campaign, and of course my dear friends from Georgia Winless\nfor coming and helping to spread the word about today's press conference.\nWe are here today not only to address the potential harm of our trans girls that SB1 seeks\nto implement, but we are here also to name out loud the equity mountain that women continue\nto climb in almost every arena, including athletics, even decades after Title IX enacted.\nFor those who aren't aware, Senate Republicans introduced SB1, the Fair and Safe Athletic\nOpportunities Act, and this bill is making its way through the Senate.\nTo be clear, it is a bully tactic aimed at a minority community,\nmeanwhile, ignoring the reality that girls are cheated\nout of real fairness each and every day.\nWhat we know, what we continue to see and experience\nfirsthand, what we watch on our girl, our girl's face,\nis an ongoing, unequal treatment of girls in sports\nacross our state.\nMy equal opportunities in Girl Sports Act, SB 41,\naims to address these inequities that\nare still present in our athletic departments.\nIf we want to have a real conversation\nabout true fairness and true safety in Girl Sports,\nabout our truly level playing field, then let's talk.\nLet's talk about how girls' teams\nare made to practice late at night or early in the morning\nwhen it's still dark outside.\nLet's talk about how girls' soccer coaches\nwho work twice as long, averaging 20 games a season,\nmake one third.\nThat's right, one third the pay of football coaches\nwho averaged 10 games a season.\nOr how about girls' sports teams\nwho are signed teacher supervisors, not coaches,\nteachers supervisors with no coaching experience\nbecause their pay and equity is so steep\nthat the qualified coaches won't take the job.\nIf we wanna have a real conversation\nabout leveling the playing field, then let's talk.\nLet's talk about the severe lack of equipment,\nprovide it to teams, like the six soccer balls\ngiven to girls, soccer teams, and South to Cav.\nOr about the fact that teams are resorting to raising,\noperating funds through athletic booster clubs\nand student fees just to ensure that they have proper equipment.\nLet's talk about the girls who never even\nget a chance to play, because they\ncan't afford the fees at their public schools.\nIf we want to have a real conversation\nabout leveling the playing field, then let's talk.\nLet's talk about the media who highlight the accomplishments\nof boy soccer teams, but not the girl soccer team\nthat wins the state championship.\nThe attention that's given to football teams\nfar and above any girls' teams in our schools.\nLet's talk about the medical professionals and the trainers\nwho are stretched thin, higher to serve all school athletes,\nbut common-deared by boys, football, and basketball teams.\nOur female athletes are here begging\nfor real solutions to their real problems.\nAnd to be clear, our trans girls are the farthest\nfrom the problem that is actually\nhindering our girls' abilities to play.\nWe've got a long way to go to leveling the playing field\nin girl sports.\nSo let's solve real problems by passing SB 41.\nAt this time, I invite Representative Oliver\nto come and talk as one who is a pre-titled non-athlete.\nThank you, Kim, thank you everyone for being here.\nI am a pre-title 9 athlete from Druid Hill's High School.\nI come to tell you about some of the good steps, the positive steps we have made in my political\ncareer and why we need to move forward and not backward.\nI also come to you on behalf of the Decatur Girls Cross Country team that is won the State\nChampionship two years at a row.\nI remember when Republican women came together with Democrat women to make the Georgia high\nschool system of sports include fast pitch softball.\nThat was a very good victory.\nI remember when Channel 2, Monica Pearson, did an extensive analysis of the fact that the\nGeorgia High School Sports Association had no women on the board.\nWe passed a bill and they have women on the board now.\nTitle IX changed the entire world.\nWhen I was a four-year-letter person at Dr. O'Hill's High School, captaining my swim team,\nI was good for a few months of every year in a sport.\nWhen I went to Vanderbilt, I was invited to join the Synchronized Swim Team.\nI think that we know that girl sports has come a long way, but we also know we know and\nwe must address the issue that it's not equal.\nEvening the playing field is what we must do at this time.\nThe discussion that's focused on the non-existence of girl trans athletes is a total distraction\nand a negative impediment to further progress.\nThank you for your attention today.\nThank you for your participation in some of the progress we've made and let's make sure\nthat we don't back up in 2025.\nThank you.\nHello, I am a born and raised Georgian and a huge part of my formative years was getting\nto play sports.\nBeing on teams built my confidence and pride as a leader, having seen the power of sport\nfirst-hand led me on the path of organizing and advocating for girls and women's sports\nover the past many years.\nWhile so much progress has been made in the realm of gender equity and sports, there\nis still so far to go.\nIn my years of coaching, I hate to think about the time I've spent trying to fight for equal\nopportunities for girls' teams when I could have spent that time practice planning or communicating\nwith parents and assistant coaches.\nWhile conceptually organizers may know that girls and boys should be treated equally,\nIn the end, girls' teams are often scheduled in the worst time slot on the worst fields\nor given lower quality equipment.\nAt first these things can seem small, but over time they add up, consistently getting\na little bit worse or a little bit less, tells our young athletes about how much they\nThey are valued in sense messages about how much our young girls should value themselves.\nWe have got to level the playing field.\nWe know that on average, girls who play sports get better grades, have better attendance\nin school, and are more likely to graduate from college and even go on to graduate school.\nIn this specific time, we are in a youth mental health crisis that particularly impacts girls.\nWe know that sports are one of the best tools for girls to manage their anxiety and regulate\nemotions.\nWe need to continue to have the fight for equality for our next generation of athletes to level\nthe playing field and ensure that we have equal equipment, equal coach salaries, and equal\naccess to facilities.\nI'm so proud to stand behind this bill\nas we come together to continue the fight\nfor girls in sports.\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\nWoo!\ndropped a companion bill in the house\nbeing carried by Representative Cannon.\nCurrently, girls and women in this country and in Georgia\nare fighting to hold on to decades of hard fought progress.\nExtreme lawmakers are stripping our freedom\nto determine our futures, to decide what's best for our bodies,\nand to simply be treated as equal citizens\nunder state and federal constitutions.\nNow, those extreme politicians who are marginalizing girls\nand women say they want to protect girls' sports.\nIf that were true, Georgia Republicans would get behind this bill,\nwhich addresses the existing inequities\nwhen it comes to playing time, access to fields,\nand investment in sports equipment and coaches.\nTitle IX was enacted more than 50 years ago\nto ensure gender equality in education,\nwhich includes sports, yet disparities still persist.\nSports are more than just games.\nThey teach discipline, teamwork, leadership, and resilience,\nyet despite these benefits, girls continue to be\nsideline literally and figuratively\nwhen it comes to athletic opportunities.\nAs previously mentioned, the girls teams receive less funding,\noutdated and adequate equipment,\nand are also forced to play on subpar fields\nat inconvenient times compared to their male counterparts.\nThis isn't just an issue of fairness.\nIt's an issue of opportunity and empowerment.\nWithout equal playtime, young girls are discouraged\nfrom pursuing their passion and the pipeline\nthat feeds future champions is weakened\nbefore it even has a chance to develop.\nWhat message are we sending when we tell young girls\nthat their sports are less important,\nthat their ambitions are secondary,\nthat their commitment and effort are worth less\nthan those of their male peers.\nWe cannot allow this outdated mindset to persist.\nWe must demand equal investment in girls' athletics,\nnot just in words, but in actions.\nBecause this is about shaping a future where girls\ngrow up knowing they are just as capable, valued,\nand worthy of investment.\nIf Georgia Republicans truly wanted\nto protect girls' sports,\nThey would stop their harping on the non-existent threat\nby trans athletes and embrace this legislation\nthat empowers our girls.\nApplause.\nThey would stop wasting our time and taxpayer money\non legislation bent on harming a very small, vulnerable,\nminority group.\nAnd instead, use that money to make, to add more equity\nin girl sports and spend it on our young women and instead enact SB 41 which will help hundreds\nof girls statewide have more equitable treatment in sports.\nThe fight for women's equality continues and I urge everyone to stand up for our girl\nathletes because when we level that playing field, we don't just build better athletes.\nWe build stronger, more confident women ready to take the world.\nThank you.\nThis concludes the formal portion of our program that I do invite questions at this time\nfor any of our speakers.\nGo closer.\nWant you to come?\nYep.\nGo ahead, Sam.\nSo to be clear, equity and girls' boards, it's not mutually exclusive to support making\nsure that we level the playing field for girls.\nBut it is a false hearing to suggest that we are creating fairness for girls by eliminating\ntrans girls.\nThat doesn't make fairness.\nThis bill creates true fairness in girls' boards.\nIf we want to protect girls, then we need to make sure they have playing fields that\ndon't have holes in them, that they have access to equipment that fits them, that they have\nreal coaches.\nRight now, today in Georgia, we have girls who play on the boys' teams, not because boys\nare stronger or faster or anything like that.\nThey play on boys' teams because they have real coaches, because they have real equipment,\nbecause they have access to real fields.\nAnd so if we want to truly protect girls' sports, this is the way we do it.\nIt's with SB 41.\nI think that we can truly make this a bipartisan bill.\nSo I began playing sports when I was just in the third grade and played sports all\nall the way through college and went on to play\nfor the United States national team.\nAnd during that entire time, the playing field was never level,\nbut we became acclimated to it.\nWe became used to it.\nAnd moms actually stepped in to try to help with that.\nSo moms began to spend their money out of their own pockets\nto make sure that we had uniforms that fit.\nThey began to spend money out of their own pockets\nto transport kids to the games and things like that.\nSo moms have been filling the gap.\nthey've been trying to make it so that their girls,\ntheir daughters have access to the playing fields,\nhave access to equality in the same way that their boys do.\nBut this should not be on the backs of mothers.\nThis is a Georgia job.\nApplause.\nGirls in Georgia deserve an equal playing field.\nThey deserve to be treated just as well as the boys do.\nand their coaches deserve to be paid just as well\nas the boys coaches are paid.\nThank you.\nYeah, thank you.\nThank you.\nThank you for your time.\n",
  "updated_at": "2026-02-12T19:05:40.118428+00:00"
}