{
  "video_id": "sPd1sU0tfXk",
  "url": "https://www.youtube.com/watch?v=sPd1sU0tfXk",
  "title": "Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 19,
  "summary": "Here is a structured markdown summary of the Georgia Sen. Islam Parkes Press Conference on Expiring SNAP Benefits | 10/29/2025 session:\n\n## Overview\nThis press conference addressed the impending expiration of SNAP (Supplemental Nutrition Assistance Program) benefits for nearly 1.4 million Georgians, including over 640,000 children. The speakers, including Sen. Nabila Islam Parkes, Rachel Kent (a single mother), and Alicia Rivera from the nonprofit Georgia Feeding Families, called on Governor Brian Kemp to declare a state of emergency and use the state's budget surplus to continue providing SNAP assistance to affected families.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Sen. Islam Parkes emphasized that food is not optional and this is a \"humanitarian crisis unfolding in real time.\" \n- Rachel Kent, a single mother, shared her personal struggles of relying on SNAP benefits to feed her son and called on Gov. Kemp to use the state's surplus to support families in need.\n- Alicia Rivera from Georgia Feeding Families discussed the increased demand for assistance at food banks and the need for urgent action to address the crisis.\n- Former state senator Jason Estevez, who is running for governor, expressed his support for the SNAP program and criticized the current leadership for not taking action to help Georgians in need.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum was present, as senators and community representatives participated in the press conference.\n\n## Adjournment\nNo formal adjournment, as this was a press conference rather than a legislative session.",
  "transcript": "Thank you so much for being here today. I am State Senator Nabila Islam parks and\nI'm here today with Rachel Kent and her son Sterling. They rely on food\nassistance from SNAP benefits. We're also here with Alicia Rivera who is with\nGeorgia feeding families, a food bank in Georgia, and also my former colleague\nState Senator Jason Estevez. In just a matter of days, nearly 1.4 million\nGeorgians, including over 640,000 children, could lose access to the food they\ndepend on through SNAP. This is not some distant policy debate. This is a\na humanitarian crisis unfolding in real time and on our watch. Let me be clear. Food is not optional.\nThis is not about politics. This is about children eating dinner. This is about seniors being\nable to take their medicine with food. This is about parents not having to choose between groceries\nor gas to get to work. Georgia is blessed, blessed to have 14.6 billion dollars in a surplus.\nWhat we have is what we need and we have it to protect these families. We just need the\nwill to do it. And that's why we're calling on Governor Camp to declare a state of emergency.\nLet's get Georgia families the food assistance they need, governor.\nYou often say we are the number one state to do business, but we must also be the number\none state for families, for children, for seniors.\nLet's show that economic strength is not something we brag about.\nIt is something we use to take care of our own.\nWe are here to extend a hand and come up with solutions, and it is time for all of us\nto step up and do what Georgians always do in a crisis.\nWe roll up our sleeves, we pull together, and we get the job done.\nIf other Republican states can step up, then the number one state for business can step\nup to.\nis the strongest workforce in America.\nCan't work if their kids are hungry.\nGovernor, you are one of the most powerful governors\nin this country, and I know if you want this fixed,\nyou will find a way.\nAnd we are ready, we stand ready to help you.\nDemocrats are here, legislators are here,\ncommunity partners like feeding Georgia families are here.\nWe are ready today, not tomorrow, today.\nLet's do what Georgia deserves.\nLet's protect our kids.\nLet's honor our seniors, and let's fight for every family\nwho simply wants to put food on the table.\nGovernor Kim, call for a state of emergency.\nLet's do this together, because Georgia families\nare worth fighting for.\nThank you, and let's get to work.\nNext, I'm gonna have Rachel Kent speak about her story,\nand she will also be standing with her son Sterling.\nHi, everybody, good morning.\nThank you all for being here today.\nIt's an honor to speak alongside Senator Jason Asseves,\nSenator Nabila Islam Parks, and Miss Alithia Rivera.\nMy name is Rachel Kent.\nI'm a proud single mom of my son Sterling, who's with me today.\nHe's a freshman in high school, a straight-age student,\nand a percussions in the marching band.\nI'm so proud of him.\nBut looking at us, you may not know the struggles our family faces.\nBut I'm here today because I'm one of the nearly 1.4 million Georgians\nwho rely on Snap to put food on the table.\nAnd come Saturday, this critical food assistance program will end for us, for millions who need it, with no relief in sight.\nWe don't know how long this suspension will last.\nAnd I want to be very clear about who is at fault here, President Donald J. Trump and the Republicans, who shut down the federal government.\nAnd now, our governor, Brian Kemp, has an opportunity to fill in the gap and make sure\nfamilies like mine don't go hungry, but you know what, he's refusing.\nGeorgia has a rainy day fund, but for many of us it's already raining.\nFamilies are doing everything right, applying for jobs, caring for children, recovering\nfrom illnesses or disabilities, and still, it's not enough.\nis a choice for my son and I. It's survival. Brian Kemp and May politicians need to use\nGeorgia surplus to fund to help snap families now. Too many of our leaders don't know what\nit's like to check the pantry before payday to stretch $10 across the week or to send\nMany child to bed after another long day of trying were tired.\nMany of the politicians were born with silver spoons in their mouths, and now they tell\nthe rest of us how to survive with plastic forks?\nAin't right.\nBut we're not asking for pity.\nNo, we're asking for perspective.\nWe're not asking for handouts.\nWe're asking for a hand up.\nIt's a lifeline. It's how working families survive between paychecks. It's how\nsingle parents like me feed their kids when the world tells them to do the\nimpossible. Our governor, Brian Kemp, is supposed to support hardworking\nGeorgians. But I said, sorry, not just a powerful, not just a comfortable, but all\nof us. The parents trying to feed their families, the laid-off workers looking\nfor one chance to start again, and the people who still believe in hard work, even when\nthe jobs have vanished.\nGeorgia leaders need to remember who they serve, because we the people of United States\nof America, the ones who struggle, who keep trying, who never give up, we're still here,\nand we the people deserve to be heard.\nSo Governor Kemp, please take action now to protect families and fund SNAP on November\n1st.\nThis isn't about politics.\nThis is about the people.\nThat's hunger, doesn't care about party lines, thank you.\nWe're aware that starting this Saturday, one in eight Jordan's will lose snap benefits.\nThat's millions of working families who rely on this aid to put food on the table.\nWe have even more families impacted by the shutdown that are in need this year.\nSince last evening, I've received four phone calls from nonprofits, food pantries that\nare requesting additional food.\nThey've seen an increase of 25 to 50 percent of families requesting additional help for\nThanksgiving.\nAnd we're stretching ourselves then trying to meet those needs.\nWe're working diligently to reach these families and offer the support that they need.\nThis is a crisis that we must face together.\nOur team and partners, as well as fellow nonprofits, are doing all that we can by adding additional\nfood distributions throughout the state, bringing feeding Georgia families, mobile pantries\ndirectly to communities, and serving seniors and families without transportation.\nWe are hopeful that we can unite as food banks, resource centers, and the government to provide\nurgent action.\nThe use of emergency funds as well as providing immediate additional support to our existing\nsystems can ensure that no Georgian goes hungry and that is our mission at\nfeeding Georgia families from our family to yours is to ensure that whoever's\nin need the most are cared for and provided for in this time.\nGood morning everyone and good morning Midtown International School. I want to\nLet's start by thanking Senator Nabila Islam for her leadership during this critical time.\nAnd I want to thank Ms. Alicia Rivera and feeding Georgia families for the work that you\nall are doing in the community every day.\nAnd I want to pay particular homage and respect to Rachel Kent and her son for being here\nand speaking up and speaking out in the face of silence from Governor Kemp and Republican\nstate leaders as millions of Georgians are on track to lose critical snap benefits on\nSaturday. My name is Jason Estevez and I'm running to be the next governor of the state\nof Georgia because Georgians deserve better than the leadership that they are getting at\nthis critical moment. I'm a former educator, school board member and Atlanta Public Schools\nand a state senator. And every day in each of these roles, I've seen how our kids are\nbeing left behind, mainly because of where they live. Kids would come to school hungry\nor sick, and that meant that they couldn't focus on the one thing that they were supposed\nto be focused on, which is learning. Snap helps millions of kids and their families put\nfood on the table, and I've seen it firsthand. It's an essential program, and without it,\nchildren across this state will go hungry. I think about counties like Hancock County\nwhere one and two children are food insecure.\nSnap expiring on Saturday will be terrible for those children\nwho are already in crisis.\nBut I also want to point out that there's a misconception\nabout who is on Snap benefits.\nIt's Georgians like Rachel.\nIt's Georgians who are working in our kitchens,\nin our restaurants, in our ag industry,\none in four cooks around the state are on snap,\none in four nursing aids, cashiers, dishwashers,\none in five agriculture workers, and hairdressers are on snap.\nThis is another way for these hardworking Georgians\nto make ends meet.\nSo I want to be clear,\nDonald Trump and Republicans are at fault here.\nThey shut down the federal government\nbecause they did not want to address the health care\nfor Georgians across this state.\nAnd they did it without no regard for Georgia's children\nor their families.\nAnd now with SNAP benefits on track to run out on Saturday,\nRepublicans in the federal and state governments\nare refusing to address this problem.\nAs has already been stated, 1.4 million Georgians rely on SNAP.\nSo why won't Donald Trump and Brian Kemp act to ensure\nthat one in eight Georgians don't go hungry?\nThese are reckless political games.\nIt's lawless, it's outrageous, and above all, it's cruel.\nAfter previously saying that they would continue SNAP\nthrough federal government funding, Donald Trump\nis reversing course, and they're refusing\nto use critical contingency funds to provide a lifeline\nfor hard-working people across this state.\nBut let me be clear, it's not just the Trump administration.\nOur own governor, Brian Kemp, is sitting on his hands\nwhile his own constituents are in crisis.\nAnd there's so much that he can do.\nFor starters, over 22 states have joined together\nto sue the Trump administration's horrific snap freeze.\nBrian Kemp and Chris Carr refused to join that lawsuit.\nI think about our hard-working men and women in the National Guard who could very easily\nbe mobilized to help pantries across this state to meet the needs of Georgians, but instead\nright now they're in Washington, D.C., doing landscaping and picking up trash.\nAnd look, y'all, as Senator Islam said, our state has $4.6 billion sitting in a bank\naccount that can be used for dire times such as these. This is exactly what this money\nshould be used for, helping Georgians when they are most in need. When Kemp says that\nthere is no mechanism to fill in the funding gaps, he's just refusing his responsibility.\nIn fact, Governor Kemp has released state funds before in times of crisis. He can do it\nagain, but he's choosing not to, and I can tell you that when I'm governor, I won't\nhesitate to use funds when Georgians are in need of urgent relief.\nRepublicans like Brian Kemp, Bert Jones, and Chris Carr didn't flinch when it came to\nhanding out billions of dollars to a big out-of-state corporations.\nBut now when it comes to urgent relief for hardworking people in this state, they are\nnowhere to be found.\nAnd unlike state Republican leaders, we are standing here to take action.\nAnd I will do so when I'm governor.\nAnd times of crisis, I don't stay silent.\nI take the challenge head on.\nAnd when I'm governor, if the Trump administration makes any move that hurts Georgians, you can\ncount on me to stand tall and to fight back.\nY'all, there is no excuse.\nIt is time for action, and I call on Brian Kemp to protect families and ensure that\nGeorgians can keep food on their table.\nSo to the struggling Georgians all across this state, to folks like Rachel, in the face\nof these cuts and uncertainty, I tell you that I am standing with you, we are standing\nwith you.\nAnd here's what y'all can do right now.\nFirst keep using any funds that you have on your card, because existing EVT balances will\ncontinue to work.\nout to your local food bank, to feeding Georgia families, to churches, to school districts,\nto community organizations that providing resources at this time.\nYou can go to feedingamerica.org and put in your zip code and it will provide food banks\nin your area that are providing critical resources.\nAnd Ms. Alicia Rivera, thank you so much for being here on behalf of feeding Georgia.\nThrough the Georgians who have the resources to spare, I encourage you to support organizations\nlike feeding Georgia that are doing the work on the ground.\nY'all, here's my commitment to you.\nI will always put Georgians' health, wealth, and opportunity first as governor.\nIt's what I've done throughout my whole career, and no matter what attacks, Trump, and Republicans\nthrow our way, I'll continue to fight for you.\nThank you so much, and with that, we'll entertain any questions.\nWell, what other states like Virginia and Louisiana have done use, you know, their\nstate surplus is to do direct cash assistance to snap recipients.\nAnd I know that he's saying, well, there's, you know, technical difficulties, but he's\nthe governor of Georgia.\nI'm asking him to figure it out and get the billions and billions of dollars that we\nhave in a surplus and to get that we can take that and actually help Georgians. We are\nnot a state that's in a deficit. We have a surplus. We can use it and it's up to the\ngovernor to do so.\nCan you repeat that question, please?\nSo basically when I became a single mother, so kind of give back, sorry, I have a college\ndegree, but when you're a parent married, you become the homemaker.\nSo when I got divorced and became a single parent,\na gig and job has been extremely difficult,\nmy greatest political science.\nAnd so I had to make do, there'd be a survival\nand get on the food stamps.\nHow long have been on it for about six months?\nIt's still hard getting a job.\nAnd my experience has been great.\nI mean, you don't get a ton.\nThis is the thing what the misconception people have.\nJust for my son and I get $300 a month on it.\nIt's like, no, I'm thankful for everything\nget on it but the way groceries are you can't get a lot and I like to cook\nfrom scratch too. I think that it's the most beneficial thing there's a lot\npeople on food stamps a neighbor could be on food stamps and it could be living\nin a million-dollar house you would never know but we judge way too much I think\nthat's my main thing is we got to quit judging people and help me people more\nSo I'm preparing what my grandmother had taught me a long time ago.\nShe used to say to me, you have money one day, gone next, always prepared, have your pantry\nfull of canned goods, flowers, so I stocked up on that, because again I grouped that\nblockchain culture so I learned a lot from how to cook we don't have a lot of\nmoney and I prepared for a month so that I got meat in the freezer and meals\nprepared and cook way my grandma taught me.\nIf there are no more questions thank you so much for being here and again I just\nI just want to emphasize that other states have called for a state of emergency.\nThe governor can also do so.\nWe are sitting on a $14.6 billion surplus and we have 1.4 million people there about\nto run out of food.\nWe can do something and the governor should do something now.\nThank you.\n",
  "updated_at": "2026-02-12T18:38:54.094824+00:00"
}