{
  "video_id": "sqyGzosxE74",
  "url": "https://www.youtube.com/watch?v=sqyGzosxE74",
  "title": "Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a summary of the key points from the Georgia Sen. Jones II Press Conference on Minority Party Priorities | 01/29/2026 session:\n\n**Overview**:\nSen. Jones II outlined the Democratic caucus' legislative priorities for the current session, focusing on affordability issues for working families such as healthcare, childcare, housing, and taxation.\n\n**Key Actions**:\n- **SB 379**: Legislation to create a state-based premium tax credit to address the expiration of ACA tax credits\n- **SB 380**: Legislation to expand Medicaid in Georgia, led by Sen. David Lucas\n- **SB 408**: Legislation to sunset the tax exemption for data centers by 2027, led by Sen. Nanorock\n\n**Bills Introduced (First Reading)**: \n- SB 192 (from last session)\n- SB 379\n- SB 380 \n- SB 408\n\n**Notable Moments**:\n- Sen. Jones II criticized Republican plans to eliminate the state income tax, calling it a \"tax hike\" that would hurt working families.\n- The Democrats are also focused on issues like food insecurity, public education funding, and preventing mid-cycle redistricting.\n\n**Votes**: \nNo recorded votes mentioned.\n\n**Attendance**:\nNo quorum notes provided.\n\n**Adjournment**:\nThe press conference concluded, but no information on the next legislative session date was given.",
  "transcript": "Good afternoon. I'm Harold Jones the Second Senate Democratic Leader out of Augusta\nGeorgia. My colleagues right now are fighting for democracy, fighting for our\ndemocratic values as we fight against Senate resolution 563. Not only are we\nfighting for our values as a democracy, we're also fighting to make\nfamily our life more affordable. Working families have been and continue to\nstruggle under Republican leadership. Under this leadership for 22 years, not working\nfamilies have seen their ways of stagnate. They have seen the fact that child care costs\nhave gone up. They have seen their health care costs go up. We may be the number one state\nto do business, but we are not the number one state to raise a family. Instead of addressing\nthese issues, in this general assembly this year, the Republicans have decided to borrow\nphrase from George Herbert Walker Bush to basically practice voodoo economics. And what\nis that voodoo economics that we talk about? And that is this idea coming from the Senate\nabout eliminating all income taxes. Understand that this is not an elimination of taxes,\nthis is actually a tax hike. It will be one of the largest tax hikes in Georgia's history\nand it would be permanent. Why is it a tax hike? Because once you eliminate those funds\nover half of our budget-cultural income tax,\nit has to be made up from some place.\nAnd historically, where you've seen it be made up at\nis through sales tax.\nAnd sales tax is something that impacts working families.\nWe can see sales tax rise up to almost 15%.\nThat is something that would devastate working families\nof Georgia.\nAnd the fact is, Republicans know this.\nAnd instead of being honest with the people of Georgia,\nthey refuse to actually come clean\nand say the effects this would have.\nBut that's just the start.\nWe still refuse to actually address\nthe healthcare crisis in this state.\nUnder Republicans in the DC,\nbecause of Republican in action,\nthe ACA's tax credits have basically expired.\nAnd here in the state,\nthe Georgia Senate Democratic Caucus,\nlast year with SB192,\nunder Senator Jason Esteves,\ntried to address this issue.\nWe're back again to address it once more.\nThis year with SB 379 was Senator Josh McLean.\nWe have drafted legislation to create our own premium tax credit.\nWe have done this because as you know,\nmany persons are not able to afford on the open marketplace\nwithout these particular tax credits.\nWhat people are seeing and what they have seen\nis that their premiums will go up almost double.\nThat would decimate a working family.\nAnd so therefore, we have created our own tax credit\nfor the state to actually adopt through SB 379,\nthe continuation of last year SB 192.\nWe are continuing to lead on this issue.\nBut as you are aware, there are many people\nwho also cannot afford on the open marketplace.\nAnd to address that, we still are pushing\nfrom Medicaid expansion.\nThat is being pushed by Senator David Lucas\nin the form of SB 380.\nYou will remember that just a couple of years ago,\nSenator Lucas was able to get a hearing.\nThe first of his kind, we was able to get a hearing\nto expand Medicaid.\nWe are still looking to push that over\nThe finish line, uncomplicated care is killing health care in Georgia, but there is more.\nWe have to do more, not only as far as health care is concerned, but as far as also child\ncare is concerned.\nAs you know, child care in Georgia is one of the highest within the nation.\nWe have to make sure that our families can afford child care.\nTherefore, we will continue to push for an expansion of our child care tax credit to\nmake sure that families can actually afford it.\nSo instead of actually talking about issues such as that,\nthe Republicans are saying we should get rid of all tax credits,\nincluding that would be the childcare tax credit.\nBut we can go further.\nWhen we talk about housing affordability, for instance,\nonce again, the Republicans are not leading the Democrats are.\nWe need to make sure we can make housing more affordable.\nWe're going to look into the fact that we have too many private\nequity firms that are basically gobbling up houses within Georgia.\nGeorgia leads the nation as far as that is concerned.\nprivate equity is buying up these homes and they're not treating them as homes, but as basically rental properties with\nexorbitant rents. The second thing we can look at is trying to make sure we actually change our zoning laws. Whether we're talking about\nlot sizes or laws as far as only being used for commercial development, we can do better there. We have to build homes.\nWe have to get people within homes. And for those that cannot afford to actually be in a home and they are\nactually Renton, we can do something about that too.\nTherefore, we continue to support Senator Don Geller-James,\nas she has actually presented legislation over the last two\nyears to talk about basically having some type of rent\ncontrol if counties deem that to be in their best interest.\nThis is not a mandate from the state.\nIt only says if counties think that they have to get some\ncontrol over their rents, they will have the eligibility\nto do that.\nAs you know in Georgia, counties are precluded from even\nthinking about the issue by law.\nSo we will continue to make sure that those who can not afford their own home or rental\nhomes, they can actually stay within those properties too, and we can make that affordable.\nWe have basically been leading on these issues.\nWe have continued to lead on the issue of education.\nOne of the things that we have to do, we are going to be supporting Senator Freddie\nPowell Sims, as she makes sure we continue to publicly fund education, public education.\nAnd she has drafted legislation and will continue to draft this legislation, which will actually\ncurtail vouchers as we basically give away taxpayer money to private systems.\nWe have to make sure that we correctly fund public education.\nAs pursuant to that, when we talk about funding public education, as far as funding, as far\nas the QBE formula is concerned, we're going to continue to support Senator Rashan Kemp.\nAs one of the things that he would be presenting is to make sure that we weigh poverty within\nthe QBE formula as he continues to fight for opportunity weights to make sure it could\ncorrectly fund public education.\nThese are things that Democrats have led on and we will continue to lead on.\nBut it does not end there because the fact of the matter is as we talk about affordability,\none of the big issues that is out there today, of course, is data centers.\nAnd that is why the Democrats actually have completely led on this issue through Senator\nNanorock with SB 408 where we actually decided to sunset the tax exemption not from 2032 but\nactually 2027 and that is led by Democrats and when you see that particular legislation\nyou will see that she actually has Republican signers but why is that because we led on\nthe issue there are other bills that came after ours but we were the first we were the first\nto stand up address this issue respond to our constituents and realize that this is a major\nissue affecting Georgia. And so we are there for that also. Other issues that we\nalso will be tackling is continue to look at food insecurity. That is a major\nissue that myself have worked on in others. We will continue to look at that\nparticular issue too to try to make sure that food insecurity goes away in\nGeorgia. But whenever you talk about affordability, whether we're talking about\nhousing costs, childcare costs, healthcare costs, or data centers, you can't have\naffordability if you don't have the opportunity to actually vote or you don't\nthe opportunity to actually make sure that your voice is heard and that is why\nSenator Atlanta parent will be drafted and has drafted legislation dealing\nwith mid-cycle redistricting. That is not constitutional and is not right when\nwe should not do it and so we're going to make sure that we kind of put a stop\nto that if Republicans are thinking about actually engaging in that process\ntoo. So what you find is a whole list of process within this party within\nour priorities. There are priorities that affect Georgia's and as I said\nsaid earlier, one of our priorities also has to be to make sure that we still have a democracy\nto live in.\nAnd that's why we have so many of our colleagues right now fighting to make sure that takes\nplace after what just happened last night in Fulton County.\nSo our priorities are make sure we fight for you, fight for the people of Georgia, make\nsure it's affordable, make sure it's a great place to live.\nWe have been the number one state to do business for many years, but we've never been the number\none state for people to actually live and work and raise the family.\nThat is the goal of the Democratic Caucus, that is the goal of the Democratic Party, and\nthat is the goal of all Georgia's.\nWith that, I'll take any questions.\nThank you.\nRight, once again, as we talked about, eliminating the income taxes, as I said, is basically\nwould be disastrous our working families.\nAnd the fact of the matter is, that's not just coming\nfrom leader Harold Jones.\nWe know that the House does come from Kip's on economists,\nwho basically said, I believe it's 2018,\nthat any kind of proposal like that\nwas based from somebody who is not serious.\nIt is an unserious proposal.\nThe only way to actually make up that money\nis to go to a, basically, a sales tax.\nThat decimates our families.\nThat's the only way to do it.\nThe idea that you're gonna eliminate\nevery single tax exemption.\nOne of the talking points that Republicans\nto use it about eliminating your tax exemptions\nis that it only goes to corporations.\nAnd so therefore, we should be in favor of that.\nTwo points to that.\nFirst of all, that's not true.\nMany of our tax exemptions, in fact,\nthe majority of them actually go to individuals.\nRemember, we don't have taxes on groceries,\nprescription drugs, for instance.\nAnd then when we also talk about\nsome of these tax exemptions and corporations,\nGeorgia many years ago decided our economic interest\nwas gonna be through the use of exemptions\nand through tax credits.\nTo now say you're gonna take away all of that,\nthat actually make people lose jobs\nand we'll lose momentum as far as the economy is concerned.\nSo it's an idea that is not serious.\nI concur with Governor Kim's economist said,\nit's an unserious idea.\nBut it is an idea that's dangerous,\nand it is one that would actually raise taxes\non working families,\nbecause the only way you get in that money back\nis through raising sales tax.\nSecond aspect of that, as you mentioned,\nproperty tax too, basically the same answer to that.\nThere are other alternatives to those particular ideas\nthat we can explore.\nOne is what's called a circuit breaker property tax break\nthat you possibly could actually look at,\nwhich puts ceilings on how much you actually pay\non your property taxes.\nThose are things that you possibly can look at,\nbut to say that you're gonna get rid of the home set,\nthe exemption tax is, once again, not a serious idea.\nOur counties would suffer.\nCountess today don't want to raise taxes as it is.\nThey would also be forced to raise their local taxes,\nand they then also would have to be forced\nto be fined other avenues or make cuts\nwithin their budgets.\nWhat is it, what is it, what is that tax fund?\nIt funds your schools and it funds your police.\nThat's what it funds.\nAnd that's exactly what you would be defunding quite frankly\nif you actually went for either one of these proposals.\nThese are election year stunts,\nbut they're very dangerous stunts if they were to pass.\nAnd so that's why we're here to fight against them.\nAny others?\nThank you, that's for coming out.\nThank you so much, appreciate it.\nThank you.\nPizzley?\nYeah.\nIt's a big deal.\nOkay.\nOh, okay.\nOkay, man.\nEverybody show them.\nOkay.\n",
  "updated_at": "2026-02-12T01:34:59.314558+00:00"
}