{
  "video_id": "sRojqP_qZSQ",
  "url": "https://youtu.be/sRojqP_qZSQ",
  "title": "Georgia House - Day 40 (2026-03-31)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": "2026-03-31",
  "duration_minutes": 299,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-03-31:\n\n## Overview\nThe session featured a debate and vote on adhering to the House's position on SB 195 regarding hemp farming. The House also agreed to the Senate substitute to HB 553 related to virtual hearings. Additionally, the House heard a farewell speech from longtime Representative Greg Morris.\n\n## Key Actions\n**SB 195**: The House voted 124-14 to adhere to its position on SB 195 and appoint a conference committee to resolve differences with the Senate version of the bill, which amends definitions regarding hemp farming.\n**HB 553**: The House voted unanimously to agree to the Senate substitute to HB 553, which allows for virtual participation in state administrative hearings.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Rep. Greg Morris gave an emotional farewell speech after 21 years in the House, reflecting on the changes he has witnessed over his tenure.\n\n## Votes\n- **SB 195**: House voted 124-14 to adhere to its position and appoint a conference committee.\n- **HB 553**: House voted unanimously to agree to the Senate substitute.\n\n## Attendance\nA quorum was present for the session.\n\n## Adjournment\nThe House adjourned. The next scheduled session is [date].",
  "transcript": "The chair recognizes representative gravely for a motion. Thank you, Madam Speaker. I move that the House adhere to its position on SB 195 and appointed committee of conference. Representative gravely moves that the House adhere to its position, disagreeing to the Senate substitute amendment to Senate bill 195 and that a committee of conference be appointed the clerk will read the caption. Senate bill 195, Senator Mulles, the 53rd to be entitled to an act to amend code section 2, 23, 3, the fiscal to Georgia and tentative relating definitions regarding hemp farming. Is there objection? The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House stand at ease for a moment before we vote on the motion and we'll wait until the Rules Committee has adjourned. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. The House adhere to its position on SB 195 and appointed committee of conference. Chair wants to make clear we're about to have a vote. There was an objection to representative Graveli's motion that the House adhere to its position on a point a committee of conference. If you agree with representative Graveli, you will vote green. If you disagree, in other words, you object, you will vote red. All those in favor will vote yes. All those opposed in the clerk will unlock the machine. Have all members voted. Have all members voted. If so, the clerk will lock the machine on the gentleman's motion. The yeas are 124, the nays are 14, and the House has agreed to adhere to its position on SB 195 and appoint a committee of conference. The chair appoints representative Graveli of the 67th, representative Watson of the 172nd, and representative Smari of the 135th as a committee of conference on the bill. The chair recognizes representative Gunner for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate substitute to House Bill 553. Representative Gunner moves at the House agreed to the Senate substitute to House Bill 553, the clerk will read the caption. House Bill 553 byerson of Gunner of the 8th, and others to be entitled back to a manchap for 13 and title 50 that fiscal to Georgia, instead of related administrative procedure, so it's derived from participation in hearings by electronic communications. Chair recognizes representative Gunner to describe the Senate substitute. Thank you. Ladies and gentlemen, this bill was a virtual hearing for the State Administrative Hearing Office. One thing was added to it at the request of the Department of Community Health that they be added to the list of reviewing agencies for regulations that involve Title IV B and Title IV E of the Senate substitute. Title IV E of the Federal Social Security Act. With that, I'd ask that you're for your favorable consideration. Thank you. There are no questions, and the gentleman has yielded the well. On the gentleman's motion of the House agreed to the Senate substitute to House Bill 553. All those in favor will vote yes, all those opposed will vote no, and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machines on the gentleman's motion. The A's, A's, or 157, the A's were zero, and the House has agreed to the Senate substitute to House Bill 553. House will come back to order. Chair wants to recognize at this time for a special order, the Chair of the Banks and Banking Committee, the representative from Toombs County, Chairman Greg Morris. Thank you, Mr. Speaker, distinguished members of the House, colleagues, and friends. How many times in the past 21 years, this isn't part of my talk, that I've, that I've sent here, and during this time, waiting on a bill that I might have, ready to go home, and some were out politician gets up and going to say goodbye. I wish I'd have been a little more sympathetic and empathetic, because now I know how it feels. If you're a fan of movies like I am, there's a great line in the movie Moneyball. Do you watch Moneyball? Did you see that? And it's where the scouts are talking to him about whether he should go to the pros, or he should go to college for his scholarship. And the scouts has looked, Billy, we all get told at some point that we can't play the kids game anymore. Some of us are told when we're 18, some of us are told when we're 40, but we're all told. Some of us in politics are told in our first election. Some of us are told right then, and it's over before it starts. Some of us are told later, the Grand Reaper has gotten some of us, but we're all told. And I've been told that it's time. So many things over the, besides I root my notes too small. I can't see them without my glasses anyway, so I'm, I'm winging it. But I think of the 21 years when I got here, I got here in 1999. 1999. There was no gray in my hair. I was clean, shaving. I was a lot more respect. When I got here, I came in with Roy Barnes, was governor. Mark Taylor was lieutenant governor, and a whole slew of folks. It was entirely democratic. In fact, I was a Democrat when I came to the, when I came to the house. Don't worry, I wasn't a very good one. That's what is a matter of fact in a rather contentious meeting with governor Barnes over who knows what. I remember this is what he said, speak you to appreciate this. And he was right. He said, you're the sorryest member of the Democratic Caucus if it wasn't for call Rogers. Carl, if you out there listening, and I, and I walked out, I said, well, at least I've got that going for me. I suppose. But I came here. Everything was completely democratic. I was a Democrat. I have, and I would look at this. Let me see if I can. And then it was split. I saw a half Democrat, a Democratic house or a Republican Senate. Then all Republican, I've served under four governors already during that period of time. I've served under five house speakers. You'll have to think about that for just a second because you say he's wrong, but I've served under five speakers. When I got here, some people served for 30 years under one. So a lot of change. Clinton, Bush, Obama, Trump, now Biden. That's a lot. That's a lot of change. I've served under three state flags as representative. I got here with the 56 flag. My son, Andrew was born in that one. My son Jonathan was born in what I refer to as the Roy Barnes flag of 2001, I believe. If I had a third son, I always said he'd have been born under other flag. And I guess I could have named him sunny, but that didn't work. That didn't make any sense at home. Drouts 9-11. I remember sitting in that office watching the first tower fall with Speaker Murphy. And so many other events. There are so many people, so many redistributions, a lot of things, a lot of things have happened. So many people to thank. My family, Amy did an excellent job raising two boys while I was up here. If I wasn't up here, I was at home, polyticken. If I wasn't at home, polyticken, I was thinking about polyticken. She did a great job. Two boys that were born here. They know nothing, but me is state representative. They were born here. I remember Andrew. She was pregnant. Amy was pregnant with Andrew. And we were in session. It just so happened that it was Chairman Eagle. It was budget time. And I went home that Friday. The Speaker had arranged it. If there was a problem, I could get a plane or a state patrolman to take me down to Savannah. I got there at five o'clock or water broke at 5.30. The family loaded up like a bunch of gypsies. We went and he was born. And Speaker Murphy got the flag that flew over to Capitol that day for me. And I've got the flag, both flags, both boys. I remember where Miss Penny said they were six and four. And I was boy, I went for the money shot. I knew the newspapers would be here. Two cute boys. They got there. And I got the Bible out. One got one into the Bible. One got the other. Oh, man, the cameras are snapping. I was thinking, here I come. I'm on the front page at AJC. Right on the front row. And that was true. Until Jonathan, the four year old, decided that Andrew, the six year old had a little too much Bible. So he pulled the Bible. He had offended Andrew, so he pulled it back. So the it was on. And I'm talking about in a full fight in soon right there in front of that seat. Right in the middle of the swearing in. And it wasn't near the end. It was before I had swore I didn't know the state any money and I wasn't a communist. It was a long way to go in the swear and in. And I remember Jonathan even tried an epoch that his granddaddy had told him in case he got into a confrontation at preschool or something. Toons County's a tough and I remember his mother was over here mortified and frozen because she couldn't approach. We were in the middle of the swearing in. And what did I do? I did what any father would do. A good father would do. I look straight ahead and that like it's the anything. Pray and pray and then it would get over like we're doing politics wishing it would just get over the session election, whatever it was. But they're good boys often just got accepted into Georgia Andrews in the film Academy. We talk about family a lot. And it gets to be a cliche. But so much we do families do. My children were born here we celebrated that together my mother and father passed away during my session this time wearing a bulk me in New York. I always wear it on the last day thinking of him and many of you have we celebrated together we grieve together. We say things to each other we don't mean or maybe we mean them but we wish we had to set them just like we do with families. And so many people to think I won't I won't try to remember everybody but three quick ones Terry Coleman. Terry a speaker was a long time friend of mine and I was of course I earned it I was a designated driver for those guys for a lot of years. And I remember one night riding around and two a.m. Mr. Speaker while I won't mention the members that were there present riding around to a.m. Feeling very good singing to the Kingston trio. I told you I was ambitious. I mean I was willing to do anything but but Terry Coleman took me under his wing. I said in meetings I never should have sat in heard things I never should have heard learn things I never should have learned. Thank you speaker Coleman for being so good to me when I got here. Secondly I would have to say my good friend Pete Robinson. If you don't know who Pete Robinson is or don't know him you should get to know him as a legislator. Everybody a lot of times I would I know things or understand things or perceive things and people would say how do you know that well I just I just just know these things 90% of the time Pete Robinson told me explain it to me. He's been a good friend we went through a lot together his families from my home I will trust him with my life and I appreciate all the advice and all the Pete's giving me and lastly speaker Austin. Thank you I don't know Mr. Speaker if you remember in 2014 we've all been through some probably most of us in tough elections 15,000 votes I won by 71 votes. I lost my two home counties of tomes in Montgomery and I was decided while I'm a beat guy you know the terms that come in and but I had two new counties of appleing and Jeff Davis and when those returns came in I didn't even think about those returns I was settled that I was beaten and kind of gotten used to it and those returns came in and God bless those people I was going to be a good friend. I was going to bless those people I'll never forget appleing county and Jeff Davis and when those 600 votes came in I'd won by 71 votes. All of a sudden I was as angry as I could be and about that time the speaker called to congratulate me. He said congratulations I don't know if you remember this speaker congratulations I said I'm some add I can't stand it I said my home folks didn't vote for me and this is like getting divorced and having to live with the woman for two more years I said they don't want me and I don't want them. And I remember speaking rostrum said well I've talked a lot of store losers but I never talked to a store winner like you and then a friend of mine walked up and he slapped me on the shoulders I'll never forget God bless Bob Dixon thank you Bob he said you've been hit what are you going to do with it and it snapped me out of it in reflection in a few days I realized that my home folks I was going to be a good friend. I realized that my home folks were right and I was wrong that it wasn't them that was wrong it was me that had stopped communicating and stopped so we got together and settled that and with the help of the speaker and many of you we came back with a full heart one two strong elections and and and got back into hearts of our people thank you speaker rostrum for not letting me quit. I'm going to leave for let me be one of your chairman and I'll tell you this and I'll tell you all this about David rostrum and I'll sit down and we'll get on with the rest of the evening. I said what's the word that's going to find David rostrum and the speaker what should I expect and he said David rostrum is loyal. I said what is David rostrum loyal to what can I expect and he thought for a second he said David rostrum is loyal to three things I know for sure he's loyal to the state of Georgia he's loyal to his friends and what he thinks is the truth. Now what a wonderful thing to have said about you I wish somebody could say that about me but from what I know about in the glern I've learned that is the truth about David rostrum that's who he is. So Mr. Speaker from this point on I won't be after tonight a member of the legislature but whatever you're in and whatever you do whatever fight you're in when the smoke clears I'm going to be lay understanding next day with rostrum I can tell you that right now. So folks this is it. Mr. Speaker for the last time with a very much gratitude God has given me the desires of my heart in every way. So with gratitude some sadness but with a full with a full heart. Mr. Speaker I yield well. Mr. Speaker I yield well. Mr. Speaker I yield well.\n\nChair recognizes Chairman Cooper for a motion. Thank you, Mr. Speaker. Before I ask for this bill for us to accept the Senate, can I just say something? I've known Greg an awfully long time and I didn't know that he was so very funny. Maybe we need to go for reconciliation and not let him go. Thank you. I would move that the House agree to the Senate substitute to House Bill 567. Chairman Cooper moves that the House agree to the Senate substitute House Bill 567. Or could read the caption. House bill 567, my friends, to Cooper, the 4030 being titled an act to amend chapter 12, title 31. The fiscal to George Antietta relating the control of hazardous conditions, preventable disease and metabolic disorders. So as a revised provisions relating to a newborn screening for various disorders. Chair recognizes Chairman Cooper to explain the Senate substitute. Thank you, Mr. Speaker. Ladies and gentlemen, this is the bill that was the one for the newborn screening test. The Senate added provision. One of the reasons why we are always behind on the Maternal Mortality Review Committee reporting. I think they're working on year 2015 now or 2016 is because they have to beg and plead often with hospitals and health care facilities to give them the numbers of mortalities that they've had each year when they requested. This puts the Senate added a 30-day provision. Once a request is made, the facilities have 30 days to respond. And I think the dear Lord, that we do not have huge numbers of maternal mortalities. So it should not be a burden on any hospital, our health care facility in this state, to give us that information within 30 days. I ask for your favorable consideration of the Senate substitute to House Bill 567. Thank you, Mr. Speaker. I yield the well. The lady has yielded the well. On the lady's motion that this House agreed to the Senate substitute to House Bill 567, all those in favor of the motion will vote aye. Those opposed to vote no and the clerk will unlock the machines. All members voted. If so, the clerk will lock the machine on the lady's motion. The eyes are 170. The nays are zero. This House has agreed to the Senate substitute to House Bill 567. The House has agreed to the Senate substitute to House Bill 567. The House has agreed to the Senate substitute to House Bill 567. Chair recognizes Chairman Chokus for a motion. Thank you, Mr. Speaker. I move that we agree to the Senate sub for House Bill 611. Chairman Chokus has moved that this House agreed to the Senate substitute to House Bill 611. Clerk will read the caption. House Bill 611, my representative. Chokus 138 is being titled an act to amend Part 3 of Article 3, Chapter 5 of the Title 50. I think this is going to George Anitator relating to small business assistance. Chair recognizes Chairman Chokus to explain the Senate substitute. Thank you, Mr. Speaker. Ladies and gentlemen, that's a hard act to follow with Greg. I'll tell you. I choked up at that one. Anyway, the Senate sub to House Bill 611, you may recall this was the one where we tear the definition of small business so that when the state does its purchases, we can more accurately pinpoint small business. Ten and under employees, one million is tier 1, tier 2, 100, tier 3, 300. Well, we've added that two other things to that. Section 2 is in an effort to help small business when they develop. We've put the Department of Administrative Services involved in assisting small businesses to be a single source for the different numbers that they need. The Department of Labor, Department of Revenue, Alex Atwood, a former member of this body is in the head of the Department of Administrative Services, and he's going to be charged with assisting small business with a single source for the numbers. Section 3 is a definition for start-up. This passed the House, I mean, we didn't pass the House, but got tied up in rules and wasn't able to get out. Basically, what we're doing is we're defining small start-ups. This will be the, this will be under Title 50, and we will be one of the first states in a nation that actually defines start-up in code. This measure will not only assist George in maintaining its position as the number one state in the nation to do business, but it also show that the state of Georgia is serious about innovation and growing jobs. And with that being said, that's it, Mr. Speaker. If there are no questions, I'll be- There are no questions. I'll yield a well-natured for your positive vote. Thank you. The motion that this House agreed to the Senate substitute, House Bill 611, all those in favourable vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? What purpose does the representative Bowdie rise? He waves. He waves, I'm sorry. If all members now voted, if so, the clerk will lock the machines on the gentleman's motion. The eyes are 167. The nasors zero. This bill having- this House has agreed to the Senate substitute, House Bill 611, to recognize this Chairman Belton for a motion. Thank you, Mr. Speaker. I ask that we agree to the Senate amendment on- It's amended by the House of House Bill 32. Chairman Belton has moved that this House agree to the Senate amendment to House Bill 32 as amended by this House. The clerk will read the caption. House Bill 32- Billton of the 112th annulles to be entitled to amend part 9 of Article 6, Chapter 2, Title 20. The official go to Georgia annulated relating to grants for education programs, so it's establish a teacher recruitment and retention program. Chair recognizes Chairman Belton to explain the Senate amendment and the House amendment. Thank you, Mr. Speaker. This is a bipartisan deal with the tax credit for the very rural schools or the bottom-low 5% performing schools. The Senate amended it by habit. We had a 10-year sunset, we moved it down to a 5-year sunset, and the House amended it by making it an income tax liability maximum. So you can't get over the paid over the amount of money that you have an income tax liability for. However, we have a 3-year movement where you can put that money afterwards. So most teachers make about $50,000, it would have a $3,000 tax liability. However, if it had less than that, we would carry the money forward for about 3 years. How are you? Full questions? You have no questions. Thank you, I hope you fit for your favorable consideration. Any objection to the adoption of the House amendment hearing none, the House amendment is adopted. On the gentleman's motion that this House agree to the Senate amendment to House Bill 32 as amended by this House. All of those in favour will vote aye. Those opposed will vote no, and the clerk will unlock the machines. If all members voted, have all members voted. If so, the clerk will lock the machine. On the gentleman's motion, the eyes are 168th and the nays are zero, and this House has agreed to the Senate amendment to House Bill 32 as amended by this House. Chair recognizes Chairman Hausten for a motion. Thank you, Mr. Speaker. I would like to ask the House to agree to the Senate substitute to House Bill 619. Chairman Hausten has moved that this House agreed to the Senate substitute to House Bill 619, the clerk will read the caption. House Bill 619, the clerk will read the caption. Chair recognizes Chairman Hausten to explain the Senate substitute. The Senate added some language to tighten up the legal description of the 8 acres that we have in question. And if we have no other, if nobody has any questions, I yield the will. On the ladies' motion, at the House agreed to the Senate substitute to House Bill 619. All those in favour will vote aye. Those opposed will vote no, and the clerk will unlock the machines. The clerk will lock the machine on the ladies' motion. The eyes are 166th and the nays are zero. This House has agreed to the Senate substitute to House Bill 619. Chair recognizes Chairman Hausten for a motion. Thank you, Mr. Speaker. I would like to ask the House to agree to the Senate substitute to House Bill 676. Chairman Hausten has moved that this House agree to the Senate substitute to House Bill 676, the clerk will read the caption. House Bill 676, members, and of House Bill 170, others to be entitled to amend. Title II with the fiscal of Georgia annotated with the agriculture, so to create the Georgia Farmers Market and produce terminal development authority. Chair recognizes Chairman Hausten to explain the Senate substitute. If you remember correctly in House Bill 676, we passed bill to make the farmers market and the produce terminal into an authority. Well, it just kind of a little bit more complicated, and so what the Senate did, and they worked with us, is that we have, they passed the substitute making it an oversight committee of the House and a legislative oversight committee of the farmers markets. Members of the oversight committee will be appointed by the Chairman of the Agricultural Committee of the House and the Chairman of the Agriculture Committee of the Senate to try to get some of the problems worked out so we can put them to be more profitable all of the state. And if I don't have any questions, I will yield the royal. On the ladies' motion at this House agree to the Senate substitute to House Bill 676, all those in favor of the motion will vote aye. Those opposed will vote no, and the clerk will unlock the machines. When they get here. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the ladies' motion, the eyes are 166, the nays are three. This House has agreed to the Senate substitute to House Bill 676. Chair recognizes Chairman Allen Powell for a motion. Thank you, Mr. Speaker. I'd ask this House to agree to the Senate substitute to House Bill 466. Chairman Powell has moved that this House agree to the Senate substitute to House Bill 466. The clerk will read the caption. The House bill is 466, but I'll follow the 30 second and others. Any title of next amendment? Chapter 5, or title 40. In Chapter 13 and title 43, the Fisherhood of Georgia and the State are relating the driver's licenses and driver training schools respectively. There is an undisclosed agreement to release theured number of required hours in the intervention component of DUI alcohol. Chair recognizes Chairman Powell to explain the Senate substitute. Thank you, Mr. Speaker. The ladies and gentlemen, House Bill 466 was a clean up bill that we did with DDS and the driver improvement school was earlier in the session. We also did another bell, Chairman Belton's bell, that allowed young adults to join the military to be exempt from having to take driver's education if they joined the military. They combined that, and then the bell we had had originally to change the language of going from 20 to 16 hours for the DUI schools, and they restored that back to 20 hours, as I said, we just hold off on that till we see a little bit more experience, and that's what it does. And I'd appreciate your favorable consideration. On the gentleman's motion that this House agree to the Senate's substitute to House Bill 466, all those in favor will vote aye, those opposed to vote no, and the clerk will unlock the machines. What purpose does Representative Memam dahan rise? Mr. Speaker, presented to Route number 133. I'd like to be excused from the vote. Gentlemen, has that right? And the journal will so reflect what purpose does Representative Prince rise? Mr. Speaker, and according to the rule, House rule 133, I'd like to be exempt from this vote. Gentlemen, has that right? And the journal will so reflect, have all members voted, have all members voted. If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 146. The days are 22, and this House has agreed to the Senate's substitute to House Bill 466. Chair recognizes Chairman Chokus for a motion. Thank you, Mr. Speaker. I move that the House agreed to HB631. Senate's substitute of HB631. Chairman Chokus has moved that this House agree to the Senate's substitute to House Bill 631. The clerk will read the caption. House will 631, by the way, Representative Chokus, 138. And I'll just be entitled to amend Code Section 35333. The fiscal to Georgia and Antony relating powers and duties of the Georgia Crime Information Center. Chair recognizes Chairman Chokus to explain the Senate's substitute. Thank you, Mr. Speaker. We passed this legislation earlier this year, and this legislation allows the local E911 centers to collect information voluntarily given by parents of autistic children. We tightened up the language when it went to the Senate. My request, Michael Nick, the Executive Director of the Georgia Emergency Communications Authority, helped us with the language. And we also named the bill. We named it after the gentleman who brought me this information. His name is Ralph Stewart, and his daughter Logan is 18-year-old, 18-year-old and autistic. And we put in the bill that this bill will be known as Logan's List. So those are the changes. I assume there are no questions. Please vote yes on this bill. Thank you. On the motion of Chairman Chokus, that this House agree to the Senate substitute, House Bill 631, all those in favor will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 163. The nays are zero. This House has agreed to the Senate substitute to House Bill 631. Chair recognizes the majority caucus will represent the Kelly for a motion. Thank you, Mr. Speaker. I move that the House agree to the Senate substitute to House Bill 714. Representative Kelly has moved that this House agree to the Senate substitute to House Bill 714. For read the caption. House Bill 714, the House of Kelly, the 16th, be title, and act to amend Article 8 of Chapter 11. The title 9 is official to Georgia and Teta relating to provisional and final remedies and special proceedings. Chair recognizes the majority caucus will to explain the Senate substitute. Thank you, Mr. Speaker. Members of the House, when House Bill 714 left this body, it represented a compromise between both sides of the bar, the trial bar, as well as the defense bar in terms of how it related to bad faith, offers, and settlements. The concepts of that still represent the compromise that this House put together. But also the addition that the Senate made comes in Section 3. That's a request to chair Lady Oliver, which will give some flexibility for the Court of Fulton County to allow the state Court of Fulton County to chair Lady Oliver. Thank you, Mr. Speaker. Again, this represents a compromise between all parties, as well as some language to help improve things from art as well. And I'll yield the way. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 714, all those in favor of the motion will vote out. Those opposed to vote no and the clerk will unlock the machines. What purpose is representative Wolenski rise? Parliamentary inquiry. Statue of inquiry. Is it not true I still don't know on line 31 what the term itemization means in this. I also pursuant to rule 133. I'll ask to be excused from this vote. Gentlemen has that right and the journal will so reflect. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 116. In the days of 46, this House has agreed to the Senate substitute to House Bill 714. Chair recognizes representative McDonald for a motion. Mr. Speaker, I make a motion that moved to the Senate substitute to House Resolution 130. Representative McDonald has moved that this House agree to the Senate substitute to House Bill 130. The clerk will read the caption. House Resolution 130 by representative McDonald and 26 and others to ratify the action of the Board of Community Affairs approving the transfer for Forsyth County from the Georgia Mountain Regional Commission to the Atlanta Regional Commission. Chair recognizes representative McDonald to explain the Senate substitute. The Senate substitute to House Resolution 130, which is that we are doing a 90 day extension when the bill would go into effect July 1st, the 90 extension, would get us into the census and get our numbers back so that the members of the ARC membership of the House and Senate have to come together in July and vote on its membership just for Forsyth County and it gives us that 90 day extension. Chair recognizes representative McDonald to explain the Senate substitute. On the gentleman's motion that this House agreed to the Senate substitute to House Resolution 130, all those in favor will vote aye. And those opposed will vote no and the clerk will unlock the machines. All members voted. The clerk will lock the machines. On the gentleman's motion, the eyes are 160, the nays are five and this House has agreed to the Senate substitute to House Resolution 130. Chair recognizes chairman Green for a motion. Mr. Speaker, I move that the House agreed to the Senate substitute to House Resolution 142. Chairman Green has moved that this House agree to the Senate substitute to House Resolution 142 to the clerk will read the motion. Read the caption. House Resolution 142 by resident Green 151 and others authorizing a lease of certain state owned property located in Baldwin County. Chair recognizes chairman Green to explain his motion. Thank you, Mr. Speaker. This is our annual conveyances House Resolution 142. The Senate has added two other conveyances to the House Resolution in Decatur County and Fulton County. Speaker, I yield the well. On the motion of chairman Green, this House agree to the Senate substitute to House Resolution 142. All those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted if so, the clerk will lock the machine. On the gentleman's motion, the eyes are 160. The nasor 2, this House has agreed to the Senate substitute to House Resolution 142.\n\nThank you. Chair recognizes Chairman Green for a motion. Mr. Speaker, I move that the House agreed to the Senate substitute to House Resolution 143. Chairman Green has moved that this House agreed to the Senate substitute to House Resolution 143. The clerk will read the caption. House Resolution 143 by resident of Green and Haudenosaunton. Others authorizing the grant of non-exclusive easements for the construction installation operation of maintenance of facilities, utilities, rows and ingresses and egresses on over under and across. Property owned by the State of Georgia. Chair recognizes Chairman Green to explain the Senate substitute. Thank you, Mr. Speaker. This is our annual easement resolution. The Senate has added Carol County, Chatham County and Harris County from the Senate there to our easement. And Speaker, I yield the well. And the gentleman's motion that this House agreed to the Senate substitute to House Resolution 143. All those in favor will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. Only gentlemen's motion, the eyes are 165. The nasors zero and this House has agreed to the Senate substitute to House Resolution 143. Chair recognizes Chairman Todd Jones for a motion. Mr. Speaker, I move that the House agrees to the Senate amendment to the House substitute to SB 59. Chairman Jones has moved that the House agree to the Senate substitute, I'm sorry to the Senate amendment to Senate bill 59. The clerk will read the caption. Senate bill 59 of Senator Albers of 56 and others be entitled back to amendment chapter 2, entitled 20. Mr. Fisher, go to Georgia, I untied it. Related in the elementary and secondary education. Chair recognizes Chairman Jones to explain his motion. Thank you, Mr. Speaker. Colleagues, just as school systems cannot waive civil rights and safety protocols, this makes clear that they cannot waive special needs requirements. Mr. Speaker, that is really the totality of the changes and I yield the well. On the gentleman's motion that this House agree to the Senate amendment to the House substitute to Senate bill 59, all those in favor will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 113. The nays are 51 and this House has agreed to the Senate amendment to the House substitute to Senate bill 59. We have a supplemental local calendar and we're going on to that supplemental calendar at this time. One bill on the local calendar is an agree disagree. Having received a requisite number of signatures required, the House delegation wishes to agree to the Senate substitute to the bill. Two bills on the local calendar relate to homestead exemption and require a recorded two thirds roll call vote. If there's no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. Senate bill 301 by Senator Dugan, the 30th City of Carrollton, Senate bill 292 by House substitute by Senator Pairn of the 42nd City of Decatur. Senate bill 305 by House substitute by Senator Burke of the 11th early county. Senate bill 759 by Senate substitute by Representative Petrie, the 166th town of Thunderpole. If there is any objection to the previous question being ordered on the local calendar, the chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Chair here is none the report of the committee has agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 162, the nays are zero. These bills having received the requisite constitutional majority are therefore passed. It is a traditional that we recognize people who make it possible for us to do our jobs here, not only during session but throughout the year. I want you to help me welcome and thank the representatives from the IT department and staff, Director Gordy Rivers and Deputy Director Michael Bottoms. Thank you. We're going to stand in recess for 10 minutes. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nHouse will come back to order. House will come back to order. Mr. Clark, you want to ring the bell? You know, if some member over there that's getting Peach Ice Cream would remember the people in the clerk's office who are working, unlike y'all, and those up here at the podium who are working, unlike y'all, that would go a long way. All right, we're going on to the rules calendar and the photographers too. This will probably be a good time to recognize our photographers. They've done a great job this year. They've even got a little dance out of one of them. Please help me think Ben Massey and Kate Lamb for a great, great job. Thank you guys. Down here first Bill. All right, we're going on to the rules calendar which is now in your desk. There may be bills out of back. You'll need to check and see, but we're moving forward. Clerk will read the caption to House Resolution 222. House Resolution 222 by Representative Anderson of the 10th, Thomas the 21st, Carson the 46th, Resolution creating a House Study Committee on annexation. This resolution has been referred to the Committee on Government Affairs. That committee recommends that this resolution be adopted by Committee Substitute. Chair recognizes Representative Anderson to present the resolution. Thank you Mr. Speaker. Colleagues, I bring to you tonight House Resolution 222 which calls for a study committee studying annexation with a focus on dispute resolution procedures and cityhood. I ask for your favor, consideration and I yield the well. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair hears none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the adoption of the resolution? The Chair hears none. The report of the Committee has agreed to shall this resolution now be adopted. All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? We are voting. Have all members voted? Clerk will lock the machines on the adoption of House Resolution 222. The eyes are 154. The nasors 0. This resolution having received the requisite constitutional majority is therefore adopted. Clerk will read the caption to House Resolution 11. House Resolution 11 by Representative Cantrell, 22nd and others creating a House Study Committee on innovative ways to maximize global talent in Georgia. This resolution having been referred to the Committee on Small Business Development. That Committee recommends this resolution be adopted by Committee Substitute. Chair recognizes Representative Cantrell to present the resolution. Thank you, Mr. Speaker. Colleagues, I bring to you House Resolution 11 creates a House Study Committee on innovative ways to maximize global talent in Georgia. One out of ten Georgians are foreign born and where this study committee would look at unimportant or unnecessary regulations that are preventing our foreign born population that are here legally from getting meaningful employment. That's what it does. So I appreciate your favorable consideration and with that I'll yield the well, Mr. Speaker. You have a question if you care to yield. It's up to you. Okay. Gentlemen has left the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the adoption of the resolution? The Chair here is none. The report of the Committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. As opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machines on the adoption of House Resolution 11. The eyes are 154, the nasors 0. This resolution having received the requisite constitutional majority is therefore adopted. Clerk will read the caption to House Resolution 52. House Resolution 52 by Representative Dempsey, the 13th and others creating the Joint Study Committee on Childhood Lead Exposure. This resolution having referred to the Committee on Health and Human Services that Committee recommends that this resolution be adopted by Rules Committee Substitute. Chair recognizes Chairman Dempsey to present the resolution. Thank you, Mr. Speaker. This has been a long time coming that it's very important that we look at the effects of childhood lead poisoning particularly. It is not something you hear a lot about, but the reality and the most important fact is that the effects are irreversible. Let me say that again. It cannot change anything once the damage is inflicted to the brains of children. It is lifelong, life impacting, very expensive and robes people of their life. This resolution is simply for a very, very regular study committee, five members, and the appointment also either by the Commissioner of Public Health or for the Commissioner to participate on it. It came with great support from all of those who provide and look into the issues that affected and impact our children. I will tell you, too, most importantly, we've had a pretty special person looking out for our state during this pandemic, Dr. Tumey. This is close and dear to her heart. It is some work that she really would like for us to dig into and see if we can impact that change. If there are any questions, I will take them. Question if you care to yield. Yes. Chair recognizes Representative Jasmine Clark in the gallery to your left for a question. Thank you, Mr. Speaker. Does the General Lady yield? I do. What information do you hope to glean from this particular study committee? Well, I think there are many things to look at. Certainly to increase awareness and education of the impact. To look in the sources of lead, there are certain places in our state, see if there's some remediation that can be done. The historical homes in Georgia particularly in some cases are a problem to lead paint that was used there. Those chips are one of the biggest sources. Thank you. Thank you. Do you further yield? I will take one more, Mr. Speaker. Chair recognizes Chairman Darley and Taylor. Yes. Do you write for a question? Yes. Thank you for bringing this bill. Lead exposure has been affected to members of my family and actually lost a baby because of it, so I appreciate it very much. Thank you. Thank you. Thank you, Mr. Speaker. I yield the will and ask for everyone's favorable support. Is there any objection to the previous question being ordered? The Chair, here's none. The previous question is ordered. Is there any objection to adopting the substitute offered by the Committee on the Rules? The Chair, here's none. The Rules Committee substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the adoption of the resolution? The Chair, here's none. The report of the Committee has agreed to shall this resolution now be adopted. All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House resolution 52, the eyes are 158, the nays are zero. This resolution having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 20. Senate Bill 20 by Senator Payne 54th, mollus of the 53rd, and others to be entitled to amend Article 11, Chapter 11, in Title 15. The official go to Georgia, Antaterlady, and the Georgia Child Advocate for the Protection of Children Act. So as it revives the composition of the Child Advocate Advisory Committee, this bill ever refer to the Committee on juvenile justice. That committee recommends that this bill do pass. It recognizes Chairman Ballinger to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, this adds three positions to the Child Advocate Advisory Board. One appointed by the Speaker, one by the Lieutenant Governor, and one by the Governor. It will foster parent or foster child and one Casa. Mr. Speaker, that's the bill, and I'll yield the well. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 20. The eyes are 156. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 174. Senate Bill 174 by Senator Gouge, the 51st, the 53rd and the 53rd. And others being titled an active men article, one in Chapter 6 and title 17. The fish go to Georgia, Antietta relaying the general provisions regarding bonds and reconnaissance. So as to authorize appointed judge who are fulfilling a vacancy of elected judge, to issue an unsecured judicial release on the certain circumstances. Let's go over further committee on. Judiciary non-civil, that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Sains to present the bill. Thank you, Mr. Speaker. Our state has led in modifying and updating our criminal justice system and many provisions we've benefited from. One unfortunate tool that's been overused and abused by some counties in this state is the unsecured judicial release very commonly referred to as a signature bond. It reminds me last term, a very wise chairman was talking about our system of elections. And he said the pen is the easiest thing to make a ballot misused. And to that point, a signature bond is only backed by that pen, that person signature. It's found to have increased recidivism. And it's most importantly a miscommunication to the public that individuals committing felony level serious crimes are being held accountable because that signature, though, is backed up by no monetary value. For some reason, to my conclusion only to mislead the public and what it does, has a money amount attached to it. So that $50,000 is used for nothing. Just from the data that we have from the previous year in a major Georgia County, 38 counts of murder were utilized for a signature bond. I could go on in the list with the hours late. Again, this does nothing. People are going to say it's going to change judicial discretion. It doesn't change a judge's ability to give a $1 bond if they would like to. But it makes sure that our public officials and the judicial branch are accountable for those actions, so that because the public can see it, with that Mr. Speaker, I'll yield for one question. Chair recognizes Chairman Fleming to your left for a question. Thank you, Mr. Speaker. To the gentleman in the well, I'll let you know that I appreciate you work on this very valuable piece of legislation. That by adding the crimes of burglary stalking, family violence and auto theft, this will do something to help the situation that we're currently involved in, where crime seems to be out of control, particularly here in the metro area. I completely agree to the Chairman's wise assessment. Those crimes, there's no more time than this, that those crimes are more pertinent to the citizens of this state. And we must do something to crack down on this. This will reduce the recidivism from that. Thank you, Mr. Speaker, and I yield the well. Gentlemen, as yielded the well, there is a minority report. There is a minority report on this bill. Chair recognizes Representative McLaren to speak to the minority report. Speak 20 minutes by rule. Thank you, Mr. Speaker. This bill is about cash bail. This bill is an expansion of the cash bail project that George and many other states are on, which is to use money as a determinant, a person's ability to pay, of whether they should be held in jail pre-trial. I can't stress this enough that this is about pre-trial detention. In this country, you're innocent until you're proving guilty. We know that. So this is a question of whether people should be required to pay money to get out of jail before they have been adjudicated guilty. That's where we start. I want to correct a couple mischaracterizations from the well. First is that unsecured judicial release is not the same thing as a signature bond, which I'll get to in just a second. Second is that this bill is not just about felonies. This expands the use of cash bail in misdemeanor cases as well, mandatory cash bail. I'm sorry, I'm just a little distracted. This is one of the issues that matters most to me, and that's why I keep coming up here to talk about criminal legal stuff. But I guess what I should do is just sort of jump into the story on this, because we did not get a chance last year, or last term when SB 402 was passed to really dive into what was going on in this bill. SB 402, I think, is one of the worst bills this body has ever passed. And it wasn't just the substance of the bill that bothered me, it was also the process. There was some miscommunication between members about who was going to speak on the floor and whether all the right arguments would get made. And so I think what ended up happening was this body expanded the use of cash bail without actually knowing exactly what it was doing. So I intend to clear that up tonight, and I apologize if it's too long-winded. I can tell a lot of members already feel that way. Bond decisions should be about public safety. Public safety, not the ability to pay, and that has two factors. One is whether the person poses a flight risk if the judge lets him out of jail. The second is if the person is likely to reoffend while they're out of jail. Those two factors, I've done bond hearings and criminal cases myself before, although it was not my primary practice, that's what public safety determinations pre-trial should be about. And why? Because you're not convicted yet. You're not adjudicated guilty. So the only real liberty justification, or talk about somebody's liberty that a judge can have to lock somebody up before they're adjudicated guilty, is to determine that they're either likely to reoffend or they're a flight risk they won't come back to court. That's what those decisions should be about. It used to be before SB 402 from last term that there were basically three options for bond. And I'll refer to those as sort of green light, yellow light, red light in terms of severity. Green light was you could be released on your own recognizance, which means you just sign a form and you come back. There was a misstatement from the well just moments ago that that's the same thing as a signature bond. A signature bond is what I would call a yellow light. Signature bond means that there is a cash bond imposed so the judge might say $100,000. But you don't have to pay that unless you don't show up. So it's not a secured bond meeting. You don't have to put any money up up front. But you have to say I will pay $100,000 if I don't come back to court. And then you got the red light, the most severe version of bond, which members of this body, some members who didn't explain to you the full story prefer, which is a cash bond that's based on or it's secured. You have to give money up front. You got to put the skin to the game on the front end in order to get out of jail. And that is wealth based detention. That's the idea that if you can't pay, you stay locked up. But if you're the rich guy who beat his wife, domestic violence and you can pay, you get out of jail. There's that disparity. So those were the three options. SP402 took out the middle option. It said there are no more signature bonds anymore for any crime in Georgia. There are a bunch of judges who wrote us a letter and said we're really worried that y'all are getting rid of signature bonds. That was on everybody's desk. So then you've got two options left. You have the honor cognizance where you just sign and then you have the red light secured bond, higher the bail bond company to help you get out of jail. Those two options. And we didn't stop there. SP402 did something else. It renamed the OR bond. Unsecured judicial release. Why? Because those are scare words. Unsecured? Judicial, it's the judge doing it. Don't forget it. Release. They're out in the community. They're going to come get you. By calling this an unsecured judicial release, we started down the project that you just heard the representative speak about, which is improving this concept of transparency or accountability, which I'll speak more about in a second. But that was what SP402 was ultimately about. Take out the moderate option, squeeze two extremes, and then use scare words and the threat of not being reelected to force elected judges into this red light pathway so that they impose as restrictive as possible bond conditions. And members of this body to their credit, I respect my colleagues. They don't hide from them. They don't hide from them. That is what the purpose of the bill was. What SP402 essentially did was mandate cash bail for all bail restricted offenses, which is a list you have in your bill, 174. But all others could get the unsecured judicial release. Now what was SP402 a reaction to? Why did this happen? Because we talked about deal administration criminal justice reforms. We don't just ratchet it up just to do it anymore. That's not cool anymore. Now we got to have good reasons why we increased the severity of our criminal legal system. Well the reason given was, and this is where I start to get a little jumpy for give me. I'm from Fulton County. This is a Fulton County bill. This was about the Fulton County jail. Now other circuits get mentioned, but every time we went to committee and something got dropped in front of us, a bail decision, bond determination, it was a Fulton County judge. Because ultimately what people were upset about is that Fulton County judges were letting people out on the yellow light option, signature bonds, when the list of charges like, you know how committees work, you take a piece of paper that's got 18 charges and say, look with this judge, did they let them out. But we never met the person. We don't know the judge. We don't know the situation. So we're just making these categorical determinations about whether we think these judges are screwing up their discretion and then we take away their discretion. So SB 402 was meant to solve this Fulton Judge problem, but why was there a Fulton Judge problem? Gosh, what I love hearing on this. Fulton jail was overcrowded. Why was Fulton jail overcrowded? Hey, you know, capacity of the low 2000s, right? There were several hundred more people that needed to be there. But why was it overcrowded? You all remember the DA that used to serve Fulton County? I know members in this body like referring to him sometimes in debate. Well, he made charging decisions that even Democrats didn't like. Too many charging decisions, aggressive charging decisions. He was a political prosecutor in every sense of the word. Now he's not there anymore. But he filled up that jail. I toured the jail. Before COVID, people sleep in plastic boats out in the floor. People crowded into dormitories without a better solution for how to hold so many people. Living conditions were in some cases subhuman. When you're a Fulton Judge and you have this crisis of humanity happening in your facility, your jail, and you recognize that adding one more dumb kid to this jail is going to increase the severity of that crisis. Let me tell you what some Fulton Judges might have been guilty of. They might have been guilty of believing in a little bit of humanity. They might have been guilty of believing in second chances and saying, all right, here's what I'm going to do. I'm going to let you out on a $100,000 bond, which means if you don't show up to court, I'm going to slam you with this $100,000. But until then you don't have to pay because I recognize after seeing your family and court crying and I recognize after seeing you and how pitiful you look and how dumb this decision was, you can't even afford the $500 that I would impose as a secured bond requirement, right? That was what those judges did to avoid crisis. Well this body decided we want to take that away because we want judges to be held accountable for their bad decision making. And not only that in a way that criminalizes poverty by allowing the rich guy out and keeping the poor guy in. You may hear that a judge could always issue a $1 bond because it's secured and that's the only requirement, but judges would never do that. The former chairman of the judiciary committee had a hearing on this and the reason it was in Judy was because the judiciary non-civil committee didn't want to touch this quite frankly. And a representative colleague looked at this bill for the first time in Judy the last minute because the guy out at the end of the session last time and he said, my former colleague said, well, judge would never give a $1 bond. That's not a realistic option. And the chairman, the former chairman of the judiciary said, that's exactly the point. He said it on the record, all of the other arguments about $1 bonds, why not that we've heard last term in this term, it's deflection, it's a straw man. No judge who's elected is going to give a $1 bond. And think to yourself, what would that even do? What does a $1 bond do to improve public safety? It's never going to happen. No, what we're talking about is the elimination of non-cash bail options enforcing more and more offenses, more and more judges down this road. It was always about optics. But on the floor debate, Bob Tramble thought he was going to get help, y'all. He gave a very short speech and he did not cover the points I just covered. Someone else was going to do that and didn't happen. I just want y'all to know that. I talked to members on the floor beforehand and people understood these arguments. They understood the needlessness of the severity of these bail options just to punish full and judges. They got it. But the floor debate never fared at that out. And we passed that bill. Now let's talk about SB 174. This bill expands the number of offenses within that flawed SB 402 framework. It's not just a couple of burglary family violence. There's a slew of family violence offenses. Now, while these are misdemeanors, so again mischaracterizations, not just felony, we're taking away judicial discretion on misdemeanors as well. And the argument that making, that they're making, is that family violence offenses must be given cash bail. But what they didn't say is a law was changed a few years ago to require all of those charges to go before a judge because the nature of the cases. So even if you're pressing the family violence button here to say this is so important and I agree it is, those people already have to go to it before a judge before they're released. So even if you don't buy my story about SB 402, we don't need 174 for these family violence cases. Ultimately, we are deepening and widening this state's unhealthy sick dependency on cash bail, a system that is under attack nationally for being an unconstitutional criminalization of poverty. And I held my powder on that last term because I had assurances for people on committee. This is a one-time thing. This is not a cash bail bill. It is becoming a cash bail series of bills that stretches out indefinitely in the opposite direction as the deal criminal justice reforms that we have been so proud of. This bill is about fear. It's about making judges afraid again. Let me describe an approach to policy making where every decision-maker is scared. He's scared of crime, de-scared of undercharging, judges scared of making unpopular bond decisions. What do we get? Check your AJC. Fulton jail? It's going to be expanded. New sheriff, $400 to $500 million expansion of the jail. He's a Democrat, but why is he doing it? Because how else do you release that pressure? The pressure that we have tightened with SB 402 by forcing judges to do the exact opposite thing that they should be doing in response to that pressure, which has thrown more people away. We keep the fear, we spend more money, and we keep pouring gasoline on a fire, taking people's opportunities to serve in their jobs, to take care of their families, to be pretty-\n\nto members away during trial because they can't pay to get out. And you know that's racially biased and I don't even have to get into that because you understand that the income disparities, wealth disparities, track racial disparities and so that's ultimately what we're doing to black and brown people too. So who is it that wants this? Leader Tramble did get to this last term. It's the cash bail industry. They make money when people stay in jail. Well, let me describe you a different world and this is a world that's going to take many years for us to get right. Community understands that crime is a result of a number of complex factors. DAs with vision like our newly elected Fannie Willis make charging decisions that are in line with that understanding and the interest of rehabilitation. And judges make decisions based on public safety based on the person in front of them and not based on how much money they have. That is the world I want to live in. What is the world that I'm risking pissing you off late on signing die to tell you about? From the bottom of my heart. And if you agree with me even a little bit on any of that, please do your part tonight. Please vote note SB 174. Mr. Speaker, I yield the well in minority yields rest of its time. We're going home now to the chairman's time. Chair recognizes chairman Bershitt for the chair's time. Thank you, Mr. Speaker. Let me start by saying I respect my colleague and I think he would even say that we had a healthy debate on this bill in committee. And so I appreciate you, Representative McCorn. This is where we differ. This is a policy decision in my opinion and it's a personal responsibility bill. Do we want to make these folks responsible to come back to court? Because more than 26% of them, when they're released without any security, are not even coming back to court. And that's the whole impetus for the bill. The fact of the matter is that these are some pretty rough crimes. If you read the bill, let's run through some of them. Aggravated assault, aggravated battery, aggravated stalking, child molestation. And so what's happening with these unsecured releases is a judge may put $250,000 on the bail sheet, but not take any money whatsoever. There's no reason for this person to go back to court. We heard in committee testimony that a defendant was arrested and released the same day and gets re-arrested and released again on an OR bond or a signature bond or unsecured bond. It doesn't matter what we call this. This is just wrong. This is a, we have laws for reason folks and these are some of the most severe laws we have on the books. I understand the perspective of judges wanting to be able to have that discretion to release and we're not taking that discretion away from them. My colleague said that it's not a real argument to say that they can issue a $1 bond, but that is a real argument. So you ask yourself what's the difference between issuing a $1 bond or issuing a piece of paper that says $200,000 and not given any security? What's the difference? There is no difference. The judge is covering himself or herself. They're saying, well, I've issued you a $250,000 bond for this, you know, robbery, definitive robbery, definitive kidnapping, definitive rape. I've issued $250,000, but in actuality, there was no security whatsoever. This person can go on the free way, no punishment whatsoever. I agree. They're not indicted yet. They're not charged guilty with the crime, but the fact of the matter is this is not even a slap on the wrist. This is a revolving door. You get charged with one of these. You walk in there, you say, judge, I'm sorry, sign my name, walk right out. I think my colleague also mischaracterized the cash bond system. As far as I know, cash, the cash bail folks, they don't make money with people in jail. They don't make money when they bond them out. The fact of the matter is this is just a bill that is, it's a personal responsibility bill. We've added, we've expanded it to burglary. I think if you burglarize someone's home, you should be held to coming back to court and listening and serving your being adjudicated. I want you to come back to court and be adjudicated. If you're found not guilty, then go on your way. If you're found guilty, then you have to pay your debt to society. We've added on entering automobiles. I think everybody in this chamber can at least agree with me that we are having a severe issue with entering automobiles and automobile crimes. This is a common sense bill. This bill expands to family violence. Family violence is some of these are misdemeanors. They are misdemeanors. But I think we'd all agree that if a party, a parent, batters their husband or wife, do we just need to let them come into the jail and say, Judge, I just want to sign and come out. We're going to make sure they're going to come back and be adjudicated. I wanted to respond to a few of these other things. There's a litany here. But it was characterized that you have to hire a bail bondsman. You do not have to hire a bail bondsman. You can property bail. You can have a relative or someone else bail you out. Put up a property bond. It's also what's characterized is this is ratcheting up the severity of punishment. This has nothing to do with punishment. This has to do with where you are and where you have to return to before you are adjudicated. It has nothing. We're not ratcheting up the penalty. We're not saying that you're going to be a more severe penalty. We're just saying that we want you to return to be adjudicated for an answer to whatever it is you're charged with. I think that's everything on my list. I think that this is just a, we have a difference in policy decision here. Do we think that we should require folks to come back after they've been arrested and face adjudication or should we just let them come in, let them sign out and keep coming in and out, revolving door. I'm just asking you to favorably consider this. I appreciate everybody's time. Appreciate my colleague coming to the well. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Chairman not rise? Probably maybe. I'll take your inquiry. Isn't it truly not an attorney, Mr. Speaker? I think that is absolutely the truth. Mr. Speaker, for an honor attorney, wouldn't SB 174 help with the continuing rise in the crime that it is being experienced here in Metro Atlanta that's plugging citizens and its businesses? Well, I think that each member is going to have to determine that for themselves, but I think the author of the bill, who was in the well earlier, believes that it would. What purpose does Representative Tyler Paul Smith rise? Parliamentary inquiry. It's a state year inquiry. Mr. Speaker, isn't it true that the city just issued a report that within the last two years there's been a 132% increase in failure to appear by individuals charged with these type of violations in this city? The gentleman so states. All right, have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 174. The eyes are 99. The knees are 71. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes Chairman Martin for a motion. Thank you, Mr. Speaker. I move that the House agree to the Senate amendment to House Bill 617 as amended by the House. Chairman Martin moves that this House agree to the Senate amendment as amended by this House to House Bill 617. The clerk will read the caption. House Bill 617, members, and Martin of the 40s, 49th rows of the 120th, Fleming of the 120th, and now this has been titled an act to amend chapter 3, the title 20 of the 50th of Georgia Antietta, really, in the post-secondary education. So, it's a survive that student athletes participating in intercollegiate and athletic programs at post-secondary educational institutions may receive compensation. Chair recognizes Chairman Martin to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen, this is the bill, the name, image, likeness bill for our student athletes so that they can be fairly compensated after a train. The Senate added an amendment to allow the team contract to provide for a pooling of the funds if they so chose that athletes could contribute to and it could be spread across the team. It also added an effective date for the bill and that is what we're amending. That's what you have on your desk. So, as I told you, we would be back when we had more information on how the bill should trigger and that is what you have at AM 49, 0, 0, 38. This will perfect the bill and put it in place for our student athletes. Mr. Speaker, there are no questions. I'll yield the well and ask for the favorable consideration. You have no questions. Is there any objection to the adoption of the House amendment? The chair here is none and the House amendment is adopted. On the gentleman's motion, that the House agree to the Senate amendment to House Bill 617 as amended by the House. All those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. If all members voted, have all members voted, if so, the clerk will lock the machines. On the gentleman's motion, the eyes are 163. The nays are five and this House has agreed to the Senate amendment to House Bill 617 as amended by this House. Chair recognizes representative Gullet for a motion. The motion to agree is amended by the House for HB 334. Representative Gullet has moved that this House agree to the Senate substitute to House Bill 334 as amended by the House. Clerk will read the caption. House Bill 334 by the House of the 19th and others to be entitled to amend Article 2, Chapter 6, the Title 15 and Article 1, Chapter 17, the Title 45, the official code of Georgia annotated relating to clerk's superior courts and general provisions regarding notaries public. Chair recognizes representative Gullet to explain the Senate substitute and the amendment. Thank you, Mr. Speaker. Senate substitute 334 was amended pretty drastically. Not just to remove real estate, but to remove a number of key sections which made the bill unworkable. What we've done is amend it to put it exactly back the way we passed it here in this House. I think it was 156 to 2 and I ask for your favorable consideration. Gentlemen, as yielded the well, gentlemen's motion to the House agree to the Senate substitute as amended to House Bill 334 as amended by the House. All those in favor will vote aye. As opposed to vote no and the clerk will unlock the machines. What purpose does representative Jasmine Clark rise? How much do you waves? Have all members voted? Have all members voted? So the clerk will lock the machines. On the gentleman's motion, the eyes are 162. The nays are three and this House has agreed to the Senate substitute to House Bill 334 as amended by the House. No, I want to go to the Senate bill 120. Senate bill 120 by Senator Tipens of 37th Kennedy, 18th, Council of 46th and others. To be entitled to act two men, Article 3, Chapter 18 to Title 15 is the fiscal to George Annotated Relayment, the solicitors general of state courts. So it's a provide for the honorary office of solicitors general emeritus. This bill ever further, Committee on Judiciary, that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Eftration to present the bill. Ladies and gentlemen of the House, Senate bill 120 that's before you is not as the caption appears. What happened was we've stripped this bill in House Judiciary and we put in language from House Bill 333, which is the Ethics and Government Act, which was requested by the Georgia Ethics Commission to address several gaps in the law. There were some changes that we had worked on as the bill came out of the House, which were included in a substitute presented in the Senate Ethics Committee. There's also provision in here, which was brought about in the Senate rules committee, which is part of this bill as well. I know the hour's late, Mr. Speaker, I'll be happy to answer any questions if there are any. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill. Will vote aye. Those opposed will vote no and the clerk will unlock the machines. The purpose is representative Jasmine Clark rise. Thank you, Mr. Speaker, Parliamentary. Say true inquiry. Is it not true that I am voting no on this bill because I do not have a copy of the bill? All copies of the bill should be outside the door as was announced earlier. Further inquiry, Mr. Speaker? Say true inquiry. I have gone to that table multiple times and I am not seeing a number of the bills that we have voted on for the last three votes. Is it in the book? Well I think a no vote would be the appropriate course of action and we will check to see, make sure that if there is an error that is corrected. The bill of all members voted, if so the clerk will lock the machines on the passage of Senate bill 120. The eyes are 150. The nays are 20. This bill having received the requisite constitutional majority is therefore passed. To read the caption to Senate bill 164. Senate bill 164 by Senator Huffsteadler, the 52nd, Karpatrick, the 32nd and others to be entitled an act to amend Code Section 1511471, Title 16 in Code Section 31229.1 of the fiscal go to Georgia annotated relating to definitions relative to juvenile delinquency crimes and offenses in whom they perform HIV test respectively. So it's a provide for the modernization of HIV related laws. Chair recognizes Chairman Cooper to present the bill. Thank you Mr. Speaker. Ladies and gentlemen of the House in 2019, the House passed the exact bill that is found in the Committee on Rule Substitute 164. The only difference is that the rules committee, the House rules committee in Section 4 added any prescription drug that is approved by the United States Food and Drug Administration shall be excluded from Schedule 1. Such prescription drug shall be designated rescheduled or deleted as a controlled substance pursuant to Code Section 161322. That is House bill 601 which was added to it. The other is finally a modernization of our HIV laws to bring them up to date to what we know scientifically about this once deadly illness that we now have drugs that make it possible for people suffering with HIV to live long lives. Mr. Speaker, there are no questions. I'll yield the well and ask for a favourable vote. I have questions but the lady has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the substitute offered by the Committee on Rules? The Chair here is none. The Rules Committee substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favourable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. What purpose is representative Ken and Ryes? Parliamentary. Is it not true that members who support those living with HIV are so proud of this bill passing and would like to thank everyone for their support today? If the lady so states, if all members voted, have all members voted, if so, the clerk will lock the machines on the passage of Senate Bill 164. The eyes are 171. The nays are zero. This bill having received the requisite constitutional majority is therefore passed clerk or read the caption to Senate Bill 156. Senate Bill 156 by Senator Harbourn, the 16th, Tippen, the 37th, Lucas, the 26th and others being entitled to amend and title 34 of the fiscal to Georgia and the Tate of Related and Delaboring, industrial relations. So, some of the vies for the appointment, both on power, duties and authority of a chief flavor officer, this bill ever further the committee on industry and labor, that committee recommends this bill do pass by committee substitute. Chair recognizes representative Kirby to present the bill. Thank you, Mr. Speaker, and I know that ours late, so we will very, very brief. I bring to you, Knights, Senate Bill 156. So, one we talked about on Monday, and we decided to be reconsidered. Often I don't like that, but in this time it gave us a chance to add some things that are extremely important. And I want to thank the minority whip, Representative Wilkerson for using his house bill 583 to add some other requirements to deal with unemployment that was a real concern of this body. So what this bill does now, it requires that we, we're going to give the Labor Commission some help for a year. Somebody to do the reports. I actually have the actual audit, the state audit right here. I can show you some of the details, but I don't want to go into it tonight. That will sunset after a year. The other thing this bill coming from 583 in the minority whip's bill originally, the Commissioner will now report unemployment claims status to the Speaker, the minority leader, the majority leader, both here and in the Senate's, every week on Mondays. They will tell you what claims are, what claims have not been filled. So talk about those claims where you have gotten those calls and you've gotten involved tell them and do a report on where they stand now. We're going to hold them accountable to make sure they're progressing and we're getting information that we can get back to our constituents. And I thank you and I thank Senator, Representative Wilkerson and with that, Mr. Speaker, I will yield the well. The gentleman has yielded the well as there any objection to the previous question being ordered. The chair here's done the previous question is ordered. Is there any objection to withdrawing the committee substitute, the chair here's done, the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee own rules? The chair here's done the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adipers, to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 156. The eyes are 142. The nays are 22. This bill having received the requisite constitutional majority is therefore passed. We'll read the caption to Senate Bill 46. Senate Bill 46 was Senator Berkeley, 11th Watson, the first hatch of the 50th and others. He titled an act to amend Title 31 of the physical to Georgia and Tate of Relating Health. So it's authorized certain medical personnel to administer vaccines during public health emergencies. This bill I've referred to committee on health and human services. That committee recommends that this bill do pass by rules committee substitute. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, this bill contains this substitute, contains three bills. First of all, it contains House Bill 275, which gives people who have committed felonies and have served their sentences and not gotten into trouble a chance to become firefighters. It also contains Senate Bill 450, which is a way for us to study from the marijuana registry. What happens with the patients that when we get that system set up are taking marijuana and to take care of their illnesses? So those are the two bills that were added in the rules committee. The main bill of 46 is the one that you've heard much about and I want to clarify for you. It's about the vaccines. And the questions that arose were mainly and are found on page 11 of this bill. It has been the policy of public health for years that they were able to give information without the parent or persons permission without to health departments, hospitals, child care facilities and schools. The wording on that was very confusing. So we have re-wordened it and it says number one, unless such person has opted out pursuant to paragraph two of this subsection, individuals individually identified vaccine information regarding a person may be provided to the department or released by the department two. And as I said, health department hospital physician or other medical services or for a school or child care facilities. In section two, underlined and very specific, any person or person's parent or guardian, if the person is 18 years of age or younger, may request an exemption from enrollment in the statewide vaccine registry. I have a copy of that form right here. If someone wants to opt out, they fill out this form and on the form it tells you that what they will do is any information.\n\nand they have on you will be totally scrubbed except there is some way they have to code it so that they know never to put any more of your information or your children's information into the system again. Now that's how one of the questions. The second one has to do with something extremely extremely important we are in the middle of a COVID crisis. We are going to get out of it by having more and more people get vaccinated. The way we get those vaccines is that the federal government has made us turn over data to the CDC on the people who get vaccinated. Not their names and it's a very specific and section C of this bill it says that goes to you know to the United States Department Helens Human Services and it's subsistence said there is a here and to state and federal privacy laws and so long as a person's name is not provided to the department what happens if we put and send to them the information that we have given 100,000 vaccines then that determines whether we'll get another 100,000 vaccines to give out. That is why it's so important that we have this if we do not report this information to the CDC then that will cut off our vaccine supply. Now the data does not contain a person's name there is no way to identify the person it has a birthday a zip code it may it says which kind of vaccine that you got the kind of information that the CDC studies but with no identifiable information on the person and you can even opt out of that if you don't want that information to go you get one of these forms and you send it in and you can even opt out of that part so what it would mean if if there were 100 people 105 people that had gotten the vaccine today downstairs and five people opt out and 100 didn't care when that information goes to the CDC we would be eligible for 100 more vaccines and we would not get extra vaccine for the five people that opted out that is how it works that is what it is and I would ask for your favorable consideration of this bill because it is critical that we be able to continue to get a vaccine supply to try to stop this pandemic if there is no questions Mr. Speaker I will yield the well there are no questions the chair recognizes representative Davis to speak to the bill thank you excuse me I'm out of breath I had to run down here from upstairs I think excuse me I could have very easily just stayed up there because without a doubt you already have the votes to pass this but I am so adamant about informed consent that I said I need to come up here and tell you a little about me I started off in healthcare as a pre-med major couldn't afford college work part-time jobs and so forth and number of us is what you would say on the 10 year plan you work a little you go to school you work a little you go to school my family didn't have the money this paid for me to stay in school all the time so I had to go into the military enter as a private 92 Bravo worked as a lab tech and when you go as a lab tech oh it was fun you could assist with autopsy I won't go into detail but then you also could do for about me you could go and draw blood and I'm gonna tell you I fell in love with going and working with the living now that's not to say anything bad about those who work with the dead I don't want representative to get on me all of us have our passion I spent those years as a private and then the military said be all you can be sent me to college to finish up at the medical college of Georgia to be a nurse started off in nursing doing elderly care moved on to do message and low-embehold somebody's motivated me to go into critical care and I worked critical care over 25 years I trained a number of nurses now I did a lot of research too see when nurses have to collect that data see you need us to make that research mean something now I'm gonna tell you the truth there's a number of those research projects that I was kicked off of and the reason I was kicked off of is because I'm adamant that if you're gonna do something to a patient they need to be fully informed about what you're doing all right so now I said I have to come and speak on Senate bill 46 and why see the Senate passed Senate bill 46 favorite word of 18 do anybody know how important favorite word of 18 this you all should know it no it's not your birthday now favorite word of 18 was a Thursday see here at the Capitol we have to do the COVID test twice on Monday and on Thursday now on Thursday many of you should remember because when you went in your phone to do your code it said you was gonna have to update your informed consent now all of us didn't inform consent in order to do our COVID test but that particular day you had to update your informed consent so I went and I said you know I need to see I can't I can't see this writing this too small do you have a paper so I can read it they didn't have the paper I said can you pull it up on a computer because I need to be able to see it they didn't have that then my red light went off because I know the tricks of the trade what you do is when you want to pretty much motivate people to go ahead and give up their consent you do it on a day which is their last day so I said oh oh this is the last day that I'm supposed to do this test and you want me to upgrade and I don't know what is in the document no I'm not gonna do the test I'm gonna go back to my office I'm gonna pull up this document and I'm gonna read it very carefully I pulled it up and pretty much it was pretty basic it was like our informed consent that we initially signed but I went further down and they said oh well we're gonna test for the different variant types of the virus you know those new kinds that have come into America and I said whoa that's great we need to know if there's some different variant types of that virus here now mind you if you read a little bit lower you would have seen that oh they're gonna tell the regular I mean you're gonna tell the local government you're gonna tell the state government in the federal but the people were not going to tell and they said we're not in bold letters of the volunteers and who are the volunteers it's us I said wait a minute I'm not gonna give you my informed consent so that you can know if I am positive for one of those variants and then you tell everybody local state and federal government but then you don't tell me there was not a button there for me to say I do not consent so I printed it up four copies I went and I did a pen and I wrote on that piece of paper I would have had a copy but when they took it off and sent it back to rule 46 I thought they weren't gonna bring it up so I put on my paper or what but I have the actual copy if you want to see it I wrote in writing I do not consent to you tested me for the different variant types of the virus and not telling me I want to know and then I signed my name and I put February 18th on it I turned it in or at least I tried to get it I took it downstairs they wouldn't take it I gave a copy to my leader I came on this floor to give a copy to the speaker they said no we're not taking that that needs to go that's totally separate it's for the college but there was nobody at the college that would take it so they went and they called the attorneys and attorneys for whatever reason nobody would take that form and that's informed consent and I said well wait a minute I can stand here as clear as day and I can guarantee you over three fourths if not 90% of you went ahead and hit that button you did not read this in form consent because if you came up positive with one of those variant types of that virus you won't want your loved ones to know you will want to go back you wouldn't want to take that back to your family I'm a critical nurse working with people with disease that has no cure it's nothing new to me wearing this mask all day working welcome to my world this is informed consent and they were able and don't take this the wrong way to trick that's may not be a good word no that's not politically correct mislead this house and now you getting ready on that same day you put it in law and they say well oh it's just a fire I mean we're just going to get the information no this is about informed consent then they say well well look it was already in the law that don't make it right that made me we need to change the law and we are adults there was three places in this law in which first you three areas what they talked about without the consent of the person or the person's parents are guardian you don't want the parents in the guardian to know about their children under the age of 18 is this a conservative bill I'm gonna sell out something here oh and here's another good part in the initial form you had declared public health emergency go look at the new one declared has been removed now why would they remove declared because when you declare a public health they have to come to the legislative body to get permission now we don't want to discuss the trickery that we went on when we did that now do we we wasn't supposed to have it where we could have removed that power from the governor y'all put all your signatures on a piece of paper and then when it was time for us to exercise that you didn't even you didn't even submit the paperwork and form consent and then last but not least you have the registry the vaccine registry don't y'all have a number of conservatives right now test ties in our president on vaccine passports somebody better educate them that Georgia is doing vaccine registries y'all have the power to do this anyway you want to but I want you to know I'm not talking to you I'm talking to the employers of this government and who are the employers they're the taxpayers and voters that hire and fire us with their vote and pay us with their tax money I want the employers of this government to know how there's an attack on informed consent the question you need to ask is will the taxpayers and voters be as forgiven as many of us were or many of you were when you were fooled about informed consent Mr. Mrs. Madam Speaker I yield the well I know that the time is late the lady is yielded the well the chair recognizes representative night to speak to the bell you might have speaker that this is late and some believable house bill 260 has been back and forth so many times but apparently via the last speaker it's apparent that nobody's reading the bill first of all to the members of this body I want to make sure that you understand that this is not about covid testing and consent to covid testing read the bill it's about voluntary vaccination voluntary vaccination so what you just heard about testing has nothing to do with what's in the bill so I want to speak to sections 8 and 10 and I'm going to try to be brief what this bill seeks to do is make sure that part 10 that the pharmacists and nurses can continue to give vaccines across this state but this bill is back and forth because there has been questions brought up about privacy and many of you know that that's very dear and near to my heart some of you may remember night in 2019 I introduced and passed with your support legislation that protected patient data from pbms and insurance companies data mining patient health care for profit so it's very near and dear to my heart patient privacy so when this bill came over from the Senate I too had concerns and had calls for my constituents about privacy so I'm going to stand here before you today as someone who believes that increasing access to care and protecting privacy I can tell you that this bill with the work that has been done back and forth from the rules committee to get this right this now accomplishes that mission we've heard a lot of concerns about this bill some legitimate and obviously some not but first of all this bill never ever mandated a vaccine period period and I've also heard concerns that this bill will hurt patient privacy and hurt patient hip or rights under the federal law this bill with the changes that have been made not only protect privacy rights under the HIPAA it affords a far more privacy protection than HIPAA does we listened concerns were heard and this is gone from the bill this gone from the bill with loose privacy protections to a strong privacy protection bill that we can all be proud of so what does HIPAA do HIPAA allows disclosure to any public health authority for the purpose of preventing controlling diseases it's very broad this bill now with our changes allows disclosure only when there is a declared public health emergency and again go to that code section what you just heard was incorrect and then only and that's the part that chairman Cooper spoke about was only to the U.S. Department of Health and Services and then to it subsidiary which is the CDC that you just heard go to lines 262 through 266 and you'll see the bill but it's not all this bill also prohibits Department of Public Health from providing patient names again much stronger than HIPAA lines 265 through 266 read the bill and finally there is now an express exemption for patients so that they can opt out of the statewide vaccine registry again we put into code and exempt I mean an express exemption for patients so that they can opt out of the state vaccine registry lines 266 through 267 and also 253 through 254 the law previously referenced it it was very vague but now it is explicit and with these changes we're still increasing access to care and we're empowering our pharmacists and our nurses and the folks in our hometowns who are trying to make sure that they get the vaccine now that we have access all across this state and this this bill proves that we can do both we can protect privacy and you can opt out and finally if you want the vaccine this bill with that exemption clause okay opting out will allow you to still go get your vaccine and have no record of it so what you just heard prior to me getting up here was had nothing to do with this bill I want to urge you this helps accomplish what we need to make sure that we continue to get vaccines and we give some information to CDC to get the vaccines here but it also strengthens Georgia code like it never has been before and our patients can opt out I urge you to vote for this bill so that we can make sure we're protecting Georgia and it's in this crisis thank you the gentleman has yielded the well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to withdrawing the committee substitute the chair here's none the committee substitute is withdrawn is there any objection to adopting the substitute offered by the committee on rules the chair here's none the rules sub committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all in favor of the passage of the bill vote yes all those opposed will vote no and the clerk will unlock the machine for what purpose does representative cannon rise parliamentary inquiry state your inquiry is it not true that we many members in this body have concern about language justice meaning that those who don't speak English will be negatively impact by the passage of this legislation that does not speak to the more than 300 languages represented in the state of Georgia I'm sure the lady believes that to be true we need to make a correction earlier it had listed up there we were discussing Senate bill 46 and so for the entire time it was up there somehow in the machinations up here it got switched and so I'm going to back up to make sure that we are giving you the information about the correct bill all right so now we've got the correct bill back up there is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to withdrawing the committee substitute chair here's none the committee substitute is withdrawn is there any objection to adopting the substitute offered by the committee on rules the chair here's none the rules committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all in favor of the passage of the bill vote yes all those opposed will vote no and the clerk will unlock the machine for what purpose does majority whip Kelly rise parliamentary inquiry state your inquiry a mouse figure isn't it true that a no vote on this could desperately hurt Georgia's ability to receive the code back to scene it would be a vote directly against the health and welfare of Georgia citizens chair believes the man knows of that of which he speaks what purpose does representative night follows parliament or inquiry state your state your inquiry my don't speaker isn't it true with the language here that we have actually put in and a specific exemption that exempts people out from the registry therefore allowing them to totally not give any data whatsoever protecting the privacy of people who don't want to participate in the vaccine registry show the gentleman knows of which he speaks in final parliamentary inquiry for what purpose does representative McLeod rise parliamentary inquiry state your inquiry is not true the bill as currently stated would not let itself to contact tracing that's a matter for each and every member to decide right now and so on the have all members voted have all members voted if so the clerk will lock the machine on the passage of the bill the A's were 109 the nays were 56 bill having received the requisite constitution majority is therefore passed clerk will read the caption to senate bill 256 senate bill 256 by senator burkley level of Gucci the 51st and others to be titled back to amend title 12 code section 16 12 4 code section 19 11 9 chapter 2 a title 26 title 31 and code section 43 18 75 of the fish go to Georgia annotated relating to conservation and natural resources this bill ever further the committee on health and human services that committee recommends that this bill do pass by rules committee substitute the chair recognizes chairman Cooper to present the bill thank you madam speaker lazy gentleman of the house i bring to you the rules substitute to house bill 256 this has to do with our public health commissioner which is dr. jimmy at the time and the hiring of our public health the district public health directors those health directors are state employees please hear me they are state employees they get state benefits but at this time the way that they are hired dr. to me presents them to each of the health departments or the health department the health area where they're district where they're going to be working if they're hired and if one county in that health district says no to their employment they cannot be hired now let me read to you how many counties are in each of these and districts in the way cross district there are 16 counties that means if one county objects you can't hire the area director for that in Athens there's 10 counties in Dalton there's six in gainesville 13 in fulton one in de cab one in Clayton county one now remember those because i'm going to come back to the counties that are only one and when that three and legrange 12 in Dublin 10 in Megan 13 in Augusta 13 in Columbus 16 valdausta 10 coastal eight in Albany 14 counties can you imagine being the CEO of a company and you have to go to every one of your 15 area supervisors and have their permission before you can hire the vice president for operations for the whole company this is what we've been working with and it's not working we have four or five areas that don't have one of these physicians helping them with decisions because we can't get the counties to agree so this is very different from the bill that was first proposed by the senate what this one is is a compromise if this bill passes here's what will happen if you're in the way cross district and they're trying to high you're trying to get you a district director there's 16 counties in way cross each board of health in in that way cross district each county their county board of health would meet and they would elect one person to go to the with other 15 counties representatives and they would vote and whoever had the majority of votes would win if the people that had the majority of votes wanted the person that doctor to me wanted then that person would get the job if the majority of counties did not want the person\n\nthat Dr. Tumead was proposing that person would not get the job. If you are a county and you only represent one county, you're a district, like Clayton, our Fulton or to Cab, your Board of Health would meet and they would make the decision. And the majority of the board for to Cab or Clayton, our Fulton, what they decided would be whether you hire Dr. Tumead, hires the district director or not. That allows from input from the communities while at the same time not allowing one county to keep 15 other counties, or 10 other counties, or 8 other counties from having a district director, a person to work with each of those counties and putting forth our public health agenda and in working with this paper. And becoming a member of those communities and working with those boards, that's simply how it's put. It's a compromise. It allows a much more workable way to elect and make sure that we can have district directors. We right now have about five vacancies across our state. It's very hard to find these people. They have to be in D's. They have to be in good standing. They look to people with public health backgrounds. These people do not grow on trees and when we find somebody really good. And I believe Dr. Tumead with all of her years' expertise is a real good person to start that evaluation project. We need those people in Georgia. We need them helping our counties. So I would ask for your favorable consideration on the substitute to House Bill 256. Mr. Madame Speaker, if there's no questions, I'll yield the well. You have a couple questions if you choose to take them. I will take one or two. Chair recognizes Representative Burnell for question. Where am I looking? She's in room 341. Well, the lady, you. Yes, I will. I live in Clayton County. So since you mentioned them, what I'd like to know, I know that most people don't know that their health departments are already in a district, first of all. And what happens is according to the way that it's stated there, is that the larger county now ends up taking care of the smaller counties. Is that not true? I'm not aware of that. Can I ask you another question? Certainly. Okay. And so what's going to happen is that, as you're saying, that yes, they are hard to find those individuals. However, if that, the county still have to provide funds, even though they don't have any say-so in whose hired. Is that not true? No, ma'am. That is not. There are, the state pays a basic salary. There are some counties that do give a supplement, but that is not the way that all counties do it across our state. Okay. One more question. One Clayton County hired someone and they were in Lagrange. They took all the resources from Clayton County to Lagrange, and then they threatened to fire most of the employees at Clayton County. And that's why Clayton County doesn't have that director because that director did not work well with the employees. Not just in Clayton, but also in Henry and Fayette. Thank you. Well, in this bill, Clayton County represents, the Clayton is one county, and it would be up to the board of public health in Clayton County, they would be making the decision totally by themselves of who they hire. Here again, I would ask for a favorable consideration on House Bill 256, and I will yield the well, Madam Speaker. The lady has yielded the well. Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to adopting the substitute offered by the Committee on Rules? The chair here is not in the Committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is not in the report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. For what purpose does representative Williams rise? In the gallery. I really wanted to ask, I really had a question that I wanted to ask the bill author. Is it not true that online 28 it says the commissioners shall select a district health director for each health district? Is it not true that Chairman Cooper said that the members of the Board of Health would be able to vote? The lady will have to make a decision here on how you're going to vote. I don't have the information to answer that question. Last parliamentary inquiry. What purpose does representative illustration rise? Parliamentary inquiry. Speaker, is it not true that initially there was some concern that I had about this bill representing GRN, Winnett, Newton, Rockdale County. But with the compromise bill that's before us tonight, I have spoken to folks back home and there is support for this compromise. It's a good bill. Members should vote in favor of it. Members are able to make that decision now. Have all members voted? Yes. All right. Have all members voted? Have all members voted? On the passage of the bill, the A's were 79. The clerk will lock the machine. The A's were 79. The A's were 92. The bill having failed to receive the requisite Constitution majority has therefore failed. What purpose does the majority caucus will arise? I'm a speaker. I'd like to certainly notice for reconsideration. The gentleman has moved to reconsider. This house is failure to give a Constitution majority to Senate bill 256. All those in favor of the motion to reconsider will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. The gentleman's motion for reconsideration. The A's are 95. The A's are 76. This house has reconsidered this action in failing to give a Constitutional majority to Senate bill 256. Okay. It goes back on the general calendar. The chair recognizes chairman Blackman for a motion. I'll move that we received from our position on Senate bill 6 and accept the Committee of Conference report as presented. Chairman Blackman has moved that the House adopt the Committee of Conference report on Senate bill 6. The clerk will read the caption. The Committee of Conference of Senate bill 6 recommend that both the Senate and the House of Representatives receive from their position and the Attached Committees of Conference substitute to Senate bill 6 be adopted, respectfully submitted for the Senate. All members of the 56, Huffstead, who are the 52nd Watson of the first for the House, Blackman 146 burns 159th. Williamson of the 115th. Chair recognizes chairman Blackman to explain the Committee of Conference report on Senate bill 6. Thank you, Mr. Speaker. This is the language that we have presented on several occasions to this body. We have 587, 586, and then we have Senate bill 6. The two things that we do not have from the, as passed the House on this previous version would be the language for the Council, including the Joint Committee, and then also we do not have the Agribusiness Language in this particular bill. So these are the things that we came together on. Again, all measures that we have seen or moved before. Try to answer any questions if there are any. I know others have spoken to this bill numerous times and we have seen the provisions in it. You have no questions. Thank you. I yield the well. I ask for your favorable consideration. On the adoption of the Committee of Conference report on Senate bill 6, all those in favor of adopting the Conference Committee report will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does chairman Carson rise? Mr. Speaker, pursuant to rule 133 ask me, excuse from the vote. Do you have the gentleman has that right and the journal will so reflect what purpose is representative cannon rise? She waves. Have all members voted? Have all members voted if so the clerk will lock the machines. On the adoption of the Committee of Conference report on Senate bill 6, the eyes are 146. The nays are 25 and this house has adopted the Committee of Conference report on Senate bill 6. Chair recognizes chairman Jasper's for emotion. Thank you, Mr. Speaker. I move you agree to the Senate substitute to House Bill 588. Chairman Jasper's has moved that this house agreed to the Senate substitute to House Bill 588. The clerk will read the caption. House Bill 588, members. And if Jasper's to the 11th and others be tied up to amend and title 32 of the fiscal in Georgia and to relating highways bridges and fairies. Chair recognizes chairman Jasper's to explain his motion. Thank you, Mr. Speaker and members. This is a production from the Frank Logistics study committee that will held her last two years and this is the funding bill. I want to answer a couple of questions about the Senate edition. When the House, when the mayor bill passed the House and did not have the alternative contracting language in it, this was added in Senate finance after passing the House. It took about two weeks of meetings between G. and those involved in the construction world to come up with this language. This is in no way a no bid contracting bill has been rumored in the hallway. There is no way that the folks who work in this world, the bridge roads and bridge folks would allow it. You know, this is their bread and butter. There is bid within it. The DOT board approval that allows it. You know, this is about large projects. You think about when we move or work on the town bridge of the Savannah River, that's the type of thing that's just a work on it. There is oversight from the legislative branch, executive branch and the DOT board and there is bids within it. And again, I want to re-epicize. Our partners in the road and bridge construction group are in agreement with this bill and it worked hard to come to an agreement so that Georgia can grow. Other than that, the bill is good. It's what we pass out the House. That's our bill, Mr. Speaker. I'd be glad to answer any questions. Thank you. You'll be well asked for your favorable consent. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 588, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the gentleman's motion. The eyes are 162. The Senate and the knees are 2. This House has agreed to the Senate substitute to House Bill 588. Chair recognizes representative Rick Williams for a motion. Chair recognizes representative Carpenter for a motion. I make a motion to agree to the Senate substitute of House Bill 577. Representative Carpenter has moved that this House agreed to the Senate substitute to House Bill 577. Clerk will read the caption. House Bill 577, my representative Clark of the fourth and others being titled an act to amend. Title 32 in Code Section 46181 of the fiscal to Georgia annotated relating highways, bridges and fairies and maximum speed limits. Chair recognizes representative Carpenter to explain the Senate substitute. Thank you, Mr. Speaker. So this bill we passed out of the House, they've added a little bit of language in the Senate Transportation Committee. One point in Section 1, it requires the state environmental rulemaking to enable state permitting to better align with the US Army Corps of Engineering Section 404 for permitting where applicable roadway projects. Basically what this does, this requires our EPD to update their codes so that it matches and synchronizes with the Army Corps of Engineers on certain projects. And then also the other piece was Section 4567 and 8, which really were addressed in the Frightened Logistics Commission recommendations on intermodal, multi-modal and public private partnerships. And with that speaker, I know it's getting late, I yield the well. Gentlemen has yielded the well on the gentleman's motion that this House agreed to the Senate substitute to ask Bill 577, all those in favor will vote aye those opposed to vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 155. The Nays are 14 and this House has agreed to the Senate substitute to ask Bill 577. Chair recognizes representative Rick Williams for a motion. Vice-Mr. Speaker, in this we move on the Senate substitute on House Resolution 144. Representative Williams has moved that this House agree to the Senate substitute to House Resolution 144. The clerk will read the caption. House Resolution 144 by Representative Williams, the 145th honor in the life of memory of Ms. Katie Poth and dedicating an intersection in her memory. Chair recognizes representative Williams to explain the Senate substitute. The clerk has agreed to explain the House Resolution 144 by Representative Williams. The clerk has agreed to explain the House Resolution 144 by Representative Williams. The clerk has agreed to explain the House Resolution 144 by Representative Williams. The clerk will unlock the machine. The clerk has agreed to explain the House Resolution 144 by Representative Williams. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 171. The Nays are 0. This House has agreed to the Senate substitute to House Resolution 144. The clerk has agreed to explain the House Resolution 144 by Representative Williams. Chair recognizes representative Gunter for a motion. Thank you, Mr. Speaker. Move the House agreed to the Senate substitute to House Bill 306. Representative Gunter has moved that this House agreed to the Senate substitute to House Bill 306. The clerk will read the caption. Chair recognizes representative Gunter to explain the Senate substitute. Thank you, Mr. Speaker. Ladies and gentlemen, this is the same bill that we passed out earlier in the session. The only addition that the Senate made was that they added in non-profits. With that, I ask your favourable consideration. I yield the well. On the gentleman's motion, this House agreed to the Senate substitute to House Bill 306. All those in favour will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 163. The Nays are 0. And this House has agreed to the Senate substitute to House Bill 306. Chair recognizes representative Gunter for a motion. Thank you, Mr. Speaker. I move that the House adhere to its position on House Bill 409 and ask for a conference committee to be appointed. On the motion of the gentleman, the representative Gunter has moved that this House insists on its position on House Bill 409 and that the committee of conference be appointed. Clerk will read the caption. House Bill 409, the governor of the eighth to be entitled to not to amend Article 4, Chapter 15 to Title 45 of the Physical Education and State of Related Council for Public Officials and Agencies. So, there's a survivor process for state funded representation of certain judges in legal actions. Chair recognizes representative Gunter to explain his motion. Thank you, ladies and gentlemen. They've added in the language to advise and consent to the appointments and asking that we take that out. That's basically it. On Representative Gunter has moved that on House Bill 409 that this House insists on its position in appoint a committee of conference. Is there objection? Is there objection the chair hears none and it is so ordered. The chair appoints as a committee of conference. Representative Gunter from the eighth district. Representative Fleming from the 121st District and Representative Abstration from the 104th District. Chair recognizes Chairman Stevens for a motion. Thank you, Mr. Speaker. I'll move this House to agree to the Senate substitute to House Bill 317. Chairman Stevens has moved that this House agree to the Senate substitute to House Bill 317. Clerk will read the caption. House Bill 317, I'm Steve and the 164th and others will be entitled an act to amend Article 3 of Chapter 13 Title 48 in Fishboot of Georgia, Antietta relating to excise, taxes on rooms, lodgings and accommodations. Chair recognizes Chairman Stevens to explain his motion. Thank you, Mr. Speaker. Members of the House, you might remember 317 was the in-keeper facilitator pill that collects all the Huttel Motel taxes from these BRBOs and others and it also collects the $5 fee. Whenever to the Senate they attach some language to it and the rules committee took it back out so this is exactly the bill that you voted on before. So I'll ask you to vote for it again. If there's no questions I'll yield the well. On the gentleman's motion of this House agreed to the Senate substitute to House Bill 317. All those in favour will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machines on the gentleman's motion. The I's are 142. The Nays are 22 and this House has agreed to the Senate substitute to House Bill 317.\n\nyou you you you you you you you you you you you you you you you you chair recognizes representative mom to hand for emotion they have 9 Bill 327, clerk will read the caption. House Bill 327, I represent a mob to hand. On the 17th and others to be entitled to an active event. Organized retail crime to amend chapter 1 and title 10 of the fiscal to Georgia and Tate, who are letting selling and other trade practices. Chair recognizes representative Mondohan to explain the Senate substitute. Thank you, Mr. Speaker. This is a bill that passed overwhelmingly in the House. Just the Senate changes for just one word from a shout to a May to give those folks more discretion. I'd say this is a good bill passed overwhelmingly. Well, that I give the way up. On the gentleman's motion of this House agreed to the Senate substitute to House Bill 327, all those in favor will vote aye. All those opposed vote no, and the clerk will unlock the machines. No. Have all members voted? All members voted. If so, the clerk will lock the machines. Oh, in the gentleman's motion, the eyes are 102. The nays are 63, and this house has agreed to the Senate substitute to House Bill 327. Chair recognizes Chairman Watson for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate substitute to HB 47 as amended by the House. 477. 477 has amended by the House. Chairman Watson has moved that this House agree to the Senate substitute to House Bill 477 as amended by the House. The clerk will read the caption. House Bill 477, my representative Watson, a 170 second to be entitled back to amend Code Section 487, 29.12, the official go to Georgia, and it's related to tax credits for qualified donations. Chair recognizes Chairman Watson to present his the Senate sub in the amendment. Thank you, Mr. Speaker. This is the bill that we've already passed out of the House. The Senate wanted to lower the conservation tax credit piece, so we agreed to that. We haven't been utilizing it fully. It also, the amendment that we'll be adding also adds the Georgia Agri Business Tax Credit Program. It's also passed this body, and so we're going to put that back in there so we can continue to create jobs in Georgia. And then also the final piece is we're going to start taxing jet fuel after July 1st, 2021. That's what the amendment does, and I know the hour is late. Mr. Speaker, and I yield the well. Gentlemen has yielded the well. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 477 as amended by the House. All those in favor will vote aye. Those opposed will vote no. And the clerk will unlock the machine. What purpose does Chairman Knight rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, isn't it true this body temporarily suspended the jet fuel tax back in 18 in the special session up until the following June? That is my recollection. Further parliamentary inquiry. State your inquiry. Isn't it further true that the year later that due to a Department of Revenue Rooling, a misguided one at that per our leg council stated that that revenue ruling overrode the general assembly and the law that we passed and as such doesn't this bill go back and correct that so it's the general assembly is in charge of its taxes and states it very clearly clear. If the gentleman so states I'm sure he believes that to be true. What purpose is representative Wilkerson rise? Parliamentary inquiry. Is it not true that at the very end of that I just want to make sure that he took away the Delta tax exemption as a retaliation for them speaking against that horrendous HB202 or Senate bill 202 or whatever that election bill was and this is nothing to do with the Department of Revenue but is purely retaliation for the business community speaking out on a bill that everyone feels is Jim Crow 2.0. If the gentleman so states I'm sure he believes that to be true. What purpose does representative built on rise? Parliamentary procedure. State your inquiry. Let's vote rule number one three three please. Gentlemen has that right and the journal will so reflect have all members voted have all members voted if so the clerk will lock the machine on the gentleman's motion the eyes are 97 the days are 73 and this house has agreed to the Senate amendment to House bill 477 as amended by this house. House will come back to order we got a little lot of moving parts around here. The chair recognizes chairman England for a motion. Miss speaker I moved the House received from its position on House bill 81 and adopt the Committee of Conference report. Clerk will read the conference committee report. Committee of Conference on House bill 81 recommends that both the House of Representatives and the Senate received from their positions and the Adapt attached Committee of Conference substitute to HB 81 be adopted respectfully submitted for the House of Representatives England of 116 Jones on 47th burns the 159th for the Senate tillery the 19th Miller the 49th Dugan of the 30th. All right we're taking up the budget. I'm going to ask that the members lower the level of conversation. Chair recognizes chairman England to explain the conference committee report. Thank you miss speaker members of the House glad to bring to you this meeting the conference committee report on House bill 81 as always. We need to make a few thank yous before we lead into this of course our committee members almost half the house are now on our committee and I want to thank you for your work. Our subcommittee chairs the eight of you all that just continue to amaze me with your abilities. Our admins that that kind of keep all the trains running on time whether it's here in the house or over in the house budget research office with Miss Alicia appreciate all of y'all but especially I want to say a quick thank you to Martha Wigden Christine Murdoch and all of our HBRO staff they do an incredible job day in and day out as many of you know you call and have questions for them. Many times during the year and they're always here and willing to work and help and get you those answers. Our friends and colleagues in the Senate chairman teller and his staff thank you to them and of course our governor and the office of planning a budget as well. It's much more enjoyable to rebuild a budget but it's certainly no less complicated. It's not just enough to refill cuts or reductions that have been made in previous years. But to go in and look at those expenditures look at those funds that you're putting back to make sure that they're being put back in the proper place being used in the proper way and addressing the changes that have occurred within the state since those cuts were made. Instead of just putting the money back we always look for efficiencies with reductions and capitalize on those opportunities with restorations to make our taxpayer dollars work harder. Examples of creating opportunities through these efficiencies are throughout this budget before you. Now the budget's been out since right at five o'clock the tracking sheet has also been out there since just shortly thereafter with a couple of other documents. Our reference those things through here we will not want through the tracking sheet tonight. We're using over one million dollars from a recalculated law enforcement training grant program to create a permanent facility at GIPSTIC, the Georgia Public Safety Training Center, dedicated to de-escalation and proper use of forced training for the thousands of local and state law enforcement employees who certify and recertify there annually. In addition we're using some of those funds to provide longevity increases to our state troopers to create a pay scale increments on a senior and master level. And increasing adoptions along with better revenues allow us to redirect a potential $14 million cut back into the system very pointedly. $6.7 million of that goes to foster care to target the housing needs for our children who are indifficult or any difficult place and need height and services and supervision. As well as $6.5 million to replace federal funds being cut from our private foster care partners who also provide housing and wraparound services for these children. We can turn these needs, we can turn the needs magnified by this pandemic into an opportunity to significantly update our infrastructure for broadband access as well. If you recall the governor had recommended in his original budget, of course in the amended budget 20 million to go toward broadband expansion in the state and another 10 million that is included in House Bill 81. Along with that, $39.5 million going to one Georgia to establish the rural innovation fund to assist rural communities with solutions for economic, medical, technological, and infrastructure needs within these regions. We took the opportunity of rebuilding and reconstituting the base for too big reoccurring cost and annualized $25 million in the forest land protection grants for $39 million total there in the matching funds that are also known as DISH, disproportionate share hospitals for our private non-deemed hospitals which is $35 million for a total matched total of $105 million infused into the indigent care trust fund. This provides a more predictable foundations for these grants moving forward and allows the amended budget to be used for fine tuning as it is intended to do in its function. We have provided additional base funding adding a level of permanency for very significant programming, many of which were recent legislative initiatives, 307,000 for the Georgia Hemp Program, 333,000 for better training and regulation of the gate card program, safe harbor for sexually exploited children, 1.6 million for this Lexia screenings, 20.7 million for outdoor stewardship grants, 100.4 million for feminine hygiene products, more money also for the HIV prevention program, 1 million for vaping oversight and regulation, 1 million for charter facility grants for education, 1 million to provide newborn screening for crab A disease, and again, 622 million for the medical cannabis treatment and production program. Legislative influence has particularly obvious and the Department of Transportation's budget has more over 200 million and new funds collected to pursue it of House Bill 170 from the 2015 session, and Senate Bill 105 more recently are reflected as revenue for road construction as well as $7 million in transit and $3.1 million for transportation infrastructure bank community based projects. Your coffees also agreed to add a million to build resources for airport aid, for projects for regional airports which draw a 95% local federal match. You profoundly make a mark on services for those persons and families and friends challenged by behavioral health need as well. Legislative influence is dominant in the mental health budget, items with a restoration of $59 million carefully placed in the Department of Behavioral Health which includes $7 million for the crisis unit. Uniquely staffed for those individuals with intellectual or developmental disabilities, and 9.2 to expand the capacity to over 7,000 Georgians in need of mental health or addiction supports. As is 1.2 million for additional adult protective case workers and guardianship case workers to look out for a vulnerable senior citizens here in the state of Georgia. In concert with that broadening the oversight with $7.5 million in funding for in this budget to the modernization of the health care facility and regulation division at DCH. The division is called HFRD and it recently came under scrutiny for its data systems not being adequate enough. Nursing homes have been particularly subject to the human and economic impact of coronavirus. In House Bill 81 addresses these unique needs with nearly $44 million in new dollars, of which $20 million is pointedly directed to improving the quality of care, and we bolster the reimbursements for frontline Medicaid, primary care, physicians, and dentists. With approval from CMS, we have also provided a $12.3 million increase for a 5% rate increase for mental health providers, the first increase in a decade for these 700 statewide clinicians and therapists, which when matched equals over $37.2 million. The passage of the 6th Federal COVID-19 relief bill, the $1.9 million, excuse me, $1.9 trillion American Rescue Plan Act of 2021, provides an opportunity to increase 31 grants a total of $15.95 billion to include $4.6 million in general purpose allowance. Although these US Treasury funds, excuse me, although the US Treasury has yet to share the rules and regulations of these grants, each of them is noted for your reference within House Bill 81 for historical tracking purposes. Also out on the table outside, you'll see a letter from Governor Kemp, where he mentions that he wants legislative input and partnership and how those funds will be expended throughout the state. This relief is timely, but I add a cautionary note. Federal funds are never permanent, and just like the process for restoring state funds, we do not blatantly backfill federal funds when they go away. In FY21, your peers on the Appropriations Committee do support putting in state funds of $6.6 million to backfill the title, $9.9 trillion, excuse me, $4.9 trillion, that no longer help us cover placements in our private foster care partners, is the residential treatment centers like Devaro, Murphy Harvest, and Youth Villages to name a few, and the domestic violence shelters, which not only provide services for these families in need, but also support over 265 jobs, receive $1.8 million for a 9% increase in state funds to offset some of their lost federal funds, and an additional $150,000 for our sexual assault center statewide. This significant influx of dollars for fiscal year 21 of the federal dollars, and 22, we have asked the Department of Audits and Accounts to perform the necessary auditing of these 31 grants, and have provided them with a staffing and operating resources of $1.2 million to do so. Finally, as we work to evaluate this budget, we have all been keenly aware that QBE funding formula and scattered programs across our education pipeline needed to be addressed. In fact, 57% of all new funds, or 764.5 million, went directly to education. Pre-K classrooms get their first operation increase since FY10 for supplies and learning materials, as well as more than 625 slots for the Child Care and Parent Services program or COPS that assist low-income families. House Bill 81 also catches up the teaching formulas in higher education with $59 million for the University System and $6 million for the Technical Colleges. For the first time in several years, we are funding $1 million in imminent scholars, the first specifically focused on sickle cell research as a partner with more house school of medicine, children's health care of Atlanta, and Emory University, and a research scholar focused on rural Georgia and historically black colleges and universities. House Bill 81 also includes treatment dollars for sickle cell through the Department of Public Health, and $100,000 to partner with Clark Atlanta University on prostate cancer research. Health education also gets a boost with a second of a three-year implementation plan that increases the state subsidy for funding to medical classes of $7.8 million and $5.3 million in matching funds to draw down a one-for-one match to support more medical education students in the Medical College of Georgia's 3-plus program. 60 to 100 percent of 60 to 100 percent of budget reductions in programs for K-12 are restored to prior year levels. But as I stated at the beginning of the overview, everything needs to be scrutinized before blindly backfilling. So to that end, flat student enrollment and a virtual workspace remote workforce for the LE have organically created funds to be directed to other K-12 needs, and those rent savings you see across the LE programs has yet another example of shifting resources for other needs and good budgeting practices. The highlight of the document you have before you list out the plethora of restorations in the new program dollars into K-12 to include 5 million in the base funding for nutrition. School nutrition and the staff who have been preparing and delivering meals for 12 straight months are heroes who ensure Georgia's children do not go hungry, and these funds provide salary and healthcare premium support for those workers as well as nutritious meals for the students. As we noted earlier, mental health has crucial during these stressful days, especially for our youth. Two million is added to expand the APEX program that has been highly successful across the state, the school-based access points for intervention and counseling, and another 59 schools. We funded 395,000 to provide suicide prevention training in schools and added 5.8 million in new school tutorial after school and summer school resources through partnership with the multi-agency alliance for children, boys and girls clubs, and the YMCA. Teacher salaries and step increases for training and experience are fully funded requiring a additional 58.2 million dollars. Also note worthy are the increases to teacher retirement system at 58.1 million, and an increase to the public school and employees' retirement system members benefit to $15.75 benefit. The board of employees' retirement system is urged to provide an additional benefit either a COLA increase or a 13th check depending on the funds overall ability to do so. Finally, the biggest line item in HV81 is the 587 million in restoration of state funding for the quality basic education program. On your desk or out on the table, you have a document that shows the local system's financial information that includes reserves, grants from the three sets of CARES Act cash, and the latest allowances for the 3.8 billion in direct payments to local school systems provided by the ARP. The final columns in that sheet will show you the outstanding QBU reduction in context with them on. There's nothing static about a budget, just like there's nothing static about our communities, especially now during a pandemic. The members of this house and our counterparts across the way have done an incredible job of shifting resources to face the challenges while also doing due diligence to scrutinize how we deliver services and refresh the way we do business to make the impact of every dollar more aggressive. It is truly a balancing act, but as I've also tried to make clear is ever changing and a symbiotic relationship partnership. With local federal and local and federal governments, colleges and universities, community agencies, private providers and most importantly are taxpayers themselves. Your yes vote to this conference report across the party and across the chamber to secure the passage of a 27.2 billion dollar fiscal plan to CARES through the coming year with greater certainty is the keystone of partnership to the immoral. Mr. Speaker, that sums up most of everything that is in the document. It has been on the desk now for several hours and with that Mr. Speaker, I know we've got several more things to accomplish here this evening before we leave. And so therefore I yield the well and ask for your favorable consideration of the conference committee report to House Bill 81. Gentlemen, is yielded the well on the adoption of the conference committee report on House Bill 81. All those in favor of adopting the conference committee report will vote aye. Those opposed will vote no and the clerk will unlock the machines. You What purpose does representative Hutchinson rise? Versuitable to roll rule 133. I'd like to be excused from this vote. Lady has that right and the journal will so reflect have all members voted have all members voted. If so, the clerk will lock the machines on the adoption of the conference committee report on House Bill 81. The eyes are 148. The nays are 21. This house is adopted. The conference committee report on House Bill 81. The fiscal year budget while we have them in here, let's bring the budget office staff in and give them a big hand and thank them for their good work this year. Thank you very much. Another group, another group I want to have you help me thank for a really outstanding job. They're not here because they're across the street streaming and working and that's the house media services.\n\nwith their director Betsy Taroa up here. And she's got an awesome, awesome staff. Justin Speck, DJ Morlin, Camille Taylor, Michelle Sloane, and last but not least, B. Drapewell. I think we ought to give a shout out now to the House Administrative Assistance. I'm sure they're still in their offices working. Got some over here against the wall. Bring it in. Thank them for their good work. God, we couldn't do it without y'all. I'm sure they're still in their offices working. God, we couldn't do it without y'all. The temporary session staff in the House interns and externs. Give them a big hand. And while we're at it, let's give a big, big shout out to another group that we really can't live without. And sometimes we can't live with. But that's the office of the clerk of the House with our distinguished clerk, Bill Riley. Assistant clerk, Crystal Roush. The clerk's office staff that works on the floor. And these are great, great people here. Scotty Long, Carrie Vic, and Ryan Keane, and all the staff that are back in the office working. And to the greatest House messenger in America, Betsy Thoreau again. She really keeps me on target. And Deputy Messenger Holly Pitcock. They're still working too, I think, but the office of legislative council and staff with legislative council Rick Ruskell. That's everything to mine. Let's give a big hand to Angela Holland, who has run the any room staff this session. Angela, come take a bow. And our postmaster, Cory Malky. Thank you, Cory. And a great, great big shout out to the Georgia State Patrol, the Capitol Police, and the GBI for keeping us safe. Chair recognizes Chairman Cooper for a motion. Mr. Speaker, I move that the House agreed to the Senate amendment to House Bill 605 as amended by the House. Chairman Cooper has moved this House agree to the Senate amendment to House Bill 605 as amended by this House. Clerk will read the caption. House Bill 605, there was a Cooper, the 43rd to be titled an act to amend chapter 8 of Title 31 of the fiscal to Georgia and Ted are laid in the care and protection of indigent and elderly patients. Chair recognizes Chairman Cooper to explain the Senate amendment and the House amendment. Thank you, Mr. Speaker. The Senate did an amendment on the floor and the House amendment would put this back to what passed out of the Senate committee and what had been approved by our states elderly on butzman in which I agree with. Thank you, Mr. Speaker. I ask for your favorable vote. The lady has yielded the will. All those in favor of the motion to agree to the Senate amendment to House Bill 605 as amended by this House will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative McLaren rise? Parliamentary inquiry. The speaker is not true that aging advocates are still opposed because this bill still does not allow use as House amended as proposed by the chairwoman. It does not allow use of the secret camera footage in civil proceedings, which is this essential element to protect people in these homes. I'm sure the gentleman has read the bill and feels that's important. What purpose does representative Al Williams rise? Parliamentary inquiry. Is it not true that you forgot to give a shout out to the person in charge of the heat who's on the way from Alaska? Well, I've got somebody bringing in firewood. We're going to start some fires around here and get warm. All right, final parliamentary inquiry. What purpose does representative Mitchell rise? Parliamentary inquiry. Is it not true that the Senate version of this bill passed overwhelmingly 49 to 3 while the original House version of this bill barely passed? Well, overwhelmingly and barely are subjective words. And so I'm not going to get into that. All right, if all members voted. If so, the clerk will lock the machine on the ladies' motion. The eyes are 77. The nays are 88. And the motion has failed. Chair recognizes representative Carpenter for a motion. Thank you, Mr. Speaker. I move that we agree to the House bill 562 as amended by the Senate. Representative Carpenter has moved that this House agree to the Senate substitute to House bill 562. Clerk will read the caption. House bill 562, by the way, is the Carpenter of the fourth ridley, the sixth cognizant, the 14th and others being titled next to amend Article 3 of Chapter 4, Title 17, the Fisher go to Georgia, and Teta relaying awards for arrest. So if that defects case managers, the people for whom the arrest warrants may be issued only by certain judicial officers. Chair recognizes representative Carpenter to explain the Senate substitute. Thank you, Mr. Speaker. Basically this House bill 562, the only change that was done to this is this would allow prosecuting attorneys to ask to move a trial by jury to a different venue if a previous prosecuting attorney has recused himself or has been disqualified or removed from the case. And with that, Speaker, I yield the well and ask for your favorable consideration. On the gentleman's motion that this House agreed to the Senate substitute to House bill 562, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative can trail rise parliamentary inquiry? Mr. Speaker, isn't it true that I really miss our former representative, Beasley Teg, about right now? Well, you know somebody else could make that motion. Well, I'd like to make that motion on behalf and in honor of representative Beasley Teg, because I'm tired and I want to go home, Mr. Speaker. The motion has been adopted. Thank you, Mr. Speaker. If all members voted, if so, the clerk will lock the machines. On the gentleman's motion, the eyes are 168th and A's are zero. This House has agreed to the Senate substitute to House bill 562. Chair, recognizes Chairman Hogan for a motion. Thank you, Mr. Speaker. I rise to support an amendment to House 72 Senate 165 that we passed out of this House. Chairman Hogan has moved that this House agreed to a Senate amendment to Senate bill 165, clerk will read the caption. Senate bill 165, Senator Gouge, 51st Cropatric of 32nd, beats 21st and others to be titled to amend chapter 8 of Title 40. The official go to Georgia and Citadel League and equipment inspection and motor vehicles. So it's an exemplally autonomous vehicle from certain vehicle equipment requirements. Chair recognizes Chairman Hogan to explain the amendment. This is to exempt certain on-premise vehicles from certain equipment equipment and to acquire display of reflected emblem and use of strobe lights. And that's basically the bill. On the gentleman's motion, all those in favor of the motion will vote aye. Those opposed will vote no and the clerk will unlock the machines. Well, have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 166. The nasors zero. This House has agreed to the Senate amendment to the House substitute to Senate bill 165. Chair recognizes Representative Gravley for a motion. Thank you, Mr. Speaker. I move that this House adopt the conference committee report on SB 195 and receive from its position. Representative Gravley has moved that this House adopt the committee of conference report on Senate bill 195. Clerk will read the conference committee report. The committees of conference on Senate bill 195 recommend that both the Senate and the House of Representatives received from their position and that the attached committee's the conference substitute. SB 195 be adopted for the Senate. For the House of Representatives, the House of Representatives, the 67th Watson, the 172nd and Smirie the 135th. Chair recognizes Representative Gravley to explain the committee of conference report for Senate bill 195. Thank you, Mr. Speaker. I'll be brief. Ladies and gentlemen, we got a good bill out of conference. We got the majority of what we needed. We got the bill that we voted on three times here in the House. Ladies and gentlemen, I want to thank Calvin Smirie, our dean and Senator Lester Jackson for coming together. They were able to secure the language so that Fort Valley State and the University of Georgia are two designated universities will go straight to the commission and not have to work through the university system. Ladies and gentlemen, they've while also doing and providing that all HBCs in this state as well as colleges and universities will have the opportunity to research. Ladies and gentlemen, the change we had on dispensaries. Instead of an unlimited number of dispensaries across the state, we reached an agreement that we will have 30 dispensaries across the state. There will be a trigger mechanism for every 10,000 patients. They will add a dispensary. Ladies and gentlemen, for each of the six cultivators. And then finally, the third change was that they were able to put some teeth for the commission that they could find companies that were bad actors or not acting in compliance. Mr. Speaker, that is the bill. I will yield the will and ask for your favorable consideration. Ladies and gentlemen, as you did the well on the adoption of the Committee of Conference Report on Senate Bill 195. All those in favor of the adoption of the Conference Committee Report will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? What purpose does representative Bentley rise? Mr. Speaker, is it not true that I am very grateful to the Arthur of this bill, Senate Bill 195, because it includes Fort Valley State University. I am so very grateful that every member of this house got a bar of the goat milk soap produced from the Fort Valley State University. Thank you. The members voted? Have all members voted? If so, the clerk will lock the machines on the adoption of the Committee of Conference Report on Senate Bill 195. The eyes are 164. The nays are two. And this house has adopted the Committee of Conference Report on Senate Bill 195. Thank you. Thank you. Chair recognizes representative Washburn for a motion. I move that the House agree to House Bill 480 as amended by the Senate. Representative Washburn has moved that this House agree to House Bill 480 as amended by the Senate. The House bill 480 by the House bill 440 is an act to amend part 3 of Article 8 of Article 14 and Title 44. The House bill 480 by the House bill 480 is an act to amend part 3 of Article 8 of Article 14 and Title 44. Chair recognizes representative Washburn to explain the Senate amendment. Thank you, Mr. Speaker. Ladies and gentlemen, House Bill 480 was a good bill that added the registered interior designers to the lean law. It passed the House overwhelmingly. The Senate has amended it with a very simple amendment that has nothing really to do with the content of the bill. It has to do with real estate brokerage and it adds some language that allows someone who lost a real estate brokerage license to be able to retain that license if they were licensed for five years. Mr. Speaker, I ask for favorable consideration and yield the well. Gentlemen has yielded the well. On the gentleman's motion that this House agreed to the Senate amendment to House Bill 480, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the eyes are 167, the nasors 0 and this House has agreed to the Senate amendment to House Bill 480. Chair recognizes Chairman Dickey for a motion. Thank you, Mr. Speaker. I'd like to withdraw the House amendment and agree to the Senate substitute to HB 575. Chairman Dickey has moved that this House agree to the Senate substitute to House Bill 575. Clerk will read the caption. House Bill 575, I represent Dickey, the 140th and others to be entitled to an act to amend Code Section 4857.4 relating to the bona fide conservation use of property residential transitional property and application procedures. Chair recognizes Chairman Dickey to explain the city's substitute. Thank you, Mr. Speaker. Ladies and gentlemen, this is the Macon Dip County O'Loss Bill that went over past this House and went over to the Senate. They made just one little small technical amendment to it and really didn't change the bill at all. So I ask you a favor of consideration for this. On the gentleman's motion that this House agree to the Senate substitute to House Bill 575, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines. Chair recognizes Chairman Newton for a motion. I'm sorry, if all members voted, clerk will lock the machines. On the gentleman's motion, the eyes are 165. The nays are won and this House has agreed to the Senate substitute to House Bill 575. Now, Chair recognizes Chairman Newton. Thank you, Mr. Speaker. I move this House agreed to the Senate substitute for House Bill 454. Chairman Newton has moved that this House agree to the Senate substitute to House Bill 454. Clerk will read the caption. House Bill 454, vice president Newton, on the 23rd, no this is being titled, next to amend code section 33, 20C to the official code of Georgia and Tate of Rillian. I'm a line provider directories, so I just have a five for certain coverage requirements concerning providers that become out of network during a plan year. Chair recognizes Chairman Newton to explain the Senate substitute. Thank you, Mr. Chairman. This House voted 173 to nothing to extend some consumer protections to patients and their families when a provider was changed by the insurer in the middle of a plan year. The Senate's changed really just double the amount of protection. We were offering three months of protection if somebody was canceled by the insurer this up to six months. With that, I appreciate your support for this consumer friendly bill. On the gentleman's motion at this House agreed in the Senate substitute to House Bill 454, all those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the gentleman's motion. The eyes are 162. The nasors zero. This House having as agreed to the Senate substitute to House Bill 454. Chair recognizes representative Levere for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate substitute to House Bill 443. Representative Levere moves that this House agreed to the Senate substitute to House Bill 443. Clerk will read the caption. House Bill 443, member of the Senate of Levere, to the 33rd, and others to be entitled next to amend chapter 12 of Title 51 of the fiscal to Georgia annotated relating to damages. So it's to provide for new requirements regarding the transfer of structured settlement payment rights. Chair recognizes representative Levere to explain the Senate substitute. Thank you, Mr. Speaker. This was the structured settlement protection act. You may recall we approved this unanimously a month ago and I request the Senate made certain changes by substitute to this bill. It's subsequently the same bill the House approved over a month ago and I ask that you please favorably consider agreeing to the Senate amendment. To the Senate substitute. I yielded well, Mr. Speaker. On the motion of Representative Levere that this House agreed to the Senate substitute to House Bill 443. All those in favor of the motion will vote aye of those opposed to vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the gentleman's motion. The eyes are 160. The nays are three. And this House has agreed to the Senate substitute to House Bill 443. Chair recognizes representative Ridley for a motion. Thank you, Mr. Speaker. I move that we agree to Senate Senate. It's too late, Mr. Speaker. My last article she's upset because she figured out it was day 40 and I'm coming home. Would you mind not telling us all that because we don't have much time? It's been a long day. Anyway, I agreed to House Bill 392. Whatever. Thank you, Mr. Speaker. On the motion of Representative Ridley has moved that this House agreed to the Senate substitute to House Bill 3.\n\n92, clerk will read the caption. House will 392 by the representor Ridley the six and others to be titled back to a minute title three the fiscal to Georgia Anteater really not calling beverages says to provide that licenses for retail sale packages about calling beverages for consumption off premises shall be subject to regulation as the distances from schools Chair recognizes representative Ridley to explain his motion Thank you, miss Baker so what happened on House bill 392 This was a bill that we passed in the house that had to do with the alcohol distance between alcohol sales and school Properties so what would the Senate done as they struck school grounds to make it school building still stays 200 yards But it gives the option to the local authorities to be able to navigate that any way that they want to To amendments they made on the bill is basically just structured up Straighten up some deal our language that was a little bit confusing that had to do a hotel motel serving alcohol miss Baker That's the bill and now yield the well On the gentleman's motion that this house agree to the Senate substitute house bill 392 all those in favor will vote I those opposed to vote no in the clerk will unlock the machines What purpose is representative Wade rise Presumed rule 133 that may be excused the vote Gentlemen has there right in the journal will so reflect have all members voted have all members voted if so the clerk will lock the machine On the motion that this house agreed to the Senate substitute house bill 392 the eyes are up 129 the nays or 38 and this house has agreed to The city substitute house bill 392 Chair recognizes Chairman Hogan for a motion Thank you mr. Baker I'm moving to house agreed to the Senate substitute on house bill 591 Chairman Hogan is moved that this house agreed in the city substitute the house bill 591 the clerk will read the caption House bill 591 members and have hogan to the 179th and others being titled an act to amend title 37 the fiscal to Georgia Intended relating to mental health since authorized marriage and family therapists to reform certain acts which positions like colleges and others are authorized Chair recognizes chairman Hogan to explain this motion Thank you, mr. Speaker this substitute requires a department of a behavioral health and disabilities about where 10 13s and 2013s are used at the Information be reported on how many 10 13s and 2013s are done across the state by the district and Reported to the general assembly on the number of 10 13s and 2013s that are done. I Ask your Reckner favorable very vote vote on this bill. Thank you very much On the gentleman's motion at this house agreed in the city substitute to house bill 591 All those in favor will vote aye those opposed will vote no and the clerk will unlock the machines Have all members voted Have all members voted if so the clerk will lock the machine on the Motion to agree to the city substitute to house bill 591 The eyes are 163 the nays are one and this house has agreed to the Senate substitute to House bill 591 I Save the best group look for last to Recognize and thank for their service and that is My office staff I'd like for you to give a help me give a big welcome and thank you to Michelle Spirman Caleb McMicken Keith Williams Holly Pitcock Trooper Gerald Hanna Trooper David James Kim Aiken Isabella White Peyton Clark My chief of staff Spiro Amber But I saved the best for last This was her first session of flying the airplane in the pilot seat Kathy little You Thank all of y'all Chair recognizes chairman percol for a motion Thank mr. Speaker I move that this this house on Hp 498 that we Accept the Senate substitute Representative chairman percol has moved that this house agree to the Senate substitute to house bill 498 to clerk or read the caption House of 498 members and Watson 170 second to be entitled back to a men part one of our two chapter five of total 48 fiscal to Georgia and it's a really property tax exemptions Chair recognizes chairman percol to explain the Senate substitute thank you mr. Spicker if you recall This is the adverb or exemption for ag equipment past 169 to 1 the Senate had a one small provision to I Can't read my writing but level the playing field in purchase of watercraft and that was the extended the bill I appreciate your consideration On the gentleman's motion that this house agree to the Senate substitute to house bill 498 All those in favor of the motion will vote aye those opposed vote no and the clerk will unlock the machines Have all members voted have all members voted if so the clerk will lock the machines On the motion of the gentleman the Eyes are 158 the nasor zero and this house has agreed to the Senate substitute to house bill 498 Chair recognizes We have a supplemental local calendar supplemental local calendar number two the bill on the local calendar is of an agreed disagree Having received the requisite number of signatures required the House delegation wishes to agree to the Senate substitute to the bill the clerk will read the local calendar Mm-hmm House bill 450 445 by Representative Bruce the city of South Fulton Is there any objection to the previous question being ordered on the local calendar the chair here's none the previous question is ordered Is there any objection to agreeing to the Senate substitute to house bill 445? Shall this bill now pass all those in favor of the passage of the bill on the local calendar will vote aye those opposed will vote no and the clerk will Unlock the machines You So we can see that your tablets are not working without everybody holding them up, okay? I didn't write a book about how to do this one now You You Clark will lock the machines on the Beels on the local calendar the eyes are 154 the nasors 0 these bills having received the requisite Constitutional majority are there for past You What purpose does chairman Todd Jones rise? To make a motion state your motion I move that the rules be temporarily suspended so that rule so that he bill may be read for the first time in a scientific committee On the gentleman the clerk will read the caption I'm never to house bill by Representative Jones the 25th being titled an act to incorporate the city of Buckhead City On the gentleman's motion that the rules of the house be temporarily suspended to allow a bill to be read for the first time in a signed to committee Is their objection There is an objection does the gentleman move yes gentlemen moves now We have a number of members that can't vote Oh They're back on okay all right Okay, all those in favor of suspending the rules will vote aye those opposed will vote no and the clerk will unlock the machines You You This vote requires a two-thirds majority If all members voted If have all members voted What purposes chairman Oliver rise parliamentary inquiries states your inquiry isn't it true the speaker that is to that right now April Fool's Day I Sure seems like it Tark will lock the machines on the gentleman's motion the eyes are 105 the nasors 61 the motion has failed You You Chair recognizes representative camp for emotion Mr. Speaker I move To agree to the city's steps the Senate substitute for house bill 574 Representative camp is moved that this house agreed to the city's substitute house bill 574 Although the clerk will read the caption You House bill 574 are of camp 113 first and others to be titled act to amend code section 4113 the fish go to George Antidium relating license to bet the eluce and kennel stable or animal shelters You Recognize this representative camp to explain the Senate substitute Thank You mr. Speaker the only substitute that was made is the name of the bill originally when we voted on this in the house It was the companion local government animal trust fund it has since been changed to local government companion animal trust fund So to be more understandable to local governments Um if there are no questions mr. Speaker I yield the well You On the ladies motion all those in favor will vote aye those opposed will vote no and the clerk will unlock the machines You Have all members voted have all members voted If so the clerk will lock the machines on the Ladies motion the eyes are 156 the nays are three That this house has agreed to the senate substitute house bill 574 So You You All right, we're down almost To the finish line You know Recognize this representative booty for emotion Miss speaker I move that this house agreed to hb 160 as substituted by the Senate You Representative booty has moved that this house agreed to the senate substitute to house bill 160 Clerk will read the caption House bill 160 but it was an abode the 60 seconds being tied on that to amend article 4th chapter 8 in total 48 The fish go to Georgia and Tetted relating to water and sewer projects and cost taxes Yeah They're recognized as representative booty to explain this motion Thank you, mr. Speaker if you all recall in this house hb 160 passes house by 167 boats Hb 160 with spand and minister palatude to allow the citizens of east point college park hate view to call a referendum To implement a one-six water and sewer projects tax Call the most and I will ask that this house. Please vote in favor of this bill To allow the citizens. Thank you And I hear the way mr. Speaker Representative Question before the house is on the agree to the senate substitute house bill 160 all those in favor will vote aye those opposed the vote no and the clerk will unlock the machine What purpose does the majority caucus whip rise? Statue inquiry Caucus have a bill that was pretty important to his local community that just got voted down on a procedural motion I believe that to be true Have all members I'm sorry Have all members voted Have all members voted If so the clerk will lock the machines Chair recognizes representative sames for emotion Thank you mr. Speaker I move that this house agree to the senate substitute of 258 which has the Romeo and Juliet provision to act better and aggravated sexual better a yield the well Representative sames is moved that this house agree to the senate amendment to house bill 258 Clerk will read the caption So Hospital 250 a member of the states 180th and others to be titled an act to amend chapter six and title 16 You know to draw the antenna relating the sexual offenses so as a provider response to state versus Williams Chair recognizes representative sames to explain the senate amendment Sorry mr. Speaker it's late. I just explained the the bill at azuremian juliet to the act better in ag six better Thanks yield to well All the gentlemen's motion that this house agree to the senate amendment to house bill 258 All those in favor will vote aye those opposed will vote no and the clerk will unlock the machine You Chair recognizes the chairman of the rules committee I'm sorry before that Clerk will lock the machines On the gentlemen's motion the eyes are 159 the nasa zero This house has agreed to the senate amendment to house bill 258 Now The chair recognizes the chairman of the rules committee. Let's figure aren't we supposed to have another self-mediciner and have a meeting about 130 You're gonna have it without me Well, I won't be there either Like to make a motion speaker State your motion. I move that all bills is then the Committee on rules be reassigned to the committee from which they came on the gentleman's motion that All bills be reassigned to the committee from which they came Is their objection? Chair here's none and it is so ordered Let me remind you that the post office here at the house requests that we Clean out our desk and take our personal belongings with us tonight And with that the chair recognizes the majority leader of the house And let me say this before he makes his motion You can throw paper but not plastic chair Recognizes the majority leader of the house for a motion Thank you. Thank you, mr. Speaker Mr. Speaker I move that this house adjourned Sinny die On the motion of the majority leader at this house a adjourned Sinny die all those in favor will say aye Those opposed will say no This house is adjourned You",
  "updated_at": "2026-02-13T12:43:18.630573+00:00"
}