{
  "video_id": "stpXVVCPGqA",
  "url": "https://www.youtube.com/watch?v=stpXVVCPGqA",
  "title": "Senate AM Day 27 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 132,
  "summary": "Here is a summary of the Georgia Senate AM Day 27 of the 2025 Session session:\n\n**Overview**: The session featured a focus on legislation, with several bills introduced or referred to committees. There were also some notable moments, including an invocation by Dr. Torin Daily emphasizing the need for unity and bridge-building among senators.\n\n**Key Actions**:\n- **SB 36**: Not mentioned in transcript\n- **SB177**: Not mentioned in transcript \n- **SB199**: Not mentioned in transcript\n\n**Bills Introduced (First Reading)**:\n- Senate Resolution 246\n- Senate Resolution 262\n- Senate Resolution 282\n- Senate Resolution 309\n\n**Notable Moments**:\n- Invocation by Dr. Torin Daily, who called on senators to remember their shared purpose of serving constituents and to be \"agents of reconciliation\" despite political divisions.\n- Requests by various senators to excuse absences of other senators for business inside the Capitol.\n\n**Votes**:\n- No recorded votes mentioned, but some bills were said to have passed or been referred to committees.\n\n**Attendance**:\n- There were several requests to excuse absences of senators for business inside the Capitol, suggesting the Senate maintained a quorum.\n\n**Adjournment**:\n- The transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "On 25% to 50% and others, columns, the Doug command. Senate resolution 246, but Senator Guggetto, the 51st and others, President Donald J. Trump, command. Senate resolution 262, by Senator Couser, the 46th, article five of the United States Constitution, a convention of the states apply. Senate resolution 282, by Senator Bearden, the 30th and others joint study committee on funding for the next generation, 911 sustainability create. Senate resolution 309, by Senator Tillery, the 19th and others, sales or income tax credit, any bill proposing to receive a two thirds vote of the membership of each House of the General Assembly in order to become law required. Mr. President, I can please see your order. It is now time for the morning roll call. Are there any motion to excuse? I recognize the Senate from the 33rd. Thank you, Mr. President. Good morning, y'all. I ask the unanimous consent to excuse the senators from the 44th and 41st for business inside the Capitol. That objection, the senators from the 44th and 41st are excuse. Also, 43. And the 43rd, that objection. I recognize the Senate from the 23rd. Mr. President, I ask unanimous consent to excuse the Senator from the 24th for business inside the Capitol. Objects and Senate from the 24th are excuse. Greg, I have a Senate from the 6th. Thank you, Mr. President. I ask for unanimous consent to excuse the Senator from the 8th. The objection, the Senate from the 8th is excuse. The any other motion to excuse? Sixth here, we'll call the roll senators. I'm sorry, Senator from 29th. Yes, ask for unanimous consent to excuse the Senator from the 20th for business inside the Capitol. The objection, the Senator from the 28th is excuse. Senator from the 14th. Mr. President, I ask unanimous consent to the senators from the 35th and 39th, I think, the excuse for business somewhere. Thank you. The objection, those conducting business somewhere, will be excuse. Secretary, we'll call the roll senators. 65th, you're present by voting, yay, switch. Secretary, unlock your chain. Senator from the 9th. unanimous consent to excuse the Senator from the 7th. The objection, when we get started, Senator from the 7th, the 8th, excuse. Senator from the 30th, you got your light on, is there a reason? Police, excuse. The Senator from the 30th. 30th, she's standing right beside you. You know, they say this chamber is getting older and older by the day. All right, it's now time for the morning devotion. All senators, please take your seats and see all conversation. I would ask the doorkeeper, excuse the chamber at this time. Recognize the Senator from the 38th to lead us in our pledge and introduce our chaplain of the day. Senator. Good morning, colleagues. Please stand for the Pledge of Allegiance. A Pledge of Allegiance. Good flag. A Pledge of Allegiance. Good flag. The 9th, the 38th of America. Consider Republic. The original stands. One nation under God. In the visible, the delivered needs and justice for all. And now the Georgia flag. A Pledge of Allegiance. The Georgia flag. The Central, the Georgia stands. Which is some justice, moderation, and preparation. All right, good morning, colleagues and those in the gallery. I am very honored and excited to introduce Dr. Torin daily as our pastor of the day. Dr. daily is a graduate of the Florida State University where he graduated in 1999 with a bachelor's degree in history. He has completed graduate work at the inter-denominational theological center, Morehouse School of Religion, where he earned his master of Divinity degree with honors in 2003, as well as the historic pain theological seminary, the oldest African American seminary in the country, where he earned the Doctorate of Ministry degree. Dr. daily is a member of the WEDB Du Bois, honor society, Florida State University chapter, and Phi Alpha Theta History Honor Society, Florida State University chapter. While at Morehouse School of Religion Dr. daily received many awards for his service and academic excellence and has also been the recipient of numerous accolades for his community involvement, particularly in the area of education as well as for his work with youth serving organizations. Dr. daily is married to Lady Tiffany Nicole daily. They are the proud parents of two amazing sons, Torin Nicholas and Taylor Nicholas. Dr. daily has truly been anointed by God through the power of the Holy Spirit to deliver a word to his people and to minister to their needs. He has shown great energy and enthusiasm for the work God has assigned to him and the place God has stationed him. As he builds on the excellent example of courage, creativity and surrender, which is the legacy of his father, the late, the late Dr. Charles D. Bailey. He moves on to spread God's message and ministry for generations. Dr. daily is the pastor of friendship community church, which is also my voting precinct, and I have had the honor and privilege of visiting Dr. daily in his church. One thing that really stood out to me was his charge to me from the pulpit to find ways to work together to get things done for Georgia. So I'm just very honored and thrilled to have Dr. daily here with us today. Everyone, Dr. Torin daily. Good morning. Certainly to Senator Camp and Senator Jones and to all those who serve this great state in the Senate, those who are part of the gallery, we certainly praise God for for you being here. I would like to thank the president for just the next little while. I want to talk from this thought as I look at my good friends, Senator James. Called to unity. That's our calling. Called to unity, living out our shared purpose as we build bridges. As Senate staff, friends, as chaplain of the day, I stand before you on the eve of Ash Wednesday. Tomorrow, we who observe it will begin lent. We have a time of introspection, a time of renewal. And as we prepare our hearts, we want to begin here by reflecting when Jesus's command, a new command that won a different Holy Day, Monday, Thursday. He gave to his disciples of both yesterday, as well as today. It's a simple but powerful command. Jesus says, love each other as I have loved you. Please understand this call to love. It is not some abstract idea. It is a call to action, especially not just in your work, but in our collective work in this great state. And so here, here are just a couple of reasons why, why we, why we have this shared calling. Each of you has been called. All of us have been called to serve in various capacities, the people of Georgia. And so we share a fundamental purpose to improve the lives of our constituents. Just as branches draw life from the vine, we draw our purpose from the needs of those we represent. And so this lent, let's commit to remembering that our service is about others and not ourselves. We're called to serve this, not just serve us. But here's another reason why, why we've been called to this, to this great work is because we're bridge builders. We've been called to be people who build bridges, bridges of reconciliation. There is no doubt, no matter what side of the aisle you are on our political landscape is often divisive. Even perhaps more divisive now than at other times in history. But those of you who are history majors like myself, we do know that there have been other times in our nation's history in which we've been even more divisive. Yet we are called to be bridge builders, just like, just like those who have preceded us in the great work of this country and state. We're called to be agents of reconciliation. And we're called to be agents of reconciliation because love demands it, love demands empathy, love demands a willingness to understand even opposing viewpoints. As those of us who will receive them, as we receive ashes tomorrow, let's reflect on how we can foster this kind of unity. Now, how do we put these principles in action? Let's be real practical about it and I'm done. Listen, really listen, schedule times to listen to constituents from diverse backgrounds, not just racially or ethnically, but also socioeconomically, politically, schedule time to listen to constituents who have different backgrounds actively seek input and feedback prioritizing your understanding of their needs over promoting our various agents. Stephen Covey says that we should always seek understanding before even seeking to be understood. That's important as we build bridges and as we serve the needs of the citizens of this state. Ask, that's the second practical way for us to be able to heed this calling, ask when considering legislator, when considering any of the work that you engage in, ask, how will this impact the most vulnerable in our communities? Paratize policies that address the needs of those who are often overlooked, those who are voiceless. Here's the third thing, commit, commit to engaging in civil discourse. Let this state be a paradigm for the other 49 as we engage in civil discourse even with those with whom you greatly disagree. Seek opportunities to cross the aisle and collaborate on shared issues, issues that even go beyond just road designations. This might involve having to get together outside of your time here in the chamber, but it will be time well spent. Here's the last thing, when engaging in debate, depersonalize, depersonalize, when engaging in discourse, focus on the issues and not personal attacks and all of the stuff that we've been doing. All of the stuff that we see too much in the media, whatever outlet you watch. Let's practice active listening, acknowledging the validity of opposing viewpoints even, again, if you don't agree. It shows it conveys respect and begins to help us build bridges of understanding. Can I give you just one last super practical thing that you can do as you build these bridges, especially during this season of length, when you have the opportunity to do so, even if you have to wait until Linda is over because you promise to give up this and give up that, and then I'll just pick out, and that sounds strange to hear from a pastor, but just understand it is difficult to hate people once you have enjoyed table fellowship with them. And so go eat together, convene over food together. There's something about food that brings people together, and once you recognize that basic need that each and every one of us has, it's difficult to despise, it's difficult to disrespect, it's difficult to engage in discourse that becomes too personal. These practical steps, those simple, including pegging out, can be profoundly impactful in our work. By prioritizing shared purpose and by building bridges of reconciliation, we can truly embody the love that we are called to. This, let us strive to be servants, not people all about serve us. Let's strive to be selfless and never selfish. Senators be known for your compassion, be known for your unity, be known for your unwavering commitment to the people of the great state of Georgia. May the peace of God, which truly surpasses all understanding, guard your hearts and minds in Christ Jesus. Amen. Let us pray. Oh God, our provider, we're so thankful to you for all of your tremendous blessings. Oh God, we ask that you continue to lead us and guide us in the great work that you have for each and every one of us. In our various roles and capacities, help us never cease to see the humanity in each other. Help us to never cease to see the humanity in the people that we meet, the people that we greet, the people that we are called to serve. I thank you for my greatest role model, one who serves as great role model for us all. History records his name as being Jesus. So it is in his name that we do pray. Amen. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. We have a doctor of the day. Thank you. Thank you. Thank you. Thank you. Thank you. Hello everyone. It's my pleasure to serve today and I really want to take this opportunity to thank all our Georgia government and people to support medical college of Georgia especially research and Augusta University. Thank you so much. We will continue work on clinical practice education and also research to improve the health care of our Georgia people. Thank you so much. Thank you. Are there any unanimous concerns? Thank you. Thank you, Mr. President. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you very much, Mr. President. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. President. Thank you. Thank you. Thank you. Thank you, Mr. President. Thank you. Thank you.\n\nSo joining us today here at the Capitol, and I would like to welcome them and acknowledge the critical role that they play in standing up for the rights of the LGBTQ community. We welcome you and encourage your participation in the political process. It's very important as we consider the policies that we adopt or reject here in Georgia. Thank you for being with us today. The Human Rights Campaign and the Georgia Equality. Thank you. Thank you, Senator. I recognize Senator from the 21st. Thank you, Mr. President. As a native from New Orleans and Louisiana, I want to wish everybody a happy Mardi Gras today's Fat Tuesday. So get you some King Cake and enjoy an adult beverage tonight and celebrate. Happy Mardi Gras. We're going to have Senator from the 35th. Thank you, Mr. President. Good morning, colleagues. I just wanted to step up here really quickly to recognize a few constituents who were here at the Capitol. First, I wanted to recognize my friends from Park Place who are celebrating their 50th anniversary of doing business here in Georgia and across the country. So welcome to the chamber. And I also wanted to join my colleague from the 36th and welcoming several allies who are here in the building, including the ACLU of Georgia, the Urban League, the League of Women Voters, and the Georgia AA CP who are up here in the gallery. I believe, please stand and let's give them a warm welcome. Thank you all so much for being here and thank you so much for all the advocacy and the work that you do in our communities across the state and across the country. Thank you. Thank you. I hope you enjoyed that. I hear the well. Does any other Senator which speak on a point of personal privilege? You have before you consent calendar or privilege resolutions. Does any Senator wish to remove a resolution from the consent calendar? Chair here is not in resolution. The public consent calendar is adopted. Are there any motions that withdrawal commit? I ask for unanimous consent for the following bills and resolutions to be engrossed. SB177 and SB199. Secretary, read the caption. Thank you, Mr. President. I move that unanimous consent to excuse the Senator from the 25th of business inside the Capitol. The Senator has moved motion and grossment on SB177 and SB199's objection. There is objection. Do either of you wish to speak to your motion or your objection? No, everybody waves. All those in favor of the motion will seek to find, I say, voting the A switch. All those opposed? No. Secretary and law and machine. All in motion. The motion to engross the A's are 29 and the A's are 17 and this motion has prevailed. All right, heading to the rules calendar. Secretary, please read SR-8. Senate resolution 8 by Senator Ann Votarpti, the 31st and others resolution honoring the life of memory, deputy, Brandon Cunningham, and dedicating an intersection to his memory and further purposes. Mr. President, the committee on transportation recommends this resolution to pass by sub-sturess sub-lussed-mitted Senator Dullesall, chairman. Mr. President, the committee on transportation and the hours of long substitute to Senate resolution 8, resolution dedicating certain portions of the state highway system and further purposes that please the order, Mr. President. I beg your pardon. I beg your pardon. I beg your pardon. Thank you, Mr. President. Good morning, everyone. Senate resolution 8 honors the life and legacy of deputy, Brandon, Tyler Cunningham, dedicating the intersection of stave out 92 and stave out 120 in Pauls and County, Georgia and his family. To Maria, Elena Cunningham and Kevin Cunningham, he was a graduate of Mary at a high school and eventually joined the Sheriff's Department in 2020. Deputy Cunningham was known for taking pride in his role as Deputy Sheriff for the Pauling County Sheriff's Office, expressing selfless dedication and question integrity when protecting his role as Deputy Sheriff's Office. Deputy Cunningham had served in the Pauling County Sheriff's Office for over four years and excelled in his role of providing service and protection to our community. Deputy Cunningham was only 30 years old when his life was taken from him on August 17th of 2024 in the line of duty and responding to a domestic dispute. I just want to say on behalf of my family, the Senate, our state, we are very proud of the legacy that Brandon Cunningham left to Pauling County, Georgia. To the Pauling County Sheriff's Office, our constituents and those that serve on the front of the scenes every single day and that were there that day, Brandon passed away. Our thoughts and prayers are with you every single day. It is something we will never forget and we will make sure that Brandon Cunningham's legacy and memory is always remembered and it lives on forever in Pauling County, Georgia. Mr. President, without I yield the will. Thank you senator does any other senator which speak for against the measure Chair here's none is there objections to the previous question being ordered chair here's none the previous question is ordered Questions on the adoption of the committee substitute is there objections to adoption of the committee substitute? Hearing none the committee substitute is adopted Is there objection to agreeing to the board of committee which is favorable to the passes of the bill the adoption of the resolution? Excuse me chair here's none the before the committee is agreed to is there objections to the main question being ordered Chair here's none the main question is ordered questions only adoption the resolution by substitute all those in favor of vote. Yeah, I'll pose nice They're not the machine You You On the adoption of the resolution of the resolution substitute by substitute Excuse me. Yees are 49 and the nays are zero and the resolution have received risk that constitutional majority is therefore adopted by substitute Quick little thing let me get everybody's attention real quick quick. I know we're missing on one of our members Senator host Hitler one of his family members was involved in bad and accident this morning So y'all keep your thoughts and prayers in his mind in mine because don't know how serious accident was Just know he had to leave here early to go see about things and so Hopefully hopefully is it's not it's not severe but anyways if y'all might want Keep keeping many thoughts and maybe give him a text and encouragement and everything check on see if we need to do anything for all right. Thank you Senate resolution 231 in the sector Senate resolution 231 by senator albers and 56 and others the resolution honoring the life of officer Jeremy Levant and for And dedicating an interchange in his memory and for other purposes Miss president suddenly can we have transportation recommends this resolution to pass respectfully spend it in our dolls all chairman that police you order miss president I get out of service 56 You Thank you mr. President I bring before you Senate resolution 231 on behalf of the Delegation from the city of Roswell the senator from the 14th the 21st and myself Tonner the life of officer Jeremy Levanti Where we will rename the Georgia 400 Holcomb bridge road intersting change in his honor To forever remember this here early husband a brother a son and a friend Officer of onti was only twenty four years old He was born in austral Georgia His end of watch where he lost his life was on February the 7th 2000 and 25 He was a graduate from King's way Christian school in Douglasville And earned his bachelor's degree from Georgia State University He began his career in 2021 The city of Roswell police department But unfortunately that night he was suddenly and Deliverately murdered by a faceless coward I ask each one of you to continue to remember all those who service an office And I ask you to support this important resolution so everyone who goes through one of the busiest intersections in our state We'll always remember this young man his service and sacrifice is one of Roswell's finest a True hero in the community the center from the 14th 21st and I are honored to represent I yield the well Any one else wants to speak for against the measure hearing none But the incident which speak against the measure chair here's none is there objections to the previous question be in ordered chair Here's none of the previous question is ordered is there objections in agreeing to the report of the committee Which is favorable to the adoption the resolution chair here's none the report the committee's agreed to is there objections to the main question be in order Chair here's none of the main question is ordered question is on the adoption the resolution all those in favor of the resolution of the Yay all pose nay secretary one month machine You On the adoption resolution the a's are 49 the nays are zero the resolution have received recisting a constitution majority is there for adopted Moving on to Senate bill 193 secretary read Senate bill 193 Senate bill 193 by senator brass to the six and others of those being tied on to men chapter four a total 20 that has to go to Georgia Annotated related to vocational technical and little education So I authorized the state board of technical college system of Georgia to establish the adult workforce high school diploma program to provide for the selection of third-party providers to administer the program to provide requirements for approved program providers to provide for just burstment of funds to approve program providers to provide for reporting to Revive for definition survive for related marriage through people for the laws and for other purposes Mr. President the Senate committee on higher education recommends this bill to pass by sub-suicide we submitted senator Burns chairman Mr. President sent a committee on higher education office following substitute to Senate bill 193 built to be 10 to 9 to a Manchap before a total 20 the fish country Georgia annotated related to vocational technical and all education still authorize the state board of Technical college this major to establish the adult workforce high school diploma program and for other purposes that we see what our Mr. President Senator from the 43rd for purpose you rise Arise Mr. President to ask for unanimous consent to excuse the senator from the 26th Without objection from the 26th is he used You Recognize senator from the 6th Thank you Mr. President colleagues. I bring to you Senate bill 193 the adult workforce high school diploma program This simply picks up where our technical college leaves off they technical college currently is Allowing people from age 16 to 21 to go back to get their high school diploma This allows people from the ages of 21 to 40 to go back and do the same and The way the structure is you can see in lines 117 through 131 the pay structure most of the payments are done on the Towards the back end of the program Really encouraging The program to get to get their their money based on success So encourage your favorable consideration of Senate bill 193. Oh yield for questions. You know questions. Thank you Senator from 15 United muskens Center excuse the senator from the 26th He's already been excuse senator Does any other person wishes to speak for against a measure? Chair here's nine is there objections to the previous question being ordered chair here's nine previous questions ordered Questions only adoption of the committee substitute it is there objection to the adoption of the committee substitute Here you know the committee substitute is adopted is there objection to agreeing to the committee Which is favorable to the passes of the bill chair here's nothing Committee is agreed to is there objections to the main question being ordered chair here's none the main question is ordered All in favor of the bill vote yay all opposed nay secretary and a lot of machine You You On the passes of the bill the a's are 48 the nays are zero this bill hemorrhage Ricks that constitutional majority is therefore a path Moving on to Senate bill 199 It's a Senate about 199 by Senator Watson Lee Levin than others built me to the next to men chapter five at title 21 You officially a Georgia annotated really to government transparency and came in finance Just arrived to the state ethics commission shall not accept the reject complaints made against candidates 60 days prior to an election To revise provisions relating to reporting income on personal finance disclosure statements for office holders to provide that commission Shem out publicly released home address Information in its possession to revise a lobby's reporting requirements to make the reporting dates for such requirements more uniform to provide for later matters To arrive for an effective date through pill-pilial booking laws and for other purposes The Senate command ethics recommends that this bill do pass by substitute respectively minutes and a Watson chairman Mr President suddenly on ethics offers to following substitute to Senate bill 199 to be able to be in touch now to mind chapter five of a total 21 of the official Georgia annotated only to government transparency and campaign finance So I subscribe to the state ethics commission shall not accept the reject complaint made against candidates 60 days prior to an election To write that campaign and personal finance disclosure reports for local elected officials shall be filed but the commission is that of locally to write that Certain local officials shall from the video to complete all sexually required training and further purposes that completes the order Mr. President Recognize senator from the 11 Thank mr. President Members I do bring before you Senate bill 199 I want to first thank our State ethics commission and our executive secretary mr. David Amani who's who's up in the balcony with us who brought some of this language forward and And it's an effort to provide uniformity It's an effort to streamline. It's an effort to simplify and provide safety for Members of the legislature and so honored to have this language it isn't ethics bill So I'm gonna try to be quick about it But it was 26 pages long, but I want to make sure that we kind of touch on everything so that everybody knows what we've got going on here Sex starting with section one. This is dealing with filing complaints We're just extending the the the period out to 60 days so that we don't have those last-minute accusations That are that are brought forward that the commission doesn't have time to vet out That's what we're doing there section two is the largest section This is where we're returning our our local filing obligations back to the state They were at the local they weren't the state then they went to the locals and we're bringing them bringing them back to the state This also Changes our campaign committee disclosure reports and provides them to be filed quarterly every year This will be January 31 April 30 July 31 October 20 those are still Close in time to the to the primary and general elections This also has some language with our with our packs to allow them to conform to to the new quarterly reports that that we have to comply with It also requires them to keep separate checking accounts um, but then also Retired and defeated candidates currently retired candidates have more Filing and rules they have to follow than then defeated candidates So all that is is a part of section two um Moving on to section three This is dealing with our our financial disclosure reports uh, having those filed on April 1st of every year instead of alternating between either the seventh or 15 days post-qualifying In election years and July 1st of non-election years Um again, there's some uniformity being placed in the code here to to keep everybody up to date and on the same page This section also creates a range on our financial disclosures Know it takes time things are difficult Especially on the farm you you don't necessarily maybe know where you are But we're setting that up on ranges you can see those uh within the bill so that that's clarified Section four is uh, they them with safety Uh, that's where they're gonna redact some of all of our addresses They'll have access to those but as you know, we've had some issues across the state uh dealing with that Section five is uh mainly for our friends in the hall. It's dealing with lobbyists reporting and allowing them to report once a month Every month for the fifth on the fifth day of the month and then we're collapsing all those into one report So if they don't get it in this month, they're gonna get it in next month Again just to try to streamline things provide uniform uniformity uh across Ethics within our state Um, that's what the bill does mr. President. I think this is a very good bill. It was unanimous in committee. We've\n\nAnd I know for me personally I have to you know hire someone to keep up with this stuff because we have personal lives And we have jobs and families and it gets very difficult sometimes to keep up with all this stuff So that's what the bill does Mr. President. I'll be glad to take any questions if there are any and I'd appreciate your support You do have a one question here Senator. I'm breaking down the center for the 27th Yep, thank you, Mr. President senator yield. Yes, sir. I have a question about section three of the breakdown on income I know the currently statewide elected officials have to provide I guess dollar specific sources of income We and I believe county commissioners and city councilmen need to essentially provide Where they work, but not necessarily income levels So with this range these ranges it are outlined on lines 572 to 581 I know you're looking for it. I'll wait for you. You good Um, is that an adjustment to the current statewide or is that and is that adding that to the plate of other elected officials where Income ranges need to be stated. This is this is just statewide. Okay, you fairly yield. Yes, just make sure I understand So for the statewide is it currently have to do it to the dollar? We're putting them in a range scenario We're not changing that for any other elected officials. All right. Thank you senator. All right Mr. President if there are no other questions I'll Be glad to yield the well and I greatly appreciate your support. It's a good bill Thank you Does any other senator wish to speak for against the measure? Chair here's none is there objections previous question be in order Chair here's done the previous question is ordered Questions on the adoption of the committee substitute is there objection to the adoption of the committee substitute Hearing none they can be substitute is adopted Is there objection to agreeing to the poor committee which is favorable to the passes of the bill? Chair here's done for the committee is agreed to Is there objection the main question be in order? Chair here's none the main question is ordered Questions on the passes of the bill by substitute all those in favor vote. Yeah, I'll pose nay secretary and lot of the machine You You I won the passes of the bill, the A's are 55, the A's are zero. The bill has received a request that constitutes a majority of the bill's. It's a very strong show. We're the Senator. Secretary Reed, Senate Bill 91. Senate Bill 91 by Senator Chillery, the 19th, and others, the bill's been entitled to amend Part 1 Part 1 of Chapter 18. I'm Title 45 of the EFISCO Georgia Annotated. We're led to state employees' health insurance plans, thus to prohibit the Board of Community Health from entering into Excudium or Newing, a contract or contract with any pharmacy benefit manager who owns or has ownership interest in any retail pharmacy or any legal entity that contracts with or uses such pharmacy benefits manager to provide for a related matter, to be looking for other purposes. Mr. President, the Senate Committee on Health and Human Services recommends this bill to pass, or is fact-blues-win, it's under Watson Chairman. That can be seen or heard from Mr. President. Right now, it's sitting from the 19th. Thank you, Mr. President. Members of the Senate, bring to you Senate Bill 91. It's pretty simple. Could have probably fit on one page. I think it has a lot of impact, or potential for impact, for our state for years to come. All Senate Bill 91 says is that if you're a PBM, a pharmacy benefit manager, that you can't also be the owner of a pharmacy, so you can't be vertically integrated and then compete to be a part of our health insurance plans. There's a reason for this. You see, we have a history in our country of realizing that vertical monopolies can create a problem. You don't have to look back any further than Teddy Roosevelt to see that, and what he did in the early 1900s was standard oil and other big companies there that said, hey, listen, if you control all parts of production from bottom to top to bottom, then you can control prices. And if you can set prices, then the free market can't work. We've seen a more recent example of this, though, in AT&T and the baby bells, when the federal government in the early 1980s came in and said, hey, listen, you own communications in our country. That's such that we're going to need to break it up and make sure that there's a fair, fair playing field. We saw what it did in the future, and even into today, with our telecommunications prices. We've experienced this issue with PBM's pharmacy benefit managers. They start off as a great thing. I think they have a very great purpose. In about 2005, the state moved to employ pharmacy benefit managers to help control costs for our state health benefit plan, and also in our Medicaid programs. And they had a great intent. What we wanted the pharmacy benefit manager to do is to step in and say, hey, listen, if someone's on a name brand drug, and now they can move to generic, and it's cheaper, then we should encourage them to do so if it saves overall state dollars. However, what we've seen now is that insurance companies and sometimes pharmaceutical manufacturers have realized that the game to be played is to own the PBM as well. Well, why would you want to own the PBM? Because the PBM, the pharmacy benefit manager, sets the rate at which the pharmacy, the prescription, is sold to the pharmacist, whether those are independent pharmacists or pharmacies that are owned by the PBM itself. And when you can set the rate of payment to your own pharmacy at a higher rate than you set the payment, the rate of payment to your competitors, well, that creates a huge free market issue. 80% of the market is now of the pharmacy market is now found in three companies. And those three companies are owned by PBMs, and those PBMs are also owners of insurance companies. And I don't know if the insurance company bought the PBM, that then bought the pharmacy, or if the pharmacy bought the insurance company, that then bought the PBM, or if the PBM led it from the beginning. I don't know how that happened. But what I do know is that we've now ended up at a situation where a company, a PBM, a pharmacy benefit manager, can tell an independent pharmacist that they're only going to be able to charge or have to pay, that's up $3.60 for a drug, where they can turn around to their own pharmacy that they own that just happens to be aligned in ownership with the PBM. And charge 12 or 15 or $30 for the same exact prescription. You've seen this in your district, too. You've seen it and heard it from your independent pharmacies. I just don't think it's fair. So what this bill does is strikes out to say, if you want to be a participant in our health benefit plans, you got to pick which one you want to be. You want to be the guy that sets the price, or you want to be the guy that sets the price, which can't be the guy that sets the price instead of price higher to pay yourself instead of lower price to pay your competition. This big business, I'm not going to shy away from that. And there's folks in this building that this will upset. But I think there's also folks in this building that it protects. The folks that protects are little guys. Folks that will be upset about it, well, they're the bigger guys. I know I don't have all of you with me on this bill, and that's okay, too. But I hope you'll think back about the fights that are important, and let it realize that if we're level in the playing field, that it's better for everybody overall. Just like Teddy Roosevelt did in the early 1900s, we're just trying to take a step forward towards doing that now in this sphere, separate industry, same issue. Mr. President, if there are no questions, I'll yield the well. But happy to take questions. You do have a couple questions, Senator. I'm recognizing from the 29th. Thank you, Mr. President. This is Chairman Yeal. Yes, sir. Chairman, first of all, I'd like to thank you for invoking the name of my hero, President Theodore Roosevelt in your presentation. But I'm curious, is it not true or have you fully considered the impact this might have on the state health care benefit plan? I hope I've considered the impact it may have. Senator Furley-Yield? Yes, sir. Senator, could you tell us what impact it would have as far as who would be able to bid on the health care benefit plan? It would say, if you own the retail pharmacy and your A-Farmacy Benefit Manager, that you can't. What I hope would happen is that those companies that do own both would decide which one they want to be, or potentially insulate themselves by splitting off and making sure that they had walled off with some people call it in business a Chinese firewall, so that they would not be able to negotiate with their own companies to pay them more than their paying those who aren't necessarily associated with their own companies. Thank you. Do you feel the ill? Yes, sir. So, Senator, let's say your hypothetical does not happen that the individual group state as are. Would that, do you feel knowing the lay of the land as you do working on this bill, would there possibly be limited amount of individuals or companies that would qualify to bid on the state health care benefit plan contract? There could be, but I think the dollars involved in the state health benefit plan are why this would not, well why your scenario would not occur. The state health benefit plan is a billion billions dollar contract. So, what we would want to have happen and what we think would happen is since you've got so much dollars that play there, those companies would then insulate themselves from their PBM, they do that Chinese firewall, so that the PBM could not set the price for the retail pharmacy owned by the same company at a higher rate than it sets the retail price for those who aren't in vertical integration with that monopoly. Thank you, Senator. Do you yield for one more question? Yes, sir. But, Senator, is it not true that these companies represent states and others throughout the United States? So, our state health care benefit plan is only one small piece of their overall business model. So, the fact that they would lose a piece of that, and we look at the billions of dollars that big pharma makes every year and that our insurers make every year, and that other components of this monopoly, as you call it, of health care throughout our country that I think we've gotten someone accustomed to, George really wouldn't factor in that big of a part of their business return on investment if they're not able to do one health care benefit plan. Is that not a real possibility? I think it's a possibility, but I don't think it has a high probability. Thank you, Mr. Chairman. I appreciate you, sir. We're going to have Senator from the 20th for a question. Thank you, Mr. President. With the Senator Yeal, yes, sir. Senator, this, thank you for bringing this bill. This is a conversation that certainly needs to be had, and certainly a conversation we've had over the last, I would say, at least six years in this body. I'm not a fan of PBMs because of the lack of transparency and the rebate schemes and the gaming of the system and the fact that it puts our independent pharmacies oftentimes at a major disadvantage. So I applaud you for bringing the bill. I think your idea of firewall and off the PBMs that own pharmacies is a good approach to require that type of firewall so that they can't manipulate things to their advantage at the detriment of independent pharmacies. I am going to get to a question in a minute. I do, I am aware, though, however, is it true that independent pharmacies also avail themselves of pharmacy benefit managers because of the call savings that you spoke to. And if they are availing themselves of pharmacy benefit managers, they can't bid on it either. I tried to be fair across the bill before. I want to further you know, sir. I thank you told us just a few minutes ago that this pharmacy benefit manager owning pharmacies now controls about 80% of the market. Is that what you found out? Yes sir, that's what the statistic was in 2023 that was roughly 180 million patients at that time. So how do you square your bill with that fact and not hurt Georgia consumers in precluding Georgia consumers to avail themselves of prescriptions from a system that controls 80% of the market? Very fair question. I think the only way in Georgia we can do it is to use the power that we have that is almost 70% of the market in certain areas with the state health benefit plan. We have to use our own bully pulpit our own power back. So that's what this bill seeks to do. Say hey, we can be a driver of health care cost as well. And the state health benefit plan is our best way to drive health care results and costs in Georgia. Would you further yield, Senator? Yes sir. This bill it seems to me work to pass and be signed in law is going to have a significant fiscal impact on the state of Georgia's budget. Have you gotten a fiscal note on this? I don't think it will. I don't think it needs a fiscal note for that reason. One, we're not in a procurement right now on the state health benefit plan. We're just saying hey, when this thing comes back up to bid, that will have to be discussed. And if what I do think will happen again, folks aren't going to let that billion dollar contract roll by them. They're going to Chinese firewall off their PBM from their pharmacies, which is exactly what we think is fair to begin with. If the pharmacy, if the PBM can't pay its own pharmacy more than it's paying the independent pharmacy, we don't have a problem. I don't think anybody's against the idea of PBMs. It's how they're working in practice. Senator, I don't want to beat this death, but would you further yield? Sure. You keep talking about a Chinese firewall. I'm not a big fan of China, first of all. But I don't see anything in the bill that allows for that. I mean, it looks like to me if this bill passed, and we're signing it all all that the state of Georgia would immediately have to terminate their contract with CVS, Caremark, that owns CVS, and we would immediately then be in a procurement process. On the spur of the moment, it looks like to me we would have to make a change effective July 1, 2025, which does not seem a prudent business posture to be in for the state of Georgia. Is that a concern of yours? It is not a concern of mine in this instance. I think that they could restructure their ownership overnight if they had to to avoid bankruptcy. They could restructure their ownership overnight if they thought there was a threat of a lawsuit. They can restructure their ownership structure overnight if they want to stay a member and be a provider for the state benefit plan. And with the center further you. What if this bill were to be law and we change and we're not using CVS Caremark anymore, let's say we're using a PBM that does business with Walgreens. Walgreens right now is I think up for sale. That's what I'm reading in the paper, a private equity firm maybe buying them. What if during the middle of fiscal year all of a sudden Walgreens gets bought by a private equity firm that also owns a PBM and we have enough. It just seems like it's going to put the state of Georgia in a precarious position to me. Does that bother you? No, sir. And the reason why it doesn't is because of the while we're here. If the PBMs had not already been vertically integrating and setting prices such that their own retail pharmacist benefited at the expense of independent pharmacists, the ones that are sponsor in our tea ball teams, the ones that are sponsor in our chambers of commerce, then we wouldn't be here. So I kind of think they've put us in this position, not us putting ourself in this position. Last question, Senator. Isn't it true that I love the trust-busting mantra and I love Teddy Roosevelt and I love you. I just, I know I love them ten or what you're doing here, but I just think it's the wrong way to go about it. If you say that that's how you feel, then I have to believe you, Senator, and I'll sit down beside you and still be your friend. Thank you. That is so sweet. Very good. I had a center from the 26. Was that the year? Yes, sir. Isn't it true that most of us use our private pharmacists around the state? We have relationships and everything else with them. I think a lot of people do, but I think the statistics will show us that 80% of the markets in those four big ones. And it also true that these pharmacists get most of their medications from the large pharmaceutical competence. I think that's probably true. And it also true that they will charge the independent pharmacists more than what they celebrate. And they are operating what the prices are to the constituents of those folks who go to the drugstore. The prices set with the pharmacy benefit manager, yes, sir. Mr. President, if there are no further questions, I'll yield the well. I think the members here have spoken pretty clearly. They understand that there's some price fixing involved that we're trying to break up. And I ask your help in doing so. And thank you so much for here. I made a death. You have no further questions. I'll yield the well. Does any other senator which speak for against the measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none of the previous questions ordered. Is there objections to the report of the committee, which is favorable to the passage of the bill? Chair, here's none of the reported committee has agreed to. Is there objections to the main question being ordered? Chair, here's none of the main questions ordered. Questions on the passage of the bill? All those of favorable? Yeah, you pose nay, secretary, and lock the machine. You have to be careful. The senator from the 19th, he's undefeated. All the passes of the bill, the a's are fitted to the bill. All the passes of the bill, the a's are fitted to the a's are two. This bill, hammer, seed, racer, constitutional majority is therefore passed. It's recognized as the senator from the 20th, what purpose do you rise? Parliamentary inquiry. The state of inquiry. That was pretty strong by the senator of the 20th, why not? I can see you getting missy out too soon. Moving on, Senate bill 36. Senate bill 36 by senator Assetzel of 37th and others, billed to be turned on act to amend. Title 50 of the fiscal year, Georgia annotated with the state government, says to provide for the preservation of religious freedom, to provide for the granting of relief, to provide for definitions, to provide for instruction, to provide for statutory interpretations, to provide for short title, to provide for legislative findings and terminations, to provide for effective date to appeal to the public in laws and for other purposes. Mr. President, Senate committee of judiciary recommends that this bill do pass, submit it, and then restrict it and chairman. Mr. President, minority part to Senate bill 36 has been attached. I completes the order, Mr. President. I'm going to ask Senate from 37th. Thank you, Mr. President. Ladies and gentlemen, Senate bill 36. Senate bill 36 is the state version. The federal law passed in 1993 in an overwhelmingly bipartisan way called the Religious Freedom Restoration Act. Mr. President, every Georgians should be free to worship and exercise their faith without unfair federal state and local government intrusion. Senate bill 36, the Religious Freedom Restoration Act protects ordinary people from unfair state and local government intrusion by exactly mirroring the bipartisan federal law in a way that protects people from unfair federal government intrusion and their basic right to practice their faith. The federal referral law was passed almost unanimously in 1993, the U.S. Supreme Court ruled in 1997 that the federal referral only protected people from unfair federal government intrusion and would not protect people from unfair state and local government intrusion on their basic rights. Since then, 39 of 50 states have adopted their own state referral laws or seen their courts adopt referral level protections about judicial ruling to protect people from faith, people of faith from overreach by state and local governments. In 2016, Georgia passed a state bill that included language dramatically different than this bill and dramatically different than the federal Religious Freedom Restoration Act and in Governor Nathan DeVille vetoed that bill. In 2017, our Attorney General confirmed that without a state level referral that it's before you today, Georgians do not have full religious protections allowing state and local governments to infringe upon people's faith for any rational basis. That's the lowest level of legal protection that exists under law. Since 2021, Mr. President, eight states have passed referral laws. In 2024, just last session, Utah, Iowa, and Nebraska, passed referral laws by near unanimous majorities and in 2025, just yesterday, the Senate and Wyoming passed a Religious Freedom Restoration Act, essentially the same language that is before you today by a vote of 28 to 3. Match with the Wyoming House's action three weeks ago, 57 to 3, passing the same language. Georgia is the only state in the nation, the only state in the nation that has a Republican House, Senate, and Governor that does not have these basic religious protections and many states that are blue states have these as well. It's not only Republican states that have these protections. Riffor puts their First Amendment right of free exercise on the same level of protection as the First Amendment rights of speech, assembly, and press by simply creating a judicial balancing test to weigh out the facts in cases to make sure that a person's right to practice their faith versus government powers is matched and balanced and brought together in the fairest way possible. Under Riffor, before a government can force a person to violate their faith, it must show it has a compelling government interest and in doing so and accomplish its government purposes, it will do it in the least restrictive means possible. Mr. President, the map before you here shows the states in green that have Riffor protections, the states in dark green are those that have been acted by statute, those in the lighter green are those that have their supreme courts have enacted Riffor level protections by judicial ruling. So what you see before you is the where Georgia stands, we stand alone for millions of square miles around us have having these basic protections for people of faith. Mr. President, I have with me here a letter sent by law professors, 11 law professors, I'll name them. Law professors from Georgetown University, Princeton, Stanford University, Virginia, Notre Dame, and Harvard have this available for anyone to take a look at specifically asking this ledgel ledgel to enact act on Senate Bill 36 so that citizens of Georgia can be protected from state and local governments unfair intrusions on their rights exactly as we're protected from unfair federal government intrusions. Mr. President, I'm not going to spend a whole lot of time in the well, I'll be able to come back perhaps later and answer questions that are raised, but I'll tell you if you're watching this over the internet or you're here in person today, I'm really disappointed at the tender that I've heard from the already party.\n\nNot the minority party's letter here today, the minority report, that's making accusations that are just sadly false. They raised this question of a comprehensive civil rights statute. In fact, it was raised, it'll probably be talked about here in the next couple of minutes by members of the minority party. They came to us in committee and said, hey, in addition to RIFRA, let's enact an entire comprehensive civil rights framework for the state of Georgia. Well, ladies and gentlemen, the minority party has had the opportunity to propose comprehensive civil rights reforms for our states for years and years and years and years and years. Why is it that they're waiting for a bill that exactly mirrors our federal statute that our governor, Brian Kemp, has worked with us very closely to craft the language for to provide this careful balance, to ensure that there's no inappropriate discrimination, to ensure that judges can't be sued. In fact, the bill before and today, ladies and gentlemen, the Senate, Senate Bill 36 actually includes language provided to us last year, or a concept provided to us last year, by of all groups, the American Civil Urbanies Union, to ensure that nothing in the statute could any way be construed to affect the establishment clause, somehow establishing an official state religion at the state level. That's the language they ask us to consider in this bill, because this is a consensus bill. There's nothing hidden in this. The ladies and gentlemen, as you hear the debate today, I regret to tell you, you're going to hear all kinds of wild claims. You're going to hear claims as I read the minority report, harmful, mean, the vast majority of Georgians opposed this. I will tell you, ladies and gentlemen, if you ask the vast majority of Georgians, and you poll this, more than 95% of Georgians think this is already the law. In fact, one of the biggest opponents of this says, this is in the Constitution, it's already protected. We already have this protection. Well, ladies and gentlemen, we know that without this legislature acting and enacting Senate Bill 36, citizens, your constituents, red districts, blue districts, balanced districts, all over our entire state, do not have the basic right to practice their faith, and have protections from cities, counties, public schools, and public universities without this legislature acting on this bill. Ladies and gentlemen, I may have the opportunity to close the debate later and share some specific examples, but I will wrap up my remarks here by sharing this with you. How does Rifford work? There's a boy in kindergarten who's a Native American boy in Texas a number of years ago. He had a long, traditionally-styled hair, and the school system in his community said, you can't, boys can't wear long hair like that in our community. Well, the parents were Native Americans, they said, wait a minute, this isn't fair, this is a Native American, this is our right to do this, where this is traditionally-styled hair, and they sued under the Texas Rifford law. Well, this balancing test was applied. They looked at the school's powers and interest, and looked at this family's claim, and they said, you know what, there's not a compelling interest to require a Native American family to make their kindergarten son cut his hair. If girls can have a long hair, boys can have long hair. So the family won. A Native American family brought this case in Texas and demonstrated that having a Rifford law in place makes the government have the burden of proof to make boys cut their hair versus girls cut their hair. But those rules didn't stand up to this compelling state interest test. The second last case I'll share with you Mr. President, members of the Senate is a case in Florida, which talks about the other part of the Rifford statute. Rifford requires government to provide a compelling governmental interest, a real reason if they're going to impose on your faith. As we saw in this case, this Native American boy with his long hair. But the second thing Rifford does, it makes government act in things that it does have to deliver on, and the least restrictive means possible. In Florida, who also has a Rifford law, a young lady was going to get her driver's license and she was denied because she wouldn't remove her face veil for a driver's license, though, though. Now her particular set of Islam led her to the sincerely held belief that women don't remove and show their face to men that are not members of their family and in public. And she refused to remove her face veil. She sued under federal Rifford law and they said you have to remove your face veil. You know what the Rifford law said when they went to court? They looked at this and said, you know, ma'am, there isn't compelling government interest to make you remove your face veil. They said, well, I recognize that. To be a true ID, I've got to remove my face veil so you can see my face and put it on my driver's license. But the second part of the Rifford statute is what's so important. They said, you know, well, ma'am, what's your problem with this? You know, I don't really mind removing my face veil for a photo. But I don't want to expose my face to an unknown man who's not in my family in a room full of people. So the Rifford law said, well, ma'am, you've got to remove your face veil but you can do it in a private room with a female photographer. Least restrictive means possible, this balancing test was not a guaranteed win for this person of faith to get what she wanted, but it made government accommodate her in reasonable fair ways where they could accommodate her interest to not expose herself to men and the public outside of her family. But also get the face, under driver's license in a way that supported public safety and real ID. That delicate balance, this balancing test that Rifford applies in a very, very fact specific case-by-case basis is why Rifford has been so powerfully used and appropriately used. With balance, it's not a guarantee for one side or the other. The balance Rifford provides this and it showed, in the last 32 years since it was enacted a federal level shows why what we have before you today, Senate Bill 36, Mr. President, is the bill worthy of every single member of this body supporting. People from all your communities, no matter where you come from, need this basic protection in place. People of all faiths, it works for everyone and it's for everyone. With that, Mr. President, I yield the well. Senator Hesildan. Senator from 13th, would you like to speak or do you just had a question? You've done it. So we have two speakers who's doing the minor order report. Senator from the 35th of the 38th, all right. Senator from 38th, you're up then. Thank you. Thank you, Mr. President. Well colleagues, here we go again. Another bill by the majority to please the Maga Base. Let's actually talk about religious freedom. We live in the Bible belt where Georgia alone has over 12,000 congregations. Do we really need a bill to strengthen a church that has already such a broad and powerful reach? We have a pastor of the day in this chamber and the one across the hall. We pledge allegiance to a nation under God every morning. And you think we don't live and have religious freedom in this state. Colleagues, I'm a gay black man with two children and a husband who actually sings in a church choir at my Christian church. Others have the ability to go to a church that wouldn't welcome me, my family. And that's the choice that they have. So I ask you, do you really think that we need a bill to say that we need religious freedom? I know the will of the majority is to push this bill through, considering the fact that 33 folks have signed on to this bill. But what I ask is, is this necessary or is it right? Are there really Georgians who are prevented from exercising their first amendment right to freedom or religion? I know my freedom of religion is not impeded because when I go to church with my husband and my two kids, I get to worship and praise God with no limitations and you can actually do the same. Nothing prevents you from worshiping God in your way. Nothing prevents any Georgian from worshiping any religion. The only thing this bill does is allows people to use their religion as a free pass to discriminate. Under this bill, someone could deny me, my husband, my son and my beautiful daughter service at a business and use their religion as a reason to do that. So this isn't about politics for me. It's about the ability for my family to live freely in this state. Outside the chamber today are hundreds of people just like me who are here today to tell their stories of overcoming prejudice to just be themselves. There are too many stories of members of the LGBTQ community being denied service just for being themselves. We heard talk of balance. It's easy to talk of balance when you have privilege. So many of you can sit here with a privilege of finding a job because opportunities are there for you. You don't have to give any concern to celebrating the beauty of marriage, the birth of a child, renting a cabin to get away for the weekend, celebrating the graduation of another child or even when that sad day comes, the death of a spouse. With this bill, you lay the burden on families like mine to have that concern. Just because you decide it, you don't agree with who we are. Cloked in religion, Georgians can deny thousands of people the ability to live out the American dream. One of our colleagues came to the well yesterday and said that we in a minority like to drag politics into some of the bills that we discuss. But the truth is that these bills aren't helping Georgians. That is why we fight them. Because we know bills like this don't do anything except drive a wedge between neighbors and harm minorities. Bills like this are not helping everyday Georgians. We have Georgians in this state who lack access to quality healthcare, internet, water, food in some areas, quality infrastructure, affordable housing, and the list goes on and on and on. But here we are saying in this state, we don't have freedom of religion. Really? You deny us the ability to vote on Medicaid expansion, affordable housing, raise in the minimum wage, or expanding voting access. But we absolutely will push bills that harm minorities. I know my speech isn't likely to change any of the 33 votes, but I hope it gets you thinking. I hope you think about how you're going to make life harder for people like me. How are you going to say that religious freedom is under attack in this state? If there is anything, if there is anything, there is an abundance of religious freedom in Georgia. We have one of the most diverse states in the country and that is what makes this state great. I don't believe we need a bill to restore religious freedom or protect it when we have never lost it in the first place. So colleagues for my family, for my community, I urge you to vote no on Senate bill 36 and Mr. President, I yield the vote. We're going to have Senator from the 44th. Thank you, Mr. President. I assume that most of us have seen the movie Groundhog Day. Bill Murray wakes up in the town of Punxitani, and has to go see the Groundhog predict six more weeks of winter over and over and over again. Well, that is how I feel that the government is going to be doing and that is going to be a great deal. I'm going to have to go see the groundhog again. Well, that is how I feel right now. We keep doing the same thing over and over and over and we never learn. It is always in the Georgia Senate six more weeks of winter and gays can still marry each other. Remember 2015 and 2016 when we debated a similar bill? Georgia was not the first to try such a thing and the experience of states like Indiana with this kind of legislation was instructive around the country at that time. In Indiana, blowback was immediate after then Governor Mike Pence signed the legislation and it was made worse when he could not deny that the new law would allow a business to discriminate against gay couples. CEOs from around the country decried it, businesses announced plans to withdraw planned investments and lawmakers quickly rushed a legislative fix to protect LGBT people from discrimination to Governor Pence's desk. We should learn from Indiana's example. Bill's like this mean less economic investment for our state, fewer jobs and a worse business climate for our companies. When a version of RIFRA passed the General Assembly in 2016, then Governor Nathan Diel Vee toted it, stating in part, we should heed the hands-off admonition of the first amendment to our Constitution. When legislative bodies attempt otherwise, the inclusions and omissions in their statutes can lead to discrimination even though it may be unintentional. That is too great a risk to take. Colleagues, I agree with our former Governor Nathan Diel. But that's not the only reason to oppose this Groundhog Day bill. I oppose it also because it is an attempt to codify prejudice against those whose only crime is love. I'm against it because it is an attempt to shield discriminatory actions that come cloaked in a religious belief. The bill would make it harder for the state to ever prevent discrimination when the offender claims that religion is the reason for their action. Look, I'm certain that the author doesn't see it that way and we've discussed it before over the years. I know supporters see it as a necessary step to prevent the infringement of a right that is central to our country's founding. I do not doubt their stated intentions. And I certainly agree that the free exercise guaranteed in our Constitution should be respected and upheld. But our Constitution colleagues doesn't need this help. So the effect is that this bill gives fortification to those who do not need it. And it makes many others in our state feel as if they are less than inferior and I will not be a part of that. We need to stand up to those that need our shield, not to arm attackers with a sword. Because this bill today, given the lack of a civil rights statute here in Georgia, one of I think only three states to not have enacted a state level civil rights statute, throws off that balance between religious freedom and discrimination. And I would report to you that that is the purpose of this legislation. By the way, you know what happens at the end of Groundhog Day? Bill Murray learns to love the people he hated at the outset. Colleagues, I suggest that we should do that and we should move on. Thank you, Mr. President. I'm happy to yield for questions or yield the well. You have no question, Senator. Thank you. I yield the well. We're going to have a sign from the 16th. Thank you, Mr. President. I appreciate it. This and appreciate the work of the senator from the 37th. I believe this is that we have currently, as he's spoken about, we have protections already at the federal level, but what we do not have is protection from the state and local levels that are there. I want to give you an example of exactly what this does and why we're looking at this in this respect. I go to a church, Flat Creek Baptist Church, it's over 100 years old. And we had an issue. We've been having for years. We've been having car shows and craft shows at our church. And we would invite people, no charge, or anything of that nature. And so that went on. And then we finally got a notice from our county. And the county said, did you have to have a permit to have a car show? And we go, well, we have Easter eggs, hunts. We have all kind of fall festivals. And we've never gotten a permit for that. So we went through a battle. We've talked. I talked. I went to them. And they decided they were not going to do it. But they were going to go ahead and do this. They were going to find the church and send a fine to our church. So they sent a fine to the church. Interesting. At the car show we had. We had the sheriff with two antique cars and five officers that he put there. And he says, this is, this is wrong. He even thought it was wrong. The county commander's assurance after doing that, we decided that we, we would fight it. But our solicitor looked at this and he says, I will not. I will not bring a charge against the church for having a car show. This is wrong. This is why we need state and local, local rifra to hold back so that if they're going to do this, they have to show the highest standard of strict scrutiny and show a compelling government interest in a reason that they're going to enforce their law. That is the reason we need that. Not about discrimination. It is about keeping local and state government contained on issues dealing with religion and dealing with the church. And with that Mr. President, I'll yield the well unless there are questions. You have no questions. Thank you, sir. All right. Any other senator, which speak for against a measure, before we get to the minority report, hearing none, I'm recognizing it from 35th. Good afternoon, colleagues. I rise in opposition to SB 36. And before I go into my remarks, I find it interesting. We've become more active in filing these minority reports and it seems to hurt the majority because you all tend to reference them more often than you used to. To that, I would say if you want us to file less minority reports, then one past better bills, but two, help us help you in committee by adopting some of our recommendations. And you won't hear anything hysterical or outlandish or unfactual from me. What you will hear from me, though, is concern about what's happening with Rifra, with religious freedom across this country and how we could prevent those things from happening right here in Georgia, where our biggest asset is our diversity. I heard the author say that when Rifra is appropriately used, it's a great thing and I agree. But in order to assure that it's appropriately used, you need to have adequate safeguards. And in Georgia, we do not have those safeguards. So let me talk to you about some facts. Yes, Rifra was passed 30 years ago, close to 40 years ago, with bipartisan support. Here's another fact. Rifra at the federal level has changed dramatically since then. It does not provide the same protections. And in fact, it is being used across the country to discriminate against people. It is also a fact that there are over 30 states that have Rifra laws in the books, but the vast majority of those states have a civil rights statute in place to protect against discrimination. Georgia is one of the handful of states that does not have a state level civil rights law. Just a handful of states. And Georgia is one of them. So when the senator from the 37 says, well, if this was such a big deal, why did you wait until this bill was proposed to propose a civil rights law? That is simply not the reality. Because the reality is, is that we have been proposing, as Democrats, a civil rights law, almost every single session. So the last 20 years, those calls have been ignored, those bills, shells, tossed aside, and they have not been acted upon. So it's disingenuous to say that we have not taken issue with the fact that we don't have a civil rights bill until Rifra came along. We've literally and people in this chamber have literally been proposing that very bill for a very long time. Before several of us have even been a part of this chamber. Why is the civil rights bill necessary? Because if you adopt Rifra, you are saying that religious freedom and religious beliefs are important. But without an anti-discrimination law in place, you are telling courts that you are placing religious beliefs over anti-discrimination. You are placing someone's religious beliefs ahead of someone's interest to not be discriminated against. Let me give you some examples. In states without civil rights protections, a restaurant or a hotel could refuse to serve LGBTQ patrons, a pharmacist based on their religious beliefs can deny birth control or HIV medication to patients. A wedding venue could refuse to host a Jewish couple for their wedding. A landlord could deny housing to an unmarried couple, all out of their religious belief. And the way Rifra has been carved up at the federal level, courts don't even give that any scrutiny for someone to say it's a part of my religious belief. We saw that in the Hobby Lobby case. So the fact that right now we are advocating for passage of religious freedom without a safeguard will make sure that Rifra will not be used appropriately in every instance. These are legitimate concerns. These are facts that we have seen across the country. So we are not sounding the alarm without actually trying to bring you some solutions. It also harms workers because an employer can fire an employee based on a religious belief and the fact that an employee is a part of the same sex marriage. We have argued about LGBTQ rights in this chamber. And Rifra would certainly not protect those in the LGBT community without a counterbalance with a civil rights law. And if you think I'm crying wolf, there's written documentation on this where proponents of this law have explicitly cited sexuality and gender identity as the reason they need Rifra, especially in states without state level civil rights law. So colleagues, my comment to you as I close is that we are all for religious freedom when it's appropriately used. But if you want to make sure that it is appropriately used, then you have to have the proper safeguards in place. And in this state, we are one of the few states that does not have those safeguards in place. So if you really want to make sure that this law works for everyone regardless of your religious belief, then join us by adopting a state level civil rights law. And with that, Mr. President, I yield the well. Senators yielded. Senators from third so we just like close. Mr. President, ladies and gentlemen, I appreciate the stability of the debate here. I think these are things we want to be talking about. And these are, I'm going to try to address the presentation. My seat made the center from the 38th, the lady from the 44th and the center from the 35th remarks. I'm going to address those specifically and then I'm going to wrap up with a story that kind of tells us why this really matters. And kind of hammer some, why this Senate bill 36 really is important for Georgians and for.\n\nand why it's been adopted nationally as a model. One of the accusations made, the claims made by the Center from the 38th about this is a free pass to discriminate. I know those are, they may be soaring rhetoric to some, that's simply not true. What this bill does, it strikes a balance. And I'll tell you exactly how it does that. There are a number of states that have passed state riffer laws that have looked at local communities that have passed local civil rights ordinances and specifically wiped those out. That's what some of their states have done. Other states have passed riffer laws that have looked at local civil rights ordinances and receded and given them complete control and receded any interest that a person of faith might have to have a balancing test. What CINABL 36 does is it strikes the balance. It's right down the center. What CINABL 36 does is exactly what the federal statute does. It doesn't seek to wipe out the 18 local civil rights ordinances that we have in 18 communities around our state who have chosen at the local level, we're gonna provide supplemental civil rights protections through our ability to pass local ordinances. 18 communities in Georgia have done that. This bill specifically does not seek to wipe those clean, does not seek to wipe those out. Whereas those communities have elevated a particular interest higher than other communities around them, the Religious Freedom Restoration Act recognizes that in those communities, this judicial balancing test that riffer provides will weigh those interests and those 18 communities more heavily than a communities that don't have those local civil rights ordinances. What riffer does is is rather than taking a person of faith as having essentially no legal protection being completely naked, it simply gives people the basic, be it a faith, the basic level of protection that you would expect to have a constitutional right. And those communities that have elevated those interests higher those would be balanced by the courts in a fair and appropriate way. I say that we're very careful in this riffer law not to try to go after those in any way take those out. If the intentions had somehow to be to diminish the rights of the folks that have been referred to whether it's members of the LGBT community or others, then this law would have, it does not. If that was our intention, this law would have done what some other states have done and said local ordinances don't apply. This law specifically does not do that. This law seeking to be fair and balanced. What this law also does though, it does not say that if there is a local ordinance that rules and a person of faith has no interest and no protection. You know, with the center from the 35th alluded to the idea of saying, hey, there's not an exemption for claims of discrimination making this law somehow in his words bad. What that would mean is a claim, an allegation of discrimination with very, very little substance would completely wipe out a religious claim with tremendous substance. It would be simply be exempted from any consideration. That doesn't make sense either. What Cinnable 36 does, and I tell people this, as we talked about this in the media, as I've talked about this in a more deliberate setting, is Cinnable 36 is crafted and it models the federal language in a way that travels well in communities that do have this higher standard for civil rights interest. It, those interests are loaded on this balance and the scale in a way that gives it more weight legally in those communities as it should. But what it does do is it makes sure that folks of faith have the weight behind their interest as it should. Riffer does not in any way guarantee an outcome. It simply provides the weight for people of faith consistent with a constitutional right. The claim was made that this is, that how is religious freedom under attack in Georgia? I'm not making the claim that in the last 100 years, 50 years, that religious freedom has been under an outright attack. Well, what I am saying though, is something that most Georgians don't recognize is, religious freedom is naked. It is completely unprotected. There is no legal standard that protects people of faith. I am thankful that the last 100 years, 50 years, 25 years that courts, local governments, schools have been relatively deferent to individuals of faith that's not created these awful cases. We don't see this attack that was suggested that I was trying to represent. I'm not representing that. Courts have been pretty good over the decades. But what we see is we look nationally, we look around our state, there is no legal protection. People of faith have the lowest level of legal protection that exists in our legal system. What we're simply seeking to do is giving them the kind of protection that you have that's consistent with a constitutional right. That's all we're doing. We're trying to provide the defense that it should have, that should attacks ever come, people of faith have the protection they should have. Allegations was made by the Center for the 44th about this codifying prejudice. It was said to me one time that sometimes they can live as a fascist and you can tell the truth. This is an interesting debate, friends, because it's hard sometimes to describe a legal standard when most of us go about our lives not in the world of courts and constitutional rights. The fact is that the Supreme Court in 1997, as we alluded to earlier in the Bernie decision said, that while the US Constitution and the federal law enacted by Congress in 1993 protects people from federal government intrusion, states and states alone must act to protect people from cities, counties, schools, and public universities. Specifically, Bernie V. Texas case 1997 says only states can provide that kind of protection. So the contention that our Constitution does not need our help is simply not true. People of faith in all of our communities need this legislature to act with Senate Bill 36 in a balanced way we talked about. They're in balanced to create this legal balancing test. Mr. President, as we wrap up debate and there's been some discussion about there's no legal safeguards, allegations were made attacking our federal statute, we could go on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and on and I will tell you that this protection that we're talking about here, this map that I showed you earlier showing the, where the United States is and where our states are. The protections we're enacting as a body today are protections that exist on every single federal installation. Every citizen in Washington, D.C. has this protection. Every citizen in Illinois, Massachusetts, Connecticut, Washington, no bastions of conservatism have these protections. Every person on a military installation has this protection. And ladies and gentlemen, every single felon, felons in our state prison system have the same highest level of protection. Through a 2000 law that was passed by institutionalized in prison prisons. All we're asking this statue is that people in Georgia law-biting citizens have the same level of legal protection that folks have in our prison system, that folks have in our nation's capital, that folks have in 39 of our states and that again our prisoners have within our prison system. Friends all conclude by reminding us that this does not put one law over others, but simply provides that balancing test. The balance these basic rights people know they should have with the interests of government. It doesn't get in the middle of private interactions. It's not between a shop owner and a customer. We could go point by point by point and back and forth on this, but this is important to pass. In fact, ladies and gentlemen, I'll wrap up with a story of Mary Steinmetz. In 2008, Mary Steinmetz was a Medicaid recipient instead of Kansas. And Mary Steinmetz had cirrhosis of the liver and was qualified for a liver transplant. The Mary Steinmetz was also a Jehovah's Witness. And her faith, they didn't believe in blood transfusions. Now, Mary Steinmetz found out that as she went and looked around in the neighboring state in Nebraska, that in Omaha, Nebraska, she could get a blood transfusion, I'm sorry, she could get a liver transplant without a blood transfusion. In her own state of Kansas, the only liver transplant through available required a blood transfusion. She says, you know what, I need a liver, I'm gonna die if I don't get one, but I don't believe in blood transfusions. Well, under then Governor Kathleen Sibelius, I'm sorry, we provide the service for you, Medicaid covers people within the state, you can go 50 miles outside the state, but you may not go to Omaha, Nebraska, because we just don't, that's just outside of our rules and don't need a combination. When Kansas in 2008, there was no law requiring the disbalancing test. And what ended up happening is after a long legal battle, Mary Steinmetz died, she couldn't get the, she couldn't get the, even though in Omaha, Nebraska, liver transplants were available at a lower cost than they were in Kansas, because Medicaid wouldn't cover her services outside their boundaries. The years of her legal battle led to a place where she was no longer a candidate for a transplant and Mary Steinmetz died. She died for her faith because in those years, the basic right for a government have to listen to you and give you a fair day in court as it were if your religious rights did not exist in Kansas. These are real things for real people, whether it's a Muslim woman in Florida wanting to have her face, her photo taken in a, in a private room with a female photographer, or Mary Steinmetz has a Jehovah's Witness, not wanting a blood transfusion, fighting for her life. These are real issues for real people. And ladies and gentlemen, Senate Bill 36 strikes the balance. We need, I'm asking for bipartisan support for this. We have gotten some bipartisan support in many of the states that we've seen in the last several years. We've eight states have passed this since COVID. Senator, you're time's expired. I would ask for your support for Senate Bill 36. Does any of the Senate actually have the debates closed? So is there objections to the previous question to be in order to have objection? Chair here's none. Is there objections to the main question being in order? Chair here's none, the main question is ordered. Questions on the passes of the bill. All those in favor of the bill vote, yay, opposed to any secretary on the machine. All in the passes of the bill, the yeas are 32 and the nays are 23. This bill haven't received a階 of constitution majority. Is there for pass? All right, we're going to break the lunch. So I know the pro jams got lunch lined up for everyone and we're going to break. And we'll try to reconvene here by 130. Senate was standard ease.",
  "updated_at": "2026-02-13T15:32:40.317536+00:00"
}