{
  "video_id": "svfJqkNftAo",
  "url": "https://www.youtube.com/watch?v=svfJqkNftAo",
  "title": "8/22/2023 - Senate Study Committee on Expanding Georgia's Workforce",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 134,
  "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Expanding Georgia's Workforce session on 8/22/2023:\n\n## Overview\nThis was the third meeting of the Senate Study Committee on Expanding Georgia's Workforce, convened by Lt. Governor Bert Jones. The committee is examining ways to address Georgia's workforce needs and is planning to hold meetings across the state before submitting a final report and recommendations in November.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The committee chair, Sen. John Albers, welcomed the members and speakers, including representatives from the technical college system, Georgia Chamber of Commerce, Metro Atlanta Chamber, and state senators.\n- Lt. Governor's office representative Brad Vaughn provided an overview of the committee's purpose - to find ways to make it easier for Georgians to join the workforce and address the state's growing economic needs.\n- The committee plans to hold additional meetings in Commerce, Dalton, and a final session at the state capitol in November.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum was present, with committee members in attendance.\n\n## Adjournment\nThe session adjourned. The next meeting is scheduled for September in Commerce, Georgia.",
  "transcript": "you Thank you for coming my name is John Albers I serve in the Georgia State Senate for District 56 and I'm honored to chair the study committee for Senate Resolution 275 which is expanding Georgia's workforce. This meeting came about by the priority and support of our Lieutenant Governor Bert Jones who came to me earlier this year and had a passion about making sure that we had the workforce to match the needs of our businesses as well as our governments in the future. He appointed this committee through legislation and we're going to have the committee members in a moment to introduce themselves very briefly and then we'll also hear from some folks who are helping with the logistics of this from the Senate Press Office recognize the different individuals we have in a work and committee and then we're going to have Brad with the Lieutenant Governor's Office also address us. First I'd like to begin toward one end of the table we've got our senator who represents this area he is the majority whip for the Georgia Senate I'll turn it over to Randy Robertson. Thank you Mr. Chairman. First of all I would like to welcome everybody here for what I feel is an extremely important study committee hearing and I'd like to welcome my fellow senators so that they have the opportunity to come and visit the state of Georgia and I do want to remind them that if they don't think it is then we can introduce them to the law enforcement and the community on their way out. But and I'm extremely pleased that where we are at today here Kia is a huge part of district 29 along with the partnership with West Point and Lagrange. I think they have set the example of workforce development and also of community engagement. It's one of the most pleasant parts of the district that I represent. They tend to hold my feet to the fire with leadership like Stuart and others here that see not only the responsibility of Kia to the business side but the responsibility of Kia to the community side and they have done an incredible job. But while you're in the district I think everybody has my cell number please feel free to call me. I'm excited about this especially under the chairmanship of my dear friend and sweet mate chairman John Alvers and let's have a great meeting. Thank you sir. Thank you senator and we'll just continue down champ we just do a quick introduction down there. Champ Bailey Hall of Famer entrepreneur philanthropist thank you. Good morning my name is Ryan Bernice I own three restaurants up in Roswell Georgia and table and main O's Dury Matona and Kasa Robles. I'm a Delta Airlines and I appreciate the invite participating in this. Great. No sir commissioner of the technical college system of Georgia. Good morning and Daniela Perry vice president with the Georgia Chamber of Commerce. Good morning everybody I'm Billy Higman Senate District 4 which is up all of Evans all of Canada all the blue of all of F&M and about. 40,000 people down in the chatroom county and senator Robson thank you for allowing us to be in your district today. Thank you. I'm glad you're all right. No thanks. Jason Estevez state senator for senator district 6 northwest Atlanta parts of Cobb and Fulton County. Good morning Dave Williams. Metro Atlanta Chamber of senior vice president for public policy and talent. Good morning Brandon Beach state senator from district 21 which is north Fulton Al Prudon Milton and Cherokee County. I also serve as chairman of economic development and tourism so work force is a very important issue to us. As you can see Lieutenant Governor Jones pointed quite the August committee. We're very proud of the work that's been done a little bit of background. This is our third committee meeting the first when we started with a kickoff in Atlanta. Thank you to Georgia power for hosting us there and then last month we were fortunate enough to be in Savannah. And then obviously after this meeting here at here we're going to be going up to commerce Georgia in September. And then we will be going to Dalton Georgia in October and we will round off our final committee meeting in November which will be back at the Capitol at which point we will have a report prepared for this committee. That we will review in detail and get everybody's hopeful agreement on I feel confident and we will then submit that back to the lieutenant governor in his office which we hope will then push forward with potential legislation. And or budget items for the areas we feel can help to fill this important gap. I also want to take a moment to have a very special introduction to Ms. Allison Bailey right here. This is her fourth day with the Senate in the state of Georgia. She's got it all figured out but we're very excited to have her here. She just finished up her graduate program at Emory University as well as their undergraduate Alabama. Go ahead, groans I'm waiting for it. But we're very very happy to have her here. She's actually going to be supporting both myself and Senator Robertson. At this time I'd like to ask Mr. Brad Vaughn come up to the microphone and he is going to give us some updates from Lieutenant cominers office. Chairman Albers, thank you so much and for all of you who are here. Thank you for your participation in the committee. As the chairman said this was a passion project from the very beginning from the lieutenant governor's office. He took office in mid-January and as you sort of know when you are new everybody wants to come talk to you about everything that they're doing and everything that they're successful at. And then they also want to bring in a few complaints here and there. I wouldn't call those so much as complaints as guys we have a really really great problem that we need your help solving. Our state economy is growing. We are busting at the seams with new companies wanting to come to Georgia. How are we going to find our workforce? And as Senator Albers alluded to that was really the genesis of this study committee. The members who were selected the various groups from around our state who are also represented on the committee from various industries, various parts of our state. So we did this very intentionally. We very much wanted to hear from all of you about what you have to bring to our committee. And then particularly from the people we've invited to present along with chairman Albers. We want to hear from a cross section of people who have success stories to share. But people who also have some ideas about ways to make it easier for people to get into our workforce. This committee is one of several in the off season from the Senate side and then also some joint committees with our colleagues in the house that are looking broadly at how do we make it easier for someone in Georgia to get a job. And that fundamental question I think is going to guide a lot of our work as we go forward. That's a question that the lieutenant governor has kind of put before us in the off season as a staff put before us in the Senate as well as to say guys. We need to make it easier that if somebody wants to get into the workforce here, we should not be the one standing in the way of them doing. And that is going to drive a lot of our work going forward. So I'm particularly happy today that we're going to be hearing from some folks in our building trades. Also some representatives from our state government, from our local governments. Those are big employers in our state as well. And we want to make sure that all of the opportunities that we can make available for someone to start a career in public service, to use a career in public service, to launch a career in industry, in really any part of our economy. We want to make sure that those opportunities are available. So I will share with you two one of the other things that I'm looking forward to is that lieutenant governor Jones will be personally joining you all for your final meeting of the committee in November at the state capital. We've been working very closely with chairman albert to look at potential legislation for next year. Also looking at some recommendations for our committee that may drive other areas of state government, not necessarily ones that require legislation, but just ones where we've been able to find ideas that are working that we can help connect people and get them together so that those successes can be shared. So again, thank you so much for your participation for going all over the state with us this summer. And then we're going to be going into this fall. We think it's a wonderful opportunity to showcase things that are happening, things that need to happen. But also for your commitment to this very important issue. And again, thank you to our hosts from Kia for making this beautiful facility available to us. Senator Robertson for hosting us in your district. It's always a pleasure to see you, sir. And please, by all means, if we can ever be of any assistance to you in the office of lieutenant governor, please let us know. We are here to be a resource for the Senate for the general assembly and for anyone who knocks on our door. Thank you all so much. And the partnership has been extraordinary. And thank you for all the work that you and the lieutenant governor's office has done to support us through this process. Next, I'm going to ask Lexi to come on up real quick. She is our interim director of the Senate press office and helped set up all the stuff that you're going to see from websites to live streaming center. So you give us a quick update Lexi when everybody can leverage from communications. Thank you so much. Good morning, committee members. Good morning, everyone. Thank you all so much for being here. So we've got our website currently pulled up on the screens here. It's at expanding George's workforce study.com. This is a micro website that we've set up to help people follow along with the work of the committee. So I wanted to just point out one quick feature change. We've actually added some new, a new feature and new capability on our website. So if we scroll down on this page, thank you, Olai from Kia, helping us in the back. We've got all of our past meetings here linked on the website. So if you haven't had a chance to attend all the committee meetings before, if you'd like to go back and reference anything that was said, any presentations, those are linked here in this past meetings section. We've also got photos from the committee meetings where we've been covering those. And we're also very soon going to have all of the presentations actually that speakers have presented to the committee available in the original PowerPoint format on the website as well. So we'll be back soon and as far as anything else, I think that kind of brings us up to speed. I see a lot of familiar faces and I'm sure you'll have been checking us out. So yes, expanding George's workforce study.com is where you can do that back to you, Mr. Chairman. Thank you, Lexi. And if you have any further questions, please grab either Lexi or myself as the meeting ends today so we can assure that you have any information you may need. Okay, we're going to begin and I'm going to ask Stewart Countess to come up with Kia. He is no stranger, I think, to most of us here who has just been a tremendous leader and ambassador for Kia. And I want to take a moment as you're coming up and getting settled to also thank April and Shelby for their amazing work that they have done to pull this together. It's a beautiful state-owned facility which was designed to build specifically to support and be in partnership with the great work that Kia has done and the jobs that have been created in the impact of the community. And Stewart, I want to just personally and professionally thank you for your incredible service and we will turn it over to you for your presentation. Fantastic. Again, welcome to everyone, Senator Delvers. We're grateful to have your committee here in West Point and in Troop County. I think you'll see for those of you who are able to take the tour this afternoon that will be offered what growth has meant to this community. And if you go back and reflect where we were some 14, 15 years ago, it's a very different environment. For those that are unable to attend the tour, please reach out to us. We'll gladly get you through this facility and show you what progress can be made with such facilities. The origins of Kia's really started in this building. This is where the first workforce was trained and four million cars later were still producing. We made the announcement in April that we would build the first electric vehicle in the state of Georgia out of the facility. That vehicle is actually a representative of it is out in the parking lot. We encourage you to go by and take a look at what the future of Georgia is going to be. When you look at where certainly this Savannah plant as part of our larger Hyundai Motor Group. If you think about that operation, certainly Riveon and ourselves, the state of Georgia will be producing over one million cars by somewhere around 2026, 2027. That's a vast change from 2009 when we made the first car here after an X of this period. It does not include the battery facilities that also exist in this state because without them we can't be successful. So I say that because the growth opportunities are tremendous for the workforce. But obviously the question is where do we get those individuals from? We as a company focus in three pillars basically about community development, about workforce development and education and workforce development and education are not independent pieces. We believe in work-based learning. We've had great successes with that, whether it be through college and career academies or through base schools. There has been a tremendous amount of progress made. What we see is young minds who don't really maybe know what they want to do coming out of high school. But we're open of how do we help you decide what that career can look like, whether it's going to the technical college system led by Commissioner Dozer or through the USG system and gaining those educational credits and validations to come in and be a high contributor within an organization. But I also say this because there's another pathway. 26% of my engineers have no engineering background. These are people who started off on an hourly base and have worked their way through the system to become an engineer. Truly leading engineering functions. Do in problem solving, analytics, working in a team environment. If you look in our HR and areas, our finance and other support structures. Also equivalent numbers of people who started off at a very different level and have found a pathway to greater success. We try to teach this because we think it's important, especially in the change in the environment today. That is not a knock against a higher education by any stretch. But our company and many others within the state and working with the Georgia Chamber. We've heard a lot of comments that we just want a chance to show you what we can do. And there are successful careers out of it. My example quick story on this is we had a couple of students that came through our expeditions program. We talked to one of those individuals at the very beginning asked him what he was going to do. He was going to get a mechanical engineering degree at Auburn. I had to talk to him about that a little bit as I'm an Alabama graduate. At the end of his term, I went back and talked to him again. What are you going to do? Well, I'm going to get to the technical college and get my two year degree. The man is now working in our maintenance department knocking north of six figures. He's 28, 4 or 25 years old now. But he found a different way to success and he loves his job. Another individual that came in also out of that same expeditions program taught people in the paint shop who've been working in there for 30 years. How to think differently. The upon us is an employer and people within a company to listen to different ideas. But we have to engage those individuals. There's a colleague that's with the Georgia Association of Manufacturers. She came up with a term and I've kind of latched on to it. It talks about the four D's. The four D's in manufacturing are that it's dull, dead end, dangerous and dirty. I challenge anybody when you go through our factory to tell me any one of those are possible. But we have to dispel that rumor because what we have coming certainly within the state of Georgia with these factories that I've talked about. There is a need. But we have a career. If you'll just let us help you get to that career. You will define how far you want to go in that career. But we're here to help you. We do that through providing tours for students at the high school level. They also do it at eighth grade level. Certainly, COVID impacted that and we were unable to do it for a period of time. But those are back open and we'll take any school throughout the entire state to come and see what we do here. And I think you'll find that open doors to a lot of companies in the state of Georgia. I think one of the critical things though that we need to have conversation about and there is much conversation already in the state is about externships for teachers. We have got to find a way to help educate our educators about what opportunities exist in the state of Georgia. That message does not always get there very clearly. And without that, they can't help guide students to what a successful career looks like. Especially for those young individuals who maybe don't know whether they want to go for further education. There are ways to do that. We've run some programs in the local area through former mayor. Jim Thornton, through the Lagrange Industrial Fellowship of Teachers. The idea behind it was to bring them in, let them experience three or four days or a week, understanding what we could do and take those concepts back to the students and help guide them into a direction that suits theirs needs. COVID certainly put an impact on that. But we have got to re-engage that at a state level. And it's a year-long process. I've been very open that I'm not running a summer school program. We are open 48 weeks out of the year. The other weeks we're doing work on the site of the facility. But I think again, you will find a lot of companies willing to take educators in and help them understand what we do. We also have done some initiatives to try to reach individuals at a different place, just like Champ Bailey with a signing day. There's a lot of neat programs out there where we're making it a big event that that child, young person can turn a hat around and say, well, I'm going to work for Kia. I'm going to work for Lockheed Martin. It's a different way of connecting. And that's what we have to be open also to do. How do we connect with people? It's taking other people's success stories into the environments and letting them share where they were in their life and where they are now. I can tell that all day long, but I might have an issue of reaching them at their particular place. So there are different concepts that are out there. We're finding some success in those and we'll continue to work on them. Lastly, I will say there's two great programs that we have supported through our community efforts. One is called a World in Motion. This is teaching soft skills, but also teaching problems, solving skills and teamwork to fifth graders and through the elementary school. And then Green Power USA. Green Power USA is a program that the State of Georgia has really been leader in. One of the middle schools here in the local area is the National Champion in that and it's basically building an electric bill card. Well, how fitting is that for what we're doing right now. But it also is amazing to see the participation from parents, grandparents, siblings and other individuals coming to watch what these young minds can do, which is problem solving and helping each other be successful. So we're glad to have you here. I'll be glad to answer any questions. Thank you, Stuart. A quick question currently, as far as pipeline to meet the current open jobs do you have? How are you doing with having the necessary folks to fill your positions that are open? So our current open positions actually is back to some pre-pandemic levels. We would have on the hourly side about 75 open positions. That sounds like a large number and yes it is, but it's a kind of a turn that always is happening. We had to make some adjustments in some of our own processes from shift work, recognizing changes in the economy, etc. Those things have helped. But we are finding success at recruiting individuals who maybe don't know what they want to do for further education now. Fantastic. Are there other questions from the committee members for Stuart? I got a question from Champ. Very point. What age does the kids start the expeditions program? They are typically junior senior is what we have been experiencing, but there are some things that we're working around just because we're an industrial manufacturing. We found successful solutions for them. How long does the program last and what's the success rate? Three semesters that they're able to attend. What's been pretty successful? Absolutely. It has been great. Other questions? I did a huge investment in K12 education and building those relationships with your K12 partners. I was wondering if you could talk a little bit more about how important that is especially when you're trying to dispel some misinformation and really build those long term pipelines that will last. The AIM program was actually begun about 12 years ago. Today we estimate that we've reached 90,000 students. We realized there's a yearly competition in a two-place in Columbus this year. We realized that the kids that were in that event that day were not born when we started. What that tells us is that the original people in that program were now some of the employees that we had. Today we put over $3.6 million into it. We will continue to put money into it because it, again, is teaching soft skills that arguably is really a challenge. How do you work inside a team? How do you listen to other people's opinions? How do you problem solve and take analytics? I would encourage any one of you to next year if you wish to come to the competition and just stand back and watch what actually happens amongst 5th grade students. The joy in what they do and how they learn is a different way of learning. It's not textbook learning, but it is learning and it is valuable for what they can develop into a career. The teacher aspect of that, I think, is also quite amazing. We find out that the teachers don't really understand that this is a different way to teach also, but it is helping them to understand what a potential career could look like even at a very early age. Thank you, Daniel. Other questions? Senator Beach. Thank you, Mr. Chairman. We have funded for the construction industry, the CW Matthews and the road construction. We funded 58 simulators. We are in 15 high schools and they fired over 300 people. Would there be an opportunity for us to do anything for high schools, for the auto industry to do simulators or do something to make that a position that these young kids from 8th, 9th, 10th grade would want to get in these simulators of some sort and try to say, I want to be in that business, being that industry. Yes. We would agree that that is in a way to attract young minds to what futures can look like. We have been for a number of years through the local college and career academy called Think. We have put robotics into those settings, again, trying to teach young individuals how to read PLC logic and work in those environments and encourage them what a career could look like. Just a follow up. How many high schools do you have within a, I guess, 30, 45 mile radius from here? That's a really good question. There's three in True County but there's probably in total, and that's what we guess, about 15 to 18 that we have pretty regular interactions with. They're usually the ones that are also coming for the tours, but we do recruit any of those into the local ones, True, Hard, Maryweather. Actually, yeah, True and one out of Alabama, we also look at it. But we provide them the opportunity to work in this environment and gain some experience. It's up to them if they want to come with a career. We have tuition reimbursement programs and try to help them develop that. So I would also say with the technical college system, we now have a maintenance certification program through West Georgia Technical College that was originally developed by Georgia Quick Start. And then we passed it off once we were successful in that. And we have grown internal talent but also encourage external that this is a certificate and you could go in pursuit if you wish. Thank you. Any further questions? Seeing none Stuart, thank you again to pour your tremendous hospitality and leadership. And I know that several folks here will be taking the tour after lunch today. Thank you. Very important, Senior. All right, next up, one of my favorites here, Mrs. DRC, we're on with the Georgia Council on developmental disabilities. And while she's coming up, I don't like that word. I use the word special needs and gifts. You might be thinking, well, why are we hearing from an organization that supports folks with special needs? Because they're a huge part of our community and can fill a host of important jobs using those very special gifts and needs that they have. We were proud to work together on a study committee just last year of how we can better support our population and our families. So I'm going to turn it over to you to tell us about how we can meet some of the workforce needs with this important part of our community. Great. Thank you so much, Senator. Move this little closer. So, and thank you for that introduction. Members of the committee, I am thrilled to be speaking to you about this topic here today. As the senator said, I'm Darcy Robb. I'm the Executive Director of the Georgia Council on developmental disabilities. I'm going to be speaking to you about two talent pools today. And those are Georgians with disabilities and their family caregivers. I may need some technical assistance on the slides here. Thank you. This may be user error. There we go. Very good. Thank you. All right. So at GCDD, we are a federally funded state agency. We are self-governing. And we're charged with identifying the most pressing needs of folks with developmental disabilities here in Georgia. As you can see on the slide there, as per our establishing legislation, over 60% of our members must be people with developmental disabilities or their family members. And when I say developmental disabilities, I mean a developmental disability manifests before age 22. It is significant. It is lifelong. It's not something you would recover or be cured from. And it can impact you in a number of ways of living, such as your mobility, your ability to learn, communicate, care for yourself. So I can look a lot of different ways. Our mission is to bring about social and policy changes that promote opportunities, or folks with developmental disabilities, and their families to live, learn, work, play, and worship in Georgia. Now getting down to the nitty-gritty. I told you I was going to talk about talent pools, and those are our folks with disabilities as well as their family caregivers. Let's start by talking about myths. So my question for you all today. How is the idea of unemployable due to a disability like a unicorn? Well, I've got the spoiler right there on the slide for you. They're both myths. If you take one thing away from what I say to you today, please let it be this. No one is unemployable due to a disability. There are folks who believe this myth. It is slowly dying. A lot more slowly than I would like. But the reality is we can look at every person we look at their gifts.\n\nWe look at their talents, we look at what they do, and then we match those up with what's actually needed in a job. And that can look a lot of different ways. That could look like supported employment. So let's say that I have a job coach who helps me learn my jobs, stay on task. Let's say that a company has something that's not being done. We could customize a job for me. A lot of great jobs have been found by going to CEOs and saying to them, hey, what's your biggest headache? And then you think about, okay, do I know anybody who could solve that headache? I'll give you an example. There's a young woman by the name of Lindsay down in South Georgia. The speaker of the house and I did a visit to her place of employment some years ago. She works at a company that makes airplane parts. The CEO of that company shared with us that because of Lindsay, he sleeps better at night. The reason is because she single handedly digitized all of the blueprints for all of the parts they have made. Before that, all of those blueprints existed in a warehouse. If there had been a fire, I don't think I need to tell you how catastrophic that would have been because the FAA requires when you make an airplane, you hold onto those blueprints at least as long as that plane is flying. So don't believe the myth. There are people who haven't figured it out how to support a person with the disability, but that does not mean that they cannot have a meaningful career. So what is the reality? Well, the reality is that Georgians with intellectual and developmental disabilities do want jobs. They want to work and most of them don't. And this is where I really want to draw attention. We have a workforce problem in this state. Well, guess what? Part of our solution is sitting right here. Only 13% of Georgians with intellectual and developmental disabilities. Now, this is according to the National Court Indicators. That's a very well-respected source of data. Only 13% have a paid job in the community. 13%. However, 54% of those who do not have a paid job in the community want a job. I'm not sure if there is another community that has such a high percentage of people who are not employed and who want to be. There is gold and opportunity right here. So, furthermore, employment services benefit the economy. I'm not going to go through every one of these bullet points with you, but this comes from a well-known researcher, Robert Samara. When we as the taxpayers invest in employment services for people with disabilities, we get a positive return in our investment. Now, why is that? When people go to work, they become taxpayers. And many times, their other support needs actually diminish because they're plugged into their community. We all know about the social determinants of health. One of the big ones is having a job, having all the benefits that results from that. So, what can we do about this? Several suggestions for you today. Number one is we can aggressively push employment first policies and procedures. And what employment first means is that we look at a job in the community or running their own business. We look at that as the first option for how a working-age Georgian with a disability should spend his or her day. And we make sure to align funding practices, training practices with that. Number two, we can consider state as a model employer. I've got a website link for you there. Now, this is a policy that several other states around the country have adopted, essentially where the state sets itself out, to be a model employer for folks with disabilities adopt best practices. Number three, we can encourage employers. We've got some business folks here represented. You all may already be familiar with this resource. Disability in. They have a fantastic resource library of how to best hire and support employees with disabilities. Now, I don't want to skip over family caregivers. Senator Albers mentioned the committee we did last year. I want to tell you all that after every single one of those meetings, a family member would come up to me and would say, I would love to go back to work. And I just can't. Because their loved one, usually their child, just didn't have support. I had one of my staff full some statistics on this this morning. There's not a whole lot, but what she did find is from the National Institutes of Health in 2015, that found 51% of parents of children with intellectual disabilities or autism had had to leave work. So what can we do on this end? Number one, again, we encourage employers to take advantage of resources and best practices for employees who are caregivers. And number two, we want to support funding for this community. Particularly, we're thinking about the DBHDD rate study in the now comp waivers. And the reason I raised that, it goes back to why all those family caregivers told me they couldn't work. That when Georgians with developmental disabilities have adequate support, it's actually a multiplier of an investment. Because you've got the direct impact on them and their caregivers. And you're also supporting both groups to enter and excel in the workforce. Summing it all up, tapping these talent pools benefits, families, businesses, and Georgians with disabilities. I thank you so much for letting me speak to you. I would love to have follow up conversations with any and all of you. And I'm happy to take any questions. Thank you, Darcy. A question from Senator Hickman. A couple of quick questions. My wife, Joanna, said here, she worked for an organization with the first guy out of school at our college. And they, as a vocational rehab in all of them. And so she was in charge of placing people. But my question was, the 13 and 54 percent, all those are great, but what's the numbers of those? That's a great question. It's in the hundreds. I don't have those exact numbers, but I can follow up with those by email, Senator. I agree with you. And I know we see more and more businesses that are kind of zoning in on helping people with disabilities and all of this. I think the tickling of Anna, there's a restaurant that I think everybody who works here is, sometimes disability. But yeah, if you give it to us, no, I think that helps us kind of light a little bit more and kind of zoning in on it. Thank you. Yeah, I'd love to. Thank you. Other questions for Darcy? Seeing none, thank you for your presentation. Please thank Charlie Miller as well. We appreciate all the great work you tag team together. And we'll look forward to following up with you soon. Thank you. Thank you, Darcy. Okay, next up, Zach Field, the construction ready. Always excited to see Zach. We've known each other for a long time in his work, both in education, as well as through the Rotary Club, my Rotary Club in Roswell, Georgia. And I'm excited as he continues to do great things in his industry. So Zach, we're going to turn it over to you. Thank you so much, Senator. I'm going to put my stopwatch on right now. Here we go. Timer is on. It's a pleasure to be here. I want to take the first minute or so to tell Darcy, thank you for fighting for that population of people. The genesis of my majority here at the where I am today started out of the special education classroom in Roswell, high school, for seven and a half years. And I saw firsthand the talent that these young men and women have and they deserve an opportunity. That's a lot of what I'm going to talk about today is we have the talent here, much like the special needs population in our state. A lot of our talent is in the K-12 system where we can currently help them and better connect them to the opportunities that come after that. And so you'll see that as a common theme. What I'm going to discuss today is we're going to review the culmination of around four years of work that construction ready has done. We are a workforce nonprofit that was formed by the construction industry in the state of Georgia in 1993. And so we've been at this 30 years or so primarily in that intermediary space, that space between industry and education that can operate in both. And I think that as we look for solutions across multiple industries today and in the future, keep in mind that intermediary role that can be a connector between both those spaces. That's going to be an important one. So let's start with where we need to get to and what our workforce looks like today. We're just over 200,000 construction employees in the state of Georgia with 25,000 plus employers. Many of those are small businesses, to mid-sized businesses, 10 employees or less. And of course you got the larger ones that we're pretty well familiar with. And we have great associations like HGC Georgia and my colleague Mark Woodall here that represents many of those and also a great supporter of our work. Construction in the state of Georgia contributes 33 billion to the state GDP at its 4.4% of our state economy. I think it plays a larger role in that though. As we attract new businesses to the state of Georgia, no one can truly expand if they need facilities or infrastructure without having adequate labor supply in the construction industry. So we are very interdependent with other industries, but that also means we have even more opportunity for our young people and really our citizens across the state to jump into this industry. And to play a part in developing their community. 17.5 billion in wages delivered this past year. A few challenges that you'll see here. Material costs have gone up 20%. So we have a labor shortage and we thought things might possibly slow down during COVID as you all know people got tired of sending their homes and inside the building more. That was good for us, but also it didn't help with the shortage. We have three-year demand that we get from the construction labor market analyzer that puts construction demand for employees in Georgia at 380,000 plus. And just to contrast that we're currently at 220,000. And we lose around 5% every single year due to separation. A lot of that's the retirement you hear about the aging workforce. So when we take into account the retirements and just the other separations, we actually have a gap of 200,627 workers that we need in the next three years to just to keep up with current demand that's on the books. And to really keep our province as a state, when we attract new business here in a mega project that we can deliver not only to workforce to run that business, but the workforce to build that business on the front end. And that's a key issue we're working on. This is just more for reference, but you can see diesel has gone up from 253 a gallon in 2020 to 424 today. That is driving prices up everywhere and on construction sites. And I wanted to bring up these material increases because these are impacting our skilled trade programs at the K-12 level. So consumable budgets for these programs at the K-12 level are often provided through the local school system, local district. I don't know what we can do about it at the state level, but they were already low coming into this and now this cost of increased 20%. So they are suffering. They're cutting up pallets behind the school. Many are to have the material they need. We're working on it. Here's a snapshot of them now. So we've come a long way. In 2019, construction ready received philanthropic investment that really took our operation to the next level. And that's a lot of the reason why we actually have this data. And you can see the results here. But we wanted to contrast that. We were taking a look. In 2018, we tracked 429 students coming out of the K-12 program. Programs taking a next step to our industry. Since then, that number has reached 711,000 plus in those few years. So we're up 1,200, 1,400 students a year now coming out of the trade programs in K-12. Taking a next step, we run programs that incentivize this and we keep teachers eyes on the ball in this. And that includes technical college programs, apprenticeship programs. Any next step out of K-12, whereas students on a career path, we count that and we track that. You can see leveraged funding. So I know that as legislators, everybody's always asking you for money. We've captured some of the investments the legislature has contributed to the workforce effort so far. That's helped to get us here. We're very thankful for that. You can see the heavy equipment operation, simulators from last session here, connect grain equipment. All of these state-funded programs, we align with key workforce impact criteria to bring the necessary alignment to the front lines. If you all know our school systems are a big bureaucracy. And that's not necessarily a bad thing. There's strengths to that as weaknesses. But you have to make sure the impact gets to the front lines and happens between the teacher and the student. Otherwise, it gets washed out despite the best of intentions. These programs get funding directly to the front lines and tie workforce impact key metrics where the school system is tracking and reporting and making increases in that. You can see as well the philanthropic world has contributed to our workforce strategies and efforts since 2018 at 9.1 million. And that's not only because they care about the construction industry. It's really because they care about people and the career path for people. And that's the bigger issue here that we want for Georgia. In our construction workforce has increased to 220,000 from 190K since 2018. And that is with around 10 to 12,000 people leaving a year. So these efforts have been overall successful. We're just not where we need to be at. At a high level, we're focused on opening new programs in the K-12 space. More trade programs. And we go all the way down to elementary school for the reasons. I think we just, we heard you have to reach students earlier. They're parents are more impressionable. The students are more impressionable. And you really unlock learning at that age. You learn by doing. And that's in three words, learn by doing. Really sums up what this program is. And how it unlocks the learners that are in the schools that aren't feeling successful having to stay in a desk. Or do things out in academia space. But when they can apply their learning, they're learning their fractions, they're learning how to measure. They become those engineers. And you can see here that we've got a few challenges that those programs have. I just want to lift up as we're looking at things. Our grant time lines from the time the session ends to they do not align with hiring decisions being made. And K-12 writes their budget and career tech writes their budget usually December to February or so. And that's when they're making their teacher allocations. And that's a big bottleneck. And then we'll have a great legislative session and get investment. Well, by the time we can let schools know about that and they can apply for that, it's August. And school has started. And we're in that scenario right now. Our Connect Grant money that this legislature funded at $1 million for equipment to bring that workforce alignment. That is not going to be distributed to schools until this October. And the grant is open for three weeks when school starts. So it's just timing, but it's an issue. I don't know how to necessarily solve that, but it's a timing issue. We need to find a way to either A, incorporate the teacher allocation components into some of this. Or B, you know, let schools know some kind of flexibility on local budgeting for schools on teacher allocations, and then we're going to be able to bring the approval or the granting of these type of dollars that can really get a program launched. That's a really big deal. I already discussed the materials budget with you. We believe in creating vertical communities and vertical alignment through high school to middle school to elementary. Too often we looked at our career tech education space that existed only at the high school level in an elected format. And we were, a student has to choose to go in there. But if you did not have the step of where a student got to try something out to discover an interest, then they were just going to do what their friends parents do or what their parents do. And it's an access issue. And so these programs that started in Roswell, Georgia, and in an effort to reach students earlier, it was what I call a Bob Ross happy accident. And so we found that when we put a construction program at a middle school, 90% of students in that middle school took construction as a connections class, art, PE, music, construction. They tried it for nine weeks. That's enough time for them to discover whether they like it and to keep going and to have something to really look forward to during their school day. Same thing happened at the elementary school. We have 600 students at Mountain Park Elementary taking construction every year. And so we found that the students in the middle school, the parents, were thrilled what they're learning what they're building. That feeds into Elkins Point Middle School with 360 students taking construction and crab apple middle school with 360 students taking construction and the Roswell High School, which is absolutely dominating their peer competition and multiple competitions across the state and really producing. That's our model that is now spreading across the state. And we we're you know four sides coming on strong to manage Adam Columbus. It's happening. And so we're getting standing up these models across the state and showing people what it looks like. It's going well. Awareness. I won't read through all this, but we track awareness. We track the interactions between students in industry. We have programming that's plug and play that can go into the classroom before it gets to an actual program that would allow students to try something out for the very first time. And you can see where it around 70,000 20,000 students across the state built with Home Depot Toolkits and made a toolbox for the very first time and drove the very first nail. That's been a fantastic program. We will continue that. Here's here's how some of our programs are doing the Cherokee County High School welding program. One one the state competition and just place fourth nationally against all other states and welding. So congratulations to them. There's going to be a video here. I'm going to skip it. You can look at it later. But every year we rally the whole state at the Georgia World Congress Center Commissioner Dozier. I know you've participated in that. And we have we have around 10,000 people there. And it's the top skill trade talent in the state in the K-12 and technical college space. And they are competing for a state championship. We also bring school counselors there to show them what it looks like and we run professional development programming for that group as well to again build their industry networks and drive youth employment. Placement you can see here 1600 plus place this last school year out of these programs and just outside of the programs, including some 20 day pre-apprenticeship training that the organization runs. You have you can see here just just for your information kind of what that split is on how many are going to apprenticeship programs, technical college, direct to work, trade school for your college, et cetera. And so we again we have for four years we have a method of tracking this. And again, I think we need to make informed decisions with what the data is telling us. We have to we have to stop what's called the lost decade. And that's the connection I mentioned coming out of K-12. K-12 is really good at getting you to graduation. Okay. It has very limited capacity to get you to be on graduation. You're kind of on your own. That's that intermediary role or some of us organizations really need to break together to bridge that gap out of K-12. I think it's outside organizations helping and also believe it's teachers actually who could use a little more money. And we have a program for this that could help bridge that gap and champ as they say at UGA help help students finish the drill finish it all the way right. And so that's this concept. But right now in TCSG and other apprenticeship programs 26 or 28 years old is the average age. We lost people for 10 years before they showed back up in the construction industry. You can be a project superintendent in 10 years and have a six figure salary with an industry that's dying to teach you and welcomes you with open arms. So we need to back up that connection back up that connection point. Make these connections in K-12. It goes down to work-based learning just like you heard from Stuart. It goes down to internships and really taking students out of their bubble in K-12 get them into these industries to try it before they buy it, so to speak. And then they'll come back to school every day with a positive peer influence. And we're seeing that across the state. When a school does this with one student the next year five students. I've seen employers hire 10 to 12 students out of a single construction program because they started two years ago and had one success story. And we make a big deal out of that. The other is how we support CTAE at the K-12 level. There's a 70 30 split approximately. These are round numbers between how we fund academics and 30% how we fund career and technical education overall. If you look at that K-12 outcomes on students earning four year bachelor degrees 30% earned bachelor degrees in five to six years. And so it's an inverse relationship and how we fund it. If I say one thing today it's clear youth employment barriers and double down CTAE reach an earlier grade level so students can know what their options really are and they can try these things out. We have a tool to help here. It's being piloted last year was a pilot year. We have 5,000 high school students that are in our trade programs that we support with profiles of what they're building what they're making and what they're interested in. We have employers now building profiles in there to browse those students and see who likes plumbing who likes electrical who likes masonry. Let's look at the quality of their work. And that employer can actually message the student through the teacher. That's important because we know FERPA and youth we don't let an employer go directly to student they message through a teacher. So we have a digital connection point where employers can find the trade program, find the needs of the trade program and connect to their young talent. And Commissioner Dozer this would be a welcome, you know, we would welcome technical college, you know, trade related programs into this as well to do the same thing. This is been custom built for this workforce issue. I think it'll be applicable to other industries. Since I knew who we have here in the committee and we're wrapping up, I wanted to take a little little fun here. We've got some programs successes that have Roswell High School versus Statesboro High School here and these two have been slugging it out back to back Senator Hickman and Alvers here. So Statesboro High School, while the state with teamwork with the teamwork's win this past February or March at the Georgia World Congress Center be every single high school team in the state. At the most premier construction competition, there is you guys are always in session during this time. I want to invite you down if you can sneak away on February 23rd this year. And you can see they want a construction student one first and technical math. And so we really do both in these programs. You can see Roswell High School is right behind them. The teamwork champions the previous year blueprint reading first place and plumbing third that plumber owns his own business and we were out on a school holiday and I was going to work at 7 a.m. And he passed me in his work truck on his day off of high school and he was out pressure watching down the road. So just to end on a lighter note but happy note these are success stories from these programs. We won't read them but it's it's always a teacher investing in the student going next from mile and making a big difference. Here's the North Georgia technical college student that came out of rockmart high school that did a skills USA competition in in in our contextual drafting and drawing and it's now a trust designer at North Georgia trust company and you'll see a lot of females here because because these programs reach elementary and middle they they can reach every student in a school and that's a key thing that we reach every student in the school and give them an opportunity. So this is another student pursuing cabinet making a clumbest technical college as well. So we we love it. Save these dates if you want to see some competitions and actions are our good friends at agency Georgia host the regional competitions for skills USA and construction ready to host the state competition and we work on it all together but we love it and this is a very rewarding day to come see it on the front line so I'll stop there. Thank you. Thank you, Zach. Great presentation. Senator Hickman and I'll have to probably get some resolutions put together to honor some some young folks and teachers which will gladly do very informative presentation especially the work in the K through 12 education which is something I think in my generation we did a whole lot more of and we lost for that gap of maybe a couple of decades and obviously you've got the right recipe. We just have to expand that. The one thing you mentioned about the timing for those for the budget and grant is something we should be able to solve. Perhaps we need to move those up to our amended budget which will get out earlier so I'm going to ask Haley here with our research team who is putting together some of the information that maybe we can work with some of our folks in our budget teams and our preparations chairman to come up with some creative solutions to fix that. Are there any questions for Zach? Let's see I've got champ in then Ryan. Okay you you mentioned something about it. Digital platforms and how you keep them engaged. Can you explain a little bit more about that? Yes sir we had we had a problem with we just had too many ships passing each other in the night between all this talent in K-12 and the employer's capacity that hasn't worked for four short. It's kind of like somebody needs to go to the doctor whether to seek to go to the doctor that's a little bit what it was like and we're trying to fix that in a sense of contractor seriously lack capacity to even help themselves in this scenario because the backlog of what they had to build. And so we knew that technology we have to leverage technology as one tool to help solve this problem and so we knew that if industry could see what these students were actually doing and these students could see what their opportunities were outside of their classroom bubble. That was a step in the right direction it also solved a big data problem for us we were manually hawking down data you know four or five people on our team working on it all the time. It was taking away from us actually doing the work part even though the data part was working to understand what I'm saying. We decided that we would create the LinkedIn version for young people that are in CTAE programs and we started with our own architecture and construction career cluster and students now have an opportunity to upload pictures of what they're building, what they're making, it's like a portfolio of their work and explore areas of interest and even indicate those areas of interest. And then automatically connect to employers that are in the geographic vicinity of them, proximity of them and in areas of their interest. And then we knew that teachers needed those connections points to and so we developed custom from scratch a platform that does that and we piloted this last year we piloted the student enrollment phase. We have 5,000 plus students in our trade programs that are in there right now that we should look at some time and now we're piloting the employer enrollment part of that to make those connections. And so that's going to help with program support and students getting the job opportunities. We also have employers in there that are already cleared to hire at 16 and 17 years old which is a very big deal because it backs up the connection point where we can help students that are junior year instead of the tail end of their senior year. And those can be automated to help our work based learning coordinators. We have assets across the state and work based learning coordinators at their schools. We have people but those people still need tools and need help and we have fronted the cost of this fully on our team to make this happen and come to a reality. And so we're excited about where it's going and now we're working the employer side and continue to work the student side. This also automates our workforce data so that's key as well. This gives us instant data on what connections are being made because they get scheduled through the platform. What job offers are being made even what wages students are earning. It's confidential but we have that data so we can make informed decisions and so we're very excited about it. All right and we got a question for Ryan what do you kind of a quick question and answer and this to stay on track. My question to you would be that I think restaurants and construction share a lot of similarities in there. We both have a huge labor shortage that is highly dependent I think sometimes on residents who are living in the state and let's say are seeking citizenship. Can you talk to that workforce of yours that is looking for citizenship in Georgia here to work and how immigration plays a role in your hiring practice? Sure. If you look on a construction side you see a lot of individuals that would be seeking citizenship in our country. It's done different ways in the industry. Our industry is a whole position would be if we can legally allow people to work that want to work we want them to be able to work. And so I know that there are some difficulties with the immigration workforce but we would just prefer I think that's because an industry that we would like to be able to tap that labor force, pay them fairly, bring it out from the shadows. That would be our ideal but we run into barriers a lot of times it's done through a broker that says everybody in their company is legal. And that's in the industry. They're just passing the risk and liability off to others is what it ends up playing out like but we think that's definitely an opportunity for improvement. Any final questions? Senator Beach? That welding program is very successful in charity. Thank you. My question to you is I got two quick questions. One is are we tracking these kids three years out to see if they're still in the industry and how they're doing and then secondly if there's a real success story or they coming back to the high schools and given testimonials saying this is a great industry. I've got a great job making a great living doing well. Yes sir. How we handled that manually the three year you know the retention longitudinal tracking. So that was a condition of our grant with with Bernie Marcus that we established a longitudinal tracking system and so this this platform is that it does track students beyond graduation. They they flip over to a professional profile and become public and active at that point before manually we would do it with following up with the employer individually and say hey does this person still work there and we got our early data like that but now this platform is meant to solve that.\n\non that data. And then you'd ask the success stories of people coming out of programs and coming back. Yes, absolutely. Best practice across the board is a young graduate, young professional comes out of a K-12 program. We have a student from Anning Johnson that got hired out of Cross Keys High School and he went through their Carpentry Apprenticeship program. He's now coming back into the classroom and he's the best recruiter and he's saying, hey listen, I was like you, here I am, I'm young, I make money. Evan McGee at Holder Construction, one of the best ambassadors. He's an assistant superintendent right now. So that's a great recipe. What we really need him to do though in addition to that is come back and teach. We have the same teacher shortage as we do. A workforce shortage out there in the industry. And so we're kind of looking at how do we make that happen. Thanks, Jack. Okay, one final question. Senator Estadette. Thanks very quickly. I know you're working with CTA programs. How have y'all worked to embed yourselves in some of these academies that school districts have across the state where the entire high school population is able to come to these centralized locations and work? Yes, we work with many, many career academies in vocational type school, you know, centralized schools in that regard. We provide, we help them set those up, set up the lab. We will work them on the curriculum and implementing the program and training the instructor. And then we're generally on the advisory boards supporting the program or in the program speaking to students. So we would do that universally whether the setting is a high school, you know, traditional high school or a centralized career academy model. Very active, very involved in those and have seen great success. Thank you very much, Jack. We appreciate your time and we got some lead-aliving presentations yours and being one of those. So we'll make sure that the committee members get a digital copy of that as well. Thank you. Okay, next up, Shane with Carol, Daniel construction. Come on down. Look forward to hearing from you. A kind of timely back-to-back with all things construction, which is obviously integral, not just to that industry, but how they support all the other industries here in our great state. Good morning. Thank you, Senator Albrecht for having me and your committee for having me up to speak. Just like Zach mentioned, construction we know is basing a shortage, right? It's across the board. And so we had an idea back in 2019 to combat our shortage of superintendents. And so what we did was we created an apprenticeship program through Leneer Technical College. We partnered with them and we created an apprenticeship program to basically create this pop line to mold and form superintendents for the construction industry. That was our biggest concern at the moment. And so with that, that program has been highly successful. We're in our fourth cohort. It is beginning to catch ground, be replicated across the state. But with that came a couple of roadblocks that we ran into. And they're good problems to have, right? So the first one that I want to talk to you about today is we had a couple of success stories with our students who they completed the program. They had an associate's degree in construction management technology. And then they come to me and they say, hey, Shane, I think I want more. I want a four year degree. I want to get a construction management degree from Kennesaw State or Georgia Southern. I sit down and I talk to them and I say, okay, well, let's see what we can do, right? I want you to be the most successful person you can be. And so we sit down only to realize that the two years and the 60 credit hours this student received now equates to 15 transferable hours. So they go from being a potential junior transfer into a four year university to a freshman just finished up their first semester. So that four year construction management degree now became a six year degree. And I think that right there is one of the heartaches for me is to tell that 18, 19 year old student. It's going to take you four more years. This is the best I can do, right? So I think that was one of our roadblocks we hit and I'll talk to you a little bit more about how I think we can resolve that. The next roadblock we ran into was the success of this program as it replicates across the state. We're having issues replicating the same program we had at Lanier Tech to other technical colleges. And I'll give you an example. We have a certain curriculum at Lanier Tech and Oconee Fall Line Technical College reached out and said, hey, we want to replicate your program. We want to work with a construction company down here and we want to do that. I remind you that Oconee Fall Line and Lanier Tech are 200 miles apart almost. But there was hesitancy from Lanier Technical College to give their program and their curriculum to Oconee Fall Line. I have said on committees advisory committees for different technical colleges and we do SWAT analysis and each time a threat gets brought up, it is we're afraid that other technical colleges are going to take our students. How can a technical college sit back and be afraid that another technical college is going to take a potential student and be successful closer to where they live? So that was my second roadblock. And so now as I sat and I did a little bit more research, I realized that this problem is not just construction. The ability to transfer credit hours, the ability to have a replicated curriculum across the state and your technical college, it also applies to nursing, it applies to early childhood education. It's not just construction, right? So I think today I'm here more from a industry workforce development saying that all of these workforce needs, all of these career opportunities that are struggling to find individuals to work for them. We've got to find a better way to help bridge that gap from the technical college to the university system of Georgia so that we do not limit the success of our students for those that want to go above and beyond and go for everything that they can get, right? And so today I propose that we do a couple things. I think that I personally would like to see a curriculum that can easily transfer to a four year university. And I'm not asking that every credit hour that a person takes to the technical college transfer, but more than 15 hours out of 60. One fourth is all that will transfer. Maybe it's a half, maybe it's three quarters, I get it, right? There are certain courses that need to be taught by high level professionals in that, but a course like Introduction to Construction Safety, you go to any job site in the state of Georgia. OSHA is being taught by industry professionals. It's not being taught by those with master's degrees and PhDs. So what's good for the industry should be good enough for our technical colleges and our university systems as well. And then the second part is I also would like to see a construction management technology curriculum that is university across the state or universal across the state. It can be the same 60 hours of credit. And I can say, hey, our program is rocking in Gaysville, Georgia, right? We've got 20 kids that have went through, you know, five of them are already assisted superintendents. They're running $10 million, $20 million, $30 million jobs. Let's bring that to your local technical college as well. And once again, it's not just about the construction industry. I think we need to look at it as a whole for these high need career areas, whether it's nursing, education, construction, whatever. I think it's something across the board. Thank you. Shane, that was very powerful. You bring up some excellent points. One of the things we discussed in some prior meetings is we celebrate when someone gets accepted to, you know, a major college university. We do not celebrate when they're going to want to commission those technical colleges nearly the same. Now, I know some schools are obviously making a lot better effort, but we should have you having celebrations as big if not bigger for folks. But I do think that maybe we can work on commission. I'd love to hear your thoughts on that to connect those dots because we do want to give people the unlimited upside potential. And I will just add to that. I have always had a concern that we have been teaching the two years of prerequisite college classes the same way for a hundred years. And if someone's going into a certain industry, they don't need to learn Shakespeare. They do not. And I think it's a real chance for us to spring forward and evolve that area. And I think you're touching on some important issues. So let me turn it over to Commissioner Dozier to talk more about our technical college system. Thank you, Mr. Chairman. And I do appreciate your presentation. One, I have talked to Brian about, which was the articulation issue that you mentioned. And second, we have not talked about some little disappointed to just hear about that today. But I can assure you have programs that cross all 22 technical colleges. And that's very doable. And now that I'm aware that we may have an issue with a program being replicated. We can fix that very quickly. The articulation agreement. I just want to speak a little bit about that. That's something that we do have a lot of work left to do on. We're very proud that from a state level, our university system and our technical college system have 28 courses that articulate, meaning if you take that course with us, it articulates into the university system. Typically, those core classes like English 1101, Math 1101 and many others. Beyond that state articulation agreement, we have local articulation agreements. So depending on which technical college you're in and which colleges are around that, we have a series of articulation that may be specific courses all the way to what's being presented today is a true two plus two. You do your two year degree in the technical college and you pick up where you left off and finish your four year degree with those final two years. I have been in discussions with the chancellor hoping that we can do some true statewide two plus two's across the system. There are certain university system colleges such as Kennesaw, but have a true two plus two across the system in certain engineering areas. And those are very doable. We have a, you know, I don't want this the transfer that you mentioned and we'll look into the 15 transferable hours. I've got to look and see if that's uniform across the system with this program or if that's just unique to the colleges in your area, but there's obvious work that we can do in that area because we have all the above from a true two plus two what's being asked to the 26 articulated classes statewide. So I'm very open to true two plus two's from a state level and thank you for that position. Brian's been very helpful on that and definitely I can help you and help us because we should be able to have true statewide solutions. And we do have some of those civil engineering. One of the things that came to us through Russell was a two year civil engineering pathway and he'd like to see commonality of those programs across the state. We now have that. We are working on a program right now that's connected to the electrification that's going to be a true statewide solution across TCSG. And so this is an option we can help you with and I look forward to it. Mr. Chairman, thank you. Thank you, Commissioner. Other questions for Shane. Seeing none, thank you. Excellent testimony today. Okay, next up with the Metro Atlanta Chamber of Commerce. Tim, would you come on to the podium here or to the table? Thank you, Mr. Chairman. My name is Tim Carroll. I am Senior Director for Talent Development in the Public Policy Department, the Metro Atlanta Chamber. Thank you, Chairman Albers and members of the Committee for allow me to present here today. What I'm bringing for you today and you have copies coming in front of you is our 2023 Talent Supply Report. This is the third in a series of talent reports that we have done since 2017. So I also want to preface this by saying the report that's coming down to you. It's on the end of your table there. The report that's coming down your way is an advanced copy. This does not technically go out publicly until September 20th. So you will, you are the first public group to get your eyes on this report. So thank you for allowing this opportunity. So we set out on this journey for talent to look at the degrees and certifications being supplied across our state, matching those degrees and certifications to demand on the job side. And we do that primarily through job postings that are publicly available. We do some discussion around employment and unemployment and then some skills that are required for those jobs as well. Through this analysis of data, we identify where we have some over undersupply and then what are some recommendations for how we could correct some of that over under through some tried improvement methods. We also want to be able to track our progress. So as we try things in industry, as you all try different policy recommendations, we want to see what's working and highlight those things that are working in. And then we have some examples of that included in the report as well. And then lastly, this is just to inform the work that we are doing here at the chamber. So this would be primarily through the interactions that we do directly with our companies and talent acquisition and HR. We're not going to spend a lot of time on data. You have the full report in front of you, but I do want to talk briefly about how the data, that an ideal cycle would be used. That we have this data that is collected, that is presented to employers, that it informs how we train, that it then feeds back into our education and training systems, that then increases or corrects any gaps in supply or oversupply. So that is the idea. I'm going to touch briefly on the types of information on the report. I'm not going to read through these slides. We talk about migration, about how we are doing as a metro area and MSA areas compared to our peer states and pure metros. We have a job postings by industry and how those are increasing since the previous or the initial report. We look at the supply of different degrees and certifications of all levels, not just two and four year, but including high school diploma and for certification level, and then how that matches up. And so we look at job postings for those and then how much supply we have on that side. We also dive pretty deep into the skills requested in those job postings. I want to put an asterisk on this and this is mentioned in the report, but this is a changing landscape on the employer side where say 20 years ago, you would probably have a skill list in the job posting. It looks very similar to what is in the presentation. These are more general terms like communications and multitasking and computer skills or leadership. What you're seeing now more is that companies are moving to actual tasks that are required that include a skill not necessarily the generic skills. So in saying something like communications, it would be the ability to schedule meetings for multiple people online and in person or whatever that specific task is, that is the direction that job descriptions are going. I say that because what we've heard repeatedly for some of our education partners is that they want more details on the types of skills and qualifications that are needed in their degree and certification program. So I think that the job history is attempting to respond to that as well so it improves the overall system. I want to spend a minute though on what we found in the data because I think this is really going to the heart of why I'm here today. Number one, I want to say Georgia has gotten really good at what we do. Number one, state to do business, years in a row and we're very successful at economic development example of where we're sitting today. So I think that comes some big responsibilities though. It is on the talent side that we have a lot of jobs to fill. So while we have increased the number of degrees and certifications and people that we are graduating from these programs, we also have a much larger increase in the jobs that are demanding those. So it's just to say Bravo for good work but with it comes big challenges. The second, and this speaks more to what was mentioned by some of the speakers earlier, is that early work experience of any kind is more critical today than it was five years ago. This goes directly to front line or customer service facing roles primarily. So if you are in a customer interaction where you're having to interact with customers, not just sales but anyone who's a front line worker, you could also think EMS or anyone who is dealing one-on-one with people. What we've seen with those job posting since 2017 is that the increase requiring prior work experience for what most would consider an entry level role has increased significantly. And what that tells us is that there is a lot of churn in those industries. You have a lot of turnover that is probably a little higher than what it was in 2017. And as a result employers tend to ask for prior work experience to guarantee that that person will stay in that role longer than what they're experiencing. So I say that, that is one example. The second one would be on those highly certified or highly skilled positions where you might have the opportunity. You would think coming right out of college with a degree, I'll pick on an example such as data analyst or data science. And going right into a role is very difficult to break that door in unless you have some type of prior work experience. It can be as minor as a short term internship or it can be as long as a longer apprenticeship program or any type of prior work experience. It does not even necessarily have to be in the industry in which they are applying. It is the idea that someone has committed a portion of their time to a work experience. But that is absolutely an increasing factor for our entry level work. Number three, and this goes back to informing how we as employers inform this data. Right, this one thing to look at numbers. It's another to actually interpret what these numbers mean. When I say there are numbers beyond the data that we see, we have a group at the Metro-Lanaget Chamber that we assemble on a regular basis that are several dozen HR and talent acquisition heads of our companies. And one of the insights that we had when we were showing them some of this preliminary data and I'm going to pick again on data analysts. This also happened when we were looking at construction numbers. As we were posting a specific job number up there that we pulled from a state database to say this is the number of open jobs for data analysts. The people who sat in that room, which at the time was about 20 companies, said collectively in this room we're hiring more than that total. So something is off. And what we figured out is that the data sets that we pull across a number of different sources are only showing the actual posting. So it's one job posting. But for some of our companies that posting is evergreen, which means it sits out there, but it actually represents 100 positions or 10 positions or depending on the industry that one job posting is a placeholder from more than one position. So what we have realized is that a lot of the planning that takes place not just from a state level but from an employer level on how we do economic development isn't necessarily the true number. So what we do expect to see is the next iteration of this report is going to have a much different look and feel because it's going to be informed more directly by industry and businesses who are contributing real time data and what their actual job openings are. It does have some implications on state policy. If you think about the planning units that happen across economic development education of all levels that rely on those job posting numbers to indicate budgets, indicate forecasting. We're seeing that there's a little bit of a disconnect there that we're hoping we can correct with the next iteration. And then the last number four, I know is not new to this committee, but that is that we've got to get better at developing our own talent. We are not the only state that's having this particular issue. There are dozens of states that are in the same exact spot. We are all competing for talent. We still have to keep up our import game. Georgia is really good at importing talent globally and nationally. But we've got to do better at accessing where talent sits in our backyard. Many of you on this committee had a hand in helping with things like our second chances legislation. You heard earlier about some of the popular, the unique populations in Georgia that are an untapped labor market. It is important that we dive deep on some of those populations. The last one I'll say is that companies, and you heard this a little bit from Stuart too, about how companies are responding internally and connecting internal pathways and education and really thinking about not just a single job for their rest of your life. But sometimes it's a pathway that that individual could follow. And for some individuals that can start very early before they finish high school. And for others it might happen mid-career. But the idea being that employers have responsibility just like the state does to make sure any pathway, whether it's through an education partner or whether it's internal to a company, has an outcome that's profitable for everyone. So I say that in full candor. How we use this data, one is we try to do smarter partnerships. We focus on where the critical jobs are in our companies and then connecting those with education partners that help fill that. We also use this data to project like how we need to establish partnerships. Is it at which level, how do we determine those pathways inside of a company? Many of you on this committee have a hand in removing or reviewing the state requirement for your college degree. Our companies are doing the same thing. You see job postings where a number of hard degrees have been eliminated. And then the last is just being a strategic about how we invest and how we partner. And you've heard some of that today. I won't go back into reasurate that. September 20th this report goes live and it will be at talent supply report.com and on the MAC website. I mentioned our talent co-lab, which is our collection of HR folks. We are happy to talk through recommendations at any time. And then I'll give you an advanced warning that in queue for we have a student interest and aptitude report, which will also be the third in the series or reports that we're due that it'll come out talks about K-12 student interest and aptitude. And I'm happy to answer any questions Mr. Chairman. Thank you, Tim, for that great presentation as well as for the report. Everyone has a copy here. We've got a question from Senator Estabez first. Thank you, Mr. Chairman. A couple of quick questions. One related to point four in developing our talent. Are we tracking how many people the migration trends of people being trained going to college here getting a degree in the leaving Georgia? And how that stacks up against those coming in and then the second question is related to the early work experience and the change that we've seen in recent times with young people with the gig economy and jumping around very quickly and how we're adapting as a workforce and adapting to that trend. Yeah, there's been a lot of interesting moves around the gig economy idea, this idea that you have more contracts work sometimes remote. In fact, if you look at a lot of the job postings that are here in Georgia, they aren't always for companies or positions that are even based here. And that's true in other states as well. So I think that that trend is here to stay. It may decrease in some industries and may increase in others, but I think that that idea that skills and talent are invested in the person, not the place that the person is calling home. Should be a reality for a lot of industries. I will say, though, I do want to put a check by this that that is not the norm across every industry. There are certain subsets of industry, whether that's things like call centers or whatever you may call it, like there are subsets of companies that that will work for for the majority of companies and the majority of their positions that is not the case. I'm going to put that disclaimer out there on the out migration. This has been a challenge. We looked at a lot of data sets when we were putting this report together and it was really difficult to find a number that was not only consistent but reliable and that was going to be backed up by more than one source. But we weren't really comfortable putting that particular information in here. For instance, like you could see some where you would have graduates of programs and then they're trying to track where that student is. But that requires the coordination of a lot of labor departments to put that together. And it's also not necessarily looking at other factors that influence that person's move. For instance, where did they come from? Where were they born? Where do they have a family connection? Which is usually the number one reason why a person will move across the state line for a job. Use that as one example for why that data can get a little smushy. So we just weren't comfortable putting it in this particular report of a certain day. Senator Hickman, quick question. The question in observation. First, the question is, I have a, in the world that I'm in, I'm in a world I'm in a communication as a big issue and I'm not talking about telecommunicators. I'm talking about having verbal conversation. As anybody done any studies about cell phones in schools and how that takes away not only the concentration of the kids and the classroom but also their communication abilities. And the second thing an observation from our families joined I decided about a month ago that if we're going to take our family out to dinner or lunch, there'll be no say, if we're going pay for it, there'll be no cell phone usage at the table. And I tell you, it is unbelievable people how much more conversation our family has now and how much more we know about each other by not being on cell phones. But if you would answer my first question. Yes, sir. And I personally feel you on the cell phone. I have seen it implemented in certain districts and certain schools where it is a hard lockdown. I'll say for example in some employers, you will even see cubby holes outside where you enter the workplace.\n\nfor your cell phone codes in before you go in. That is a unique case though. The reality is that the age that we live in, the ability to for an employer to instantly communicate with an employee is pretty vital. You think of everything from inclement weather to a sickness, to childcare problems, to a need to come in 10 minutes earlier than what was originally scheduled or 10 minutes later. That ability to instantly communicate is a requirement not just on the individual side but on the employer side. So I say that because there's probably not an absolute answer to what you're asking. I think for some employers they've got to adapt and they've got to come up with a solution that works for their workplace. And the same thing with the school. If it works for the school environment to say no cell phones in a classroom, then that's what I should work best for the school. But it would be impossible to dictate that across every business, at least from our standpoint. I know in our area of one of the private schools, the Pinewood Christian Academy is implemented that all the cell phones must be given to the home room teacher when they come in in the morning and then the home room teacher in turn and give some back in that when they leave. Yes sir. I've seen that as employers as well. Interesting. All right, just to stay on track, so we're going to cap the time Tim, thank you. And if you have any further questions, I know you'll be here after the meeting as well. Appreciate you bringing that up Senator Hickman. I think that is an important part where we've heard as a consistent theme in these meetings is the lack of soft skills, especially for our younger generation right now that wasn't necessarily an issue, a generation before them. And certainly these have a lot to do with that. However, it comes back to parents too. And I know one of the recommendations we always like to make is we have to educate kids more. But sometimes I think we have to educate parents to do their job as well. Some of the things probably our parents taught us of looking someone in the eye and shaking with them their hand with a firm handshake and having an adult conversation with people and getting to work on time and doing your job and communicating. And I think in today's society, as we've become overly technology dependent, we've lost some of that. And it's an art I think we need to find again. As we've gone through this committee, we've been talking a lot about what is needed in the private marketplace. What do businesses need? However, what we can ignore is a key component, which is the government that provides jobs but also helps to do the work to lay the foundation for those jobs in the private marketplace. So I'm thrilled today that we're gonna bring in representatives from both the state, the city and county governments to give us an update on what they have been doing for workforce and where they see this going and some recommendations for us. And what we're gonna do is we're gonna have each one of these groups come up. We're gonna hold questions to the very end. And I'll just ask all of you to be on the ready for any final questions as a group. So we can stay on time. So we're gonna begin with the Georgia Department of Administrative Services. So Al, if you wanna come over to the microphone, we look forward to hearing from you. Thank you. My name is Al Haule. I'm the deputy commissioner with the Human Resource Administration with the Georgia Department of Administrative Services. And kind of been a couple of words, what HR is is that we provide, I say we're the enterprise HR leader with the state and we provide assistance to the other agencies in terms of recruitment, talent management, compensation, areas of HR we provide them tools and resources that's who we're all called about. And I just wanna thank Senator Albers and also the Senate Study Committee for inviting us to be here today. And what I'd like to do today is just talk about a couple of things. First of all, I'd like to share with you some metrics and demographic metrics and some other metrics about our workforce. Then talk about some of the challenges that we face with our state workforce. And then wrap up with sharing with you some insights from a retention study that we completed this year with the help of Deloitte Consulting. And I believe this information taken together will give you a better understanding of the needs and problems, but also the opportunities regarding our state workforce. So that's the agenda for this morning. So we'll start looking at, first of all, the state of Georgia workforce, give you a little bit of information about the composition of our workforce. And look at it from a generational standpoint. And the slide on the left shows our current composition by generation. And we're like a lot of industries today. We have five different generations that are working together at the same time, which is historic and unique. And it presents different challenges for employers, but basically 42% of our workforce is made up of either millennials, those born between 1981 and 1997, or Gen Z, which are individuals that were born after 1998. So about 50% of our workforce is either millennials or Gen Z. And that's also reflected in the hiring. You look at the chart to the right. That indicates our hiring. And this is as of FY23. The data I'm sharing with you is as of April of this year. And so 65% of our hires are either millennials or Gen Z. And some other information about our workforce is that we currently have around 69,898 employees. 66% of our workforce is female. And the median age is 46.6 years old. And then the median salary is $46,427. So that's just some demographics about our workforce. Also, to talk a little bit about some of the challenges that we face, but maybe back up a little bit about our workforce. Since we do have a high population of millennials and Gen Zs, it's very important in terms of development. One issue we find is that, and I've heard people talk about this morning as accelerating development in terms of getting to our Gen Zs and also our millennials ready to step up. Because we do have a lot of baby boomers that are leaving. So in terms of getting them prepared and ready for leadership or for other positions, accelerating their development. How can we do that? Accelerate quicker. But the next slide, I'd like to talk a little bit about some of the issues that we face as a state employer. And the first issue is that separations have exceeded hires for the last five fiscal years. You see on the chart on the left, shows for all state agencies, the chart on the right is for executive branch agencies only. And you can see beginning in FY18 through FY22, we've had more separations than hires. We have like a hole in the bucket, you know, where we have people that are, but for hiring people, but then people are leaving on a greater rate. So we never can really get up to the level of established budgeted positions. So what that means, that leads a lot of employees that are here, they have to do extra work. They're constantly having to fill in because we can't get up to that. They can't plug that hole. Fortunately, you'll notice in April of FY23, the trend is starting to reverse. Matter of fact, this, you'll notice the last chart. I mean, the graphs there for FY23, we're seeing where hiring is starting to exceed separations. So that's a good sign. And we believe that is partly due to the coals, the 2% and the 5% coal that was appropriate by the General Assembly and by the Governor Kim, has had an impact because you can, we trend this data, and then you see when the coals took effect, we start seeing numbers going up. So that's a good sign to see. Another challenge that we have is high consistent turnover. And again, the story is kind of the same here, but turnover is that for the last five physical years, beginning in FY 2016, we've had consistent high turnover. And beginning with FY18, to FY22, our turnover rate has been over 20%. Matter of fact, the highest year was FY22, where it was 25.3%. That's a lot of turnover. And you'll notice again, too, that we're starting to see that trend come down a little bit. We're projecting that for FY23, we may be slightly below 20% or right at it. But that has been one of our problems, is high consistent turnover, which creates, I'll first someone used the word, churn. And that's what's creating for us, is that we have this churn where we have this constant turnover. And so it's definitely hard in terms of filling positions and keeping them people in those positions. And to take another look at this, this shows separations by generation. And the separations are starting to trend lower by generations. But if you'll notice the blue line, that is Gen Z. And their turnover rate was as high as 76% at the end of FY21. Now that has gone down to 30.3% for, we're projecting for FY23, but that's still high. And then for millennials, it is, we're at 28.3, they're down to 16.6%. But those two generations, they have the highest turnover rate, and I'm talking about voluntary turnover rate, than any other generation that we hire. We're not keeping the next generation. And that's very, very important, but we want to be bringing relevant as an employer, you have to be able to keep the younger generation. You've got to capture their imagination. Now, one thing about millennials and Gen Z, is that they are interested in career exploration. They like to try out different things. They also like to grow and develop. So some of this could be natural, in terms of not being able to keep the younger generation. But I believe we have something great to offer them. And that is mission and purpose. You know, a lot of the things at the state that we do, has a lot of its purpose, and we help others. And that really resonates with Gen Zs and with millennials. But here again, that's just another look at turnover. You'll notice for the other generations, the trend is starting to go down. So that is good. But also like to share with you some information from a retention study that we did, just recently, we did this in conjunction with Deloitte Consulting. This was done during March through June of this year. And what we wanted to be able to find out is, you know, what motivates people to stay, with the state and what would motivate them to leave the state. We wanted to also have some strategies for recommendations about how can we attract people to the state, how can we engage them, and then also how can we develop them. So that was the whole purpose of the retention study. And what I wanted to show you on this chart here, first of all, we did part of the study was an engagement survey that was administered to all state employees. We had over 12,000 employees respond, 12,433 employees responded. That's about a 25% response rate. And they represented 62 agencies. And so we felt like we had a good response rate. And in terms of the chart you see here, they're part of the survey. There were 42 statements that employees had to respond to in these seven different categories, dealing with the state of Georgia organizational culture, agency, organizational culture, job satisfaction, relationship with management, development and support, leadership and management and team dynamics. So over those categories, over 42 statements where employees had responded either I agree, strongly agree, I'm neutral, I disagree, I strongly disagree. What's encouraging with this is that the overall strong, either agree, I strongly agree, with 77% for those, and aggregate of these seven categories. But I'm not going to go through all the data, but I want to point out a couple of interesting data facts from this that I think is relevant to what we're talking about today in terms of attracting talent. First of all, 88% of the employees that responded to the survey, they either agreed or strongly agreed that they believe in their agency's mission. That's tremendous. 88% said, hey, I believe in my agency's mission and what they do. 83% either agreed or strongly agreed that they enjoy working with the state, which I think that's positive. 85% either agreed or strongly agreed that they felt like their work was meaningful and it added value to others. Things we can capitalize on in terms of trying to attract talent and keep talent. The area of development and support was the area that we rated the lowest. As you see from the chart, the overall rate strongly agreed rate was only 62% for development and support. And to kind of pick something from those responses, only 59% of employees either agreed or strongly agreed that the state provides training and development opportunities that are relevant to my role. So this is an area that we need to maybe look at and how can we improve that. Development is the ultimate perk. And that is something that, especially with the younger generation, they're very interested in, but development and support maybe is an area that we may need to focus on in terms of attraction and retention. And another part of the engagement survey, we wanted to find out what's your intentions to stay. And we could write out ask employees, hey, are you planning on leaving? But we just were asking questions in terms of what's your intentions for staying with the state? And encouraging enough, 63% of respondents said that their intentions is to stay either six years or more with the state, where 26% said, hey, I intend to stay another one to five years with the state. So that was positive. But I wanted to draw your attention to the bottom of the slide. To me, this is the meat of the retention survey, or the retention study. This shows the five top reasons for attrition, for retention, and for re-employment. And what I mean by re-employment is, someone who's left state government and then they came back. Now, what made them come back? And you'll see the top five reasons for each one of those three categories, drivers of attrition. You know, what would drive someone to leave or motivate them to leave compensation was number one. And then limited career opportunities, lack of work-life balance, negative work environment, and then lack of location flexibility. And this is coming directly from employees, they're telling us this is what would make me want to leave the state of Georgia. And then also, in terms of retention, work-life balance, leveraging skills and interest in benefits, and then for re-employment, those three top reasons are mirrored also. Again, work-life balance, leveraging skills, and then benefits. We also had focus groups that were done. There were over about 1,500 employees that said that they would participate to wait, talk with 81. You see what the drivers of retention for them, that they'd be able to make the base upon the focus groups, with strong connection to mission, remote work opportunities, and then retirement and benefits were very important. And these are some things that we are doing with HRA, to try to address the issue of recruitment and retention. One big activity we're doing is that we're currently working with Senate Bill 3, where we are looking at job requirements for jobs in terms of college degrees. And some of our job descriptions be more experienced-based instead of educational-based. And so we're currently in that process. We've created a new unit with an HRA that's focusing on recruitment and retention. We've done a retention study. And also, we just completed a work, what we call the Workforce Strategy's initiative, where we work with the state agencies who try to develop career pipelines for entry-level positions. So those are just some of the things that we're working on with HRA. Thank you, Al. That's a great presentation. We're going to let you step away. And we're going to have Noah and Brian come up with GMA. Thank you for the call out for Senate Bill 3. That was another initiative from Lieutenant Governor that I carried through the Senate. And it was passed in Sonnet the Law by Governor Brian Kim to look at all of our state jobs to make sure we're matching up the right education and experience requirements so we can make sure we always have the best and brightest on staff. We'll turn it over to the Georgia Municipal Association. Gentlemen. Thank you. Good morning, Chairman Albers and members of the committee. My name is Noah Renitz. And I'm a member of the governmental relations team for the Georgia Municipal Association. Chairman, I'd like to thank you for inviting us here today to speak a little bit about municipal workforce development. And I have Brian here to speak about some of the challenges we've identified within that space as well as some of the solutions going forward. So Brian. Great. Again, thank you, Noah. I'm Brian Wall, some of the director of Strategic Initiatives at the Georgia Municipal Association. So thank you for this opportunity today. I'll be first introducing GMA and Georgia City's solutions to the folks at Donut know who they are. Georgia, the Georgia Municipal Association represents all of Georgia's 537 cities. It's a mission is to anticipate and influence the forces shaping Georgia cities and to provide leadership, tools, and services that assist cities and become more innovative, effective, and responsive. GMA's board is comprised of city officials from across the state. Georgia City's solutions is a 501C3 nonprofit established by GMA in 2018. It operates with a separate board of directors, including three city officials, the GMA CEO, an executive director along with individuals from the private and nonprofit sectors. It is dedicated to helping cities address various issues, one of which is municipal workforce development. So recognizing the implementation is a time all dealt directly into the issue at hand. Georgia cities are facing a familiar yet daunting predicament, finding and retaining a skilled workforce, factors like private sector competition, imminent retirements, and evolving job expectations from potential employees require city officials to rethink the recruitment and retention strategies. Regarding the upcoming wave of retirements in Georgia's municipal workforce, around 25% of the approximately 40,000 city employees in Georgia will become eligible for retirement by 2029. And that is a substantial figure. From retirements alone, Georgia cities will need to identify 10,000 replacements to fill essential positions in public safety, utilities, public works, recreation, planning, community development, and management. And the ongoing population decline in rural Georgia County as complexity to this challenge for cities in those areas. What cities want and need mirror those of any employer, they want competent, engaged, responsible employees that care about the quality of their work and the communities they serve. The GMA has been actively addressing the municipal workforce challenge over the last six to seven years. We've established an advisory council of city officials focused on this issue. We've developed a job recruitment campaign and resources to help cities. We've added workforce-related courses to the GMA training program. We have held workforce sessions at the associations and no convention in other meetings. And have offered webinars and provided information on the GMA website. We've also launched the Jobs with Purpose Initiative with Georgia City Solutions. This initiative stemmed from a statewide municipal workforce needs assessment by GCS and the Carlevin's Institute of Government in 2021. The needs assessment found that 85% of cities face challenges attracting applicants with smaller cities having a bit easier time with that. Police, utility, and sanitation roles were especially tough to fill. 35% of surveyed cities predicted a skills gap in the next two years. So this was done in 2021, so they were looking ahead two years. With 14% already experiencing a skills gap at the time of the survey. City employees averaged 45 years of age, slightly above the national average of almost 43 years of age, again, back in 2021. 45% of the cities had an average age of 40 and 50 years of age. And a few had an average of 60 years of age and over. Now those are primarily pretty small cities, but just a few employees. Larger cities have 83% and medium-sized cities at 67% found it challenging to retain employees. Well, this was less pronounced in smaller cities at 39%. A quarter of the cities felt that pay with the least competitive benefit they offered. And nearly half of surveyed cities lacked a workforce plan with only 5% having a formal centralized workforce plan in place. Based on this data and GMA compiled a strategy and playbook listing action block strategies for cities, GMA and GCS to address challenges and recruitment, retention, paying benefits, and planning and partnerships. One of the recommendations for GMA and GCS was to offer grants to cities for consulting and other supportive services in order to help them the cities address their workforce development needs. And this is what I'll briefly touch on now. Through funding provided by GCS, we're helping cities proactively address their workforce needs through planning and strategy implementation. Our pilot cities were Brunswick and Douglas. The work in these two cities was partially funded by a grant GCS received from the Volcker Alliance was a nationwide group that is interested in the public service. GCS has secured additional funding that has enabled it to expand this work to six more cities. Griffin, Thomasville, Cordill, Adel, Morrow, and Rockmart. The work in each city is being done in two phases. The first phase involves assisting the city and conducting a municipal workforce needs assessment. Where do they look at their current staffing levels, review retention and turnover data, as well as current job openings, review the age of employees to understand how many are close to retirement, and in which departments discuss what's working well in the city in regard to workforce development, as well as what the city's challenges are, and also to determine what's the city should be working on going forward. From that, we help them come up with a strategy and actionable items to address their self-identified needs. In the second phase, the cities receive assistance in formulating a job recruitment strategy. The city will be provided a toolkit with city-specific visuals, and targeted messaging, focused on addressing the city's top recruiting challenges. Through our engagement, as any benefits from one, conducting a comprehensive workforce needs assessment to identify gaps in concerns to crafting actionable strategies to address its workforce needs based on the needs assessment, and three, developing a recruitment strategy using GMAs, starts with me, job recruitment campaign, and resources. While the work of this committee primarily concerns a private sector, as the chairman alluded to earlier, there is the need with the public sector. It's worth acknowledging that a thriving, private job market directly affects cities, counties, and our friends in the school systems. As populations grow, and the job landscape changes, local governments require qualified talent to provide essential services. Georgia's local government support businesses and require a skilled, capable workforce. Just as private enterprises do, cities need employees who are proficient and committed to their roles. City jobs integral to their communities offer meaningful employment that contributes value to both individual and the job into the community at large. As your committee continues its efforts, exploring opportunities within the technical college system to train future city employees is prudent. Some technical colleges already collaborate with cities on specific programs, and we're very thankful and grateful for that. And this strong collaborative partnership could be expanded to meet long-term municipal employment needs. So I think it's worthy of further discussion. Additionally, supporting cities and creating their own workforce needs assessment with yield positive outcomes, these assessments are crucial, yet the nature of cities, operations, and limited resources often pose challenges to initiating them. It's important to recognize, and I know this group does, that addressing the state's workforce development challenges isn't alienating your path. It's interwoven with the economic and community development, housing, education, and quality of life challenges and opportunities. This intricate landscape affects workforce development from any multiple directions and angles. This complexity is why GCS also concentrates on literacy, exemplified by the Mayors Reading Club Program launched in August of 2022. This initiative enhances children's literacy skills and early reading achievements through the encouragement, leadership, and support of Mayors and cities. In support of this effort, GCS commissioned a series of children's books to teach young readers about cities. The first book, Georgia Caroline Visit City Hall, introduces readers to city services and operations. The second book, Georgia Caroline visits our hometown heroes, highlights the important role of local police and fire departments. Three more books are in the works. These efforts aim to enhance our youngest residence, understanding of the role of cities, the different jobs found in cities, and how cities and the people in city jobs contribute to the success of Georgia. It is truly a long-term game. City jobs are essential, impactful, and meaningful. Our efforts are focused on helping secure a competent workforce for Georgia's cities. Thank you again for the opportunity to speak to you today. Thank you, Brian, and thank you Noah. If you would please take a seat again. We'll wait questions to the end, and no stranger to any of us. Clint Muir with ACCG, who will be our last presenter of the day. See if I can get the presentation up here. She's up there. There you go. There you go. There it is. Go right ahead. Right. Thank you, Chairman Albers. Members of the Senate's study committee. My name is Clint Muir. I'm the Director of Governor Affairs for the Association County Commission of Georgia. We represent 1959 County Governments in the state of Georgia. We are your local arm for the state. I appreciate you giving us this opportunity to talk a little bit about some of the challenges and some of the ideas that we have that would help with our workforce. I don't have statistics or data for you today. I did a survey of our county managers and administrators across the state. That's where the information this presentation came from. This is what they said that they're experiencing out there in the counties of our state. First, talk a little bit about some of the challenges that we're facing. Obviously in the private sector, the flexibility being able to work from home, flexible work schedules, those have become very popular recruiting tools. Unfortunately, in the public sector, especially in county government, most farm employees have to interface directly with the public. They don't have the police officers, firefighters. We can go down the list. They don't have the luxury of working from a computer at home. They don't have the luxury of coming in an hour late and staying an hour late. We have rigid schedules. They have to be. And that's making it a challenge, right? So the younger people that like that flexibility, that like being able to work from home, we can't offer them those types of jobs. Like of skilled trades, we hear that over and over again. I'm sure you have too. A lot of our workforce at the county level of government requires skilled trades and we're having a hard time recruiting those. In particular, one that was mentioned is we're having a hard time getting people that have CDL licenses. I'm sure that is across the board. And I'll talk a little bit more about that when we get to some of the solutions. Lack of housing, near employment, requiring longer commute times. So a lot of these jobs that are lower paying jobs, those people can't live in our communities, are living outside the communities and community in. So we're asking a lower paid employee to drive further to spend more money on gas, to spend more time away from their families. We need more housing that they can afford to live in closer to those jobs. Goes along with less work life balance. Obviously, you're commuting.\n\nhours a day, you're not spending time with your family and that lessons work life balance. Fewer defined benefit plans offered in exchange for more profitable to find contribution plans. As you know, historically, government has had defined benefit plans, pension plans that have attracted people to come work for the public sector. We've gotten away from that. We hear all the time now that, you know, the 401A 457B plans offered by county government are not really any better than what they could get in a 401K in the private sector. Therefore, that's not an attractive incentive to come work in the public sector anymore. Much smaller pool of applicants, especially for our department head positions, this goes back to what you've heard about lack of institutional knowledge. Historically, we had people that came up through the ranks before they got to the department head level. And they'd already worked for the county government for 10 or 15 years. We're not seeing that anymore. So, where do we get the talent to head up some of our departments? And again, the counties are very broad in what we do. From public works to the courts, to planning and zoning, to all the public safety disciplines, we have a wide range of department heads. And then last, more mental health assistance in EAP programs. So, in particular, I wanted to mention public safety because that seems to be where we're having the worst shortage or the biggest challenges we're trying to recruit people into the public safety disciplines. Obviously, in public safety, those that are working in those areas are having to work now more overtime because of the shortages. That's creating more burnout. We had a lot of burnout during the pandemic, especially with EMS and fire and law enforcement. And we're still suffering from that. We have a lot of people left the profession because of the burnout. We have a critical need for 911 dispatchers and paramedics in EMS. Quite frankly, especially in law enforcement, the threat of prosecution. That is a problem. People are putting their life on the line. They're having to make split-second life and death decisions. And at the same time, they're seeing that, hey, I could be prosecuted personally. I could lose my family. I could wind up being a civil litigation because of what happened on the job. And so for those reasons, there's a lot more risk. And so for the pay, a lot of people are saying we don't want to take on that kind of additional risk. Young employees, as you know, will move for small, sourly increases. We're seeing a lot of competition between the state level of government within our counties and within our local governments, the cities, where we're basically trying to poach employees off one another. Obviously, the more urban counties that have larger resources, they can compete with the state and provide the same salaries that state employees have. Our rural counties cannot. Their tax base is not such that they can compete. Luckily, I think somebody mentioned earlier about people wanting to sometimes stay close to family. And that's the top criteria. It's to where people live and take jobs. That's helped us in the rural areas because all these people are from the rural areas and they want to stay there because their families are there. But it's becoming harder and harder. People become more mobile and move around. It's harder to retain people in the rural counties based solely on family relationships. At some point in time, they're going to look at pay. They're going to look at benefits. And if we can't compete with the more urban counties in the state, they're going to move. lack of funding and support for more youth programs to provide early exposure to public safety careers. You heard that today by others. We've got to expose people through K through 12 to jobs in the public sector and get them interested in taking those jobs at early age. So some of the recommendations from the managers and administrators on the CDL, and I'm not familiar with this issue until it was brought to my attention. But apparently, we have counties that used to train their people for the CDL license. And they no longer can do that. I believe there was a federal regulation change. Now, they're saying they have to go through an eight week course at the Tech School of Colleges, which I'm sure that's a good program. And I'm sure they're getting great experience doing that. But for some of our counties that used to do it in-house, they can no longer do it in-house. And they're saying we feel like we had a pretty good in-house program that we can no longer. So it's taking them longer, I guess, to get people trained and to get that license. Going to the issue of having, that's a young employees jumping from one department to another for a few thousand dollars, I know with law enforcement in OCGA 35, 8-22. There's a provision in there that if somebody leaves within I think 15 months or up to two years, they have to pay back some of the training costs in salary they received. That only applies to law enforcement. I know our firefighters, they would like to be included in that because we're seeing the same thing happen with our firefighters. They're jumping for just a few thousand dollars. And so the counties that are investing in the training, I know that they can do contracts with the employees, but to have something in state law I think would be very helpful to protect them for their investment. They're making to train some of these new recruits. We have legislation that was introduced last year and again this year providing PTSD insurance to first responders. We'll be pursuing that again next legislative session, but we think that's important as I mentioned earlier with a burnout. We're seeing a lot of people in these career fields that are suffering from PTSD due to the events they experience on the job. And so we've worked with the Georgia Municipal Association and our insurance departments to put together an insurance program. We just need the legislation passed to give us a legal authorization to provide that. With EMS, this is sort of unique. This came from the Fire Chief in Cherokee County. As you know, Chairman Albers in Cherokee County, they have a joint fire EMS across train. And we have that in a situation in a lot of counties across the state where they're across trained. So they do a lot of in-house training. Usually take some about 11 weeks to get somebody trained, but they can't hire enough people in the EMS side of the house. And so they want to bring in people that already have the licensing for EMS. But to do that is problematic because they want to work the same hours that the firefighters work. Quite frankly, a lot of our firefighters, they're able to make ends meet by taking multiple jobs. They work for multiple departments. Sometimes they work private sector job on top of their firefighter job. They're able to do that because of the work schedule. A lot of them are working 24 hours shifts. So they have time off to do other jobs. Well, EMS doesn't have the same flexibility because of the Fairleigh Standards Act. I know this is a federal issue, but our county managers would love to be able to include EMS in the same overtime scheme that we have for law enforcement and firefighters where we can work within a longer time frame without hitting the 40-hour overtime requirements. And so we'd like to see EMS treated more like our firefighters in that regard. And we'd be able to attract more people into that that already have any EMS license without the training ourselves. More funding for workforce housing studies in communities. We have a few counties that are doing workforce housing studies right now, but I think that's become a hot topic the last few years with all the inflation in the housing market. We're going to need to do more in the way of studying what are our needs, what is the future workforce, what kind of living environment or they want to live in. We're seeing obviously everything trending towards rental. I don't think that's probably more by necessity than maybe what people actually want. Obviously, people starting out probably need to rent for a period of time, but we still think people have a long-term goal of home ownership. And we want to make that possible for people that do want to own their own homes in the community. We feel like they're more invested in the community when they own their own homes, but we're going in the wrong direction there of so we need to figure out ways to provide more home ownership opportunities. And finally, find more incentives to entice retirees to come back to the workforce. At least part time, we've got a lot of institutional knowledge, especially in government where it's important that institutional knowledge that we've lost. And we just don't have the institutional knowledge coming up behind them. And so how can we attract some of these retirees to come back? So that's my presentation. Be happy. I know you're going to take questions I think from everybody on if you want us all to come up here. How do you want to handle that? But be happy to answer any questions. Well, have everybody on the ready. First, I want to thank you for all, for your presentation and all three of you. You touched on something important, and obviously a passionate supporter of which is public safety. Lance Larusso is kind of a leading attorney that supports all those in public safety. And I've shared this with people before, but I want to share it again with everybody in the room. PTSD, post-traumatic stress is an event that you have in your life. Now, we hope it doesn't get to the D, which is a disorder, but it obviously has really become to the forefront for our soldiers over the last many decades. Now, our greatest heroes coming home or what they experienced during combat or other related experiences they have. And if you think of a PTSD, that's what the average human goes through at some point of your life. In fact, the average person will have four major PTSD events in your life. They will affect you. And hopefully you're able to cope with those who help of family and friends, etc. A combat veteran who serves for a couple of years can have as many as a hundred or 125. Anybody want to take a guess of what an average first responder, police, fire emergency medical services or 911 dispatcher has? 700. 700. And the impact of people from PTSD, who heart disease, cancer, marriage, families, etc. is extraordinary. So I would like everybody to keep that in mind. It's not just a workforce issue, although it's a very important one. It is also an absolute necessity because each one of us, no matter where we are, where we live, is a critical part of our lives and livelihood. So thank you for bringing that up. Are there questions for either ACCG, GMA or Department of Administrative Services of the state? Senator Heckman. The problem is not it just happened. It's been going on, but it's really all of a sudden now hit the wall. And it's all about fault. It's not just a situation. It's all about fault. And I think we really need to look in the mirror at the cities and counties and say, what can we do to correct this and not ask the state for money all the time to correct it. Thank you. Thank you. Senator, other questions or comments for our three panels? All right. Well, in that high note, thank you, Senator. Thank you all very much. Great presentations. For those here on the committee, we are going to have a lunch in the same room that we met in earlier this morning. Followed by those who can stay for the tour of Kia. Thank you, Stuart and team. There's going to be a shuttle that is going to leave at 12.45. So please be prepared to get on the shuttle. If you're going over the tour, it's going to again, promptly at 1 o'clock. A reminder, our next committee meeting is going to be in commerce just outside of SK Innovations large facility on September the 19th. You've got to see the website up. One of the key components of that website is to make sure we hear from everybody. There's only a certain amount of time we can have for people to come make presentations. But everyone has a chance to have their voice heard. So you can go on and you can submit your testimony. You can write it in there. You can email it to us. All of that's being assembled. I want to thank Haley and our Senate Research Team for the work they're doing for absorbing all this information, making sure that all the committee members have access to that. And that will be a part of our final report as well as recommendations. Again, want to thank Lieutenant Governor's Office, the Senate Press Office, the Senate Research Office, our legislative council and all the support staff. Thank you, Allison, for your first study committee. And to all those who came to speak today, I greatly appreciate you taking your time out of your busy schedules representing whether it be the counties, the cities, our state, your private marketplace, or great initiatives in the construction industry, the others in order to try to improve as well as those in our special needs community in order to have a fulfilling role for them in our lives. But also to fill those important gaps we have in the workforce. We are blessed by your presence here at our committee today. We thank you for the opportunity and this meeting is your by-a-journ. Have a great day.",
  "updated_at": "2026-02-13T17:50:53.989289+00:00"
}