{
  "video_id": "sWvmFvf6_yI",
  "url": "https://www.youtube.com/watch?v=sWvmFvf6_yI",
  "title": "Sen. Halpern Press Conference on HBCU Heritage Day | 03-13-2024",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 44,
  "summary": "Overview:\n- This summary covers a press conference held by Georgia Senator Sonia Halpern for HBCU Heritage Day at the Georgia State Capitol on March 13, 2024.\n- The event featured speeches, prayers, and performances celebrating the history and contributions of Georgia's Historically Black Colleges and Universities (HBCUs).\n\nKey Actions:\n- No specific bills or legislation were mentioned.\n\nBills Introduced (First Reading):\n- None detected.\n\nNotable Moments:\n- Senator Halpern welcomed attendees and highlighted the vital role of Georgia's 10 HBCUs.\n- Ethel Johnson, an Albany State University graduate, performed the song \"Lift Every Voice and Sing.\"\n- Senator Derek Mallow led a brief prayer.\n- Albany State University President Dr. Marion Ross-Fedrick introduced other HBCU presidents in attendance.\n- Governor Brian Kemp and First Lady Marty Kemp were in attendance and spoke, thanking Senator Halpern for organizing the event.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The event was attended by Georgia's Governor and First Lady, Lieutenant Governor, state legislators, HBCU presidents, students, and graduates.\n\nAdjournment:\n- The summary does not provide information on the adjournment or the date of the next session.",
  "transcript": "Good afternoon. We are going to begin our program. Welcome to the fourth annual\nHBCU Heritage Day and I'm happy to introduce Ethel Johnson, Albany State\nUniversity graduate who is going to open up the program for us. Thank you\nSenator Helpren. I have to move that mic back because my mouth is kind of\nlittle big with an appropriate song for the HBCU heritage. Lift every voice and sing. Lift every\nvoice and sing, Till us and heaven ring, Ring with the harmonies of the liberty.\nLet our rejoicing's rise as the liest,\nNene's guise, let it resound, loud as the road,\nSing a song full of the faith that the dark past had taught us.\nSing a song full of the hope that the present has brought us.\nFacing the rising sun of our new day begun.\nLet us march on till victory is won.\nThank you, let us please give another round of applause to our vocalist, Ethel Johnson.\nThank you very much for blessing us with your voice this afternoon.\nThank you to our Governor and First Lady, Kim.\nThe Lieutenant Governor I know is coming, Bert Jones, legislators of the Georgia General\nassembly, presidents, and leaders of our HBCU colleges in Georgia represented here today\nand to the many students and graduates of Georgia's HBCUs.\nIt is with great pleasure that I, I am Senator Sonia Halper, welcome you to the Georgia\nState Capitol for our fourth annual HBCU Heritage Day.\nAnother thank you to Governor Kemp and First Lady Kemp for joining us here today and once\nagain presenting this celebration in partnership with my office.\nWell Georgia is home to ten historically black colleges and universities, making us the\nnumber two state in the nation tied with North Carolina for having the most HBCUs.\nThese institutions have played a vital role in our state's history and continue to shape\nGeorgia's future. The college's honor today are Savannah State University, Albany State\nUniversity, Fort Valley State University, Pain College in Augusta, Spellman College, Clark\nAtlanta University, Morehouse College, Morehouse School of Medicine, Morris Brown and the Interdenominational\nTheological Center. All ten of these schools have positively impacted the lives of nearly\n20,000 students all together each year.\nGeneration after generation,\nHBCUs play a vital role in elevating\nstudents' socioeconomic status,\nhelping develop future business,\ncivic community, and faith leaders,\nand have provided a proven pathway\nto the middle class and beyond.\nSo whether it's a first generation college student,\nlike both of my parents were,\nwhen they left Mississippi Farm Life,\nfor a world of new opportunities,\nor one of the 76% of HBCU students\nwho are Pell Grant recipients,\nor those second or third generation students\nwho are carrying the weight of family expectations,\nHBCU's offer a welcoming environment,\nand the support needed to succeed.\nSo today we are celebrating the rich heritage\nand ongoing legacy of Georgia's HBCU's.\nPlease join me in welcoming my colleague, Senator Derek Mallow,\nwho will lead us in prayer, and I wonder, I see what we're\ntalking about.\nThank you, Senator Halburn, to our governor and first lady,\nthe elected representatives that are here today,\nour HBC presidents, and all of you.\nThank you all for being here.\nDisclaim as a Baptist preacher, I will give a brief prayer,\nand I mean brief, I do mean brief.\nSo if you would pause and join me in a word of prayer,\nmost gracious to turn on all wise and all knowing God.\nGod, we thank you for a day that we have never seen\nand a day that we will never see again.\nFather, we thank you for each and every person\nthat thought it not robbery to assemble themselves here today\nto celebrate the work that our HBCUs have done\nin the state of Georgia.\nFather, we just ask a special blessing upon our HBCUs\nfor we know that they have told the fields for many years\nto help produce some of the most best and brightest\nof our country and of our state.\nGod, we ask that you guide the leadership of this state\nas they continue to make investments in our HBCUs.\nGod, guide the hands of our presidents\nas they administer and oversee the operations\nat those HBCUs.\nAnd God, we just ask that you bless those\nwho have assembled themselves here today, father.\nWe ask that you give them traveling grace\nand mercy on their way home.\nGod, we ask that as we leave this place,\nit never be from your presence.\nIt is in the most wonderful matches,\nname of the most high that we do pray.\nLet our heart and mind say together, amen.\nNext up, I am introducing the President,\nMary and Fedrick of Albany State University.\nYou might have seen that she was just,\nwe just learned recently that she will be leaving\nAlbany State University.\nso we will miss her extraordinarily capable hands\nin that institution, but she is coming to Atlanta\nwhere she will be Senior Vice President.\nOh gosh, let me get this right.\nAt Georgia State University and Chief of Staff\nto that President, Brian Blake.\nAnd I believe for the first time,\nwe will have a Senior Advisor to the Chancellor's Office\nin Dr. Frederick.\nWelcome, welcome.\nThank you, and Senator, when you say it that way, it gets me nervous.\nGood afternoon, everyone.\nSenator Halperen, thank you for continuing to bring this event to the Capitol every year.\nHBCU Heritage Day, I think this is the fourth annual HBCU Heritage Day, so thank you for that.\nGovernor Kim and Mrs. Kim, thank you for continuing to support our HBCUs.\nSome amazing things have happened because of the support that you provided, so thank you so much for that.\nI am Dr. Marion Ross-Fedrick, President of the Unsinkable and Indestructible Albany State University.\nHowever, if the Flint keeps rising, we may be in some trouble, so hold on to us as the rain comes.\nBut we are here from Albany State University, the largest HBCU in the state of Georgia,\nbut also the most academically diverse institution with Associates, Bachelor's, and Master's degrees.\nI get the wonderful opportunity today to actually introduce\na couple of the presidents that are with me and colleagues.\nI'm just going to do two, correct?\nYes.\nOK, so before I do introduce them, the governor's going to speak.\nBut I will say Dr. George French and Dr. Paul Jones.\nPaul Jones is my colleague.\nDr. Paul Jones will come up and speak after the governor.\nThank you.\nSo, our governor really does not need any introduction.\nWe already know that he is a devoted husband, father, businessman, and a dedicated public\nservant.\nOver 35 years ago, he founded his first business, Camp Development and Construction Company,\nwith nothing but a pickup truck and a shovel.\nlook 30 years later, he leads Georgia as our governor and he remains an entrepreneur with\ncompanies and investments in many different areas.\nHe has played a vital role in driving economic prosperity throughout communities across\nGeorgia and under his leadership, Georgia has achieved the remarkable feat of being ranked\nnumber one in the country for business for an unprecedented 10 consecutive years.\nPlease join me in welcoming our Governor, Mr. Brian Kemp.\nWell, thank you all very much.\nThank you Senator Halpern for that and for also just taking the time to organize this event\nevery year on behalf of our first lady, Marty Kemp,\nwe're excited to be with you for the fourth annual now\nHBCU day at the Capitol, certainly an incredible opportunity\nfor us to celebrate all these proud institutions\nhave done and continue to do to enrich our state.\nI know our Lieutenant Governor, Bert Jones, has arrived.\nAs you all know, this is a crazy, busy time\npart of the session, so there's a lot of moving parts going\nthe Capitol and I appreciate you all bearing with all of us that are having to be\nplaces and be on the floor and I know you'll hear from Lieutenant Governor Jones\nin just a minute. I also just want to thank the other members of the General\nAssembly that are here and that have supported this event in the past. You know\nSenator Mallow when he was praying he left out the part about praying for a\nswift and drama-free end to the legislative session. I may be more biased than others on\nthat part of the prayer. I appreciate Representative Patty Bentley and Representative Roger Bruce\nand a lot of other folks that are here. We're so excited about Dr. Fredrick's new role.\nI know she's going to keep Dr. Blake straight. That's exactly what I thought when I first\ntaught, heard the news, and I appreciate our esteemed presidents for allowing me to jump\nin front of them because of our workload and other commitments that I have, but we're\nvery grateful for all that you all are doing.\nOur nation's historically black colleges and universities have played an integral part\nin shaping our economy, culture, and certainly an important part of Georgia's history.\nGenerations of Black Jordans and Americans have come to these campuses to pursue higher\neducation opportunities.\nAnd for generations, these institutions served in many times as the only option for Black\nJordans and Americans seeking skills and knowledge for success.\nToday, our HBCUs are the campus of choice for so many across our state, but also across\nour country because of their rich legacy culture but also pathways to success. We are proud\nGeorgia has played such a large role in that legacy with graduates of our HBCU's going\non to become leaders not only in politics but business, the arts, STEM, religion and every\nwalk of American life.\nNow I will just tell you, from my perspective as the governor, I hear weekly from corporations\nand businesses in our state about the talent that we have in Georgia, but especially in\nAtlanta.\nAnd it's why major companies and corporations are coming to our state.\nIt's while they're not laying off folks.\nThey're coming here and growing even when their campuses and other parts of the state may\nbe downsizing and often here how big a part to HBCUs are to that workforce development.\nThat diverse talent that we have in our state is one reason we are doing so well just\nright down the street.\nAnd it's because of the hard work and faculty of Albany State, Clark Atlanta, Fort Valley\nState, Morehouse, Morehouse School of Medicine, Pain College, Savannah State, Spillman, Inter-denominational\nthe illogical center and others that have empowered generations of black Americans to unlock doors\nthere were once closed to them and that is important work that they continue to do.\nWe are working to support them in that mission because we know that education is the key to an\nindividual success and by extension an success for our entire state. With Georgia continuing to\nto welcome record economic growth\nto all four corners of our state.\nWe need institutions like these\nto keep preparing the next generation\nso that they can take advantage of these opportunities.\nThat's why this year's budget proposal\nincluded over $10 million for capital projects\nat Fort Valley State and Albany State\nin addition to the funding for all our public universities.\nI was also proud of one of my administration's top priorities\nAnd I want to thank the members of the General Assembly that worked so hard with us to get\nthis piece of legislation to fruition.\nAnd that is the teacher pipeline package that passed a couple years ago.\nIt included a specific provision that requires our professional standards commission to work\nclosely with HBCUs to track greater numbers of minority teachers into this field.\nIt is important that all students can see themselves in their teachers.\nAnd that measure helps make that a reality.\nIn closing, I look forward to continuing to work with the leaders and the students of\nthe HBCU's represented here today.\nThe local and state officials, especially those that are working in the gold dome that\nhave such great support for HBCU's like Senator Halperin, Senator Mallow, our Lieutenant\nGovernor Bert Jones, and many others.\nBut also our education leaders to keep celebrating and supporting our HBCU.\nThey do good work.\nThey help make Georgia the best place to live, work, and raise a family.\nSo thank you all for being here again this year.\nIt's been honor to be with you.\nGod bless.\nThank you again, thank you again, thank you again first lady as well\nOkay, so now it is time to bring up two of our great presidents, President Jones, President\nFrench, will you please join me at the podium.\nWe've got represented here Fort Valley State University who will talk to us about our\nschools and of course Fort Valley is one of our public HBCUs.\nHe can tell you himself, but there's two land grant institutions in Georgia and Fort\nValley is our HBCU land grant institution established in 1895 that is just how\nlong they have been educating students. And then we've got President French who\nof course is the illustrious president from Clark Atlanta University here in\nAtlanta. Clark Atlanta has the distinction of being HBCU that offers both\nundergraduate and graduate programs for its students and it is part of what\nwe colloquially and happily call the Atlanta University Center, Atlanta is the only place\nin the nation that has the largest and oldest consortium of HBCUs in the country.\nSo it is a very unique asset that we have right here in the city just miles down the road\nfrom this capital.\nAnd anyway, welcome gentlemen.\nThank you.\nThank you.\nGovernor First Lady Camp, I know they have left Lieutenant Governor Jones, Senator\nHalpern and other esteemed General Assembly members, good afternoon.\nAs we gather here today to celebrate HBCU Heritage Day, we stand at the intersection\nof history and progress, reflecting on the profound support,\nprofound impact of historically black colleges and universities\nin shaping our communities, our nation, and our world.\nI'm deeply honored to address you on behalf\nof Georgia's public HBCU's Albany State, Fort Valley State\nand Savannah State University.\nAlong with my friend from Clark and Atlanta University\nPresident French, as we affirm our commitment to excellence, equity, and empowerment.\nHBCUs are not just institutions of higher learning.\nThey are beacons of hope, opportunity, and transformation.\nThey stand as a testament to the resilience, perseverance, and brilliance of excellence,\nproviding a nurturing environment where dreams take flight and futures are forged.\nThe economic impact of the public universities in Georgia is staggering,\ntotally more than $584 million.\nThese are figures, these figures, rather are not merely statistics,\nthey represent jobs created, business, businesses supported, and lives transformed.\nAnd that's only the three public institutions I'm mentioning.\nBut our impact goes beyond dollars and cents.\nHBCUs are pillars of their communities, fostering a culture of service,\nleadership, and civic engagement.\nWe are catalyst for change,\nexcuse me, empowering our students to become agents of progress and\nchampions of justice.\nThrough partnerships and local businesses, government agencies, and nonprofit organizations,\nwe are driving workforce development initiatives that prepare our students for the challenges\nof the 21st century economy.\nSo let us celebrate HBCU Heritage Day with pride and purpose, knowing that our journey\nis far from finished.\nTogether, let us continue to build a world where every voice is heard, every dream realized,\nand every life value.\nThank you, and may God bless our beloved HBCUs and the communities it serve.\nThank you very much.\nThank you, Mr. President.\nmost certainly to the governor and first lady in absentia to our lieutenant governor and\nfriend lieutenant governor Bert Jones to senator Sonya Halper and all of your colleagues\nwho have worked audiosly to make this day a reality to the distinguished executive director\nof Atlanta University Center Consortium, Dr. Michael Hodge, and to my colleagues, my colleagues,\nthe hardest working individuals in this nation without doubt, to my colleague, Dr. David Thomas,\nthe president of Morehouse College, to my colleague again, Dr. Paul Jones, president of Fort\nValley State University, and I'm going to skip over this one. I'm going to come back to that one\nand intentional.\nMadam President, congratulations on your new role\nat Georgia State University.\nWe are proud of you.\nI stand before you as President of Crockett Lanter\nUniversity, which had its origins in 1865.\nAnd on the campus for which we originated,\nwe were fortunate because of a brotherhood\nto give a campus for the establishment\nof a phenomenal institution.\nThe institution would become Morris Brown College.\nTo be clear, we did not leave Morris Brown\nwhen you started.\nWe had your back and we continued to have it\nand we are proud of the work my brother\nthat you've done there.\nOnce you give my colleague a hand.\nSo what we want to celebrate today would be the work of the commission, the work of\nthe legislature, the work of the senator in putting together resources to continue to support\nthe HBCU's public and private within our state.\nWe ask for legislators, those representing legislatures to get behind Senator Halpern,\nthis effort and the efforts of all of our HBCU's representative Bruce.\nWe thank you so much Senator.\nI want to make sure that we recognize, thank you again to our presidents.\nWe already heard from President Fedrick, President Jones, President French.\nI want to also acknowledge President James, stand up, Morris Brown, President Thomas,\nMorehouse College, and Dr. Valerie Montgomery Rice, I know, is coming.\nShe, of course, is the president of Morehouse School of Medicine.\nWhen I invite Senator Mallow, I am going to let you, we're going to share the introduction\nof our lieutenant governor because our colleagues, Jason Annapattar, as you know, the work that\nwe're doing on our HBCUs has been very bipartisan in nature.\nThere is a lot going on today, but you do your intro, and then I want to say a few words\ntwo before you come out to lieutenant governor.\nAs the junior senator to the senior senator, I, of course, yield.\nOur lieutenant governor, Bert Jones, is the 13th lieutenant governor.\nHe's father, husband, to our First Lady of the Senate, Miss Jan Jones.\nBert is also the president of the Senate, and he's our lieutenant governor.\nSo our first term is lieutenant governor, Mr. President, and those terms are interchangeable.\nLieutenant Governor has been a friend to HBCUs.\nHe has been very listening to our needs\nand where he can help, he has helped.\nAnd most recently to commission a study for veterinarian school,\nhe's been working to address some of the infrastructure needs\nat Savannah State University.\nI know for a fact he has been an inch ago\nand some of the needs at Albany State University as well\non the center side and we're grateful to have someone\nwho will listen to our issues.\nAnd he has not only come and listen.\nHe has also come and visited our HBCUs to see what we have to offer, to see the excellence\nthat takes place on our campuses and also to understand better the work that you all\ndo and that we do as an HBC alum each and every day and I cannot say thank you enough\nfor that work and I will now yield to the senator from Atlanta.\nI am only co-signing on this to say that our lieutenant governors, we served together\nsince I've gone there. We had served together as senators. He does not have an HBCU himself\nin his district. He served as a senator for 10 years, but has visited some of the Atlanta\nones. As we started talking about HBCU work, he asked great questions. He was very curious\nabout the work happening on these campuses, and together we decided that there was no better\nway for him to better understand them, but to actually get in front of those schools.\nSo we did a tour last fall and visited with all of our schools.\nAnd coming out of that, I've been really grateful for him for his support and some of the work\nI'm doing.\nI will name specifically, there is a piece of legislation.\nThe heat has, as Senator Mallow just said,\nearnestly understood the needs and challenges\nand has been working hand in hand with us\nto try to identify ways that we might close\nsome of those gaps that he himself\nwas able to see with his own eyes.\nSo without further ado, our Lieutenant Governor,\nhurt Jones.\nThank you, thank you, thank you, thank you, thank you.\nThank you, everyone.\nI appreciate Senator, that nice introduction.\nand also my favorite senator from Savannah right there.\nI enjoy Senator Mallow.\nI thought he was a lawyer and I found a one lawyer\nand I was like, surely he's a preacher.\nThe way he gets up in the whale and he's not a preacher either.\nAnd I was like, what do you do for a living there?\nBecause you talk too good, you're too smooth to not be\none of those two.\nHe goes, I'm just a good salesman.\nSo lieutenant governor, so he does a great job\nIt's always a pleasure serving and doing work with Senator Halpring and what she's done\nfor HBCUs and what she's done to bring the HBCU initiative to the forefront.\nAnd she came to us last year.\nWe're very fortunate here in the state of Georgia.\nWe have a lot of opportunities in this state and a lot of different realms whether we're\ntalking about in the medical field and the educational field and manufacturing, whatever\nit is, we have a lot of opportunities. And when Senator Halperin came to me last year\nand said, I want to do more to raise the profile of HBCUs, I said, I do too, you know, because\nI want to do, I want every university and every technical college and every, every, every\neducational entity we have to feel like they have a seat at the table and be a part of\nmaking a difference in our what I call a workforce development. And when we were talking about\nthe HBCUs, both private and public, I said, you know, I'm a hands-on person. I really\nlike to get on the ground and see exactly what it is each university offers, what they do best,\nwhat they want to be known for. And thankfully every president and made time for us to come,\nI will have to say Dr. Fredrick's rolled out the red carpet down there at Albany State right there\nI said they're gonna have a hard time topping this now because it was it was the bands were played and everything\nBut I did find out it was homecoming week that week, you know\nSo I thought it was just for me, but you know she was actually like it was all for me. I found out it's it was homecoming week\nThey were y'all play it were y'all playing Fort Valley and Columbus that week or something like that who was it?\nthat you'll have for home for, but yeah.\nSo anyways, but she had me for a little bit,\nbut if I had not gotten down there,\nI wouldn't have seen the thriving campus population,\nthe need for us to do more student housing down there,\nthe curriculums that we need to focus on,\nand I can assure you the governor was helpful in us\ngetting the money for us to do the remodel\non the Hot Tower facility, right?\nbelieves and and so we were I was proud to do that I'm sad to see you go I'll\nbe honest with you but congratulations on on your new venture and I know you'll\ndo very well at Georgia State but had not had or not gone on those trips I\nwouldn't have gotten to see whether marine biology program we had at Savannah\nState University which is something we need to highlight as well as at Fort\nValley, the agricultural curriculum that we have there, which is the reason why I put\nmoney in the budget this year, because we need another vet school in the state of Georgia.\nWe have one veterinarian school here in the state of Georgia, and I, Dr. Jones and I\ntalked about that on my trip there to Fort Valley, and I mean, we went in the meat coolers\nand everything.\nSo we saw the agriculture end from start to finish and I appreciate Dr. Jones and I want\nus to have that money there to put together that study and illustrate that we have a need\nhere in the state of Georgia and we have a good university entity that can fulfill that\nneed and we can go outside.\nI know University of Georgia is only vet school for those of you who don't know, I think\nand Fort Valley would be the perfect place\nto have the second one here in the state of Georgia as well.\nAnd of course, I had my trip to our\nfine private institutions with Clark Atlanta,\nMorehouse, and also Spellman as well.\nAnd we've got money in the budget\nfor the academic center there as well\nbecause I was, I could not believe\nthat in a campus of higher learning,\neducation that there was a lack of broadband and access there in the academic\ncenter and so we're put money in that budget for that and I'm working with\nGeorgia Power for those you don't know and trying to get that implemented sooner\nrather than later. So there are a lot of opportunities. Senator Halferin has\ngot a great mechanism that we passed out of the Senate that well it's a\ncommission that we set up that I plan on putting people who are HBCU graduates\nthat know the HBCU campuses and are proud graduates and people who will be\nadvocates for those for those universities and it is just another\nmechanism we're putting in place that we'll be able to draw down federal\ndollars will be able to take private contributions and it will really help our\nstate entities because not everybody is as unfortunate as Spellman and\nMorehouse that had the large endowments schools like Savannah State, Port\nValley State and Albany State will benefit from from this program but it's\nsomething that will be used for all our HBCUs so I will tell you this we have a\nvery exciting things lasting I'll leave you with and because I need your help\non this tomorrow we have a certificate of need bill that will be on the floor\nAnd in that language, we have Morehouse College, we have Morehouse Medical School, the language\nin there for them to be able to have the ability to take over the Atlanta Medical Center,\nwhich would provide health care and also a training facility for Morehouse medical students.\nSo that's a big deal, that's a big deal.\nThat's language we worked on.\nI'm meeting with the Morehouse Leadership\nright after we get done here.\nBut that is something that is obviously\nwhen that center closed, we lost our trauma,\nyou know, one of only two trauma centers\nthat we had here in the city.\nAnd Atlanta's too big of a town in Metro,\nAtlanta's too big of an area to have just one.\nAnd this mechanism that we're putting in place right now\nwill enable us to do that.\nSo get on your house and send it members, all right?\ny'all get on them, because CON has been something that has been a very difficult state bureaucratic\nsystem that has been hard to break through, but this right here will benefit a lot of\npeople around the state.\nIt's going to benefit a lot of small counties as well, some large counties as well.\nSo thank y'all, thank you for your leadership.\nI know I talked too long.\neach and every one of y'all for your leadership your friendship and y'all know\ny'all have a y'all have an open door with my office and y'all've got a friend\nand lieutenant governor's office so thank y'all very much thank you thank you thank you again\nlieutenant governor as you heard has been really fantastic it really trying to\naddress the needs that have been brought to his office and I think he is\nvery sincere about that open door. I don't think that we could have an HBCU\nheritage day and let it be complete if we don't hear from a student. So I am\ngoing to bring up a student, actually a graduate. I don't know the year that he\nwas a student at Morehouse, but I want to bring up representative Roger Bruce\nwho has served in the House for more years almost than I can count 32 years and has announced\nhis 22 and has announced his retirement so we will not see him back, we will not see\nhis name again on the ballot this year but he has served with great deliberation, thoughtfulness\nand has made a difference and always, always, always has cared about our community.\nSo, Roger Bruce.\nThank you.\nThank you.\nI was not scheduled to be on the program today, so I don't have a prepared speech, but\nI want to thank the Senator for giving me a chance to come up and say thank you for\nthe education that I received at Moorhouse\nand the Atlanta University Center, it's a family,\nyou know, as a student at Moorhouse,\nyou could take classes at any college in the center.\nAnd I think I took classes at every one,\nmostly Spellman, for obvious reasons,\nbut I also served on the board of ITC for 20 years.\nAnd it is truly a family.\nAnd you know, when you leave there, you are prepared.\nThey prepare you for the challenges that you face.\nThey prepared me to be down here\nfor 22 years serving the public.\nAnd I want to talk long,\nbut I do want to share a story if I could.\nI tried to get my son to go to Mo House.\nYou know this story.\nI tried to get my son to go to Mo House.\nHe said, Dad, I don't want to go to my house.\nI said, why not?\nHe said, because I want to have a good time,\nand I don't want everybody calling you,\ntelling you what I'm doing.\nI said, what are you going to be doing\nthat you don't want me to know about?\nHe said, whatever you did, I'm probably going to do that too.\nAnd you didn't want anybody to know about it.\nSo I said, well, where you want to go?\nHe said, I want to go to Hampton.\nI said, fine.\nWe drive up to Hampton.\nI think we want campus 10 minutes.\nAnd this guy walks up, he says,\nRepresentative Bruce, how you doing, man?\nI said, I'm good.\nHe said, I was in your class at Morehouse.\nI said, what are you doing now?\nHe said, I'm the Dean of Students.\nMy son was about to have a heart attack.\nIt is one big family.\nAnd I really appreciate, you know, letting me come up,\nbecause I really want to say thank you\nto all the presidents for the work that you do\nand to let you know, I'm still in office\nuntil the end of this year.\nAnd I'm gonna do everything I can to do whatever I can,\nnow and in the future, to help you guys continue the legacy\nof making sure that our children are prepared\nfor the struggles in this world.\nGod bless you guys.\nThank you so much.\nThank you.\nThank you.\nOkay, well, we are closing out,\nbut I cannot close without,\nbecause this is a celebration.\nSo let me just highlight some of the incredible achievements\nby Georgia's HBCUs.\nDid you know that Fort Valley State\nis the number one university in Georgia for social mobility?\nIt is the number one ranked public HBCU in the state\nand it boasts one of the largest solar farms\non a higher education campus in the entire nation.\nThat is our Fort Valley State University.\nSavannah State University is the number one producer\nof African American Marine Science graduates\nin the country and it is our oldest public HBCU\nat 134 years old.\nAlbany State University is the number one producer\nof nursing associate degrees and registered\nnursing associate degrees in the state of Georgia\nand it is the only HBCU in the state\nwith a dental hygiene program.\nSpellman College is the number one producer\nof black women with PhDs in STEM in the entire country.\nIt is also the number one ranked HBCU in the country\nfor 17 years running and holds the spot\nfor the number ninth most innovative schools in the country.\nClark Atlanta University is the number two ranked\nan oldest school of social work in our state.\nAnd it is the only HBCU in the nation\nwith a cyber physical systems degree.\nSo think cyber security, AI, data analytics, and robotics.\nThat is our Clark Atlanta University.\nMorehouse School of Medicine is the number one medical school\nin the country for fulfilling the social mission\nof medical education and 61% of graduates.\nstay in Georgia upon graduation.\nMore House College, it's the number one producer,\na black men who go on to earn doctorate degrees.\nIt is also the largest men's liberal arts college\nin the country, and it is the only HBCO CU\nin the country dedicated to educating black men,\nor men, but black men.\nPain College is a diverse and thriving campus\nwith students from all 50 states in the country\nand students from around the globe.\nAnd it generates 400 jobs locally and regionally\nand 274 million dollars in lifetime earnings\nfor its graduates.\nThe Interdenominational Theological Center\nwas the first graduate level theological center\nschool to embrace Afrocentric, Hermann Nettics\nas the core of its academic programs.\nand it is the only United Negro College Fund member institution\nthat offers graduate level theological education.\nMorris Brown.\nMorris Brown just recently received its accreditation\nafter 20 years.\nIt is one of the few, is it the only still?\nIt is the only HBCU in the country\nthat has ever lost its accreditation to regain it.\nAnd that has happened under the steady leadership\nof Dr. Kevin James.\nOur schools are thriving.\nThey are well regarded across the nation.\nThey are doing amazing work inside of our own state.\nAnd ultimately, these institutions of higher learning\nare terribly important to the overall ecosystem\nin our state, whether we're talking\nabout economic development, workforce development,\ntheir positions in the communities\nand the access that they have throughout our state.\nIt is worth our time.\nIt is worth our effort to continue to put us a highlight\nand a spotlight on these wonderful institutions.\nAnd I thank you for celebrating with us again this year\nour schools.\nI will recognize Dr. Valerie Montgomery Rice,\nmore house school of medicine who has walked in.\nThank you for being here.\nI want to thank you all for joining again today.\nThis concludes this part of our program.\nWe will be doing a moderated round table conversation.\nDr. Maria Boynton will moderate.\nI believe that I will be talking along with,\nlet's see, who's else that's on the panel.\nAnd are you going to?\nOK, and Urban League is going to be on our panel.\nand Dr. Fedrick is also on our panel.\nThat is gonna be in, oh gosh, 328 CLOB.\nSo we'll go back across the street there,\nback to the club, but that's in 328.\nPlease join us if you can for that conversation.\nThank you again, please continue to be the folks\nthat always highlighting and always championing our HBCUs.\nAnd like you've heard, there is a piece of legislation\nthat is making its way through the legislature.\nIt is in the House.\nI was hoping it was gonna be heard today,\nbut our time got pushed back.\nSo it will be heard in the House on Monday.\nAnd anything you can do to make sure\nthat people know how important it is,\nthat we invest in the schools,\nbut also in the communities in which they sit.\nWe strengthen the communities, we'll strengthen the schools.\nSo thank you very much for joining us.\nI appreciate you being here.\nUntil next year, but don't be a stranger.\nThank you.\nThank you very much.\n",
  "updated_at": "2026-02-12T19:22:11.059865+00:00"
}