{
  "video_id": "SX72y47ud5M",
  "url": "https://www.youtube.com/watch?v=SX72y47ud5M",
  "title": "Rules PM meeting for Day 27 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a summary of the key points from the Georgia Rules PM meeting transcript for Day 27 of the 2025 Session:\n\n**Overview:** The meeting focused on discussing and passing a rules substitute for House Bill 268, a school safety bill, as well as reviewing a room substitute for House Bill 651 regarding school zone cameras.\n\n**Key Actions:**\n- **House Bill 268:** A rules substitute was passed, which adds provisions for generating reports on de-identified student records and coordinating mental health services and threat assessment teams in schools.\n- **House Bill 651:** A room substitute was presented, which addresses signage, speed detection, citation amounts, and other aspects of school zone cameras.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- Discussions around the mental health coordinator positions in HB 268 and how they would be implemented based on school district size.\n- Clarification that the mental health coordinators would have a different focus from existing school counselors.\n- Debate around the 35% rule for revenue generation from school zone cameras in HB 651.\n\n**Votes:**\n- HB 268 rules substitute was passed out of the committee.\n- No recorded votes on other bills.\n\n**Attendance:** Quorum was present, as the meeting was able to proceed.\n\n**Adjournment:** The meeting adjourned, with no specific mention of the next session date.",
  "transcript": "Good afternoon everybody. Appreciate your patience. Before we get started, I wanted to share a couple of numbers with you. I thought it might be of interest. It was to me.\nThere's somewhere north of 167 bills in rules right now. And by tomorrow, I suspect after a committee meeting, it'll be closer to 180.\nSo I guess I'm telling you that to tell you that we're probably just not going to get to everything\nWe'll do the best we can\nso\nWe've got a couple bills. We want to consider today\nHouse bill 268 which is a rules substitute\nTo rule to house bill 268. It's LC\n49\n2328 s and chairman Irwin is going to explain that for us\nThank you, Mr. Chairman and members, just to look at the change for you here, by the\nway, we're getting quite good at changes.\nReally what this change is, it generates reports of de-identifiable S3 records desegregated\nby grade age, race, sex, ethnicity, language, learning status, and direct certification of\nincome status.\nThat was the change that we included in the bill, and that it would be the substitute,\nMr. Chairman.\nOkay. You all should have a copy of that LC492328S. Do you have any questions for the author?\nHave a couple of questions, Mr. Evans.\nThank you, Mr. Chairman.\nHas this been presented in rules before it got sent back?\nYou hear the question.\nWhere's it air to go?\nI just can't remember.\nI apologize.\nHave we heard this bill here yet?\nThe session in rules?\nIn rules?\nYes.\nNo.\nI have not.\nIt's a 60-something page.\nIt's obviously not chapter and verse.\nbut generally speaking, does it do any?\nCould you give us a little bit of an idea of what it does?\nBasically, what you're looking at here is a school safety bill.\nThroughout the pages, it begins with mental health\nand supply and school systems with a number of mental health\nbased on their school population size coordinators.\nAnd those coordinators are going to come in to connect services\nfor children that are in crisis.\nAnother ability this bill provides is linking together our response agencies and our educational\nsystems so that we can communicate about children.\nWe also develop a BTAM team, which is a threat assessment team that is able to be at each\nschool to look and have tiered threat assessments so we can respond to those threat assessments.\nSo it is coordinating all those agencies not only by communication but building teams,\nbuilding plans, trying to secure the environments within the school and giving us the ability\nto be preventative by working with the mental health of the students that are in crisis\nand getting them to the services they need before they transition into a desire to hurt themselves\nor hurt somebody. So that encompasses the biggest part of the bill.\nThey have another question, Lou Hewley.\nThank you, Mr. Chairman. That was my concern and I didn't think we had heard this in rules.\nspeaking to the mental health coordinators, are they based on some type of\nRoy show of students or what is the basis for them? Great question. We did that\nbased on we started with 18,000 students unless get one coordinator for that\nsystem and then there's another tiered system from 18 to and I would need to look\nback through, I believe it was into the 30,000's get two and above 30 something\nthousand will get three of the mental health coordinators. You know this is a\nvery important part of this bill I will tell you so that we can work with\nthese students as I said to keep them from transitioning into violence or\nhurting themselves. So those coordinators will then be able to work with\nsystems and train the teachers, train administrators to know how to look for these students that are in crisis and then how to connect them to those services.\nOne other question if I may, Mr. Chair. So these middle half coordinators, they are a level on top of school counselors. Is that what we're looking at?\nI won't say on top of school counselors, we have counselors today in schools called guidance counselors and then there for guidance\nWe are now supplying a\nPerson or a position in there that is going to be dedicated to the behavioral help of a child\nIt's a more of that mental end and that mental end in training. I can see school systems\nPutting the same counselors in the counseling office with a different focus on how to assist the kids rather than guide the kids\nthrough their education program.\nOkay, you don't see any other questions.\nI'll entertain a motion to do pass.\nHave a motion and second to do pass.\nAny other discussion? Any opposition?\nIt passes out.\nThanks, sir. Thank you.\nOkay, we have another bill.\nHouse bill 651.\nHave a room substitute to that chairman Powell.\nIt's LC 39, 47, 29, yes.\nThank you, Mr. Chairman.\nYou know, this is an interesting piece of legislation\nthat deals with these school zone cameras.\nAnd I then asked to produce a product\nthat would be workable in fire\nbecause it looks issues involved in it and the contention.\nBut if you look at this bill, start on section two,\nthis starts with a signage, and we're moving from just\nthe flashing signs to flashing sign with a speed detector\non that sign, which would depict the speed of the vehicle\nas they're entering a school zone.\nSo these are signs that would tell that person\ndriving the vehicle that they may be exceeding the speed limit. Section 4, this\ndeals with the muddable presumption. This deals with 35% rule. This has been\nrecently added in the last hour or so at the request of some of the members.\nThis is that rule that we had did on radar and speed traps a few years ago.\nIt said that the local governments, if they raise more than 35 percent of their working\ncapital off of these types of devices, then they're going to penalize.\nSection 5 is something that I really considered that was put aside by the other laws of the\nstate.\nThis is a 10 mile an hour over, through the state of Georgia.\nWe've always said that the only people who can give you a citation as a Georgia State\ncontrol unless you're with exact speeding violation. This gives you 9 miles an hour. So you\nbasically have to be 10 miles an hour over. So in those school zones where it says 20 is actually\ngoing to be 30 miles per hour. That adds a 10 mile an hour to that. So it puts everything\nuniform statewide on that. It's a top of page 5. A and B gives a definitive hour, a definitive\ntime these cameras can be used two hours in a morning to an afternoon, an hour before\nschool starts and an hour after they take in and say for the afternoon, an hour before\nan hour after, very specific. On line 101, this deals with four lanes. There have been\nsome questions asked about some jurisdictions running these on the four lanes. This puts\nis under DOT approval to define the four lanes, if that's so.\nYou get down to page line 111.\nThe citations would be $75 for the first violation\nand $125 for the second.\nAnd it strikes the $25 admin fee that is current law.\nPage 6.\nIf you look at that language, this is an attention to the, to the, you know, when it gets a citation, it defines the legitimate agency that sending it just basically says they have to send it in the envelope, first class envelope, which prominently displays the name and the seal in the local governing body.\nIt is issued in that citation.\nType of Phase 7 on line 145.\nThis is a notice of rights to say that you have in large letters.\nIt says you have right contest liability by contacting your local court.\nAnd then you get the page and I and somewhere around\ntwo twelve and it carries over into about two thirty-six. This is a section that\nis somewhat was put in. It said that if you get a citation and for whatever\nreason you don't pay it or it's still out there, then it would be reported to\nthe Department of Revenue that it would stick to your title, your car, and you\ncouldn't sell that car. We struck that language. So we've now done away with that\npart of the current law and then I think most importantly what we've done is\nif you look starting on line 241 this gives a description of school safety\npurposes and what we've done is we have cut the money in half that 50% of the\nfines would be retained by the local jurisdiction to pay for the\nadministration and whatever they want to do with that but the other 50% would be\ngiven to the local school systems in that jurisdiction.\nSo the ceases to become a, there's a lot of people said, a revenue driven device, local\ngovernments.\nAnd that Mr. Chairman and speakers, that's what, members, that's what it does, they glad\nto stumble through any questions you might have.\nOkay, I've got a couple of questions for you.\nChairman Stevens has a question.\nThank you, Mr. Chairman, I'm just looking through the bill since I've just seen it show me in the bill where it whenever you have a clear defective camera that there's a provision in here that requires them to remove it and replace one that's working.\nWell, I do not know where that would be unless it's under the current code which I don't think it is.\nThat's up to the local jurisdictions about clean the cameras and such as that I mean, it's got a quickly show\nThat that's your tag number's got to read it\nAnd also they'd remembered it in the original current law and the original law\nThe local jurisdictions the local law enforcement agencies. They're supposed to review these tickets\nNow, I don't know how many of Max's do that\nI know that we've all heard the stories\nthat people's had to vehicle on the back of a tow truck and they picked up the tag and\nI was sure that law enforcement officer, that's true the law enforcement officer would\nhave could have taken a scene that so that's still up to the local law and if they don't\nhave a clean camera or the lens of the camera where they can't show anything and you can\nalways just another right to contest it in the court if you want to do that.\nin a follow-up.\nJust one more, that situation where enough got enough retired administrator of the school\nsystem, which a boy to school drops 30 minutes out of the way, we've got a two-lane highway.\nShe's looking at four tickets on her table where she does 17 miles per hour.\nThe camera picks up her car along with the speeding car beside her and sends her a ticket.\nis not unusual. Okay, Jim Lenson. Yes, just wondering if you could direct me. One of the main\ncomplaints that we've had is camera running all day long. Is there specific language\nI'm looking at? I just want to make sure I'm interpreting it correctly, 91 and 92. That\nJust limits it to two hours in the morning around the time that they arrive in two hours in the afternoon at the time\nThey depart. It's not running all day long. Is that my understanding of what this is exactly right? This clearly defines at the time. No time during the day. None of this at night time events or\nAthletics after hours. This is two hours of the morning two hours in the afternoon around the time the school takes in and lets out. Follow up in\nAnd the lights have to be activated or operating at the time during these time periods.\nThat is so, and that's the law right now.\nWell, when it's running all day long, that's not the case, so that's okay.\nOnly while the lights are flashing lights are out there.\nI think the digeristicians will probably, when they see this bill, it's going to probably\nget their attention a little bit more diligent about how they're using these devices.\nAll right.\nThank you.\nLiterally.\nThank you, Mr. Chairman.\nTo the author of the bill, how did you all come up with this 5050 arrangement and are\nthere restrictions on what each party of this 5050 arrangement can spend their money\non?\nWe looked at some of the numbers. It had been reported and there was an extravagant amount of money\nIt was being raised off of these by a lot of small jurisdictions\nAnd you know the old adage around here, whether you believe it or not follow the money\nBecause always part of the rule that creates a lot of a lot of issues\nThe good intended things and by cutting half of that money\ninstead of the jurisdiction getting\n65, 70, 75% of the money, they'll get 50%, but what they'll have to do in that 50%\nthey're also going to have to pay for the cameras around them or buy themselves or subscribe\nto them or whatever they do with these things.\nSo that's going to probably take a size for a mile of the money that goes to those local\ngovernments.\nbasically drive them back into the realm that these are supposed to be tools for safety and\nskills.\nRep.\nHope you have a question.\nI do.\nThank you, Mr. Chairman.\nChairman Powell.\nI'm curious as to the legislative intent of the phrasing demonstration of prior history\nin line 102.\nDo you mean demonstrated history of speeding during school hours, demonstrated history of accidents?\nWhat's what is it that you're driving out there? What's your line number 102?\nThere's a clause that says for the four lanes. It says to have a camera\nMy understanding is which may go back through with a question from Chairman Stavins about four lanes\nBut my understanding is that this is a term that DOT would use the approval about where what lanes or what they can run them on\nIt was like radar and that would do with four lanes.\nIf a school was on a four-lane, they might not have purpose to have it.\nIt would be a restriction to them to run in these on a four-lane road.\nI think my question, if I could do a quick follow-up, is what would we expect people to show\nthrough that demonstration of prior history in order to satisfy that?\nI think the word is a prior history is what DOT would, how they would make their rules\non these four on these of highways more than a two-lane.\nThey would look at the, I guess they would look at whatever the traffic and safety standards\nand all that and what these would need it on four-lane roads.\nOkay, thank you.\nOkay, Chair Lee, Taylor, do you have a question?\nThank you, Mr. Chairman.\nto the author. I do have a couple questions. I have one of the schools that is two lanes one way, two lanes the other way.\nWe have a football stadium there, tennis courts, and will those apply throughout the day? I thought I had read before that when you have it with different sides of the highway, it would apply all day.\nI didn't see that in this bill, you know.\nVery specifically, this classifies this.\nIt's two hours in the morning, two hours in the afternoon.\nI don't think it gets any more clear than that.\nAnd then the language that the previous representative\nhad asked that the DOT would have control over deciding these four lives.\nCould I follow up?\nThere's no indication about how much money is actually going\nto the company that they are leasing these systems from. So if it's a $75 fine, some portion\nof it will first go to that company and then the rest of it will be split 50-50.\nI understand that there's four companies that either provide lease or whatever proper\ntime is. I've even heard that some of these jurisdictions are looking at buying their own\ncameras, which is quite a scary thought, mate, but the 50% rule, 50% of $125 is $67.50.\nThat means that that local jurisdiction would have to negotiate with a company if they\nwant to be the company to send out the warnings they could do.\nIf they want to put up their own signs, I mean, this is just the dollar bills around what\nwhat it has operates, so that it comes down to who they want to negotiate, they can negotiate.\nAre they can buy their own cameras?\nThank you.\nJim Leaves.\nThank you, Mr. Chairman.\nChairman, thank you so much for your hard work on this bill.\nWe've got to get guardrails when you're doing a great job of kind of leading the effort.\nBut on the line of 145 and 146, it says that whomever is getting the citation would\ninclude the language you have a right to contest liability by contacting your local court.\nI know that some people, between people traveling through our state get these love notices\nand people, such as we, from all over Georgia, and we get one in South Georgia, and we\ntalking about the local court where I live and my car is titled or we talking about the local\ncourt where the incident happened. I'm sure that remains the local court where the incident happened.\nMy understanding is that a lot of people here could test these together with local courts.\nI understand that a lot of them are just immediately tossed out.\nFurther question, if it could be our local court that I wouldn't have to go all the way down to\nthe McIntyre County is beautiful, is that county is,\nand people have some kind of process of appeal\nto my local magic court that would be nice.\nThank you for the bill.\nOkay, Chairman Martin, do you have a question?\nYes, sir, if gentlemen, on lines 25 through 27 of the bill,\nwhen you're redefining skills on an existing master state\norder or local ordinance, if those two are in conflict,\nWhich would it be the most restrictive or would one prevail?\nMy understanding from legislative council, the master state order would be the DOT or whoever is setting\nthat schools on or the local ordinance.\nAnd I would suspect that it would be the locals that would have that prerogative to establish\ntheir schools on.\nIf you look down through the bill, it says, really specifically where they have to put these signage up flashing signs and all of that\nBrief offices, so if this passes there would be\nWe'll get that state will\nForm one in order for it to give the locals time to update there\nBecause when this comes effective they'll then have to hold\nEarrings to set that ordinance, so that would be how that would work\nthe state will have one prepared so that we just all said we'll not have school zones anymore for a while though right you know there's not on state highway I think the locals would establish that the boundaries of the schools on what I think and this master state all over the state highway.\nThank you Mr. Chairman, Chairman Powell reminded me of something the moment ago that some members\nhave a question about some of these cameras and run by some cities especially do registration\ntickets.\nAnd this bill does it clarify that they cannot do anything but speed?\nMy understanding that's the current law that's all they've ever been able to do is to speed them.\nRemember, this is a civil. If they use a counter, that's a civil counter. It's not a credit citation for sale.\nWell, I wish this moves through. If you could make, let's try to find a line in here that moves through that clarifies it.\nYou know, use it for anything but to speed.\nWell, you know, this bill, if this bill passes the house by this body, there will also be a second bill to be a consideration I understand.\nLast year, I would be remiss if I didn't remind the members that last year the chairman of the public safety represented Collins.\npassed a couple of these bills over and they got basically stymied over in the city.\nThey had no appetite for it.\nI understand through a rumor and this is only rumor that they had no appetite to ban these cameras.\nSo this would be if these two bills do come up today,\nand if this body passes both bills and they both go over to really give the senator something to think about.\nOkay, if you have any Cooper, do you have a question?\nI do think Mr. Chairman, what do you mean nothing else?\nThat they can't be charged...\nI mean, what if they're drunk driving or, you know,\nare you saying that they can't be charged with it or I'm misunderstanding?\nNothing else. These schools on campus can only be used\nto detect speeders and the schools on.\nOkay. There's no other, there's no other citations\nin this as a civil citation.\nWell, okay, they couldn't offer citation, but if the police men saw them doing it\nThis has this does not stop a police officer if a police officer sees a\nDriver is violating some other law or even the speeding law. Okay. Thank you. I didn't stop them from having a police officer\nOkay, okay, you don't see any other questions\nDo I hear a motion and a motion passed in a second in the opposition?\nI tell you this, these two chairman have worked very hard on these two pieces of legislation.\nThey have tried to take a lot of input.\nI know from various folks who have come to them, you know, I think I'm Chairman Erwin and\nChairman Powell for your hard work on these two pieces of legislation.\nOkay, what we're going to do now is set a supplemental calendar for today.\nHouse bill 175.\nHave a motion in a second.\nAny opposition?\nIt's on.\nIt's under modified structure.\nHouse bill 179.\nMan.\nSecond.\nAny opposition?\nIt's on.\nHouse bill 200.\nMan.\nSecond.\nAny opposition?\nIt's on.\nHouse bill 219.\nMan.\nSecond.\nany opposition, it's on.\nHouse bill 225, in the opposition, it's on.\nHouse bill 235, moving second in the opposition, it's on.\nHouse bill 238, okay, in the opposition, it's on.\nHouse bill 268, room substitute, LC 49, 23, 28, yes.\nMove the second in, in the opposition, it's on.\nHouse bill 322, in the opposition, it's on.\nHouse bill 339, in the opposition, it's on.\nI spilled 340 in the opposition, it's\nspilled 369 in the opposition, it's\nI spilled 426 in the opposition, it's\nI spilled 432 in the opposition, it's\nI'll spill 443 in the opposition. It's on. I'll spill 449 in the opposition. It's on. I'll\n255 in the opposition it's on that's built 515 and the opposition is on that's\nbuilt 516 in the opposition its on that's built 551 in the opposition it's on that's\nbill five sixty nine in the opposition it's on us bill five sixty-three in the\nopposition it's up on us bill five seventy-five in the opposition it's on\nHouse bill 584 in the opposition it's on House bill 651 room substitute LC 39\n47 29 s in the opposition it's on understructured\nHouse bill 297. Any opposition? It's on. House bill 463. Any opposition? It's on. Thank you very much.\n",
  "updated_at": "2026-02-12T18:27:18.659828+00:00"
}