{
  "video_id": "Sz7aYSBswSo",
  "url": "https://www.youtube.com/watch?v=Sz7aYSBswSo",
  "title": "Legislative Day 2 | 2024 Session | 1/9/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": 2,
  "video_date": null,
  "duration_minutes": 45,
  "summary": "Overview:\n- The Georgia Senate session included routine procedures like roll call, introduction of bills and resolutions, and morning devotion. No substantive legislation or notable moments were detected in the transcript provided.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\n- **SB 333**: To incorporate the City of Mulberry\n- **SB 334**: To amend code related to minimum insurance and labor\n- **SB 335**: To amend code related to incest \n- **SB 336**: To amend code related to regulated industries\n- **SB 337**: To amend code related to personal aid\n- **SB 338**: To amend an act providing for state and local government\n- **SR 432**: A Senate resolution\n- **SR 433**: A Senate resolution\n\nNotable Moments:\n- The Senate President recognized the Rules Committee Chairman.\n- The Senate President wished Senator Linda Brass a happy birthday.\n- Rabbi Elizabeth Bajar delivered the morning devotion, discussing leaving \"baggage\" behind and drawing lessons from Jewish history in Georgia.\n\nVotes:\nNone detected.\n\nAttendance: \n- Several senators were excused from the roll call.\n- No quorum issues noted.\n\nAdjournment:\nThe transcript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning everyone, good morning, good morning, good morning.\nThe Senate will come to order at this time I will ask all unauthorized personnel to exit\nthe chamber.\nI recognize the Distinguished Rules Chairman with his brand new suit, Senator from 28th.\nI told you that suit took words away from a mouth, you know?\nSenator, once you come to the front here and while they're working on the individual\nmicrophone and so here are we all Mr. President I'm convinced you just wanted to get me down\nhere so you could take it all in but good morning so we don't have any pages today apparently\nI didn't have a page list that breaks my heart but it is a rainy day so it's probably better\nthat they stay at home and stay in school but today you know yesterday we had a\ngreat birthday a great American had a birthday January 8th the King another\ngreat American birthday today my mama Linda brass happy birthday mama\njournal's been read and found to be correct you want me to stay here so you\njust keep looking good senator we've got you sure are you sure\nyou are welcome to yield the well. Thank you Senator. Is there objection to\ndispensing of the reading of the journal? Chair here is none. The reading of the\njournal is dispensed with. Is there objection to the confirmation of the\njournal? Chair here is none. The journal is confirmed. All senators who have\nbills and resolutions to introduce please bring them to the secretary's desk at\nthis time. First reading and references to Senate bills and resolutions.\nThanks.\nTake turn.\nSenate Bill 333 by Senator Dixon of the 45th and others, a Bill to be in town and act\nto incorporate the City of Mulberry to the 5th.\nState and local government.\nSenate Bill 334 by Senator Albers of the 56th and others, a Bill to be in town and act\nto amend Code Section 253, 23 of the OCEGA relating to minimum-\nInsurance and Labor.\nSenate Bill 335 by Senator Albers of the 56th and others, a Bill to be in town and act\nto amend Code Section 166, 22 of the OCEGA relating to incest so as to expressly include-\nDo you disagree?\nSenate Bill 336, by Senator Capacic of the 32nd and others,\na Bill to be in town and act to amend Article 1 of Chapter 2 of Title 37 of the year.\nRegulated in industries.\nSenate Bill 337, by Senator Capacic of the 32nd and others,\na Bill to be in town and act to amend Code Section 38 to 111 of the UCGA,\nrelating to personal aid.\nGo ahead and have a recite.\nSenate Bill 338, by Senator Seltzer of the 37th and others,\na Bill to be in town and act to amend and act, providing for the.\nState and local government, general.\nSenate resolution 432 by Senator James O'Leary, 35th and others.\nA resolution or two.\nRules.\nSenate resolution 433 by Senator Ginn of the 47th and others.\nRules.\nThat completes the order, Mr. President.\nIt is now time for the morning roll call.\nAre there any motions to excuse?\nSenator from the 33rd.\nThe senator has asked that the senator is from the 38th, the 36th, the 35th, and the 43rd\nwithout objection, they are excused.\nRecognize the senator from the second.\nI can hear you.\nThe senator has asked that the senator from the 14th be excused,\nwithout objection, the senator is excused.\nSenator from 30-30 again, you got your line on again or you're on, okay, waving on.\nSenator from the 7th, I think we have a malfunction here, but in any other excuse, any one night\nyou see is okay.\nIf there is no other motion to excuse, secretary will call the roll of senators, signify your\nPresident's by voting the A-switch secretary on lock machines.\nYou\nIt is now time for the morning devotion. All senators, please take your seats and\ncease all audible conversation. Dorkies, please secure the chamber at this time.\nI'd like to recognize our pro-team, the senator from the 18th to introduce our\nChaplain of the Day. Senator?\nGood morning, everyone, and welcome. Thank you, Mr. President. Let's first begin with\na pleasure of allegiance to our flag.\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands\none nation under God, indivisible,\nwith liberty and justice for all.\nAnd now to our Georgia flag.\nPleasure allegiance to the Georgia flag,\nto the principles for which it stands.\nWisdom, justice, and moderation are perfect.\nWell, good morning colleagues, again.\nAnd thank you, Mr. President.\nIt is my honor today to introduce, as our chaplain of the day,\nRabbi Elizabeth Bajar.\nOn June 1st of 2020, Rabbi Elizabeth Bajar joined\nTemple Beth Israel in Macon.\nRabbi Bajar earned her BA in philosophy at Brandeis University.\nRabbi Bajar was ordained in 2009 by Hebrew Union College,\nJewish Institute of Religion, where she also earned her master of arts and Hebrew letters.\nPrior to joining Temple Beth Israel in Macon, she served the congregation in Jacksonville,\nFlorida.\nBefore that, she served as a spiritual leader, a Temple Benaze, Shalom, and Huntsville\nAlabama.\nThe values and traditions she cherishes and her commitment to fostering the closest relationship\npossible between the congregation and clergy are central to her new role at Temple Beth Israel\nin Macon. Her commitment to community and learning extends her roles as she is a published\nauthor. She's also a board member of various Macon organizations, including the Interfaith\nTapestry, Leadership Macon, Mercer University and Mercer's Marriage and Family Therapy\nProgram. Rabbi Bihar's multifaceted career reflects her dedication to faith, education,\nas you have seen community service.\nShe is joined today by her daughter,\nAiden, who is with us.\nAnd colleagues, please join me in welcoming Rabbi Baha'u Lizbeth\nBaha'u this morning.\nThank you.\nI'm sure some of you saw several weeks ago\nin the news reports about an airplane in Japan\nthat had a horrific incident.\nOf course, I clicked the bait and realized\nthat it wasn't just an incident, it was a miracle.\n379 passengers survived that fiery crash.\nA miracle in and of itself that so many of them,\nthe entire flight survived.\nAn investigators went on to determine\nwhy did those people come out alive?\nIt was discovered that not only did they have a perfect exit,\nbut they all left their baggage behind.\nAnd the truth is that there are various times in our lives\nwhen we do need to do that.\nWe need to leave our baggage behind.\nToday we live in an era of so much divisiveness\nwhere there is polarization and xenophobia.\nReminds me of a time period just a few centuries ago\nin 587 BCE when the temple was destroyed\nbecause of so much contention.\nFrom those very seminal events time period\nin which altered the Israelite experience,\nthe community had to face the realities\nof the loss of an old world, a king, and a temple,\nand it did so using the support of its prophets,\nthe prophets Jeremiah, Ezekiel, and Second Isaiah.\nIt was the weeping prophet Jeremiah\nwho articulated that newness comes out of grief.\nIt was the priest, prophet Ezekiel,\nwho emphasized holiness becomes the grounds\nfrom which hope is sprouted.\nAnd it was Second Isaiah who practiced the value\nof memory, articulating new possibilities.\nMemory, of course, asserts against the amnesia for which nothing is noticed, critique, and\nat times even subsequently, absolutized.\nAnd is that lesson that I think brings us to a question, what type of baggage do we\nneed to learn from?\nWhat type of baggage do we need to subsequently let go of?\nAs a Jewish rabbi, I carried the baggage of my people's experience.\nIn understanding Jewish history in the state of Georgia, this includes Jews who had\namazing profound impacts on this very state. Her instance, when the state was being\nfounded under General James Oglethorpe in 1733, there was an epidemic that was\nthreatening the colony's very existence. Two ships came, carrying 90 Jewish\nindividuals aboard which was a physician, Dr. Nunes, who became the\ncolony's only physician, STEM, the epidemic,\nsaving Georgia.\nThe group went on to establish the very first synagogue,\nMcFa' Israel in 1735.\nWe see other Jews who came up and sprouted up\nand supported this state, including David and Manuel,\nwho was the very first Jewish governor\nin the entire United States and was a governor\nin this state after serving as the Senate president.\nAnd I doubt this very chamber, but chamber similar to this.\nThe county manual, by the way, is named after him.\nThere are many other Jews who were important and influential\nin this state, supporting the state's economic background\nand backbone, creating stores and businesses\nand going on to support the foundation of libraries\nin a variety of institutions, but just as much\npart of the state of those Jews who went on to support and enrich it was also part of\nour history which is sad. Those anti-Semitic moments which is an unfortunate memory. During\nthe Civil War Jews were temporarily banned from Thomasville. It was under the influence\nof the KKK in the early 20th century surrounding Leo Frank which eventually led to his lynching.\nAnd lastly, the infamous bombing in 1958 of the temple,\nand even this summer, when outside of my congregation,\nsome neo-Nazis march and committed some horrendous acts.\nYet I will say that even amongst all of that,\nthe support that my community has experienced\nfrom the state is invaluable.\nI reminded of Maya Angelou who taught,\nwithout courage we cannot practice any other virtue\nwith consistency.\nWe cannot be kind, true, merciful, generous, or honest.\nIt takes courage to be able to self-reflect\nand see the baggage that we have around us.\nAsk us and ask ourselves, is it limiting us,\nis it preventing us from going forward?\nOr is it helping us?\nIs it something that we can actually learn from?\nAnd it takes courage, and I'm not speaking\nabout the type of courage that Atlanta's very own\nDr. Martin Luther King.\nIt takes small acts to lead us toward a more united,\nmore whole experience.\nWhen today, that is so much of what is needed.\nAnd it's not the courage that requires us\nto put our lives at risk.\nNor does it demand that we walk into the water first,\nand I'm referring to a very ancient story.\nRather, the rabbis teach us not to rely necessarily\non miracles in the present world.\nWe're taught that God walks with us.\nAnd so I ask us to have courage as we go forward.\nPlease rise.\nWe pray for the power of your spirit\nto transform us into vessels of grace and compassion,\nrestore our fractured lives so that we with one voice\nmay give you ever thanks and praise.\nAs we come into this legislative session\nas leaders in this great state of Georgia,\nmay our deeds reveal a holiness among and around us.\nMay the doors of this legislative body\nbe wide enough to receive and hear the voices\nof all who hunger for love and who are lonely for friendship.\nMay it welcome all who have cares when burdened,\nthanks to express hopes to nurture.\nMay the door be narrow enough to shut out\npettiness in pride, envy, and enmity,\nand may its threshold be no stumbling block\nto young or shrink feet.\nMay it be too high to admit complacency,\nselfishness, and harshness, and may you,\nas leaders of this great state of Georgia,\nbe inspired to help the entire state\nlead a more rich and meaningful life.\nThank you, and Amen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nI'd like to call on the senator from the six to introduce our doctor today is always\na pleasure.\nObviously, we like to recognize these physicians who come down here and volunteer their time.\nand services to come to come, you know, visit us and the people here in this\ncapital. We greatly appreciate it. And I recognize a good senator from Buckhead.\nGood morning colleagues. It is my pleasure to introduce this morning Dr. McClellan,\nwho is an Atlanta native and a 1997 graduate\nof the Westminster schools right here in Senate District 6.\nHe earned his BA in history from Princeton University in 2001.\nAnd while that Princeton, he played a number of sports.\nHe returned to Atlanta after Houston at Princeton\nto get his MD degree from Emory University School of Medicine in 2005.\nwhere he was honored with the Joseph Whitehead Surgery Scholarship. He\nremained at Emory to complete his orthopedic residency training. And then after\nthat he completed a prestigious fellowship in hand upper extremity and\nmicrovascular surgery at the Curtis National Hand Center in Baltimore, Maryland,\nand then also pursued a fellowship in shoulder and elbow surgery in niece\nFrance. He has spoken publicly and lectured both nationally and internationally\nand continues to participate actively in orthopedic research. Please join me in\nwelcoming Dr. McClellan.\nThank y'all very much for having me, Mr. President, Senator Estevez. I appreciate that\nnice invitation. It's a good day to be inside making laws instead of outside in\nin the weather.\nBut on a personal level, I just want to thank all of you\nand the commitment you've made to the state of Georgia.\nMy grandfather was actually in the state\nlegislature here in Georgia on a house side\nfor a dozen years back in the 50s and 60s J. Ralph McClellan.\nSo our family has an appreciation for what you do.\nAnd then from a physician side, I just\nwant to encourage all of you, as you\nmake your policy decisions and discuss things\nover the next several weeks, to think about what we can do\nto take good care of the patients of Georgia, what we can do to recruit the best and brightest\nphysicians and maintain the best and brightest physicians within our state.\nSo thank you all for the commitment you've made and thank you for having me today and\nif I can help you I'll be in the infirmary all day.\nAll right, thank you.\nAre there any unanimous concerns?\nDoes any senator wish rise on a point of personal privilege?\nNow just give you a little update here.\nWe are having technical difficulties with the mics at your desk.\nWe do have Alexandria here who has a mobile mic if any of you would like to speak from\nyour desk, so that will be made available to you, but I recognize Senator from a second\nfor a point of personal privilege.\nThank you, Mr. President.\nThis morning, colleagues, I rise to wish the men a Phi Beta Sigma fraternity Incorporated,\nwhich is my fraternity.\nHappy Founder's Day.\nThis is our 110th Founder's Day, a Phi Beta Sigma fraternity Incorporated, and today\nas we celebrate our rich legacy of brotherhood, scholarship, and service, we stand united\nunder our guiding principle of cultural for service and service for humanity.\nThis year we focus on the power of our vote, emphasizing our role in civic engagement and\ndemocratic participation and our collective voice is crucial in shaping our\ncommunities and the future. So today, I rise to honor our past, commit to the\npresent, and look forward to a future where our fraternity continues to lead and\ninspire some behalf of the men of Phi Beta Sigma fraternity and corporate. If\nyou know a Sigma, just text them and say happy-founders day. With that, Mr.\nPresident, I yield the well. Thank you, Senator. Does any other Senator which\nrise on a point of personal privilege all right you have before you a consent\ncalendar of privileged resolutions does any senator wish to remove a\nresolution from the consent calendar is there objection to the adoption of\nthe resolution on the consent calendar chair here's none the resolution of\nthose consent calendar are adopted\nOh, are there any motions to withdraw or commit?\nYou want anything?\nGreg and I as the senator from the 51st, Majority Leader.\nCome on down here to the roster.\nCome to the whale here.\nGood morning, Mr. President.\nThank you.\nDay two is over.\nMoving on to better and bigger things.\nSo, Mr. President, I move that the Senate stand adjourned until 2 p.m. on Wednesday, January\nthe 10th.\nThe majority leader has moved, Secretary Reed the announcements.\nRegulated Industries and Utilities Committee meets at 4 o'clock p.m. today in room 450.\nThat completes the order, Mr. President.\nAll right, the majority leader has moved that we stand adjourned until 2 p.m. tomorrow.\nAll those in favor of the motion will signify by saying aye.\nAll those opposed, no.\nLooks like the eyes clearly have it.\nWe're adjourned.\nYou\n",
  "updated_at": "2026-02-12T20:00:51.234749+00:00"
}