{
  "video_id": "T15i597Ihv0",
  "url": "https://www.youtube.com/watch?v=T15i597Ihv0",
  "title": "10/5/2023 Sen. John Albers and Sen. Randy Robertson Press Conference",
  "chamber": null,
  "session_type": "press",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Here is a structured markdown summary of the Georgia 10/5/2023 Sen. John Albers and Sen. Randy Robertson Press Conference session:\n\n## Overview\nThe Georgia Senate is taking a proactive approach to investigating and addressing the ongoing issues at the Fulton County Jail, including concerns over rising crime, court backlogs, and inmate deaths. A special Senate subcommittee has been formed to conduct a deep dive investigation into the root causes and solutions.\n\n## Key Actions\nNo specific bills were mentioned.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Lt. Governor Bert Jones expressed concerns over the rising crime, court backlogs, and inmate deaths in Fulton County, stating the Senate wants to help find solutions.\n- Sen. John Albers clarified the distinction between jails and prisons, and emphasized the need to ensure justice is served in a timely manner.\n- Sen. Randy Robertson, a retired major from the Muscogee County Sheriff's Office, was appointed to chair the subcommittee investigation due to his extensive experience working in and leading a large jail.\n\n## Votes\nNo votes were mentioned.\n\n## Attendance\nA quorum was present, including Senate leadership and members of the Fulton County delegation.\n\n## Adjournment\nThe press conference concluded, with the first subcommittee meeting scheduled for November 2nd.",
  "transcript": "Thank you for joining us for this important press conference.\nMy name is Senator John Albers, I represent the 56th Senate District and serve as a Senate\nChairman of Public Safety.\nWe have all watched with great concern the tragedy that continues to unfold at the Fulton\nCounty Jail.\nThe Georgia Senate is listening and taking a head-on approach to investigating and helping\nto solve this crisis.\nOur senators, including myself, have been directly contacted by many individuals, including\nthose who have lost loved ones in the jail.\nI want to welcome and thank all the senators in attendance today, including our majority,\nchairman, caucus chairman, senator Jason Anivatarte, our majority leader, Steve Gouche, senators\nDixon, Hodges, as well as Harbin.\nWe also have with us Senator Randy Robertson who I'll talk and introduce later.\nAnd I'm proud at this time to introduce our Lieutenant Governor.\nLieutenant Governor Bert Jones has a very long history before joining as a member of the\nSenate and then becoming our Lieutenant Governor, retacking some of our greatest issues here\nin the state and supporting our criminal justice and law enforcement systems.\nThis time we welcome up our Lieutenant Governor.\nAll right.\nThanks.\nThank you very much.\nGood morning.\nThank you, Senator Alvers.\nI appreciate that introduction and thank you members\nof the senate caucus for being here today\nand thank you members of the press for being here.\nI appreciate this opportunity and I appreciate the leadership\nof our public safety chair, Alvers and Senator Randy Robertson,\nwho's a former retired law enforcement officer himself.\nYou know, for the past two years, we've watched here\nin our capital city and our county of Fulton.\nThe crime has gone up, the backlog and the court system has increased and obviously our\njails are overcrowded right now and unfortunately we've had some unfortunate deaths, multiple\ndeaths in the last year that has brought a significant concern to what's going on within\nthe Fulton County system here.\nAnd I'm proud to have Senator Albers and Senator Randy\nRobertson taking a proactive approach to tackling this issue.\nAnd we're not coming to this from an adversarial standpoint.\nWe're coming at it as a body that wants\nto help have solutions to this issue and this problem that\nis continually to grow right now.\nAnd I'm proud that the Senate is leading the way on that issue\nand that we're going to, but anytime you have a significant\nissue going on, whether it's in your state or in counties\nor at the federal level, you've got to get to the root\nof the problem.\nAnd that's what we've set up this subcommittee for is\nto look at what's going on on the streets with law\nenforcement activity and the backlog in the court\nsystems as well as overcrowding of the jail.\nSo I'm proud that our senators met with the local sheriff here\nand took a tour of Fulton County jail yesterday\nto hear him out and what's going on\nand the issues that they're trying to address there.\nSo I want to thank these senators for being proactive.\nWe do want to be the safest place,\nnot just the best place to do business,\nbut we want to be the safest place to do business.\nAnd in order to do that,\nyour capital city has got to be that.\nAnd every person deserves due process\nand not have the unfortunate situations\nthat we've had in the last year\nwith the untimely deaths of individuals\nwho were waiting to be arraigned in most cases.\nSo thank you, Senator Alvarez,\nthank you, Senator Ren Roberson,\nand leadership at the thing of the Senate committee\nand I appreciate everyone being here\nand being a tenant to this, so I'll sit, sit there.\nThank you Lieutenant Governor.\nAs a resident of Fulton County,\nthat I've had the honor to serve for almost 13 years,\nI share the concerns of my fellow citizens,\nelected leaders and key stakeholders.\nFirst thing I want to mention today,\nbecause some tend to confuse these as a jail,\nis not a prison.\nYou go to jail once you've been arrested\nand booked into the jail.\nbut that begins our process of being innocent\nuntil proven guilty.\nIf someone is proven guilty,\nthen they can be sentenced to a full prison term\nsomewhere in the Georgia State System,\nbut it's important for us to note the distinction\nbetween the two.\nWe can't stand idly by by people are dying\nand justice is not being adjudicated in a timely manner.\nTherefore, I've assigned a Public Safety Subcommittee\nto do a deep dive investigation into these issues.\nThe root causes, and most importantly, the solutions.\nI have the utmost confidence that this committee\nof professionals will do what it needs to be done.\nI want to thank Lieutenant Governor Jones\nfor appointing two ex officio members of this committee\nto complete this very comprehensive task.\nAt this time, let me introduce the members\nof the subcommittee.\nThere will be Senator Mike Dugan,\nwho chairs our veterans and Homeland Security Committee,\nand also has a long career as United States Army officer.\nSenator Chuck Payne chairs our Science and Technology Committee,\nand also serve for over three decades\nas a juvenile probation officer.\nI will serve as a member of this committee.\nOur two ex officio members will be Senator Sonja Halpern.\nSenator Halpern is the chair of the Fulton County Delegation\nin the Georgia State Senate.\nSenator Brian Strickland is the chairman\nof the Senate Judiciary Committee.\nAnd last but certainly not least\nis our majority-whip Senator Randy Robertson.\nHe serves as the vice chairman\nof the Public Safety Committee\nand will be the chairman of this important subcommittee.\nHe is a retired major from the Muscogee County Sheriff's Office\nwho has very specific experience\nboth working in and leading a large jail.\nHe's a very talented and detailed individual\nand nobody has more experience\nand is more capable of handling this task\nthan Senator Robertson.\nI'd like to invite him up for a few remarks.\nThank you, Mr. Chairman.\nI wanna start by thanking Lieutenant Governor Bert Jones\nfor his leadership not only on this issue,\nbut throughout my career in the Senate,\nhis leadership on all issues related\nto criminal justice reform and public safety.\nHe has chosen to step out front and stand against the hot winds of politics and other things\nwhen it comes to public safety and criminal justice and lead us to the battle.\nAnd I thank him for that.\nI want to thank Chairman John Albers for the confidence he has given in me and for the\nopportunity he has given me to lead this subcommittee to look at the problems within the\nFulton County jail. As we understand it and understanding the environment inside of a big\njail a lot of times these problems are caused either by funding management or in the court\nsystems whether that's at the bench or in the DA's office and we'll be looking at all of these\nthings. We've already started over the past few weeks of gathering data and information related\nto this issue and I feel very confident in the members of this committee that it will\nbe a very professional and detailed investigation into the operations and concerns surrounding\nthe Fulton County jail.\nOur first meeting will be at 10 a.m. on November 4th, November 2nd.\nI apologize in the Capitol and the agenda will be posted on the website once all the\nwitnesses have been confirmed and all of our meetings, of course, will be open to\nanyone and everyone who wishes to attend. Again, I want to thank Chairman Albers\nand Lieutenant Governor Bert Jones for this opportunity. Thank you. Thank you.\nThis time we're going to take a few questions before we conclude the press conference.\nYes, as mentioned, we will go through the areas that are causing the concerns today that\nhave led to, unfortunately, the deaths in the Fulton County jail, as well as the conditions\nthat people are surrounding right now to make sure we determine what the root cause is\nand what the solutions will be in order to fix those problems.\nAt this time, based on the evidence that Senator Roberts and Gathers spoke committee chair,\nWe will determine from the information we get from both open records requests, as well\nas direct requests from agencies.\nWe will determine who we will bring forward for that time.\nI appreciate everyone's interest in going a little too political on this issue.\nHowever, we're looking at the Fulton County jail and all the things that surround that.\nSo it would be very presumptive and getting far out of bounds of where we are right now\nto be talking about an individual or any one group.\nWe're gonna do the right thing\nand that's to conduct a thorough investigation\nand go wherever the facts may lead us.\nAnd we're gonna do one final question.\nNo?\nNo?\nIt's a lot of questions.\nBut with the recent death of the corrections officer\nin state prison, will we get a business committee\ngoing to look at that at all?\nOr is there going to be any focus on state level\nlocations at prison?\nCertainly.\nWe all mourn the loss of our corrections officer\ndown its mid-state prison.\nThank him for his service, and it was a very sad state\nwhen we had a convicted criminal who was a prisoner there\nwho took his life.\nWe have a full investigation underway\nfrom the Department of Corrections.\nThat investigation is shared with the entire public safety\ncommittee.\nWe work with them on a daily basis, and as with anything,\nwhether that happens in any part of our government,\nwe continue to provide oversight and work together with them\nto make sure that we're giving them the proper tools\nand funding and everything is done above board.\nThank you all for coming today.\nWe appreciate your time and we look forward\nto conducting this further analysis\nand hope to see you on November 2nd\nat 10 a.m. at the Capitol.\nThank you.\n",
  "updated_at": "2026-02-12T20:24:20.551032+00:00"
}