{
  "video_id": "t3e4q0IME0s",
  "url": "https://youtu.be/t3e4q0IME0s",
  "title": "Georgia House - Day 5 (2026-01-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": "2026-01-27",
  "duration_minutes": 74,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 5 (2026-01-27)\n\n## Overview\nThe session included a welcome back for the House Minority Leader, a tribute to Chairman John Corbett who lost his father, and a devotion by Representative Jess Nix, the son of Representative Miranda Nicks. The majority of the session focused on the devotion and personal remarks.\n\n## Key Actions\nNo bills were passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representative Miranda Nicks gave a personal introduction for his son, Jess Nix, who delivered the devotion. Nicks shared details about Jess's background and religious leadership roles.\n- Jess Nix gave the devotion, reflecting on the role of legislators in responding to constituent requests, including some unusual or impractical requests.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nThe session began with a roll call to establish quorum.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nThe hour of convening, having arrived, all members of the House will please report\nto the floor and take your seats, all members of this house will please\nreport to the floor and take seats. Mr. Clark, would you ring the bell please?\nAll members, please report to the floor and take seats.\nWe are going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nall members voted, have all members voted. If so, the clerk will lock the machines.\nWell, good morning, that was a little weak. Good morning, better. Welcome to legislative\nday five. Doorkeepers will please close the doors and keep them closed. Before we have\nour devotion. I want to extend a welcome back to our minority leader who is back after\nvacation. He defied his doctor's orders to rest until April or May. I hope there's no\ncomplications on that, Mr. Leader. When we go to have our devotion this morning, I'm\nI'm going to ask you to keep Chairman John Corbett and his family and your thoughts and\nprayers.\nChairman Corbett lost his dad over the weekend and he's something you never get ready\nto have happen.\nWe will begin our day with scripture reading and prayer by the chaplain, after which we\nwill pledge allegiance to the flag of our country.\nHe got a real treat for Chaplin this morning and he will be introduced by the gentleman from the 69th House District Chairman Miranda Nick's Chairman Nick's.\nThank you, Mr. Speaker.\nEarlier this session, I believe it was representative Bruce Williamson introduced the chaplain of the day and he said, I have known him all my life.\nWell, today I'm going to turn this around and I'm going to say that I have known him all of his life.\nNow, I know a little bit about this fella. He comes from a good family.\nNow, his mother is a good woman.\nI guarantee you.\nBut I've been told, I've been told that there are a lot of people\nthat think the jury's still out on his dad.\nBut for those of you who don't know, this is my son.\nBefore I tell you a little bit about him, let me introduce his family.\nOf course, the good woman that's his mother is my wife, Debbie.\nshe's here. Stand up Sarah, his wife is here, Jasper, his son is here, Leyla, his daughter\nis here, Barrett, his son is here, and Duncan, his son is here. You guys stand up, okay?\nAnd Barrett and Duncan are going to be paging for us today as well. So they call this group\nthe Nick six, so we've got the Nick six with us today.\nJess was in the sixth grade when we moved to Georgia\nfrom Alabama.\nJess graduated from Lagrange High School.\nHe went on to Sanford University in Birmingham\nto graduate there and then he went on\nto the University of Alabama Law School\nwhere he has his degree.\nWhen Jess was in law school and for a while after he practiced law,\nhe was the pastor of Briarfield Baptist Church\nin Briarfield, which is just south of Birmingham.\nSince that time, they have become members of Estavia Hills\nBaptist Church, where Jess is the chairman of Deacons.\nI know he's held a number of different positions in the church\nthere in leadership, but now he is chairman of their Deacons.\nOver seven years ago, he and Sarah\nstarted a new class for young adults.\nAnd that class became one of the fastest growing classes\nin their church.\nThe thing I'll tell you about Jess is,\nJess will not use the literature that they give to him.\nHe writes his own Sunday school lessons every week.\nSo I would say that he probably spends more time doing that\nthat most pastors do preparing their sermon.\nJess is a real student of the Bible.\nAnd I think he proves that you don't necessarily\nhave to be in the pulpit every Sunday\nto have a ministry and an impact on lives.\nAnd I can't wait to see what he's got to say for us today,\nso let me present my son, Jess Nix,\nwho's chaplain of the day.\nMr. Speaker, ladies and gentlemen in this honorable house,\ndad, people in the gallery,\nthank you so much for having me here.\nIt's a true honor to be here,\nand it's a double honor to be invited back to do this.\nI did this about 13 years ago.\nThis is the first time that my family's been here, which is a terrific honor to be able\nto be here with all my children, none of whom were born the last time.\nSo thank you.\nIt's a wonderful day for me and I just want to share some of that joy with you.\nToday I want us to think a little bit about the roles that we all have.\nYou know, Dad was saying I was a pastor.\nHe was kind enough not to say the church I had was a church of about six people.\nSo we were not a very large church, we were a very close church.\nThe youngest member of my congregation besides my wife and I was 50 years old.\nAnd I will say we have kept up with them, we love them dearly.\nThen when I left that church and went to the church I go to now and started Sunday School\nclass. We started from scratch and we've got, you know, close to 40 people on\nroll. So what I've learned is I'm apparently a much better Sunday school\nteacher than pastor. And I'm okay with that, you know, sometimes God uses us in\ndifferent roles than perhaps we would like. Sometimes he makes us more\neffective when we take different positions than if we got to pick them when we\nlet him pick them for us. So today I want to talk to you a little bit about\none of the roles that uh that you all play it's one that you all know well but\nI bet it's not one that you hear too much talked about so uh I am a lawyer\nby trade uh so I want to begin by reading Article 1 section 1 paragraph 9 of the\nGeorgia Constitution I'm sure you can all quote it that that guarantees that\nthe people have the right quote to apply by petition or remonstrance to those\nvested with the powers of government for redress of grievances. Now, to put that in just plain old\nEnglish and tell you how it applies to you, the people of Georgia have the right to complain to you\nwhen they think something is not right. And, you know, when you think about it, that means that the\nmayors of the communities and your districts have the ability to ask for your help and getting\nstate funding for a local initiative. It means that local business leaders can help\nyour assistance in, you know, working through a permitting issue. It means that environmental\nactivists can ask you, could you please help them clean up a state park? I'm sure that\nyou get all those requests and I'm sure that we all recognize that your help with those\nrequests makes your district and this state a better place. We can all appreciate that.\nSo that's actually not what I want to talk to you this morning about.\nI want you to think about some other requests that you get.\nAnd as you know firsthand, the right to petition in the Georgia Constitution does not restrict\nwho can petition, nor does it restrict what they can ask you to help them with.\nSo the reason I know that is through phone calls with my dad.\nThese calls usually start with my dad asking some sort of very deep question about the\nlaw.\nHe'll call me up and say, yes, got a question.\nIs it really true?\nI'm just giving an example that didn't really happen, but it could have.\nIs it really true that you cannot wear a pink underwear to duck hunt in South Georgia?\nAnd I'll talk to him and I'll say, well, dad, number one, I don't give out free legal\nadvice.\nSo take it for what it's worth.\nNumber two, if you get indicted for this, I guess I'll try to represent you.\nBut, you know, after I clear that, he tells me, well, I didn't figure it did, but somebody\nasked me.\nAnd he'll say, somebody, you know, one of my constituents asked me that question.\nI felt like I needed to just double check that I was not missing something.\nAnd I'll assure him that he was not.\nbet that we could spend all day swapping stories between all of you for requests\nthat you've received from constituents, requests that perhaps didn't make the\ngreatest bit of sense and that you probably didn't have the ability to help\nwith, but requests that you receive nonetheless. Now I want you to think about\nwhat you do with those requests because I'll tell you the one thing and I don't\nwant to give them a big head, but one thing I admire dad for is he responds to\nthem. He will actually email or call or write back to everybody who makes a\nrequest of it. Whether it makes any sense or not. And the reason I know that is\nbecause my mother and I will look at him and say, what are you doing? You don't\nneed to respond to that. You have nothing you can do to help. Not only do you\nhave nothing you do to help, it's clear that whatever's been asked, it doesn't\nmake any sense and he doesn't listen to us and he responds anyway and I just want to draw\nyour attention to those kinds of requests to think through those times when you get those\nrequests and guess what they're not going to help your district they're probably not going\nto help you get elected again they're not going to get you a vote they're not going to do much\nof anything, but there's somebody out there reaching out to you, and there's asking for\nyour help with something that they think is a problem. So, with those ideas in mind, let's\nthink a little bit about some of Jesus' ministry that we know about. So, if we start with\nthe Gatterin de Moniaque, we're told from Luke that he was naked and he had no home to\ngo to because he lived in the tombs and Mark chimes in that he could not be bound even by chains\nand that he spent all day cutting himself and Jesus reached out to him and Jesus brought him back\nto the fold so to speak. Let's talk about the famous woman at the well so Jesus you know when he\ngoes to talk to her and they're talking about living water he says go get your husband and she says\nI have no husband. He said, you're right. You've had five. And the man you're living with now is not your husband.\nAnd Jesus sits there and he talks to her and he meets her needs. Let's remember a little more broadly that\none of the complaints about Jesus from the religious leaders, from the people who held power was that\nhe was always eating with tax collectors and sinners. He was associating with the people you did not\nassociate if you were one of the people in power. And let's remember that Jesus responds to that\nis that it's not the healthy that need a doctor, but the sick, and that he came not to call\nthe righteous, but sinners.\nAnd while I recognize that Jesus had a divine ability to heal and to intervene in situations\nthat none of us have, I think that it would be an injustice to think that his ministry\ndid not take a toll on him, that even reaching out to these people wasn't difficult for him.\nIf you look after the big events in his life, so let's take the feeding of the 5,000.\nIt Jesus feeds the 5,000 and it says he withdrew to a mountain by himself.\nHe needed some space.\nMark 1 records that one evening after sunset an entire town gathered at Jesus' door where\nhe was staying and healed people of diseases and drove out demons.\nThe very next first tells us that early the following morning Jesus went to a solitary\nplace to pray.\nneeded to get himself back in order. He was tired, he had worked hard.\nAdditionally, I think we have to keep in mind that when we read about the things that Jesus\ndid, we're given a snapshot, right? We're told Jesus reached out and healed this person.\nWe're not then given that person's biography as they went forward. I think we know enough\npeople in our churches, in our synagogues, in the places where we worship who are very\ncommitted on Sunday and on Monday you'd never know it and I think we can\nposit that human nature being what it is even some of the people that were\ntouched by Jesus went back to their old ways he would say you know go forth\nand sin no more he didn't say go forth because now you will never see so even\nJesus realized and I think we can take it as a surety knowing human nature that\neven the people that he would reach that may be a temporary thing and that they\nmay go right back to where they were before. I think that's why we learn in\nGalatia while we hear Paul saying Galatians to all of us do not grow weary in\ndoing good. For at the proper time we will reap a harvest if we do not give up.\nAnd so this morning I want to offer you that encouragement. Don't grow weary\nin doing good and particularly don't grow weary in doing good to those constituents who\nbring requests to you that may make no sense that you may not have the ability to help with.\nThe Georgia Constitution gives those people the right to petition their government and\nthe constituents of your district have designated you the person that those people should report\nto. You have been put in a position to help those people uniquely. When I talk about roles,\nthat is a unique role that you have. And then we take the example of Jesus and the people\nthat he reached out to in the ministry that he had. And Jesus gives us all the example.\nHe gives us the call and he gives us the encouragement that whether it is the most powerful\nperson in your district or the person that everybody else walks by. All of them are your constituents\nand all of them have needs that you uniquely may be able to help. So as elected representatives,\nI hope that you will take that unique position and opportunity to serve and help the people\nthat no one else will and my hope and prayers that you will make the most of it. So I hope that\nthat you will join me in prayer now.\nLord, I pray you're blessing on this body\nof elected officials.\nGive them wisdom as they weigh through difficult\nand profound issues of law and public policy\nin their work in this chamber.\nHelp them to be patient with and attentive to one another\nas they work together for the good of the state\nand their districts.\nI also ask that you guide them\nas they serve the people living in their districts.\nencourage and strengthen them to serve all of their constituents from the most\npowerful to the most overlooked. Give them compassion, understanding and\ninspiration to never grow weary in doing good. In your name we pray, Amen. Please\njoin me in the pledge.\nAnd to the United States of America, and to the Republic of Alicia Sands, one nation under\nthe indivisible, the liberty and justice of all, and I think Mr. Smith, good to see you.\nYes, sir.\nGood to see you.\nI think doorkeepers will unlock the doors.\nYou\nThe chair recognizes Chairman Hogan, the chair on the committee of information and audits.\nThank you, Mr. Speaker.\nYour committee on information and audits read the proceedings of the previous legislative\nday and found them to be correct.\nChairman Hogan, the chair of the Committee on Information and Audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none in the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns on 59th, Mr. Burns on 159th, Mr. Burns.\nGood morning, sir.\nMr. Burns on 59th, moves that the following be established as the order of business owner first part of the period unanimous consensus.\nInstruction of bills and resolutions. First reading of reference of House bills and resolutions.\nSecond reading of bills and resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nThe chair here is known and the resolution is adopted.\nFirst reading of bills and resolutions the clerk will read.\nHouse Bill 743, vice-president of the 88th Carpet of the 4th Hill of the 3rd, Kirby of the 114th,\nJasris of the 11th and others, Ability Taddle and Actuament of Chapter 3,\nTaddle 20.\nYou fish go to Georgia, annotated relating to post-secondary education.\nHigher education.\nHouse Bill 786 by Richland, Welch of the 110th, Douglas of the 78th,\nRutledge of the 109th, Holley of the 111th,\nMathy Act of 73rd and others,\nyou'll be Taddle and Actuament, Code Section 1562.\nthe fiscal to Georgia annotated relaying the number of judges' period courts.\nJudiciary.\nHouse Bill 787 by Rosa Ballinger.\nThere's 23rd, Jasperist, the 11th, follow the 32nd.\nMom to Hannah, the 17th, LaHood, the 175th and others.\nThere'll be a ton of knack to amend Code Section 16-111-26.\nThe fiscal to Georgia annotated relaying to having or carrying handguns.\nPublic safety and homeland security.\nbaseball 780, APR versus Corbin, the 174th throws,\nthe 120th, Carpenter, the 4th,\nBonner, the 70th, 2nd.\nThe hood of the 175th and others,\nBill B. Todd on actor, Mencoat, section 48, 8,\n33.2 of the Fiscal of Georgia,\nannotated relating the definitions,\nexemptions, and applicability.\nWays and means.\nHouseball 780, I'm out of reps on it.\nNewton of the 123rd, Jones of the 47th,\npatch of the 150th, gains of the 117th,\nWe now are the 119th and others.\nThere'll be a ton of an act of men in chapter 20C.\nA total 33 that just go to Georgia,\nannotated relating to accurate provider directories.\nSpecial committee on access to quality health care.\nHouse Bill 790, bed reps on Smith and on 33rd,\nPaul 32nd, Harold of the hundred and sixth,\nGarper to the fourth.\nThere'll be a ton of an act of men.\nTitle 43 that just go to Georgia,\nannotated relating to professions and businesses.\nRegulated industries house will 791. Our reps of Stevens the honor 64th building talent act to amend Code section 26 for 80 the fish\nGo to Georgia and Tady relating the license requirements for practice of pharmacy health and human services\nHouse bill 792 by person frost of the 7th Jones the 47th burns the 159th England of the 116th the building talent act to amend\nAn act making and providing appropriations for the state fiscal year beginning July 1 2019\nAppropriations House Bill 793 by resident of Ralston, the 7th Jones, the 47th burns 159.\nEngland 116th, they'll be in town of act to make and provide appropriations to state\nfiscal year beginning July 1st, 2020.\nAppropriations House Bill 794 by resident of Ralston, the 7th Jones, the 47th burns\n1159th and England 116th, they'll be in town of act to amend and make and providing\nappropriations for the state fiscal year beginning July 1st, 2019.\nAppropriations House Bill 795 by resident of Ralston, the 7th Jones of the 47th burns the 59th England 116th\nBill being tied on act to amend the act making providing appropriations for state fiscal year beginning July 1st 2019\nAppropriations House Bill 796 by resident of Ralston, the 7th Jones of the 47th burns the 59th and England of the 116th\nBill making to make and provide appropriations for state fiscal year beginning July 1st 2020\nAppropriations House Bill 797, Representative Ralston, the 7th Jones of the 47th Pursuit,\n159.\nEngland of the 116th, Bill Jamaican, provide appropriations for the State Fiscal Year\nbeginning July 1st, 2020 Appropriations House Bill 798 by Representative\nDollar of the 45th, 48th, Hugley of the 136th, and Ogan of the 179th, Bill being taught\non Act 2 Men Article 5 of Chapter 9, a total of 40 of the fish going to Georgia and\ndata relaying to assigned risk plans.\nInsurance.\nHouse bill 799 by resident blackman of the 146,\nthe Saints of the 180th, Kendrick, the 93rd,\ngo over the 174th and Kelly, the 16th and others,\nwill be titled an act to amend Article 3A.\nUp chapter five, a total 40,\nthe fish go to Georgia,\nand data relaying the suspension of license.\nJudiciary non-civil.\nHospital 800 by resident of Scott of the 76,\nThomas of the 56, Kendrick of the 93rd,\nStovall of the 74th.\nThomas the 39th and others.\nBill being taught on active men.\nArticle seven to chapter four.\nTitle 49 in the physical\nof Georgia and entertainer relating\nthe medical assistance generally.\nHalt and human services.\nHouse Bill 801 by reference.\nScott of the 76 Thomas the 56.\nDavis the 87th Schofield the 60th\nand Hutchinson the 100th and 7th.\nBill being taught on active men.\nChapter seven to title 31\nof the physical to Georgia and\nattended relating the regulation\nof construction of hospitals.\nHalt and human services.\nHouse Resolution 910 by Rev. McLaren in the 51st,\nall come to the 81st, all over the 82nd,\ncouch to the 50th, Clark of the 108th and others.\nResolution proposing an amendment to the Constitution.\nTransportation House Resolution 911 by Rev.\nScope field of the 60th and drier of the 59th.\nResolution urging the Georgia Department of Transportation\nto erect sound barriers in the city of Hakeville.\nTransportation House Resolution 912 by Rev.\nStephen's the 164th and Petrie the 166th.\nResolution recognizing Mr. Jimmy Bernsett\nin dedicating a road in his honor.\nTransportation House Resolution 913,\nmembers of Stephen's the 164th and Petrie the 166th.\nResolution recognizing Mr. Harold Fowler,\nMr. Jimmy Bernsett in dedicating a bridge in their honor.\nTransportation House Resolution 929,\nmembers of Gillier to the 166th, Scott of the 76th.\nThomas of the 56th and Stephen's the 164th.\nThe resolution encouraging the State of Georgia to establish a Georgia Gulo Gici Heritage Society.\nSpecial rules!\nHouse of Resolution 930 by Representative Gillier to the 160-Second Clock on 108th,\nwhich is the 161st and Steven's the 164th.\nThe resolution encouraging the State of Georgia to endorse the stand for forest platform and its objectives.\nNatural resources and environment.\nThat completes First Readers.\nSecond reading of Bills and Resolutions, the clerk will read.\nHouse Bill 775, by Representative Mitchell of the 88th, the bill relating to property tax exemptions and deferral House Bill 7-7-6, by Representative Mitchell of the 88th, the bill relating to mortgages, conveyances to secure debt and leans House Bill 7-7-7, by Representative corporate of the 174th Burns of the 159th McCall of the 33rd, England of the 116th Smith of the 70th and others, the bill relating to standards and requirements for construction, alteration of buildings and other structures.\nHouse bill 778 by Representative Turner of the 21st, the bill relating to Edgelorham Tax Exemptions.\nHouse bill 779 by Representative Blackburn of the 146, Williams and of the 115th Carson of the 465, the 118th Stevens of the 164th, the bill relating to\nAlternative Edgelorham Taxes on Motor Vehicles, House bill 780 by Representative Perkel of the 155th, green of the 151st lot of the 120 second,\nsecond. Lumps note the 12th of Bill's relating to powers and duties of the State Properties Commission,\nHouse Bill 781 by Representative Williams, and of the 115th,\nFrazier of the 126th, Ridley of the 6th, House of the 170th,\nthe Bill relating to financial institutions, House Bill 782 by Representative\nO'Cloud of the 105th, pairs of the 142nd, Stowe of the 74th,\nGlanton of the 75th, Pry of the 118th, and others,\nthe Bill relating to holidays and observances,\nHouse Bill 783 by Representative Thomas of the 39th,\nBode of the 62nd Court of the 163rd Scott of the 76th Hutchinson of the 117th and others\nof Bill relating to education House Bill 784 by Representative Lumson of the 12th\nJasper's of the 11th Hitchens of the 161st with hour of the 119th gains of the 117th\nand others of Bill relating to open and public meetings House Bill 785 by Representative\nGala of the 19th Jones of the 25th Rodgers of the 10th Reaves of the 34th Washburn of the\n111st and others of Bill relating to clerks of superior courts House Resolution 896 by\nby Rumps of P3 of the 166th, Stevens of the 164th,\nHitchens of the 161st, Gailier of the 162nd,\nGordon of the 163rd, Resolution Recognizing the life\nof Mr. James, Jimmy, Alan P3,\nand dedicating a bridge in his honor,\nthrough second readers.\nThere are no reports of standing committees, no standing committee reports, all right.\nWe're going on now to morning orders.\nWe have a large number of members who have signed up for morning orders under the rules\nof the House.\nThe total time to be allocated is 20 minutes.\nGiven the number of members who have signed up, the chair will limit each member to one\nminute.\nat each Chair recognizes Chairman Silcox for a morning order. House will come to order.\nThank you Mr. Speaker. Today I stand to honor the six million victims of the Holocaust\nand to recognize the group men and women who are here today to celebrate International Holocaust\nRemembrance Day at the Georgia State Capitol.\nIn April of 1945, President Dwight D. Eisenhower wrote to George C. Marshall,\nthe things I saw beggar description, the visual evidence and the verbal testimony\nof starvation, cruelty, and bestiality were so overpowering as to leave me a bit sick.\nI made the visit deliberately in order to be in position to give firsthand evidence of\nthese things if ever in the future, their develops a tendency to charge these allegations\nmerely to propaganda.\nI am here to assure you that we in Georgia will never forget what our Jewish brothers\nand sisters went through.\nWe as Americans and as Georgians must condemn all forms of religious intolerance based on\nand ethnicity or religious belief.\nOur Constitution protects our right to freedom of religion, and we must take this day to\nremember those who suffer the most because their beliefs may God bless their memory.\nChair recognizes for a morning order representative Wolenski.\nThank you, Mr. Speaker.\nOne of the reasons we all just a minute representative.\nThis house will be at order during morning orders.\nIf you have other matters to attend to,\nAnd please take them outside the chamber, gentlemen, may proceed.\nThank you, Mr. Speaker.\nOne of the reasons we all serve as for our families.\nIt is a top priority of Georgians.\nToday I must share that my family tree has branches that don't exist anymore.\nMy great-grandmother had 10 brothers and sisters.\nI should have 5,200 more cousins, but seven of those 11 siblings and 42 of my relatives\nwere murdered in the Holocaust.\nMy great Uncle Martin survived the Auschwitz death camp, so did my great Aunt Rose.\nI will never forget seeing the tattoo on my great Uncle Martin's wrist.\nHe received from the concentration camp.\nToday's the day set aside around the world to remember the Holocaust.\nIt's not to ask for guilt or sadness. It's not about rehashing the past.\nSee, at one time it was easy.\neasy.\nAll right, at one time it was easy, those survived, could share their story.\nWe must not let the horror of 75 years ago fade, because there are few to remember the story\nfirst hand.\nRecently we are reminded with the tax against the Jewish community.\nOur community has been forced to put tremendous resources and police protection at synagogues.\nIt shocks me that in Georgia, that anybody needs protection to pray due to hate.\nWe relearned this lesson of the past today because this is not about the Jews.\nIn addition to 6 million Jews who were killed, there were 5 million others killed in the\nHolocaust at least solely because of their ethnicity, political beliefs, sexual orientation\nor religion, including Catholic priests.\nToday hatred is rising against many different groups.\nWe must remember that we cannot just stand up for our own.\nWe must support anyone who's being treated with hate.\nToday, we must relearn this lesson of the past now before we learn a terrible lesson\nof the future.\nThis session let us fight every kind of hate and let's do it together.\nThank you, Mr. Speaker.\nThank you, Mr. Speaker, good morning members of the House and guests.\nToday I stand before you to share a memory.\nAs a child while in grade school, I had a friend, I'll call him David, just another\nkid from the neighborhood, but he was a great guy. His parents were quiet, and they\ndidn't always come around when the other parents did. I remember his father, especially,\nfor he had a funny scar on his arm. At the time, I didn't think much about it, but as\na teenager, I read the book, The Diary of Anne Frank, and I realized it wasn't a scar\nat all. It was a tattoo, a series of numbers. He was a survivor of a German concentration\ncamp. So that we never forget today, I share a quote from Ann Frank. You know, for such\na young person, she was very wise, but as Da Vinci said, wisdom is the daughter of experience,\nand may we never have to experience what she did. Her message needs repeating. She wrote,\nwhat is done cannot be undone, but one can prevent it ever happening again. I ask that\nWe all remember and never let it happen again.\nThank you, Mr. Speaker.\nI yield the well.\nChair recognizes representative Al Williams\nand representative Jones for a morning order.\nThank you, Mr. Speaker, members of the Sistine Body.\nLast Thursday, January, January 23rd,\nLong County, Deputy Sheriff Sheldon Gordon Whitman was killed in the line of duty, serving\nhis county and his fellow citizens in a high-speed chase through Long County into Maca-Chosh.\nThe deputy sheriff is survived by his wife and four children.\nJust to feel, join me in a moment of silence and remembrance of Long County, Deputy Sheriff\nSheldon Gordon Whitman thank you thank you Mr. Fever\nchair recognizes chairman Gerald Green for a morning order\nThank you mr. Speaker good morning colleagues today we celebrate South West\nGeorgia day here at the Capitol the region of Southwest Georgia's rich with red Georgia\nclay and produces major crops that contribute to Georgia's number one industry\nagriculture. While farming is part of the fabric of Southwest Georgia we're also\nopen for business and I want to thank all the local governments, chambers of\ncommerce, our local health care system, Phoebe Putney, Andrew College, the\nBoy and Girls Club, Albany State University, United Way of Southwest Georgia,\nand also STEM. And we also have the Smithsonian traveling exhibit here and we\nwould love for you to come down on the second floor and join us. And Mr.\nSpeaker, I would like to end a feud here at the Capitol. I'd like to ask that\nrepresentative Randy Nick's chairman would he come up. We have from Southwest\nGeorgia, the rum. Hallelujah, unusual. And this was done by Spiro's wife April. She and she had a hard\ntime with the rum in there because it kept disappearing as Spiro moved through the house. Thank you,\nYou must speak, uh, thank you, uh, representative.\nAnd I hope he'll do the Christian thing and share it.\nThe T totaler's caucus gets the first shot at it, though.\nChair recognizes Representative Casey Carpenter for a morning order.\nThank you, Mr. Speaker.\nSo guys, I come before you today to tell you some great news.\nI don't know if any of you watched the pro-bow last night, but Coach Matt Land from\nDalton, Georgia won the Don Chula Award for the best high school coach in the United States\nlast night.\nSuper proud of him.\nHe's coached in Dalton for 25 years.\nHe was my position coach when I played and we can't be more than excited for what he's\ndone for our community and how well he represented it.\nin Orlando yesterday. Thank you. Chair recognizes representative Hutchinson for a morning order.\nThank you, Mr. Speaker. Welcome colleagues back to our session. I would like to\nstart again with our children that we have adopted ready for adoption in Georgia. Today I want to\nto talk to you about Selena, who's 16 years old,\nChristina, who's 12, and dominant, who's 10.\nSelena is a smart girl who's currently enrolled in JROTC.\nShe plans to join the military to become a lawyer and help\nkids like her through the adoption and foster care\nprocess.\nShe has great grades and is well-behaved.\nChristina is a loving, creative, and energetic child\nwho is protective of her brother and sister.\nShe enjoys doing arts and crafts.\nDominic is a polite and well-mannered boy\nwho enjoys sports, especially basketball.\nHe likes to play on his tablet.\nThis group needs an attentive, supportive,\nand encouraging family who's able to keep them\nconnected with their adult sister.\nAnd I would like to say on a personal note,\none of my most favorite jobs as a social worker\nwas to do adoption recruitment activities for children\nwho particularly for sibling groups.\nSome research will tell us that sibling group bonds\nare just as strong as a parent bond.\nAnd to keep a sibling group like this together\nis of the utmost importance.\nSo I encourage you to talk to your friends and family\nabout adoption.\nThank you.\nChair recognizes Chairman Hogan\nand Representative Jones for a morning order.\nThank you, Mr. Speaker and members of the House, the Brunsett Golden Oils Chambers here\ntoday.\nSo if you see them around, they can be capped, sort of lost, show them the way.\nAnd would you please stand, members of the Brunsett Golden Oils Chamber, and we'd like\nto welcome you.\nThank you for coming, and we enjoyed last night with you, too.\nAnd I think I don't see Woody Woodside, but he's supposed to be with him, but welcome\nto the chamber and y'all have a good time while you're here.\nChair recognizes Chairman Cantrell for a morning order.\nGood morning colleagues.\nI got a two-part morning order for you this morning.\nFirst of all, I want to stand before you today and honor the real West Cantrell.\nAnd many of you know me by that name, but the real West Kintrell at my house is my father.\nHe's a Georgian native, came from humble beginnings, the son of two public school educators\nwho rose to eventually become the president, CEO of a billion dollar international corporation.\nAnd he turned 85 years of age yesterday.\nHe was the best man at my wedding, not because he's my dad, but because he's literally\nthe best man that I know.\ncolleagues, would you join with me in wishing my father a happy 85th birthday today? Thank you.\nThe second part of my morning order is to remind you you should have had a flyer on your desk\nabout the free showing of Just Mercy this Wednesday afternoon 5.30 pm at the landmark theater,\nabout three miles from here. This showing is brought to you by\ngenerous gift from Kanye West and Kim Kardashian. No media, no\nlobbyists, just us. Come join us. Chair recognizes representative Eric\nlike a Thomas and representative Bennett for a morning order.\nColleagues, if you would like to join me, and when great souls die, after a period peace\nblooms slowly and always. Space is filled with a kind of soothing electric vibration. Our\nsenses restored never to be the same whisper to us. They existed. They existed. We can be\nbe and be better for they existed. On yesterday we lost a legend. Husband, father, friend,\nand mentor.\nKobe Bryant, NBA, MVP, and lifelong L.A. Laker\nwill truly be missed.\nKobe's work ethic on and off the court\nexemplified nothing short of greatness.\nOur world lost a leader.\nWe pray for the Bryant, Mauser, Chester,\nObatiboli, and Soblin families.\nThank you so much.\nAnd on behalf of Black Caucus, can we\nyou please give us a moment of silence.\nThank you.\nChair recognizes representative McLauren\nfor a morning order.\nThank you, Mr. Speaker.\nI rise today to honor and express support\nand the strongest terms for public defenders.\nWhat do they defend?\nThey defend the Constitution,\nthe Sixth Amendment to the United States Constitution,\nguarantees adequate, effectively,\nor representation to every person charged with a crime.\nOur system is built on the idea of adversarial process.\nWe pit forces against each other\nand attempt to find the truth,\nbut that only works when both sides have a fighting chance.\nAnd Georgia defenders do their jobs\nwithout resources that they need.\nThey don't make as much as their counterparts,\nthe prosecution, they certainly don't get as much prestige.\nThey have hundreds of cases open at any given time,\nmere minutes to prepare with clients.\nThey don't have resources to spend on things\nlike expert witnesses, to travel to interview witnesses,\nor to do other work on cases that they need to do,\nbecause they're forced to dedicate limited resources\nto only what they feel are the most deserving.\nThat's not what the Constitution requires.\nWe ask public defenders to stand in the breach for us\nto do their best to uphold the system,\nto withstand furloughs and funding shortfalls,\neven where we're failing them.\nSo I stand today to support public defenders.\nWe stand today and we pray that the house does and will too.\nThank you.\nThank you, Mr. Speaker.\nChair recognizes representative Kendrick\nfor a morning order.\nGood morning, Mr. Speaker and good morning colleagues.\nI am giving you your black fact for today\nbecause every day is a day for black history.\nAnd you'll want to tune in to the end\nbecause there's a special Georgia connection\nthat many of you don't know about.\nSo Brown versus Board of Education was a landmark case\nin the US Supreme Court in which the court ruled\nthat the state laws establishing racial segregation\nand public schools were unconstitutional,\neven if the segregated schools are otherwise equal in equality.\nThis case originated in 1951 when the public school district\nand Topeka Kansas refused to enroll the daughter\nof local black resident, Oliver Brown,\nat the school closest to their home, instead requiring her\nto ride a bus to a segregated black elementary school\nfurther away.\nThe course decision in Brown partially overturned\nPlessy versus Ferguson by declaring\nthat separate but equal notion was unconstitutional\nfor American public schools and educational facilities.\nIt paved the way for integration and a major victory\nfor the civil rights movement.\nFour years later in the case of Cooper versus Aaron,\nthe court reaffirmed is ruling in Brown.\nAnd we have a Georgia connection in Brown versus Ford,\nour very own representative of Viola Davis,\nwhich I don't know where she is,\nbut she is actually a one of the plaintiffs\nin that historic case.\nSo take some time to hear from her\nabout changing US history.\nThank you, Mrs. Speaker.\nHouse will continue to be at order.\nHouse will continue to be at order.\nThe clerk will read the caption\nto House Resolution 931.\nHouse Resolution 931 by Representative Silcox, the 52nd, a resolution recognizing January 27th, 2020 is International Holocaust Remembrance Day and for other purposes.\nChair recognizes Chairman Silcox for an invite resolution.\nThank you, Mr. Speaker.\nToday as we celebrate International Holocaust Remembrance Day, I have some special guests\nthat I would like to introduce.\nFirst, Sally Levine, who's Executive Director of the Georgia Commission on the Holocaust.\nNext, Chair of the Board of Directors for the Commission, Dr. Claire Dagestino.\nAnd then from the Israeli Council, Mr. Harold Hirschberg, Director of Government and Political\naffairs, then Mr. Alex Gamler, who's Deputy Council General for Israel, and last but\nnot least, the new Council General of Israel to the Southeast United States as of July,\nMs. Anad Sultan Daedan.\nCouncil General Sultan Daedan began an Israeli diplomatic corps in 2004 and has also served\nin Cameroon, the Netherlands, Germany, and Australia.\nShe holds both bachelors and master's degrees from the Hebrew University in Jerusalem.\nShe is married and she and her husband have three daughters.\nCouncil General Sultan Daedan, I would like to present to you this resolution as passed\nby the Georgia House of Representatives, commemorating the International Holocaust to remember\ntoday and the 75th anniversary of the liberation of Auschwitz.\nPlease welcome the council general for her remarks.\nThank you.\nSpeaker Ralston, Madam Chair, members of the Georgia State House, thank you for the\nhonor to be able to address you on behalf of the State of Israel on this very important\nday as we mark the International Holocaust Remembrance Day in 75 years to the liberation\nof the Auschwitz concentration camp. On the day of liberation, approximately 7,000 survivors\nwere liberated. That is what had remained of over a million Jews who had been deported\nthere. From 1941 to 1945, six million Jews were systematically murdered throughout Nazi Germany\nand German occupied territories in what would become the largest genocide and the darkest of\nchapters in history. Holocaust scholar Professor Yudab Bowel, while delivering a speech to the German\nBundestag in 1998 said, I come from a people who gave the Ten Commandments to the world.\nTime has come to strengthen them by three additional ones, which we ought to adopt and commit\nourselves to. Thou shall not be a perpetrator. Thou shall not be a victim. And Thou shall never,\nbut never be a bystander. Just last week we received an Israel or over 40 world leaders who took part in\nthe fifth world Holocaust Forum in Jerusalem among them United States Vice President Mike Pence\nand Speaker Nancy Pelosi. The attendance of so many world leaders reflected the important\nrecognition of the global responsibility and commitment to Holocaust remembrance into combating\nanti-Semitism. 75 years after the end of the Holocaust, we know all too well that anti-Semitism\nis unfortunately not confined to the books of history. There are those who still today\nseek the destruction of the Jewish people and Israel, the nation state of the Jewish people.\nGlobally, including in the United States, the alarming rise in expressions of anti-Semitism\nis a further reminder of the vital importance of educating\nabout the Holocaust, of educating about the dangers\nof anti-Semitism, racism, xenophobia, and all forms of hate.\nThe state of Georgia's commitment\nto Holocaust remembrance and education\nis well reflected in the Georgia Commission\non the Holocaust, made a permanent state agency\nin 1998 by Act of the Georgia General Assembly.\nToday, on the Capitol, Holocaust survivors and liberators\nfrom Georgia will be honored on panels\nto be hung and unveiled.\nSuch actions taken by Georgia for remembrance and education\nare of immense importance when we speak of never again.\nAs I stand here today, I am not only\ngrateful for Georgia's commitment\nto Holocaust remembrance and combating anti-Semitism.\nI am also grateful for the strong bilateral relations\nthat Israel and Georgia enjoy on so many levels.\nI am proud to represent Israel here in Georgia\nand proud that we have a consulate in Atlanta since 1956,\na testimony to the importance that Israel attaches\nto the relations with the great state of Georgia.\nThe state of Georgia's Department of Economic Development\nhas had representation in Israel since 1994,\nrecognizing the great value and potential\nin our bilateral economic relations.\nOur economic cooperation for the benefit of both our peoples\ncontinues to grow, as do academic exchanges,\ncultural relations, and so much more.\nThere is still more room to further strengthen\nand deepen the relations.\nAnd I look forward to working with all of you\ntowards enhancing the state of Israel's relations\nwith a great state of Georgia.\nThank you.\nThank you so much, thank you, thank you, and step towards them and we'll get a picture together\nThank you, I think I'll see you at one o'clock.\nI think we do it. Thank you for coming.\nOh, you're welcome.\nGood to see you again.\nGood to see you again.\nThank you.\nHouse will continue to be at order.\nHouse will continue to be at order.\nwill read the caption to House Resolution 932.\nHouse Resolution 932, by the sort of Mitchell the 88th, a resolution recognizing commending\nBishop Reginald Jackson in the African Methodist Episcopal Church and for other purposes.\nChair recognizes representative Billy Mitchell\nfor an invite resolution.\nFirst of all, Mr. Speaker,\nI want to thank you in your office,\nas well as Chairman Benton's office\nfor helping us to put this together.\nToday is African Methodist Episcopal Church Day\nat the Capitol.\nThe AME Church was founded in 1816\nis grown to over 3 million members and 7,000 congregations worldwide, 500 congregations\nin Georgia. Bishop Jackson is the presiding pre-late over the six Episcopal district.\nHe certainly brings a wealth of activism and issues affecting the church and social\nissues without further ado, and Mr. Speaker, if I may be allowed, I'd like to recognize\nsome of the AME members in this congregation. We have Representative Calvin Smirie, Representative\nKaren Bitton, Representative Marie Metz, Representative Abel Mabel Thomas, and I'm sure I'm forgetting\nsomeone in former Representative D. Dawkins Hagler, is a member of the AME Church as well.\nwe have Representative Pam Stevenson and Representative of Dexter Sharper, but I believe\nsome of them were missing their tides and offerings, Mr. Speaker, but nonetheless, I present\nto you the presiding pre-late of the Sixth Episcopal District, Bishop Reginald Jackson.\nThank you.\nThank you so much.\nSpeaker Ralston and members of the House of Representatives\nlet me thank you for this opportunity\nand say that it is my delight and my joy\nto be here with you today.\nToday is AME Day here at the State House.\nAnd we are fortunate that AME is\nsome all over the state of Georgia.\nCan it be with us today and just let\nme ask you to wave your hand?\nYeah, look at that.\nYeah.\nYeah.\nYeah.\nThen we chose the first Protestant denomination formed\non American soil as always had a commitment\nto education and to social justice.\nAnd it is in that light that we ask every year\nfor AMEs to come to the state house,\nwanting to see how our government works\nand interact with the leaders who helped shape policy\nand past laws in Georgia.\nI want to specially thank the House of Representatives\nhere in Georgia for passing what we believe\nis a very, very important piece of legislation\nfor two years.\nThis House has passed hate crimes legislation.\nI think it's important.\nGeorgia is one of only four states in a nation\nthat does not have a hate crimes law.\nI think it's important that we send a message that hate and racism anti-Semitism will not\nbe tolerated in the state of Georgia so I want to thank the House for the leadership\nyou have demonstrated on this issue and pray that you will be able to convince your colleagues\nacross the hall to do likewise.\nover again in my mind, I keep hearing Jesus say, your kingdom come, you will be done\non earth. That's what we are committed to that God's will be done on earth. Again, thank\nyou for this opportunity. Let me thank all the AMEs for coming. Let me thank all of\nthe members of the AME Church who serve in the Georgia House of Representatives. Thank\nThank you so much and all the best as you serve this state and its people, thank you.\nYou\nChair recognizes representative Sheila Jones to introduce the doctor of the day.\nThank you, Mr. Speaker.\nToday's Doctor of the Day is Dr. Scott Swayze, MD.\nDr. O. Scott Swayze, MD is the former president and a member of the pinnacle orthopedics\nand has been provided in orthopedic care to patients of\nPellicle Orthopedics since he joined the group in 1992.\nHe specializes in general orthopedics,\ntotal joint replacement and sports medicine.\nDr. Swaisy received his BS in Biomedical Engineering\nfrom Vanderbilt University and his medical degree\nfrom the University of Mississippi.\nHis general surgery internship\nand his orthopedic surgery residency\nwere both completed at Emory University\naffiliated hospitals.\nDr. Swayze is a member of the Wellstar Board of Trustees\nand is a member of several local state\nand national orthopedic associations.\nHe has also been the team physician for many local schools\nand sporting events.\nDr. Swasey currently lives in Atlanta, Georgia\nwith his wife, Carol.\nIn his free time, he enjoys traveling, church,\nand activities with his five children.\nLet us welcome our doctor of the day.\nThank you very much, Mr. Speaker and Representative Jones.\nAs a patient, as a surgeon, and as a board member of a hospital, it is a challenge, certainly,\nwith health care and Georgia these days to provide affordable access for every Georgian.\nBut I thank you for all the work you are doing, and we'll do during this session.\nif you need any help, we're at the medical age station today.\nThank you.\nThank you.\nThe clerk will read the caption to a group of privileged resolutions.\nCongratulating Robert and Linda Nichol on the birth of their son, recognizing January\n21st, 2020 as tourism hospitality and art stay at the State Capitol, recognizing honoring\nJanuary 28, 2020 is Korean American Day at the State Capitol, recognizing\ncommending Reverend Dr. Joel Samu Ratliffe on the occasion of his 40th\npastoral anniversary, recognizing commending the Clayton County Senior Services\nDepartment, commending the Georgia House of Representatives and the Georgia\nEconomic Developers Association on their efforts to improve the economic\ndevelopment climate in the state of Georgia, recognizing a long study\nfriendship between George and Japan, honoring the life and memory of Sherry Thornton Mallory,\ncommending to Rinsa Wing on her 30 years of service to Gwyneth County Public Schools,\nhonoring the life and memory of Lena Baker, commending the Delta Sigma Theta sorority,\ncommending and congratulating Andrew Hagsberg, commending and congratulating Daniel Orta,\nand congratulating David Putman,\ncommending and congratulating Vinnie and Ziano,\ncommending and congratulating Robert Persons,\ncommending and congratulating Kessler Hickton,\nhonoring the life and memory of James Harold Shepard Jr.\nco-founder and chairman of the Board of Directors\nof the Shepard Center.\nCongratulations, commending Banks County High School's\nLady Leopards for securing the class\nto a state title,\ncommending the Augusta Chapper of Jack and Jill\nof American corporate versus outstanding achievements.\nRecognizing commending, Terry D. E. Lam,\nupon the grand occasion of his retirement,\ncongratulating commending, Twig's Academy,\ncommending Habersham County,\nrecognizing February 19, 2020,\nas Habersham County Day at the State Capitol.\nRecognizing commending the state YMCA of Georgia\nand its Center for Civic and Gayment\nand the Y Club Programs,\nwhich sponsor youth assembly\namong other programs that cultivate youth civic engagement and for other purposes that\ncompletes the reading of the Privileged Resolutions.\nIs there any objection to adopting the Privileged Resolutions?\nThe chair here is not in the resolutions are adopted.\nWe have a birthday today.\nI want to give him a present and pronounce his name correctly.\nRepresentative Greg Kennard, happy birthday to you.\nWe're going on now to announcements.\nFirst of all, if you have pages you need to be up here at the\nrostrum with the pages.\nWe're doing page photographs.\nA little bit quick today.\nChair recognizes Chairman Beverly, the chair of the\nminority caucus for an announcement.\nThank you, Mr. Speaker.\nThe Georgia House Democratic Caucus will be meeting immediately\nand room 216, we will have lunch, room 216 and immediately upon adjournment.\nThanks, Mr. Speaker.\nChair recognizes the chair of the Public Safety and Homeland Security Committee,\nChairman Hitchens for an announcement.\nThere will be a joint meeting of the House and Senate Public Safety Committees at 130\nin capital 450, the GBI is going to put on a program\nabout gang activity in the state of Georgia.\nMr. Chair, recognizes Chairman Dempsey for an announcement?\nmorning. On your desk members, thank you, Mr. Speaker, for calling on me. On your desk,\nyou will find this about lunch today. I know there are a lot of meetings going on, and\nyou might not be able to eat. But if you love babies, if you love children, you should\nmake it a point to cross the street and go hug a few of them. There are some great pictures.\nYou can see them right there as I look at it. Looks like they took pictures of two senators\nlast year. So let's see what we can do about getting some house members to go\nacross the street and support the great work that Gears does and the mothers\nthat are here with their children and their strollers to remind us of how\nimportant they are in every decision we make. Thank you, Mr. Speaker. I yield\nthe well. Chair recognizes representative Wilkerson for an announcement. Thank\nyou Mr. Speaker. The Cobb County legislative delegation will meet at noon in CLOB\n6.05 and lunch will be served. We're going to hear from\nKennesaw State University and Chattahooji Tech. Thank you.\nChair recognizes Chairman Penny Hauston for an announcement.\nThank you, Mr. Speaker. The economic development\nservicemenity and appropriations will meet this afternoon at\n1 o'clock and 515 CLOB. Thank you.\nChair recognizes the majority leader of the House for a motion.\nMr. Speaker, I move that this House stand adjourned until tomorrow at 10 a.m. Tuesday, January\nthe 28th, 2020.\nThe majority leader has moved that this house be adjourned until Tuesday, January 10th,\n28th at 10am.\nAll in favor of the motion will say aye.\nThose opposed will say no.\nThe ayes have at this house will be adjourned until Tuesday, January 28th at 10am.\nYou\n",
  "updated_at": "2026-02-12T16:14:43.433838+00:00"
}