{
  "video_id": "t9uZj_Ry8PE",
  "url": "https://youtu.be/t9uZj_Ry8PE?t=1081",
  "title": "Georgia House - Day 3 (2026-01-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": "2026-01-13",
  "duration_minutes": 127,
  "summary": "Here is a summary of the Georgia House session from 2026-01-13:\n\n**Overview**\nThis session featured a devotional and patriotic performance, but no substantive legislative action was recorded in the transcript provided.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The Speaker announced a special performance of the national anthem by Shelley Williams, a college student and Georgia National Guard member.\n- Reverend Steve Jones, the pastor of Turnip Town Baptist Church, delivered the opening devotional. He spoke about the glory of heaven and quoted scripture.\n- Reverend Jones recognized several state representatives in attendance, including Rep. Ballinger, Rep. Momtahan, and Rep. Skoggins.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe Speaker noted the doors were locked, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not provide an adjournment time or date for the next session.",
  "transcript": "The arrow convening having arrived all members of this house will please report to the floor of the house and take your seats. All members will please report to the floor of the house and take your seats. The clerk will please ring the bell. We're about to have the morning roll call. All members will report to the floor and take your seats. We're about to have the morning roll call. All members of this house present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted. Have all members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning. See this is legislative day three. We're getting closer to the end. Relatively speaking. Let me make an announcement before we have our devotion. We always try to have a little special treat early in the session, usually on the first day, but I don't, there weren't very many people here the first day. I thought about the second day and I thought, well, I want them to hear this and they probably will be too exhausted to listen. After the devotion, before we do the pledge, we are going to have a special performance of the national anthem. That will be given by Shelley Williams. Shelley is a college part native who serves with and has been with the Georgia National Guard for 12 years as a soldier and family readiness specialist. I heard Shelley last fall at a program and I told my staff, I said, we've got to get her for the house. She is amazing. So is our chaplain today. She does the national anthem and we will do the pledge to the flag and then we will continue with our business. It's a real honor for me to introduce the chaplain today. You know, at the foot of Walnut Mountain in Gilmer County, Turnip Town Baptist Church sits as the anchor and beacon for an entire community and has for many, many generations. Much of the reason now is the pastor, the Reverend Steve Jones, a good and decent man, a plain spoken man of God who is not afraid to proclaim the gospel. And he is a great friend of both myself and my family. This is how good a friend he is. Representative Ballinger, are you in here? She's not here. He doesn't live in my district. He lives in Representative Ballinger's district. So I hope maybe you see him get to visit with him while he's here. But I think you're going to enjoy hearing from him. It's an honor to introduce to you at this time our chaplain of the day, Reverend Steve Jones, the pastor of the Turnip Town Baptist Church in Gilmer County. Brother Jones. Thank you, Mr. Speaker. What an honor it is for me to be able to be here today and to be with each one of you. And what a joy it is to know that the Lord is still on His throne. Isn't that a wonderful note? And I thought in a fact of knowing that all is well with our soul if we're in Christ Jesus. I was thinking and I realized that I've only got five minutes is what I've been told. And but I did think when the speaker said for everybody asked them to shut the door, I thought, boy, this is a preacher's dream right here. Man, have a captive audience and the doors are locked. Boy, thank you. I was thinking, thank God for Jesus, right? I'm telling you, it's the liberty. But I want to start off with saying this. I wanted to say what an honor it is to be here with you and what an honor it is to be able to stand here. This is my first time, I'm 53 years old. This is my first time ever being inside the Capitol. My kids have been with the school and they've been and had tours. But it's a real honor for me to be here. And I mean that. But I want to tell you, as we were walking out here, I thought what a great honor it is to be at walkin' out here with my friend and the speaker of this house. I started calling Brother David for an LJ, but the speaker, Austin, I was thinking about how proud that his dad that's already going on to be with the Lord of Brother, Willard, Austin, who served as a deacon for many years at the Macedonia Baptist Church and LJ, and his mom, sister Ernestine Rosten, who is still a very, very faithful member there at Macedonia and still an anchor. He's taught about an anchor, but those folks are the ones that are pillars and anchors in our community there in Gilmer County. And I thank them and I thank them for raising their son in the love and the admonition of God. And I appreciate that so much. I wanted to just make a few things. And I know I've only got five minutes, I know that clock's a ticking. But I wanted to make, I wanted to make mention, I wanted to recognize, as Speaker Austin had said, my representative, representative, a manager. We wanted to say I appreciate your service to our community there in Canton, and I pray that God will continue to bless you, her, along with each one of you. I also wanted to make mention of Representative Mom to Hand from Over in Dallas. He has come, I've been to preach several revivals, or revivals that just preach in several different churches over there. And he has come and supported us. And I wanted to say I appreciate your brother and I appreciate your prayers then. And just to be honest, we, I need them right now too, so I appreciate your prayers. And I've got one more representative, then I'm going to read the scripture and we'll move on. And I don't even know that he even remembers me. But Representative Skoggins from up at Pine Log, Representative Skoggins dad was the pastor of the Carmel Baptist Church in Woodstock when I was saved. Brother Harris Skoggins, and I don't know if Representative Skoggins remembers me or not. But incidentally, when I was 18 years old, the first revival that I was ever asked to come and be a part of, as far as the minister, it was at Representative Skoggins Church at Pleasantville Baptist Church. So with all that being said, let me say I bring warm greetings from Gilmer County and from L.A.J. Georgia, and especially from the congregation of the Turnip Town Baptist Church where God has allowed me for these last seven years to serve as the pastor. And I am so thankful for that and so thankful for them. If the scripture reading today, I'd like to read. I'd like to read in the second, in first Corinthians, the second chapter. And I want to read, I want to talk just for a minute about heaven. Now I realize there's some times that I'm sure ever now, then you'll catch a little of the other from time to time. But I'd like to talk to us about heaven because heaven is a real place. And I want to let me read the scripture and then I'll hurry right along. He said, the Apostle Paul speaking in the second chapter of first Corinthians, he said, but as it is written, I have not seen nor ear heard, neither have entered into the heart of man the things which God has prepared for them that love him. But God, don't get this, but God hath revealed them unto us by His Spirit, for the Spirit searches all things, ye the deep things of God. And I think about this, I think about in the 14th chapter of the book of John where Jesus said this, he said, he said, he said, let not your heart be troubled. He said, ye, you believe in God, and I move a little bit, and I don't know if I'm trying to say right, you believe, you believe in God, believe also in me. And he said this, he said, he said, in my father's house or many mansions, he said, I'm going to go prepare a place for you that where I am there, you may be also. Now I want to ask you a question. Jesus had no reason to lie to His disciples. Jesus had no reason to stand there and tell them a mis-truth. He stood there and said, I want to tell you, I'm going to prepare a place for you, a place called heaven. We find in the 20th chapter of the book of the Revelation, the Revelation that John received. We find this where John talked about the city coming down from God out of heaven, a new heaven, a new earth coming down from God out of heaven, a place that God has prepared for you and I. And I wanted to remind us of all the troubles that are in the world and I look across this crowd. And I want to be honest with you, you're a good looking crowd. I mean, when I came in here, you're friendly, you're a spoke. And I know we all have different ideas and different thoughts about how things, how this ought to be or how that ought to be. But I want to tell you, heaven is a place that Jesus has prepared for those that are prepared to go there. Those that have come with faith and trust in Him, we can go there.\n\nthrough him. The other day the speaker Austin called me and received my invitation to come as I said earlier This is my first time coming here and for all my life for for that I can remember I've went up and down 75 and you know what I saw I saw this big gold dome. I saw the big gold dome, but you know what? Even the big gold dome doesn't do justice To wash inside I think old dome and I want to tell you every trouble every heartache everything that we've ever went through in our life Let's stay with Jesus because heaven is gonna be worth it all Let me finish up my remarks with this tell you a quick a quick account Because if I go too long I might not ever get to come back. So I want to catch I want to cut mine off real quick But let me tell you this Let me tell you to this way I do the church. I'm gonna tell you to real quick You remember in the 10th chapter of the book and numbers Where that Moses you remember how Moses was leading the children of his with their head into the promise land They're I mean that they're heading to the promise that God had made to Abraham and that's what and we're heading to the promise that God has given to us But do you remember this account in the 10th chapter of the book and numbers where Moses is Brother-in-law his name was Hobaiop He come down and he was fixing the head back to his land of his nativity back to his own people And Moses looked at him and said this He said hey Why don't you just come on and go with us? Said the God has promised Israel good and that's what I would say today I'm telling you let's all come together no matter what the initial is after our name Let's just make sure our names are written in the lambs book of life and heaven. That's what matters That's all the things going to matter God bless you. Let me tell you this quick story. Then I'm gonna quit There's a time hey But I seen brother out while he over and I thought I said buddy. I love you go boy. He get up here. He got so let me take this real quick It's a little town. I'm done. I'm done That's look in a little small town That's a little boy. He was poor. He was poor and he didn't have much every day. He come home from school And in that town there was a store that had a big picture glass winter there And every day that little boy would go by and he's seen the new bicycle there And he would press his hands in his face and he would look No one that he couldn't afford that But he could sit there and he would dream and he would hope and he would just think of the time that maybe That he could have that bicycle Well the story goes on few days it went on and the store owner saw him to come out. He said sign He said He was going to say son and you and body man and said when he said son the little boy startled him and scared him to a point To where that when he ran out He ran he ran and he ran out in the road and he got hit by a car. They carried him to the hospital And and the store owner so distraught with what happened he went to the hospital and began to tell the mom And the dad about what had happened and the mom looked at the store owner and said this said I know every day He would come home and he would tell me mama. I would really love to have that bicycle and she would look at him and say son I'm sorry. We can't afford that. We can't afford it So the store owner so moved with compassion went back to the store got the bicycle brought it up her put it beside the little boy's bed and when he woke up with the little boy woke up He seemed to bicycle there and when he saw that bicycle he began to smile And he looked at his mom and he said mama can we afford it? She said son. I'm sorry. We can't But thank God for Jesus on this right here the store owner walked up and he leaned over his son But I can I can afford it and it's all yours And what I said all that is is that we can't afford heaven We can but thank God our Savior Jesus Christ paid the debt that so we could go So God bless you today. I pray that God now me that boy I'm gonna be honest with if I didn't know no better. I think I was in a bad church in L.J. Georgia right now I just say that right now I I see what Thank God for his spirit. Amen. You know what? I say this to all of us come on. Let's go with us Hey man. We head into a good little land. Let's Must understand that for I want let's pray. Let's pray. Let's do that right now. Let's pray God bless you boy. I'm glad to be here. Hey man I Heavenly Father. Thank you for your presence in your spirit Lord that we feel in our hearts I thank you Father that you're on your throne and thank you Lord Jesus that you bled died gave your life and Lord you purchased our soul and washed us and you blood and thank you that when Steve Jones couldn't pay the debt Lord that you paid it for us and thank you for heaven and thank you for loving us Thank you for this place. I pray to bless these folks Lord here in this chamber bless speaker rostin Lord bless brother David our free end and Lord I pray that you bless Lord all the people around this state bless people around this world in Jesus name. Hey man Michelle Williams with the Georgia National Guard Oh Oh say can you see by the dawn's early light What so proudly we hail at the twilight's last gleaming whose broad stripes and bright stars Through the perilous fight Oh the rappers we watched were so gallantly streaming Have the rocket's regular The bombs bursting in a Gave proof through the night That our flag was still there Oh say does that star-spangled banner yet wave Will the land of the free and the home of the brave Please Will let's say the pledge star flag I pledge allegiance to the flag of the United States of America and to the Republic for which it stands One nation under God Indivisible with liberty and justice all Doorkeepers will unlock the doors You You You You The chair recognizes chairman hogan the chair of the committee on information and audits Thank you mr. Speaker your committee on information and audits has read the journal of the previous Legislative day and found it to be correct and furthermore mr Speaker there are only two days in a year that nothing can be done one is just a day and the other one is called tomorrow So today is the right day to love believe and do and mostly live Dolly Lama The Chairman hogan the chair of the committee on information and audits Reports at the journal of the previous legislative day has been read and found to be correct Is there any objection to the confirmation of the journal? The chair here's none and the journal is confirmed the clerk worry to resolution Establishing the order of business for the day mr. Burns honor 59th was following me establishes the order business Third first part of the period unanimous consensus Introduction of bills and resolutions first reading and reference of house bills and resolutions second reading of bills and resolutions Morning orders Is there any objection to the adoption of the resolution Establishing the order of business for the day The chair here's none in the resolution is adopted First reading of bills and resolutions the clerk worried House bill 865 by rubs on curvy the 114th built me town and act to amend title 34 the fiscal Georgia annotated relating a labor and industrial relations industry and labor House bill 866 by rubs on curvy the 114th built me town and act to amend chapter 9 to title 34th fiscal Georgia annotated relating workers compensation industry and labor house bill 875 by rubs and voting the 60 second McLean in the hundred the scope field the 60th robbers and 52nd Davis the 87th and others Will be talented act to amend dark three chap delayed time 34 of the fiscal Georgia annotated relating administration of employment secured the industry and labor 76 by rubs and the biglin 116th curvy the 114th gains 117th Bill being taught an act to amend the act providing authority for members of the Board of Education of Barrow County Enter governmental coordination The intergovernmental coordination The 78 by rubs and the pronounce of the 77th Scott of the 76th go field the 60th based more than 63rd Neil 74th and others Bill be talented act to amend the act creating a state court of Clayton County The intergovernmental coordination house bill 879 by rubs and the pronounce of the 77th Scott of the 76th go field the 60th based more than 63rd and Douglas 78th Bill be talented act to amend the act establishing a civil service system for the employees of Clayton County The intergovernmental coordination house bill 888 by rubs and next to the 69th check is the hundred thirty second to Smith and the hundred thirty third Bill be talented act to amend the act providing for the reconstitution of the Board of Education of Troop County Enter governmental coordination house bill 818 1 by rubs and the Williams and the 115th and curvy the 114th built me talented act to amend the act creating board of commissioners of Walton County The intergovernmental coordination house bill 818 2 by rubs and the Williams and the 115th and curvy the 114th built me talented act to amend the act providing for districts for the election of the Board of Education of Walton County The intergovernmental coordination house bill 883 by rubs and the camera and the first and tariff and the second bill be talented act authorize the governing authority the city of Rossville to love me next size tax The intergovernmental coordination house bill 84 by rubs and it built in the 112th Hitchens, 116th 60th 60th floor is one of the 72nd hole come to the 81st and next to the 69th Bill be talented act to amend chapter one in title 43 the fish go to Georgia annotated relating the general provisions and professions and businesses regulated industries house bill 85 rubs and a belt and the 112th Hitchens, 116th 60th floor is one of the 72nd hole come to the 81st and next to the 69th Bill be talented act to amend part 13 of article 6th chapter 2 in title 20 The fish go to Georgia annotated relating in organization to schools and systems under the quality basic education House bill 86 by rubs and a pile of the 32nd lever to the 33rd chasperist the 11th washburn to the 141st Smith to the 18th and others Bill be talented act to amend chapter 2 a title 21 of the fish go to Georgia annotated relating primaries and elections governmental affairs Absolutely 87 by rubs and if Stevens on 64th of Bill be talented act to amend Code section 4857 of the fish go to Georgia annotated relating assessment of tangible property Ways and means hospital 88 p.m. It's an autonomous the 21st as per the 11th way to the 9th Carson the 46th pile of the 32nd and others Bill be talented act to amend title 20 the fish go to Georgia annotated relating education Education House bill 89 by rubs and a pockets the 27th will be talented act to amend and act to embody districts for the election of the Board of Education Hall County Enter governmental coordination House bill 890 by rubs and gains the 117th weed hour of the 119th will be talented act to amend and act providing for the unification of the existing government governments of city Athens and Clark County Enter governmental coordination House bill 891 by rubs and a Williamson the 115th and Williamson the 148th will be talented act to amend chapter 1 to title 7 the fish go to Georgia annotated relating to financial institutions Banks and banking hospital 892 by rubs and a Mitchell 106 Hutchins of the 107th Scott of the 76th Beverly the 143rd 88th and others will be talented act to amend sub part 1 to part 2 of Article 16 to chapter 2 Title 20 the fish go to Georgia annotated relating to corporal punishment Education House bill 893 by rubs and next to the 69th Smith in the 70th Park here 137 It's Smith 133rd. There'll be talented act to amend part 2 of Article 3 of chapter 8 to title 12 the fish go to Georgia annotated relating to hazardous site response Natural resources and environment House bill 894 by rubs and a VOD the 62nd by rubs and a 5th Park with a hundred nath Hutchinson to 107th and more than 95th and others There'll be talented act to amend article in chapter 7 title 44 the fish go to Georgia annotated relating to general business regarding landlord intent Judiciary House bill 895 by rubs and a crow the 110th gunner or the 8th Thomas the 21st Smith in the 18th Bill be talented act to amend chapter 16 and title 17 the fish go to Georgia annotated relating to discovery and criminal procedure Judiciary non civil House bill 896 by rubs and a crow the 110th and holds the 129th Bill be talented act to amend code section 485 40 the fish go to Georgia annotated relating the definitions for property tax Ways and means Intergovernmental organizations Bill 898 by rubs and a Thomas the 65th go to the 62nd Maynard the 56th McLean to the 100th Buckner the 137th and others Bill be talented act to amend chapter 2 a title 34 the fish go to Georgia annotated relating to the Department of Labor Industry and Labor House bill 899 by rubs and a Williams in 115th Williams 48th Wilkerson to the 38th Bill be talented act to amend title 13 in the fish go to Georgia annotated relating to contracts Judiciary House resolution 571 by rubs and a Stephen's on 64th resolution proposing an amendment to the Constitution Ways and means House resolution 572 by rubs and a burnout with a 76 Scott in 76 go field the 16th base more than 63rd and blank in the 75th a resolution recognizing gold star fathers of Georgia Transportation House resolution 573 by rubs and burnout in the 77th Scott in the 76th go field the 60th Bays more than 63rd and Douglas the 78th A resolution dedicating the Arnold Fountain professional club highway Transportation House resolution 574 by rubs and a Jones the 53rd resolution honoring the lives of reverend Joseph Jones see year in Darnell Jones Transportation that completes first readers Before we go on to the next item of business the chair wanted to remind the members Listen up now. I've got to reminder that uh Covid testing is still going on downstairs and will for about another 16 minutes so um Anybody that hasn't been tested you still got a few minutes before the state of the state to get that done Second reading of bills and resolutions the clerk will read House bill a 70 by rubs and tankers leave the 160th parish for the 158th Burns of the 159th the bill to amend and act creating a board of commissioners of bullet county House bill 871 by rubs and tankers leave the 160th parish of the 158th burns of the 159th A bill to amend and act providing for the reconstitution of the Board of Education of bullet county House bill 872 by rubs a park of the hundred and first clerk of the hundred and eight acclaim at the 100th Kendrick of the 93rd Kendrick of the 102nd and others a bill to amend and act related to the education Distraints for the election of members the Board of Education of Winnett County House bill 873 by rubs a park of the hundred and first clerk of the 108th but claim of the 100th Kendrick of the 93rd Kendrick of the 102nd and others A bill to amend and act creating a board of commissioners of Winnett County House bill 874 by rubs and nicks of the 69th A bill to amend and act providing for the election of members the Board of Education of herd county through second readers Reports of standing committees the clerk were read I'm sorry, I'm darling Taylor and I'm the 3rd District Chairman and Committee on governmental affairs submitted the following report We speak your committee on governmental affairs is on consideration the following bill of the house You struck to me to report same back to the House following recommendation House bill 841 due passed by committee substitute I respectfully submit a remission of darling Taylor and I'm 73rd District Chairman That completes the reading of the reports of standing committees What purpose does chairman tanker slay rise? Mr. Speaker I'd like to make a motion State your motion I move the House bill 797 be recommitted to intergovernmental coordination committee Chairman tanker slay has moved the House bill 797 Be recommitted to the intergovernmental coordination committee of the clerk will read the caption House bill 797 my rose of gains 117th and others to be titled act to amend the act to grant residents of clerk County in the Clark County school district upon their homesteads and exemption of $10,000 from certain ad belorum taxes On the ladies motion that House bill 797 be recommitted to The intergovernmental coordination committee is their objection is their objection the chair here's none and it is so ordered Okay, if I could have your attention please We have a very limited amount of time, but we're going to try to get through the morning orders The chair will limit strictly limit the morning orders today to one minute each so that we can uh get those completed before We have a lot of guests show up the chair recognizes Representative burnout for a morning order Thank you mr Speaker this morning representative Sheila Jones via la Davis and the Jackson and I are here this morning To celebrate the 109th Founder's day of our beloved sorority delta sigma theta sorority incorporated delta sigma theta sorority incorporated was founded on January 13 1913 by 22 collegiate women at howell university to promote academic excellence and provide assistance to those in need Today we'd like to say happy founder's day to all the deltas in the state of Georgia especially those in the east point college park I love the chapter. Thank you Okay listen up chair is Going to appoint a committee of escort To go down and escort the governor up to the chamber here momentarily The members appointed to the committee of escort are as follows Representative bonner of the 72nd Representative lot of the 122nd Representative Mcdonald from the 26th Representative meeks from the 178th Representative gains from the 177th Representative fry from the 118th and representative wheat hour from the 119th If you haven't already then report downstairs to the 2nd floor chair recognizes for a morning order representative Hugoly Thank you mr. Speaker ladies and gentlemen of the house. I've come this morning on behalf of representative Smirie he wants me to announce that the Martin Luther King junior advisory council will host the 37th annual Martin Luther King celebration of service on Friday at 130 in the north wing There will be limited seating, but you can also participate virtually as well. So let's help Represents is marry out and show your support. Thank you You Chair recognizes for a morning order Representative holly Representative holly He doesn't appear to be here so we're gonna We'll see if he's here tomorrow You You You Members of this house Members of the house Will please report to the floor and take your seats Members of the house Let's hurry it alone You Members of the house will please take your seats I may have to send the governor into the any room in there to give his speech Madame doorkeeper Speaker the president the president pro-team and the members of the senate are way to entrance to the house chamber Madame doorkeeper Please allow the president the president pro-team and The members of the senate to enter the house chamber and will the messenger please escort them to their designated seats You Please Please I think it's a secret. I think it's a secret. Well, I think it's a secret. It's very much dropped from you. I think it's a secret. It's a secret. I think it's a secret. It went to about $3 million on the table. I think it's a secret. No. I think it's a secret. Hey, David. How are you doing? I think it's a secret. No. Sorry, I didn't forget. I'm sorry, I'm sorry. We're all dead. We're all fine. We're fine.\n\nAll members of the House and our guests do please find seats immediately. Madam Dorkieber. Mr. Speaker, the Honorable David Enomias Chief Justice of the Supreme Court, the Honorable Michael P. Boggs presiding Justice of the Supreme Court and the Honorable Amanda Mercer, Vice Chief Judge of the Court of Appeals, away entrance to the House Chamber. Madam Dorkieber, please allow the Honorable David Enomias Chief Justice of the Supreme Court, the Honorable Michael P. Boggs presiding Justice of the Supreme Court and the Honorable Amanda H. Mercer, Vice Chief Judge of the Court of Appeals of Georgia to enter the House Chamber and will the messenger please escort them to their seats. Madam Dorkieber. Mr. Speaker, the Honorable Brian P. Camp Governor of Georgia, his Committee of Escore and Distinguished Guests, away entrance to the House Chamber. Madam Dorkieber, please allow the Governor of Georgia, his Committee of Escort and Distinguished Guests, access to the House Chamber. Members of the House and the Senate, this joint session will come to order and the clerk will read a resolution. House Resolution 569, where represented burns the 159th, a resolution calling a joint session of the House of Representatives and the Senate for the purpose of hearing a message from the Governor, inviting the Justice of the Supreme Court and the judges of the Court of Appeals to be present at the joint session and for other purposes. Mr. Speaker, it's my honor at this time to recognize some distinguished guests that are with us today, beginning with our Constitutional Officers for the State of Georgia. All the Constitutional officers that are here, please stand or raise your hand and let us honor you. Members of the Consular Corps, let's give them a hand. A truly great partner of mine and has been since the beginning of me having this position, the Speaker Pro Tem of this House, Speaker Pro Tem Jan Jones. My friend who we raised upright here in this chamber and he has served with great distinction in the Senate as the Lieutenant Governor and as a individual who I know follows that which he believes to be right. And that is very rare today in political life. Please welcome the Lieutenant Governor of Georgia, Jeff Duncan. The distinguished President Pro Tem of the State Senate, Bitch Miller. A lady who has served alongside her husband is with great distinction and has been a real credit to this state and we're going to miss very, very much the First Lady of the Senate, Brooke Duncan. I've got a long introduction for this next one here but I'll just say she is about the greatest thing I've ever known. This lady of the House, Sheree Rolston. A truly tireless advocate for working on some very important causes in our state and I know has been front and center on issues like human trafficking and so many other important initiatives that I know are important. The Governor important to the entire state and we appreciate very, very much her service and that of the entire family. Just give a big hand to the First Lady of Georgia and the camp family. It is now my true honor to introduce an individual that I've had the pleasure of working with since he came into office and for actually for years before and I can tell you that he has had some challenging times this term. I can also tell you that he has mastered those challenges whether it was COVID, the other little issues that we've had to deal with. From within and without the state I might add, he has maintained great class and dignity and has kept focused on moving Georgia ahead regardless of how much noise there was, how much chatter or all the distractions and I'm very proud of the job he's done and I'm proud that he is our Governor and look forward to his continued service. Please welcome to the podium, Georgia's 83rd Governor, Brian Kemp. Thank you very much. I'm still hung up on what the speaker said about Marty and the girls. Lieutenant Governor Duncan, Speaker Ralston, President Pro Tem Miller, Speaker Pro Tem Jones, Members of the General Assembly, Members of the Judiciary and my fellow Georgians. Three years ago and I stood before this body and the people of our state for the first time as your Governor. I said I know there will be adversity, those who want to tear us down. There will be difficult days and dark nights but together we will overcome. Like Coach Henderson said, it can be done. Standing before all of you today in the final year of my first term in office, I didn't know then how true these words would become. But just like I saw all those years ago under the Friday night lights at Clark Central High School, legendary football coach Billy Henderson was right again. Despite the device of politics, the pandemic, the unforeseen challenges, the tough obstacles that stood in our way, we pulled together and lend a helping hand to our fellow Georgians improved it could be done. As Psalm 168 says, I've said the Lord always before me because He is at my right hand and I shall not be shaken. Over the last three years we built Georgia's house on a firm foundation. The concrete, the frame and the roof with stood the storms and we emerged resilient. We boldly seized the opportunity of plant seeds for the future in good soil so a bountiful harvest would bring our state brighter, more prosperous days ahead. Thanks to that approach and our work together, our state has celebrated unprecedented success. By keeping our state open for business, bringing record levels of jobs and investment and fighting to put hard work in Georgians first, we now have the opportunity to build a safer, stronger Georgia fruit for all who call the Pete State home. In September of 2018, I unveiled my plan to raise teacher pay in our state by $5,000. At that time, Georgia ranked 23rd in the country in annual salary for our educators. In a statewide survey showed that 44% of hard work in Georgians leading our classrooms would leave the profession within the first five years. Today, three years after we came together and passed a $3,000 down payment on that promise, educators and students face a challenging future. Parents, teachers and administrators are across our state are doing their best to help students overcome learning loss due to the pandemic. Students from all walks of life are confronted with mental health struggles. Teachers are asking or asked to do more and more every year. And the need for a world class K through 12 education to prepare our children forever for the ever changing workforce has never been greater. Throughout my first term, I've had the honor of attending teacher listening sessions in regular meetings with groups of superintendents and school board members from across the state. In those discussions I've got to know and also understand the struggles, the successes and the needs of different school districts in every corner of Georgia. The hard work in Georgians in our schools, the school staff, administrators, bus drivers, cafeteria workers, and teachers all do a terrific job of keeping our kids safe and investing in their futures. To support their heroic efforts day in and day out, I believe that we as state leaders must continue to do everything we can to ensure they have the resources necessary to fulfill their mission and prepare the next generation of leaders for successful lives and careers. That's why my fiscal 2023 budget proposal will include the final installment of $2,000 to finish out the largest pay raise in state history, a total of $5,000 since 2019. This $2,000 raise will impact K through 12 teachers, assistant teachers, and pre-K teachers, who I think we can all agree have gone above and beyond for their students throughout the pandemic. In addition, my amended fiscal year 2022 budget will recommend a one-time pace supplement of $2,000 for full-time state-funded instructional staff, school support staff, and school administration. In a $1,000 one-time supplement for school bus drivers, nurses, nutrition workers, and part-time employees, let's all take a moment to thank them for all that they have done for our students and our state. Additionally, a priority for conservative leaders under the Joll Dome, including myself for many years, has been to appropriately fund the state school funding formula. These dollars are sent directly to schools in every corner of Georgia to hire more teachers, reduce class size, and ensure every child receives a quality education. My fiscal year 2023 budget proposal will recommend adding $425 million to fully fund our schools, and completely restore all our austerity cuts to education funding in our state that were made during the pandemic. This key priority will collectively provide an additional $1.4 billion in direct funding to our K through 12 schools. And invest more per K through 12 students than ever before. When it comes to education in our state, it's a lot more than just money and resources. As appearance of three daughters, one of who is a public school teacher, Marty and I are also concerned about what we're seeing across the country. From the classroom to the ball field, there are those who want to divide our kids along political lines. Push partisan agendas and indoctrinate students from all walks of life. This is wrong, it's dangerous, and as long as I'm governor, it will not take root in our state. That's why I'm looking forward to working with the members of the General Assembly this legislative session. To protect our students from the vice-ebiologies like critical race theory that pits kids against each other. I also look forward to working with the House and the Senate to pass and sign a parental bill of rights in our education system and other pieces of legislation that I strongly support to ensure fairness in school sports and address obscene materials online and in our school libraries. I believe I believe by working together this legislative session will be a historic one for education in our state because building a safer, stronger Georgia starts with putting students and parents first. During my campaign for governor, I told Jordan I would focus on bringing an innovative solution to many health care challenges, not just to expand a one-size-fits-all broken government program. That's why I worked alongside members of this body to craft Georgia's centric solutions through the patient's first act. That would increase access to coverage for our most vulnerable, while also lowering costs for millions of Georgians. Today we're seeing the benefits of that plan across the state. When I signed the bipartisan patient's first act in 2019, Georgia had only four health insurance carriers offering plans in the individual market. Today we've nearly tripled that number with 11 carriers offering plans for 2022. In 2019, only 26% of Georgia counties had more than one carrier offering insurance on the individual market. Now in 2022, 98% of all counties have more than one carrier, which means expanded choice and lowered costs for hard work in Georgians. Overall the state's $130 million investment in Georgia access included in my budget proposal this year has helped reduce premiums by statewide average of 12%. That's $850 an annual savings for Georgians on the marketplace today. And in rural counties where premium prices were highest, choices and coverage were few, and options for care were limited. The re-insurance program has contributed to premium reductions from 25% to over 30% in some counties. For a 50-year-old Georgian buying a silver plan on the marketplace, that translates into annual savings from $2,500 to over $4,300 a year. I'd like to thank insurance commissioner John King for his work alongside my office to implement these reforms and deliver results for Georgia families. And while the Biden administration plays politics, in Georgia, we're making health care more affordable for millions of our citizens. As we lower insurance premiums, it's also vital that we have more doctors for Georgia to see for care. Physicians and nurses are in short supply across the country, but especially in rural Georgia. That's why my budget proposal includes an initial $1 million for the university system of Georgia to expand nursing programs up to 500 students annually over five years. In funding for our technical college system, to grow their partnership with Allied Health, to serve up to 700 additional students annually. My proposal will also invest $2.5 million for 136 residency slots, and allocate $1 million to Mercer University to address rural physician shortages. With these key investments, we hope to add 1,300 additional health care practitioners in our state. Before I go on, let's pause and take a moment to thank all of our health care heroes in Georgia for their tireless dedication and hard work over these last two years. In fiscal year 2021, my office worked alongside the members of the House on an important priority of theirs to expand Medicaid coverage for new mothers to six months. During on that success, my budget proposal includes a priority of members of the Senate to extend that coverage to the full year to ensure these new moms are able to receive medical care at a critical time for their health and their long-term well-being. And to continue Georgia's protection and celebration of life at all stages. I believe it's vitally important that we continue to work together to strengthen our state's foster care and adoption systems. My budget proposal will include nearly $28 million to allocate a 10% provider rate increase for all foster parents, relative caregivers, child caring institutions, and child placing agencies. This has been one of the most rewarding issues my office has tackled with members of both chambers. And I want to take a moment and thank the members here today and those who are no longer serving for their bipartisan efforts to put Georgia's children first. Thank you all very much. To build a safe or stronger Georgia, we must ensure every Georgia feels safe and secure in their communities. As I announced last week, I believe that starts with fully recognizing the constitutional rights granted to law-biting Georgia's in our founding documents. And I look forward to supporting constitutional care legislation this session. Together, we made wise investments in public safety over the last three years by creating the anti-gang task force within the GBI, passing bipartisan human trafficking legislation to hold criminals accountable and support victims and funding the crime suppression unit. We have shown our state's commitment to reducing crime and ridding our streets of gangs. The anti-gang task force in particular has been hard at work, and I'm very proud of the brave men and women of the GBI and all they have accomplished under the leadership of Director Vic Reynolds. But in too many jurisdictions across our state, soft-done crime local governments and prosecutors have been unwilling to join the fight to rid their communities of these criminal networks. With many urban and some rural counties facing alarming levels of violent crime, we have the responsibility to act. To provide additional assistance for GBI's efforts to dismantle criminal street gangs, my budget proposal will include funding for a new anti-gang unit in the Attorney General's office, which will allow Attorney General Carter to direct some more resources in prosecuting gang statewide. In my office, we'll also be supporting enabling legislation that gives the Attorney General the authority to partner with the GBI and local law enforcement officials in investigating and prosecuting these dangerous criminals. To streamline case backlaws due to the COVID-19 pandemic, and ensure prosecutions can obtain evidence as quickly as possible, my proposals will recommend over $7 million to upgrade GBI crime lab equipment, begin improvements to GBI headquarters, and provide an additional 32 staff in the Crime Lab and Medical Examiner's office to address their increased volume. This investment follows $110 million in federal funds that my office allocated to the judicial system back in October of this year to swiftly address delayed cases. Justice delayed is Justice denied, and we will provide every resource necessary to ensure the courts and prosecutors have the information that they need. Because safer communities lead to stronger communities, and together I know we can build on our significant progress over the last three years. On the front lines of our mission to build a safer, stronger Georgia is the Department of Public Safety, and our brave men and women in blue and gray. One of the greatest honors of holding this office is seeing these heroes work each and every day to protect our communities and patrol our roadways. From ensuring peaceful protesters were kept safe and restoring order to the capital city in the summer of 2020, to hunkering down through a global pandemic and serving as the tip of the spear in our crime suppression efforts here in Atlanta, the Department won above and beyond the call of duty every time. To bolster their critically important efforts, my budget\n\nPuzzle will include $3 million to support an additional Trooper School class of 75 cadets this coming year. I'd like to thank Colonel Wright and his team for all that they continue to do for our state. I think most of you in this chamber would agree it has never been harder to wear the uniform. Unfortunately in the face of some local government and activist opposition to law enforcement across the country, I believe some hard work and Georgians may be hesitant to enter the workforce wearing blue. To ensure we recruit Georgia's finest to protect our communities, my office has asked Commissioner Greg Dozer of the technical college system of Georgia to add law enforcement and criminal justice degrees to our high demand career initiatives. This aims to provide a free tuition to over 1,000 Georgians looking to obtain those degrees at our technical colleges. As you all know at the end of last year, I was proud to join many of you in allocating a thousand dollar bonus to our law enforcement and first responders across the state. As my office released last week, I'm also proud to say that my budget proposal will include a $5,000 raise for state law enforcement and other state employees. These brave men and women have been on the front lines of a truly unprecedented time in our state's history from civil unrest to a global pandemic and we could not be more appreciative of all that they do to keep our families and our communities safe. And I want everyone to know as long as I'm Governor, I will always back the blue. I hope you all again will help me recognize all these hard work and men and women across our state for their efforts. No issue to improve the safety and well-being of Georgians has had more bipartisan support than the top priority of our First Lady. Would you all join me in thanking Marty, the girls in the Grace Commission for their great work to end human trafficking in our state? Under Marty's leadership alongside co-chair Speaker, Pro Tem, Dan Jones and GBI Director Reynolds, the Grace Commission has changed the conversation around human trafficking. Our reminding Georgians that men and women trapped in this evil industry need our help and our compassion, not another blind eye turn. With the strong support of the members of the General Assembly and state law enforcement, including Attorney General Chris Carr, they have championed reforms that now give survivors a fighting chance, a place to shelter and a path back to the life they wish to lead. The Grace Commission has also pushed for tougher penalties on those who break our laws and enslave others into a life in the shadows. I'd like to thank every member, Republican and Democrat, for their votes and support of these new laws. However, our work here is not yet finished. Unfortunately, many criminals making their living destroying the lives of others are able to quickly get back out onto the streets and begin praying upon young women and men within hours of their initial arrest. That's why our First Lady and the Grace Commission will be bringing forward legislation to add human trafficking to the list of serious violent and sexual offenses that require a superior court judge to grant bail. Making these common sense bipartisan reforms to our criminal justice system to protect our most vulnerable is yet another way we can work together to build a safer, stronger state for generations to come. Nearly two years after the first case of COVID-19 was detected in Georgia, millions are vaccinated and our economy is roaring back faster and stronger than other states across the country. In fact, the Pete State is leading the nation in economic recovery because Georgia protected both lives and livelihoods. Our best and most prosperous days are ahead. Our unemployment rate is at record lows, outpasting most of the country, including our fellow states in the southeast. Jobs and investment numbers are through the roof, companies from around the world have Georgia on their minds. Small businesses are bouncing back, and we just celebrated the largest single economic development project in state history. These achievements did not happen by accident. Georgia is on the move because we chose freedom over government shutdowns. We trusted our citizens to be part of the solution instead of part of the problem. We continued to fight unconstitutional federal mandates that forced hard work and Georgia to choose between their livelihoods or a COVID vaccine. We stood up for our job creators and their employees and ignored the partisan attacks from the left, the national media, and those that seek to divide us for financial or political gain. We made the tough decisions because they were the right ones. We put hard work in Georgia and their families first because that's what we all were elected to do. Nearly five years ago and I announced my campaign for governor, I made this promise that I would run on the agenda that would put them first ahead of the status quo. I would tell voters what I wanted to do as their governor and if they chose me and my family to serve them for four years, we would go to work for them every day and do it exactly that. Marty, the girls and I are deeply honored by the trust a record number of Georgia's placed in us back in November of 2018. With the Lord before us, we set out to do the job that you all hired us to do. And whether you voted for me or not, I have thought hard to live up to the commitments that I made on the campaign trail and ultimately do the right thing even when no one was watching. The bold conservative agenda I've outlined over the last few days prioritizes education, health care and public safety. It invests historic levels of resources in our students and educators. Keeps politics out of the classroom and ensures parents have the final say in their kids' education. It reduces the cost of health insurance for Georgia families, recruits 1300 new nurses and doctors into communities where they're needed the most and gives new mothers expanded access to medical care. It incentivizes more Georgia's to enter a career in law enforcement, redoubles our efforts to dismantle violent gangs and combat human trafficking, and strengthens Georgia's constitutional rights to protect themselves and their families. It turns promises made into promises kept. The plan for a safer, stronger Georgia puts hard work in Georgia's first. And ensures our state will continue to be the best place to live, work and raise a family for generations to come. Over the last three years, we've shown what this team can accomplish, even when enormous obstacles have stood in our way. By working together throughout this legislative session, I know it can be done again. So thank you, May God continue to bless you and bless this great state that we are honored to live, work and raise our families in. Thank you very much. Will the Committee of Escort please escort the Honorable Brian P. Kemp, Governor of Georgia and his distinguished guests from the House Chamber? The Chair recognizes the Senate President Pro Tem for a motion. Mr. Speaker, the Honorable David Rolston, I hereby move that this joint session of the Georgia General Assembly be here right dissolved. The Senate President Pro Tem has moved that this joint session be dissolved. All in favor of his motion will say aye. Those opposed will say no. The ayes clearly have it. And this joint session is hereby dissolved. House members will remain here in the chamber. This House will come back to order. All right, we have some announcements. We have announcements. Listen up for the announcements. Come to order. If you signed up for an announcement, be ready to go. Because he's ready to go, the Chair recognizes representative McClain for an announcement. Thank you, Mr. Speaker. The working family caucus will have their first virtual meeting today at 1 o'clock and you can stop by room 307 and pick up your lunch. And today we'll be talking about issues facing working families and men and women in Georgia. Room 307, 1 o'clock. Thank you. Thank you. Chair recognizes chairman Darley Taylor for an announcement. She waves. Chair recognizes chairman England for an announcement. Well, good afternoon. Morning, steel. Ladies and gentlemen, I know that as tradition holds after the governor gives the state of the state address, we also have the distribution of the budget books. So if you will, be watching your emails after a while. We'll get the instructions out to you on how to come claim those and remember only one copy per member. Be sure to put your name in the or on the cover. Because if you lose it too bad, you'll be looking online for everything else because we'll only get one copy per member. Again, the budget books. The two leaders are giving me a hard time up here. So thank you, Mr. Speaker. Down in room 216 until 2 o'clock today, the family health centers of Georgia, the Florida Health Center, are offering boosters for anyone who's been more than six months since your vaccine. You need to get a booster. It's the best way to say safe. They also have some take home tests that they'll give you as well. So two ways to stay safe. Those are available in 216 until 2 o'clock. Chair would encourage everybody to go take advantage of that. Chair recognizes the majority leader of this house for a motion. Thank you, Mr. Speaker. Mr. Speaker, I moved this house stand adjourned until 10 a.m. Friday, January the 14th, 2022. The majority leader has moved that this house be adjourned until Friday, January 14 at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes appear to have it. This house will be adjourned until Friday, January 14 at 10 a.m.\n\n",
  "updated_at": "2026-02-13T08:05:44.957717+00:00"
}