{
  "video_id": "tARlu9pO-Rw",
  "url": "https://www.youtube.com/watch?v=tARlu9pO-Rw",
  "title": "11/29/2023 Senate Study Committee on Truck Driver Shortages",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 19,
  "summary": "Here is a structured markdown summary of the Georgia 11/29/2023 Senate Study Committee on Truck Driver Shortages session:\n\n## Overview\nThe Senate study committee held its fourth meeting to adopt a report on addressing the truck driver shortage in Georgia. The session focused on reviewing the committee's key recommendations.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading) \nNone detected.\n\n## Notable Moments\n- The committee chair provided a brief overview of the committee's previous three meetings held in August, September, and earlier in November.\n- The chair went through each of the 11 recommendations in the report, seeking input from committee members on potential amendments or revisions.\n- There was discussion around the recommendation to provide more funding for truck driver training programs and tuition assistance, especially for non-high school students.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present.\n\n## Adjournment\nThe meeting adjourned. The next session date was not specified.",
  "transcript": "The Senate's study committee on truck driver shortages. This is the meeting to adopt the\nreport. I'm going to ask this real quick briefly. The chairman of transportation and\nfilio open us up in a word of prayer. We'll go through quick review and I'm going to go\nthrough the findings recommendations and we'll probably be out here pretty quick. So\nSenator Dozo.\nOn this journey.\nFather, thank you for today.\nWe thank you for taking the life today.\nThank you for the air in our lungs\nand we're pretty good to use it well.\nJust be polite and true to other people.\nI think it's the opportunity to serve the state\nand the people are pretty good to do so.\nWe're dignity and honor to name you, bro.\nThank you.\nJust to give kind of quick background,\nwe've had this will be meeting number four.\nOur first meeting was August 30th.\nthat grace some power in a higher from Georgia.\nMeeting number two, September 19th at Coca-Cola\nin Union City, Georgia.\nMeeting number three was just a few weeks ago\nhere at the state capitol,\nand then we have meeting number four today.\nI wanna thank Senate Research\nand everyone who has helped put this together,\nincluding the senators and the committee,\nAnna from my office.\nI don't know that I wanna go through the entire report.\nI know some of y'all probably have just gone through it\nand seen it just now.\nIt's roughly 30 pages,\nbut it does capture in pretty good detail\nevery single presentation that was given.\nAnd I know I have gotten recommendations\nfrom I think almost everybody on the committee\nand if there's something here that we need to amend,\nadjust or want to do some word smithing,\nwe can do it as we kind of go through\nthe recommendations on page 27.\nSo as we begin, everybody cool with that?\nOkay.\nSenator Goodsch, you good?\nYou can hear us?\nAll right, I'm just gonna say whatever I say,\nyou're good.\nSo I'm just gonna go through the recommendations real quick\nand then just stop me if you have questions\nor if you think we need to adjust something.\nRecommendation number one is repeal the direct action\nstatute.\nRecommendation number two is recognize\nidentify opportunities to support veterans to obtain CDL licensing and workforce training\nby eliminating fees, tuition or even opportunities for tax relief for veterans in the trucking\nindustry. Recommendation number three, better educate, sorry, better educate young people,\nspecifically those in the 19 to age 24 group about opportunities available for long-term quality\nof life provided by careers in the trucking. Intrug driving a better educate students about scholarship\nopportunities available to pursue CDL courses. The next recommendation is address difficult\napplication processes and insurance requirements required to enter the trucking industry.\nI know there was a lot of discussion on how a lot of that is driven by the feds and I think\nthe constant hand downs from the feds of new rules and requirements that's hampering the industry.\nAnd I think towards the end of this there's I think one recommendation that talks on\nsupport from the congressional delegation and we may want to put something in here if the committee\nwould like. I think just kind of touching on put you know the state of Georgia pushing back on\non some of the unnecessary regs and rules\nthat are being placed on truck drivers unnecessarily.\nNext recommendation, support the Department of Driver Services\nand their efforts to increase efficiency,\nefficiency in administering CDL tests.\nC-measured increases in the use of third-party testers\nfor CDL road skills tests.\nThe next one is requests the Department of Driver Services\nto annually conduct at least four CDL town hall meetings\nseeking input on how to create more efficient licensing\nwithin the trucking industry.\nI know they did one robust one.\nIt sounded like in middle Georgia.\nI think from a data perspective, public participation,\nperspective and industry perspective,\nthese could be a little bit more diverse around the state\nfrom region to region and also seek input\nfrom stakeholders in Atlanta, Metro Atlanta,\nbut also more other parts of rural Georgia,\nincluding Southeast Georgia where I know there's a lot of freight and product coming in through the port to other parts of the state, including I know many of our districts currently.\nThe next recommendation, let's see, assist the technical college institutions with creating more CDL training facilities, explaining driver ranges and testing sites seeking out partnerships with private employers to allow more access to trucks and invest in more faculty to increase.\nand to address the increased student demand\nthat we're seeing, facilitate partnerships\nbetween DDS, TCSG, and other vocational schools.\nThis should say public and private.\nTo offer more flexible third party examinations,\ncertification training,\nallows CDL third party examiners\nto be able to verify that an applicant's CDL permit\nis valid.\ninvestigate opportunities to create\ndue enrollment pathways that feed\ninto internships to allow,\nlet's see, that feeds into an internship\nto allow younger students to obtain miles\nto become an insurable driver.\nI know this was something I think\nSenator Islam you've talked about\nand also Commissioner King has talked about.\nWork with the Georgia Department of Transportation\nto expand truck driving parking options\nand limit unauthorized truck parking\nand investigate how to explain it\nand incentivize more private truck parking options.\nI know the commissioner's office\nand their presentation recognize\nand I think we acknowledge that this is not something\nI think the state can straight up just pay for and fund\nand I think we have to work with the private sector\nto address I think the challenges we're seeing\nwith the lack of availability in certain corridors.\nFor example, Interstate 75, 85, 20,\nas it relates to truck parking along our corridors\nand interstates.\nNext bullet, kind of what I was referring to a little bit\nearlier, it incurs a Georgia congressional delegation\nto commission and fund study by the relevant federal agencies\nto examine the ramifications of shifting\nto an hourly wage system.\nNext recommendation, appropriate more funding\nfor truck driver training programs and tuition assistance,\nespecially for students who are not coming out\nhigh school. I like to come back and talk about that bullet in a minute. I don't remember\nwho submitted that or who submitted that one to get clarity on I think what exactly are\nwe trying to achieve there? Okay, we'll come back to that one. Appropriate more funding\nto DDS to increase salaries for testers and examiners, which had helped their staffing\nshortage and reduce wait times. I know the Commissioner of DDS talked about the workforce shortages and\nretention of employees as it relates to licensing, especially in our industry, trucking industry.\nAnd then the final one revives the Appleville code ordinances regarding warehouses and\nfacilities for truck drivers to include facilities for overnight stay on site as an economic\nlike development tool, and I know that recommendation came\nfrom Senator Jones based on just the industry\nthat I know he sees in his Senate district.\nFirst, are there questions, thoughts, things we should add,\nmodify, and then Senator Aiesel,\nI'm gonna go back to that one,\nif you could talk about that one below a little bit more.\nWe can start there, and then we can just go around the table.\nWe'll start with you.\nWell, I'll speak to the appropriate more funding for driver turning programs and tuition assistance, especially for students, we're not coming not a high school.\nThe reason that I worded it like that is because the average student is much older and so they can't take advantage of the hook grants and so they need tuition assistance for these training programs to be able to complete them.\nSo, I thought that would be a good thing to talk about.\nOkay, so this was because, okay, I got you know, I think that came out of\nour meeting at Coca-Cola.\nOkay.\nThank you.\nChairman.\nChairman Adam Attardi.\nYes, thank you.\nGood.\nYes.\nThank you.\nSo, go back to the discussion on the truck parking in the G doc in\ngovernment, private versus public. I believe there's a there's a role for G dot to play in this.\nI was last week I drove to Arkansas and back for the holidays. And when I got into Arkansas,\nalong interstate 40, I noticed truck parking\nthroughout the two three hundred mile corridor that I drove on interstate 40.\nAnd I would say there were 10 or 12 different pull-offs where they created parking for\ntractor and trailers for overnight parking. Now, they didn't have facilities, they didn't\nhave infrastructure set up that I could see for showers and so forth, but they had places\nfor truck drivers to get off of the interstate park overnight, get their required rest\nin and then pull back out onto the interstate and it was not private property. It appeared\nto be part of the interstate system.\nSo I'd like to have some language in the report\nthat encourages you to look at what other states have done\nwith public funding and not rely just on private funding.\nI think the private funding creates some other challenges\nwith federal highway regulations.\nSo I do know Arkansas had a pretty impressive setup\nthe way they had their park and setup.\nOkay, so let's word smith, that recommendation.\nLet me read it again.\nWork with GDOT to expand public trucking,\nparking options and limit, unauthorized truck parking\nand investigate how to expand or incentivize\nmore private truck parking options,\nsemi-colon, and then let's add, investigate,\nfuture investments by GDOT into public parking options\nor something to add to say.\nSimilar to other states already in progress.\nI believe you'll find other states are already doing it as well, not just Arkansas, but Arkansas was very noticeable and they were being utilized heavily by the truckers.\nSenator Senator does all has a thought to recommend that we change to read work with GDOT to expand public truck public truck parking options and comma modeling usage in other states, comma, and limit unauthorized truck parking.\nOkay. Thank you for that.\nI'll list like staying public from options.\nWomen on the rise.\nInvestigate how to expand and then investigate how other states are.\nSo that's.\nOkay.\nGood deal. All right. We got that captured.\nWhat else thoughts?\nI have a modification.\nOkay, so I don't believe that repealing direct action will is going to have nothing to do with the truck driver shortage, but every other recommendation on here as a direct impact and getting more truck drivers license and mobilized except repealing DA.\nSo I just don't I just don't know how it would create more truck drivers and it's not causing our exacerbating truck driver shortage.\nYeah, I mean, I think that's we've we had that discussion. I think the Senate's had a discussion. I think\nBy repealing direct action the statute itself. I mean we get into I\nThink the increased costs that we're seeing from frivolous lawsuits and things that have been happening in the trucking industry\nSo I think when it gets down to nuts and bolts of quality of life and what does that mean for?\nNot just the drivers, but I think the companies and even some of the smaller companies that are zero to five that are\nMostly family owned, I think those lawsuits are having an impact in terms of what's going on with the workforce in the state. So I think that recommendation is germane.\nChairman, I agree and also you might want to mention that the cost of insurance has risen so rapidly over the past few years that it's creating a competitive issue with other states.\nother truckers to where Georgia is at a competitive disadvantage.\nTherefore, they can't offer their truck drivers as good a wage either.\nTherefore, creating a hardship on being able to recruit drivers,\nthe cause of the cost of their insurance here in Georgia.\nRight.\nYeah, I agree, Senator.\nI mean, I think we heard that in testimony in Hyrum by the commissioner.\nI know we've heard that from trucking companies like Siphon Logistics and\nothers. And I think we've also heard that from a couple of different even defense attorneys\nin terms of the impact that they've seen it have on their clients here in Georgia and across\ncountry. Absolutely. What other thoughts? Yes, ma'am.\nAll right. Back to that written decision about\nevents that were not coming out of high school,\nmake it a little more clear. Okay.\nAnd we can do appropriate more funding for church or training programs,\nespecially for older student, older students who are not recent high school graduates.\nWas that, um, I think what you're saying, like, we're just non-high school graduates and we're trying to catch you up to the center, but it's on.\nYes.\nYeah.\nSo it's just all ages.\nYou know, let me get older, older, older, so older.\nCorrect.\nOkay, awesome.\nAny other recommendations to add or discuss before we adopt?\nSenator Dezle, any questions you good?\nThe only thing I found really compelling was the mention of,\nI believe it was me in Mexico,\nhad an attentionary base six month.\nCDL training program.\nI don't know if they had 100.\nIf you want to express interest in it and I'm wondering if that's something that you want to add to this.\nThat we want to encourage our corrections to a pathway for CDL training.\nOkay.\nI don't really want to add this or I believe this is part of the report already so maybe sufficient.\nWe can add it as a recommendation.\nRaymond, could you repeat that recommendation?\nI'll miss his comment.\nYeah, we're, we're smithing it real quick\nand then we'll read it back to you.\nI was gonna ask him to share my thoughts.\nYeah, you're good.\nSo, at least one understate,\nMr. Lee, I'll say this,\nso you can hear as well,\nthen my microphone is off.\nThey have a six month pathway,\na six month training program for inmates\nwho are good to be released soon.\nAnd so I think that helps a lot of things,\nhelps the recidivism rate.\nIt also helps expand the labor pool for truck drivers.\nSo I think that having department corrections\nlook at an option for a training program\nfor incarcerated individuals,\nhe'll be released soon to help them fast track\ntheir way to receiving a CDL when they are released\nfrom jail, well from prison.\nSo we're going to get that in.\nThank you.\nWe encourage the Department of Corrections to explore.\nExplore implementing a CDL training program for India.\nGreat.\nAwesome.\nGood recommendation.\nAnything else, Senator Gooch?\nAny other thoughts, comments as we close this out?\nNo, I think it's a pretty thorough list.\nAnd it sounds like a good action plan.\nIf we could put some of that into motion this year,\nit would be a big victory for the trucking industry, for sure.\nI agree.\nSenator Islam, anything else?\nNo, I think every recommendation is good,\nexcept for the one I mentioned,\nthat. I don't think it's necessary.\nSorry, we're going to agree to disagree.\nI appreciate that. And I do appreciate all the ones that you've\nsubmitted. You've been highly helpful, thoughtful, and\nengaged. You've been there, remaining. So I appreciate you.\nAll right, I guess with that, I will ask for a motion to adopt the Senate\nstudy committee report on truck driver shortages by the Senate.\nSo moved of motion by Senator dozoz or a second\nCenter is on\nSeconds all those in favor say aye\nAll those opposed\nOne day\nCommittee report is adopted\nThank you\nI would like to also submit a good Senator Gooch.\nNo, I'm good. I'm sorry. Go ahead.\nOkay. Senator is on.\nI was just going to say that I plan on submitting a minority report as well.\nThat's cool. Thank you. Thank you.\nMeeting adjourned. Thank you.\n",
  "updated_at": "2026-02-12T20:13:47.421867+00:00"
}