{
  "video_id": "tasmpNuw9fA",
  "url": "https://www.youtube.com/watch?v=tasmpNuw9fA",
  "title": "Rules Day 38 of the 2025 Legislature Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 24,
  "summary": "Overview:\nThe Georgia legislature session on Rules Day 38 of the 2025 session featured the introduction and discussion of several key bills related to elections and the justice system. Notable aspects include proposed changes to election rules and voter rolls, as well as legislation addressing prosecutorial misconduct and wrongful convictions.\n\nKey Actions:\n- **SB 10**: Quantifies procedures and practices for judicial officers, and incorporates language from HB 199 which passed the House unanimously\n- **SB 141**: Creates a grant program for rural hospitals to purchase generators, using SB 170 as the vehicle\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The session began with an opening prayer by Jim Williamson.\n- The legislature recognized several special guests, including Michael Boswell and Andrew Blitchington from Scriven County.\n- There was some discussion around Senator Goodman allowing his legislation to be used as a vehicle for other bills.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not mention quorum or attendance.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or when the next session will take place.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning everybody, let's call our meeting to order, please go and ask Jim Williamson\nto open us up with word of prayer.\nThank you very much.\nThank you very much.\nChris, Assembly Follow-A-God, we just thank you for the gift of this day.\nMore to even now is we face these storms that about the role of the Lord.\nWe ask to protect the people and the property and the paths of the storm,\nFather.\nWe pray that you bless our families, those who work here, Father.\nAnd in your name, just ask for wisdom and discernment in the matters\nthat we get to deliver right now.\nEvery decision, please, on your side.\nMay I assist in Christ's name, I'll be there.\nThank you, Jim Williams.\nBefore we get started this morning,\nwe'd like to recognize some special guests\nwe have visiting with us today.\nYoung man, Michael Boswell and his mom, Beth,\nthey're from Scriven County.\nThey're back here.\nThey're going to be pageant.\nMichael's going to be pageant for us today.\nand also Andrew Blitchington is back here with him\nand his mom Katie and Billy\nand they're from Scriven County\nand we're glad to have them with us.\nThank y'all very much.\nSenator, come on up and I wanna ask you a question\nbefore we get started.\nYes.\nCould I get an autograph of you today\nso I could have it in the case?\nI'll see your name.\nI will.\nI will say this, Mr. Chairman, thank you all for having me to hear this bill, but I will say it's going to be an honor to serve George in that role.\nI didn't realize the treasure has been in existence since 1775, and I'll be the first Georgian to represent us in that role.\nSo I'm excited to do that.\nSo thank you.\nBring before you, Senate Bill 244, this simply has two parts to it.\nPart one deals with a prosecuting attorney if that prosecuting attorney is disqualified for\nmisconduct and the cases then dismissed by the courts.\nThose that were indicted have the right to go back to the courts and ask for\nsome attorney fees and reasonable cost to petition the court.\nPart two deals with victims that were convicted that then become innocent.\nThere's an avenue for them, then, to be restored.\nAnd this is something the House added, Chairman Dempsey,\nand can speak to that if you have any questions to part two.\nAnd something the House has worked on for a long time.\nThey added the SB-244, and I'm okay with that.\nThank you very much.\nThank you, sir.\nDon't say any questions.\nThank you.\nAppreciate it.\nAnd if it's selected, Representative Chairman Martin,\nChuck Martin will carry it.\nThank you.\nThank you, sir.\nMr. Chairman, members of the committee, I'm bringing, Paul has got me, I'm bringing SB 10\nbefore you.\nToday, I appreciate Senator Goodman allow me to use his legislation, which is already\npassed the Senate in Representative Ford's district as a vehicle to do two things.\nOne, it quantifies a procedure and practice for judicial officers and second, it has\nHouse Bill 199's language in it, which passed the House unanimously preuse in the year\nand just getting hung up a little bit in the Senate.\nSo we're trying to give them another opportunity to get that done.\nOkay, don't see any questions.\nThank you.\nThank you, Mr. Chairman.\nWe have Steve Ocean.\nThank you, Mr. Chairman and committee.\nI, too, am grateful for Senator Kim Jackson, allowing me to use Senate Bill 170.\nThis bill, you'll recognize the same language.\nIt will create a grant that rural hospitals will be able to use\nto buy generators to increase the capacity that was found\ninsufficient during Hurricane Helene.\nOkay, I don't see any questions.\nThank you so much.\nCameron Anderson.\nThank you, Mr. Chairman, kind of to repeat my colleagues' comments.\nSo I want to thank Senator Robertson for allowing us to use Senate Bill 175 in our governmental affairs committee\nSenate Bill 175 is an elections bill a few things that it does that allows the speaker to lieutenant governor to\nRemove their appointments out of session. They can appoint that's to the state elections board\nThey can appoint now out of session, but I cannot remove those until the session is back in\nIt also delays rulemaking\nmaking implementation for the state elections board. If rules were not taking the rule-making authority\naway from the elections board, but if they're promulgated within 60 days of the election, then they're\ndelayed until 30 days after the election. To avoid some of the confusion we had last year,\nwe're also removing the administrative tie of the state elections board from the secretary of\nstate's office to the state accounting office. That's where the state ethics board has\nadministratively tied to. We are also removing the state from the Eric reporting system, but\nthat is being delayed until July 27. And that gives us time to prepare a report. The state\nelections board will head that up over the interim and as well as a either a House or a committee,\nlooking into alternatives to that. So that implementation is delayed for a year and a half to give\ngive us some time to further review that.\nWe are restricting the drop off the weekend\nbefore the election day on Tuesday,\njust on the Saturday and Sunday for absentee balance.\nThat was a point of confusion.\nWe're trying to promote consistency across the state.\nWe have a lot of days already built in over two weeks\nof absentee voting and days and opportunities.\nWe are allowing the drop off of those absentee balance\non the Monday before the elections day.\nLet's see, there are some other things\nrelated to giving municipalities\nin municipal only elections, the option to opt out one\nor both of the Saturday requirements now.\nIf there's any state or countywide elections at all,\nthen they must open the two Saturdays\nthat are currently required in law.\nAnd then we're allowing a referendum question\nto be placed on special statewide ballots,\nsuch as the PSC election that's coming up later this year\nto allow communities to put a splotced referendum\nor something requiring a referendum on the ballot.\nOkay, have a question, boy, who it part?\nThank you, Mr. Sherman.\nSo with respect to Eric and the majority party's effort\nto remove a tool that's been clearly been demonstrated\nto protect voter integrity,\nwhat data justifies cutting off Georgia\nfrom this multi-state voter tool.\nAnd if you're not going to move forward\nwithin until 2027, why is it currently\nin legislation for this year?\nMany times we fail to act without compulsion,\nso we're putting a date in here\nthat will require compulsion on our part\nto investigate that.\nAs far as data that I used in my interpretation\nand consideration to leave this in the language,\nif I look at, from the Census Bureau,\nthe migration data, the top seven states where people move from Georgia into Georgia, none\nof those top seven states participate in the ERA program.\nThere's only 24 states currently participating, and so while we're getting a lot of information\nthrough that program is how much of that information is relevant to what's going on around\nus.\nThe only bordering state that participates in the program is South Carolina.\nunderstanding they have similar legislation before their body now so again\npushing that implementation out so we can review options outside of that to see\nwhat they may be it gives us two legislative sessions if we need to do\nsomething different thank you for the question later hugely has a question thank\nThank you, Mr. Chairman, to the author of the bill.\nI appreciate limiting rule-making, rule changes 60 days out.\nBut did you consider that once an election has started,\nthere shouldn't be any changes on the rules?\nBecause people need to know the rules of the game\nwhen they start.\nYes, ma'am.\nAnd that's exactly why we put this in place.\nAgain, there was confusion last year, there were rules that were passed at the last minute\nbefore the election, Gabrielle, the Association of County Election Officials, had asked for\n90 days.\nWe had some discussions, the State Election Board representatives discussed with them to\ntry to negotiate because we don't want to constrict and confine the elections board as much\nas possible.\nSo, it was finally determined and agreed to in that discussion by both parties at 60 days.\nSo that's the reason we're limiting that.\nRepresentative Evans has a question.\nThank you, Mr. Chairman, to the chairman and the well,\nor at the podium.\nWhat is the wisdom of moving oversight\nof the state elections board from the Secretary\nof State, which is elected by the people\nto the state in a counting office, which\nis a bureaucratic agency with no oversight from the voters?\nOK.\nVery good question, and let's make sure\nwe understand what we're talking about here.\nWe're not talking about oversight.\nWhat we're talking about is budgetary and human resources\nresponsibilities, only administrative tie, okay?\nAnything oversight for the State Elections Board\nis provided by the appointees.\nThat would be the legislature, the governor,\nand currently the two parties.\nSo that's who overseas and regulates that,\nas well as the legislative body.\nThey can only do what we, the legislature, allow them to do.\nThe Secretary of State's office does not necessarily\noversee the State Elections Board.\nAll we're talking about is budgetary and human resources\nadministrative responsibilities.\nAnd does the State Accounting Office have those kind of responsibilities for other organizations\nand if so, which ones?\nThey do and specifically the State Ethics Commission.\nThere are some others, but that's the one that I've had the most discussion with because\nit's a similar type of structure.\nThe State Ethics Commission has a larger staff than the State Elections Board does, but\nwe're in kind of a period trying to rebuild the Elections Board and put them back to\ntheir original intended purpose.\nWhere would I look to find that?\nThe original intended purpose.\nWhat year would that, would we go to look\nfor what the legislature did?\nI don't have the direct answer to that.\nI'd suggest legislative council could direct you to that.\nWell, when you said back to the original purpose,\nI'm just assuming you must have looked at that\nto be able to determine what was the original\nintended purpose.\nThe state elections were put in place\nby the legislature to be separate\nfrom the Secretary of State's office,\nwhich is a constitutional office,\nto provide certain levels of service\nand also oversight over some of the election's activities.\nThank you.\nThank you.\nOkay, you don't see any other questions.\nThank you, sir.\nThank you, sir.\nSenator Sassler.\nHey, Mr. Chair and members committee,\nbottom of page two, Senate Bill 36,\nbill that takes the basic protections\nthat citizens enjoy from federal government intrusion\non basic religious rights and apply it to state\nand local governments.\nI'd like to take questions.\nOkay.\nThanks, sir.\nLet me see you quick.\nSenator McLean.\nMorning, Mr. Chairman and committee.\nJust here at the top page four, Senate Bill 173,\nit's a bill to establish an uncontested motion procedure.\nJust move civil cases a little faster, reduce backlog.\nThanks, Mr. Chairman.\nYou don't see any questions.\nThank you, sir.\nSenator Strickland.\nFor Mr. Chair and members of the committee, you have two, one that have not presented yet\non page three about halfway down, Senate Bill 132.\nThis is dealing with the process where someone's competency to face criminal charges has been\nquestioned.\nIt requires hearing to standardize the process and the front end, and then it speeds up\nthe process for competency evaluation, also restoration for those with non-violent misdemeanor\ncharges.\nOkay.\nI don't see any questions.\nMr. Chairman, page four, halfway down.\nSo they'll 207, I presented before.\nThis is our third year of our effort to standardize\na process for how occupational life\nand board still will criminal records.\nOK.\nThanks, sir.\nThank you.\nAppreciate y'all.\nAny requests from the committee?\nPM Newton, this is just a follow up on SB 141\nstructured rules, sir. It's a bill that deals with two time frames that were related to local\ngovernments on the length of time for appeals from 30 to 45 days and allowances for local governments\non historic renovations. What's that number? SB 141, the last one, only one under structured rule.\nThank you. Okay. Here, Martin, I didn't know if you were ready for half study committees today or\nyou want to do this? No, we'll hold that up a little bit. All right. Let's go ahead and set us\na calendar for today. This is Bifamundi March 31st, day 38 under modified structure. Senate Bill\none move in second any opposition all right we have an objection all those in\nfavor say aye those opposed no the eyes carry Senate bill eight moved and\nseconded any opposition it's on Senate bill 82 moved and seconded any opposition\nhave an objection all those in favor say aye those opposed say no I\nhave it it's Senate bill 93 moved and seconded any opposition it's on under\nSenate bill 121 by substitute LC 46 1 2 2 0 s Jim Lenson's going to explain\nthat to us.\nMassey Button.\nYes.\nThis is a bill that requires higher levels of coverage for liability and property damage\nfor those individuals who have received, have been convicted of DUI.\nIt requires 5,154 after a first conviction and 100, 300, 100 after a second or subsequent conviction.\nThis tire levels of liability and property damage those individuals who have been convicted of DUI.\nOkay, you've heard the explanation. Is there a motion?\nmove in second any opposition it's on Senate bill 140 moved in second any\nopposition it's on Senate bill 151 moved in second any opposition it's on Senate\nbill 170. Second moved and seconded. Any opposition? It's on. Okay. Senate bill 204 by\nsubstitute, LC 44, 31, 96. Yes, leader frustration is going to explain that for us. Thank you,\nMr. Chairman. So Chairman Powell was carrying this bill considered in judiciary non-civil. This\nsubstitute only addresses two aspects of the bill. First of all, line 81, the word\nsubject 2 has been added. That was the request of the House sponsor and has been\nupdated. The other change was on page six of the bill. Originally the bill was\nfor the purpose of allowing prosecutors to accuse certain crimes rather than\nsubmitting them the grand jury for a bill of indictment, this restores the original\nlanguage with respect to that, with the exception of a statutory citation in line 128, which\nwas in Chairman Powell's substitute in judiciary, non-civil, would ask for the committee's favorable\nconsideration.\nOkay.\nYou heard the explanation.\nAny questions?\nIs there a motion?\nmotion. Say motion in a second in your position having an objection all those\nin favor say aye aye any opposed no aye scary it's um Senate bill 212 moved in\nsecond it on Senate bill 1 2 12 any opposition having an objection all those in\nfavor say aye. Any opposed? No? I ask carry. Senate bill 256 moved and seconded in the opposition.\nIt's under a structured Senate bill 141. Have a move and second in the opposition. It's on.\nOkay. That should get us going today. We may possibly see you a little later on. Thank you. This meeting is adjourned.\n",
  "updated_at": "2026-02-12T17:27:51.524024+00:00"
}