{
  "video_id": "tcqeIo2hv1U",
  "url": "https://youtu.be/tcqeIo2hv1U?t=849",
  "title": "Georgia House - Day 35 (2026-03-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-25",
  "duration_minutes": 156,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-03-25:\n\n## Overview\nThe session focused on a call for unity and peacemaking among the representatives, with the chaplain emphasizing the importance of characteristics like being like-minded, sympathetic, loving one another, and acting with humility. There were no major legislative actions taken.\n\n## Key Actions\nNo significant bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The chaplain, Reverend Chip Gordon, gave a speech emphasizing the importance of unity, peace, and characteristics like being sympathetic and humble. \n- Representative Smith introduced Reverend Gordon and provided background on his experience in pastoral care and community service.\n\n## Votes\nNo recorded votes took place.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified.",
  "transcript": "Good morning. All members, please come to the floor. All members, please come to the floor. The hour of convening having arrived, all members, please come to the floor. All members, please come to the floor. Mr. Clerk, will you ring the bell? We're going, well good morning. Good to see you all. You all, all of you. Hope you had a great weekend. You're feeling better, Representative Williams. You're looking better. Because I've had some of my problems over the weekend, but you are looking better. Glad to see all of you. We're going to have the morning roll call now. All members present. Will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? Doors keepers, will you please close the doors and keep them closed? Doors keepers. As is our custom, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the Seventh House District, Representative Chair Lady Linsmith, Representative Smith. Good morning, colleagues. Thank you, Mr. Speaker and members of the House. It is my wonderful privilege today to introduce to you Reverend Chip Gordon, Master of Divinity. After learning about the mission of Cancer Treatment Citizens of America, CTCA, which was the first name you know about New New Georgia, Pastor Chip Gordon, Director of Pastoral Care, was instantly impressed. He knew right away that he wanted to be part of the team since CTCA was purchased by the City of Hope Cancer Center. Reverend Gordon continues to serve patients, their caregivers, and the staff he has been for past 13 years. And now several of you in this room have been to either CTCA or City of Hope. Part of the team is Ray Williams right here, and he is our goat sheep person if we have any needs. Chip earned a Master of Divinity from Southwestern Baptist Theological Seminary in Fort Worth, Texas, and the bachelor's degree in speech communication from Auburn University. Throughout his more than 30 years of ministry experience, he has served as youth pastor, senior pastor for various churches in North Carolina, Alabama, and Georgia. Chip served as the North American Mission Board Church Planner, planting the church in the Henry County, in Henry County, Georgia. At the time, one of his, at the time, Henry County was one of the fastest growing counties in the U.S. Passionate about the community, Chip served on the board of directors at Bridging the Gap, a community outreach program providing food and other resources for the people in need. That was so important when the tornado hit our community back in 2020-2021. He has served as an advisor to the New and Youth Council, past board of Directors of the New and Kewanis Club, and the past director of the New and Kewida Board of Realtors. He currently serves on the board for Sacred Journey Hospice Foundation. Chip is very active in sunrise Baptist Church where he served as an elder. Born and raised in Nannon, Chip and his wife, Joelle, attended Auburn University. She is a retired mathematics teacher at Newton High School. Their daughter, Joelle, is married to Chip and they have two daughters. Katie and her husband, Hunter, having her husband, Andrew, and four incredible grandchildren. So it's my great privilege today to introduce you to someone. His whole adult life has been about pastoral care. I call it the Faith, Hope, and Charity. He's able to practice all three of those pastoral chipboard. Thank you. Thank you, Representative Smith and Mr. Speaker. What a joy to be with you all this morning. As I begin, I would like for you to do something. I would like for you to look around at the people near you. Just take a moment to look around. They don't look like you. They don't act like you. They don't talk like you. Or have your background. We are all different. You know, friends, I love the fact that God knit each one of us together. We are fearfully and wonderfully and uniquely made. Now, last week I had a dream about being here. There were many people around and then someone came up to me and told me, we just need to hear about unity. And then I woke up. So that night I decided that I believe that was what the Lord wants me to talk about today. Henry Blackaby said, God speaks through the Bible prayer, circumstances, and the church to reveal Himself His purposes and His ways. Unity and peace are central themes throughout the Bible. We may not always agree with one another, but one thing you can agree on is that you are here to serve the people of this great state and to do what is best for the state of Georgia. We are told in Psalm 133 verse 1 how good and pleasant it is when God's people live together in unity. Romans 14, 19 tells us, let us therefore make every effort to do what leads to peace. When you stop to think about it, you are either a peacemaker or a troublemaker. You might want to ask yourself, am I a spoon in a bowl of discontent? Do I stir things up? Friends, peacemaking is not always popular. Unity is not always popular. Some people prefer to fight for what they believe in. In a battle, the hope is in winning, but someone must be the loser. Peace making unity actually produces two winners. Peace making is God's way. The apostle Peter wasn't known as a peacemaking kind of guy. In fact, Peter, when we first meet him, was impulsive, strong-willed. I am sure none of you can relate to that, but Peter had changed and had developed some good qualities the hard way. The Holy Spirit changed Peter. Peter was now a man that God could use. Listen to what we read in 1 Peter 3.8. Finally, all of you, be like-minded, be sympathetic, love one another, be compassionate and humble. Peter lists five characteristics, things that we should strive for in order to maintain peace and have unity. We should be like-minded, being on the same page, having the same goals. It does please the Lord when we have unity. I think you all agree that you are here to serve the people of Georgia. But he also says we should be sympathetic, being responsive to the needs of others. Peter goes on to say, love one another. We must look at others and treat them as brothers and sisters. John 1334 tells us, a new command I give you, love one another as I have loved you. So you must also love one another. Peter says, be compassionate. Everybody needs compassion. We all need compassion. At City of Hope, we show compassion with how we say what we need to say to the patient. But we also show compassion by giving the patients a hug. And if you haven't had a hug this morning, you let me know after this is over and I'll come give you a hug. And then finally, Peter says, be humble. Colossians 312 reminds us, therefore as God's chosen people, holy and dearly loved, cloth yourselves with compassion, kindness, humility, gentleness, and patience. Friends, this morning, ask yourself, how can I be a peacemaker? How can I help establish unity not just as a representative, but in all areas of my life? Unity and peace do not come about by us just sitting and not putting forth effort. Too often we think of peacemaking as a passive role, simply the absence of conflict. That's not the case. You and I must work at peace. We must strive to have unity. Peter was quoting David in Psalm 34, when he wrote in 1 Peter 3 11, seek peace and pursue it. We are all different. Are you always going to get along and always agree? No. But when we seek to live out these characteristics, Peter shared in 1 Peter 3 8, it will make a difference and bring about unity. Would you please join me as we stand and as I pray for you? Lord, I humbly come before you this morning and ask your guidance on this house. I pray for each lady and man present that you will guide them in all that they do. Protect them, strengthen them, encourage them as they seek to live lives of peace and unity. I pray that they will be like-minded, sympathetic, that they will love one another, that they will be compassionate and humble. Bless them today in Jesus' name. Amen. And now if you will join me in the pledge. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God, indivisible with liberty and justice for all. We need that unity. Yes. Thank you, brother Chip. Doorkeepers, you may open the doors. Members, you may join brother Chip in the south any room. South any room and thank you for his message on unity this morning. A great message in a timely one. Thank you again, brother Chip. Thank you. Members, our doctor of the day is brought to us by Representative Park Cannon. Dr. Head is down in the aid station. If you need the doctor services, be sure and join Dr. Head and also thank her for service. Thank you. Thank you, Representative Cannon. Chair recognizes Chairman Hilton to chair the Committee on Information and Audits. Chairman Hilton. Good morning, Mr. Speaker. Your Committee on Information and Audits has read the journal on the previous legislative day and we found it to be correct. Thank you, Chairman Hilton. The chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is any objection to the spits with the reading of the journal? Hearing none, the reading of the journal is dispensed with. Is any objection to the confirmation of the journal? Hearing none, hearing none, the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Mr. Clerk. The second reading of bill is the first part of the period unanimous consensus. Introduction of bills and resolutions, first reading and reference of House bills and resolutions. Second reading of bill.\n\nReports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to adoption of the resolution establishing the order of business for the day hearing none the resolution is adopted? First reading the bills and resolutions the clerk will read. House bill 811 by representative of the hood of the 175th Corbord 174th, the chair of the 176th and Sharper of the 177th, Bill B. Todd will act to provide a homestead exemption from Lowns County School Districts at Valorant Taxes. And for government coordination. House bill 812 by representative Chokus the 151th rose 124th, William 748, Jasper's the 11th Curve the 118th and others. Bill B. Todd will act to amend part two of Article 1 and Chapter 2, a ton of Lady, the official go to Georgia and attendee related state building plumbing and electrical codes. House bill 813 by representative of the hood of the 175th Corbord 174th, the chair of the 176th and Sharper of the 177th, Bill B. Todd will act to provide a homestead exemption from Lowns County School District at Valorant Taxes. House bill 814 by representative of the hood of the 175th Corbord 174th, the chair of the 176th and Sharper of the 177th, Bill B. Todd will act to provide a homestead exemption from Lowns County at Valorant Taxes. And for government coordination. House bill 815 by representative of the hood of the 175th Corbord 174th, the chair of the 176th and Sharper of the 177th, Bill B. Todd will act to provide a homestead exemption from Lowns County at Valorant Taxes. And for government coordination. House bill 816 by representative of the hood of the 124th, Bill B. Todd will act to create the Green County Public Facilities Authority. And for government coordination. House bill 817 by representative of the hood of the 177th, the chair of the 178th and Dawson in the 65th, Bill B. Todd will act to amend Article 1 of Chapter 6 of Title IV of the EFISCO to Georgia and Intended Related to Livestock Dealers. Agriculture and consumer affairs. House bill 818 by representative Martin of the 49th, the lever to the 123rd, got 38th, black men of the 146th and Evans to 57th, Bill B. Todd will act to amend Chapter 23 to Title 47 of the EFISCO to Georgia and Intended Related to Georgia Judicial Retirement System. Retirement. House bill 819 by representative Washburn of the 144th, Bill B. Todd will act to authorize the governing authority in Jasper County to levying next-size tax. And for government coordination. House bill 820 by representative Washburn of the 144th, Bill B. Todd will act to provide a homestead exemption from Jasper County School District at the Larm Taxes. And for government coordination. House bill 821 by representative Gamble of the 15th, Scott is the 14th, lump's into the 12th, hitches 161th, Seaball of the 34th and others. Bill B. Todd will act to amend Article 1 of Chapter 6 of Title 17 of the EFISCO to Georgia and Intended Related to General Provisions Relative to Bonds. Judiciary non-civil. House bill 822 by representative, lumped into the 83rd and the limber of the 98th, Bill B. Todd will act to amend Article 1 of Chapter 19 to Title 15 of the EFISCO to Georgia and Intended Related to Attorney General Lee. Judiciary. House resolution 685 by representative, Saints of the 180th, Taylor 173rd, Jones of the 47th, Alla of the 84th and Ballard of the 147th. Resolution creating, House Study Committee on Mental Health, Workforce Development. Hilt. House of Resolution 711 by representative, Irwin of the 32nd, Wade of the 9th, Dubnick of the 29th, Chokus of the 151st and Canada of the 172nd. Resolution creating, House Study Committee on Student Attendance and 3K through 12 Education. Education House for Resolution 711 by representative, Senate Bill 328 by Senator Strickland of the 42nd, Davenport of the 17th, Williams of the 25th and Jones of the 10th. Bill B. Todd will act to amend the act creating a State Court of Henry County. And for governmental coordination, Senate Bill 329 by Senator Strickland of the 42nd, Davenport of the 17th, Williams of the 25th and Jones of the 10th. Bill B. Todd will act to amend the act providing supplements to the salaries of the judges to superior court. And for governmental coordination. That completes First Readers. Second reading of bills and resolutions, Mr. Clerk, will you read? House Bill 799 by representative, Lurch of the 176th, the Bill to amend the act providing for the election of the Board of Education of Long County. House Bill 800 by representative, the 2nd, Powell of the 33rd, it bill relating to insurance and motor vehicles and traffic. House Bill 801 by representative, Lurch of the 167th, the Bill to amend the act to recreate and establish the Board of Commissioners of Long County. House Bill 802 by representative Kelly of the 16th, a bill to authorize the City of Cedar Town, Georgia to exercise all redevelopment and other powers under the redevelopment powers law. House Bill 803 by representative, Hatchet of the 155th, the bill to provide a homestead exemption from City of Dublin, Independent School District, Adlorne Taxes. House Bill 804 by representative, Holly of the 166th, the 165th, the Vell of the 75th, the 125th, the 122nd, Davis of the 87th and others. A bill relating to purchase, possession, manufacture, distribution, or sale, control, substance, or marijuana, penalties. House Bill 805 by representative, Hatchet of the 155th, the bill to provide a homestead exemption from City of Dublin, Independent School District, Adlorne Taxes for Educational Purposes. House Bill 806 by representative, Roads of the 124th, the bill to provide a homestead exemption from Oglethorpe County, School District, Adlorne Taxes for Educational Purposes. House Bill 807 by representative, Thomas of the 21st, Parsons of the 44th, Carson of the 46th, Burt of the 20th, Ridley of the 22nd, others, the bill to amend an act providing a homestead exemption from all city of Woodstock, Adlorne Taxes for City Purposes. House Bill 808 by representative, Carson of the 46th, Powell of the 33rd, Crow of the 118th, a bill relating to the Employees Retirement System of Georgia. House Bill 809 by representative, Carson of the 46th, Hitchens of the 161st, Powell of the 33rd, Thomas of the 21st, Crow of the 118th, and others, a bill relating to Speed Restrictions, House Bill 8010 by representative, Jasper of the 11th, Hawkins of the 27th, Taylor of the 173rd, Stevens of the 164th, Newton of the 127th, and others, a bill relating to regulation and licensure of pharmacy benefit, Minatures. House Resolution 653 by representative, Osteen of the 169th and Bershat of the 176th. Resolution recognized in the United States Military Veterans and dedicating a highway in their honor. House Resolution 654 by representative, Lopton of the 83rd, then of the 98th, Campbell of the 35th, Canada of the 58th. A resolution commending community, Astra LA. House Resolution 655 by representative, Powell of the 33rd, Blackman of the 146, Stevens of the 164th, a resolution creating the House Study Committee on Gaming in the State of Georgia. House Resolution 650. Sex by Reps. M. Laulia of the 59th, Anderson of the 10th, Oliver of the 84th Waves of the 112th, Q. Glee of the 111st, a resolution creating the House Study Committee on Expanding Home Ownership Opportunities for Georgians. House Resolution 657 by Reps. No. Chastain of the 7th Burns of the 159th. Jasper of the 11th, Cox of the 28th, Wade of the 9th, and others. A resolution recognizing Mrs. M. Luce Stover and dedicating a bridge in her honor. House Resolution 658 by Reps. Thomas of the 21st, Ridley of the 22nd, Parsons of the 44th, Cogons of the 14th, Carson of the 46th. Resolution honoring, life and Mr. David Allen, Donnelly, and dedicating a road in his memory. House Resolution 659 by Reps of the 12th, and Burns of the 159th, a resolution creating the House Study Committee on Insurance Market Reform. House Resolution 660 by Reps of the 150th, a resolution recognizing Mr. Lamar, Hutchins, and dedicating an intersection in his honor. House Resolution 661 by Reps of the 1109th, Buckner of the 137th, Alexander of the 66th, Taylor of the 92nd, Tran of the 80th, and others. A resolution urging the Federal Railroad Administration to deny CSX's request to become the first railroad to use trip optimizers 0 to 0 feature. Senate Bill 330 by Senator Estabés of the 35th, Halpern of the 39th, McClarne of the 14th, Kenb of the 38th, Parallel of the 40th, a bill to provide a home study exemption from City of Atlantis, Independent School District, Edelarm Taxes for Educational Purposes. Senate Bill 330 by Senator Dixon of the 45th, Ken of the 47th, a bill to repeal an act creating establishing a joint airport authority for the City of Winder in the County of Barrow. Senate Bill 330 by Senator Mor, the 53rd, a bill to provide a home study exemption from City of Chikamawa, Independent School District, Edelarm Taxes for Educational Purposes. Senate Bill 330 by Senator Mor, the 53rd, a bill to provide a home study exemption from City of Ch22, Add- takie Pediments School District, Edelarm Taxes for Educational Purposes. Senate Bill 330 by Senator Mor, the 53rd, a bill to provide a home study exemption from Chit yet counties School District, Edelarm Taxes for Educational Purposes. Senate Bill 330 by Senator Mor, the 53rd, a bill to provide a home study exemption from Jan. eight county school district Edward, in Texas for educational purposes. Through second readers. The report is from the state of Texas. Reports of standing committees. Mr. Clerk, will you read? Representative Beth Camp of the 135th district chairman of the committee and Intergrubble Coordination Local submitted the following report. And to speak to your committee on intergrubble coordination locals out under its consideration. Following bills to the houses is Dr. Meade report to same back to the house and following recommendations. Household 615 is passed by substitute. Household 747 is passed. Household 767 is passed. Household 767 is passed. 61 new pass, House will 771 new pass, House will 782 new pass, House will 783 new pass, House will 784 new pass. Respectfully submitted, represent Beth Camp of the 135th District, Chairman. That completes the reading of the report to standing committees. Members, we have a local calendar this morning. You may want to get close to your seats. Hope you've all reviewed it. There are six bills on our local calendar that relate to homestead exemption and require a two-thirds roll call vote for passage. We'll have the third reading and passage of the uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Here in Nernan's Award. For what purpose is chair lady Camp Rise? To make a motion. Stage a motion. I move to recommit House Bill 615 and House Bill 756 from the local calendar and recommit them to the Intergovernmental Coordination Committee. Mr. Clerk, will you read the caption? Captions. House Bill 615 by substitute by Robson P3, the 166 Chatham County. House Bill 756 by Robson Jackson, 165th Chatham County. On the ladies' motion, House Bill 615 and House Bill 756 be recommitted to the committee and the Federal Affairs Committee as there any objection. Here in Nernan's Award. Mr. Clerk, will you read the local calendar without House Bill 615 and House Bill 756? Mr. Clerk. House Bill 747 by Robson, coming to the 9th Cobb County, House Bill 755 by Robson, a volunteer of the 23rd Cherokee County. House Bill 759 by Robson, a camp with 135th Spalding County. House Bill 760 by Robson, a saint of the 180th Gleen County. House Bill 762 by Robson, a billiard of the 160th Chatham County. House Bill 763 by Robson, a steven of 164th Richmond Hill, Brian County. House Bill 764 by Robson, a jazz versus the 11th City of Nelson. House Bill 766 by Robson, a joke as the 151st Sumter County. House Bill 758 by Robson, a metheac of the 82nd Spalding County. House Bill 761 by Robson, a clerk with the 100th Nath, a city of Lillburn. House Bill 771 by Robson, Thomas the 21st Cherokee County. House Bill 782 by Robson, a steven of 164th Chatham County. House Bill 783 by Robson, a richard of the 125th Columbia County. And House Bill 784 by Robson, a richard of the 125th Columbia County. House Bill 784 by Robson, a steven of 164th St. John's Hall. House Bill 784 by Robson, a steven of 164th St. John's Hall. House Bill 784 by Robson, a steven of 164th St. John's Hall. And House Bill 784 by Robson, a steven of 164th St. John's Hall. House Bill 784 by Robson, a steven of 164th St. John's Hall. Is any objection to the previous question being ordered on the local calendar? Here and none the previous question is ordered. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Here and none the report of the committee is agreed to. Shall these bills now pass? All in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machines? Yes, please. All members vote. All members voted. All members voted. Mr. Clerk, where you lock the machines on the passage of the bills on the local calendar. The yeas are 170 days or zero. Local calendar without bills. House bill 615 and House bill 756. These bills have received the requisite constitutional majority and are therefore passed. Members, if you'll come to order, we have an invite resolution this morning. All members, please come to order. We are recognizing a very accomplished Georgia today. The one who is very diligently working and doing his job. Thank you members. Please give your attention for this invite resolution. Mr. Clerk, where you read House resolution 52525. Read the caption, please. House resolution 525, over 177 of 179 to the low to 167th. Saints of the 180th Crow, the 118th. Hitches of the 161st and others. The resolution, recognizing and commending community supervision officer John crew, the Department of Community Supervision's 2024 officer of the year. This is good to have John crew here with us today. Representative Rick Townsend has recognized to speak to our resolution. Representative Townsend. Thank you, Mr. Speaker, colleagues. This is an honor. I'm gotten the known John now for a little while and he's an amazing person. He has been honored today as the Department of Community Supervision's officer of the year in the state of Georgia. He is a Brundswick person from Detroit. He's got his family here. He served the state over 24 years. He works with that drug court back home. He works with the mental health. People who are going through a mental health crisis down there. He works with them. He's done amazing things on our Brundswick traditional circuit. We're joined today by Dr. Dorothy Jenkins, retired school psychologist. She's amazing. I talked to her and I'm like, oh gosh, we got to talk to education. She's amazing. He's got his cousin here. He's also a teacher, strong family, believe in education. They serve their community. This stands out about officer crew. He serves this community. He's well loved. He's got friends in the gallery. If we could have our friends of officer crew, please stand up for a second. Friends of officer crew. Let's recognize them as well. A lot of these people are going to threaten my graduate daughter. Drew from Brundswick, Georgia to help recognize officer crew. He's amazing man. I also got a little bit extra. I kind of surprised Officer Crew on this. Judge Steven Kelly, a lot of people know here. He's from back home. He talked about how he's instrumental in the drug court. He started a chess club down there. He works with people after hours. He's not your eighth to five guy. He answers the phone after five o'clock on the first ring. He's amazing. He's a great community partner. John, I'm honored to introduce you. And thank you. Congratulations on being on the 2024 Officer of the Year. Thank you. Thank you. Thank you. Thank you. Thank you. I appreciate it, sir. Thank you. Good morning. Still? Still morning. Good morning. I had to make sure it was still morning. This is kind of surreal right now. So, I appreciate your time. I want to express my fervent gratitude to Speaker Burns and Representative Townsend for their invitation and sponsorship. It is truly an honor to stand here on the House floor today, surrounded by my family and commissioner Nell, who adds their presence, adds significance to this moment. I also want to thank my friends and colleagues in the gallery up there. Front row, they just stood up for being here to celebrate this momentous occasion. Your support means everything to me. And I am grateful to share this experience. I also would like to thank Philip Henson for his logistic prowess in coordinating this event. Thank you. Thank you. Thank you. Commissioner, you got a good one here. John, I'm glad to see you brought your own fan club with you. That's pretty strong. So, thank you for the work you do. Thank you, Commissioner, for the work your team does. Working with Georgians and a great mission to help people in so many different ways. So, thank you for that. And we're glad to have you all. And what a family in education and helping folks and down in the runs of care. We appreciate you all. Thanks for being here. And congratulations. And keep up the good work. Yes, sir. Thank you so much. Thank you. Members, John and his team, his family and Commissioner Nale will be out in that south any room. If you'd like to join them for a photo and express your gratitude to him for a job well done. What a nice honor. Members, we'll move on to morning orders. Members, you'll have a maximum of two minutes this morning for your morning order. Two minutes, if you will. Ripper's in gamble. You have a special guest as well. Representative Gamble is going to introduce very fine gentleman, a former member of this house. So, give Representative Gamble your attention. Representative Gamble, morning order. Thank you, Mr. Speaker. I appreciate the opportunity to be up here this morning. We have a very distinguished guest with us, the honorable Dr. John Johnny Savage. Born on April 16, 1934, he's about to turn 91 here. He graduated from Emery Denyl School in 1959. He joined the United States Navy Denyl Corps. He was first stationed in Jacksonville. He also has a law degree from Emery. After requesting global assignment, he was stationed aboard the USS Glacier and an icebreaker supporting Operation Deep Freeze. This operation provided logistical support and assisted in research missions and Antarctica. He even has a glacier named after him called the Savage Glacier. Dr. Savage moved to Ebro, Florida in the 1980s after successful career in Georgia politics and dentistry. And he continued to practice dentistry until he was 89 years old and he just retired in 2022. I think that's pretty impressive. He served for three terms in the Georgia House of Representatives. In 1974, he ran for Lieutenant Governor against then, Zell Miller, and has pretty interesting stories about that. When he ran for Lieutenant Governor, he had an important driver named, then David Ralston, who later became Speaker David Ralston, was his driver in that campaign. Dr. Savage has a story captured by this book, Johnny and Jazzbo. It's a true story about his relationship with Otis Jazzbo Eigner, who became the first black male dental hygienist in the United States. His mother was mildred. His sister was Nora and unfortunately he lost a son recently marked that passed away. And of course, we remember Mark today as well. But through his life and dedication to service and leadership in dentistry and the military and politics and his mentorship of so many people, he has made a significant impact. And I'm going to close with this because I know I've run out of time. But he also was the dentist for Speaker Murphy. He was the dentist to Reverend Martin Luther King, senior daddy king. And he has so many wonderful stories. But he's joined today by 12 people that drove all the way from Florida to recognize him today. And I want them to stand in the gallery because they've driven a long way. Sister Milligan, Levi Parker, my friend Ben Lee. Thank you all for coming today. But the main event is as Johnny Savage. We're honored. He's with us today. He'll be in the any room if you want to come meet him. But thank you, Mr. Speaker, for letting me recognize him. Dr. Savage, I got to talk to you. What are the.\n\nthing was career of serving your fellow man. Thank you for being here with us and thank you for your work over the years. Members you may join Dr. Savage. Let's give him the other hand. I form a member of this house. Friends and family who traveled to be here today. We appreciate that and I know he does as well. Thank you and safe journeys back home. You head back home. Thank you, Rift and Gamble. Rift and Lepton. Recognize for a morning order. Thank you, Mr. Speaker. I'm here to welcome a wonderful community group to the people's house today. I would like to welcome community Australia and their volunteers here. We welcome them for their work advocating for equal access to employment and health care for Indigenous, Black and Brown people. They were founded in 1982 here in Atlanta. They provide educational and wellness programs for those that need it, as well as coordinating emergency housing and legal assistance for Indigenous and Black and Brown folk. We thank you. We welcome you to the people's house today. Thank you for coming. Thank you, Mr. Speaker. Chairman Bonner, recognize for a special morning order. We have a lot of special folks with us today in the capital. So give a gentleman that chair Lady York, tension, please. Good morning. Thank you, Mr. Speaker. Today is Civil Air Patrol Day here in the capital. We are honored to be joined by members of the Georgia Wing of the Civil Air Patrol. The Civil Air Patrol was created in 1941 as the civilian auxiliary of the United States Air Force. In 2024 alone, the Georgia Wing performed over 2,300 total flight hours. They provided invaluable services throughout our disasters, including Hurricane Helene. Today, the Georgia Wing has over 100 cadets up here in the capital. And those that are in the gallery, if you would please stand and be recognized. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thanks, Civil Air Patrol. You're here from all over the state. I appreciate what you're doing, y'all's dedication to flight and to your neighbors as well. Thank you for that. Good to have you all. Chairman Roads. It's going to recognize some great scoopers here. Chairman Roads. Thank you, Mr. Speaker. And Representative Griffin, I want to come up here. We have a great group of young people today. The eighth grade class from John Millage Academy led by Miss Susan Aver, which today is her birthday and Miss Connolly. I want to thank y'all for bringing them up here. They're up here learning and seeing their state government at work today. And this is a really, really special group of kids. But one of these kids, I want to take this chance to embarrass them is my baby boy, Lane Roads. Lane, step on out so we can embarrass you and see you red face. But that's the eighth grade class from John Millage Academy. Y'all welcome them to the capital. Thank you. That's fair. Thank you. I'm seeing you going to have you down in the face. Thank you. Thank you. Thank you. Thank you. Good to have you all. High school next year. Good luck with that. Good to have you all in the people's house. Represent Cummings. Represent Terry Cummings has recognized for a more than one or two and friends. We back. I'm a little bit young. Good morning. Today we recognize the national coalition of 100 Black women, which I am a proud member. And we also recognize the 100 Black men, which I am a member of as are these other members of the House of Representatives. The national president is Mr. Milton Jones, national president of the coalition is Virginia. Virginia Harris. Today we recognize both organizations and the work that they do in the community, educating, mentoring, and providing equity to African Americans. We're the men. OK, please stand. Thank you. Thank you, Speaker. I yield the well. Thank you, Rube. I'm down to the anti-room, to my right. I'll tell them to come down to the third floor and come over here. And you can come in that South Any Room. And you can have some photos made. Enjoying represent Cummings in that South Any Room. Gentlemen and ladies, I want to ask you to give represent your attention. And also, I'm going to ask you to stand. As you recognize us, some folks in our gallery, you have lost a loved one. Members of the police stand. Thank you, Mr. Speaker. This morning, colleagues arise to honor Little Baby Caspin, Tidwell Cranx. He was born on December. And his parents are here with us today to our right. Here standing right to your far right. And I just wanted to just acknowledge his precious life. They loved their baby, and they took very good care of him, but lost him suddenly during the Christmas season. And it just was such a heartfelt moment for our community and for my neighborhood. And I told them that we would definitely make sure that we remember him and the state honors his life. And you all for the care that you gave him while he was with us. Thank you so much. Thank you, Mr. Speaker. Thank you, Representative. Thank you, members. Our condolences go out to the family. Go to beautiful child. Beautiful child. Representative Park Cannon. Representative Park Cannon has recognized for morning order. Give the leader your attention. And friends. Thank you, Mr. Speaker. Today we're here to honor an outstanding couple. They are fiances. That is Demetrius Williams and Miss Donjray and Nicole Demetrius has helped a number of brands gain their identities. He's worked with a wide range of clients to build meaningful relationships and cares deeply for underserved communities. Miss Nicole is a multi-talented singer, songwriter, and actress who gained widespread recognition for her powerful voice and musical contributions. She's an advocate for mental health awareness. And she continues to do programs that uplift young women. I'm standing here with their representative and wanted to just honor you here in the Capitol today and provide you with a resolution and are heartwarming thoughts of success for your upcoming marriage. Congratulations and thank you, Mr. Speaker. Thank you. Thank you. Congratulations, lucky man. I can tell already. And I know you know it. Thank you for y'all's involvement. And thanks for sharing your talent as well. And the best of luck to you in your future. Good to have y'all here today. Ripley Beckles, ladies recognize and she has some friends that will join her. Ladies recognized. Thank you, Mr. Speaker. Good morning, everyone. I rise today to introduce to you the student council of Summer Armiddle School. This talented group is dedicated to fostering a positive and inclusive environment for every student. They come from our six, seventh, and eighth grade students. They're led by Dr. Edie Wre, Roxie Smith, Sarah Allen, Ali Tongo, Anna Lillard, and Rhonda Perry. If you could please stand Summer Armiddle School with the SHIP council. There you are. Thank you, Mr. Speaker. Are you the well? I'm sorry, your question is true. Representative Van Smith. Recognized for a morning order, Representative Smith. And it's good to have Michelle Smith with us today too. Representative Smith. Thank you, Mr. Speaker. Welcome, gentlemen. This is kind of unusual for me, but I wanted to come up for just a second and kind of tell you that life is interesting. And a lot of things have transpired since last week when we left. First of all, I want to thank Michelle. She's sitting right over there. She's, she's the love of my life, right there. So there we go. I just thought that. You all know I married well with my head. I want to thank my children and my grandsons, our grandsons, eight. But I want to thank you. This is a family in here. And you won't believe the calls and the text I've had. Wow. It's amazing. And I can't tell you how much I appreciate it. If you get the chance, read Jeremiah, Jeremiah 2911. For I know the plans I have for you. The Clare is the Lord. Plans to prosper you and not to harm you. And plans to give you a whole future. Yes. Thank you. I love y'all. Everyone of you. Thank you very much, Mr. Speaker. Let's go. Thank you. Vance Smith, we love you too. As a man and as a representative. So thank you for what you stand for. And yes, Michelle is the best thing in your life. Next to your children and grandchildren. Thank you for what you care about in your community. And thank you for caring about the people of Georgia. We appreciate you. Thank you. Thank you. Thank you. Members, the Smith family is going to step out in that south any room. If you want to go out and speak to them, be more than appropriate. And now would be the time. We're representing people of hood and the lounge delegation. I want to see who all is in that lounge county delegation. Let's see. Dexter, representing Corvus, representing Birchette. I want to give you guys plenty of room. Gentlemen, it's a spin just for a moment. Gentlemen's recognized. Mr. Speaker, thank you and members, thank you for this moment. My colleagues from Lowns County and I would like to recognize an outstanding individual from our district. And it's Mr. Franklin Bailey. If Mr. Bailey, if you'll stand up in the gallery. And we want to recognize Franklin for his outstanding achievements in leadership to the Home Builders Association of South Georgia for over three decades. But also he's currently serving as the president of the Georgia Home Builders Association. And he is just an excellent leader in our community around this state. A great example. Probably his best and highest achievement ever is his marriage to his wife Sabrina. And his two outstanding sons who were friends of all of ours, Dr. Jared Bailey and Dr. Travis Bailey, two physicians at back home. We just thank you for what you do for us. We thank you for what you represent in our community. And we're just honored to recognize you today. Thank you. We've got this resolution to present to you. So if you'll meet us down here in the anti-room, we'd love to get a picture with you. Mr. Speaker, deal the well. Thank you. Cheerleader camp. Has recognized for a morning order. Give the linear attention, please. Thank you, Mr. Speaker. I'd like to recognize Gordon State College. They were up in the gallery a little while ago. Gordon State College is here today. I believe they're going to be in room 216 from 11 to I think 1 o'clock today. Representative Matthew accept that up. We are honored Gordon State College is here. They're at a Barnesville, Georgia, but they actually service about 14 calories, calories, counties and central Georgia. So thank you for being here today. Thank you, Mr. Speaker. Gordon State, a really good school. Our colleague across the hall, Senator Max Burns was president there for a while. They do a great job. We appreciate you all recognizing them. Which room is that 216? What time? Room 6. 11 to 1, Gordon State. That completes our morning order. We'll move on to our rules, calendar. Mr. Clerk, will you read the caption to Senate Bill 193? 193? Senate Bill 193 by Senator Brass of the sixth and others to be entitled. Now to men chapter 4, title 20, if you go to Georgia, I'm saying it related to vocational technical and adult education. So I'll throw out State Board of the technical college system of Georgia to establish the adult workforce. The school diploma program, this bill I've referred to the committee on higher education. That committee recommends that this bill do pass by committee substitute. We're representative Houston Gaines has recognized, she's speak to Senate Bill 193, Representative Gaines. Thank you, Mr. Speaker. Senate Bill 193 is a workforce development bill that ensures an opportunity for those age 21 to 40 to go back and earn a high school diploma through technical college system. They were contract with accredited providers and really it's a pay for performance model where these contractors would have to ensure that they actually get their diploma where individuals going through the programs would get their diploma in order for the program to actually get. In that regard, so there's all subject appropriations, happy to answer a question if there is one to speak. Gentlemen has no questions. Thank you, Mr. Speaker. Are you the will? Jim was yielded the will. Is any objections to the previous question being ordered? Here in the previous question is ordered. Is any objection to adopting the committee substitute? Here in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report of the committee is agreed to. This bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Yes. Have all members voted? Yes. Mr. Clerk, will you lock the machine? On the passage of Senate bill 193 of the yeas of 159, the nays or two. Mr. Clerk, will you read the caption to Senate bill 149? Senate bill 149, the definition regarding tuition, equalization grants and private colleges and universities. This bill now includes the committee on higher education. That committee recommends that this bill do pass. Day Jovoo, see if you get it right this time. Chairman Gaines has recognized to present Senate bill 149. Representative Houston Gaines. Thank you, Mr. Speaker. This is another workforce development higher education bill. It deals with our tuition equalization grant program. It encourages, as you all know, Georgia residents to attend eligible private colleges by aiding towards education costs. Currently that's $550 per semester or $367 per quarter. There's currently 32 private colleges that qualify for the TEG program. This bill ensures those rigorous requirements. Stay it allows for newly qualified four-year college institution students to participate in the TEG program. They must remain accredited by SAX level 6, which is the highest level in rigor of accreditation. Mr. Speaker, I'm happy to answer questions. Chairman has no questions. Thank you. I yield the well. Gentlemen has yielded the well. Is any objection to the previous question being ordered? Here in under previous questions ordered. Is any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill? Here in under the report the committee is agreed to. This bill now pass. All in favor of the passage of the bill. Will vote yes. Those opposed will vote no. Mr. Clerk, will you unlock the machine? Have all members voted? If so, Mr. Clerk, will you lock the machine? No, the passage of Senate bill 149, the yeas are 100% of the bill. The bill is there for the past. Mr. Clerk, will you read the caption of Senate bill 123? Senate bill 123 by Senator Kennedy, the 18th and others to be entitled in act to amend subpart two. Part one of Article 16 of Chapter 2, Title 20 relating the compulsory attendance. So it's up to date and revised provisions of the states compulsory school attendance laws is bill 11 for the committee on education. That committee recommends this bill do pass. Gentlemen from Gainesville, Chairman Dubnick has recognized to present the bill. Chairman Matt Dubnick. Mr. Speaker, I appreciate it, ladies and gentlemen of the House. Last year our state faced a very unfortunate number that is now reality. The number of students in the 22.6% of our students were chronically absent in our public school system. That's not just a number that represents 380,000 young people who missed at least 10% or more of the school year. The bottom line is education is our key to giving our students the next leg up in life and the first step in achieving that is simply being present. Senate bill 123 defines what chronic absenteeism is within code. And again, as I've referenced, that means that a student has missed 10% or more of the school year. While this is not going to fix chronic absenteeism, this is a step in the right direction. We're stating that if a district as a whole has a rate 10% or higher, they have to have an attendance review team. And if an individual school has a rate of 15% or higher, they also have to have a dedicated review team. Mr. Speaker, that is the bill. This is a bill that passed out of the Education Committee unanimously and on the floor of the Senate unanimously. I ask for this body's favorable consideration. I'm happy to answer any questions. Gentlemen, you owe for a question. Yes, sir. Representative McQueen to your left has recognized for a question. Thank you, Mr. Speaker. That's a gentleman you. Yes, ma'am. Can you talk about the role that the judicial part, the judges have to play in this? Because I know from experience, I've been in several systems where these teams are created and already exist, but they didn't have anything to do with the judges of the area. So, we can talk about that. Sure. Thank you for the question. So, they already have that authority and oversight and other sections of our code. And so, we're simply making that match from a truancy in an absenteeism standpoint where their reference in other places in the code just keeping that consistent. Thank you. Thank you. Gentlemen, you owe for another question? Yes, sir. So, I'd like to ask you a few questions. Thank you, sir. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Gentlemen, you have one more. One more, Miss Vickner. Reps. And you're Irwin. Chairman Irwin, to your right. Thank you, Miss Vickner. Does the gentleman yield? Yes, sir. Is it not true that in some students' cases, the best spot for them is at the school, not necessarily at their home environment? Yes, sir. Mr. Chairman, I couldn't agree with that statement anymore. We've seen so much over the last five years of how much our students need to be in school, want to be in school and find better outcomes when they are there in school. Follow-up. Please. It didn't we learn from COVID that the best teaching is in-person teaching when the students are there with the teacher? That's absolutely correct, Mr. Chairman. Mr. Vickner, thank you for your attention and the questions this morning. And again, I ask for your favorable consideration of Senate Bill 1-2-3. And gentlemen, has yielded the well? Is there any objection to the previous question being ordered? Here he none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here he none, the report of the committee is agreed to, shall. This bill now pass all in favor of passage of the bill. We'll vote yes, all those opposed. We'll vote no, and this clerk will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk, will you lock the machine on the passage of Senate Bill 1-2-3, 1-23, the yeas are 160? The nay is one. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 1-1-2? Senate Bill 1-1-2 by Senator Dixon of the 45th and others to be titled, an act to amend Chapter 1, a title 10 of the EFISH go to George Anontetti relating to selling and other trade practices, so to extend certain protections for consumers relative to warranties of HVAC systems and components of such systems. This bill I refer to the Committee on Agriculture and Consumer Affairs, that committee recommends this bill do pass. Chairman John Corbett is recognized to present the bill. Representative Corbett. Thank you, Mr. Speaker. Members of the House, I bring before you House Senate Bill 1-2-3, this deal is with residential real property only. The bill was brought by the Conditioned Air Association of Georgia, which represents license HVAC contractors and suppliers across Georgia. SB1-2, a mere similar legislation that Florida passed in 2023 and has been viewed positively by consumers and the industry. This legislation does two things. It eliminates the registration requirements for these HVAC warranties to contractors and consumers. These registrations, requirements are unnecessary burdened at extra work, and additionally it often causes confusion on who is responsible for registering these systems. And then secondly, it protects the transferability of these warranties should there be a transfer of property prior to the expiration of the warranty. It follows the equipment and not the individual. This bill passes Senate 55-0. So it's a great consumer protection bill and I would appreciate your favor of support. Mr. Speaker, that's the bill. And I'll stand for questions or you'll the well. The gentleman has a question for your yield, representative Jasmine Clark, to your gentleman yield to the question for Jasmine.\n\nJudge McClaught. Thank you, Mr. Speaker. Does the gentleman yield? To the general lady I do. So thank you so much for this bill. I think it is a very common sense customer friendly bill. I guess my question is without the registration, how will the warranty company know that, like who the new homeowners are, and that they are now eligible for protection under this warrant? Well, I'll say it follows the equipment and not the individual. With the serial number on that piece of equipment, that's how they track it. So they know a lot of times, if you sell home, you've got a 10-year warranty on your air conditioner, you've only been there five years, you sell it. You know, they go back and look at the serial number, and that's how they track the equipment. Thank you. Thank you for the question. Mr. Speaker, I yield the well and ask you a favor with consideration. The gentleman had no further questions, and he's yielded the well, is in objection to the previous question being ordered. Here in none, the previous question is ordered. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shout out this bill now, pass. All in favor of the pass to the bill. We'll vote yes. All those opposed will vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? Have all members voted if so, the clerk will, one more vote. If so, the clerk will lock the machine. On the passage of Senate bill 112, the A's are 166. The NA is one, this bill, haven't seen the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Resolution 273, House Resolution 273? House Resolution 273 by Representative Hong of the 103rd and others, a resolution designated the city of Inchan, South Korea, as the city of the state of Georgia. Mr. Levin referred to the committee on state properties and community affairs. That committee recommends that this resolution be adopted. The representative Suhong is recognized to present the bill. Repsiting Hong. Thank you, Mr. Speaker. The committee was to spend just for a moment. Thank you, Mr. Speaker. Colleagues, HR 273 will designate the city of Inchan in South Korea as a sister city state of Georgia. As many of you know, many companies in South Korea have had good economic relationships here in Georgia. We will be having a, the mega plan and the, the, the mega plan opening tomorrow as well. And many companies have invested in Georgia. And so this is just a appreciation to one of the cities in Korea and recognizing them as a city amongst many cities that are doing business here in Korea, here in Georgia with us. Inchan, just a quick overview. Inchan is the home of Inchan International Airport, which is the busiest and the most advanced airports in the world. And Inchan is recognized for its contribution to global engagement, commerce and cultural exchange. So I would respectfully request everyone to vote favorably and allow us to present this to the city of Inchan. Thank you, Mr. Speaker, and I yield the well. Ladies, yield to the will. She had no questions. City Vienchan, a big day tomorrow if we cut the ribbon down at the meta plant. And then represent the Franklin district down in Southeast Georgia. Great relationship with the country of South Korea. Many great investments here in our state. Is there any objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the resolution? We're not in the report. The committee is agreed to. This resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the adoption of House resolution 273, the yeas are 165, the nays are zero. The resolution never see the requisite constitutional majority as therefore adopted. Congratulations. Members, I'm going to add a little spice to the punch. And we're going to take up an agreed. Take up one on the agreed today to a Senate substitute to House Bill 161. Mr. Clerk, you ready? The chairman of the crew is recognized for a motion. Thank you, Mr. Speaker. I move that we agree to the Senate's substitute to House Bill 161. Mr. Clerk, will you read the caption? No 161 to be entitled an act to amend Article 133, Title 35, the EF, George Antietta, relating the general provisions relative to the Georgia Bureau of Investigation and to provide for authority to issue subpoenas of electronic communications records for purposes of investigation. Chairman Krueh with recognize to explain the Senate's substitute. Mr. Speaker, colleagues, this is House Bill 161 we had back earlier in this body. This would simply give the GBI the ability to get administrative subpoenas for a few other crimes that they currently don't have that ability for to include swatting and domestic terrorism. The only change is going to be in line 125, that portion where the crime of domestic terrorism is laid out. This was actually a change I made at the suggestion of the Prosecutor of the Attorney's Council a way to clean up some language and so that's something that I agreed with the Prosecutor of the Attorney's Council on to make this change in the Senate so it would work better for prosecution for them. And that's the only change. And I would ask for your favorable consideration on the motion. The gentleman has no questions. As you will, the will on the general's motion that the House agreed to the Senate's substitute to House Bill 161, all those in favor will vote yes, all those opposed will vote no, and Mr. Clerk, will you unlock the machines? All members voted. All members voted. If so, Mr. Clerk, will you like the machine on the gentleman's motion that the House agreed to the Senate's substitute to House Bill 161, the yeas are 150, the nays are 18, and the House has agreed to the Senate's substitute to House Bill 161. Excuse me. Mr. Clerk, will you read the caption of the Senate bill 42-14? The Senate bill 42 by Senator Hatchett of the 50th of the V. Tottel, lack to amend Code Section 16613. Will the official go to Georgia and Senator relating the penalties for violating Code Section 1669 through 16612, so as to repeal certain penalty provisions for the offensive of the Constitution, keeping a place of Constitution, impandering this bill, having referred to the Committee on Judiciary, non-civil, that committee recommends this bill do pass. Representative Hong is recognized to present the bill, Senate bill 42. Thank you, Mr. Speaker. I bring you SB 42 on behalf of the First Lady. Next to the First Lady and the Grace Commission, this will be the 10th human trafficking bill that we will be presenting. There is a legal concept called Rule of Lentity, which essentially says that if you have two statutes that are similar, the judge must sentence based on the more lenient statute. At least two courts in Georgia have indicated that the Georgia human trafficking statute for minors that we passed last year is similar to the PIPPing and PAND during a minor statute, which carries a lesser sentence. So this bill will fix that in order to make sure that we have the more serious and more of a punishment for those that are sex trafficking and human trafficking are minors. What is the bill I ask for your favorable consideration and I yield the well. Thank you. Today. Any questions being ordered? Here in none the previous questions ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes, all those opposed. We'll vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 42, the yeas are 169, the nays are zero. The bill haven't seen the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of Senate Bill 110, 110? Senate Bill 110 by Senator Anit-Avart, the 31st and others to be taught an act to amend code section 15-112. The official code of Georgia and Antietta were laying the definitions, relative to the juvenile code, so it was revised the definition of neglect. And to provide for new definitions, this bill having been referred to the committee on the June and I, Justice, that committee recommends that this bill do pass. You ready, sir? You tell me you're ready all the time, aren't you? Any time, there you go. Chairman Eddie Lomston is recognized to present the bill. Chairman Lomston. Thank you, Mr. Speaker, members of the House. I bring to you today Senate Bill 110. This is a bill that addresses the definition section of our juvenile justice code and has the net effect of making Georgia's open-ended definition of neglect much more specific and fair. It gives Georgia families the right to let their children travel to and from school by walking, running or bicycling to travel to and from nearby commercial or recreational facilities to engage in unsupervised outdoor play and to be a home alone for a reasonable amount of time. It will allow parents to make these family decisions and makes it clear that the parent, not the government, determines when their child is of sufficient maturity, physical condition, and mental ability to avoid substantial risk of physical harm. It clarifies that neglect is the denial of necessary care to a child, which creates an environment that is obviously interest to his or her will fare. This tighten definition of neglect matches the public's understanding that the state should not intervene in family life unless the parent's actions or emissions cause a serious risk of harm to the child that is obvious to a reasonable person. Current law allows authorities to label a parent neglectful based on an officer's own moral judgment and does not require any evidence that the parent is endangering the child's health or safety. This legislation establishes basic rights for Georgia kids and families by declaring that the ordinary activities of childhood are not neglect or child endangerment that parents can make reasonable decisions about when their children are ready to be unsupervised, that neglect means putting a child in serious and obvious danger and that the police cannot charge parents with a crime simply for taking their eyes off their children. It gives parenting decisions back to Georgia parents and childhood back to Georgia children. Mr. Speaker, that's the bill. I would appreciate your favourable consideration. Gentlemen, has a question or two? Yes. Phil Yeild, the ribs of the park, Ken and to your left is recognized for a question. Thank you, Mr. Speaker. Do you? I do. Thank you. I want to thank you for your advocacy for children. This particularly impacts transgender children and as you said, establishes basic rights for Georgia kids. I'm concerned about section two as it relates to HIV. Can you advise what this language does as it relates to HIV and children in Georgia? This was already code. This is nothing new, nothing in this bill that I see here in section two. Okay, goes over on the second. As you said, as a term independent activity and neglect, I think it speaks for itself as you read it. Further inquiry? Yes. Because my question was not at all answered. Could you try to answer the question? What does line 42, line 48 do? It says it shall not be a violation for custodian to permit a child to engage in one or more independent activities. So what is your question? What does this do? It's easy for me. Can you just extrapolate this as you know? In the next section, the term independent activity, legal custodian and neglect, shall have all the same meetings as provided in the previous code section, which is already there. Gentlemen, you know for another question? Yes. Representative Fry to your left has recognized for a question. Thank you, Mr. Speaker. Is my friend you? Yes, sir. Now, you know, we came from a time when there was an actual TV commercial and some plate on the radio said it's 10 o'clock at night. Do you know where your children are? Yes, sir. Right there. And how over time that the definition of reasonable can change. And I don't really see where in this bill that it prevents a police officer from charging you with neglect from what they perceive to be a reasonable issue. And so, isn't it true that we were judged differently when we were little than they are today, and that this could potentially provide problems for parents the way it's written in its current form? I think it's written in its current forms. It provides some protections for parents. It makes it clear that it is the parent that gets to determine whether the child has sufficient maturity to engage in these specific activities. Would the gentleman further yield? Yes. Can you point out in the line where it shows that the parents have the right to make that decision in this piece of legislation, please? I might have missed it. And I'm sorry. The specific language, the specific language 18 talks about an independent activity, and it lays out what those independent activities are. Sure, but for the yield. Are you? Can you show me where it does define independent activity, but where in this bill does it say the parents are the ones that choose what those independent activities are, and whether they're reasonable or not? Because I feel like that the reasonable, in it true, that I feel like the word reasonable is still very subjective, and we have new stories of moms getting arrested because their kid was playing down the street. Gentlemen, that's a question. Gentlemen, yield to Wilbur Chet, right in front of you to your right, just recognize for a question. How do you? Thank you, Mr. Speaker. Does Jim and you? I did. Is it the purpose of this bill and the intent of this bill to bring clarity to this code section? So as a ambiguous provision of neglect cannot be charged of a parent, isn't that true? That is correct. All right, so this is strengthening the parents' rights to allow their kids to go to the grocery store or go to the ball field, and that wouldn't be considered neglect. Is that correct? That is correct. Thank you, Mr. Speaker. Mr. Speaker, I yield well. You had a lot of other questions, but you know, gentlemen, as you were at the well, we do have a speaker. Leader, else Stratian has recognized the speak to Senate Bill 110. Thank you, Mr. Speaker. Ladies and gentlemen of the House, do the questions that were asked. I want to come down here and discuss Senate Bill 110 with you. So this is a very important legislation that's being discussed here today, which really goes to the heart of parents or legal custodians have a responsibility to look after the children that law enforcement may be looking to interpret or implement Georgia law and in doing so. We want to preserve the parents' right to allow the child to have autonomy. When I was growing up, my mom would send me into a store to buy something. I would potentially, you know, walk down the street to go to a friend's house and with what we've seen in particularly in the media with the reporting around this, the concern that rises here is that parental autonomy that allows for a child to develop a sense of independence, the ability to think for themselves to really develop and mature. Sorry for the feedback here, but that that may be subject to interpretation by law enforcement or authorities inconsistent with the parents' rights and responsibilities. So I think that Senate Bill 110 is a measure that thoroughly and thoughtfully revises our state's juvenile code to better reflect the realities of modern parenting and child development. Redefining the definition of an neglect provides clarity for parents and guardians. And that to the distinguished representatives, questions a moment ago, we don't have to restate in the bill that a parent or legal guardian is going to be making these determinations. That's already law. Parents already have rights. So that further language is not necessary. SB also, 110 also amends the reckless conduct statute ensuring that parents are not unjustly penalized for permitting their children to undertake reasonable independent activities. And this alignment promotes a balanced approach, safeguarding kids while respecting parental judgment. So colleagues, I would urge your support of Senate Bill 110 to affirm our commitment to laws that both protect Georgia's children but also our practical and empower parents to make the decisions that they need to raise independent, thoughtful young Georgians to become great future citizens of our state. Mr. Speaker, with that I yield the well. Gentlemen, as you are to the well, there are some questions, but as you are to the well, we have no further speakers. On Senate Bill 110, is there any objection to the previous question being ordered? Hearing none, the previous questions ordered. Is there any objection to agreeing to the report of the committee, which was favorable? The passage to the bill. Hearing none, the report of the committee has agreed to shall. This bill now pass all in favor of the passage of the bill. Will, yes, all those opposed? Will, no, and Mr. Clerk, will you unlock the machine? All members voted for what purpose represent you, Oliver Rice? Parliamentary inquiry, Mr. Speaker. State your inquiry. Isn't it true, sir, that this bill arose from an incident in Mineral Brough, Georgia, where a policeman chose to arrest a mother whose child was walking to school. DeFax had no interest in pursuing that case, but the policeman, I think, probably went across the line. But further inquiry, Mr. Speaker, does it really change the definition of neglect and put the words imminent risk of harm into the standard that's going to make it more difficult for case workers to define neglect? Isn't that the real problem of this bill? Sure, the lady has a firm understanding and put the situation just head up and of the language, but I won't comment on what it may do. For what purposes represent Miller Rice? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that parents who are accused of neglect often believe that they have not been neglectful? I'm sure that could be the case. Further question, Mr. Speaker? One more preliminary inquiry. Is it not true that we trust law enforcement officers to make judgments every day on the street in a way that is consistent with their training and judgment? And this bill undermines that fundamental principle for reasons that have not yet clearly been shown on this floor and in the committee process today? I'm sure the lady probably believes that. Have all members now voted if so, Mr. Clerk, were you locked the machine? On the past, you said it bill 110, the Yays are 100, the Nays are 69. The bill, obviously the requisite constitutional majority is there for past. Mr. Clerk, were you read the caption to Senate bill 119? Senate bill 119, was Senator Goodman the eighth and others to be entitled to amend some part one of Part 4 of Article 2, Chapter 2, a title 8 of the fiscal to Georgia annotated relating the general provisions for manufactured or mobile homes. So those are divided limited exceptions to circumstances under which a manufactured home shall become real property. This bill I have been for the Committee on Banks and Banking, that committee recommends this bill do pass. Representative Lebritz recognized to present Senate bill 119, German Lebritz. Thank you, Mr. Speaker. Ladies and gentlemen, the House Senate bill 119 is identical to House Bill 377, which I sponsored and which passed this House on February 28th this year by vote of 166 to 0. If you require any further explanation, the bill has to do with simplifying the process by which a lender would take a security interest on a manufactured home and provide that if that home is later converted to real estate by the surrendering of the title, the security interest of the lender still is preserved. This is intended to make this area of lending more attractive to lenders and thus hopefully increase the activity in that space and help with workforce housing and other issues that we're having across our state. So we believe this is a good bill. You voted for it one time. I'm asking for you to just do it one more time for me for Senator Goodman and vote green on Senate bill 119. Mr. Speaker, I will be glad to stand for any further questions. Representative Rhonda Taylor to your left has recognized for a question. Thank you, Mr. Speaker. The gentleman you? Absolutely, yes, ma'am. Can you share with me how a personal property is converted to real property? Yes, ma'am. That is a process that is somewhat unique to manufactured housing and mobile homes. So generally a mobile home or manufactured home is treated as movable property and because it gets carried on the highways, it gets a certificate of title just like a car. And so if you make a loan on a mobile home when it's in that movable state, just like a car loan, the lender will take possession of the certificate of title and get placed on the title as the lean holder. When you cite a mobile home on a piece of property, you can have the title surrendered, which converts that manufactured home from the legal category of personal property, which is movable tangible property to real property. And then there's different rules that govern how you would convey it, how you would sell it, how you would take it as collateral for a loan. But the process basically involves getting a certificate of permanent location and filing it with the clerk, then taking that and the certificate of title to the tax commissioner and you surrender the certificate. So it's at that point sort of canceled and the home is treated as part of the real estate. Do you further you? Yes ma'am. I'm surprised the lady doesn't regret the questions just for now ready, but I'm glad to continue. Oh, your explanation is absolutely fine. I just want to make sure that we're clear that attaching the real property to the land is what I mean, I'm sorry, attaching the personal property to the land is what's making it become real property. Well, it can, but so you have to do that as part of the process, but surrendering the title is a way to conclusively have the mobile home deed to be real property. There's a lot of factual inquiry if you don't have that surrender of title procedure and that's why it was derived to sort of get a conclusive rule for everybody. Well, the clarity is needed because in one of the areas that I do in the legal field is bankruptcy and declaring this needs to be understood. Yes ma'am. You know what we're talking about. Thank you so much for the question.\n\nThe gentleman has one more question if you will yield. Yes, sir. Representative Al Williams recognized for a question right down front. Thank you for speaking with the gentleman yield. Absolutely, sir. Is it not true that in the process of paying for saying a mobile home that you can have the mobile home for closed on and removed but not lose your property? Is that not so? Yes, sir. That's absolutely correct. Thank you. Mr. Chairman, this is a further question. Thank you, Mr. Speaker. Ladies and gentlemen, I ask your favorable consideration of Senate Bill 119. You're the well. Thank you. Good explanation. Thank you. Is there an objection to the previous question being ordered? Here in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report the committee has agreed to shout this bill now pass. All in favor of the passage of the bill? We'll vote yes, all those opposed. We'll vote no, and Mr. Clerk. Will you unlock the machine? The bill is ordered. Have all members voted for what purpose is represented? Petrie rise. Parliamentary inquiry, Mr. Speaker. The State should inquire. Mr. Speaker is not true. This is historic day because as soon as Representative Jason Ridley finds where his home is, he has an opportunity to own a piece of real property. A man is where his heart is and where his home is. And so down about that, congratulations, Representative Ridley. If all members now voted, all members voted this, Mr. Clerk. Will you lock the machine? On the passage of Senate bill 119 to Yays or 168, the Nays are zero. This bill has received a requisite cost of some majority. Is there for a past? We have a couple of agrees and disagrees and some other business, but we have some young people in the gallery. We're going to take a moment and honor them because they've got to get back to getting what they do and ask going back to school. Representative Anissa Jones is recognized for a distinguished group of young people. Representative Jones, give the lady your attention, please. Thank you, Speaker. If there's any members of the making delegation, please come up front with us because we have some of the pride of making Bill County with us here today. And because I am a proud Northeast Raider graduate of 1989, and I'm glad that they are in the people's house today because we are celebrating a milestone for our school. And I still say our cause I'm still a proud Raider. This last past year, and our Raiders had a phenomenal season for football, as well as they went to the state championship for the class A Division I. And hey, yeah, it does deserve some applause. But however, we fell a little short, but that's still not a reason to celebrate because our team had not been to the state championships since the 70s. So I thought it was not robbery to make sure that we honor them and the good work that they did this year as going to the state with this resolution that I have before. But I do want to recognize those that are on the floor with us today. We have making Bill County Schools District Superintendent, Dr. Dan A. Seams. We have the principal of the Northeast High School here today, Dr. Donna Walker Thompson. Our District Athletic Director Kevin Groons is here. Our Athletic Director for Northeases up there with the students, my classmate from B4 Valley State University, Tangy Harnett. We have our head coach, the magnificent Jerry Wiggins that is here, other coaches and attendants, Robert Mays, Quentin Peevy, Trent Allen, Terrence Redman, and none other than their star athlete player, Nick Woodford. Now we're so proud of Nick Woodford because not only is he an athlete, he's a student, a model student of student athlete because he is their valedictorian of their class this year. That is to be commendate. So I want all those young people from B. Northeast High School to stand up and receive your flowers while you are here. And we're going to let you know that we love everything that you are doing to make us great a proud. And with that, I yield the will. Congratulations. Congratulations. Good to have you all in the people's house. Congratulations to the athletes or the kids. Athletics is good to have you all with us. Thank you, Representative Jones. Representative Gerald Green is recognized for a motion, Representative Green. Thank you, Mr Speaker. I move that the House agree to the Senate substitute to House Resolution 97. Mr. Clerk, will you read a caption? House resolution number 97 by Representative Green in the 154th authorizing the advance of certain state-owned property located in various counties in Georgia. Chairman Green is recognized to explain his Senate substitute to House Resolution 97. Thank you again, Mr Speaker. Ladies and gentlemen of the House, I bring you House Resolution by Substitute. This is the Committee Substitute that the Senate provided to House Resolution 97. They are adding two particular parcels to the to convey. And this is the just didn't get them in time over here for the House to take care of them. So the Senate took care of them in their one-on-miss for Fortin County. The other is Sumptu County and those individuals that are affected by the substitute have been notified in their districts. And that's the gist of that particular part of House Resolution by Substitute to House Resolution 97 and I ask that you vote for House Resolution 97. Gentlemen, have no questions. All the General's motion that the House agree to the Senate substitute to House Resolution 97, all those in favor will vote yes, all those opposed will vote no. Mr. Clerk, will you unlock the machines? Have all members voted? All members voted? If so, Mr. Clerk, will you lock the machines? The General's motion that the House agreed to the Senate substitute to House Resolution 97, the Yees or 162, the Knees of the Zero, and the House agreed to the Senate substitute and House Resolution 97. Chairman Green has recognized for another motion. Thank you, Mr. Speaker. It's a good feeling to go ahead and get these out of the way before that great day that's coming. I move, Mr. Speaker, and members of the House to agree to the Senate substitute to House Resolution 98. Mr. Clerk, will you read the caption? House Resolution 98 by Representative Green and the 154th and others authorizing the grant of non-exclusive easements for the construction, installation, operation and maintenance of facilities, utilities, roads and ingressants and egresses in over and upon various properties owned by the State of Georgia. Representative Green has recognized to explain the Senate substitute to House Resolution 98. Thank you, Mr. Speaker. This is the substitute that the Senate had sent over in regard to our easements. It's our annual easements that has given each year. And we are adding to that in the substitute of the Senate added and we're going to agree to it. I hope is Barra County, Glen County, Habersham County, Hall County, House and County and Jeff Davis County and all of these deal with the easements. And I ask for your payable support of House Resolution 98 by Senate substitute. No questions, the General and General of the Wheel. On the General's motion, that the House agreed to the Senate substitute, House Resolution 98. All those in favor will vote yes. All those opposed. We'll vote no, and Mr. Clerk, will you unlock the machines? All members voted. All members voted if so, Mr. Clerk, will you lock the machines? On the General's motion, the yeas are 166 and the House agreed to the Senate substitute to House Resolution 98. Chair, recognize the report for motion. Chair, proceed. Forward is recognized. Speaker, colleagues, I'd like to make a motion to accept the Senate amendment to House Bill 55. The only word to accept this Senate substitute, Mr. Clerk, will you read the caption? House Bill number 55, I represent a four to the 170th to be a title of an act to amend Code Section 1562. I believe it's going to draw a janitor relating the number of judges of the Spirit Courts, so it's a survivor of additional judges and Spirit Courts of the Lapa Ha judicial circuit. Perhaps the report is recognized to explain the Senate substitute to the House Bill 55. I would represent the floor to the Senate. So House Bill 55, which adds a third judge to the Lapa Ha judicial circuit in the Senate, the Senate substitute simply corrects an effective date. I was part of that conversation and I agreed to the amendment that changes that date in Section 2 from July 2026 to January of 2026. I would appreciate everyone's support of this amendment and this bill. And if there are no questions, I yield. Lady has no questions. She's yielded the well. On the ladies' motion, the House agreed to the Senate substitute to House Bill 55. All those in favor of vote yes, all those opposed will vote no. And Mr. Clerk, were you in lock the machines? All those in favor of vote yes, all those opposed will vote no. And Mr. Clerk, were you in lock the machines? All members voted. All members voted. If so, Mr. Clerk, were you in lock the machines? On the ladies' motion, the yes, or 166 and nays are zero. The yes, 166 and nays zero. The House has agreed to the Senate substitute to House Bill 55. The proteum of this House, Representative Jones, is recognized for a motion. Thank you, Mr. Speaker. I move that the House agree to the Senate substitute to House Bill 614. Mr. Clerk, were you in the caption? House number 614 by Representative Jones, the 47th and others to be titled. Back to a man-code section 25-10-2, the Fisher-Coda Georgia annotated relating to prohibited fireworks activities and application of noise ordinances. Mr. Clerk, Jim Jones is recognized to explain the Senate substitute to House Bill 614. Thank you, Mr. Speaker. Members, this relates to the bill to provide a degree of protection for our small horse farms by allowing a local government to pass a local ordinance should they choose to prohibit the use of fireworks. The original bill was 100 yards. The Senate preferred allowing a local government the discretion up to 200 yards and I agreed in the bill passed 50 to 1 in the Senate. I'd ask for your favorable consideration. Thank you. The ladies you are the will. On the ladies' motion, the House agreed to the Senate substitute to House Bill 614. All those in favor will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted. So, Mr. Clerk, will you lock the machine? On the ladies' motion, the yeas are 168. The nays are one and the House has agreed to the Senate substitute to House Bill 614. Members, we have a quite a number of local bills and we would normally take them up at each one each at a time and take a few minutes. If there's no objections to spending the rules and assigning all of these local bills to the government or the court nation, we just have to read, we have the clerk to read the caption on them. Is there any objection? Mr. Clerk, if you read the caption to the local bills and then we will assign them. Unnumbered House Bill by Representative Miles 126 to be entitled to authorize the assessment collection of a technology feed by the Probe Accordor Richmond County. Unnumbered House Bill by Representative Smith the 70th to be titled an act to amend the act, re-incorporating, thriving a new charter for the city in Newman. Unnumbered House Bill by Representative Gulliver the 19th to be titled an act to provide a homestead exemption from Paul the County School District at Valorum Taxes. Unnumbered House Bill by Representative Ridley the 22nd to be entitled an act to amend an act to provide for the numbering of positions of membership on the Cherokee County Board of Education. Unnumbered House Bill by Representative Ridley the 22nd to be entitled an act to provide a homestead exemption from Cherokee County School District at Valorum Taxes. Unnumbered House Bill by Representative Thomas the 21st to be titled an act to provide a homestead exemption from Cherokee County at Valorum Taxes. Unnumbered House Bill by Representative Cummings the 39th to be entitled an act to amend an act consolidating the office of tax collector and tax receiver into the office of tax commissioner of Cobb County. Unnumbered House Bill by Representative Cummings the 39th to be entitled an act to amend an act creating the State Board of Cobb County. Unnumbered House Bill by Representative Cummings the 39th to be titled an act to amend an act creating the state court of Cobb County. Unnumbered House Bill by Representative Campbell the 15th UNCR晚ne prolong balancing homestead exemption from Separation. Unnumbered House Bill by Representative Circumедин. legislatureátred Did Carra Dospenaốngson IING Unnumbered House Bill by Representative boatman the 56th to be titled ein act to amend an act to provide a homestead exemption from Gordon County School District at Vtw taxis, unnumbered house bill by reps and have gained 120 to be entitled and act to amend the act and title and act to create a board of commissioners for the county of Jackson, unnumbered house bill by reps and of jasperous to the 11th to be entitled and act to repeal and act creating the Pickens County airport authority, unnumbered house bill by reps and of jasperous to the 11 to be titled and act to provide a homestead exemption of Pickens County school district out of the alarm taxes, unnumbered house bill by representative Carpenter the 4th to be titled and act to amend the act and action to provide a homestead exemption from Winfield County havered House Bill 5, implemented within the act for an unnumbered house bill by care via theий home share it fitting אתions correct pronunciation genial the bill or taxes unnumbered house bill by reps and have carpenter or the fourth to be entitled and act to men and act to provide for a new homestead exemption from city of How to add the alarm taxes unnumbered house bill by reps and have carpenter or the fourth to be titled act to men and act to provide for a homestead exemption from city of All independent school district of the alarm taxes unnumbered house bill by reps of Kelly the 16th to be entitled act to authorize city of Cedar Town, Georgia, and exercise all redevelopment and other powers provided under the Constitution unnumbered house bill by reps and have Kelly the 16th to be titled and act to provide a homestead exemption from Paul County school district that ballarm taxes unnumbered house bill by reps and have green to the 154th to be entitled and act to men and act creating the lower chat hootsy regional airport authority unnumbered house bill by Representative Taylor the 173rd to be titled and act to men and act to authorize the governing authority the city of Thomasville levy and excise tax and Unnumbered house bill by reps and have a hood of the 175th to be entitled and act to men and act relating to the Brooks County development authority Thank you, Mr. Clerk. All these local bills will be assigned to enter governmental coordination. Members, we have one bill that needs to be moved around a little bit for what purposes rip just chairman Tyler Paul Smith rise. Thank you, Mr. Speaker. I move that house bill 163 be moved from judiciary to judiciary non-sale of both chairman and agreement. Mr. Clerk, will you read the caption? Senate bill 163 by senator Moore the 53rd to be titled act to men that part five article for chapter 11 title 16 The fish go to Georgia and it's either relating to Brady law regulations. All the generals motion that sent a bill 163 be withdrawn from the judiciary committee and Recommitted to the judiciary non civil committee is the objection. Here. You know, it is so ordered We can do that on your demand is my order Okay, members, we're moving on to afternoon orders. We only have a couple. So let's get on with it Reps. Scopeo Is recognized for an afternoon order then Reps and Angle Willis Reps and Scopeo Thank you, Mr. Speaker. It's members of the house at a time when people are losing their jobs due to no faults of their own or Georgia workforce remains a priority. I brought a new resource and for you to help your constituents Directly outside is the goodwill it's Goodwill of North Georgia. It's launching its first mobile career center It's a bus outside if you haven't had a chance to go in there and see it go look at it It really is amazing how they have digital job access Employment services job training they do soft skills, but they travel to you So it's the goodwill on wheels. They'll come to your district put it outside a Walmart a food bank a Community Center bring it to your town halls. It's free and they'd love to come to your district. Thank you, Mr. Speaker. I yield the will Reps and the Reps and the will is Reps and Angle Willis is recognized for an afternoon order. Give the lady your attention, please Thank you, Mr. Speaker Good afternoon colleagues of the house if I may please respectfully have your attention I believe in a word called decor I believe in a word called civility I Believe in a word called respect I believe in the word honor. I Believe in the ancestors I'm grateful for being the byproduct of people who operated by that sort of code We are sent here by our constituents to represent them There was inside the house behavior how we treat one another how we represent the needs of others who believe in us and Give us their vote to represent their interests Protocol requires that we not center ourselves in moments But that we respect one another even though we may disagree when I stand before you today to reaffirm that I'm a black woman from the south I respect With the Holocaust mains And I would never speak against it Conversely Slavery shall not be mocked in this place for it was built By its children sons and daughters of the struggle Me included you included most of us here today because of court of law said we could be We will not be mocked We will not be doomed We will not be trinkets Of negotiation we will be colleagues we will be respectful we will make progress we will move forward Who we are in here versus who we pretend to be is all I want considered and Moving forward it is my hope that we could have respect for one another as colleagues and That we would not mock the very thing that made it possible for us to be here and And then so doing don't hide your face Bring it forth Thank you, Mr. Speaker I yield the well That completes our afternoon orders we will move on to Privileged resolutions Mr. Clerk Members will give the clerk your attention he reads a caption to a group of clear privilege resolutions, miss clerk Honoring the life and memory of Caspon raised and tidwell crats Honoring Jackson Hawks said for winning the 2024 GHS a class 6A individual cross country state championship Commending the Wilcox County Lady Patriots basketball team for winning the 2025 GHS a class a division two girls basketball state championship Recognizing commending great. He shared on the occasion of district 58 day recognizing commending The national bond in corporation foundation recognizing commending historic nor cross business Association recognizing commending Kevin John on the occasion of district 58 day recognizing commending Don台灣 Nicole on the occasion of district 58 day Recognizing and commending Dmitry's Williams on the occasion of district 58 day Recognizing and commending Mr. H錢ke on the occasion of district 58 day Reconinising and commending Maguel Wilson on the occasion of district 58 day day, recognizing commending Lorenzo Gordon on the occasion of District 58 day, recognizing and commending the State Government Affairs Council on its 50th anniversary, recognizing and commending Atlanta News First for its outstanding contribution to civic engagement, recognizing and commending Dana Fowl for her outstanding contributions to journalism, commending the Woodbine Public Library, congratulating the Blackly County High School Girls Cross Country Team for winning the 2024 Class 1A Division 1 State Cross Country Championship, recognizing and commending beyond the ribbon. Congratulating the Blackly County High School Boys, color a cross-country team for winning the 2024 Class 1A Division 1 State Cross Country Championship, recognizing and commending Paul Milliken Feature Reporter for Fox 5, recognizing and commending Marvin F. Phillips and Junior, recognizing March 26, 2025 as Clayton County Day, honoring the life and legacy of Reverend Clarice Wyatt Bell Church and expressing condolences to her family and loved ones, commending Brittany Tompkins, recipient of the 2025 Georgia Single Parent Legacy Builders Award, recognizing and commending Alvin J. Copeland, congratulating the Georgia Southern University Clay Target Team, honoring and recognizing Mark Wasserman for its decades of service and leadership.\n\nRecognizing commending the 2025 Regulars A Session, temporary administrative assistance for the Georgia House of Representatives. Recognizing commending, Dr. Giovanni Schumake. Commending Laura Ray, Barion County's teacher of the year in 2026, Georgia teacher of the year, top 10 finalist. Recognizing commending, Reverend Anthony Maurice Booker. Recognizing commending, Al Fanzo Williams. Commending Ariel Shaw and Southern Crescent Women in Business upon their 2025 Small Business Conference. Recognizing commending, Scott Maxwell on the occasion of his retirement. Recognizing commending Maureen Patton. Recognizing commending Joseph Joey Brown on his outstanding public service. And for other purposes that completes the reading of privilege resolutions. Is there any objection to adopting the privilege resolutions here and doing the resolutions are adopted? We have some announcements. Representative Park Cannon. Give the lady in the will your attention. Thank you, Mr. Speaker. Today our Georgia House Democratic caucus will meet upon adjournment in Capitol Room 230 to continue our conversation. Please immediately leave the floor and head to Capitol Room 230. Additionally, tomorrow we will have a film screening of the film Me Period, which commends all of the work that we have done to put money in the budget to stop period poverty. You are invited out to join us in Capitol Room 230 tomorrow from 12 to 1 p.m. Thank you, Mr. Speaker. Chairman Corbyt recognize one announcement. Thank you, Mr. Speaker. The rule caucus will meet tomorrow at 12 o'clock at the Ag Building. Anybody here comes on. Thank you. Chairman Parsons recognize one announcement. Thank you, Speaker. Energy utilities and telecommunications will meet at 3 p.m. here in Capitol Room 403. Thank you, Speaker. Chairman Tyler Paul Smith recognize one announcement. Thank you, Mr. Speaker. Your Judiciary Non-Cebel Committee will meet at 3 o'clock this afternoon and Capitol Room 132. Thank you, Mr. Speaker. Representative Bonner, Chairman Bonner has recognized one announcement. Thank you, Mr. Williams. Thank you, Mr. Speaker. I'm up here with the co-chair of the Georgia American Irish Legislative Caucus. And we have a meeting today in Room 133 down here in the Capitol at 1 p.m. to discuss the caucus and then a trip to Ireland this summer. So please join us. Thank you. Awesome. Co-chairs. Great caucus, Chairman. Gunther recognize one announcement. Thank you, Mr. Speaker. Judiciary will have a meeting tomorrow morning at 9 p.m. in room 132 of the Capitol. Thank you. Chairman Deicki recognize one announcement. Thank you, Mr. Speaker. Our culture and consumer fares will have a meeting in the morning 8 o'clock 6ix, 6 o'clock 6 o'clock 6 o'clock 6 o'clock 6 o'clock. Thank you. Thank you chairman Lomiston recognize for the announcement There'll be a meeting of the full house insurance committee tomorrow 10 a.m. Room CLO B 506. We have one measure to deal with thank you Chairman Williams and recognize for announcement Thank you mr. Speaker there will be majority caucus lunch today in room 403. Thank you Members you we all remember tomorrow is a committee day so if your committees are meeting you need to be here working Need to be here in attendance to be working That also reminds you there we have pages today. So if you have a page You need to hang around a little bit. Let's get a page photo Representative will wait are you still on the premises? He must be cutting his birthday cake somewhere then Enjoying the life screaming cake riffs if we'll wait has a birthday today Happy birthday riffs. Thank you. We'll wait Oh I'm sorry. I didn't see you we were out of there so you've already had cake a nice cream Good man. I got some balloons for you in my office. Don't worry. You'll be fine Happy birthday I don't think there's anything else coming for some majority leader this house is recognized for a motion Thank you mr. Speaker. I moved that this house stand in recess until five o'clock p.m Then stand adjourned until 10 a.m. On Thursday March 27th 2025 On the motion of the most majority of this house standing recess until five p.m. today and Then we will be adjourned and then we will be back here on Thursday March 27th at 10 a.m. recessed till five p.m. Today then We will be adjourned then we will be back here on March 27th at 10 a.m. On the motion of the majority leader 10 a.m. On Thursday March 27th all those in favor We'll say aye All those opposed we'll say no Wouldn't include we are you standing in recess until five p.m. Then we'll be adjourned Great day a lot of good work. Thank you members You",
  "updated_at": "2026-02-13T22:52:54.318815+00:00"
}