{
  "video_id": "tgSBectIGiY",
  "url": "https://youtu.be/tgSBectIGiY",
  "title": "Georgia House - Day 10 (2026-11-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-11-16",
  "duration_minutes": 43,
  "summary": "Here is a summary of the Georgia House session on 2026-11-16:\n\n**Overview:** This session consisted primarily of routine proceedings, including a scripture reading, prayer, and the Pledge of Allegiance. No substantive legislation was discussed.\n\n**Key Actions:** None detected.\n\n**Bills Introduced (First Reading):** None detected.\n\n**Notable Moments:**\n- The House Chaplain, Rev. Jason Davis, delivered a prayer emphasizing that the legislators are \"God's ministers and servants\" who have been \"hand-chosen\" to govern and serve the people of Georgia.\n- Rep. Lisa Hagen introduced the Chaplain, who is the pastor at her church.\n- Chairman Hogan of the Committee on Information and Audits reported that the journal of the previous legislative day was found to be correct. He also shared an Irish blessing.\n\n**Votes:** No recorded votes detected.\n\n**Attendance:** A quorum was present, as all members \"reported to the floor of the house and took their seats\" for the morning roll call.\n\n**Adjournment:** The transcript does not indicate when the session was adjourned. The next session date is also not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThey are convening, having arrived, all members of this house will please take their seats.\nAll members report to the floor of the house and take your seats.\nThe clerk will ring the bell.\nWe are about to have the morning roll call.\nWe're going to have the morning roll call, all members present.\nWe'll please vote green to signify their presence in the chamber and the clerk will unlock\nthe machines.\nhave all members voted? Have all members voted? If so, the clerk will lock the\nmachines. Doorkeepers will please close the doors and keep them closed. Well\ngood morning. Another glorious Georgia morning out there today. Beautiful. We're\ngoing to begin as we do each day with Scripture reading and prayer by the\nChaplain after which we will pledge allegiance to the flag of our country. Our\nChaplain this morning will be introduced by the Lady from the 156 House District\nRepresentative Lisa Hagen, Representative Hagen.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nIt's my distinct honor and privilege to introduce to you this morning my good friend and my\npastor, the Reverend Jason Davis.\nWe attend Grace Community Presbyterian Church in Lions and he has been our pastor since it was planted in 2015.\nHe does a wonderful job of faithfully preaching from the scriptures every Sunday and we just feel so fortunate to have him as our pastor and I'm just so thankful that he was able to come up this morning and share a word with us.\nus. So thank you Pastor Jason for being here this morning.\nGood morning, House of Representatives. It is an honor to be with you all this morning.\nI appreciate this opportunity. And the Holy Bible in Romans chapter 13, Paul says,\nlet every person be subject to the governing authorities. There is no authority\nThere is no authority except from God and those that exist have been instituted by God.\nTherefore, whoever resists the authorities resists what God has appointed and Paul goes on from there.\nIf we were to read a little farther, we would realize that Paul teaches two things in that account.\nThat God raises up the government leaders that he so chooses.\nAnd the government leaders that he raises up are his servants and ministers for the good of the people\nthat they serve. Everyone who are here in this legislature this morning have been hand-chosen\nof the Lord God Almighty to be here for such a time as this. You are the ones that God\nhas sovereignly chosen. For this place and time, God is the governor of the universe.\nUltimately, of course, He made it. He created the world. His authorship and ownership of\nthe world is the reason that he has authority and all other authority that we\nexperience is not intrinsic but extrinsic. It's been delegated by the Lord and\nGod has seen fit in his good and perfect will to raise up gifted men and\nwomen like yourselves to lead and govern on his behalf. In other words every\nauthority in the final analysis is established not by a democratic vote or\npopular appointment but by the single appointment of the supreme ruler of\nheaven and earth. Paul is saying there that the president of the United States\nright down to the town council member of the most potent of small towns couldn't\nexercise his or her office for five minutes apart from the will of the ultimate\nruler, God himself. And that means a couple of things. It means that each of you will\nbe accountable, of course, to the Lord one day for the job that you were doing here even\ntoday, working hard to represent your constituents well and to serve them for their best interest.\nSo to call you to a strong sense of duty, but it also means that you can call in prayer\nupon the one that raised you up. It just follows that if God has raised you up for this\noffice at this time that you can call on him for help when you need it. Paul goes on\nin that passage, secondly, to say that you are God's servants and ministers for the good\nof those that you govern. One of my favorite theologians is the late R. C. Sproul, well-loved,\nrespected pastor and theologian. And he was once invited to give an invocation at an\ninaugural prayer breakfast for a Florida governor at one point during his ministry.\nAnd Dr. Sproul in that address explained that when pastors are consecrated to the ministry,\nthey're ordained.\nAnd that ordination, he said, is a sacred occasion because we take vows to be faithful to God\nand the fulfillment of our ministerial office in the church.\nAnd then Sproul told the Florida governor, he said,\nSir, today is your ordination day,\nbecause you are being ordained as God's minister\nof civil righteousness.\nIt was the governor's ordination day\nbecause civil magistrates like yourselves\nare ordained by God.\nThey are God's ministers put there to be a blessing\nto the people that they represent.\nthrough governing for the well-being of their constituents.\nEveryone, I want you to hear this morning\nthat you are ministers and servants.\nThose are the exact words that the Apostle Paul uses\nin Romans chapter 13.\nYou are ministers and servants to be a blessing\non behalf of those that God has raised you up to represent.\nAnd if God has raised you up\nas his chosen ministers and servants to the state of Georgia,\nyou know that he is watching.\nSo do it well, do it for the people that you represent,\nand do it for the one that puts you here.\nDo it for his smile, for his approval,\nfor his pleasure, and for his joy.\nWell, I'll just leave you all in closing with this.\nWe live in the greatest state in the nation, don't we?\nYes, the state of Georgia.\nAnd you all obviously think so,\nand that you're here giving your time and abilities\nand service to our great state.\nGod has put us here during 2021, but I will encourage you who are resting your souls\nby grace through faith in Jesus on the cross.\nTo lift your eyes above the here and now and realize that as great as being here in America\nis and as great as being here representing the state of Georgia is, that we are meant\nfor another state, for another country.\nThe writer of Hebrew says that we are looking\nfor another state, another country,\none that has foundations.\nOne who's architect and builder is God.\nThat's the writer of Hebrew's way of saying\nthat we're citizens ultimately of God's kingdom.\nAnd Jesus is our ultimate sovereign, everyone.\nAnd our forever future is to be with Him\nin the glories of the new heavens and new earth.\nThat means this morning that for you all who are in Christ,\nbest is yet to come. Let's pray, everyone.\nHeavenly Father Paul says elsewhere in 1 Timothy 2,\nthat he urges that supplications and prayers and\nintercessions and thanks-givings be made for all people.\nAnd so I pray for this. House of Representatives today.\nI thank you for each and every one of them.\nIt is you that has raised each of them up for a time and\nin place is this to represent and to serve their constituents well to be your servants\nand a govern father on your behalf.\nI pray that you would give them joy in their work, pray that you would give them help,\npray that you would give them wisdom that they might lead well.\nFather, remind them all day long that they are doing this ultimately by your appointment\nand for your glory, amen.\nYou join me in the pledge.\nA pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands.\nOne nation under God, indivisible,\nwith liberty and justice for all.\nThank you, everyone.\nDoorkeepers will unlock the doors.\nThe chair recognizes Chairman Hogan, the chair of the Committee\non information and audits.\nThank you, Mr. Speaker.\nYour committee on information and audits has read the journal\nof the previous legislative day and found it to be correct.\nAnd furthermore, Mr. Speaker, I think it's about time we have\non Irish blessing.\nMay your joys be as deep as the oceans.\nYour troubles as light as its foam.\nAnd may you find sweet peace of mind wherever you may roam.\nOutstanding Chairman Hogan the chair of the Committee on Information and\nAudits reports that the Journal of the previous legislative day has been read and\nfound to be correct. Is there any objection to the confirmation of the\nJournal? The chair here is none and the journal is confirmed. The clerk will read the\nThe resolution establishing the order of business for the day.\nMr. Burns, owner of 15 of us following me establishes the order of business during the first\npart of the period unanimous consensus, introduction of bills and resolutions, first reading and\nreference of house bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here's none and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse bill 11EX by Brooks and the Vanderson, 10th and\neveryone of the 28th will be titled act authorize the city of Cornelia, Georgia to exercise all redevelopment and other powers.\nIntergovernmental coordination.\nThat completes first reading.\nSecond reading of bills and resolutions, there are none.\nNo reports of standing committees were going on now to morning orders.\nThis House will come to order.\nHouse will come to order.\nPlease give attention to the members in the well for morning orders.\nWe've got a number of people that have signed up,\nwho chair is going to limit each morning order\nto not more than two minutes.\nTwo minutes per morning order.\nChair recognizes the vice chair\nof the majority caucus representative gravely.\nThank you, Mr. Speaker, friends.\nI want you to hear me closely this morning.\nMia Motto Masashi says, perception is strong and sight is weak.\nIn strategy, it is important to see distant things as if they were close into\ntake a distant view of close things.\nLadies and gentlemen, there's possibly a member of our body here who can do neither of what\nI just read because they lost their glasses.\nAnd I found these out there on the street this morning, our money exchange, they're a\nnice pair of glasses because I have mine, I was able to see close up things from a distance.\nI'm hoping the same for you. Let me know if you've lost a pair of glasses. Thank you, Mr. Speaker.\nChair recognizes the minority caucus whip representative Wilkerson for a morning order.\nMr. Speaker, I think this body is recognized how mental health issues have impacted people\nacross this state.\nI think many of us can tell stories of family members and the generational impact it has\non us.\nAnd this body has taken a lead in doing some great work\nand a bipartisan effort.\nToday, I come up here to talk about what they're doing\nin Cobb County.\nI want to recognize my sheriff, Sheriff Craig Owens,\nfor instituting the first 24-7 mental health facility\nin a jail.\nAnd this is important for many reasons.\nOne, 70% of the inmates in Cobb County\nand many jails have mental health issues, 70%.\nOn top of that, these individuals\nwill one day transition back to society.\nAnd so the goal is that they will have a soft landing\nwhere they get the help they need as they come back in.\nSo what I would love to see is I would love to see this body\ncontinue the work it's doing, and unfortunately,\nit cost a lot of money to do this,\nthat we put some money behind this in the budget next year\nand work together to be able to do this\nand the other 158 counties that are impacted.\nAnd like I said, I've talked to many of you\nwho have had family members impacted by this.\nAnd I just want to say thank you to Sheriff Owens\nfor doing this.\nAnd I want to say thank you to this body\nfor all the work you're doing.\nAnd I would love to continue to do\nsome great things together again.\nThank you.\nChair recognizes Chairman Parsons for a morning order.\nThank you, Speaker Austin. I'll just take my two minutes here. I know people have obviously\nnoticed the rising prices in gasoline, hard not to, but I don't know how many people\nI know some have, but I don't know how many people have noticed the rising price of natural\ngas. And it's risen over the last year, 150, maybe even 200% here in the United States.\nEurope, it's risen 500 percent. I saw the other day where the Putin has kind of opened\nup the spickets for Europe and letting them have more of the gas, and that's where most\nof the gas, almost all the gas from in Europe comes from. But anyway, we're, you know,\nthere's a lot of, like everything else, a lot of disinformation about the rising prices,\nwhether it's gasoline or natural gas, and we're having an energy utilities and telecommunications\nis having a committee meeting or a hearing this afternoon at 3, up in 403 trying to get\nto to find out what the real issues are, what's causing the rises in the price and particularly\nthe natural gas. And what they see long term, so we have people from industry, industry\nobservers, experts coming in and I would invite, of course certainly what the members there,\nbut this would also be webcasts, members of the house and people out there in the public.\nI would certainly be welcome, I would invite you to come in and see if we can get some\nof the actual facts about what's causing these prices because that's the only thing.\nAnd people are going to start asking you, depending on how cold this winter is, not just\nhere in Georgia, but across the country, the colder it is, the more the shortages are\ngoing to be and the higher the prices are going to be.\nSo I think it would be important to tune into it.\nWe live in an age of information.\nIt seems like we live in an age of disinformation.\nThat's a whole other topic that I'll talk about another time.\nWell, one quote.\nFrom a general who's not very popular,\nhas not been very popular here in Georgia\nwith the years, certainly a long time ago,\nWilliam T. Cumpsey Sherman said.\nWilliam T. Cumpsey Sherman said,\npeople will believe a delusion harder\nthan they will believe the fact.\nThank you.\nHe must could see into the future, Chair recognizes for a morning order representative Bentley,\nChairman Dickie, and Representative Butler for a morning order.\nThis is it.\nGood morning, colleagues.\nAnd thank you, Mr. Speaker.\nI'm so proud to stand here this morning and announce that today is a special day in\nin the state of Georgia.\nIt is the birthday of Mr. Lester P down in Butler, Georgia.\nHe celebrated his 91st birthday on today.\nHappy birthday, Mr. Lester P.\nAnd I asked the chairman, my focus\nfrom America's chairman, Robert Dickey,\nfrom New Zealand, and representative, Debbie Buckner,\nfrom Junction City, to join me in this big announcement,\nbecause P brothers and cooperated\nthat served the state of Georgia for many, many years.\nWith Georgia being the number one state to do business,\nwe are proud to have P brothers incorporated in our state\nfor over 70 years.\nP brothers is a Christian based family business\nfound on values of ethical standards,\nopen dialogue, and truthfulness.\nAnd Mr. Lester, we are all here celebrating\nyour 91st birthday here in his family\nor back home watching this morning.\nSo today is Mr. Lester Pee's day in the state of Georgia.\nSo thank you, Mr. Speaker.\nThank you, colleagues.\nAnd we're celebrating the birthday of Mr. Lester Pee.\nThank you.\nThank you.\nGood job.\nChair recognizes Representative Cannon for a morning order.\nThank you, Mr. Speaker.\nGood morning, members.\nI'm here today to bring some attention to the need\nfor us to advocate for at-risk renters\nin the state of Georgia.\nAs many of you may have attended this morning,\nDCA held a conversation with legislators\nabout the ERA, the Emergency Rental Assistance Funds\nthat have been given by the federal government.\nAnd at this point, the percentage of how much has been spent\nby the state of Georgia is 9% out of that total amount\nwhich is alarming and it is necessary for us all\nto think about how during COVID-19 this pandemic,\nlots of unemployment, there are many families\nwho are challenged right now with those rental payments.\nSo anything you can do possibly to reach out\nto your DCI representatives\nand to also speak with your constituents\nwould be really appreciated in this time.\nThank you very much.\nChair recognizes, Chairman Houston, Chairman Dempsey, Chairman Darlene Taylor,\nChairman Cooper, Speaker Pro Tem Jones, Representative Oliver, Representative Lot,\nChairman Tankersley, Chairman Ballinger, Chairman Rich, Chairman Lynn Smith,\nChair and Chairman Matheak for a morning order.\nGood morning.\nThis is a surprise for Speaker Raulston,\nbut it's no surprise to the female leaders\nstanding up here today,\nand we have one Democratic leader as well.\nThe House Republican Lady Chairs asked for this brief\norder to recognize Speaker Rauston for appointing several Republican women as\nchairs of House Committees and our wonderful Mary Margaret Oliver as chair\nof Marthock. A comment was made yesterday that in Georgia it is still rare for\nwomen in Georgia to have elected office. Well we stand here today to debunk that\nmyth not only were we elected but we have excelled in leadership roles\nWe thank our constituents for giving us the opportunity to serve and we thank our speaker for recognizing our talents.\nTo briefly mention everybody, if you just raise your hand speaker, Pro Tem Jan Jones, Chair Mandy Balinger, Chair Sharon Cooper, Chair Katie Dempsey, Chair Penny Hauston, Chair Karen Mathyag, Chair Bonnie Rich, you new best friend, Chair Lynn Smith, Chair Jan Tankersley,\nchair, darling Taylor, Mary Margaret Oliver, and Jodie Lott, the floor leader. So, take\na moment and say, go girls, thank you.\nI was told to say, go women. So, I'm going to say, go great looking women. I'm not\nI just believe it at women.\nThank y'all, you're very kind.\nMy mom didn't raise no food.\nClerk will read the caption to a group of privileged resolutions.\nHonoring the Life and Memory of Emma Jean Boyd.\nHonoring the Life and Memory of Mr. Adonis Ross A.D. Butler.\nCommending Ashley Beust,\nTry City's High School's 2021 Professional of the Year.\nCommending Philip Miller, Try County's High School's 2021 Teacher of the Year.\nRecognizing commemorating the 76th anniversary National Disability Employment Awareness Month\nand the 31st anniversary enactment of the Americans with Disabilities Act of 1990\nand for other purposes that completes the reading of the Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions?\nThe chair here is known and the resolutions are adopted.\nListen up, we got some announcements.\nListen up. We have some announcements. We have work that is going on here. Chair\nrecognizes Chairman Cooper for an announcement.\nThank you, Mr. Speaker.\nI feel to realize what creatures of habits we are.\nWhen I ask everybody to bring a gift, a Christmas gift for Toys, for Toss, and put them in\nthe boxes down as we go out of the Capitol, I'm used to coming in the L.O.B. in the Vista's\nentrance.\nAnd yesterday I had three people that had brought gifts\nasked me where the boxes were.\nOkay guys, this is a reminder to bring a toy\nto make some child that will not be as fortunate\nas your children happy at Christmas and the boxes.\nYou get off the elevator on first floor,\nyou turn to the right, you turn to the right\nlike you're gonna go out of the building\nand there are two boxes there on either side, right before\nyou get to the officers and it says,\nSo hopefully you will find those boxes and thank you to everybody that's already brought a toy.\nThanks.\nChair recognizes Chairman Newton for an announcement.\nThank you, Mr. Speaker.\nThe committee on access to quality health care will be meeting at 1 o'clock today in 606 of the L.O.B.\nWe've got some important topics on both mental health and network adequacy.\nIt's glazes over a little bit, but mental health is an issue.\nWe all want to seriously address.\nIt's going to be a good hearing.\nWe've got some great people presenting.\nI look forward to seeing you.\nChair recognizes Chairman Petri for an announcement.\nThank you, Mr. Speaker.\nMembers of the Human Relations and Aging Committee\nwill meet at 1.30 today in 3.41.\nWe're going to have some very important discussions\nand hearings about our nurse staff shortage\nand facilities across the state\nand to deal with the issue of retention\nand recruitment for nurses today and going forward.\nHope everyone can be there, thank you.\nChair recognizes Chairman Parsons for an announcement.\nThank you, Speaker.\nJust once again, I want to remind about the energy utilities and telecommunications meeting\ntoday at three on the important issue that I spoke about before.\navailability and pricing of natural gas,\nespecially for us here in Georgia.\nThree o'clock, room four, one,\nand a four with three weather upstairs.\nThank you.\nThanks, Speaker.\nChair recognizes Chairman Bickey for the announcement.\nThat appears to complete our announcements.\nThe chair now recognizes the distinguished majority leader of the House for a motion.\nWell, thank you, Mr. Speaker.\nTo the distinguished speaker, Mr. Speaker,\nI move that this house stand adjourned\nuntil 10 a.m. tomorrow, Wednesday, November the 17th, 2021.\nMajority Leader has moved that this house be adjourned\nuntil Wednesday, November 17th at 10 a.m.,\nall those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes clearly have it.\nThis house will be adjourned until...\n",
  "updated_at": "2026-02-12T12:41:36.878273+00:00"
}