{
  "video_id": "TJ7mdEmwgss",
  "url": "https://www.youtube.com/watch?v=TJ7mdEmwgss",
  "title": "Georgia lawmakers push to regulate data centers",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the key points from the Georgia legislative session transcript discussing bills to regulate data centers:\n\n## Overview\nThe Georgia legislature is considering bills to regulate the growing data center industry in the state. The bills aim to address concerns around water usage, electricity costs, and tax incentives for these large facilities.\n\n## Key Actions\n**HB 528**: Requires data centers to disclose upfront information about their water and electricity needs in order to be eligible for tax incentives.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced in this transcript.\n\n## Notable Moments\n- Representative Debbie Buckner discusses concerns from her rural constituents about the impacts of multiple proposed data centers in one county.\n- Senator Chuck Huffstetler explains his bill to require data centers to pay the full costs of their electricity usage rather than passing those costs on to residential ratepayers.\n- There is discussion around the water usage of data centers and the potential for closed-loop cooling systems.\n- Lawmakers express interest in re-examining tax exemptions for data centers, noting they cost the state around $3 billion per year.\n\n## Votes\nNo recorded votes are mentioned in the transcript.\n\n## Attendance\nNo quorum or attendance details are provided.\n\n## Adjournment\nNo mention of when the session adjourned or the next scheduled session.",
  "transcript": "For some, there's a lovehate\nrelationship when it comes to\ntechnologies. There's love for what it\nprovides with everything at our\nfingertips on a keyboard. But with the\ngrowth of AI, there's a backlash in\ncommunities when it comes to having data\ncenters the size of football fields or\nbigger in their backyards. Georgia's one\nof the top data center markets in the\nnation. And joining me are two lawmakers\nlooking to regulate data centers in\nGeorgia. Republican Senator Chuck\nHuffstetler of Rome is chairman of the\nSenate Finance Committee. He's also an\nexeicio member of appropriations among\nhis other committees. And also with us\nis Democratic Representative Debbie\nBuckner of Junction City. She's on House\nAppropriations and she's secretary of\nthe House Rural Development Committee\namong all of her committees, too.\nWelcome to Lawmakers again this session.\nGreat to be here again, Donna.\n>> Love to have you here. So, you both have\nbills on data centers and they're both\nbipartisan. They're your bills. They're\na little different different. Before we\nget into the bills, I'd like to know\nwhat led you to even take on this topic\nand you know, I'll start with you,\nRepresentative Buckner.\n>> Well, um, last session there were about\nfour proposals in one of my counties and\nthey were it's a rural county and there\nwere a lot of questions. How much water\nwill they use? How much electricity will\nthey use? Where will that come from?\num who's going to be responsible for\nmaking sure that all the things that\nthis data center needs can be provided\nand not hurt the existing customers, the\npeople that live in the county. Now,\n>> so there were going to be four in just\nyour county.\n>> There were four different entities\nlooking at spots in one county.\n>> Wow. What led you to get into this?\nWell, I went back in 2017 and saw a data\ncenter in uh Nevada. And my bill was\nactually last year. It's a continuation\nof last year, Senate Bill 34 that said\nwe want them to simply pay all their uh\npower costs, their electricity costs.\nWe've had six rate increases in a couple\nof years. And I gave it to the PSC and\nthey then came up with a rule that said,\n\"We're going to make them pay all their\ncost.\" And Georgia Power agreed to it.\nAnd I said, \"Well, then y'all like my\nbill?\" It says exactly that. And they\nsaid, \"Well, no, we don't like your\nbill.\" Uh, so it makes me wonder, too\noften those things are hidden behind\ntrade secrets so that you don't really\nknow who's paying for them. But, um,\nit's it's important that we codify into\nlaw that they pay all their costs. Our\nconsumers have had way too many rate\nincreases. I think we saw from the PSC\nelections in November, the consumers\naround the country were very unhappy,\nRepublicans and Democrats both. And so\nwe need to get protection for the\nconsumers. We've we've got uh 60-year\ncost still for instance on plant Vogle.\nThe gas turbines they're wanting to bill\nfor the data centers are they're going\nto bill us for over 45 years. Who pays\nfor that if they're gone a few years?\nEven the PSC staff said, \"Yeah, the\nprotection looks like it's there for a\nfew years, but we don't know after\nthat.\" So we need to protect our\nconsumers. Our rates are in the top\neither fifth or highest rates in the\ncountry according to two different\nstudies. We shouldn't be that way. The\nconsumer shouldn't be getting all the\ncost.\n>> Yeah. So your bill it would do exactly\ndo what\n>> it would say that all the cost\ntransmission distribution substation any\ncost for the data centers could not be\nput on the consumer's bills. They have\nto pay all that cost. as it is right\nnow. Too many of them only pay the\noperating cost and all the construction\nlike Vogle cost a 25% increase on\nresidential bills because they've got\nall the construction costs to pay for\nthat for the next 60 years. Let the\ncompanies that are needing this\nadditional electricity pay for it. And\nto that point in 2023 residential\ncustomers in Georgia bought less\nelectricity from Georgia Power than they\ndid in 2011. The demand's not coming\nfrom the residential customers. Why are\nthey paying all the cost? Wow, that's\nthat's interesting. We're going to get\nback to your bill a little bit more.\nRepresentative Buckner, your bill HB528\ndeals with more transparency when it\ncomes to data centers. Tell us about it.\n>> Well, we were really concerned in my\npart of the state about um telling us\nupfront what you're going to need. If\nyou're going to come be a neighbor of\nours, we want to be a good neighbor of\nyours and we want to know what how many\ngallons of water a day, how many\nmegawatts. We wanted to know that\nupfront and and we've kind of made it be\na carrot or stick kind of situation\nwhere you tell us that before you start\napplying for your permits and and um\nmoving forward with your project and\nthen that will mean that you will be\neligible for whatever tax incentives\nthere might be. If you don't tell us\nthat upfront, then you're not eligible\nfor those incentives. So, it gave some\nleverage to the local counties. Um we\njust felt like that was fair. it was\nfair to for them to provide the\ninformation. If if I invited you to\ndinner at my house, I'd want to know how\nmany people were coming. I'd want to\nknow if you had any allergies so I\nwouldn't cook the wrong thing. Well,\nthat's the same kind of situation here\nfor our counties. They need to know that\nthey've got enough water to take care of\nthe families that are counting on it\nright now, plus the data center if it's\ncoming. They need to know about the\npower as well.\n>> Yeah. Let's let's talk about that water\nfor a second. Some people don't\nunderstand why they need so much. It's a\ncooling.\n>> Right. Right. They use millions of\ngallons of water. And in the beginning\nwhen we I first learned about data\ncenters, the um data centers were very\nconsumptive. They used it, let it go.\nUsed it and let it go. So it was\nconsuming the water. Now since we've\nbeen putting in all these bills, we have\nmore people saying, well, we can do a\nclosed loop system where we're recycling\nthat water and the water's used to cool\ndown all of the equipment that's inside.\nIt gets very hot and of course in the\nsummer really hot. So they have to make\nsure that they keep it cool.\n>> So do we have any guarantees that will\nhappen at this point?\n>> We could we could very easily say that\nthey're all required to have a closed\nloop system that they were required to\nuse gray water. We could say that they\nwere required to to do all kinds of\nthings. But we have not been doing that.\nAnd that's what's been a little bit\nconcerning for local governing\nauthorities, a lot of legislators\nbecause we've got about eight bills now\nI think on different things to do with\ndata centers. So people are beginning to\nsay, you know, maybe we need to slow\ndown a minute and look at this and see\nwhat we need to do.\n>> Yeah. I think the interesting thing when\nthey were first coming in, people would\njust see these huge spaces be buildings.\nThey didn't really know what they were.\nThey look like warehouses. So there's\nthat part of it, too.\n>> And and I need to add, I am not opposed\nto data centers. They need to be built.\nUh we simply want them to pay their\ntaxes, uh pay their electricity cost.\nthe the closed loop system. I've got a\ncounty in my district that's already\nrequiring those. I would liken it to say\nyour car radiator. You use the same\nwater over and over again.\n>> So, um they they pay a tremendous amount\nof property taxes. They don't bring uh\nmuch revenue to the state. But we've\nalso got an exemption that the finance\ncommittee has looked at today. One of\nthem a bill by Democrat, one by\nRepublican to eliminate those. That\nsales tax exemption they get is between\nthe state and local money is about $3\nbillion a year. You know, we collect 15\nbillion in state income taxes. Three\nbillion is a lot of money. And one of\nthe things says if you and I go to\nWalmart and buy a laptop, we pay sales\ntax. But if you buy 15 million worth,\nyou don't pay sales tax.\n>> We need to level the playing field for\neverybody.\n>> And they were given those tax breaks\nbecause it was looked at as an economic\ndevelopment arm, something to to bring\npeople in. You don't think they need\nthat anymore?\n>> No. And a University of Georgia study\nthat I had done, I'd ordered it last\nApril, came out and said at least 70% of\nthem would come without any of that $3\nbillion given to them that it's totally\nunnecessary. We're throwing our money\naway.\n>> Right. Well, how do you feel?\n>> Well, that I I read that same study and\nthank you for ordering it because it was\nvery enlightening. Um, we've given away\nprobably over close to $500 million in\ntax credits. U, it's the it's the way\nwe've always been used to doing\nbusiness. you feel like you have to give\nsomething to a company to come to the\ncommunity to provide jobs. Um, and it\nprovides some construction jobs. It's\nthere's a lot of controversy about how\nmany jobs are there after the\nconstruction's complete, but um there is\na lot of um unknown about what do we\nreally need to do we really need to\noffer any kind of tax incentives. They\nare getting a lot of things here in\nGeorgia because we have abundant water.\nwe have uh a good network of of power\ngeneration and we have workers that can\nwork. So all of those things make us a\ngood place to come without us having to\ngive all these tax credits and they're\njust taking advantage of them because\nthey're there.\n>> Now Senator Huffedler said he he isn't\nagainst them. What about you? Are you\nnot against them?\n>> Oh no, I they're necessary. We're going\nto have to have them. If you anything we\ndo that um with a cell phone to a\ncomputer, whatever, we're going to have\nto have data centers. But um we need to\nbe sure that they are in the right\nlocation where the resources that the\ndata center needs can be provided\nwithout a hardship to the community.\n>> I know we're hearing so many bills. You\na few of them are likely to pass, right?\nYou're feeling good about it this year,\n>> right? I think there's going to be some\nbills that do pass out. I hope they pass\nout of both the House and the Senate.\nYeah. But uh\n>> that's the key. They may get the\ncrossover day, but they may not go any\nfurther. Yeah. You feel the good about\nyours, too?\n>> Well, we're hoping that um something\nwill move over in the House. There are a\nlot of bills over there that are just\nsitting around waiting, I think, to see\neither what the Senate's going to do or\nhow they might be able to combine them.\n>> And I think you may see some bills\ncombined. There may be one that looks at\nthe tax credits that puts some\ntransparency on it, which I fully agree\nwith that. So, we'll see.\n>> We'll see. We'll keep up with it.",
  "updated_at": "2026-02-14T14:49:20.316784+00:00"
}