{
  "video_id": "tJnwB9bdt6s",
  "url": "https://www.youtube.com/watch?v=tJnwB9bdt6s",
  "title": "QR Codes on Ballots? Rep. Saira Draper Weighs In",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a summary of the Georgia legislative session on QR Codes on Ballots, featuring Rep. Saira Draper:\n\n**Overview**\nThis session discussed the ongoing debate around the use of QR codes on Georgia ballots. Rep. Draper, the only Democrat on a bipartisan committee studying election procedures, provided insights into the committee's recommendations and the broader challenges of reforming the state's voting systems.\n\n**Key Actions**\n- **SB89**: Passed in 2024, this bill requires the state to phase out the use of QR codes on ballots by July 1, 2026.\n\n**Bills Introduced (First Reading)**\nNo new bills mentioned.\n\n**Notable Moments**\n- Rep. Draper discussed the feedback the committee received from voters and county election officials across Georgia as part of their review process.\n- Rep. Draper expressed concerns about the timeline and feasibility of the committee's recommendation to adopt handmarked paper ballots by the 2026 general election.\n- Rep. Draper condemned the recent FBI raid in Fulton County, stating it was an attempt to \"undermine the 2026 election\" rather than about the 2020 election.\n\n**Votes**\n- Rep. Draper voted against SB89, which phased out the use of QR codes on ballots.\n\n**Attendance**\nNo specific quorum notes mentioned.\n\n**Adjournment**\nThe session concluded, with plans for the committee to continue its work until the end of 2023.",
  "transcript": "Election issues are always top of mind\nduring legislative sessions and we see\nlots of bills introduced. They're among\nthe most controversial pieces of\nlegislation. We had hoped to have a\ndiscussion today from both sides of the\naisle. We reached out to several\nRepublicans who were unable to make it.\nWe will have them on an upcoming show to\ntalk about the topic. Joining me now is\nDemocratic Representative Cyra Draper of\nAtlanta who is minority caucus chief\ndeputy whip. Her House committees\ninclude budget and fiscal affairs,\noversight, judicial and judiciary, I\nshould say, and juvenile. Welcome to\nlawmakers for the 2026 session. It's the\nfirst time having to be here.\n>> Thank you for being here. You recently\nwrote in a newsletter about what you\ncall the most important election issue\nthat no one is talking about. You were\nreferring to SB89 that passed in 2024\nthat requires the state to phase out the\nuse of QR codes by July 1st of this\nyear. It passed along party lines. You\nvoted against it. Tell us more about it.\n>> Well, I voted against the bill as a\nwhole. That was one portion of the bill,\na very small portion of the bill, but it\nwas a portion of the bill that required\n>> time to address because our current\nvoting system uses QR codes. If you ever\ngo vote in person, uh you vote on a\ntouchcreen, you make your selections and\nthen a ballot gets printed out and there\nis a QR code on that ballot that has\nyour selections. Um but there are folks\nin Georgia that had concerns about that.\nThey said, \"I can't read the QR code. I\ndon't actually know what's embedded in\nthat QR code. So, how do I know that\nwhat I who I wanted to vote for is\nactually reflected in that QR code.\" And\nso, the legislature listened to that and\nthey said, \"Okay, we'll get rid of the\nQR code, but that's only the first step.\nWe have to figure out the how as well.\n>> Okay. So, you were the only Democrat on\na blue ribbon study committee over the\nlast few months on election procedures.\nIt was released, the report was released\nyesterday, and I want to point out that\nwe invited the chair of the committee,\nRepublican Representative Tim Fleming,\nto come on the show, but he was unable\nto make it. He has agreed to come on in\nthe future, but among the\nrecommendations is to extend the\ncommittee to the end of December of this\nyear. So, tell us about that and why.\nWell, I think there's a lot of issues\nthat we have to grapple with when it\ncomes to elections. Uh the system that\nwe are currently using is coming to a\ncontractual end. We can either choose to\nrenew it or we can move into a different\ndirection. I know there's a lot of folks\nthat want us to move into a different\ndirection. And let me just say being on\nthe blue ribbon committee, uh we went to\nseveral pl we we we traveled all over\nGeorgia this year uh because we wanted\nto go to the people and we wanted the\npeople to tell us, you know, what do you\nwant out of your elections? It was such\na privilege uh to get that feedback uh\nand and we are taking that feedback and\nit's part of our recommendations. But I\nthink the thing about election issues is\nthere's you have to hear from all the\nstakeholders. You have to hear from the\nvoters. You have to hear from the\ncounties who actually administer the\nelections. Um and you have to take all\nthat information and then you have to\nexecute. You have to execute a system\nthat works for as many people as\npossible. So it's a long-term process.\nIt's more than what we can do in a\n40-day legislative session. So, I'm so\npleased that we're extending the\ncommittee to do that work and to do it\nwell. That's what's so important.\n>> December 31st. So, we'll hear more about\nthat. Now, another recommendation from\nthe committee is to adopt legislation to\nquote, \"provide voters with the option\nto utilize preprinted handmarked paper\nballots on election day, beginning with\nthe 2026 general election. the\nlegislation should require all ballots\nthat contain a QR code of any kind to be\nhandcounted for the purposes of official\ntabulation. What are your thoughts on\nthis?\n>> So that is the recommendation that the\ncommittee made to address the QR issue\nuh QR code issue that you open the\nsegment with. This would be a solution\nto the QR code issue that we are trying\nto resolve this session before July. Um\nI will say uh in in the report I was\nopposed to recommendation number two.\nUh, I just don't think there's enough\ntime before the November 2026 election\nto make such a major change in how we\nrun elections. And I think it's a tricky\nissue. I think we as a committee are\nstill kind of trying to figure out what\nis the best approach to the QR code\nissue, whether it's what's in the report\nor maybe we make a different kind of\nshift in a different direction. I think\nas a committee, we are still trying to\nfigure that out. So, more to come on\nthat one.\n>> And can you tell us whether we will see\nQR codes in in November? Well, look, I\nmean, the law is the law says we have to\nphase them out by July 2026. So, unless\nwe resend that law, that is an option.\nWe could resend that law. We could delay\nthat law or we can come up with another\nsolution. My hope is that whatever\nsolution we come up with is a\nresponsible solution that doesn't throw\nthe 2026 elections into disarray.\n>> Okay. Do you think the handmark paper\nballot system is the best route? Um,\nlook, I actually am pretty agnostic as\nto what kind of system we use, whether\nit's with the machines that we have now\nor handmarked paper ballots. There's\npros and cons to both methods, as there\nare to many things. Um, what's again,\nwhat's most important to me is that\nwhatever system we use has great\nprocesses and works for Georgia voters.\n>> Okay. What concerns what concerns do you\nhave about the upcoming elections for\nstatewide seats and the midterms in over\noverall? Well, um this is an opportunity\nto pivot to what happened in Fulton\nCounty last week. Uh because what\nhappened in Fulton County, I I I think\none of the worst things we can do is\nminimize uh the threat that it poses. Uh\nthe state has the election\nadministration function. Uh Georgians\nhave been and folks in the legislature,\nI've been in the legislature where folks\non both sides of the aisle have been\nsaying we don't want outside\ninterference with our election. This is\na attempt to involve the federal\ngovernment in what should be a state\nfunction. And I don't care who what you\nare, Democrat, Republican, independent.\nWe should not want the federal\ngovernment inserting themselves into our\nelection. That is exactly what is\nhappening. And uh the threat is being\nmade uh by President Trump that you know\nhe wants to nationalize our elections uh\nand that makes our elections less\nsecure, less safe and it's something\nthat we should all be pushing back\nagainst.\n>> When you first I noticed that you went\ndown there. I saw you in some video.\nYeah. So, you were there when it was all\ntaking place with this the FBI raid.\nWhat were your thoughts about what was\nhappening at the time?\n>> Many different thoughts. It's incredibly\nundemocratic what happened, but I think\nmy my the the main thought was this\nisn't about 2020. So, the the warrant\nthat was executed on uh said they wanted\nall the materials about the 2020\nelection from Fulton County, but anybody\nwho follows the evidence, anybody who\nfollows the facts knows that the Georgia\nelection in 2020 was the most\nscrutinized election of all elections.\nWe had recounts, we had audits, we had a\nuh independent performance review of\nFulton County. There were almost 60\ncourt cases that challenged the election\nresults here. all that failed. So if\nyou're looking at the evidence, there is\nno question that there was no systemic\nvoter fraud in Georgia and that\nPresident Trump did not win Georgia in\n2020. So what was going through my mind\nwhen I was there was this is not about\n2020. This is about undermining the 2026\nelection. Because if you think you are\ngoing to win the 2026 election and your\nparty is going to win the 2026 election,\nyou don't want to undermine the results\nbecause that goes against your\ncredibility. But if you're afraid of\nlosing, you start laying the foundation\nnow to sew doubt.\n>> Okay. Well, we'll hear more about this.\nWe're only on day 11. So, thanks so much\nfor coming in. I appreciate it. My\npleasure.",
  "updated_at": "2026-02-14T14:46:42.235932+00:00"
}