{
  "video_id": "TLKMTX6ZYEE",
  "url": "https://youtu.be/TLKMTX6ZYEE",
  "title": "Georgia House - Day 39 (2026-06-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-06-25",
  "duration_minutes": 261,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 39 (2026-06-25) session:\n\n## Overview\nThe Georgia House of Representatives held an eventful session on June 25, 2026, with several key actions taken on legislation.\n\n## Key Actions\n**HB 1039**: Bill to amend automatic renewal provisions to provide additional protections for consumers - House agreed to Senate amendment.\n**HB 1093**: Bill to create an agriculture commodity commission for wine and grapes - House agreed to Senate substitute.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Debate and explanation of amendments to HB 1039 and HB 1093 by committee chairs.\n- Questions and dialogue between representatives on the legislation.\n\n## Votes\n- **HB 1039**: House agreed to Senate amendment in a 151-0 vote.\n- **HB 1093**: House agreed to Senate substitute in a 150-0 vote.\n\n## Attendance\nA quorum was present, with representatives actively participating in the session.\n\n## Adjournment\nThe House adjourned after completing the day's business. The next legislative session is scheduled for a future date.",
  "transcript": "House will come back to order. House will come back to order. Mr. Clark, would you ring the bell? All right, we're going back to work. All members. Chair recognizes Chairman Sam Watson for a motion. Thank you, Mr. Speaker. I move that this House agreed to the Senate amendment to HB 1039. Chairman Watson has moved that this House agree to the Senate amendment to House Bill 1039, the clerk will read the caption. House Bill 1039 to be titled an act to amend chapter 12, the title 13, if it should go to Georgia, annotated relating the automatic renewal provisions, so to provide additional protections for consumers who enter into service contracts that contain lengthy automatic renewal provisions. Chair recognizes Chairman Watson to explain the Senate amendment. Thank you, Mr. Speaker. Members, all we're doing here is we're changing the 12th month time period to 24 months dealing with automatic renewals. There was an agreement reached on behalf of the Senate on behalf of most of the people that are in the industry that do these type of auto renewing contracts to kind of meet in the middle. And then we also just put into the piece of legislation here, the effective date so that everybody knows when to be prepared for this. And those are the changes. I'm glad to take any questions. You did not appear to have any questions. Thank you, Mr. Speaker. Appreciate your support. On the gentleman's motion, this House agreed to the Senate amendment to House Bill 1039. All those in favor? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. All right. Alexander Hanoloowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnic, Abstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Steven's R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Alan, Baysmore, Vernau, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McLeod, Meeks, Mitchell, Morby, Morris C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Rova Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, Turner, Lensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Bonner, Buckner, Yes, Burchette, Yes, Calwell, Campbell, Cantrell, Dickerson, Duke, Campbell, G, G, G, G, G, Gordon, Green, Gullet, Jones J, Yes, Kirby, Lot, Yes, Mathis, Yes, Meets, Mopzahad, Yes, Park, Prew it, Rod, Yes, Singleton, Stovall, Yes, Williams R, Yes, Bar, Beasley T, Yes, Boate, Cannon, Clark J, Dempsey, Dollar, Drenner, Drier, Duke's, Fleming, Gilligan, Hitchens, Hogan, Holly, Hutchinson, Jones J, Jones T, McCall, Nelson, When, Petri, Saints, Smith M, Thomas A, M, Welch, Williams M, F. Members, we'll look at the board and be sure it is correct. Clark will lock the machines. On the gentleman's motion, the eyes are 151, the nasor zero and this house has agreed to the Senate amendment to House Bill 1039. Chair recognizes a representative Meeks for a motion. Thank you, Mr. Chairman. I move that the House agreed to the Senate substitute, the HB 1093. Clark will read the caption to House Bill 1093. House Bill 1093 to be titled an act to men article 2, chapter 8, and titled two of the Efficient Go to Georgia Anitated Relating Agriculture Commandity Commissions generally, so as to provide for an agriculture commodity commission for wine and grapes. Chair recognizes representative Meeks to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen, the House's previous piece of legislation that we passed that creates the agriculture commodity commission for wine and grapes allows the gives the Department of Agriculture the opportunity to appoint members to that commission from individuals that are submitted by the industry. The change in this piece of legislation is simply the implementation date from the original legislation that was passed. Without Mr. Speaker, I will answer any questions. You're going to have a question representative Meeks if you care to yield. Yes, our Mr. Speaker. Chair recognizes the chairman of the House Agriculture and Consumer Affairs Committee. Chairman McCall for a question. Yes, our Mr. Chairman. That's what I heard that the great violinist, Chairman. And is it not further true that you've taken a brand of form by doing this field? The gentleman knows of what he speaks, I hope. Thank you, Mr. Speaker. There are no other questions. I'll yield the will. Do you have another question if you care to yield? Yes, our yield for one more. I like that here through the great violin. Chair recognizes Chairman Martin for a question. Chairman, you just mentioned that change's implementation date. Could you tell me what it changed? It was effective on the Governor's signature. It was originally effective July 1st. Okay, so it's now effective. It will now September 1st. Okay, that's about what I was talking about. I'll look further. I don't see further other questions. Are you either way, Mr. Speaker, thank you. The gentleman's motion at this House agreed to the Senate substitute to House Bill 1093. All those in favor of the motion will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Lennelowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Vodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathiac, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workiser, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Phil, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holley, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Kaush, Kenner, Lopez Romero, Marin, McClain, McCloud, McLaren, Meeks, Mitchell, More B, More C, Morris M, Nelson, Quinn, Paris, Prince, Poland, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wilinski, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, B, C, T, Yes, Fawner, Buckner, Yes, Farchett, Yes, Calwell, No, Campbell, Yes, Cantrell, Yes, Dickerson, Dukes, Dukes, Yes, Gamble, Gilear, Gilear, Gordner, Yes, Green, Yes, Gullet, Yes, Jones J, B, No, Kirby, Lot, Yes, Mathis, Yes, Met, Yes, M, M, M, M, Yes, F, Yes, P, Yes, Rogers, Singleton, No, Stoweball, Yes, Williams R, Yes, Bennett, Bowdie, Cannon, Carpenter, Carpenter, Carter, Corbett, Dempsey, Duhler, Drenner, Dreyer, Dunahue, Duhnergue, Gamble, Jones V, When, Nix, Nix, Ridley, Shannon, Silcox, Smith R, Thomas E, Yerda, Yerda, Members will look at the board and make sure it's correct and the clerk will lock the machines. On the gentleman's motion, this house agreed to the Senate substitute to house bill 1093. The eyes are 150, the nays are eight, and this house has agreed to the Senate substitute house bill 1093. Chair recognizes Chairman Bonnie Rich for a motion. Thank you, Mr. Speaker. I move that this house agree with the Senate substitute to house bill 953. Chairman Rich has moved that this house agree to the Senate amendment to house bill 953. The clerk will read the caption. House bill 953 to be titled an act to amend part one of Article 3, Chapter 5 of Title 50, the fiscal to Georgia Anitator relating the general authority duties and procedure of state purchasing. Chair recognizes Chairman Rich to explain her motion. Thank you, Mr. Speaker. This was a bill requested by the Department of Administrative Services to amend the State Purchasing Act to put into one place certain contractual provisions that the state is not allowed to include in its purchasing contracts. The Senate version provided an amendment to the Purchasing Act to allow the state to enter into agreements with certain cooperative purchasing organizations. Those are the changes and I am available for any questions. I don't see any questions for you. Thank you, Mr. Speaker. I yield the well. On the ladies' motion that this house agreed to the Senate amendment to house bill 953, those in favor of the motion will vote aye. Those opposed to vote no. And the clerk will unlock the machines and call the roll. Alexander Anoloids, Bar, Barton, Belton, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith Fee, Smyrie, Stephens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Bayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClain, McLaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, when, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shadden, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Yes, Fawner, Fuckner, Yes, Farchette, Yes, Calwell, Yes, Campbell, Yes, Dickerson, Dukes, Dukes, Campbell, Gillier, Yes, Gordon, Green, Yes, Colott, Jones J, B, Yes, Kirby, Lot, Yes, Mathis, Yes, Metz, Bob Tahan, Yes, Fark, Pruitt, Yes, Rogers, Singleton, Yes, Williams R, Dubnik, Dukes, Dunahoo, Hanson, Larickia, Thomas E, Representative Hanson is trying to vote. Any others, members look at the board and make sure it's correct. Clerk locked the machines on the ladies' motion. The eyes are 158th and A's are zero. This house has agreed to the Senate Amendment to House Bill 953. Chair recognizes the chair of the House Ways and Means Committee, Chairman Harrell, for a motion. Thank you, Mr. Speaker. I would like to move this House agree to the Senate substitute to House Bill 879. Chairman Harrell has moved that this House agree to the Senate substitute.\n\nto House Bill 879. Clark will read the caption. House Bill 879 to be entitled back to amend Article 1 of Chapter 3, Title 3 of the official code of Georgia annotated relating to provisions regarding the regulation of alcoholic beverages generally. Chair recognizes Chairman Harrell to explain his motion. Thank you, Mr. Speaker. At your discretion, you might want to turn off the audio and video for a second. I'm going to say some kind words about the Senate. The this bill originated in the House House Bill 879 was the home delivery bill that we passed by an over 2 to 1 margin. And the Senate actually improved it in a number of respects. And let me share those modifications with you. If you have the bill in front of you in Section 1, they've included House Bill 674 authored by Chairman Allen Powell that begins the process of streamlining permitting and renewals for our retailers in combination with the Department of Revenue and their local government. So this begins the process to streamline those renewals, reduce burdens and reduce duplications there. So that's House Bill 674 and Section 1, great improvement. In Section 2, this is an issue we've worked on for a year or two. You will recall back several years ago we passed the so-called brunch bill that requires referendums in local communities. And if it passes in a local community, you could potentially buy for on-premise consumption as early as 11 a.m. What Section 2 does is it maintains all those referendum requirements, but it would allow the local governments to allow for both on-premise and off-premise as early as 11 a.m. So you could also purchase at a croagr, for example, as early as 11 a.m. Once the referendums are passed and they're approved by the local government. So again, I think that is an improvement as well. In Section 3 of the bill, this is basically the delivery bill that we passed previously. And there is one modification, a significant modification, again one that I'm supportive of. When it left the House, it was beer and wine only. And this has included the ability to get packaged spirits through a package store in the delivery portion of the bill. Let me remind everyone here that all those safeguards that were placed in the bill remain. None of that was changed. So it's actually a safer and more documented process to make a purchase through delivery than it is at the counter in any retailer. At the counter in any retailer, they make lants at an ID. They may record a birthday, but in this bill, in every instance, you're going to know the buyers, name, address, photo identification. You're going to know all the information about the drivers. And you're going to know who receives it, including a signature, a guaranteed photo IDs that is scanned and retained. So it's a much safer process through delivery than it is over the counter in any of our retailers. If you have a paper copy, turn to Section 4 beginning on page 13. Again, the Senate has added an issue that we've had here before. This is House Bill 76 that was authored by Chairman Ron Stevens dealing with distances. This measure passed the House by 129 to 34. And what this does is it allows the local government through their local ordinances to reduce the distance with regard to college campuses and college campuses only. It does not change anything with regard to K-12 or churches, but the state distance requirement with regard to college campuses would be a maximum and with local ordinance, local support that locals could make a modification of the distance with regard to college campuses. Those of you that know Savannah well know that there's a wonderful university there, Savannah College of Art and Design, but they've built buildings all over the place. And so they're scattered throughout the community. The same is now true here in Atlanta with Georgia State, Georgia Tech. The same is true in Athens with the University of Georgia. And so this allows the local governments to make a modification on distances if they choose. And then finally, if you'll turn back to page 15, Section 7 is a new chapter. And this is actually a Senate bill that was added here. And it was Senate bill 146 that passed their chamber by a 2-1 margin. This deals with tastings. Today you are able to go into a retailer that sells beer and wine, which could be a grocery store. And as new products come to the market, they may offer you a sample before you buy the product and its package a bottle of wine. But today it's currently illegal to have a similar event inside of a package store. So the tastings in Chapter and Section 7 would permit under very strict circumstances to have tastings inside a package store where the consumer could have a limited amount. And those mounts are listed there. One and a half ounces of spirits, five ounces of wine, eight ounces of beer. Once the local governments have been notified that this event is going to take place inside of a package store. Again, all the safety reporting requirements are unchanged throughout the bill. So I would ask your favorable consideration again. In this case, the Senate, I think, really did a nice job by putting House Bill 674 Chairman Powers streamlining into it, putting the referendum requirements remain the same, but allow for off-premise and on-premise, maintaining our delivery bill with the addition of package stores, and then allowing the distances with regard to college campuses, House Bill 76, which was Chairman Stevens bill, and then finally, the Senate bill dealing with tastings. So with that, Mr. Speaker, I'll be glad to answer questions and ask you to agree with the Senate substitute the House Bill 879. You have a question if you care to yield. Yes, sir. I will be glad to. Chair recognizes representative Stovall in room 341. That's a gentleman yield. Yes, ma'am, I do. Is it not true that the portion of HB674 that was including 879 proposed to have the State Department of Revenue to regulate our alcohol licensing in Georgia, and that that takes away from the local community or local jurisdiction, because not all jurisdictions had the same regulations for issuing licenses? I would characterize it very differently. What House Bill 674, the addition to section 1, does, is it encourage the Department to develop a central-as-program, part of the discussion was when you go to get a license, you have background checks. And the information requested from one jurisdiction background check to another jurisdiction's background check might be duplicative, one might ask a little bit more, the other asks a little less. So what this is encouraging is a centralized program with the local governments and the Department of Revenue talk to each other and develop a more comprehensive, single source, if you will, to make it less burdensome on the business person. The local government, and it even says in that portion, if you look on lines 57 and 58, that the Department may require that a valid local license or permit be issued prior to granting the state license. So the locals will maintain that ultimate decision-making authority. And that's true throughout this bill, and the Home Delivery, too. Let me mention that, too, that if this bill passes and the state authorizes Home Delivery, that a local community can say not in our town or not in our city, by ordinance they can say, you can't have a delivery in our community, so we've maintained that in the bill as well. But thank you for the question. Does the government further you? Yes, sir. Are you old? Is it not true that there may be some concerns about the state finding a software package that could monitor all of these issues and more? Certainly, development of software can sometimes be challenging, and this will be no different. So I do know that there are concerns with that. There's concerns with the time frame. Can we get it done in a shorter period of time, or is it going to take longer? But I would say that this certainly will encourage everyone to get started. And in the event that we are in the middle of June, coming up on Sinai Die, the opportunity to extend that, if need be, is a very few months away, rather than a year away. Thank you. Yes, ma'am. Thank you. Chair recognizes Chairman Beverly to your left for a question. Yes, sir, I do. Just a quick question around the liquor licenses. Is this bill contemplated? Big box retail will be able to have the ability to sell package goods, liquor items at this particular point? So this does not change in any way who may be a package liquor store or how many. So for example, in the state of Georgia, there is currently a two-store maximum on package store. It does not change that in any way. So a big box retailer could potentially have up to two other locations that sell spirits, but they could not have more than that. And this bill requires on all delivery that it comes off the retail shelf and goes directly to an address in that same taxing jurisdiction. So there is no shipping of any kind involved in this bill. So if you had a big box retailer that did have a package store, they could not be transferring that to other big box locations. If you had a big box retailer in one city, it would have to come off the retail shelf at that store and go directly to an address in that same taxing jurisdiction. Yes, sir. So in particular, it is circumstance a big box retailer could give the ability to deliver alcoholic beverages. Yes, sir. Because they are big box, we need necessarily cannibalized the smaller guys in the community that are in that community. Do we have the two devices that mean I have the ability to scale the operation actually? Well, and that's a good question, too. And keep in mind, again, mentioning with the two-store limit, by definition, every package store in business in Georgia is a small business. Because the most you can have is two. So they are small businesses. And the testimony we received about the apps and the technology available today, quite frankly, many of those smaller mom and pops if they so choose, would simply sign an agreement with one of the software app providers. And their startup calls could be as low as zero and start making the product available through that app. Do you yield for another question or two? Yes, sir, I will. Chair recognizes the chair of the House Ethics Committee, Chairman Nicks, to your right for a question. Yes, sir, I do. Is it not true that this is another liquor bill that our T-Totaler Committee needs to be aware of? This is definitely a liquor bill. And I would never approach the T-Totaler Committee. We have no votes on all alcohol bills. And I respect the people that choose to vote that way. And they do that for a number of reasons. And I hope no one here has ever found me to try to be persuasive when I recognize there are a number of reasons why people would not want to support any alcohol measure. And I respect you as being a T-Totaler in taking that position. Does the gentleman continue to yield? Yes, sir, I do. I appreciate that. I let one slip by me before I go to the table. I was chairman Green that I would never do that to you. You got a cake out of it, though. Chair recognizes representative Carpenter to your right for a question. Does the gentleman yield? Yes, sir, I do. I just want to thank you for bringing this bill. If anything, is obvious that COVID-19 or pandemic has shown us that we need to have this in the state of Georgia. And this is moving Georgia to the 21st century and as far as alcohol and baggage. Thank you, sir, for bringing this bill. Thank you. Mr. Speaker, with that, I'll yield the well and I'll ask for a favorable vote. And as I do, let me just remind, this bill just passed a day or so ago in this Senate with an 82% positive vote. We can do better. For what purpose does Representative Al Williams rise? Thank you, Mr. Speaker. Is it not true that I want to ask the gentleman? Is this a parliamentary inquiry? All the parliamentary inquiry, sir. Yes, state your inquiry. Thank you, sir. I was a little. I wanted to. Is it not true that I made application to be in the T-Tolo's Club and was turned down? Those background checks are here, aren't they? That's tough. But is it not further true for a very serious standpoint that I really heard the argument about how the big boxes, named out, friends at Walmart, would not affect anybody. And that was right before most of the moms and pops and the locally owned businesses went out of business with feet up. And there were a few T-Totals that went out too. If the gentleman's so states he seems to be very knowledgeable and I'm sure he is knows where off he speaks. On the gentleman's motion that this House agreed to the Senate substitute House Bill 879, those in favor of the motion will vote aye. Those opposed to vote no. And the clerk will unlock the machines and call the roll. Alexander Anolois, about Bar Barton, Benton, Belton, Bentley, Beverly, Blackman, Vody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Fry, Games, Gardener, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lobston, Martin, Matthew, McCall, Morris G, Newton, Nix, Oliver, Parish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Cessler, Silkawks, Smith L, Smith R, Smith V, Smirrey, Steven Zarr, Tankersley, Tanner, Tarrman, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Kenson, Hill, Hogan, Holla, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Moore C, Morrison, Nelson, Wen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A.M., Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Yes, Bonner, No, Buckner, Yes, Richette, Yes, Call Well, Absolutely, Campbell, No, Cantrell, No, Dickerson, Sounding, Yes, Duke's, Campbell, Yes, Millier, No, Gordon, Yes, Green, Yes, Gollett, Jones J, B, Yes, Lot, Mathes, Yes, No, Meets, Mop Taham, Heck, No, Park, Yes, No, Rogers, Singleton, No, Stowe Wald, Yes, Williams R, Bar, Bassmore, Benton, Bernal, Clark, Corbett, Debsi, Duke's, Duke's, England, Fleming, Hitchens, Thompson, Houston, Jones V, Couch, Lopez Romero, Lomston, Lomston, Meeks, Morris G, Morris M, P, P, P, Reeves, Scott, Sharper, Smith R, Tanner, Thomas AM, Thomas E, Watson, Williams A, William Sun, Okay, members will look at the board and make sure it's accurate. You do not want to go home having made a mistake in how you vote on this one. Not telling you you've had a vote, just, All right. Any issues with the board? Clark will lock the machines on the gentleman's motion. The eyes are 114, the Nays are 45 and this house has agreed to the Senate substitute House Bill 879. What purpose is representative McLaren rise? Parliamentary inquiry. Mr. Speaker, isn't that true that the T-totalers were the ones who sounded the most drunk when they voted? I don't know if I would say that or not, but what purpose is chairman Nick's rise? Parliamentary inquiry. Mr. Speaker, is it not true that our little caucus is growing? It would appear so. All right, Chair recognizes representative Rick Williams for a motion. Thank you, Mr. Speaker. I ask this house to approve the Senate substitute for House Bill 983. Representative Williams has moved that this house agreed to the Senate substitute to House Bill 983. The clerk will read the caption. House Bill 983 to be entitled to amend Article 2, Chapter 1 on Title 42, the official go to Georgia annotated relating sexual offender registration review board so it's devise the information required to be provided by sexual offenders when they register. Chair recognizes representative Williams to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen, all this does is add half a sentence. It says, but the sheriff shall be authorized to photograph the offender. I'll be glad to answer any questions, Mr. Speaker. I do not see any questions. I ask for your favorable consideration. On the gentleman's motion at this house agreed to the Senate substitute to House Bill 983. All those in favor will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Manolo-Witz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Voting, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Debsi, Dickie, Dollar, Drenner, Dubnik, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harrell, Hatchet, Hawkins, Hitchens, Holcomb, Holms, Holms, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, Macau, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Bayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Erhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Hollen, Wally, Hopson, Howard,\n\nHutchinson Jackson D. Jones S. Jones T. Jones V. Couch. Kenner Lopez Romero. Marin McClain. McClaren McCloud. Meeke's Mitchell. Moore B. Morris C. Morris M. Nelson. When Paris Prince Pullen. Robeshow. Saints. Scofield. Scott. Shannon Sharper. Smith M. Thomas A. M. Turner. Wollensky Wilkerson. Williams M. F. Williams N. Wilson. Beasley T. Yes. Bonner. Buckner. Yes. Callwell. Yes. Yes. Cantryle. Yes. Dickerson. Yes. Yes. Duke's. Yes. Yes. Gamble. Yes. Yes. Gileard. Yes. Gileard. Yes. Gordon. Yes. Gordon. Yes. Green. Yes. Green. Gollett. Gollett. Yes. Jones J.B. Yes. Jones J.B. Yes. Kirby. Yes. Lock. Lock. Yes. Mathis. Yes. Maths. Yes. Yes. Momptohub. Momptohub. Park. Park. Park. Yes. Fruit. Yes. Fruit. Yes. Fruit. Singleton. Singleton. Yes. Stovall. Yes. Stovall. Yes. Williams R. Yes. Barton. Beverly. Cooper. Corbett. Davis. Dickie. Dickie. Dullard. Dickie. Douglas. Frazier. Yes. Graveling. Green. Hitchens. Jones J. Night. Lopez Romero. McCall. Meeks. Nelson. Nix. Ridley. Smith R. Smith V. Tarvon. Thomas A.M. Thomas E. Thomas E. Wilson. Wilson. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. All right. Everybody. Look at the board. Make sure it's accurate. Who's calling? Oh, Graveling. Representative Graveling. Ellen, pay greens in here. Chairman Gerald Green is in 341. Is he going to vote? Yes. He voted. Anybody else? Clerk will lock the machines on the motion by Representative Williams. The eyes are 162. The nays are zero. The house has agreed to the Senate substitute to House Bill 983. Chair recognizes Representative Meeks for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move that the House agreed to the Senate substitute to HB894. Representative Meeks has moved that this House agree to the Senate substitute to House Bill 894. The clerk will read the caption. House Bill 894 to be entitled to amend Code Section 243 of the official code of Georgia annotated relating to C. Development Commission composition offers bylaws, form, compensation records, audits, and bonds. Chair recognizes Representative Meeks to explain his motion. Thank you, Mr. Speaker. Ladies and gentlemen of the House, the Senate substitute to HB894 makes a couple of changes in the implementation date of the appointments that are made in online 82. Changes it from an even number year to an odd number year and changes the effective date to January 1, 2021. Mr. Speaker, that's the changes in the bill. There are any questions that would be happy to answer them. Do you have a question to you? Yes, sir. Chair recognizes Chairman Barr to your left for a question. Does the gentleman yield? Yes, sir. Does this bill have anything to do with this Attila River? Does Bill does not have anything to do with the Attila River? Thank you, sir. I do not see any other questions. Thank you, Mr. Speaker. I'd ask for your favorable consideration. I yield the will. On the gentleman's motion that this House agreed to the Senate substitute to House Bill 894, all those in favor will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call their oaths. Alexander Aneloets, Barr Barton, Belton, Bentley Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H., Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lohood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, When, Paris, Prince, Poland, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A.M., Turner, Wollensky, Wilkerson, Williams M, Williams N, Wilson, Beesley T, Yes, Bonner, Yes, Buckner, Yes, Perchette, Carl Well, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Duke's, Yes, Gamel, Yes, Gillier, Yes, Gordon, Yes, Green, Yes, Gillette, Yes, Jones J, B, Yes, Kirby, Law, Law, Yes, Mathis, Yes, Mathis, Bomp to Hod, Bomp to Hod, Park, Crue it, Yes, Rogers, Yes, Singleton, Stovol, Yes, Stovol, Yes, Williams R, Williams R, Beverly, Blackwood, Bode, Bones, Carpenters, Carson, Carter, Clark H, Gilligan, Hanson, Jones J, Jones V, Volpesra Merrill, Polaro, Powell, Reeves, Ridley, Saints, Smith M, Tancersley, Tanner, Thomas A.M., Thomas E. Washburn, Williamson. Did you all get a representative Oliver's vote? Representative Bowdie. A majority leader. Look at the board. Look at the board and make sure it's accurate. Clerk will lock the machines on the motion to agree to the Senate substitute to House Bill 894. The eyes are 162. The nasors zero. This House has agreed to the Senate substitute to House Bill 894. What purpose does Chairman Stevens rise? If you sit five minutes, then they'll be in the... To make a motion, Mr. Speaker. State your motion. I move that Senate Bill 162 move back to the rules committee, and the Senate will be recommended. Chairman Stevens has moved the Senate Bill 162, be recommitted to the rules committee. Clerk will read the caption. All right. Would you withdraw that motion, and we'll get you here shortly. Is the Chairman asking for unanimous consent to withdraw his motion? Yes, sir. Is there any objection to the motion being withdrawn? Chair, here's none, and it is withdrawn. Okay, so here's our plan. We are going to now take about a 15-minute break. Stretcher, legs, restroom break. The clerk's office tells me that budget has been printed. If you wish to go ahead and get a copy and start reading it front to back, then are they out back? Why don't we do that? All right, so they will be distributed over the break and put on your desk. So at the end of the break, you will have the budget, and we're going to come back in and take up some more business. I don't plan to keep you very late tonight, but we're going to take a short break. At this time, we'll be in recess for 15 minutes. You You You You You You You You You You You You You You You You You You You You You You You You You\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Senate bill 410 by the center of county, the 18th, Dugan of the 30th, Gouge of the 51st, middle of the 49th, Stone of the 23rd, Nellers, being taught on act two of men, code section 485, 311 of the official code of Georgia, annotated relating the creation of county boards of equalization, duties, review of assessments, and appeals, this bill I've been referred to the committee on governmental affairs. That committee recommends that this bill do pass to be a committee substitute. Chair recognizes majority, who have Kelly to present the bill. Thank you, Madam Chair. I come before this house today with the House Committee Substitute for Senate bill 410, which does two things. First, it closes a loophole that exists for property tax payers in Georgia right now. So when your property is assessed, you have an opportunity to appeal that assessment. And if at the board of equalization level, you were found to have an appraisal 85% or less of the appraised value, then you have an opportunity to recover attorney's fees at that level. However, there's been a loophole that's allowed for an automatic appeal up to Superior Court and those attorney's fees have been wiped away. So this will simply close this loophole. Second, in section two, I have the request of the Department of Revenue for our utility companies when they submit their documents to them. We're asking them to send by electronic means instead of by hard paper copies. The bill's simple, Madam Speaker, I'll be glad to answer any questions. Should there be any? Are there questions? Are there questions? Seeing, it appears you do not have any questions. Now, do you deal the well and ask for a spot of your state role consideration? The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. The bill is not allowed. Alexander Lonoowitz, Bar Barton, Belton Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harrell, Hatchett, Hawkins, Hitchens, Hulcombe, Holmes, Hauston, Hugley, Jackson M, Jasperce, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G,\n\nNewton, Nick's, Oliver, Parish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, D, Smyrie, Stevens R, Tankersley, Tanner, Tarman, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McLaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Quinn, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Bonner, Yes, Buckner, Yes, Hercchette, Yes, Calwell, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Dukes, Gamble, Yes, Gilear, Yes, Gordon, Green, Gullet, Jones J, Yes, Kirby, Lot, Mathis, Yes, Metz, Momp-to-Hon, Park, Yes, Rogers, Singleton, Yes, Stovall, Yes, Williams R, Alexander, Anelowitz, Barton, Beesmore, Benton, Beverly, Blackman, Calwell, Carpenter, Chokus, Clark H, Collins, Depsy, Dickie, Dollar, Douglas, Drenner, Dreyer, Dukes, Dunahue, Earhart, England, Evans, Fleming, Gardner, Gilligan, Gordon, Green, Gullet, Harold, Hatchett, Hulcom, Holland, Holly, Houseman, Jackson M, Jones J, Jones V, Night, Lot, McCall, Meeks, Mitchell, Momp-to-Hon, Morris M, Newton, Paris, Petrie, Perkel, Powell, Prueit, Rich, Ridley, Silcox, Smyrie, Stevens R, Thomas A.M., Thomas E, Tramble, Turner, Williams N, Williamson, have all members voted and check the board. All members check the board. If so, the clerk will lock the machine. On the passage of the bill, the eyes were 139, the nays were zero. The bill having received the requisite constitutional majority is therefore passed. Chair recognizes Chairman Stevens for a motion. Thank you, Mr. Speaker. I move this House agreed to the Senate substitute to House Bill 791. Representative Stevens moves to the House agreed to the Senate substitute to House Bill 791, the clerk will read the caption. House Bill 791 to be a title of an act to amend Code Section 26480, the official go to Georgia, Anitenti, relating the license requirement, practice and pharmacy, dispensing prescription drugs, prescription drug orders, electronically transmitting drug orders, refills, and scheduled to control substance prescriptions. Chair recognizes Representative Stevens to explain a Senate substitute. Like Mr. Speaker, ladies and gentlemen, it seems like 10 years ago, we passed a bill that allows under extreme circumstances, actually, just for the pharmacist professional judgment. If you've got a 30 day prescription, there's total of 90 days left on that, you can fill that at your own discretion, except for class 2 narcotics or control drugs, and the very first prescription. The Senate also added that early refills in times of hurricane or disaster declared by the governor will be, you will not be denied for 30 day supply of drugs even if you're early. So both of these run along with the current emergency order, and I would ask for your favorable consideration. Are there questions? The gentleman has yielded the well. On the gentleman's motion, the House Agreed Senate substitute to House Bill 791, all those in favor will vote yes, all those opposed will vote no, and the clerk will unlock the machine. Alexander Anolowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Demptsy, Dickie, Dollar, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Benton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson, John, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarman, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Alan, James Moore, Bernard Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Johnahoe, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Coush, Kenner, Lopez Romero, Marin, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Bren, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, William Wilson, Beasley T, B, C, T, Yes, Bonner, Yes, Buckner, Yes, Verchette, Yes, Calwell, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Dukes, Yes, Gamble, Yes, Gillier, Yes, Gordon, Green, Green, Yes, Goal, Yes, Jones J, B, Jones J, B, Kirby, Lock, Mathis, Yes, Met, Mop Tahhan, Yes, Mark, Yes, Rogers, Singleton, Yes, Stovall, Yes, Stovall, Williams R, Yes, Lins R, Alexander, Yes, Bar, Blackman, Bode, Carson, Chokus, Clark D, Dicky, Rich, Ridley, Stovall, Tanner, Thomas A, M, Thomas E, Turner, Welch, Wilkerson. Have all members voted and check the board for accuracy. If so, the clerk will lock the machine on the gentleman's motion. The eyes were 142, the nays were zero, and the house has agreed to the Senate substitute to House Bill 791. What purpose does Representative Gaines rise to make a motion? State your motion. I move in the House recommit Senate Bill 407 to the Rules Committee. Representative Gaines has moved that House Senate Bill 407 be recommitted to the Rules Committee to the clerk will read the caption. Senate Bill 407 be taught on act to amend chapter 6 and Title 12 of the EF to Georgia, Antietta relaying the forest resources and other plant life. On the gentleman's motion, Senate Bill 407 be recommitted to the Rules Committee, is their objection? Is their objection? The chair here is not, and it is so ordered. Chair recognizes Representative Rick Williams for a motion. Thank you, Mr. Speaker. I ask that the House approve the Senate substitute to House Bill 576. Representative Williams has moved that the House agree to the Senate amendment to House Bill 576. Clerk will read the caption. House Bill 576 to be taught on act to amend Title 15, is it difficult to Georgia, Antietta relaying the court so as to provide for the distribution priority of partial payments of fine spawn forfurtures and costs. Chair recognizes Representative Williams to explain his motion. Thank you, Mr. Speaker. The only difference in this substitute amendment is Section 3. This act shall become effective upon this approval by the governor or upon its becoming law without such approval. I do not see any questions. Yeal the whale and ask for your favorable consideration. The gentleman's motion, those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machine and call the roll. Alexander Oneloowitz, Barr Barton, Belton, Bentley Benton, Beverly Blackman, Boatey, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett. Dempsey, Dickie, Dollar, Drenner, Dubnick, Destration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nix, Oliver, Parish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Sessler, Silcox, Smith L, Smith R, Smith V, C, Smirie, Stevens R, Tancersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Alan, Bayesmore, perpendesfarie,媽. Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Coush, Kenner Lopez Romero, Marin McClain, McClaren McCloud, Meeks Mitchell, Moore B, Morris C, Morris M, Nelson, Juan, Paris, Prince, Pullen, Robo Show, S, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A.M., Turner, Wilensky, Wilkerson, Williams M.F., Williams N, Wilson, Beasley T, B, C, T, Yes, Funtner, Burtjet, Calwell, Campbell, Cantrell, Dickerson, Dukes, Gamble, Gilear, Gordon, Green, Gullet, Jones J, B, Kirby, Lott, Mathis, Metz, Mophtahan, Park, Yes, Fruit, Rogers, Singleton, Stoneball, Williams, Yes, Bode, Cannon, Carpenter, Clark D, Davis, Dickie, D.D., Hawkins, Holland, LaHood, Lopez Romero, Newt, When, Howl, Prue, Ridley, Stevens R, Stanner, Tarvin, Turner, We'll look at the board and make sure it's correct. Members will check the board. Clark will lock the machines. On the gentleman's motion at this house, agreed to the Senate's substitute, Chair recognizes Chairman Rhodes for a motion. Thank you, Mr. Speaker. I move that the House agree to Senate's substitute, 9998. The clerk will read the caption. House Bill 998 to be entitled to amend Title 27 of the Efficient Co-Dog of Georgia, Annotated Relating and Game and Fist, to change the effective dates of rules and regulations promulgated by the Board of Natural Resources. Chair recognizes Chairman Rhodes to explain his motion. Thank you, Mr. Speaker. This is our Department of Bill that we passed a couple of months ago now. As time went by the last few months, the Department needed to add in a few more things and they did it over in the Senate. This was our bill that updated our H.U.I. and B.U.I. laws. It has our showbass as the official Georgia State Rivering Sport Fish. We had to add in the Lakeland near islands development authority code revision. This is the same thing that we had to do to the Jekyll Island Authority a number of years ago to make sure that our federal leases and our state leases align with our state sub leases with the private business. It also extends the sunset for our air guns. Any questions, Mr. Speaker? I'll try to answer them. I don't think you have any questions. I ask for your favorable vote. Thank you. On the gentleman's motion at this House agreed to the Senate substitute to House Bill 998. Those in favor of the motion will say aye. Those opposed will say no. And the clerk will unlock the machines and call the roll.\n\nAlexander, the Nullowicz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnic, F-stration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Gravelie, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hughley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Parish, Parsons, Peter, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silkcocks, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Carmen, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennedy, Lopez Romero, Marin, McLean, McClaren, McLean, McLeod, Meeks, Mitchell, More B, Morris M, Nelson, Hoenn, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Stevens M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, B, C, T, Bonner, Buckner, Yes, Burchette, Calwell, Campbell, Cannell, Dickerson, Duke's, Yes, Gamble, Yes, Gilear, Yes, Jordan, Yes, Green, Yes, Gollett, Jones J, B, Yes, Kirby, Law, Yes, Mathis, Yes, Metz, Bob Tahan, Yes, Park, Yes, Through it, Yes, Rogers, Singleton, Yes, Stovall, Yes, Williams R, Yes, Alan, Barton, Baysmore, Evans, Gardner, Gravelies, Hitchens, Haustons, Lomston, Newton, Powell, Ridley, Smith V, Smith V, Taker's Leap. Members will look at the board and make sure it's accurate, and the clerk will lock the machine on the motion of the gentleman that the House agreed to the Senate substitute to House Bill 998. The eyes are 157, the nasors zero, and this House has agreed. Chair recognizes Representative Burchette for a motion. Thank you, Mr. Speaker. I make a motion that this House agreed to the Senate substitute for House Bill 966. The clerk will read the caption. Chair recognizes Representative Burchette to explain his motion if he can. Thank you, Mr. Speaker. Again, well, I know it's been a long day, colleagues, but I promise you, if we agree to this berry bill, this is the last time you'll hear about berries this session. If you recall, earlier this year we passed some legislation out of this House that regulated the transportation and harvest of palmetta berries, which is a berry that grows in South Georgia. It's not a farm to berry, it's a volunteer plant. We sent this legislation over to the Senate, and there were some changes made to changes simply. There was a clarification change, line 104, that changed the word farmer to landowner, and this more precisely gets across the intent of this portion of the bill, because no one actually farms these berries. They just grow volunteer on the property. So we wanted to just be clear that you don't have to be a farmer to take advantage of the to not be impacted or affected by this legislation, because there's an exception if you're a landowner, you don't have to abide by these regulations. The other changes that were made that the fines and penalties were changed to reflect and be more in line with our criminal code. I think these are both good changes, I agree with these changes, and I ask that you favorably support this Senate substitute, and if there are no questions, I will yield the well, if there are questions, I will try my best. I think we do have a question. Do you yield? Yes, sir. I've got a couple of questions actually. Let's recognize first the chairman of the House Agriculture Committee, Chairman McCall, to your right. Thank you, Mr. Chairman. Yes, sir. Are you? Is it not true that this is the bill that this keeps on giving? Yes, sir. And one more time please, sir. Are you? Yes, sir. I think it's not true that over the course of this session, both this and over by any of them, the Senate by changing the form of the landowner is continuing their dissing of the Georgia form. If the gentleman so states. He is after all the chairman of the House Agriculture Committee. I would agree, yes, sir. Chair recognizes up in the gallery, I think. It's where he's supposed to be. Yeah, he's in the gallery in the middle. Representative Sains for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, I yield to my friend in roommate. In caution to the reputation that the members have and the other chamber. Does given the Senate substitute, does the bill still contain the necessary amount of vigor needed to accomplish its intended purposes? Yes, sir. I yield the way you got another question. I'll take one more. Okay. All right. Representative Anelo, you won't end on this action, huh? Can I yield? Parliamentary hiring. Let's let him leave the well before we do it inquiry. Do you have a question or the author? Do you have a question? Okay, state your question. Is it not true that there is not a single clinical study to prove the efficacy of Paul Meda-Berry's for doing anything besides separating men from their dollars? That's a good question. I yield the well. You know, one time a session I always use this expression. He has fled the well. On the gentleman's motion that this House agree to the Senate substitute House Bill 966, all those in favor of the motion will say aye. Those opposed will say no. And the clerk will unlock the machines and call the roll. Alexander Onelo, it's Bar Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackmond, Boate, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Debsi, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Gravity, Herald, Hatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lod, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Runledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Taker's Lee, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, Ben, Paris, Prince, Poland, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, William, Turner, Wollensky, Wilkerson, Williams M, F, Williams M, Wilson, Beasley T, B, C, T, Sponor, Yes, Buckner, Barchett, Bruce Hallwell, No, Campbell, Yes, Dickerson, Doops, Doops, Campbell, Yes, Gillier, Gordon, Green, Gullet, Jones J, B, Kirby, Green, Lot, Mathis, Yes, Mark, Yes, Yes, Rogers, Singleton, Stole Ball, Yes, Williams R, Yes, Boding, Buckner, Carfender, Yes, Mark D, Cooper, Davis, Donahue, Gaines, Gardner, Gilligan, Green, Yes, Lopez Romero, Blanc, Beaks, Oliver, Paris, Beatry, Silk Ox, Singleton, Thomas E, Williams A, Williams M, F, Williams M, F, Members, we'll look at the board and make sure it's accurate. And the clerk will lock the machine on the gentleman's motion, the eyes are 140, the nasal 14, the gentleman's motion that this House agreed is the Senate substitute House Bill 966 has passed. All right, we're going back to the rules calendar now. Going back to the rules calendar and we had one measure that was post-poned from a prior legislative day and it isn't called at this time. Clerk will read the caption to Senate Bill 321. Senate Bill 321 by Senator Huffstatt, the first, the 50th, the 50th, the 50th, the 30th, the 30th, the 34th, the 43th, the Fisher go to George annotated relating to physicians, assistants and others. So as their vises provisions relating the number of physician assistants and advanced practice registered nurses, a physician can authorize and supervise, and anytime this bill ever refer to the committee on regulated industries, that committee recommends this bill do pass by committee substitute. Chair recognizes Chairman Allen Powell to present the bill. Thank you, Mr. Speaker and ladies and gentlemen of the House. I bring to you this evening SB 321, a little bit of background. This has got two subject matters. It deals with two of the healthcare providers. One is the physician's assistance and the other is the advanced practice of registered nurses. You may remember on the 28th day crossover, we had a building that passed pretty handily and that was dealing with the APRNs. The APRNs and the physician's assistance, they work under the protocol of doctors. There's never enough doctors, especially throughout rural Georgia, which makes this even that much more important, given the amount of education these folks have, and the fact that they're working under the protocol of a physician. Now when they left this house, we had raised the number from four to six, the number of APRNs that were allowed to work under the protocol of a doctor. We also allowed them to do something that they currently do part way and ask to allow radiological exams for emergency cases. And this again, let me refresh your memory, this is under the protocol of those physicians. What we had asked for was that they'd be allowed to do this, to issue these orders in a non-emergency situation. This is what we're doing in this bill, except we've lowered that number from six back to the current number of four, and we raised the physician's assistance over in the Senate to four, so there's parity. So this is a bill that's parity between the PAs and the APRNs. So now they would both work under the protocol of a physician that both before, and of course the nurse APRNs would be able to issue to issue radiological orders in non-emergency settings. And remember, this is all under that doctor's protocol. They've been several the folks out in the hall, and I'll tell you quite upfront that the folks that deal with health related and health care related issues. This has been the most phenomenal thing I've ever dealt with, but I've dealt with a good many of those over my tenure up here. But these folks, it's about turf war. And understanding it, it came out of the Senate, Senator Huffstattler, who is a PA, and he knows that stuff very well. They didn't seem to have any problems with this over on the Senate side, so it came back to us. And that's what this does. This is a good bill to help rural Georgia and the underserved areas of this state for medical practitioners. And simply again, I'll tell you that on the APRNs, it leaves them at four, but it gives them the right to do non-emergency orders. They don't read them. They can only order them under that doctor's protocol. I know that they had been some of the issues that had been brought up with it was going to have a negative figure. Well, it doesn't have a negative figure, because if they order a radiological exam and an emergency situation, that's covered. Now, if they order these in a non-emergency situation, they still have to be given the approval by the insurance carrier. So that argument doesn't hold water, ladies and gentlemen. With that, Mr. Speaker, I will certainly answer and stand for any questions. You have a couple of questions if you care to yield. Be more than glad to, Mr. Speaker. Chair recognizes representative Reeves to your left for a question. Yes, sir. Mr. Chairman, do you yield? Yes, sir. Mr. Chairman, is it true that my wife is a physician assistant? If you say so, I have no reason to believe otherwise. And is it also true that my wife, along with the physician assistant's association, is working for years on this issue to get disparity in that in addition to being able to help give Georgians better access to health care in rural Georgia, this also is going to help Georgians get better access as we continue to go through the COVID pandemic and with all the things that's happening and all of the treatment that has been needed over the last few months, PAs have been able to step up and help a lot of Georgians. Isn't that true? That is true. The gentleman knows from where he speaks. Does, do you yield for one more question? Certainly will. Isn't it true that a happy wife equals a happy life? Well, I used to say that, but... Chair recognizes Representative Holland in the gallery in the middle area. Is the gentleman yielding? Yes, ma'am. Is it not true that Georgia is the only state in the United States where APRNs are not allowed to write radiological orders? If we're not the only state, we're awful close to it. I think we actually are the only one. Thank you for bringing this forward. And thank you. No further questions? Ladies and gentlemen, the House, let's just move this forward. This is a good bill. This is good for rural health and underserved areas of the state for these professional APRNs and does the way of ambiguity in the PA law and it just makes it a better streamlined process and I'd ask for your favorable consideration of Senate bill 321. We have a couple of members that wish to speak to the measure. The Chair recognizes Representative Jasmine Clark to speak to the bill. Thank you, Mr. Speaker. I come here today to encourage my colleagues to vote yes on this bill. This is a great bill. We voted on a very similar bill back before the recess, House Bill 1092 and this bill is kind of a companion to that bill and it adds the PA's to it. And I come up here just to speak on behalf of the nurses that I teach at the Emory School of Nursing and just to say that I know that they are ready to serve their community and this is a really good bill. So thank you. Chair recognizes the Chairman of the House Ethics Committee. Chairman Nicks to speak to the bill. Thank you, Mr. Speaker. Members of the House, I am so glad to see this bill get called. I've been here 14 years and I've never seen the people in the hall fight so hard to just keep you from getting a chance to vote because they know that your common sense will pass this bill just like it did before. Bill does very simple things. It gives the PA ratio of one to four which is what the physicians, what the advanced practice nurses already have and the thing is it allows the advanced practice, restricted nurses to order advanced radiologic imaging in non-life threatening situations when authorized by the physician protocol agreement. As the lady stated up there, 40...\n\nI know the states do this. It seems like to me if you vote against this, you're just simply saying that you don't think our people are as good as the rest of them. I have never seen the truth get stretched like it has in the hall over this with stated facts that cannot be backed up. And I just ask you to just use your good common sense. It's already been stated. This will allow these people to practice to the height of their qualifications. And it gives us the opportunity to expand health care in places where it doesn't exist to the extent it does. And just show the fact that I trust you with the comments since you have to vote on this. And I appreciate a positive vote on Senate Bill 321. Thank you, Mr. Speaker, and I yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Ameloets, Far, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glant, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Hauston, Hugley, Jackson M, Jasper's, Jones S, Kelly, Kendrick, Knight, LaHood, LaRickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nix, Oliver, Parish, Parsons, Petri, Perkel, Powell, Reeves, Roads, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stevens R, Tancersley, Tanner, Targon, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Alan, Beesmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin McClan, McLaren, MacLearn, MacLearn, Meeks Mitchell, Moore B, Morris C, Morris M, Nelson, when Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wolensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, BCC, Yes, Bonner, Yes, Fuckner, Yes, Forchette, Carl Well, Yes, Campbell, Yes, Kent Trial, Yes, Dickerson, Yes, Doops, Yes, Campbell, Yes, Gillier, Yes, Gordon, Yes, Free, Yes, Gollett, Yes, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Metz, Metz, Mop Tahan, Mark, Park, Cruey, Yes, Free, Yes, No, Rogers, Singleton, Yes, Stoweball, Yes, Williams R, Yes, Alan, Yes, Baysmore, Farc D, Cooper, Dampsey, Douglas, Dunahose, England, Gardner, Gilligan, Hobson, Jackson M, Jasper's, Jones T, Jones V, Jones V, Kenner Lopez Romero, Mathis, The Claims, Yes, Meeks, Nelson, Parsons, Pullins, Silcox, Stevens R, Stevens Tancerslead, Taylor, Taylor, Wilson, Wilson, I think members will check the board and be sure it's accurate. Who's trying to get attention? I mean, a lot of hands are being waved. Okay, all right. Okay, Clark will lock the machine. On the passage of Senate Bill 321, the eyes are 137. The nays are 14. This bill having received the requisite constitutional majority is therefore passed. Okay, we have one local calendar issue. You'll listen up, please. We have an agreement to a House Amendment to the Senate Substitute to House Bill 695. To House Bill 695. Having received the requisite number of signatures required, the House delegation wishes to agree to the Senate Substitute to House Bill 695 as amended by the House, the clerk will read the local calendar. House Bill 165 by Senate Substitute is amended by the House by representatives by Representative Wilson of the 80th City of Brookhaven. Is there any objection to the adoption of the House Amendment to the Senate Substitute? The chair here is none. All those in favor of the adoption of the Amendment to the Senate Substitute on the local calendar will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Ameloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Grabley, Harold, Hatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M. Jasper, Jones J. Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G. Newton, Nick's Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tremble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClellan, McLaren, McLeod, Meeks, Mitchell, More B, More C, Morris M, Nelson, Wynn, Parris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Connor, Yes, Fuckner, Yes, Perchette, Carl Well, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Dukes, Gammel, Yes, Gillier, Gord, Yes, Green, Yes, Gullet, Yes, Jones J, B, Yes, Kirby, Lot, Yes, Mathis, Yes, Meets, Mopthahan, Park, Pruitt, Yes, Rogers, Singleton, Yes, Stowe, Yes, Williams R, Yes, Faysmore, Carter, Clark H, Clark J, Cooper, Cook, Dempsey, Dreyer, Dukes, Gardner, Yes, Harold, Jackson M, Kendrick, Meeks, Morris G, Wynn, Paul, Sates, Sates, Skoggins, Shannon, Smith V, Tarvin, Williamson. Members will look at the board and make sure it's accurate. And the clerk will lock the machine on the local further action calendar. The eyes are 154, the nasor zero, and this bill has received the requisite constitutional majority. We have a local calendar, that was a local further action calendar, we have a local calendar. Third reading and passage of uncontested local bills, one bill on the local calendar relates to homestead exemption and requires a recorded, two-thirds roll call vote for passage. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered, the clerk will read the local calendar. Senate Bill 328 by Senator Jones, 25th City of Jackson, Senate Bill 399 by Senator Harborson, 15th Macon County, Senate Bill 475 by substitute by Senator Martin, 9th City of Grayson, Senate Bill 511 by Senator Lucas, 26th Twigs County, Senate Bill 517 by Senator Lucas, 26th City of Jefferson Bill, Senate Bill 506 by Senator Unerman, 45th City of Buford. Is there any objection to the previous question being ordered on the local calendar? The chair here is none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none, the report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines and call the roll. Alexander Loweitz, Bar Barton, Belton, Bennett, Bentley Benton, Beverly Blackman, Vody Bruce, Burns, Carpenter, Carson, Chocus, Clark H., Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drennor, Dubnek, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Gravity, Herald, Hatchet, Hawkins, Hitchens, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M. Jasperce, Jones J. Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G. Newton, Nick's Oliver Parrish Parsons, Petri Perkel, Powell Reeves, Rhodes Rich, Ridley Rutledge, Skoggins Setsler, Silcox Smith L, Smith R, Smith V, Smirrey Stevens R, Takerstley Tanner, Tarvin Taylor, Thomas E, Tramble, Washburn Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda Allen, Bayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis Douglas, Dreyer, Dunahoo, Earhart Evans, Frazier Gilligan, Gertler Hanson, Hill Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard Lopez Romero, Marin McClain, McLaren, McCloud, Meeks Mitchell, Moore B, Morris C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A.M, Turner, Walensky, Wilkerson, Williams M.F, Williams N, Wilson, Beasley T, BCT, Yes, Bonner, Buckner, Butter, Yes, Farchette, Calwell, Cal, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Duke's, Yes, Campbell, Yes, Gilear, Gilear, Yes, Gordon, Yes, Green, Green, Yes, Gullet, Gullet, Yes, Jones J.B., Jones J.B., Yes, Kirby, Yes, Lot, Lot, Mathis, Mathis, Yes, Mathis, Mopthaha, Park, Park, Proof, Yes, Proof, Yes, Rogers, Rogers, Singleton, Stovall, Yes, Stovall, Yes, Williams R, Williams R, Yes, Allen, Cannon, Clark D, Clark J. Cook, Dollar, Frazier, Gardner, Jackson M, Jones J. Kenner, Lot, Yes, Morris G, Newton, Wen, Oliver, Shannon, Tervus, Thomas A.M., Thomas E, Turner, Williams N. Members will look at the board and be sure that it is accurate. Members will look at the board. Clark will lock the machine on the local calendar. The eyes are 155 of the nasors zero. These bills having received the requisite constitutional majority are therefore passed. What purpose does Chairman work eyes arise? To make a motion. State your motion. To the chair, I move to discharge the Committee of Conference for House Bill 264. Are you asking to do that by unanimous consent? Yes, sir. That is permitted by the rules of the House. The gentleman has asked for unanimous consent to discharge the conferees on House Bill 264 and appoint a new Committee of Conference. Clark will read the caption. The gentleman has asked for unanimous consent to discharge the conferees on House Bill 264. The gentleman has asked for unanimous consent to discharge the conferees on House Bill 264. The gentleman has asked for unanimous consent to discharge the conferees on House Bill 264. The gentleman has asked for unanimous consent to discharge the conferees on House Bill 264. House Bill 264 to amend Article 4 of Chapter 5 of Title 21 of the official go to George Anitetti, relating to public officials conduct and lobbyist disclosures, to revise definitions, to provide for related matters, and to provide for an effective date. On the gentleman's motion, asking for unanimous consent for discharge of the conferees on House Bill 264. An appointment of new conferees is their objection. Hearing none, it is so ordered in the chair appoints as conferees. The new conferees on House Bill 264, chairman England of the 116th, chairman workhizer of the 157th, and the majority caucus will represent the Kelly of the 16th. Clerk will read the caption to Senate Bill 71. Senate Bill 71 by Senator Watson, the first worker of the 11th, black of the 8th, half-steadler of the 52nd, and clerk of the 13th, to be titled an act to amend Article 4 of Chapter 7 of Title 31 of the official go to George Anitetti, relating to the county and municipal hospital authorities, so as revised provisions relating the sale or lease of a hospital by a hospital authority. Okay, we're still doing business, and if you want to be a part of that, then chair is going to ask that you ratchet down the decibel level of your conversations and use your assigned seats and give attention to the members in the well. Chair recognizes representative Todd Jones to present the bill. Thank you very much, Mr. Speaker. Everyone, I need a couple minutes of your time. I'm fully aware that this bill has suddenly taken on a life of its own, and I'd like for you to give me just a couple minutes to explain. This is the genesis of what I believe is the reason why all of us came down here. When you think about the first time you thought for running for office, I am sure it was because of a calling and your willingness and want to change the world, to change your portion of Georgia, to make every citizen's life better. And we constantly talk about things, may it be education or may it be health care. And this is what this addresses. SB 7-1 simply does this.\n\nIt gives us an opportunity to take two weeks in the year 2021 and test an idea. Test the thought, test an aspiration, and that aspiration is simple. Can we start to truly and materially solve healthcare access? This bill calls for simulation and I stress simulation. That's computer simulation of an idea of providing healthcare to every Georgian at or below 200% of the federal poverty line. I want to say that one more time, 200% of the federal poverty line. But here's what it doesn't do because you've been told this over the last few hours. It doesn't affect Medicaid. It doesn't affect dish. It does not affect the indigent trust fund. You know why? It's monopoly money. It's literally, it's a game. It's a simulation. It's two weeks. You will see the last line says the law dies on December 31, 2021. It has no overhang except this. It gives this body the data. The data we need to determine how we should look at healthcare in 2022, 2023 and 2024. What's so bad about that? What's so bad about this body being informed? Being informed about the things that we care about and that is our citizens and their ability to get healthcare. The idea is one based on market principles of foreign trade, which is a corollary. It's the idea that the aspiration that our nonprofit hospitals would reach up and hit a floor of care. A floor of healthcare to those who are indigent and charitable up to 200% of the federal poverty line. But this bill in no way shape or form does anything other than allow for two weeks of simulations and a report at the end of the year and then it dies. I will leave you with this thought. Two days ago in committee, one of the lobbyists who is literally sending you messages about the adverse effects of this bill said, and I believe this is a quote or it's a close paraphrase. This is the most innovative out of the box idea in the capital today. I take that as a pat on the back. I appreciate that. But I find it intellectually dishonest to suddenly flip 48 hours later and tell you we're going to affect federal dollars. I'm crazy, but I'm not that crazy. Please trust me. I hope that each of you can look at yourself and say, can we make this happen and this pilot gives us the data to do that. I truly appreciate your time. I appreciate your consideration and I truly believe this will be the path to make us the leader of the United States and in a general care and set of many people's minds the follower. Thank you very much. Mr. Speaker, I'll stand for questions. Chair recognizes representative Hughley to your left for a question. Thank you, Mr. Speaker, to the gentleman in the well. Do you feel? Yes. I appreciate your passion and the innovative idea that you have. I have one question, though. If this is a pilot, are there any requirements for hospitals to participate? Yes, there is. As you can probably imagine, for us to get the data in any market circumstance, we want to have all of the potential participants come in and provide their data to us. So absolutely, there is that requirement. And is there any adverse consequences for hospitals that they don't participate? As a matter of fact, the general lady makes a very good point. The initial bill during the study committee of four months was to literally chew down the entire legislation. And based on conversations with, I'll say, all of the stakeholders, the idea was to bring this down to a pilot. So that's something that we hoped that you guys could see and consume. So our idea was put in what we thought was a fair penalty, and that's $1,000. You'll see that towards the end of the bill. Thank you. They will be penalized if they don't participate. That is a, I guess, you could say that's a viewpoint, but we're going to do everything we can to help them because we understand we don't want to overly burden them, but in order to get the data, when we think about the aspiration and the aspiration of meeting literally 200% of the third-party pothyline, I hope that each and every hospital says, if I'm going to balance out my administrative burden approximately five, 10, 15 hours versus meeting that goal, I hope they see that as a fair use of time. So thank you. Thank you, I appreciate your enthusiasm. Okay, thank you. Do you yield for further questions? Do you yield for? Yes, Mr. Speaker. Chair recognizes Representative Derek Jackson up in the gallery. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. For a person that identified your energy, your passion? Are we talking about Medicaid expansion right now? Is that your question? Representative? No, sir. Does the gentleman further yield? Yes, sir. Because if we expand Medicaid, we will do exactly what your opening statement is. We will give 680,000 George's access to healthcare. You will also mitigate the budget which will help those hospitals on life support. We will also channel your same energy to your opening statements to do more for George's with healthcare right now during a pandemic. Is that not true? I think your interpretation is appreciated, Representative Jackson, and I do. No, I absolutely appreciate that look. I think it's fair to say that there should be absolutely an intellectual dialogue around what we should and should not do with Medicaid. And I'm not suggesting that this is the time we can't necessarily do that because this bill doesn't do that. However, I would say to this body, let's have a parallel path. We're going to have the conversation on Medicaid. Let's also have this parallel path where we know this path will get going on the data. So this body will get the information it needs to make informed decisions. But I do appreciate the question. So thank you. Do you further you? Yes, sir. Chair recognizes Chairman Hausten, do you ride for a question? Is it not true that many people say they don't understand this? And is it not true that year after year we vote on something called QBE and I'm sure they don't understand that data? Isn't it also true if this doesn't work the way we did, we just put it in the trash can? And does it this also mean if it works, it will be funded without raising taxes. So the general lady knows of what she speaks and I'd like to emphasize that last point, absolutely on the last point. So thank you so much, Chairman. And if it does, it's just a power program like you all say it's like Klamenopoulos. And I feel if they can't cut, is it not true if the general lady's hospital can't cut that $1,000, maybe we can get somebody to donate $1,000 to crack. That is cool. That is great at deras, but if they can't, when they're making millions of dollars, thank you. Yes, and if I could just address that last point, it's up to. It's not a mandatory of a thousand. It's up to. Do you further yield for one more question? Chair recognizes Chairman Newton for a question to your right. Is gentleman Lee Geeldt? Yes, sir. Is it true that by being a pilot program that no dollars will change under the current charity care responsibilities that hospitals have, no changes will happen at all and whether one is meeting their current charity requirements, their indigent care requirements. You are spot on. I want to be clear to Dr. Newton and to the body. Everybody, this does not touch any current law. This is literally a side by side data simulation that allows us to get that information, period. Are we yield for an additional question? Yes, sir. Isn't it also true, finally, that this information on charitable care and indigent care, which so many of our hospitals are doing so. In such an expanded way right now, isn't it true that they are already collecting that through transparency requirements that this body had passed in the Governor's sign last year. So this would not be a major administrative burden on any of our hospitals because they are already collecting this information that would allow them to participate in this two weeks out of all of 52 weeks next year. Absolutely right, sir. So thank you. Thank you for the bill. Thank you for your question. Mr. Speaker, are you the well? All right. That gentleman is yielded the well chair recognizes representative Jasmine Clark to speak to the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I come to you to ask you to vote no on SB 71. And quite simply, it's because the hospitals, the guinea pigs, the unwilling guinea pigs in this pilot program that are out here in the hallways, the ones that are in your communities say they don't want it. And this bill would penalize them because they don't want to participate in something that they just don't want to participate in. It's when did this body decide that we're going to start forcing hospitals to participate in pilot programs or charge them as they're already reeling from the impact from coronavirus and from this pandemic. And now we're going to tack this on to them as well. It just doesn't make any sense to me. See the author of the bill or the person who just the gentleman who was just in the well told you to trust him. Well I believe that the people who send us up here are constituents, the ones who seek indigent care, as well as the hospitals that are trying to work with us are asking you to trust them. I do not believe that people, no matter their ability to pay, no matter what percentage of the federal poverty level they are, are not monopoly pieces. They are people. Why are we playing games with people's lives and health care? And with that again, I will ask you all to please vote no on this bill. I yield the will. The city is yielded the will. The chairman wants his time. Chair recognizes chairman Newton for the chairman's time. Thank you Mr. Speaker. I will yield my chairman's time to chairman Fleming. Gentlemen has that right. Chair recognizes chairman Fleming. Thank you Mr. Speaker. Dr. Newton asked me why I want to talk on a medical bill. I said I thought about going to med school one time, but I wasn't smart enough for that. But I tell you one thing I am smart enough to figure out. There's a reason why somebody doesn't want you to vote yes on this. And it's because we're going to get a look at what's going on financially dealing with health care in the state. And I think it's going to be a good look. And that's why I think we need to do a pilot program that will change nothing about how we treat people except looking at an idea and seeing if it will work. And I'm going to do my best with my extensive medical background to explain to you what I think it does. And here's what it is. If you are a hospital, you are required to do a certain amount of engineering care. Now if you take a whole lot of Medicaid, Medicare, uninsured patients, you have less of a burden to do that because you meet it already. And when you go into our rural areas, particularly in South Georgia, you find hospitals overwhelmed with the need that is there and they do more than they share. If you come here to the metro area, you find big hospitals that are very successful, that have a lot of insurance paying clients that reimburse as much better, they arguably have a need to do more engineering care. So the idea that is before you is to simply test. Once the idea is to whether or not those hospitals who need to do more engineering care can buy a credit from a hospital in South Georgia that has too much. Now why does that make sense? Because the hospital here in the metro area is required to do a certain amount of engineering care. They have a tough time making that. But they can buy a hundred thousand dollar credit from a hospital in South Georgia and that hospital in South Georgia now has a hundred thousand dollars to treat people who need care. That is exactly what this does and we don't even do that with this bill. We just study the idea of doing that to see if we can help people who need health care. Now this is an innovative idea. This is something different but why would so many people, particularly in the hall, be opposed to such a simple test not even doing it just seeing if we could do it because we have to look at some numbers. Now I don't think we should be so scared of what should be public information anyway and that is the health care dollars that are being spent in the state and where they're being spent. I don't have a clue how you feel about this bill or what you've been told about it but I've told you what I understand about it and it is so simple for us to do this test to figure out if we can give hundreds of thousands of not millions of dollars of care to people in areas that need it. I'm going to vote yes for this because I think it's a great idea and it doesn't hurt to try something new every now and then particularly when somebody needs medical help like this. I hope you will also not pay attention to some of the things that I think you've heard because I think they're exaggerated and I don't think they're accurate and given an idea of chance. Thank you Miss Speaker, I yield the well. Gentlemen has yielded the well. We have some parliamentary inquiries but before you ask your parliamentary inquiry I'm going to recognize a member for a special moment. Chair recognizes representative Sharon Beasley-Teague. What purpose does representative Beasley-Teague rise? Parliamentary Congress to speak. State your inquiry. I think that we've been here a long time today. Are you tired? I am. And I can't hear nothing that bad from over there so I don't know what y'all doing over here. You're voting right. I'm watching you're voting the right way. I want to vote the right way but I need to take a break now for about 12 hours and we talk about this later. Well I tell you what. We're going to do one more bill and then we're going to take that break. I appreciate that Miss Speaker. Because you asked for it. Thank you. All right now let's see who still wants to ask a parliamentary inquiry. Chair recognizes representative Graveli. What's your inquiry? Is it not true that I have always voted even oftentimes much to the chagrin of my colleagues to protect my local hospital system? If the gentleman so states, if the gentleman so states, I would not vote for a piece of legislation that I thought would hurt my local hospital system. I would certainly hope not. And that I am going to vote yes because this data, we talked about expanding Medicaid. We expanding Medicaid goes up to 130% of the part of the level. And if the data comes back that we can go higher than that based on the data, why wouldn't anyone not want to do that? Chair recognizes for what purpose does representative Bolton arise? Parliamentary inquiry. State Chair inquiry. Isn't it true that we passed a bill last year that required a great deal of transparency reporting from the hospitals? I believe that was the case. Is that information not information we could use for this same purpose? I think that will address itself to the judgment of every member. Further parliamentary inquiry? Of course, State Chair inquiry. If this is a simulation that the speaker said did not touch the law or a law, why do we need a law to do this? Well once again I think that's going to be something. Every member is going to have to determine for themselves when they vote. The purpose does chairman Newton rise? Parliamentary. State Chair inquiry. The speaker isn't it true that the information gathered in this bill will go far to help hospitals and it was mentioned earlier rural hospitals which we have a lot of. If the gentleman so states. Isn't it also true that we have safety net hospitals that would be net receivers in many urban areas that would also potentially be helped if this test is beneficial? I'm sure the gentleman believes that to be true. What purpose does representative Allen rise? Parliamentary inquiry. State Chair inquiry. Is it not true that I've been looking through the budget and I do not see where this very expensive data simulation is going to be funding? If the gentleman says that he hasn't found it, I'm sure he's stating what he believes to be true. What purpose does chairman Tanner rise? Parliamentary inquiry. State Chair inquiry. The speaker isn't it true that I've been here for some time now and this will be my last session here in the General Assembly. In that time I don't think I have, isn't it true, I've met anyone more intelligent, non-political, more concerned about doing what's right for Georgians than representative Todd Jones? If the gentleman so states I know he believes that to be true. Isn't it further true that this body has demonstrated over the last five decades that I know that we are a non-partisan body that can come together to do what's right for Georgians? That this bill is not a partisan issue. This bill is about giving an intelligent individual like representative Todd Jones an opportunity to either prove a point that's correct or not correct in any action then we'll have to be debated by this body in the future and we owe it to Georgians to give it a chance. The gentleman so states I know he believes that to be true. I'll tell you what, we're going to take one more parliamentary inquiry and then we're going to put it on the board. What purpose does representative Derek Jackson rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that this data that one is seeking is already held at the federal level? I'm sure the gentleman believes that to be true. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Now this bill now pass all those in favor of the passage of Senate Bill 71 will vote aye. Those opposed to vote no. The clerk will unlock the machines and call the roll. Alexander Aneloids, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardiner, Clinton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lohon, Larickia, Lomston, Martin, Jack, Matthew McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Michael, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yardup, Allen, Phasemore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gerrler, Hanson, Hale, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McLean, McClaren, McLeod, Meeks, Mitchell, Moore B, Moore C, Moore Morris M, Nelson, when, Paris, Prince, Pullin, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, William, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, No, Bonner, Buckner, No, Barchett, Galwell, Campbell, Canne Trail, Dickerson, No, G, G, G, G, Gordon, No, no, G, G, G, G, G, No, Gullet, Jones J, B, Yes, Kirby, Block, Yes, Mathis, Yes, Metz, Momp-Dohan, Yes, No, yes, Rogers, Singleton, Stonewall, Yes, yes, and all of it's Benton, Duke, Sonahoe, No, F, Evans, Hulkem, Jackson M, Jones B, Kendrick, Meeks, Reeves, Shannon, Stevens R, Thomas A, M, Thomas D, Wollensky, Williams N, Yerda, and check the board for accuracy. Please check the board. Have all members recorded their vote?\n\nAll members voted if so the clerk will lock the machine on the passage of the bill the yeas were 83 the nays were 79 the bill having failed to receive the requisite constitutional majority has therefore failed for what purpose does representative house in rise please repeat your question state your inquiry does this bill just show that the tail is wagged the dog in here the hours late and I'm sure the lady knows that of which seat speaks clerk read the caps just sent a bill 375 375 senator mulls the 53rd Watson the first Burke of the 11th Kirkpatrick the 32nd Miller the 49th and others to be in town on act to amend article 7 chapter 12 of title 16 the fiscal to Georgia annotated relating the sale or distribution to were possession by miners of cigarettes and tobacco related products is bill ever further committee on ways and means that committee recommends that this bill do pass by committee substitute chair is waiting for order chair recognizes representative rich to present the bill thank you madam speaker good evening ladies and gentlemen of the house I'm so excited to bring to you senate bill 375 this is the culmination of something that I have been working on now for about a year in order to better protect our youth this bill will raise the age to purchase tobacco to 21 which is consistent with our new federal law and also add vape products to that age restriction the bill also includes the vape regulation that I have been working on since last summer this matter came before the house while I was out earlier in this session and it included a step down in tax for modified risk products which was the reason that many of you were unable to vote for it at that time I am really happy to report that that language has now been removed the bill now simply provides for excise taxation and licensure of vape retailers consistent with the tax and the licensure that's required with tobacco sales the goal is to create parity to tax vape liquids on par with the tax that's applied to tobacco most importantly however the licensure and the regulation of vape retailers provides for enforcement of our laws which will make it more difficult for our youth to purchase the vape products thereby curbing and hopefully eliminating this epidemic that we have with our youth abusing and using vapes so I would ask for your favorable consideration and at this time madam speaker I will yield to any questions are there any questions chair recognizes representative jas first for question I do isn't true that last year in my district the last summer we had a tremendous issue with vaping and vaping related accidents and injuries and then my local law enforcement is an absolute support of all the work you've done of the last year and correct this issue in my community yes that is my understanding thank you very much chair recognizes minority leader trample for a question will you yield yes isn't it true this bill is brought under a structured rule under the rules of the house that is my understanding will you further yield yes isn't it true that line 451 of this bill that this house could have had the opportunity to raise revenue that could be applied to the budget that we will vote on tomorrow by simply raising the tax levied per pack on cigarettes I don't have any knowledge of any other bill other than what's contained in this bill which is what I've worked on and the fiscal note that was attached with this actually does show that we will have between 11 million and 19 million dollars in revenues as a result of adding the vapes to the excise tax we further yield I will but isn't it true that by raising the cigarette tax we could literally be talking about hundreds of millions of dollars up to a half billion dollars that could be applied toward the budget that we're going to vote on tomorrow if the gentlemen so states and will you let yield for one last question I will and isn't it true by passing this bill as a structured rule that we're saying is a house that we're uninterested in that opportunity I do not agree with that statement madam speaker with that I yield the well what purpose does representative sets for rise he waves are there any more questions lady has lady has yielded the well is there any objections previous question being ordered the chair here's none of the previous questions ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report the committee's agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote know and the clerk will unlock the machine This afternoon, we have two areas first, ч ǐ nǐ nǐ nǐ nǐ nǐ nǐ. Alexander Aneloowitz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bode, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Erwin, Fleming, Fry, Gaines, Gardener, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Hokem, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Butler, Scott Lodge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarman, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yarduk, Allen, Bayesmore, For now, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Hollen, Holly, Watson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Kaush, Kennerd, Lopez Romero, Marin, McClan, McLaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Ben, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wilensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Yes, Bonner, No, Buckner, Yes, Verchette, Calwell, No, yes, no, Dickerson, Dukes, Dukes, Yes, Gamble, Gillier, Yes, Gordon, Yes, Green, Yes, John, Jones J, B, Kirby, No, Lock, Mathis, Yes, Metz, Momp-Tah-Han, Park, Yes, Fruit, Yes, Rogers, Singleton, No, Stovall, Yes, Williams R, Yes, Alexander, Allen, Bar, Barton, Bernal, Burns, Cannon, Carter, Clark D, Clark H, Clark J, Davis, Dollar, Douglas, Drenner, Dreyer, Dunahue, Estration, Frazier, Fry, Gaines, Gilligan, Holly, Houston, Hutchinson, Jones J, Jones T, Jones V, LaHood, Lopez Romero, Blumston, Meeks, Mitchell, Wen, Petri, Perkle, Rich, Scott, Sharper, Smith M, Tanner, Tarvin, Tramble, Watson, Williams A, Williams MF, Wilson, Have all members voted and checked the board for accuracy. Have all members voted? Yes, all members voted and checked the board for accuracy. If all members have voted, the clerk will lock the machine on the passage of the bill. The A's were 123, the A's were 33. The bill having received the requisite constitutional majority is therefore passed. The House will stand at ease for just a few moments. The House will come back to order. The House will come back to order. The clerk ring the bill. The House will come back to order. The House will come back to order. The House will come back to order. The House will come back to order. Chairman Beverly, you're late to the party. Thank you for listening. The chair recognizes the majority leader of the House for a motion. Mr. Speaker, I moved this House standing recess until 8.45 pm today. Then stand adjourned until 10 am Friday June 26, 2020. The majority leader has moved that this House be in recess until 8.45 pm. At which time we would be adjourned until 10 o'clock a.m. on Friday June 26, which will be legislative day 40. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be in recess until 8.45 pm. Whereupon we will stand adjourned until 10 o'clock a.m. on Friday.",
  "updated_at": "2026-02-13T12:19:51.73512+00:00"
}