{
  "video_id": "TN4iY1Y4LdY",
  "url": "https://www.youtube.com/watch?v=TN4iY1Y4LdY",
  "title": "1/12/2024 Senate Committee on Rules",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 24,
  "summary": "Overview:\nThis Georgia Senate Committee on Rules session focused on several notable bills and resolutions, including ones related to first responders, military service members, and family caregiving services. The committee also discussed parliamentary procedures and amendments to proposed legislation.\n\nKey Actions:\n- **SB 151**: Designating September 11th as First Responders Appreciation Day (Passed unanimously)\n- **SR 323**: Directing a study on family caregiving services (Passed unanimously as amended)\n- **SR 344**: Designating May 1, 2024 as a certain day (Discussed, amendment needed)\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Discussion around the need for the author of SR 203 (study on safe firearm storage) to be present to answer questions, leading to the bill being tabled.\n- Procedural discussion around amending dates in SR 323 and SR 344.\n- Lighthearted exchange about designating a \"mutt dog day\" alongside the proposed \"purebred dog day.\"\n\nVotes:\n- SB 151 (Designating First Responders Appreciation Day): Passed unanimously\n- SR 323 (Family caregiving services study): Passed unanimously as amended\n- SR 203 (Tabled at request to have author present)\n\nAttendance:\nQuorum present, no specific attendance notes.\n\nAdjournment:\nNot mentioned.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nAll right, y'all, so we're actually, I'm going to call us into standing committee.\nSo Senator Dixon, for your education, we have a standing committee which falls under\nnormal rules of any committee.\nSo we can amend and standing committee bill comes out of here.\nIt goes to the floor and it gets reported out of committee.\nAnd once it does that, then it goes to the general calendar to where we can make it available\nor not and then select it or not.\nSo that's just kind of a little lesson for you today.\nAnd you being new, you don't get a name plate today.\nYou have to earn a name plate.\nSo we'll see how you do today.\nIf you do good, you'll have a name plate next time.\nOkay.\nSo in standing committee again, we ran out of time last year, we only had 40 days to\ndo the good work of this state and sometimes it's just not enough and so I do have about\nI don't know, 15 or so bills and standing committee and so I decided we're going to try\nto clean that up and Senator James, tell you what while you're here, you can have that\nright there because we are going to start with SB 151 and if you need a copy this just\na quick reminder is your designating September 11th as first responders appreciation day.\nThank you Mr. Chairman and members.\nI was approached by first responders of Fulton County and Douglas County in Cobb to since\nthey celebrate September 11th as first responders day in their counties to make it a statewide\ncelebration because other first responders are also working and doing things in the\non 9-11. Okay. So I brought this forward last year and if we didn't get a chance to\npass it, but they still celebrated it September 11th and now they wanted to know if we could\nstill make this a recognition all over the state of Georgia. Absolutely. I ask for your\nfavorable consideration. Okay, are there any questions from the committee? All right.\nWell, most of the will of the committee, I got a motion due pass from my vice chairman.\nI got a second from the president, pro-team, all in favor say aye, all opposed same sign.\nI skip the discussion part, anybody have any discussion, I want to be full transparency\nhere.\nOkay.\nSinner yep bill will go on the rules. Thank you, sir. It will go from rules to rules\nThank you very much for your chairman and members. Okay. Thank you very much. I move out of y'all away with my noise\nHey, you took the beeper off\nOh\nHe might have earned my vote for Congress\nNo kid nobody endorse him now\nall right good deal moving on all right we've got S R 122 from the dean of the\nSenate and I he asked me to actually cover that for him and seems I can find it\nI will cover it for you want to do it yeah Senator let's you go for it what\nNumber you, I can't see you all's numbers.\nI'm gonna tell you what 12, get a microphone please.\nNumber 12, I'm gonna tell you what the bill does\nand I'll let Maverick sing the lyrics.\nIt designates the song The Veteran Anthem\nwith lyrics and music by Mr. Swan\nas the official song of Georgia Service members,\nveterans and their families.\nSo it's a theme song.\nare you going you're going are you going to sing with me if you're not going to\nsing with me the words are in the bill you read the bill I was trying not to\nyou might ask me to sing all right well we'll forget the singing is any any\nquestions from the committee for our Senate non-sponsor okay no questions\nSo you did a fine job there.\nThank you, Senator.\nProud of you.\nAll right, what's the will of the committee?\nI got a motion due pass from the minority leader.\nI got a second from the minority will.\nAny discussion?\nAll in favor say aye.\nAll opposed, same side.\nMotion passes, unanimous.\nOkay, moving on.\nWe got Senate Resolution 203 from Senator Jones of the 10th.\nHe's not here.\nI don't think he was here at all today.\nWas you Senator Jones from the 22nd,\nyou want to cover that for him?\nYes, sir, Mr. Chair,\nthis is apparently just a study committee\nto talk about a safe firearm storage.\nNo restrictions on firearm,\njust a study how to store firearms\nfor the safety of our children.\nOkay, I know we got a couple of bills going around this year around storage, so is there\nany questions from the committee?\nSenator Doe's all.\nCan I get some clarity on the who's estimated the 5.4 million Americans that's referenced\nin line four?\nI would be able to answer that one.\nIt's not your bill.\nI apologize.\nThat's fair.\nAny other questions for the non-author?\nSenator Roberts.\nInquiry to the chair if possible.\nIs it possible that we could have the author of the bill here and discuss this bill?\nI know there's been a lot of emphasis on this and there's a lot of programs being stood up.\nit up and I don't know if we necessarily need to use taxpayer resources on study\ncommittees. So I'll just love to ask some questions about it. Okay, is that a\nmotion? Yes, sir. I would make that motion. Motion to table does take\nprecedence. Yes, sir. I got a motion to table from Senator Robertson motion in a\nsecond from Senator Dolezal. All in favor say aye. All opposed. All right. Bill\ntable. Thank you Mr. Chair. No problem just back up standing committee. Okay Senator Jones\nof the 22nd we've got SR 323. Yes sir Mr. Chairman this is a dress and\nissue that unfortunately all of us will face at some point in time and that's\ndealing with family caregiving services and it's just to make a determination\nif this state has any rules or restrictions that are out there the\nBut we help alleviate some persons can take care of their loved ones and family caregiver situations\nWhen they have to work another issue such as that. It's one that we're all going to basically face with our parents to maybe with ourselves\nOkay\nAnd if we're going to take action on this bill we will need to\nAmin lines 59\nChanging the year from 2023 to 2024\nor would you agree to that?\nI would agree with that, Miss Sheeran,\nmake motion to that effect.\nAny questions about the underlying bill?\nAll right, what's the will of the committee?\nI got a motion from Senator Robertson to pass.\nI got a second from Senator Anderson.\nWe need to make that a amendment.\nI make a motion to amend, I believe it's line 59\nto 2024, Mr. Chair.\nOkay, so we're gonna strike through the number three\non line 59 and replace it with the number four.\nI've got a motion for that amendment,\nand I've got a second.\nFrom center.\nI got a motion from center albers,\nsecond from the minority leader.\nNo, I'm sorry, I got a motion from\nSenator Jones, second from center albers.\nAll in favor say aye.\nAll opposed same amendment passes all right now to SR 323 as amended I've got a\nmotion to pass all in favor any discussion all in favor say aye all opposed same\nsign. Motion passes unanimous. Good job. Okay. We've got SR 344. Senator Ann\nBhattardi is our sponsor but I believe Senator Dixon are you that I understand\nyou're presenting this? Yes, sir, Mr. Chair. All right. Just rolls in the rules for\nthe first time with his own resolution.\nYes, Senate resolution 344, it would\ndesignate, which we will have to amend this.\nIt will designate May 1, 2024 with change.\nA men line, 24 to change the date on it.\nI believe you got a date on the back as well.\nThere's a date on the back as well.\nOh, is there a need to be a men's job?\nYou got to hit them, so.\nYou know, I'm proud of him and I read a bill.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nYeah.\nAll right, I got a question.\nWhere in the world did you come up with this idea?\nThis was not my idea, Mr. Chairman.\nI know.\nI'm going to just to pile level for you.\nVery high level.\nPure bread, dog day.\nOkay.\nSo what about the muts out there?\nWe just going to throw them under the bus?\nOr did they have their own day?\nWell, Senator Anderson, you could create the unpear bread dog day if you choose.\nYou know what?\nEvery dog loves it.\nI would bet.\nWe have that already.\nSomewhere in code.\nAll right.\nAny other questions?\nI got Senator Robertson.\nSenator Dickson.\nWhat number are you there?\nWhat number are you?\nPlease, Mr. Chairman.\nSenator Dickson, I think you're familiar with my daughter.\nShe's a four-year-old beautiful, small for her age child, and she spends a great part\nof her day with her mixed breed, wolf hound, and other dogs.\nAre you trying to lessen her experience of love by having her dog who is not a pure\nbread, by segregating her dog into a lesser group with your legislation?\nNot at all, Mr. Whip.\nI'd be happy to look at legislation that would create the unpear bread dog day if that\nwould help.\nMore importantly, would you be willing to sit down to my daughter and tell her that\nyou're not the monster that this bill makes you out to me?\nDidn't Teresa text you that question to ask?\nYes, or I had the interpreter on my phone so it converged in English so I could ask.\nUh-huh.\nOkay.\nI think we had another question, Senator Telsaw.\nThe other way, hold on, Senator Dixon, would you like to address the question?\nYes, we'd be happy to sit down with her.\nThank you.\nYes, sir.\nOkay.\nSenator Douglas Hall.\nThank you, Mr. Chairman.\nChairman Dixon, can you please define for the committee some terms I'm seeing on lines\n9 and 10, conservation dogs and on line 10, earth dogs.\nOh, good question.\nI would have to defer that to Senator Anivatar, see if you might answer that.\nThere is your bill, Senator Amertari, you are the sponsor.\nBut he's not the one we got.\nI mean, I see him all dogs are on earth.\nOkay.\nI do have one question for Senator Dickson.\nEven though I'm on my field.\nDo you own a dog?\nI do.\nI own two dogs.\nWhat kind of dogs?\nOne's a purebred lab, and then I've got a actually a golden doodle, so it makes it very, very, very fair across the board.\nSo how's your golden doodle going to fill about this resolution?\nWe had a conversation this morning before I left the house. She was a little upset, but she understood.\nShe was okay with it by the time we left.\nI might get her some counseling when I get home for this weekend or something.\nOkay, there's something to do.\nMr. Chairman, the prototype of the makeup motion.\nWe're getting sideways. I think now would be a great time.\ntime. Mr. Chairman, make a motion. We adopt Senate resolution 344 with the amended changes\nat Senator Dixon. I got a motion of D pass for Senate resolution 344. I need a motion\nfor the amending lines one, changing the 3204 and on line 24, changing the 3204. I need\nmotion. I've got a motion from Senator Watt sent on the amendment. Do I have a second from\nSenator Albers? All in favor of the amendment? Say aye. No, same sign. All right, we're good to go.\nAll right, so we've got a motion for Senate resolution 344 as amended. All in favor say aye.\nAll right, all opposed say yeah, we are ahead of center Alvers second. All opposed say\nme. All right motion passes unanimous those will go to the floor and then to the general\ncalendar from there. So all right, we are going to the adjourn out of standing committee and\nAnd we are going to, that's the word, again, Senate rules.\nConvene!\nThank you.\nSee, that's why I got a vice chairman.\nKeep me straight.\nMercedes, you failed me.\nYou're trying to think of the English word, though, aren't you?\nWhat is it in Spanish?\nConvene.\nComensa.\nComensa.\nWhat is it in Italian?\nInitiana.\nInitiana, da-da-da-da.\nI had the pan-fried meal last night. It was delicious.\nOkay. Now, on.\nRules for consider or I'm sorry bills for consideration.\nYou will see on your sheet, your yellow sheet.\nWe have HP571,\nwhich we are going to have chairman Watson.\nWould you please present that for us?\nThank you, Mr. Chairman.\nThank you, Mr. Chair.\nWhat numbers?\nIt says 1.\nWitness 1.\nW1.\nGot it.\nThank you, Mr. Chairman.\nHouse Bill 571 passed my committee, HHS, last year, came to rules and did not make it\nto the floor.\nIt was recommitted.\nAnd the instruction of the leader, we took up business and passed that out.\nWednesday, and this bill basically changes the update from three years to four years.\nThat's the full update, but every two years, we'll get statistics and data relating to\nAlzheimer's and dementia in the state of Georgia.\nThis is through GARD, G-A-R-D, Georgia Alzheimer's-related dementia, that meets, I'm a member\nof that and we meet every quarter and that has been instrumental in relating to recognition,\ndefining Alzheimer's and dementia in the state of Georgia which as you know is increasing\nthe numbers and also has been helping with recognition and treatment and clinics in conjunction\nwith Emory throughout the state.\nBut all this does is change the updates and changes the dates in there, that's all it\ndoes.\nI'd be happy to entertain any questions.\nI'm just glad to know people are listening to the leader when he said get your bills moving.\nIt's been a lot of that going around.\nHe did. He did. He gets a A-plus, doesn't he?\nSo you get legislative of the week award, maybe? He's in the running.\nHe's in the running. Okay. Any questions from the committee?\nNo.\nHold on. We got to pick it first.\ncan I pick it? Oh sure it's going to count as a pick. My vice chairman would like the\nfirst pick of the 2024 rules committee. Can I see if we can pass HPE 571? We've got\na pick from the vice chairman again. Okay. Let me go through all the bills that are\ngoing to be on the calendar for my name. I've got HB 571. That's all. I got a motion from\ncenter now. Discussion question. Go ahead. I just point a clarification. Any dog that\nhas the habit of putting their face into the ground and coming up with another creature,\nsquirrel rat a mouse or anything else is an earth dog yes sir what about their\nown their own mess no sir it has to be another living breathing animal that they\ncome up with in their mouth what if there's a worm in the mess I think we're\ngetting into biology there and I'm gonna argue that with you just curious all right\nWell, let's stay on topic.\nThank you.\nAll right.\nSo they're here in motion to get this to the floor.\nI got a motion from Senator Alvers.\nSecond from Senator Anna Vitarte.\nAny discussion?\nAll in favor, say aye.\nAll opposed.\nSame sign.\nMotion passed as unanimous.\nHP 571.\nCongratulations, chairman Watson.\nFirst bill of the year.\nYeah, we're doing a house bill hey, I will remind you this is a this actually is a department bill\nSo I would like to do all department bills should any of y'all carry them or should any of them come through your\nCommittees let's get those through quickly\nVette them properly but get them through quickly so that we don't get those caught up towards the end of the session\nLike that has happened in years past\nSo all you department heads out there watching please take note I'm sure all of\nthem wasting their time how dare you how dare you all right meeting a\nGerman y'all drive safe about to get nasty out there\nYou\n",
  "updated_at": "2026-02-12T19:54:02.011152+00:00"
}