{
  "video_id": "ToNpGCB2wY8",
  "url": "https://www.youtube.com/watch?v=ToNpGCB2wY8",
  "title": "Lawmakers Day 35 03/25/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Overview:\n- The Georgia legislature session on March 25, 2025 saw the farewell of Senator Brandon Beach, who was tapped to join the Trump administration as the new U.S. Treasurer. \n- Lawmakers passed several notable bills, including HB 92 extending the deadline for counties and municipalities to opt out or rescind an opt-out of property tax homestead exemptions, and HB 340 banning cell phones in K-8 schools during the school day.\n- The session also featured emotional moments, including a tearful thank-you from a representative who was let go from his job after voting against a bill.\n\nKey Actions:\n- **HB 92**: Extends deadline for counties/municipalities to opt out or rescind opt-out of property tax homestead exemptions\n- **HB 340**: Bans cell phones in K-8 schools during school day, allowing school systems to set their own policies\n- **SB 123**: Defines chronic absenteeism in schools and requires attendance review teams\n- **SB 42**: Increases penalties for sex trafficking of minors\n- **SB 110**: Revises definition of child neglect in Georgia code\n\nBills Introduced (First Reading): None mentioned\n\nNotable Moments:\n- Tearful farewell from a representative who was let go from his job after voting against a bill\n- Representative quoted Bible verse Jeremiah 29:11 after being let go\n\nVotes:\n- HB 92 passed 52-2\n- HB 340 passed 54-2 \n- SB 123 passed 160-1\n- SB 42 passed unanimously\n- SB 110 passed 100-69\n\nAttendance: No quorum notes\n\nAdjournment: No specific adjournment time mentioned, but the House and Senate will return on Thursday and Friday this week.",
  "transcript": "I really do look forward to serving in this next role as Treasury of the United States.\nYou went up first, got to call a couple of Saturdays ago, I wasn't sure they dialed the\nthe right number because I was expecting something in transportation or commerce, but after\nI talked to him and they said that the boss wanted me to be the treasurer, I said, yes,\nI'll accept.\nSo it's going to be a great opportunity.\nIt's going to be life-changing, going to Washington, DC, but I will never forget you guys.\nI'll never forget where I came from and thank you for all you've done for me.\nThank you very much.\nThe Trump administration taps a member of the Georgia Legislature to join his administration\nafter more than 10 years serving the Alfa Reda area, Senator Brandon Beach heads to Washington\nas U.S. Treasurer.\nGood evening and welcome to lawmakers on Georgia Legislative Day 35, I'm going to allow\nher in Atlanta, more on Senator Beach in the action at the Capitol coming up.\nTonight we're going to dive into a legislative smorgasbord of issues under consideration under\nthe Gold Dome.\nNew lawmakers will discuss issues dealing with small businesses and big corporations too\nas we examine workforce, housing and community development legislation.\nWe'll look closer at the Homestead Exemption Bill that passed in the Senate but is headed\nback to the House for another vote.\nAnd as things wind down at the Capitol, the debate continues over some of the big issues,\nsuch as the Religious Liberty Bill.\nFirst, let's get today's Capitol report from Sarah Callis.\nHi, Donna. Tears and both chambers today, but for very different reasons.\nIf you look in the bottom left hand corner, it will have the name of the Treasury of the United\nStates at the bottom left hand corner. And that will soon have displayed Brandon Beech's name on it.\nSo let's get Brandon to be round the call.\nThis Senate said farewell to one of their own this morning as Lieutenant Governor\nof Senator Brandon Beach as the Trump administration's new U.S.\ntreasurer.\nI love this institution, the Senate.\nI love this chamber.\nI love the people in it.\nAnd it's a great body.\nAnd it's going to be a great memory for me to know that I served\nin this Senate chamber.\nThe legislators voted on eight house bills.\nsome of the more notable bills,\nHB 92, which would extend the deadline\nthat counties and municipalities can opt out\nor rescind an opt out of,\nthe property tax homestead exemption.\nWe've given some more opt-in opportunities.\nThere wasn't an opportunity to opt back in.\nWe're letting that be done on an annual basis\nas of March 1st.\nIf people want to opt back in,\nand this year we're extending it to April 30th\nfor those that may want to.\ndoing their some reasons they might want to. And then we have that they will revisit that decision\nif they don't have anything in place in 2027 as well. The bill was passed 52 to 2 and HB340.\nThe Distraction Free Education Act would ban cell phones from K through eighth grade schools\nduring the school day, allowing each school system to set their own phone policies.\nresearch shows it takes over 23\nminutes to regain focus after a\ndistraction, meaning many students\nnever fully get engaged in their\neducation. Our teachers are seeing\nour teachers are seeing the\nimpact first hand. Over 85% of\nhigh school teachers and 68% of\nmiddle school teachers report that\ncell phones are a major problem in\ntheir classrooms. The bill was also\nRemoving phones creates a safer school environment.\nIn an emergency, we want our kids\nfull and undivided attention, clear phone lines,\nno misinformation, kids listening to teachers,\nkids listening to school resource officers.\nIf God forbid there's an incident in the school,\nI want my child, in your child,\nto be able to follow instructions very clearly\nwithout distraction to get out of the building,\nget out of a classroom and be safe.\nDespite concerns from some Democrats over parents being able to communicate with their\nchildren in an emergency, the bill was overwhelmingly past 54 to 2.\nIn the house, a tearful thank you from a member.\nBut I want to thank you.\nThis is a family in here and you won't believe the calls and the text I've had while it's\namazing and I can't tell you how much I appreciate it if you if you get the chance\nread Jeremiah Jeremiah 29 11 for I know the plans I have for you the\nclassic Lord plans to prosper you and not to harm you and plans to give you a\na whole future. Yes. Smith was let go from his job at the Harris County\nChamber of Commerce after voting no on the tour reform bill last week. The\nhouse then took up several bills dealing with public safety and children.\nSenate bill 123 defines chronic absenteeism in schools and lays out a plan to\naddress it. While this is not going to fix chronic absenteeism, this is a\nstep in the right direction. We're stating that if a district as a whole has a\nrate at 10% or higher, they have to have an attendance review team. And if a\nindividual school has a rate of 15% or higher, they also have to have a\ndedicated review team. Mr. Speaker, that is the bill. It passed 160 to one. And SB\n42, First Lady Marty Kemp's 10th bill related to human trafficking would\nincrease penalties for sex trafficking minors. It passed unanimously. At\nleast two courts in Georgia have indicated that the Georgia human trafficking\nstatute for minors that we passed last year, is similar to the PIPPing and PAN during\na minor statute, which carries a lesser sentence. So this bill will fix that in order to make\nsure that we have the more serious and more of a punishment for those that are sex trafficking\nand human trafficking are minors.\nThe house also passed SB 110,\nwhich would revise the definition\nof child neglect in Georgia code.\nThe bill was written after a Georgia woman\nwas arrested for child neglect\nafter neighbors saw her 10 year old son\nwalk down the road unsupervised.\nWhen I was growing up,\nmy mom would send me into a store to buy something,\nwould potentially, you know,\nI'd walk down the street to go to a friend's house\nand with what we've seen in particularly in the media,\nwith the reporting around this, the concern that rises here is that parental autonomy\nthat allows for a child to develop a sense of independence, the ability to think for\nthemselves to really develop and mature, sorry for the feedback here, but that may be subject\nto interpretation by law enforcement or authorities inconsistent with the parent's rights and\nresponsibilities.\ndespite some pushback.\nMr. Speaker, is it not true that parents who are accused\nof neglect often believe that they have not been\nneglectful?\nThe bill was passed 100 to 69.\nNo session tomorrow, Donna, is committee meetings\ntake priority.\nThe House and Senate will both be back on Thursday\nand Friday this week.\nThat's my Capitol report.\nThanks, Sarah.\nWe're going to talk about the homestead exemption\nand small business issues with two lawmakers\nfamiliar with what it means to own a business.\nJoining the show is Republican representative Ron Stevens\nof Savannah.\nHe chairs the House Committee on Economic Development\nand Tourism.\nAlso here is a member of that committee,\nDemocratic Representative Solomon Adesanya of Marietta.\nHe's also on the business development\nand governmental affairs committees.\nWelcome to lawmakers to both of you.\nThank you.\nSo, Representative Stevens, I'm going to start with you.\nLet's begin with what happened to date in the Senate\nwith the Homestead Exemption Bill,\nwhich is HB92 and it requires governing authorities\nlike school districts to opt out\nand it gives them the ability to do that\nand extends the time for them to do so to April 30th,\nwhich I think was gonna be around the 1st of March\noriginally.\nYou've had interest in this type of legislation for 25 years\nand you have a paper to show it,\nwe're gonna show it up on the screen,\nbut you brought it with you.\nI did, I did.\nIt's funny, it's been 27 years.\nyears ago, we started trying to come up with a mechanism that would not be a burden to\nthe taxing authorities, but also be able to essentially freeze property taxes. And we\ncalled it then, it was, I was in the minority, we called it Stevens Day, because we were\nthe first to come up with the idea. And it's taken essentially 25 years for the rest\nof the state, if you will. But up until that time, we've had 60 tax\nand districts to also adopt the same procedure.\nIt's been a fun ride, it's been an amazing windfall\nfor the homeowner, especially those that want to live\nin their home and retire in their home.\nAnd I don't think in our area anyway\nwith the increase in assessments and homes,\nit was very hard for people to stay in their home.\nSo it's a big deal.\nExplain this a little bit.\nSo what happens is that the school districts\nand other governmental bodies will have the option\nthat thing about it is they're trying to figure out\nwhat they're going to have the money\nwith this homestead exemption.\nAnd that's the beauty of this thing,\nwhenever exactly the way that it was back\nand 25 years ago, is no revenue was lost.\nAnd in addition to 581,\nthey placed a cost-living index on there.\nSo you get exactly the same revenue as you had the previous year,\nplus there's a cost-living bump in it.\nSo it's a great deal.\nOkay, so you voted for it, represented at Assignia.\nSo tell us about your thoughts on it.\nI think it's on help for every time you have a bill\nthat helps Georgians, Democrats,\nwe have fought hard to create an economy\nthat works for everyone.\nWe also understand that it's important\nthat we have a system where people are not just struggling\nto get by, but they can actually get ahead.\nevery opportunity we have to advance the will of the people.\nI'm always on the supportive of it.\nOkay, so it'll go now back to the house.\nThey have to look at it,\nbut it seems pretty good that it's gonna pass on that.\nSo I wanna move on to something else.\nYou have your small business owner.\nTell us about what your business is\nand what legislation you're interested in\nfor small businesses.\nYes, so I'm a restaurant owner.\nI have three restaurants in the metro area.\nIt's called Kale, Mikrezi, who sells salads.\nYes, we sell salads, organic and healthy food.\nAnd it's important to support small businesses.\nWhat I'm pushing back on is the increase in tariffs\nby the other party, mainly from the federal down.\nThat's 25% of you look at the imported goods to the US.\nChina, Mexico, and Canada account for 40% of the goods\nthat are inputted into the country.\nSo imagine I've been at 25% entirely from those,\nthat is going to crush, it's really going to crush people.\nAnd inflation has been rising over the last three months.\nI don't think it's a way to do it.\nI think it's misguided.\nAnd I, by and large, think that we have to push back\nand create an environment where businesses can thrive.\nBecause at the end of the day, it passes down\nto the consumers, and they're the burden,\nthey're the ones carrying that burden.\nYeah, so you're really worried about what's gonna happen.\nWe're gonna have to wait and see though.\nAbsolutely.\nOkay, well, I'll come back to you in a moment.\nRepresentative Stevens, you have two bills\nthat deal with something different.\nWorkforce, housing and community development.\nHP317 and House Resolution 192.\nThere's lots of development along\nGeorgia's coastal area.\nYou're from the Savannah area,\nespecially with the Hyundai Meta Plant coming in.\nSo is your legislation looking to help\nmanage that workforce a little better?\nA good bit, you know, as you know,\nWe've got 159 counties in Georgia.\nOur neighboring state, Florida, has 67.\nYou can imagine the problem of trying to plan and get infrastructure to all these areas\nwith so many counties.\nAll the bill does is it allows for what our neighboring states already do, and that's\nto allow bonds to be sold and to folks with private investment to extend infrastructure\nwhere it's needed.\nwill be able to even accumulate several counties\nto come under one umbrella, if you will,\nfor this WRID, and it should extend infrastructure\nand create economic development,\nwhere some of the counties are so small,\nthey really don't have the wherewithal to do that.\nAnd so you want something that will oversee all of that?\nSome kind of...\nIt's a private investment,\nand only for the infrastructure,\nbut it has nothing to do with cities or counties\nand the governing part.\nAll this is a bond mechanism to fund it.\nWhat's as funded?\nThe counties or cities take it over and it goes away.\nTell us what's going on down in the Savannah area with the mega plant coming in.\nThe meta plant, I should say.\nThey're starting, you know, tomorrow they're doing the ribbon cutting.\nIt's a big, big day.\nIt's close to 3,000 acres and for those that have ever gone to Savannah, if you can picture\nTyvy Island, the island itself will fit on the footprint of the Meta plant.\nSo it is a massive, massive undertaking.\nIt's about 12 and a half times larger than any project we've ever done in state of Georgia.\nIt's going to create about 18,000 jobs, I believe, by the time it's all over.\nIt is probably the biggest economic development project by far that we'll see in the near\nfuture.\nAnd it's going to give these folks in the fastest growing county in the state that we have,\nwhich is Bryan County.\nIt's gonna give those folks an opportunity to have jobs\nand I have to leave the state.\nWow, I've been by there.\nI can't believe there's a ribbon cutting tomorrow.\nSo they're finally getting there.\nIt is enormous.\nYou drive and you drive and you're still passing it\nwhen you're down there.\nSo we'll keep up with what's going on with those bills.\nRight now, they're where?\nRight now, we wanted to hold them back.\nOkay.\nThere are 54 pages as one of the bills.\nSo we wanted to make sure that we've added it well\nand we'll have a vote next year.\nOkay, all right.\nI know there's some other things you want to talk about.\nGo ahead.\nYeah, so it's House Bill 394.\nAnd that's pretty much to increase the minimum\nweights to $15 per hour.\nRight now, Georgians are struggling.\nAnd we've got to recognize that.\nI am a business owner and I can tell you\nthat I recognize that challenge.\nI recognize that issue and all of my employees\npretty much make over $15 per hour,\neven though it's a low-skid job.\nBut we also have to encourage businesses and industries\nin Georgia, and by way of doing that,\nlegislature has to come up with a bill\nthat we can advance to say, hey,\nthis is the minimum wage that we're going to have in Georgia.\nI have a lot of my employees.\nAnd people, even at that, the $15 per hour,\na lot of them have to work two jobs to survive with kids.\nAnd with the way it is now in schools\nwhere we're not offering launches at school,\nIt's difficult for people to get by.\nLayoffs and people losing their jobs all over the place.\nWe've got to, as a legislature,\nset the tone by saying,\nthis is what we want as the minimum wage.\nAnd that's how we can actually\nencourage Georgians who, you know, are hardworking.\nYeah, so this session,\nyou're not expecting anything to happen on that, but.\nYes, sir.\nYou're keeping hope alive.\nThat we are, I am, you know,\nand that's, you know, what I think we're here\nand sent to do, keep pushing, keep fighting,\nkeep advocating for the issues that matter to the people.\nWe didn't get any hearing, it was a bill\nby a representative on McLean, by the way.\nIt didn't get any hearing, and he's been\nan advocate of fears, advocate for labor union and wages\nand ways to advance the agenda of the people.\nAnd we're going to keep fighting for it,\nnext year is going to be another year,\nand we'll push that through, hopefully.\nWe'll have you back on then, thank you very much.\nThank you both for being here today.\nThank you.\nThank you.\nSo coming up, we have two house members\nfrom different sides of the aisle.\nAnd they're gonna give their thoughts\non legislation dealing with tort reform,\nreligious freedom, and transgender athletes\nand women's sports.\nYou're watching Lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the State Capitol during the session and year-round,\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen.\nI don't fear anyone.\nThis was a woman.\nPeople wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it by acknowledging our own worth.\nOh, please, don't continue.\nThis is the first time you've ever had a child.\nYou've never had a child.\nYou've never had a child.\nthe past gives a sense of the future.\nThis is the first time that anyone has seen this in 2000 years.\nThis is amazing.\nPompeii is a battle against time.\nYou think I'm joking, but look at this, it really happened.\nDon't let anybody tell you who you are.\nHistory teaches us to honor the past.\nWhen you look back, they're like, wow, that was pretty special.\nThis is something that's actually altering the course of history.\nYou're charged with keeping these stories alive.\nWelcome back to Lawmakers, I'm Donna Lowry.\nAs the session wraps up, the controversial bills that passed on each side of the capital\nare now undergoing review by the other chamber.\nWe're going to talk about some of those bills with two legislators who've seen their share\nof action under the Gold Dome as a signi-dial for which is.\nJoining us is Democratic Representative Derek Jackson of Tyrone.\nHis committees include defense and veterans affairs and regulated industries.\nSo here is Republican Representative Trey Kelly of Cedar Town.\nHe's Vice Chair of both the Health and Way, Health and Ways and Means Committees.\nWelcome to Lawmakers to both of you.\nAppreciate you being here.\nGreat to hear that.\nSo let's start with one of the controversial bills.\nYou both voted no.\nSB 68, the lawsuit, overhaul, or tort reform bill.\nOf course, that's the one that Governor Brian Kemp has as a priority and I want to get\nboth your thoughts.\nI'll start with you, Representative Kelly.\nNo, thank you for having me to that.\nAnd frankly, I don't feel it's productive for me to unpack\na couple of the reasons that I voted against the bill.\nBut what I want to focus on is looking forward,\nsomehow I'm extremely proud that Speaker Burns has announced\nand is leading on, which is holding\nour insurance company's accountable moving forward.\nWe heard a lot of conversation during this debate\nfrom hard-working George's and my district\nabout wanting to see their insurance premiums go down.\nAnd I think the Special Study Committee\nthat Speaker Burns has initiated\nis a logical next step in this process,\nSo I'm proud to see us lead on that a lot of people want to see something done on insurance your reasons for voting against it\nWell, I voted no because it negatively impacts not only citizens but the victims, you know when\nIndividual gets injured\nYou should have a remedy and that remedy should be decided by the jury\nSenate bill 68 will deny the jury for making sure that the victims are made whole\nBut also, Senate Bill 68 will not change insurance premiums.\nAnd so you cannot advertise that Senate Bill 68 is going to reduce premiums where there's\nnothing in that bill or any of the eight sections that will certainly impact or decrease insurance\npremiums.\nWell, we'll see what happens, but thank you both for talking about that.\nRepresentative Kelly, and I'm going to move on another thing.\nThe House Judiciary Committee is looking at SB 36, the Georgia Religious Freedom Restoration\nAct. In 2016, you voted in favor of a similar bill. The House Judiciary Committee will once\nagain look at SB 36 tomorrow after hearing hours of testimony earlier, well, actually last\nweek. What are your thoughts this time around?\nWell, I was proud to support it in 2016. I'm proud to support it now. This is an important\nbill, but it shouldn't have to be controversial. This is something that 39 states currently\nhave in place in law. This was a policy that was championed at the federal level by President\nBill Clinton. What we're simply seeking to do is make sure our exercise of religion, our\nFirst Amendment protection exercise of religion, has the same protection that the other four First\nAmendment rights have. It simply protects those who want to exercise their religion in the same\nway that we protect freedom of speech, freedom of the press, our right to assemble, and the right\nto petition our government.\nI think our freedom to practice our religion\nis just as important as those other four rats,\nand I think that's worth protecting.\nYeah, but back then, then Governor Nathan Diel\ndid veto it, so we'll see what happens.\nI do wanna get your thoughts on it\nbefore we go any further.\nListen, we already have religious freedom, right?\nI'm a retired naval officer.\nThe Constitution always already guaranteed us\nreligious freedom, but Senate Bill's 36,\nand you already mentioned Governor Diel why he vetoed it.\nAnd the reason why I continue to fight against bills\nsuch as this, because it would divide us.\nNo one should be able to use their religion to discriminate.\nAnd this bill will allow that.\nSo we need to have legislation to bring us together,\nnot separate us.\nI remember back in 2016, the fear was\nthat there would be businesses not coming into Georgia.\nThey boycott Georgia because of it.\nWhat do you think?\nWe've heard that song in dance before.\nAnd they said that with our election bill,\nand it didn't happen.\nThey canceled all started gaming, it's back.\nAnd so I think that's a little disingenuous by our businesses.\nI think it's an issue if some of our spokesman's\nfor our business community make it an interest.\nFrankly, they're not leaving 39 other states\nand I would hope they wouldn't leave the number one state\nin the nation to do business over the last 11 years.\nYeah, what are your thoughts on that?\nWell, I think the political climate is different.\nI mean, you see in citizens right now\nwho are mad and upset and if businesses\nor starting to take on a principle that goes against the\ncitizens, they'll end up being boycott.\nI mean, let's look at target right now.\nTargeted and lost $16 billion because they started doing\nsomething that goes against those who were patronizing\ntarget.\nSo I think the political climate has changed.\nCitizens are upset if this bill goes through not only\ncorporations will go against Georgia, but the citizens\nof Georgia will go against Georgia.\nAnd we'll see what happens.\nFirst of all, we have tomorrow morning\nto see what happens in the hearing.\nOkay, we're gonna switch gears again\nand get into controversial legislation\nthat would ban transgender athletes\nfrom playing women's sports.\nThis afternoon, the House Education Committee voted\nto pass SB1 out of committee.\nNow it's now a compromised bill\nthat incorporates aspects of HB267 that passed in the House.\nAnd for instance, SB1 now is called the Riley Gaines Act.\nThe name representative Josh Bonner gave it in the House\nand Representative Jackson,\nyou voted against the legislation in the House?\nWhy?\nYeah, I voted against this because this is another piece\nof legislation.\nAgain, we'll discriminate.\nThis will specifically discriminate against those\nin the LGBTQIA plus community.\nWe don't need legislation here in Georgia.\nThat's going to divide us.\nThe other reason why I will continue to fight against\ntreacherous bills such as this is because no,\nthere's nowhere in Georgia that indicates\nthat this is happening.\nWe even talked to the NCAA\nthat has 510,000 student athletes, 510,000,\nand they said they only had nine incidents.\nAnd so this is a bill that's looking for a problem\nand that problem does not exist in Georgia.\nWhere was it in Cali?\nWith all due respect to my Democratic colleague,\nthe Democrats are searching for problems\nto find what the common sense piece of legislation.\nThis is about making sure that biological males\ndon't compete against biological females.\nWe have title nine protections at the federal level\nthat were established to make sure\nthat our daughters, our sisters,\nour, you know, mothers looking back historically\ndidn't have to compete unfairly with males.\nAnd that's something that we need to continue to fight for\nis something that we need to address being proactively.\nAnd I'm proud to see the House lead on the Riley Gaines Act.\nWe have seen unfortunately our daughters\nand young girls who spent their whole lives\ntraining his athletes, finally reaching the pinnacle\nof their careers, only to be not down by logical males.\nAnd that's unfortunate and it's uncalled for,\nand it's something that the citizens of Georgia\nwill not tolerate any longer.\nYeah, well, it certainly had the support in the House\nand the Senate because you had the two bills,\nwhat are you thinking is going to happen next?\nI think you're going to find Democrats\nsuch as myself continuing to fight against it.\nAgain, the Georgia High School Association said\nzero incidents, and then again, the NCAA said out of\n500,000, only nine incidents.\nCome on.\nSo what?\nIt's not happening.\nI wanted to ask you, so are you happy with this\ncompromise between the two chambers?\nI think it's an important issue, and I think it's good\nthat Georgia leads on this.\nI'm glad that we're not waiting for a problem to develop.\nThis week in Oregon, a biological male in a high school\ncompeted in a track race against one of the top biological\nfemales in the state, and beat her by seven seconds.\nWe have different classes, and we ought to be proactive\nin Georgia.\nI think that I don't ever want a single female in Georgia\nto have to experience that heartbreak because a biological\nmale felt like he couldn't compete in his classification\nand came over to hers.\nI think we struck a good compromise.\nI'm proud to see the Riley Gaines Act move forward,\nand I look forward to supporting it on the floor.\nYou were gonna say?\nI'm just saying, this legislation\ndo not even mention the word safe.\nThey say it's for safe to have safe woman and girls sports.\nThey don't even mention the word safe.\nAgain, this is a bill that's gonna divide us.\nIt's, and we're not organ.\nThis is Georgia, it's the same incident.\nAnd we don't ever want to be, and it's common sense.\nIt doesn't have to say safety.\nIt's common sense that lacrosse, rugby, soccer,\nAny of those wrestling, we don't want biological males\ncompeting with biological females.\nThat's common sense.\nIt doesn't have to be in black and white.\nThat should be something that's strong\nwhen each of our hearts.\nI got two sons that play football, Donna,\nand then I try to play football against women.\nThey play football for Duke,\nand another one plays at Kennesaw.\nThey play against other young men.\nAnd so as far as you're concerned?\nThe problem doesn't exist.\nand it should never.\nOkay, I think you agree on that part of it.\nYeah.\nI was trying to get in,\nI don't know if we have really quick,\nyou have HB196 to deals with pharmacies.\nCan you explain that in just like 20 seconds?\n20 seconds, it will help our Main Street frontline,\npharmacy health care workers stay open,\naddress some of the schemes that have been played\nby our PBMs to protect our independent pharmacies,\nproud to support it.\nThat's the issue we can both agree on,\nboth supported it and looking forward\nAnd it has to do with those coupons and all the discounts people get on one\npharmacy.\nAll right.\nWell, I appreciate you both being here and giving me your opinions.\nAll right.\nThat does it for lawmakers tonight.\nIt's a committee day at the Capitol tomorrow, so we won't have a show.\nSo join us on Thursday when we'll talk about Georgia's move to change the way it's 9-1-1\nsystem operates.\nHave a good evening.\n",
  "updated_at": "2026-02-12T12:14:09.728638+00:00"
}