{
  "video_id": "TzRnRlh3Aw4",
  "url": "https://www.youtube.com/watch?v=TzRnRlh3Aw4",
  "title": "12/18/2025 Joint Senate Judiciary Committee and House Judiciary Committee",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 42,
  "summary": "Overview: This appears to be a joint session of the Georgia Senate and House Judiciary Committees to consider nominations for the new Georgia Tax Court. The session focused on the qualifications of two candidates - Emily Youngo for the Clerk of the Business Court position, and Frank O'Connell for the Chief Judge of the Georgia Tax Court.\n\nKey Actions:\n- No specific bills were passed or referred.\n\nBills Introduced (First Reading): \n- None detected\n\nNotable Moments:\n- The session began with an opening prayer.\n- The committees heard presentations from the two candidates and asked them questions about their backgrounds and qualifications.\n- There was discussion about the importance of the new Georgia Tax Court and the need for qualified leadership.\n\nVotes:\n- No recorded votes mentioned.\n\nAttendance:\n- The committees noted they were waiting for a quorum on the Senate side before taking any action.\n\nAdjournment:\n- The transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nfour years. All right. I think this mic is yours. Thank you. Is that right? Yeah. Sounds like it. All right. Ladies and gentlemen, we are going to go ahead and start the meeting and hope for a quorum.\nLet's see where Matt go. He was ready. He was ready.\nthis time of year especially with the holidays coming up I think we need a\norder prayer to get us going so you don't mind let us pray dear Lord thank you\nfor this joint session the House of Senate Judiciary committees thank you\nfor the work that's been going on the last few weeks get ready for the\nsession the starts January the 12th which we put up on the altar to you we\nThank you for this holy Christmas season.\nThank you for new year.\nWe pray for a wisdom, justice, and moderation\nin the weeks and months to come in Christ's name, amen.\nAmen.\nAll right, before we get started,\nI want to make sure everybody's had an opportunity\nto look over the, I guess, biographical information\nof the two parties that we're going to be dealing with today.\nEverybody got a chance to look at it.\nAll right.\nWe're going to start out with Miss Younggo, if she's here.\nCome on up.\nBig chairs.\nAll right, Miss Younggo, I haven't done a lot of these.\nSo I think if you have anything you want to tell the committee\nbefore we get started here.\nSure.\nSo my name is Emily Youngo.\nI'm here for the clerk of the business court position.\nAs you know, court administration, as you can see from my resume,\nI've had 10 years of service over in various roles,\nserving Georgia's judiciary, had the honor\nof working with Chairman Gunter when he was a judge.\nWhen I served with our superior court judges,\nand some of you as well when we were dealing\nwith legislative matters.\nBut general court administration is really my bread\nand butter, what I enjoy.\nSo it would be an honor to work with Judge Hammerick again\nand serve our stage due to sheering that way.\nIf you have any questions, I'd be happy to answer them.\nDoes that work for you?\nMembers of the committee, my past history,\nno one Miss Youngo and the quality of work\nthat she does is I consider that very high work\nand she's always done a good job, so anybody have a question?\nquestion. I don't think we can vote just yet. All right. You want to call up the next.\nWe have a question. Oh, okay. Sorry. You've got an impressive resume. I see you worked\nfor five years for former Justice Namias and then also Senator Johnny Isaacson. I did.\nAmong many other courts and elected officials and definitely and impressed with your background.\nThank you, thank you very much.\nAll right, got one more, 18.\nI'm looking at your resume, and I know typically when you put things on your resume, you want\nto put things that are impressive.\nWhy did you decide to put this you graduated from Auburn University on your resume?\nYou know, it's funny.\nI actually did think what questions I might get, and it's funny I did, consider that to\nbe a question I might be getting.\nYou know, dealing with Judge Hammark, you have to have someone that can give a war eagle\nhere and there.\nSo I figured that was actually a plus for him, but I do understand for some of the people\nin this committee that that might be a con, but I'm very proud of my education at all.\nThat's true.\nThat sure could be work.\nAll right.\nYou're off.\nAll right.\nI think that's all the questions.\nThank you, Ms. Younggo.\nAll right, so now we will move on to the presentation from Frank O'Connell, who's currently our\nrevenue commissioner for the state and just a little bit of background.\nWhen we created the new tax court, we include the same type of confirmation process like\nwe see we have for our business court where we have to approve the judge for the court\nhas been appointed by the governor and as chairman Gunter as reference we we're here\nas a joint group because the law allows the chairman at their discretion to call this\nas a joint hearing and so at this time we will also now call up Mr. O'Connell if you\nwant to come up and introduce yourself and we'll also take questions from the committee\nWe will hold on the action as we try to make sure that in the Senate's side we get a quorum\nGood morning\nGood morning\nIf it's a please the chairman. I'd like to make a couple of remarks. Yes, sir the floor is yours\nWell, thank you, Mr. Chairman and members of the committees for having me here today\nMy name is Franco Connell, and I'm honored to appear before you today as Governor\nKempst nominee to serve as Chief Judge of the Georgia Tax Court. I'm also honored\nto be joined today by some of my friends and colleagues from over the years, and I'd\nbe remiss if I didn't mention my wonderful wife, Sheila, without her support. I\ncertainly wouldn't be here today.\nWell, my job has been difficult, but a real privilege\nto serve my wife as one of our state's health care heroes\nand her job is definitely more difficult in mine.\nI started at the Department of Revenue almost 23 years\nago and served in a number of positions,\nincluding General Counsel, Deputy Commissioner\nnow Commissioner. Before that I worked in public accounting for 10 years. I've been a member\nof the bar for almost four decades since graduating from Notre Dame Law School. And speaking\nof Notre Dame, well my alma mater may have sat out the bull season this year. I have never\nsat out when it comes to addressing difficult or complex legal questions and I don't plan\nstart now. My view on being a judge and a commissioner is very similar. Neither role makes\nme a politician or a policymaker. Instead these roles are meant to interpret or apply the\nlaw as drafted by the General Assembly and signed by the governor. As Commissioner, Deputy\nCommission and General Counsel, I have occasionally seen areas where the law or the department\nwas not applying the law correctly in my view. And we have worked to address that through\nlegislative cleanup bills, policy bulletins and regulations. At the department, I've also\nhad the privilege of working alongside other agencies on economic development. We've held\ncountless calls with businesses looking\nto invest in Georgia or expand their operations\nin our state.\nAnd in those calls, I can say that I consistently\nhear how one draw for these businesses who are\nconsidering coming to Georgia is our stable regulatory\nenvironment.\nGeorgia businesses and Georgia families\nneed stability as they plan their futures here\nin the state.\nTaxes are a necessary part of our society,\nbut they're also a major line item in everyone's budgets.\nMy commitment to you, for as long as I'm chief judge,\nis that our rulings will be clear and reliable,\nbecause that is what our taxpayers in the state deserve.\nThank you again, Chairman, for having me today.\nAnd thank you to our governor for nominating me,\nand now I stand ready to answer any questions.\nThank you, Commissioner, and appreciate your service\nto our state throughout your career.\nAnd I know this kind of moves quickly today,\nbut it's such an important role.\nI think the citizens of our state\nneed to have a court like this set up this independent.\nAnd I think it's such an important role for those\nwho have to go in front of you with this new court\nthat we've set up.\nand I'd appreciate your willingness to serve us\nas citizens in this capacity.\nYou do have a question from the committee,\nSenator Karpatcher.\nThank you so much.\nI'm very thankful that we're gonna finally get\nthis court going and also thankful that we have\nsomeone as qualified as yourself\nto put yourself out there for the position.\nI guess my question is just about the backfill\nfor the position that you're leaving.\nSince I've agreed to carry a bill for your current agency,\nI would like to know that you have a solid succession plan.\nYes, and of course that has been discussed\nwith the governor's office and they've asked\nfor my opinions on things and I think shortly after\nthis concludes the governor's office\nwill announce the succession.\nSo, yes, a lot of thought has gone into that Senator.\nChairman Tillery.\nThank you, Mr. Chairman.\nO'Connor, your credentials are impeccable.\nYou've done this for a long, long time.\nWe look forward to seeing you, hopefully, in this role.\nI have a question, the new court,\nbut clearly what we've also done\nis move an admin court now into a judicial role.\nWe've moved it out underneath the executive put it\nin the judicial branch.\nWhat role then do you think starry decisis should play\nin your decisions?\nDo you think you're just completely new court\nand it's all new or do you think that there is some role\nfor starry decisis in the, from the decisions\nthat came from the tax tribunal?\nWell, certainly as far as starry decisis,\nthe statute provides that it applies to the tax court\nand the tax court needs to follow its prior decisions.\nI don't think it makes it clear whether the tribunal decisions have that same status,\nbut certainly before deviating from accepted decisions and laid down decisions, there\nshould be a very good reason to deviate, so I would expect to follow the prior decisions\nof the tribunal.\nAbsolutely.\nSome statutory reason, otherwise.\nYes, or it were some higher judicial decision. Yes\nRepresentative Reeves\nThank you chairman\nYou know, I've met some people who've studied broad some people who went to animal IU some people who've done tax at Georgetown\nYou've done it all you did Ireland Quebec Georgetown\ntax\nCourses in addition to getting your degree from NYU tax so very impressed without as I was driving down\nhere today from going out thinking about insurance later today that we'll be\nworking on two things came to mind with tax court number one from doing some\nlocal property tax thing and reading some decisions usually the\nterminology is you know government and taxpayer and moving into the\njudicial rollout occurred you look at the individual cases there's a person\nthere's a citizen or a small business who's an employer who purchases goods and\ndeliver services and there's a story behind that and these tax decisions, it could wipe\nout a whole year of hard work or decade and so they're not just a taxpayer, there's\nan individual story with a lot riding on these cases and I know you'll look at those\nindividually as a judge and then secondly one case that came out this year, Chief Justice\nNells Peterson wrote at the Eternal Vigilance Action Case, a comment you made sort of\nfollow it up on that about you've got the general assembly making the law you\ngot the governor signs it and then the judges interpret it agency rule making\ndefinitely you know look at what did get passed and keep the citizens on on a\nlevel playing field with agencies don't don't have a bunch of things made up\nthat aren't in the law that go against the citizens in these cases stick to\nwhat's in the books, just as that Chevron,\neternal vigilance action case said this year\nfrom the George Spring Court would definitely come in\nthat decision too, as well as the federal U.S.\nSpring Court Chevron battle that went on for decades\nand it said, let's have citizens on a level playing field\nwith the government not having the government\nhave deference at the agency level.\nYes, sir.\nAnd I very much respect that was here when the statute\nwas passed a few years ago.\nI guess the department used to argue\nbecause the law allowed us to, for deference to anything\nthat we wrote and someone went\nso far as to say, you know, a position\nthat our attorneys came up with on the way down to the court.\nIt wasn't quite that broad, but now it's limited\nto the regulations that are properly promulgated\nand really that is the most that should get deference.\nAnd sometimes those regulations go a little bit\nfurther than they should and I and I know that because there was one that I was\nworried about for well before I came to the department and got that one\nchanged a couple years ago at the urging of members of my advisory committees\nand it really led to a trap for the unwary and I'm really glad that that's\nfixed. You hear questions from the committee. All right thank you\ncommissioner we have a quorum now for both committees that are present so at\nthis time the chair will entertain a motion and I believe the proper motion will be a motion\nto accept. Is that the correct Mr. Walker? Do we have any motions from the committee?\nWe have a motion to accept the nomination from full leader hatch. I guess you have a\nwringer in here with a full leader. So a full leader right? Get that job. Okay. And we\nWe have a second from Representative Mata-Han.\nAny discussion on the motion?\nAll those in favor of the motion, please raise your hand.\nIt is unanimous.\nCongratulations.\nThank you very much, Mr. Chairman and members of the committee.\nI greatly appreciate it.\nThank you for this opportunity to serve.\nYeah, thank you.\nAll right, I'll turn it back over to Chairman Gunter.\nI'm going to go to the office.\nThis is the office.\nPlease.\nHere's the\noffice.\nHere's the\noffice.\nHere's the\noffice.\nHere's the\noffice.\nAll right, we do have a quorum, both committees.\nSo anybody have a question for Ms. Younggo before we actually vote on her?\nSeeing that, all those in favor of Ms. Younggo taking this, I'm sorry, I need a motion now.\nGot a motion, who's got a second?\nSecond?\nAll right.\nsecond any further discussion all right all those in favor raise your hand and\nit looks unanimous thank you and we're done\nEVEN'S GO.\n",
  "updated_at": "2026-02-12T18:36:44.028732+00:00"
}